{
    "rating": 8.6,
    "release_date": "2003-12-17",
    "num_reviews": 570,
    "genres": [
        "Fantasy",
        "Adventure"
    ],
    "summary": "The culmination of nearly 10 years' work and conclusion to Peter Jackson's epic trilogy based on the timeless J.R.R. Tolkien classic, \"The Lord of the Rings: The Return of the King\" presents the final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Hobbits Frodo and Sam reach Mordor in their quest to destroy the `one ring', while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith.",
    "reviews": [
        {
            "content": "Best Trilogy!! \nNEED THEM REPLAYED MORE!",
            "review_date": "2023-04-20",
            "source": "rt"
        },
        {
            "content": "Undeniable masterpiece",
            "review_date": "2023-04-19",
            "source": "rt"
        },
        {
            "content": "La mejor peli del señor de los anillos, simplemente perfecta.",
            "review_date": "2023-04-18",
            "source": "rt"
        },
        {
            "content": "A perfect film trilogy worth watching for Sam alone. Amazing.",
            "review_date": "2023-04-17",
            "source": "rt"
        },
        {
            "content": "While this is not perfectly accurate, its still really good, and is and always will be the best LotR adaptation.  Anyone who decides to make a new adaptation of Tolkien needs to rot in Hell for all eternity.",
            "review_date": "2023-04-17",
            "source": "rt"
        },
        {
            "content": "the best film out of the trilogy, huge scale and an impressive way to end the trilogy in style.",
            "review_date": "2023-04-17",
            "source": "rt"
        },
        {
            "content": "A 9-hour long trilogy, that has you hooked every minute.",
            "review_date": "2023-04-13",
            "source": "rt"
        },
        {
            "content": "Best movie ever made to date! If you haven't seen this movie, then please go and read the Hobbit, Lord of the Rings, and Silmarillion, watch the first 2 LOTR movies, and then enjoy the epic finale.",
            "review_date": "2023-04-10",
            "source": "rt"
        },
        {
            "content": "It's a bit overrated because of the runtime and the reviews, but I still recommend",
            "review_date": "2023-04-05",
            "source": "rt"
        },
        {
            "content": "the perfect conclusion to what is probably the best trilogy of movies ever made",
            "review_date": "2023-04-03",
            "source": "rt"
        },
        {
            "content": "rarely seen such a wonderful film one of the best films I know",
            "review_date": "2023-03-26",
            "source": "rt"
        },
        {
            "content": "I can't believe this only has an 86. I signed up for this site, just to come here and rate it. Jason Bourne has a higher rating. I like him just fine, but cmon.",
            "review_date": "2023-03-24",
            "source": "rt"
        },
        {
            "content": "Truly one of THE BEST stories ever told, if not THE BEST! Everything, and I mean EVERYTHING about this movie is INCREDIBLE!  Such beautiful scenery and sets, an incredible score by Howard Shore, excellent acting and effects! I COULD NOT RECOMMEND THIS MORE! DOUBLE THUMBS UP! 20/10 STARS!",
            "review_date": "2023-03-21",
            "source": "rt"
        },
        {
            "content": "an incredible and epic odyssey",
            "review_date": "2023-03-17",
            "source": "rt"
        },
        {
            "content": "perfection! a great way to end a masterpiece!",
            "review_date": "2023-03-11",
            "source": "rt"
        },
        {
            "content": "thhhiiieeeeffffffffffff",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "The climax of the greatest trilogy in all of film does not disappoint. There are many reasons why this is tied for the most oscars in history and I will list them below.\nThe Visuals- They have aged like fine wine even after these 20 years.\nPerformances- Absolute perfection from the entire cast. Andy Serkis and Sean Astin being the particular stand outs of this third film.\nScore- Howard Shore's absolute best and most emotionally impactful.\nDirecting/Adaptation- Peter Jackson created the best version of J.R.R Tolkien's story. It is flawlessly cut and reorganized to create a seamless and entertaining film.",
            "review_date": "2023-02-24",
            "source": "rt"
        },
        {
            "content": "I think it says enough to say that this film with its special effects and plot still works today.",
            "review_date": "2023-02-21",
            "source": "rt"
        },
        {
            "content": "Masterpiece! It's a complete Materpiece!",
            "review_date": "2023-02-17",
            "source": "rt"
        },
        {
            "content": "The perfekt movies no flaws in my opinion",
            "review_date": "2023-02-17",
            "source": "rt"
        },
        {
            "content": "An absolute master piece. One of the best trilogies of all time.",
            "review_date": "2023-02-12",
            "source": "rt"
        },
        {
            "content": "The Lord of the Rings: The Return of the King is the third and final installment of Peter Jackson's highly acclaimed trilogy based on J.R.R. Tolkien's iconic novels.\n\nThe film picks up where the previous two films left off, with Frodo (Elijah Wood) and Sam (Sean Astin) continuing their journey to destroy the One Ring, while Aragorn (Viggo Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies) lead the armies of men, elves, and dwarves into battle against the forces of Sauron.\n\nThe Return of the King is a true epic, with breathtaking battle scenes, stunning visuals, and an emotionally charged storyline that keeps the audience on the edge of their seats. The film is also a fitting conclusion to the trilogy, bringing together all the threads from the previous films and delivering a satisfying payoff to the audience.\n\nThe film was praised for its technical achievements, including its visual effects, cinematography, and sound design, and was awarded 11 Academy Awards, including Best Picture, Best Director, and Best Original Song.\n\nOverall, The Lord of the Rings: The Return of the King is a masterful and breathtaking conclusion to one of the greatest cinematic trilogies of all time. Whether you're a fan of the novels or not, this film is a must-watch for anyone who loves epic, action-packed, and emotionally charged cinema.",
            "review_date": "2023-02-12",
            "source": "rt"
        },
        {
            "content": "This movie makes you tired with Jackson's notorious book-reader-baiting, because you start noticing a boring pattern of the events seemingly going in a different direction than in the book and then at the last possible moment going back to how they were in the book. I'm so sick of it. Also, the lands are too emtpy, the distances are too short and Eowyn's bellicose posturing is not criticized. Still, it's a great movie.\n\nTip: watch the EXTENDED EDITION. It's much better than the standard one.",
            "review_date": "2023-02-10",
            "source": "rt"
        },
        {
            "content": "A Classic Epic Fantasy Film and a Excellent Conclusion to The Beloved Trilogy. The acting is phenomenal across the board along with an amazing music score just like its predecessors. The cinematography is very well done in this. The only problems I would say is that there is ALOT more green screen and CGI in this one compared to the other 2 that had a lot more practical effects and on location scenes and it looks out of place compared to the other 2. There is a couple scenes in this as well that are oversaturated with CGI and the scene with Legolas taking the elephant down is stupid (And the only time I would say that about a scene in this trilogy). The editing is very well done in this though just a tad below the other 2 which also goes hand in hand with really the only dent being this films pacing is not as good as the other 2. It's still good pacing but the 6 minute opening with Smeagle's backstory and the 15 minutes after Aragon is crowned King feel like they are slow and don't really contribute anything to the main journey and aren't needed and make things drag at the start and end a bit. The other issue is while the scenes with Froto, Sam & Smeagle are good in their own right they go own awhile and we've already seen this in Two Towers so it feels like even though its needed for plot we've already seen it and king of makes things drag a bit. Though the amazing battle scenes more than make up for it. If that was the only issue and not the other 21 minutes than it wouldn't really be a problem. Overall this is a somewhat bloated Classic Fantasy Epic that everyone will enjoy to an all time classic trilogy.",
            "review_date": "2023-02-06",
            "source": "rt"
        },
        {
            "content": "Great finish to a beautiful trilogy and has a lot of scenes that make me cry.",
            "review_date": "2023-02-05",
            "source": "rt"
        },
        {
            "content": "A great conclusion to a fantastic trilogy",
            "review_date": "2023-02-03",
            "source": "rt"
        },
        {
            "content": "endlessly rewatchable, forever iconic",
            "review_date": "2023-01-28",
            "source": "rt"
        },
        {
            "content": "The ultimate and definitive epic!",
            "review_date": "2023-01-28",
            "source": "rt"
        },
        {
            "content": "Very few movies are perfect from start to finish. This one, The Return of the King, is absolutely perfect no matter what version you see. Be it theatrical or extended, Peter Jackson delivered a masterful conclusion to Tolkien's epic journey.",
            "review_date": "2023-01-22",
            "source": "rt"
        },
        {
            "content": "The best movie of all time!",
            "review_date": "2023-01-19",
            "source": "rt"
        },
        {
            "content": "A very good movie that people need to see  :-) All three of the movies are very good  :-)",
            "review_date": "2023-01-18",
            "source": "rt"
        },
        {
            "content": "Só o melhor fichamento de uma saga de todos os tempos!! 10/10",
            "review_date": "2023-01-16",
            "source": "rt"
        },
        {
            "content": "Loved it. Was a great rendition of the original in my opinion.",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "absolute classic, nearly perfection",
            "review_date": "2023-01-13",
            "source": "rt"
        },
        {
            "content": "A fitting end for a masterpiece of a story. The trilogy is a lesson in how to make something based entirely off of its source material, and proves the most successful and valuable movies must appreciate their audiences, themselves, and those who come before and after them",
            "review_date": "2023-01-13",
            "source": "rt"
        },
        {
            "content": "Amazing movie, definetely the best in the lord of the rings trilogy and one of the best movies of all time!",
            "review_date": "2023-01-11",
            "source": "rt"
        },
        {
            "content": "This is simply the best fantasy trilogy of all time. So much care and passion went into this. Fantastic. Yes, it´s a bit different than the books but it never - ever - changes what the story is about and what Tolkien intened it to be. You have a fantastic script, spot on actors who give everything they have, great visuals, props and camera-work, superp directing and one of the best scores ever written. \nI highly recommend the extended cut because it is even better than the theatrical cut.",
            "review_date": "2023-01-11",
            "source": "rt"
        },
        {
            "content": "A true masterpiece. It's stunningly great beyond words. And just so happens to be my favorite movie of all time!",
            "review_date": "2023-01-09",
            "source": "rt"
        },
        {
            "content": "👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩",
            "review_date": "2023-01-08",
            "source": "rt"
        },
        {
            "content": "I grew up with Tolkien from reading him in grade school. I am an old man now. Throughout the years, I have seen all the cartoons, listened to the books on tape, played with the lead figures in the 1970s as an early teen, etc. Back in early and mid 1970's, there wasn't a ton of LOR imagery and art. It was mostly in your head. This was before the Dungeons and Dragons explosion. Peter Jackson did an excellent version of these books. The characters look just like you imagined as a child reading the books. The introduction of the female elf character, in my opinion, even enhanced the stories and was well acted. I wished Jackson had carried all this quality into The Hobbit series that he made a little too much like a fantasy video game that was all over the place in parts. But that said, these 3 LOR movies are excellent and anyone would be hard pressed to out do them for many, many years to come.",
            "review_date": "2023-01-07",
            "source": "rt"
        },
        {
            "content": "A masterful and thrilling conclusion to the trilogy!",
            "review_date": "2023-01-07",
            "source": "rt"
        },
        {
            "content": "Writing : 8/10\nActing : 10/10\nCinematography : 10/10\nCostume design : 9/10\nSet design : 10/10\nCGI Effects 8/10\nArtistic vision 10/10\nAdaptation ranking : 8/10",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "Have watched this upteenth times and it never fails to deliver.\nA triumph that reflects Jacksons committment to honouring Tolkiens greatest work.\nIt just further highlights how wrong the Rings of Power makers got it.",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies of all time. After just finishing the book, I watched this movie and was amazed. From WETA Digital's stunning VFX work to the amazing performances, not to mention the already amazing source material and Jackson's great directing, it's sure to be enjoyed, Tolkien fan or not.",
            "review_date": "2022-12-31",
            "source": "rt"
        },
        {
            "content": "Perfection. Watch it.",
            "review_date": "2022-12-30",
            "source": "rt"
        },
        {
            "content": "One of the best movies of our time.",
            "review_date": "2022-12-28",
            "source": "rt"
        },
        {
            "content": "A fitting conclusion to an epic trilogy. Yes, the adaptation took several liberties, but most were warranted and appropriate. Ultimately, an unparalleled masterpiece, and, the only film I've ever cried watching.",
            "review_date": "2022-12-28",
            "source": "rt"
        },
        {
            "content": "Best show I have ever watched. The acting is superb, the special effects are just perfect! The source material was followed to the T. I hope \"they\" never try to make a remake of this show. There is no way \"they\" will ever outdo the original that is a masterpiece. Great job Sir Peter Robert Jackson, you have directed a LOTR trilogy that can never be improved on, because one cannot improve perfection!",
            "review_date": "2022-12-26",
            "source": "rt"
        },
        {
            "content": "Unintentionally hilarious and with about 100 different endings. The worst of the trilogy and not remotely fun.",
            "review_date": "2022-12-25",
            "source": "rt"
        },
        {
            "content": "timeless masterpiece. got it in 4k recently so i can keep watching it once in a while",
            "review_date": "2022-12-18",
            "source": "rt"
        },
        {
            "content": "Really good movie and excellent conclusion",
            "review_date": "2022-12-12",
            "source": "rt"
        },
        {
            "content": "absolute perfect conclusion",
            "review_date": "2022-12-09",
            "source": "rt"
        },
        {
            "content": "Zah king return - Decent 8/10",
            "review_date": "2022-12-03",
            "source": "rt"
        },
        {
            "content": "My favorite trilogy of all time.",
            "review_date": "2022-11-29",
            "source": "rt"
        },
        {
            "content": "LOTR: Return of the King is my favourite of the three LOTR films.",
            "review_date": "2022-11-27",
            "source": "rt"
        },
        {
            "content": "This movie is amazing!!   I am a lifelong fan of Tolkien and this is a 90%+ Wow!!",
            "review_date": "2022-11-27",
            "source": "rt"
        },
        {
            "content": "The best movie ever made! With the best movie acting ever by an ensemble! Plus the best directing from Peter Jackson! Also, the best movie screenplay ever adapted! As well as the best movie score ever composed! Not to mention the best movie song ever sung: Into the West! Not only that, but the best editing, cinematography, production design, makeup and hairstyling, sound mixing, sound editing, and visual effects ever done in a movie! And the best movie costumes ever designed!",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "I love these movies. Love them.",
            "review_date": "2022-11-16",
            "source": "rt"
        },
        {
            "content": "Gran adaptación al cine del universo de Tolkien. Es muy fiel al canon aunque tomando las licencias justas para adaptarlo al cine",
            "review_date": "2022-11-05",
            "source": "rt"
        },
        {
            "content": "Immortal. Is the proof that human spirit can be elevated by art.",
            "review_date": "2022-11-04",
            "source": "rt"
        },
        {
            "content": "Amazing movie! The actors are great and the CGI is good.",
            "review_date": "2022-10-31",
            "source": "rt"
        },
        {
            "content": "Picture 10\nStory 10\nActing 9\nSound/music 9",
            "review_date": "2022-10-28",
            "source": "rt"
        },
        {
            "content": "A master piece. After watching the new series \"The rings of Power\" I realized how well done the original trilogy was and how awful they made this new attempt. Forever grateful with Peter Jackson for making this.",
            "review_date": "2022-10-26",
            "source": "rt"
        },
        {
            "content": "o melhor epico já feito nos ultimos anos, e mereceu cada estatueta a qual forá indicado.... parabéns jackson e toda a equipe.",
            "review_date": "2022-10-24",
            "source": "rt"
        },
        {
            "content": "Great cast. Great adaptation. Great CGI. But the CGI battle scenes could be better.",
            "review_date": "2022-10-24",
            "source": "rt"
        },
        {
            "content": "This movie was an emotional ride.",
            "review_date": "2022-10-22",
            "source": "rt"
        },
        {
            "content": "Um dos melhores filmes que já vi , exemplo de ação , aventura , história e fantasia",
            "review_date": "2022-10-22",
            "source": "rt"
        },
        {
            "content": "The most epic scene you will ever see in a movie.",
            "review_date": "2022-10-22",
            "source": "rt"
        },
        {
            "content": "This is a 100% for me. Emotionally and scene play, it was on the mark. It is greater than the sum of its parts, Hence 100%. Occasionally it fell short in tempo or logic, but it all came together in a great story, wonderfully told, beautifully rendered, and when pulled together, a ripping yarn with a lot of class. I will remember it. When I see other movies being given a 100% by audience or critic, I don't think it is reasonable to give this one less. !00% for me.",
            "review_date": "2022-10-21",
            "source": "rt"
        },
        {
            "content": "Closed it out perfectly",
            "review_date": "2022-10-21",
            "source": "rt"
        },
        {
            "content": "epico cierre para la mejor trilogia",
            "review_date": "2022-10-21",
            "source": "rt"
        },
        {
            "content": "Like, this is the ultimate movie. There isn't much more to say than to urge you to see this masterpiece of a film. An end to the greatest trilogy that has ever existed or is likely to do so. You will see why all of the Oscars were given to these films after you watch them.\n\nNote: Blu-Ray Extended 4 hr 23 m",
            "review_date": "2022-10-17",
            "source": "rt"
        },
        {
            "content": "This is my favorite movie of all time",
            "review_date": "2022-10-17",
            "source": "rt"
        },
        {
            "content": "Bonafide masterpiece of the ages.",
            "review_date": "2022-10-16",
            "source": "rt"
        },
        {
            "content": "this is quite clearly the perfect end to a perfect trilogy",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "Best yet and the closest thing to perfect that you can get.",
            "review_date": "2022-10-14",
            "source": "rt"
        },
        {
            "content": "The perfect end to a magnificent trilogy, Return of the King is one of the best fantasy films ever made. The story concludes with poignant payoffs set up in the first two installments. Each character has their moment to shine and there is true growth in each of their narratives.\n\nThe setting is gorgeous (I want to live at Minas Tirith), the score is profound (especially in the third act) and the story is well balanced. The script is incredibly well written and the slick dialogue is performed masterfully. From \"I am no man\" to \"For Frodo!\" to \"My lady!\" and many more, there are chill-inducing moments due to smart writing.\n\nWhile it is emotionally draining to complete the trilogy, it is equally fulfilling. There is a lot packed into these 10 hours of film (non-extended editions). Though long and complicated, Return of the King wraps up the best trilogy ever made with elegance.\n\nBest Character: Samwise Gamgee (Top 5 most selfless character in all of cinema)\nBest Moment: The \"My friends, you bow to no one\" scene\nBest Quote: \"I can't carry it for you, but I can carry you!\" - Sam",
            "review_date": "2022-10-14",
            "source": "rt"
        },
        {
            "content": "FANTASTIC, AMAZING, SAW IT 3 TIMES AT THE MOVIE THEATER AND NO LESS THAN 20 TIMES AT HOME, ONE OF MY TOP MOVIES FOREVER",
            "review_date": "2022-10-14",
            "source": "rt"
        },
        {
            "content": "The pinnacle of cinema. \n\nA masterpiece in every sense of the word.  Peter Jackson created a timeless classic that will forever hold the test of time. Everything about the film is perfect; characters, set design, visual effects, props, casting, acting, storytelling, cinematography, pacing, emotion and so much more.\n\nIt is simply faultless and we will never see the likes again, while video as a medium to tell a story endures. \n\nJohn Ronald Reuel Tolkien created the most compelling and engagingly fantasy realm ever and Peter Jackson brought this to life in not just one but three films that stand-alone as the epitome of cinema. \n\nEverything in the film from the way it opens with the interaction of Sméagol and Deagol to the way it closes with suitable endings for each character and then with Sam in the Shire, is incredibly well thought through. It is funny, thrilling, sincere, thought provoking, sad and ultimately relatable.\n\nThe good vs bad story has been told over and again in cinema, but yet from the J R R Tolkien epic Peter Jackson has created the absolute epitome of this genre. \n\nThe characters are all perfectly cast and perfectly played by each and every actor from the main cast to the extras. To name a few Vigo Mortenson as Aragorn is sublime, Ian Mckellan as Gandalf is fabulous and Elijah Wood as Frodo is true the nature of Frodo and his age defining quest.  \n\nTo conclude, it is without doubt cinema at its very perfection and as I have already mentioned, we shall never see its like again. \n\nA heartfelt and sincere thank you to Peter Jackson, for creating such an incredible and beautiful piece of visual art that has defined cinema as we know it. \n\nNi 'lassui En",
            "review_date": "2022-10-14",
            "source": "rt"
        },
        {
            "content": "I feel like something was missing, even besides sharku razing the Shire. but still really beautiful and I cried at the end. what a trilogy!",
            "review_date": "2022-10-09",
            "source": "rt"
        },
        {
            "content": "With over 3 hours theres alot of content, and most of it is really good, action packed and just really enjoyable. while this movie does have some parts that dont need to exist, its a really good ending to the dirst trilogy.",
            "review_date": "2022-10-08",
            "source": "rt"
        },
        {
            "content": "Amazing movie that will strand the test of time. \n\n4.5 stars instead of five for two reasons alone:\n1) Gandalf's encounter with Saruman was too important to be left only in the extended version\n2) Half an hour is too long for an ending scene (or series of scenes)",
            "review_date": "2022-10-08",
            "source": "rt"
        },
        {
            "content": "HOW DOES THIS MASTERPIECE ONLY HAVE AN 86?!?!?!",
            "review_date": "2022-10-08",
            "source": "rt"
        },
        {
            "content": "One of the greatest trilogy conclusions of all time.  Peter Jackson's commitment to representing Tolkien's works shines through.",
            "review_date": "2022-10-07",
            "source": "rt"
        },
        {
            "content": "A wonderful ending to a trilogy anyone else other than Peter Jackson might have fainted at the idea of finding a suitable way to tie the books together!",
            "review_date": "2022-10-07",
            "source": "rt"
        },
        {
            "content": "The final piece of the puzzle in one of the greatest trilogies of all time!",
            "review_date": "2022-10-07",
            "source": "rt"
        },
        {
            "content": "The main theme is legendary. All battlefields are very nice and absolutely incredible, it's so epic, your feelings are mixted when you see this film. A perfect moment even after saw it 10 times.",
            "review_date": "2022-10-06",
            "source": "rt"
        },
        {
            "content": "Watched \"Rings of Wokeness\" and realized how good this was!",
            "review_date": "2022-10-05",
            "source": "rt"
        },
        {
            "content": "The best movie in the best trilogy to ever exist.",
            "review_date": "2022-10-05",
            "source": "rt"
        },
        {
            "content": "The final instalment in one of the best movie trilogies of all time, The Lord of the Rings: The Return of the King improves upon its predecessors while being a marvelous adaptation of J.R.R. Tolkien's timeless novel, the Return of the King develops and improves upon the cast of characters, all the performances are flat out amazing, the action is plentiful and superb, the direction by Peter Jackson is flawless, the narrative is highly progressive and pretty much amazing and the movie is filled with kickass and emotional moments, all amounting to the perfect finale that is easily the best fantasy film of all time as well as one of the absolute greatest films ever made.",
            "review_date": "2022-10-05",
            "source": "rt"
        },
        {
            "content": "The most beautiful and emotional closure of the most epic story ever told!",
            "review_date": "2022-10-05",
            "source": "rt"
        },
        {
            "content": "La mejor película de la historia",
            "review_date": "2022-10-01",
            "source": "rt"
        },
        {
            "content": "I've had to watch this again to rinse the Rings of Power out of my mouth.",
            "review_date": "2022-10-01",
            "source": "rt"
        },
        {
            "content": "Masterpiece! Absolute perfection!",
            "review_date": "2022-09-30",
            "source": "rt"
        },
        {
            "content": "Seen in theaters with mom. Both loved it.",
            "review_date": "2022-09-26",
            "source": "rt"
        },
        {
            "content": "Um dos melhores filmes de todos os tempos!",
            "review_date": "2022-09-26",
            "source": "rt"
        },
        {
            "content": "The battle scenes played out nicely on the big screen!! Since we did not get the trilogy in the theaters 20 years ago, we were so thrilled our local movie theater plays throwbacks like LOTR.  We made sure to see all 3 this month in theaters.  So fun!! Just a little long (4+ hours) if they the show the extended version.",
            "review_date": "2022-09-26",
            "source": "rt"
        },
        {
            "content": "Excelente! de lo mejor de la historia del cine!",
            "review_date": "2022-09-26",
            "source": "rt"
        },
        {
            "content": "WATCH IT!! AMAZING MOVIE! 10/10. WOULD NOT CHANGE A THING. WATCH ITTTTTTTTT",
            "review_date": "2022-09-26",
            "source": "rt"
        },
        {
            "content": "The best trilogy ever.\nThis 3rd title ends the story greatly, the most grateful end of all the movies at all",
            "review_date": "2022-09-24",
            "source": "rt"
        },
        {
            "content": "The best trilogy of all time!",
            "review_date": "2022-09-24",
            "source": "rt"
        },
        {
            "content": "my favorite movie of all time",
            "review_date": "2022-09-23",
            "source": "rt"
        },
        {
            "content": "Probably the best movie ever created",
            "review_date": "2022-09-23",
            "source": "rt"
        },
        {
            "content": "una de las mejores películas de la historia. No hay ni una película que pueda calificar de perfecta salvo esta. Adelantada a su tiempo, ha envejecido tan bien que hasta el día de hoy sigue siendo una joya audiovisual que jamás se repetirá. Transgredió el mito de que la fantasía era solo para niños y nos dio la mejor experiencia jamás vivida en el cine. Todo mi amor por esta película se queda corto",
            "review_date": "2022-09-23",
            "source": "rt"
        },
        {
            "content": "Je ne l'apprends à personne, la saga du Seigneur des Anneaux est un bijoux de la fantaisie, qui ne saurait déplaire aux amateurs du genre. J. R. R. Tolkien a mis au point un univers très riche que Peter Jackson a adapté à merveille sur grand écran.\n\nLes paysages de la Nouvelle-Zélande collent parfaitement au cadre de la Terre du Milieu, qu'il s'agisse du Comté, de Fendeval, du Rohan, de la Moria ou du Mordor. L'apparence des différentes races – Hobbits, Elfes, Nains, Orcs, etc. – est fidèle aux livres. Même si les effets numériques ont vieilli aujourd'hui, ils n'en demeuraient pas moins de qualité pour l'époque. \n\nPortée par une distribution dantesque et une bande originale à couper le souffle, la trilogie du SDA est toujours un plaisir à revoir. Cela dit, il est vrai que la richesse de l'histoire, la multitude de personnages et la longueur des films peut refroidir plus d'un téléspectateur. C'est pourquoi je recommande de les visionner accompagné d'un connaisseur de la saga, qui saura répondre aux nombreuses questions que se pose une personne qui découvre le récit.",
            "review_date": "2022-09-20",
            "source": "rt"
        },
        {
            "content": "Best of Movies/TV Series Collection",
            "review_date": "2022-09-19",
            "source": "rt"
        },
        {
            "content": "Epic Battle, still great screening and love to the detail. It is a must see.",
            "review_date": "2022-09-16",
            "source": "rt"
        },
        {
            "content": "Absolutely Fantastic: modern classic!\nA Must See",
            "review_date": "2022-09-16",
            "source": "rt"
        },
        {
            "content": "Nothing in my life has impacted me quite as much as these movies have, they're not just movies, they're an experience, one everyone should have atleast once in their life.",
            "review_date": "2022-09-14",
            "source": "rt"
        },
        {
            "content": "The movie ages like fine wine, a must see! A profound depiction of human nature",
            "review_date": "2022-09-14",
            "source": "rt"
        },
        {
            "content": "Nunca existira uma produção tão bem feita como essa.",
            "review_date": "2022-09-12",
            "source": "rt"
        },
        {
            "content": "Probably the best movie of all time!",
            "review_date": "2022-09-12",
            "source": "rt"
        },
        {
            "content": "The conclusion of the trilogy was the best film in history.\nTolkien would be proud.",
            "review_date": "2022-09-12",
            "source": "rt"
        },
        {
            "content": "Its a great way to end the trilogy. May need a bathroom break or 2 because of the length.",
            "review_date": "2022-09-11",
            "source": "rt"
        },
        {
            "content": "One of the best movies of all time.",
            "review_date": "2022-09-11",
            "source": "rt"
        },
        {
            "content": "Spear shall be shaken, shield shall be splintered, a sword-day, a red day, ere the sun rises! Ride now, ride now, ride! Ride for ruin and the world's ending!\nWhat else is there to say. What a ride!",
            "review_date": "2022-09-11",
            "source": "rt"
        },
        {
            "content": "A Masterpiece from a time when movies and shows were good and the writer was respected. Sure some liberties were taken, but it wasn't rewritten as the ROP sh*t is!",
            "review_date": "2022-09-09",
            "source": "rt"
        },
        {
            "content": "The end to the best movie trilogy in cinematographic history.\n\nPeople are born today and will probably die of old age without seeing something as great.\n\nThe story, action and dialogue are all near perfect 10/10s and the spirit of Tolkein's world is unmatched.\n\nEven the CGI is better than stuff we see today.\n\nWatching this and then looking around at the cheap, love devoid, corporate stuff we got today makes me shed a tear.\n\nGod bless the people who made this and may God forgive us for allowing Tolkein's legacy to be muddied the way it is in 2022.",
            "review_date": "2022-09-09",
            "source": "rt"
        },
        {
            "content": "After watch the TV version, the movie version is full star.",
            "review_date": "2022-09-08",
            "source": "rt"
        },
        {
            "content": "Beautiful adaptation, Tolkien would be proud.",
            "review_date": "2022-09-08",
            "source": "rt"
        },
        {
            "content": "best trilogy of all time, nothing else comes close",
            "review_date": "2022-09-08",
            "source": "rt"
        },
        {
            "content": "Le moins bon des 3 mais inoubliable....",
            "review_date": "2022-09-07",
            "source": "rt"
        },
        {
            "content": "An amazing conclusion to the trilogy, and one of my favorite movies of all time. As with the previous two films, an excellent blend of live action and CGI. Combine that with the strength of the story and the most epic battle scene you could ever ask for and you've got a masterpiece.",
            "review_date": "2022-09-07",
            "source": "rt"
        },
        {
            "content": "11/10.\nMasterpiece. Impecable. Perfeito.",
            "review_date": "2022-09-07",
            "source": "rt"
        },
        {
            "content": "Amazing \njust Amazing, if you haven't seen it you have to go and watch all three of them\n\nEnd, no it doesn't end here, its only the beginning",
            "review_date": "2022-09-07",
            "source": "rt"
        },
        {
            "content": "One of the best movies period. Hands down. A masterpiece of cinematography, characters, action, and more.",
            "review_date": "2022-09-06",
            "source": "rt"
        },
        {
            "content": "As much as I was looking forward to the 3rd installment of the greatest cinematic trilogy of all times, I was also dreading it for fear it wouldn't live up the the brilliance of it's predecessors. Not only did it live up to it's predecessors, it actually exceeded them. It truly was the heart of the trilogy and the way Peter Jackson was able to tie up all the loose ends at the end was nothing short of brilliant.",
            "review_date": "2022-09-06",
            "source": "rt"
        },
        {
            "content": "A true masterpiece! Down to the music, the acting, the set design andnthe attention to detail I will always remember the first time I saw this movie when it first came out.",
            "review_date": "2022-09-06",
            "source": "rt"
        },
        {
            "content": "Best movie I've watched! Not woke. Good elves and men and hobbits. The cloths are right, the buildings are right and ...",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "very good movie a little below the society of the ring but it is very good well represented by the actors, costumes and graphics.",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "it was engaging from start to finish! I've loved this films since I was a kid. I recommend you watch them if you haven't",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "This final installment of the trilogy delivers and never disappoints.  Except for perhaps the scene at the end with the Eagles.. But some explanations of why they weren't around in the first place etc is left inside novel form and other items are needed to wrap of a film in a timely manner.  Regardless of some minor nit picking of Return of the King and the previous two films I had never left a film feeling so satisfied to be part of fan base as I had when this hit the box office.  Truly worth a watch and re watch.",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "The conclusion to the greatest movie trilogy in film history maintains the high level of brilliance, giving fans amazing views of fantastical vistas, epic battles, and legendary characters. Peter Jackson deserves all the accolades for this film, because it truly is cinematic marvel.",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "Just wow. If you can get the extended edition, It's just epic, the setting was beautiful. Characters developed, emotional moments. It's one of those films I can watch over and over!",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "DEATHHHH!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "Part of the best trilogy of all time, visually spectacular and accompanied by great soundtrack, characters are amazing and compelling who you feel a real bond with!",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "A cinematographic show, and one of the best film adaptations.",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "While many might say this is the best of the LotR trilogy, I actually think it's the worst - even if just by a little.  It's action-packed, but the story isn't quite as good or as true to the source-material in my opinion.  Still... like all of this trilogy, it's a must watch!",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "Amazing film! This trilogy is timeless. Music, acting, script, it all works.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "Brilliant! Timeless classic.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "It doesn't get better than this.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "This is by far my favorite movie ever! It never gets old or bring.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "a truly wonderful movie that everyone should watch. while 2 towers is my favorite of the trilogy, this one sticks the landing. That is so rare and difficult I have to applaud it so much. all the characters and themes shine through.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "I adore this movie. This is the best movie ever.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "Great movie. I watched it multiple times",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "A triumphant 3rd part to an epic, heroic tale. Peter Jackson took some liberties with Tolkien's story but the heart of the tale is here and Jackson set a strong pace and restructured the story very effectively for the screen. Epic themes - sacrifice and honor - and tense, deserving set pieces that explode onscreen and bear us through the story; great popcorn movie storytelling.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "Just re-watched for the umpteenth time and it never fails to impress.  even after 20 years this movie is still great.  it's timeless.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "There's a reason this is the only fantasy film to win an Oscar for Best Picture. 11 in total. The greatest trilogy of all time and 20+ years on the movies have lost none of their shine. The ending still packs an emotional punch despite multiple viewings. An incredible piece of movie making from Peter Jackson and everyone else involved.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "Excellent film... the extended versions are the best, except for the fake death scenes and other silliness.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "De las mejores películas que  he visto en mi vida; de las mejores adaptaciones.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "This movie is pure gold. The epic finale to the greatest movie trilogy of its time.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "The greatest trilogy of all time.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "Wow. It's a very long time to hold your breath, but Peter Jackson and co. bring it all home with a grand, awe-inspiring and stirring finale to this blockbuster fantasy franchise. It's a grand slam of a cinematic achievement, sure to be a financial success, but also a storytelling one. This is packed with more thrills, more emotion, more epic battles and spectacular effects, and more poetry than even the first two wonderful films. Everyone from the cast brings their A-game, and everyone gets their moment or two to shine. This leg of the journey is fraught with tension, frights, and brings you to the edge of your seat. It isn't flawless, with an over-extended epilogue that outstays its welcome, one of the longest in movie-going memory. But you can't say Jackson and his team screwed up. This is an exhilarating and emotionally exhausting epic, a genuinely transportive adventure and the best film of 2003",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "Peak of cinema and the fantasy genere specifically. I can't rank this movie against its two sequels, but this must be my favorite movie trilogy of all times!",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "Purely the best moovie of all time. And there is nothing after it. The hobbit or the ring of power are truly trash in comparaison to this masterpiece",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever. Watch this instead of that Amazon trash",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "After watching the extended version its definitely the best way to watch, maybe take a break in the middle its very long but worth every minute",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "After seeing this all I want to do is visit New Zealand",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "this one was pretty good tbh",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "ЛУЧШИЙ. Как и остальные части серии.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "Perfectly captures Tolkiens world.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "This movie has aged like fine wine",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "A masterpiece. Does what no trilogy in Hollywood has yet accomplished by following up 2 other masterpieces and maintaining the quality, and wrapping up in a satisfying way.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "Greatest epilogue to the greatest trilogy ever made to film",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "A perfect ending to a perfect trilogy. Can watch these movies everyday for the rest of my life",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "Loses minor points for dragging out the ending a little, which means some of the other scenes are a little compressed such as the army of dead smoothing over like a goo!",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "A beautiful conclusion to the trilogy that brings together all the narratives and character arcs. With so many pay offs it's a must see.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "Great adaptation. Peter jackson shows it should be done",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "the original, the best, the only",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "This movie bows to no one.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "A great conclusion to a great trilogy.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "Perfect, respectfully with Tolkien",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Absolute masterpiece ageless as the universe watched 100+ times.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Great cinematography, great actors, held true (for the most part) to Tolkiens books.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "it is 1/3 part of my soul.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "My favorite movie, I see it every year.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Hands down, this is the greatest film ever made.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Best movie ever made",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "In comparison to wahts come out now, this is a world away!",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "A Cinematic Masterpiece - My favorite films of all time!",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "gurl loveee this film! da best!",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Un grand classique. Le casting et le jeu d'acteur font référence pour les films fantasie.\nLes costumes sont travaillés et réaliste. L'univers est cohérent avec le lore établie pour que les films soient légitimes.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "A true classic, watched this several times",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "One of the great masterpieces of cinema. I've seen it dozens of times, you must see it!",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "I mean it's Return of the King, I don't think anything else needs to be said.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "A Must see, from fantasy perspective few challengers",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "The greatest trilogy evere in history. Period",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Maybe the best of the series... it's so hard to know, just an amazing trilogy.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Powerful and emotional all the way through. The Lord the Rings the Return of the King is masterful movie and a perfect conclusion of the franchise.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "I can't explain, this is pure cinema!",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Excellent close to the definitive LotR cinematic experience. May not be perfect, but I can't see Peter Jackson's trilogy being surpassed in my lifetime.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "A fantastic conclusion to one of the greatest movie trilogies of all time. Featuring LOTR's characteristic sense of humor, action, pacing, and characters, these movies were truly a masterpiece.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "My favourite 😍😍 I can watch it every day!! Masterpiece!!",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "A masterpiece. Remarkable.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Amazing, Amazing, Amazing, Amazing",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "Greatest trilogy movie ever.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "The third part is the weakest of all three, but still a masterpiece that is unparalleled!",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "A movie that will go down in history as a classic. The third act is one of the best acts in all movie history. So many great scenes, so many great lessons to teach younger generations.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "This movie is the final movie and my favorite of the trilogy. The trilogy is my absolute happy place. I can just put the movie on and get transported to Middle Earth, and forget all my troubles for a couple of hours. No matter how many years go by, this movie (and the trilogy) is timeless and a beauty to behold. Not only because of the outstanding actors and actresses, but also due to the love PJ has put into the movies. It doesn't feel like you're watching a movie. It's like a portal opens up and you can directly peek into Middle Earth yourself.",
            "review_date": "2022-08-31",
            "source": "rt"
        },
        {
            "content": "Love Tolkien! Love Jackson! Love that he did his best to stay faithful to the source material. This trilogy will go down in history as the greatest trilogy every made.",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "2yago-Continued directing mastery brings the fantasy saga to an end, even if it drags it's feet on which ending it wants to go with.",
            "review_date": "2022-08-27",
            "source": "rt"
        },
        {
            "content": "Amazing Trilogy. Every movie is perfect and this one is perfect and my personal favorite. I love how Aragorn becomes king and the battles are crazy. Seeing Frodo finally complete his mission is a nice thing to see and you realize how he will be messed up forever because of the ring. The goodbyes at the end were sad and this was an amazing ending to the trilogy.",
            "review_date": "2022-08-25",
            "source": "rt"
        },
        {
            "content": "A film for the generations! Highly complimentary to the books, and represents everything the new rubbish rings of power isn't.",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "The final film of the trilogy isn't quite as good as the first two masterpieces, but it is still a monumental achievement. A great ending to the best fantasy trilogy ever put to film.",
            "review_date": "2022-08-19",
            "source": "rt"
        },
        {
            "content": "| Ratings Categories |\nCharacters (9.5/10)\nCinematography (9.5/10)\nPlot (10/10)\nActing (8/10)\nPacing (9/10)\n92%",
            "review_date": "2022-08-18",
            "source": "rt"
        },
        {
            "content": "One if the Best Fantasy Films of all time.\nActually the best Fantasy Film of al time.",
            "review_date": "2022-08-18",
            "source": "rt"
        },
        {
            "content": "esta es una conclusion satisfactoria para una gran trilogia",
            "review_date": "2022-08-15",
            "source": "rt"
        },
        {
            "content": "Amazing end to the best trilogy ever.",
            "review_date": "2022-08-05",
            "source": "rt"
        },
        {
            "content": "A fantastic way to end the series. The real gripe with this movie is the ending is a little long and drawn out but is necessary to bring a proper close to the film. The battle scenes are shot well and the movie does a good job building suspense.",
            "review_date": "2022-08-03",
            "source": "rt"
        },
        {
            "content": "A must see to everyone who respect themselves",
            "review_date": "2022-07-25",
            "source": "rt"
        },
        {
            "content": "\"The Return of the King\" is by far the most moving, inspirational, and epic of Peter Jackson's The Lord of the Rings Trilogy movies. The movie plot is compelling with themes of friendship, strength, and loyalty. Frodo Baggins and Samwise Gamgee continue their quest to destroy the One Ring at Mount Doom led by Gollum. Gollum becomes more cunning and sneaky than ever. Gandalf the White, Aragorn, Legolas and Gimli regroup with Merry and Pippin in Isengard, and they learn that Sauron is planning a full-scale attack on the largest city of men, Minas Tirith in Gondor. The rest of the Fellowship prepares for another battle to hold Minas Tirith against an onslaught of the armies of Mordor. A distress called is sent to Rohan, and King Theoden is able muster a large army of Rohirrim, to set out for Minas Tirith. After the free people's victory at the Battle Pelennor Fields, the Fellowship what remaining forces of Gondor and Rohan that they have and storm the Black Gate to distract the Eye of Sauron's gaze and buy time for Frodo to finish his quest. The movie set for Minas Tirith, The City of Kings, is very gorgeous. The lighting of the beacon is authentic. The costumes, weapons, armor, props and movie sets are very well tailored by the film crew. The special effects for the army of the Dead (oathbreakers), Gollum, Shelob the spider, the mumakil, the eagles, Sauron's Eye, the fellbeasts and the trolls are breathtaking and incredible. The movie visuals for Minas Tirith, Pelennor Fields, Osgiliath, The Grey Havens, Mordor, The Black Gate, Mount Doom, Minas Morgul and Shelob's Lair are spectacular. King Thedeon's speech at Pelennor Fields and Aragorn's speech at the Black Gate are some of the best movie battle speeches ever. The heroism and romance are incredibly moving. Gandalf's speech to Pippin about death being another path to take in life is so emotional. Sam Gamgee's devotion to Frodo is something that can show what true friendship is. The battles are amazing and always heightening the tension. The tension for the siege on Minas Tirith is so highly anticipated. The acting and the cast crew are superb. Sir Ian McKellen is flawless in his role as Gandalf the White. Viggo Mortenssen is at his charismatic in his role as Aragorn. Sean Astin captures Samwise Gamgee perfectly and is able to provide the character's heart. Andy Serkis provides a stirring and great performance as Smeagol/Gollum. Orlando Bloom as Legolas and John Rhys-Davies as Gimli carry their roles very well. Elijiah Wood gives a great performance as Frodo Baggins descending into corruption with an incredible talent. Dominic Monaghan (Merry) and Billy Boyd (Pippin) still make a great duo. David Wenham is particularly good in his role as Faramir. John Noble gives a brilliant performance as the tragic and broken Lord Denethor. Bruce Spencer was wonderful in his role as the treacherous Mouth of Sauron in the extended edition. Lawrence Makoare was incredible in his role as Gothmog, the orc lieutenant from Minas Morgul. The rest of the cast including Bernard Hill, Mirianda Otto, Karl Urban, Ian Holm, Liv Tyler, Cate Blanchett and Hugo Weaving are perfect in their roles. The Battle of Pelennor Fields is still the most spectacular and epic battle sequences in Hollywood movie history. The visual effects of battle at Minas Tirith are stunning and perfectly executed. The incredible scope of the battle with the special effects, sounds, and many close-ups of pieces of the action make for an exciting scene. The final stand at the Black Gate is so emotional involving and is done so with vision beyond imagination. The many endings that follow are brilliant.",
            "review_date": "2022-07-08",
            "source": "rt"
        },
        {
            "content": "BEST MOVIE EVER!!! This movie is beautiful and genius in so many ways. Enjoy Tolkien's wonderful masterpiece made visual.",
            "review_date": "2022-07-07",
            "source": "rt"
        },
        {
            "content": "An absolute masterpiece with dozens of iconic scenes and one of the best soundtracks of all time. LOTR does not need a remake.",
            "review_date": "2022-07-07",
            "source": "rt"
        },
        {
            "content": "A crescendo of film.",
            "review_date": "2022-07-06",
            "source": "rt"
        },
        {
            "content": "Movie was epic. Loved it every bit!!",
            "review_date": "2022-07-03",
            "source": "rt"
        },
        {
            "content": "Best finish to a trilogy ever.",
            "review_date": "2022-07-02",
            "source": "rt"
        },
        {
            "content": "Yeah, this is better than CATS.",
            "review_date": "2022-06-27",
            "source": "rt"
        },
        {
            "content": "The Lord Of The Rings 3: The Return Of The King is a heroic-fantasy film based an the book of JRR Tolkien, produced and directed by Peter Jackson and released in 2003. The budget of the film was 94 millions dollars, but it has bring 1 142 219 401 dollard and it has receive eleven Oscars. \n\nThe culmination of nearly 10 years' work and conclusion to Peter Jackson's epic trilogy based on the timeless J.R.R. Tolkien classic, \"The Lord of the Rings: The Return of the King\" presents the final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Hobbits Frodo and Sam reach Mordor in their quest to destroy the `one ring', while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith. \n\nI thought the performances of the actors were remarkable. The filming was also excellent, and the special effects were very well thought out. The music was well synchronised with the atmosphere, which gave the impression of living the scene. I enjoyed the script and the dialogue, which was not at all out of place in other films. The costumes were in keeping with the universe given by the director.\n\nIn conclusion, I would recommend this film to fans of fantasy and to the curious who wish to be educated by watching this film. I would give this memorable film 5 stars.",
            "review_date": "2022-06-19",
            "source": "rt"
        },
        {
            "content": "The best movies and series of all time.",
            "review_date": "2022-06-19",
            "source": "rt"
        },
        {
            "content": "Sin lugar a dudas es la mejor película ambientada \"de época\" con una calidad actoral excelente, una producción perfeca que incluso llegó a ganar 11 premios Oscar de 11.",
            "review_date": "2022-06-11",
            "source": "rt"
        },
        {
            "content": "One of the greatest trilogies of all time! Amazing directing. Great acting. You feel every emotion throughout the trilogy (happy, sad, scared, hopeful, etc.). Although the movie does not stick exactly to the books, the changes they made are just as fulfilling as the original parts.",
            "review_date": "2022-06-08",
            "source": "rt"
        },
        {
            "content": "Is it the greatest epic movie of all time? Maybe, but for sure is a 10/10 for me. Perfect in every way.",
            "review_date": "2022-06-06",
            "source": "rt"
        },
        {
            "content": "This is it. The grand finale to the greatest fictional series ever made, and for that matter, the GREATEST movie ever made. The ending is so satisfying, and much better than that of the book with the awful Scouring of the Shire; it manages to tie up all of the loose ends. Everytime someone complains about the length, I groan. The LOTR film trilogy once again triumphs over its bland and dull source material.",
            "review_date": "2022-06-04",
            "source": "rt"
        },
        {
            "content": "Best Triology!!!!!!!!",
            "review_date": "2022-06-04",
            "source": "rt"
        },
        {
            "content": "A worthy ending to an incredible trilogy. Everything the previous two movies had built on was finally paid off in a satisfying conclusion.",
            "review_date": "2022-06-03",
            "source": "rt"
        },
        {
            "content": "Culmination of the greatest trilogy of all time\n\nIf you consider the trilogy 1 single movie this is the greatest movie of all time",
            "review_date": "2022-06-02",
            "source": "rt"
        },
        {
            "content": "Manteve a qualidade!",
            "review_date": "2022-06-02",
            "source": "rt"
        },
        {
            "content": "Such an amazing ending to an even more amazing trilogy.",
            "review_date": "2022-05-28",
            "source": "rt"
        },
        {
            "content": "So much suspense and beautiful cinematography!",
            "review_date": "2022-05-28",
            "source": "rt"
        },
        {
            "content": "What more is there to say? This is such a timeless and amazing movie!",
            "review_date": "2022-05-27",
            "source": "rt"
        },
        {
            "content": "An epic conclusion to an epic trilogy of films.  Return of the King is by far the best Lord of the Rings movie as well as a member of the definite top three best book to film adaptations.  The Lord of the Rings is the greatest film trilogy of all time because every film is absolutely perfect, especially the finale.",
            "review_date": "2022-05-27",
            "source": "rt"
        },
        {
            "content": "This film breaks the barriers of film (in a great way) in so many ways, that I don't even know where to begin. But in a nutshell, it is the greatest trilogy of all time.",
            "review_date": "2022-05-27",
            "source": "rt"
        },
        {
            "content": "Amazing such a great end yet I stll wich we could have had the Shire rebellion storyline from the books \n\nHavent seen the Extended edition yet Will update when I do",
            "review_date": "2022-05-25",
            "source": "rt"
        },
        {
            "content": "A brilliant end to a fantastic story...Peter Jackson really creates a visual masterpiece here.",
            "review_date": "2022-05-22",
            "source": "rt"
        },
        {
            "content": "The grand finale of Tolkien's breathtaking fantasy trilogy finally brings peace to Middle Earth, and satisfaction for our hearts. It's the final chapter of a long journey that is - in spite of a stereotype - getting better with each movie. The real difference about these movies is that with the unusually long runtime all the characters on every plotline can be equally developped and be equally valuable to the story.",
            "review_date": "2022-05-18",
            "source": "rt"
        },
        {
            "content": "You have to see this atleast once",
            "review_date": "2022-05-14",
            "source": "rt"
        },
        {
            "content": "Masterpiece! I just wish there was more!",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "The final act in the greatest trilogy of all time. They did not hold back. I think you could argue that this is the greatest movie of all time and have several great statistics to back your argument up. Such a beautiful film with a perfect story book ending. Can't say enough good things about it and the trilogy as a whole.",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "As you might already know, Return of The King is the best of the trilogy and the best fantasy film of all time. It improves upon everything great about the first two movies and also adds more to them to give an unparalleled experience. Everything moves a huge step up from the previous films. The writing especially is great in the previous films, but is absolutely fantastic in this one. Comes as no doubt that it won 11 Academy Awards including Best Picture.\n\nThe introductions of new locations and characters elevate this film to a masterclass status. The battle of Minas Tirith is so well built up. The geography of the location is fully setup from the very scene we are introduced to Minas Tirith. The Ride of Rohirrim is not a Deus Ex Machina as it is constantly being built up on the other side. The ups and downs in the battle are placed very well throughout and makes it very engaging.\n\nFrodo and Sam's quest to destroy the ring is also really good. Elements from the previous movies are used very effectively to enhance the viewing experience. Until the ring is finally destroyed, the film leaves you at the edge of your seat. The ending of Return of The King is one of the most satisfying endings of any film. It is one of the best conclusions to one of the best trilogies ever made.",
            "review_date": "2022-05-07",
            "source": "rt"
        },
        {
            "content": "Best trilogy of all time!!!",
            "review_date": "2022-05-06",
            "source": "rt"
        },
        {
            "content": "greatest film ever made.",
            "review_date": "2022-04-29",
            "source": "rt"
        },
        {
            "content": "The conclusion to Peter Jacksons award winning fantasy epic is one of masterful proportions. Just when you thought the movies couldn't improve The Return of the King delivers with as much epic battle sequences as emotion and inspiration. The best of the trilogy.",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "my favorite movie series - so so happy to have it again on screen 3",
            "review_date": "2022-04-27",
            "source": "rt"
        },
        {
            "content": "11 oscars won and very well deserved. Just like the previous two movies. The middle earth is portrayed in a sublime way also it's charactera are just perfect. An all time top 5/5.",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "my personal favorite of the trilogy, don't know why not everyone else liked it. I absolutely loved the emotion and conflict going on at the very end. the battles were AMAZING!! highly recommend watching this franchise in marathon style with the extended editions if you have the time.",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "a perfect ending to a perfect trilogy, with heartwarming moments, unbelievable action set pieces, and all the hype you could ask for in a final movie in a series.",
            "review_date": "2022-04-11",
            "source": "rt"
        },
        {
            "content": "very good, but the worst of trilogy for me, too much battles maybe",
            "review_date": "2022-04-11",
            "source": "rt"
        },
        {
            "content": "Almost perfect. And when I say \"almost\" I mean a liiiitle narrow gap that only the Fellowship of the Ring can fulfill to \"perfect\" (for me).",
            "review_date": "2022-04-10",
            "source": "rt"
        },
        {
            "content": "A glorious finale and an epic conclusion. This trilogy has done Tolkien justice. And if you think the ending was slow, read the book.",
            "review_date": "2022-04-10",
            "source": "rt"
        },
        {
            "content": "Great movie . Great battles and cast .a great finish to the trilogy",
            "review_date": "2022-04-09",
            "source": "rt"
        },
        {
            "content": "There are those emerging from the cracks who have taken stabs at The Lord of the Rings and Jackson's adaptations of it.  They say that the film does not deserve an Oscar, let alone thirteen.  I wholeheartedly disagree; the Oscars are not worthy of this film.  The Return of the King is the epic climax of the trilogy, bringing together every character from the previous two films and many new ones in a conflict of titanic size.  No film will ever live up to this.",
            "review_date": "2022-04-07",
            "source": "rt"
        },
        {
            "content": "A great finish to the trilogy, did not disappoint. And watched many many times, if only the Hobbit movie lived up to this.",
            "review_date": "2022-04-01",
            "source": "rt"
        },
        {
            "content": "Best trilogy ever!!!",
            "review_date": "2022-04-01",
            "source": "rt"
        },
        {
            "content": "Only 86 from the fans. Easily a 100",
            "review_date": "2022-03-27",
            "source": "rt"
        },
        {
            "content": "Amazing end to the trilogy. Sad after watching because I know the trilogy is over! Amazing battle scenes, great tying in everything together, score is fantastic. Just fantastic movie one of the best done ever.",
            "review_date": "2022-03-14",
            "source": "rt"
        },
        {
            "content": "THE BEST one of the franchise ",
            "review_date": "2022-03-10",
            "source": "rt"
        },
        {
            "content": "An audacious masterpiece of filmmaking that brings a fantastical imaginative story to life.",
            "review_date": "2022-03-02",
            "source": "rt"
        },
        {
            "content": "This movie offers satisfying conclusions to every plotline and you could not ask for a better ending to a trilogy. An absolute masterpiece (especially the extended cut).",
            "review_date": "2022-03-02",
            "source": "rt"
        },
        {
            "content": "A perfect ending to the Greatest Trilogy of All Time.  The Lord of the Rings: The Return of the King wraps up the Middle-earth saga in a satisfying and emotional way.",
            "review_date": "2022-02-28",
            "source": "rt"
        },
        {
            "content": "i'll simply repeat my first comment about the Fellowship: The high caliber production value and effort is truly evident in the film. Reminiscent of the great Hollywood epic Ben-Hur. This film is one that even the most hard-line fans of the books can call mostly faithful and at the same time, a cinematic achievement unlike anything ever seen before that it's bound to bring in new fans to Tolkien's literary masterpiece.",
            "review_date": "2022-02-27",
            "source": "rt"
        },
        {
            "content": "The Battle of Minas Tirith and Pelennor Fields is among the GREATEST battle sequences ever filmed. The Trilogy is still emotionally powerful after two decades.",
            "review_date": "2022-02-27",
            "source": "rt"
        },
        {
            "content": "I admit it, I love all three Lord of the Rings films. People may say Return of the King is the best of the trilogy, some may say it is the worst. I personally think Two Towers is the best for its scope and better exploration of some of the characters, but while it is still great Return of the King is better than Fellowship of the Ring.\n\nMy only slight disappointment is the ending, it does feel overlong and bloated for me, almost as if there was more than one ending filmed. That said, what does make the ending at least watchable for me is the way it is shot, the marvellous score and the performance of Gollum.\n\nDespite this minor discrepancy, Return of the King is extremely good and in my view one of the better Best Picture winners last decade. Peter Jackson's direction is very impressive here, and the scope is massive and just dazzling to watch. All three films of the trilogy are very well made, but Return of the King defines the term epic. The cinematography is mind-blowing, the scenery is superb, the costumes and make-up are well tailored, the effects are superb and don't distract too much and the lighting is authentic.\n\nThe score is phenomenal. Fellowship of the Ring had some ethereal, rousing, haunting and charming themes, whereas Two Towers was somewhat darker and more complex. Return of the King merges these together and the result is a perfect mixture of charm, darkness, etherality and complexity. The story is compelling with themes of friendship, strength and loyalty, the screenplay is well-written and literate and while the film is very long the three hours or so fly by seamlessly. The characters are engaging, Aragorn is even more interesting here than he is in the previous films while Gollum continues to steal every scene he appears in.\n\nThe acting is very good. Orlando Bloom(who I can find dashing yet uncharismatic and bland) and John Rhys-Davies are given less to do but do carry their parts very well, and Elijah Wood is likable enough. Sean Astin captures Sam perfectly and provides the heart of the picture, and Viggo Mortenssen is at his charismatic best here. Ian McKellen is perfectly cast, while the design of Gollum is still superb and Andy Serkis is equally phenomenal. I was slightly disappointed by the lack of any Sarauman, but I was more than I was satisfied with the final result.\n\nAll in all, an outstanding entry to a great trilogy. 10/10 Bethany Cox",
            "review_date": "2022-02-24",
            "source": "rt"
        },
        {
            "content": "The best final to a trilogy in cinematic history, unlike some i dont mind its bloated length.",
            "review_date": "2022-02-23",
            "source": "rt"
        },
        {
            "content": "The goosebumps this film gave me were life changing. I will never be the same.\n\nThe first hour of The Return of the King is absolutely dreadful. Pointless dialogue, loathsome characters, poor acting choices… it's pretty bad. But boy does it pick up. And when it does, you better not blink because you'll miss something.\n\nSome things I thought while watching:\nI counted two wilhelm screams… as stated before, it's not a proper fight scene without one!\nGimli is still the best character, Aragorn is still awesome, and Legolas is still performed poorly (acting wise).\nI rather liked Smeagol… he was cute(?) for a minute there. Plus he's a master class deceiver and that's pretty sick\nHow many times is Sam going to say \"Mr. Frodo!\"\nThe SCORE!!!! I will never get over how the score(s) made me feel. The emotions start stirring HEAVILY\nWow Frodo was the absolute worst the entire first two movies but hey maybe I like him in this one\nI've said it once and I'll say it again, Gandolf is FAST like he's apparently 24,000 years old and dude can sprint!!! It's insane\nPLEASE JUST LET GO!\nSo THATS why it's called The Return of the King!\nGood heavens this ending is devastating.\n\nIt's good. It's great even. Honestly, it's amazing. It's the most captivating series I've ever watched. It's gorgeous, it's emotional, it's action packed, and it made me cry way too many times. Easy five star. The last two hours are freaking phenomenal!",
            "review_date": "2022-02-23",
            "source": "rt"
        },
        {
            "content": "Characters (9.5/10)\nCinematography (9.5/10)\nPlot (10/10)\nActing (8/10)\nPacing (9/10)\n92%",
            "review_date": "2022-02-19",
            "source": "rt"
        },
        {
            "content": "It's the weakest in the trilogy [partly because we were already inured to how beautifully and faithfully the world was rendered by the previous two movies], but it's still a fittingly epic and bittersweet finale.",
            "review_date": "2022-02-18",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies of all time.",
            "review_date": "2022-02-18",
            "source": "rt"
        },
        {
            "content": "The LOTR trilogy are the best movies of all times! I loved the books and love the movies!",
            "review_date": "2022-02-17",
            "source": "rt"
        },
        {
            "content": "Best adaptation of a book in cinematic history, simply SPETACULAR",
            "review_date": "2022-02-15",
            "source": "rt"
        },
        {
            "content": "An emotionally charged ending to a historic trilogy. GO WATCH IT GODDAMN IT",
            "review_date": "2022-02-03",
            "source": "rt"
        },
        {
            "content": "A perfect ending for a perfect trilogy.",
            "review_date": "2022-02-01",
            "source": "rt"
        },
        {
            "content": "Still the peak of fantasy cinema. Even if the visual effects have started to look a little ropey, the heart and wonder of this epic trilogy remains as powerful as ever.",
            "review_date": "2022-01-27",
            "source": "rt"
        },
        {
            "content": "Perhaps the greatest cinematic achievement of all time.",
            "review_date": "2022-01-23",
            "source": "rt"
        },
        {
            "content": "The end of one of the greatest stories that's every been written and in these three movies it perfectly came to live. Applause for everybody who worked on this great project. In my opinion a must see for every movie fan.",
            "review_date": "2022-01-19",
            "source": "rt"
        },
        {
            "content": "The best Lord of The Rings movie in my opinion. Peter Jackson and the actors have made this movie absolutely brilliant! I'm impressed that they have succeeded making almost 3,5 h so intense. The story is great and Frodo's journey ends in a big way.\nWhen you have watched the series of movies you'll not get dissapointed over the big final.",
            "review_date": "2022-01-18",
            "source": "rt"
        },
        {
            "content": "With the familiar grandiosity, beauty, and heart, The Return of the King exceeds expectations in closing this legendary trilogy.",
            "review_date": "2022-01-09",
            "source": "rt"
        },
        {
            "content": "How is this movie not %100 positive reviews. It is a masterpiece.",
            "review_date": "2021-12-27",
            "source": "rt"
        },
        {
            "content": "The epic conclusion to the greatest fantasy story ever",
            "review_date": "2021-12-25",
            "source": "rt"
        },
        {
            "content": "The massive scale and conclusion that this film brings to cinema is just unprecedented. I would still rank this film behind the first film, but this one definitely pulled off the harder task, and did so with flying colors.",
            "review_date": "2021-12-22",
            "source": "rt"
        },
        {
            "content": "Never get tired of watching these movies. A Absolute masterpiece!",
            "review_date": "2021-12-19",
            "source": "rt"
        },
        {
            "content": "A triumph from start to finish. This end cap to the epic trilogy is perfection.",
            "review_date": "2021-12-19",
            "source": "rt"
        },
        {
            "content": "It's one of the best movies ever made, a truly piece of art that makes justice to the book (something that was almost impossible).",
            "review_date": "2021-12-17",
            "source": "rt"
        },
        {
            "content": "A breathtaking, powerful and rewarding way to finish the story in every way with little to no flaws which make this a perfect end to a fantastic trilogy.",
            "review_date": "2021-12-14",
            "source": "rt"
        },
        {
            "content": "Best of the best! Casting, director, history, everything",
            "review_date": "2021-12-07",
            "source": "rt"
        },
        {
            "content": "O meu filme preferido e o do meu pai. É muito semelhante ao livro",
            "review_date": "2021-11-25",
            "source": "rt"
        },
        {
            "content": "Simply The Best Movie two.",
            "review_date": "2021-11-16",
            "source": "rt"
        },
        {
            "content": "With a more than satisfying conclusion and groundbreaking action sequences, \"The Return of the King\" serves as the best film in this trilogy, with an outstanding and emotional story that will make you tearful at the end. A fantastic must-see conclusion to this must-see trilogy.",
            "review_date": "2021-11-15",
            "source": "rt"
        },
        {
            "content": "Never watched a movie with so many endings but still holds up",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "A young hobbit completes his task, and a New King of Gondor rises. No words. except…What. A. finale! It is rare that a third movie ends up being not only being the best in the trilogy, but also the winner of Best Motion Picture at the 2004 Oscars. (Too bad the Oscars have now gone to crap) An epic and emotional final chapter which 3 hour run time is justified, in my opinion. All three Movies have stayed 99% accurate to the Tolkien Books and amazed the heck out of me! You may be in tears (of joy) before the end.",
            "review_date": "2021-11-10",
            "source": "rt"
        },
        {
            "content": "Ha fatto la storia del cinema questo film",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "Probably my favorite movie of all time, The Return of the King is an outstanding climax to one of, if not, the greatest trilogy of all time.  I still binge watch the trilogy every few months and was fortunate to have the Lord of the Rings around when I was growing up.  While many don't believe the final chapter is the best of the three, I have never felt as personally attached to a cast and movie than I was/am with Return of the King.  The infamous Minas Tirith battle scene, the heroics at the Black Gate, Arogorn's speech, the brotherhood between Legolas and Gimli, the corruption of Frodo by the Ring... it's just cinematic perfection and there may never be a movie series to rival LOTR, particularly not in the fantasy genre.  Whether you've read the books or not, anyone who enjoys fantasy should watch this trilogy at least once in their lifetime.",
            "review_date": "2021-11-03",
            "source": "rt"
        },
        {
            "content": "Is this one the best movie of all time? It's certainly up there for me",
            "review_date": "2021-10-26",
            "source": "rt"
        },
        {
            "content": "Lord of the Rings – The return of the King Review\nOne word, Perfection. From the details of each scene of this movie, from lighting to the green screen production making it realistic, from acting, this was one of the best series of movies and yet one of the best endings to a movie sequel. The music choices which each scene added so much to the way those parts felt. Everything flowed so naturally and so perfectly. Almost as if it was just a piece of cake to create this movie which was obviously not true. The acting is phenomenal. The director literally directed this movie to a legit PERFECTION. Knowing how to create the emotion for the actors on the right moments. The screen editors did a perfect flow to each scene. From romance, to horror, to action, every cut of this film was perfectly made to make you have this feeling to it. The wardrobe was correctly done to fit every characters character. Nothing was overdone or underdone. This is by far one of my favorite movie sequels. A movie where it would make you want to watch over and over again.",
            "review_date": "2021-10-22",
            "source": "rt"
        },
        {
            "content": "This is it. The best movie of all time!\nEverything in it was ahead of its time, still not beaten after 20 years. The sets, visual effects and landscapes are beyond anything else, epic fight scenes and emotional scenes for the character development are put well together. The end is very emotional, the beginning very epic. The only bad thing is, that 3 (or 4 in terms of special extended edition) hours aren't enough to adapt the book. No matter how often you watch it, it lacks getting boring.",
            "review_date": "2021-10-14",
            "source": "rt"
        },
        {
            "content": "Melhor que o segundo, um desfecho incrível para a saga. A direção de filmagem nos três filmes é simplesmente incrível, por mais que as vezes exagerem na câmera lenta.",
            "review_date": "2021-10-05",
            "source": "rt"
        },
        {
            "content": "the best movie in the trilogy and it ends it perfectley",
            "review_date": "2021-10-02",
            "source": "rt"
        },
        {
            "content": "This movie is obviously fantastic regardless, but I am quite surprised it's the highest rated of the trilogy. It adapts by far the worst source material of the three and really pays the price for it with one of the worst cases of deus ex machina in movie history (the ghosts); the director thankfully chose to excise the worst chapter of writing Tolkien ever produced, that being the Hobbits returning to the Shire to find that Saruman has taken it over, but a lot of the buildup to Frodo's eventual character-ruining refusal to destroy the ring was internal and wasn't conveyed in the movie. We are instead left with a protagonist (who had already become worthless halfway through the second movie) making a heel turn long after all respect for him had been lost.   I think a few of the Oscar wins this received was based on accrued appreciation for the trilogy as a whole and a lack of significant competition in '03. There was still plenty to enjoy here, especially the epilogue, and making this movie at all was a tremendous achievement by the filmmakers.",
            "review_date": "2021-09-29",
            "source": "rt"
        },
        {
            "content": "Ive seen it before a while ago and Its still my favorite movie of all time.",
            "review_date": "2021-09-22",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time, AWESOME on the big screen!! I laughed, I cried, I loved every minute!! The extended editions of all 3 LOTR movies are SO MUCH BETTER than the shorter versions!! MUST SEE!!",
            "review_date": "2021-09-20",
            "source": "rt"
        },
        {
            "content": "This is the best one out of the 3 and definitely deserved the 11 oscars it won, dont watch the theatrical cut watch the extended cut its 4 and a half hours but its just better.",
            "review_date": "2021-09-13",
            "source": "rt"
        },
        {
            "content": "I come back year after year what a trilogy you will either completely love or be bored senseless not much in between.",
            "review_date": "2021-09-12",
            "source": "rt"
        },
        {
            "content": "Must watch once in your lifetime",
            "review_date": "2021-09-11",
            "source": "rt"
        },
        {
            "content": "In every sense, this movie brought it all with emotional and terrifying stakes, epicness with impressive battle scenes, and a good wrap up for (most) of the characters and their arcs. THIS is the movie that makes the franchise in my opinion.",
            "review_date": "2021-08-21",
            "source": "rt"
        },
        {
            "content": "Overall, I don't think this is as strong a film as the first two, but it has moments within that are the best in the entire trilogy (Shelob's Lair, the Tower of Cirith Ungol). This is an incredibly long film, which would benefit from trimming in certain places, namely in some of the battle scenes, and also the last half hour isn't handled that well. But, still, what a spectacle. The Lord of the Rings trilogy consists of what are undeniably the best movies of their genre.",
            "review_date": "2021-08-20",
            "source": "rt"
        },
        {
            "content": "A triumphant resolution for Peter Jackson's occasionally maddening, but overall more than worthy trilogy. It keeps the viewer on the edge of the seat, long enough for the perfect ending - almost entirely satisfying, but not quite, as the characters are, only fairly, damaged by their experiences. It's honest about life in that way.",
            "review_date": "2021-08-18",
            "source": "rt"
        },
        {
            "content": "Grond will breach it.",
            "review_date": "2021-08-10",
            "source": "rt"
        },
        {
            "content": "An amazing end to an epic trilogy, but unfortunately it lags just a little behind the other movies. Lovers of the books will know a few major plot points aren't covered",
            "review_date": "2021-08-09",
            "source": "rt"
        },
        {
            "content": "O filme é perfeito, é um fim de um ciclo de 3 anos, marcado por um final iminente e maravilhoso, mas ao mesmo tempo inovador, a forma como a batalha de Gondor acontece, mesmo com poucas esperanças a luta é levada ate o fim, a persistência de Frodo e Sam e avassaladora, mesmo com todas as dificuldades desde a Sociedade do Anel, o reconhecimento de toda a terra media por Frodo e seus companheiros e surpreendente, claro que o filme peca em alguns quesitos como a ausência de Thranduil e dos habitantes da floresta ou ate mesmo dos magos azuis, mas isso algo irrelevante, pois o filme dribla todas essas ausências, e torna o filme incrível, não seria nenhum exagero falar que esse filme junto com toda a trilogia e a maior/melhor produção que já foi produzido, não atoa que os prêmios são justos, Senhor dos Anéis é incrível.",
            "review_date": "2021-08-02",
            "source": "rt"
        },
        {
            "content": "a film series that shaped many, of the right age, that hold ups not just itself, but 2 of the 3 prequels that were lubed up and slid out the door. \n\nmaster class in film making, although not the most subtle. and the subtly is mostly tolkein.",
            "review_date": "2021-08-01",
            "source": "rt"
        },
        {
            "content": "The Lord Of The Rings: The Return Of The King is one of the best movies ever made. The battle scenes are thrilling, the stakes are high, and the soundtrack is out of this world good. It also blends the tension we had in the Fellowship Of The Ring with the relief we felt in the Two Towers, and it makes us feel a lot of emotions. It provides the viewers with a satisfying and bitter sweet ending. Combine all these elements together, and you've an extremely rewatchable film. The fact that it only gets 86% on the audience score is criminal.",
            "review_date": "2021-07-29",
            "source": "rt"
        },
        {
            "content": "An incredible ending to the best trilogy of all time that can't be changed in the slightest which leaves you upset when seeing the credits open even when being just under 4 hours long! BUT leaves you with one of the best soundtracks to stare at your tv to.",
            "review_date": "2021-07-27",
            "source": "rt"
        },
        {
            "content": "Congratulations Peter Jackson you adapted to the screen the most famous work of fantasy and make it a good final. 8/10",
            "review_date": "2021-07-25",
            "source": "rt"
        },
        {
            "content": "The very end of the movie drags like crazy, but you had to tie all those stories up so I get it.  Least of the trilogy but still great.",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "A phenomenal ending to the greatest movie series of all time.",
            "review_date": "2021-07-18",
            "source": "rt"
        },
        {
            "content": "Best movies of all time!",
            "review_date": "2021-07-09",
            "source": "rt"
        },
        {
            "content": "An incredible movie. My non-spoiler advice is to go watch it immediately.",
            "review_date": "2021-07-05",
            "source": "rt"
        },
        {
            "content": "(Mainly Based on Extended Version): 8/10. 80/100",
            "review_date": "2021-06-28",
            "source": "rt"
        },
        {
            "content": "It's a very good film. Great special effects, script and acting",
            "review_date": "2021-06-27",
            "source": "rt"
        },
        {
            "content": "This is the best film based on a book that could ever exist. Also it is one of my favorite movies of all time",
            "review_date": "2021-06-26",
            "source": "rt"
        },
        {
            "content": "The writing is inferior to the book by orders of magnitude. Too much is left out and the   alterations made by the screenwriters are all detrimental to the story. You could've scraped the velveeta cheese of some of the scenes with their sappy, soap operaesque dialogue.  Yes, the music and scenery are nice but these Jackson films are but a wraith compared to the real thing. I hope talented filmmakers and writers of the future can come along to make an authentic, faithful screen representation some day, maybe as a long running series. Skip the films and read the books",
            "review_date": "2021-06-26",
            "source": "rt"
        },
        {
            "content": "This is my third and final review of the trilogy. In the first movie's review I called it an RPG game and mentioned on how the world building was done adn how great the visuals were. In the second review I said it was like watching a book come to life and talked about the character development and philosophy/message the movie gave. In this third review I have called it an art and here I will talk about the story and why it will be remembered not just as a masterpiece, but also as a legacy. Keep in mind that all the reviews have been written separately but all of them imply to all three movies.\n\nThe Lord of the Rings is one long story that has been divided equally among three movies. Because of this there is virtually no major difference between the them, and all the three movies have received almost the same ratings. Normally in trilogies the stories do not directly pick up from where the last one left but rather these are three different stories, because of which it is possible to have two great movies and one movie which does not live up to them (Sam Raimi's Spider-Man, Christopher Nolan's Batman, the original Star Wars trilogy, Godfather etc), or there is one great movie while the other two don't live up to that (Zack Snyder's Superman, Star Wars prequel and sequel trilogies, Jurassic Park etc).\n\nHere the risk was much bigger. Since there is just one story, either the entire trilogy would have been good or the entire trilogy would have been bad. This is why the movies were so long. The story is set in a fantasy world and not everyone has read the original books by JRR Tolkien. So Peter Jackson had to elaborate every minor detail. There should have been no questions left. The audience should've had a clear idea of what they were watching. Normally such things are only possible in TV shows which are book adaptations like Game of Thrones or The Man in the High Castle since they have enough time in their hands to explain everything. This, however, was a movie series. This is the reason why the runtime is so long. The total runtime of the trilogy is 10+ hours, and 12+ hours if you watch the extended cut.\n\nAnother major problem that could have plagued this movie, if it wasn't addressed, was the number of characters and the fact that all of them were in different places doing different things. There were some minor characters right in the beginning of the story and some in the middle. All of them had to be humanised, something which is possible only if we get to know more about them. Because of this the story is moved forward such that we are made to care about all of the people. While we ask what happened to Gimli and Legolas in the battle, we are also worried that Frodo has been tricked by Gollum and is about to be eaten by a giant spider. The direction does not shift in the bias of any of the characters, otherwise the ones the audience cares about would have been left behind. People often make fun of the half-hour long epilogue shown in the end of The Return of the King, but imagine if it was not there. So many characters would have received vague endings. This was meant to assure that all the good characters got good endings and the bad guys got bad endings.\n\nI'd also take a moment to talk about Gimli and Legolas' relation. In the beginning they both hated each other but later on they grow to become friends. This is another great message that the movie sends us. In my previous review of philosophy I didn't mention it because it was seen in this movie. It talks about how we hate some people based on their appearance, their beliefs, their way of life. But we end up becoming friends with those same people once we actually interact with them. People were never meant to hate each other. This is something we are taught to do. This is also seen when Aragorn unleases the Army of the Dead. They never wanted to work with the living because of their hatred, but when one of them came forward and made the request, they gave in. It is these small moments that show the humanity in all the characters.\n\nAnd finally, what makes it a legacy? Today everyone knows about The Lord of the Rings. Gandalf is the first thing someone imagines when they hear the word \"wizard\", in spite of there being a more popular book adaptation movie franchise which is literally about wizards. So many RPG games have their stories set in the manner of \"some characters with different abilities go out on a dangerous yet exotic adventure\". Elijah Wood has become world famous for his role as Frodo Baggins. Gollum, in spite of being the same annoying character found in all fantasy movies, is more popular than Jar Jar or Dobby. All of this is possible because of the way the story unfolds. Everyone who was evil was simply so because of the circumstances, and those who were good were because of how much the story emphasised on their actions. This coupled with great direction and a good world building made it so popular.\n\nThe Lord of the Rings is one of the era defining movies of our times. It looks like a painting brought to life, one that we used to look at in fairy tales and nursery rhymes. It is the first thing that comes to someone's mind when they think of a fantasy adventure set in the medieval era. The patience of the creators and the fans is what made this trilogy so powerful. I really hope we get to see more such adaptations of books that we haven't heard about. This one has made a benchmark that will be hard to reach in the near future unless a miracle happens.",
            "review_date": "2021-06-22",
            "source": "rt"
        },
        {
            "content": "Lord of the Rings: Return of the King is the best ending imaginable to this incredible trilogy. The characters continue to shine, most notably Frodo, Sam, Merry, Pippin, Gandalf and Aragorn in this movie. With the Battle of Helm's Deep won and Saruman dead, the stage is set for the final battle in this epic saga. Upon finding that Sauron plans to strike the city of Minas Tirith, the heart of Gondor, Gandalf and Pippin ride to the city only to find Denethor, a madman in control of the city who is totally unfit to be the Steward. Eventually, the forces of Gondor, Rohan, Eriador and Mordor all coincide at Minas Tirith for the largest and in my opinion, best battle not only in this saga, but in all of cinematic history. Every scene in this movie holds weight to it, it is my favourite in the trilogy and seeing Aragorn finally take his place becoming King of the Reunited Kingdom always brings a tear to my black heart. This movie, like every other in the trilogy is flawless and I will rewatch these movies until the day I die.",
            "review_date": "2021-06-09",
            "source": "rt"
        },
        {
            "content": "(Extended edition)\n\nI've always found this the weakest of the trilogy and it is also by far the worst of the extended editions.\n\nThis suffers much more than The Two Towers from pointless additional scenes that add nothing to the film other than to bog down an already exceptionally long runtime. There's very few additions that I think make the film any better.\n\nThis is the only film in the trilogy where I'd rather watch the theatrical cut.",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "Amazing! A timeless classic",
            "review_date": "2021-06-03",
            "source": "rt"
        },
        {
            "content": "One of the most epic and entertaining movies ever made, Jackson created the perfect trilogy.",
            "review_date": "2021-06-01",
            "source": "rt"
        },
        {
            "content": "Masterpiece, can never be replicated.",
            "review_date": "2021-05-31",
            "source": "rt"
        },
        {
            "content": "The Return of the King is an absolute masterpiece and truly the greatest epic ever created. \"My friends, you bow to no one\".",
            "review_date": "2021-05-30",
            "source": "rt"
        },
        {
            "content": "While this final entry is not as borderline-perfect as Fellowship was, it is a legitimately outstanding film in virtually every respect, and a notable improvement over The Two Towers.  Yes, one can point and talk smack, so to speak, about the multiple endings, but to be honest this story is rich, these characters deep and their journeys meaningful to the point where I am fine with these many endings, as a story like this cannot just wrap-up minimal fanfare or cathartic resolution.  In terms of acting as the Climax of the Trilogy, is most certainly contains the most adrenaline-pumping sequences, almost all of them top-tier excellent, and the emotional payoff to this Trilogy is highly effective.  The performances are solid-to-excellent across the board, and as before, the Artistic and Technical merits are both outstanding.  Like the others, it has stood the test of time, it now being 18 years old at the time of my review, and while I am certainly open to the idea of more Middle Earth content existing to expand upon this Tale (some games like War in the North and Shadow of Mordor doing a surprisingly good job), I genuinely hope they don't attempt to tell the Lord of the Rings (proper) ever again, as it might very well be impossible to do better than this Trilogy did.  It's inspirational, it's emotional, it will make you cheer and will make your eyes watery, and all three of these have rightfully gone into the History Books of Cinema.",
            "review_date": "2021-05-25",
            "source": "rt"
        },
        {
            "content": "A little less funny than Part 1!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-05-24",
            "source": "rt"
        },
        {
            "content": "This is my favorite movie/book of all time.",
            "review_date": "2021-05-20",
            "source": "rt"
        },
        {
            "content": "This is easily the best fantasy trilogy ever, thanks to being a great adaptation from the best fantasy trilogy books ever",
            "review_date": "2021-05-15",
            "source": "rt"
        },
        {
            "content": "As one who is not really into fantasy films or novels, I concede the obvious: \"This film won the Academy Award for Best Picture at the 76th Academy Awards, where it also won all 11 awards for which it was nominated, including Best Director and Best Visual Effects. This remains the most Academy Awards won by a single film, and is the current record for the highest clean sweep at the Oscars. It also became the second sequel to win Best Picture, the first being The Godfather: Part II, and the second film series whose instalments have all won Best Visual Effects, after the original Star Wars Trilogy.\"\nThat pretty much says it all.",
            "review_date": "2021-05-15",
            "source": "rt"
        },
        {
            "content": "My 2nd favourite movie of all time",
            "review_date": "2021-05-10",
            "source": "rt"
        },
        {
            "content": "Three hours and 20 minutes of fun! The Lord of the Rings trilogy was made at that perfect moment when CGI had gotten good, but practical effects artists could still find jobs. The film looks fantastical, but things have weight at the same time. There will probably never be another fantasy film this good.",
            "review_date": "2021-05-07",
            "source": "rt"
        },
        {
            "content": "la trilogia de el señor de los anillos me parece el logro cinematográfico mas grande de la historia, no creo que se vuelva a ver algo asi en muchisimos años, sin duda es una obra maestra, es posiblemente la unica pelicula que llamaria asi sin lugar a dudas",
            "review_date": "2021-05-07",
            "source": "rt"
        },
        {
            "content": "Last night, I just finished watching this movie for the first time on HBO MAX along with the other two extended version movies, and my god, what a movie this was. I cried at the end of the film with happy and sad tears, and I'm still processing this movie's ending, as the story has been concluded. I felt like I was in the movie theater again, which made the experience even better. I can't believe that I've been putting these movies off for so long until now. Of course, there's the Hobbit, but I doubt that those movies could be as good as this trilogy does. This is no doubt that this is the best movie out of the three movies in the trilogy. It's a pure, cinematic masterpiece.",
            "review_date": "2021-05-01",
            "source": "rt"
        },
        {
            "content": "I shouldn't have to write a review defending a five star rating of return of the king.",
            "review_date": "2021-04-29",
            "source": "rt"
        },
        {
            "content": "Muy chula ha servido para traer videos promocionales del Burger King",
            "review_date": "2021-04-28",
            "source": "rt"
        },
        {
            "content": "My friend, you bow to no one.",
            "review_date": "2021-04-27",
            "source": "rt"
        },
        {
            "content": "The movie is awesome and epic",
            "review_date": "2021-04-26",
            "source": "rt"
        },
        {
            "content": "The best movie series of all time",
            "review_date": "2021-04-25",
            "source": "rt"
        },
        {
            "content": "Nooooo, say the Trilogy hasnt ended! Read Tolkiens books when I was 18 saw Jacksons genius adaptation on enormous movie screens in my 50s and now, at 71, this re-mastered film has lost none of its power and magic!",
            "review_date": "2021-04-25",
            "source": "rt"
        },
        {
            "content": "My favorite trilogy of all time.",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "es muy buena la pelicula, ver como frodo termina la mision y como aragorn toma el trono de gondor un final fascinante",
            "review_date": "2021-04-09",
            "source": "rt"
        },
        {
            "content": "A perfect conclusion.",
            "review_date": "2021-04-06",
            "source": "rt"
        },
        {
            "content": "Great to see it in a theater again!!",
            "review_date": "2021-03-30",
            "source": "rt"
        },
        {
            "content": "This movie makes me so intense every time I watch it. The best movie of the Lord of the Rings trilogy. It is also one of the best movies of all time.",
            "review_date": "2021-03-29",
            "source": "rt"
        },
        {
            "content": "Greatest movie ever made.",
            "review_date": "2021-03-27",
            "source": "rt"
        },
        {
            "content": "This trilogy. I am so blessed to have seen all 3 on the big screen back when they where released. I don't know what else to say. Those 3 movies are a part of me like nothing ever will be. I can't word it any better.",
            "review_date": "2021-03-24",
            "source": "rt"
        },
        {
            "content": "A fitting ending to the best trilogy ever. (Extended edition)",
            "review_date": "2021-03-21",
            "source": "rt"
        },
        {
            "content": "The ultimate conclusion to the ultimate trilogy that will forever be considered by many as the greatest of all time.",
            "review_date": "2021-03-17",
            "source": "rt"
        },
        {
            "content": "great battle scenes...",
            "review_date": "2021-03-07",
            "source": "rt"
        },
        {
            "content": "Esse filme é maravilhoso, uma verdadeira obra prima.",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "A welcome and well done conclusion to the trilogy. Nicely paced and each story is well told from that perspective. The tears will come flowing down your face with the bittersweet ending. A story of friendship and perseverance. Gandalf's speech about death is always a joy to watch and hear",
            "review_date": "2021-03-01",
            "source": "rt"
        },
        {
            "content": "an awesome conclusion to this trilogy with there being epic battles, emotional moments but it just feels like it never ends.",
            "review_date": "2021-02-26",
            "source": "rt"
        },
        {
            "content": "A truly epic story. Very beautiful and very well done in terms of bringing the source material to life. The characters are mostly not that deep, but there are many and their character conflicts are identifiable which helps engaging the viewer with the world. These conflicts are also, as a whole, very well settled, the films deserve high praise for ending so strong. The action is also very entertaining especially  when it comes to the big war scenarios, which set a whole new standard (at least when it comes to the genre). The score is also iconic. The extended versions may be worth a look, especially the third one.",
            "review_date": "2021-02-25",
            "source": "rt"
        },
        {
            "content": "O melhor filme de todos os tempos perdendo apenas para Vingadores Ultimato",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "Most Epic movie ever made",
            "review_date": "2021-02-23",
            "source": "rt"
        },
        {
            "content": "this was fucking epic",
            "review_date": "2021-02-22",
            "source": "rt"
        },
        {
            "content": "It’s Lord of the Rings. Not much more needs to be said at the epic ness and greatness of this trilogy!",
            "review_date": "2021-02-22",
            "source": "rt"
        },
        {
            "content": "I have loved this movie since it came out in 2003 and I was 9 yrs old seeing it in imax was a dream come true loved every second of it",
            "review_date": "2021-02-22",
            "source": "rt"
        },
        {
            "content": "An outstanding end to the trilogy.\n\nI expected a lot from 'The Lord of the Rings: The Return of the King' so I am delighted to see it produce on so many levels. I, funnily enough, wouldn't actually say it's necessarily the most perfect execution - what with the plot coincidences and extreme character armour. But that doesn't matter one jot whatsoever, as the story wraps up in arguably the best way - at least to watch - possible. It has so much heart and feeling to it.\n\nThe story involving the characters of Elijah Wood, Sean Astin and Andy Serkis remained the most interesting to me, I was very satisfied with how it concluded in regards to them. I also enjoyed the bits we got of Viggo Mortensen, Ian McKellen & Co. All that added to the beautiful look and creation of the film, with the world coming alive splendidly.\n\nIf I were to nit-pick further, I would say the run time is slightly too long. The pacing is absolutely fine, very good in fact, but I coulda done without a few of the many end scenes - a lot of which are necessary and welcome, but a couple could've been left out to allow the viewer to imagine how the world continued. That's just how I feel mind, I'm sure I'm one of only a few that think that way.\n\nBack onto the positives: how about those battle sequences? Astonishingly good. A sensational trilogy, no question about it. I look forward to seeing 'The Hobbit' films.",
            "review_date": "2021-02-19",
            "source": "rt"
        },
        {
            "content": "it was very good nice action out of it no dislikes said of it it's all very good",
            "review_date": "2021-02-19",
            "source": "rt"
        },
        {
            "content": "Greatest conclusion to the greatest trilogy in the history of film. Anyone who says otherwise is an idiot, plain and simple. ",
            "review_date": "2021-02-18",
            "source": "rt"
        },
        {
            "content": "One of the best movie, book",
            "review_date": "2021-02-17",
            "source": "rt"
        },
        {
            "content": "Really good! With a compelling story and cool new characters, this film does a great job at wrapping up the trilogy.",
            "review_date": "2021-02-16",
            "source": "rt"
        },
        {
            "content": "Yes its long but that doesn't diminish the quality of the film. This movie is the best of the three and the Lord of The Rings Trilogy are one of the best movie franchises ever made",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "This trilogy of movies matches the trilogy of volumes better than any other novel to movies I've ever seen.\n\nThe acting, costumes, sets, lighting, sound, directing, everything, is so spot on.\n\nIt's not a one for one novel to movies, but it doesn't need to be. It captured the novels from books to movies better than any other fantasy novel to movie I've ever seen.\n\nIt's a fantasy series that takes itself seriously, and had the budget and brains to do it right.\n\nIt set the bar. Gold Standard.",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "The Return of the King makes you feel tremendously satisfied with the Lord of the Rings trilogy... until you realize that there is still an hour and thirty minutes left. It takes the Two Towers' light faults and makes them into a massive slop of overlong and cheesy cgi gloating stuffed-up drawer of disappointment. it started off amazing, but what happened? Also, what was that hugging scene all about?",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "The characters, story and world are incredibly put together and Peter Jackson has done a fantastic job adapting the books.  I didn't know anything about Tolkien prior to the first in the trilogy being released so I read the Hobbit in preparation. What followed over the next three years watching these films was the most memorable movie experiences I've ever had. These films brought me to tears in certain parts, something which is exceptionally rare with me as I'm not an emotional person whatsoever. I read the trilogy after and still to this day hold Tolkiens world in high regard.",
            "review_date": "2021-02-02",
            "source": "rt"
        },
        {
            "content": "Hands down the biggest and greatest trilogy I have ever seen! This film is so epic on emotional, action and storytelling levels that it is impossible to put into words. In my opinion the greatest film of all time and it has definitely been recognized by its 11 Oscar wins! This is a must see film!",
            "review_date": "2021-01-28",
            "source": "rt"
        },
        {
            "content": "The final part of Peter Jackson's legendary trilogy rounds off the story around Frodo, Sam, Aragorn and co. in an outstanding way. After the first two parts followed the journey of the fateful ring and served as an ideal set-up for the final chapter, The Return of the King brings along everything we love: Action, emotional moments and, for the time, unthinkably artistic images and great visual effects.\n\nAs in the first two parts, the cast does not stand out for individual performance. It's the whole collective that makes the difference and once again shines with its unique chemistry. Above all, the interpersonal relationships come out even more in the third part. Frodo (Elijah Wood) and his loyal gardener Sam (Sean Astin) provide several scenes in which their unbreakable friendship and affection for each other becomes clear. Especially in the conflict with the malicious Gollum (Andy Serkis), these are constantly put to the test. Viggo Mortensen as Aragorn always seems like the insider protagonist. He acts very altruistically and never leaves the side of his allies. In interactions with the cheeky Gimli (John Rhys-Davies) and Legolas (Orlando Bloom) he also has quite funny moments. Ian McKellen is a fixed presence in his comeback as Gandalf, as he so often is, and makes us forget his absence from the second part with his wisdom and authenticity.\n\nEach part of The Lord of the Rings is special in its own way. What sets The Return of the King ahead of its two predecessors is that the story is told out in the almost three hours of running time. As a result, intense scenes take place almost every minute, which are captivating the audience. Contrary to other fantasy dramas, this one also does not contain too many cheesy moments. It is nevertheless a pity that the few female roles in this film are mostly reduced to these. Nevertheless, Peter Jackson has created a masterpiece with this trilogy that is still unrivalled, especially in terms of the visual factor. For the manageable resources available in the early 2000s, The Lord of the Rings paved the way for the technical revolution in Hollywood. The Return of the King is a closing chapter to this breathtaking three-parter.",
            "review_date": "2021-01-23",
            "source": "rt"
        },
        {
            "content": "Quite amazing, must watch, a classic.",
            "review_date": "2021-01-22",
            "source": "rt"
        },
        {
            "content": "Probably one of the best films ever made. The source material is so expansive that I appreciate the scope and vision of the film makers. There is a great awareness of JRR Tolkien's epic with living detail. There is some differences that are made by the film maker to make it able to be filmed. Saurman didn't appear in the shire at the end like in the book. It would have been anti-climactic to do so. The actors did a great job, the production team did as well as the make up artists. It is an epic for all ages.",
            "review_date": "2021-01-22",
            "source": "rt"
        },
        {
            "content": "The biggest, boldest, and most emotionally resonant of the three. While I can’t say I love this film (or any of them for that matter) it does deliver some great battle sequences and heartfelt character interactions. I don’t think Sam gets enough credit for his role in destroying the ring. He was so brave and smart compared to Frodo. A good finish but far too long ",
            "review_date": "2021-01-20",
            "source": "rt"
        },
        {
            "content": "One of the best movies and trilogies of all time. Personal favourite fantasy universum. Last movie of LOTR 3 movies with EXCELLENT ending and story. Peter Jackson skills and creation of Arda including middle earth by J. R. R. Tolkien made an perfect job. Must-see tier movie. This trilogy  cannot be judged poorly. \nS",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "At last, after spending almost a half-day now I think I can sleep with peace.",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "Possibly the best ending to a trilogy I've ever seen! One of the best movies ever!",
            "review_date": "2021-01-16",
            "source": "rt"
        },
        {
            "content": "best film ever nom de dieu !",
            "review_date": "2021-01-15",
            "source": "rt"
        },
        {
            "content": "A 10/10 experience in which the characters complete their journeys in an epic battle of good and evil.",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "It is one of the best movie I have ever watched!",
            "review_date": "2021-01-10",
            "source": "rt"
        },
        {
            "content": "Almost fantastically perfect, the final lotr installment brings a visual, emotional story that mostly holds up today, leaving audiences wanting more even past the 4hr mark.",
            "review_date": "2021-01-06",
            "source": "rt"
        },
        {
            "content": "The Lord of the Rings: The Return of the King is an absolutely epic fantasy movie. With gripping character drama, superb action, and a satisfying ending, the final part of this now iconic trilogy delivers with what it promised.",
            "review_date": "2021-01-02",
            "source": "rt"
        },
        {
            "content": "My first great love and I held each other and cried tears of sorrow, fear, and joy as we watched this in the movie theater. I will always treasure the memory. But tbh the end is just too dam* long. And the hobbits jumping on the bed is a little much.",
            "review_date": "2020-12-28",
            "source": "rt"
        },
        {
            "content": "An awesome finale to a great trilogy. It is incredible that a fantasy movie can be this remarkable.",
            "review_date": "2020-12-25",
            "source": "rt"
        },
        {
            "content": "This with jurassic park and endgame is in my top 3 favourite movies if all time, just pure perfection, the LOTR trilogy is the greatest trilogy of all time and the dark knight trilogy pales in comparision",
            "review_date": "2020-12-19",
            "source": "rt"
        },
        {
            "content": "What an amazing movie everything from the music to the sword fights were perfect. The story is one of the best I have ever seen in a blockbuster film",
            "review_date": "2020-12-17",
            "source": "rt"
        },
        {
            "content": "a melhor coisa desse filme e quando o smilgou morre!",
            "review_date": "2020-12-08",
            "source": "rt"
        },
        {
            "content": "Probably my favorite movie of all time. This wasn't really a movie. It was an experience. Every single aspect in film-making that I love is present here. Fantasy fan or not, this is an absolute must-watch I feel everyone should experience at least once in their lives",
            "review_date": "2020-11-24",
            "source": "rt"
        },
        {
            "content": "Would've been dope to see Sean Bean dressed like Gandalf was, other than that this movie was perfect, 97.5/100.",
            "review_date": "2020-11-17",
            "source": "rt"
        },
        {
            "content": "What a satisfying end to the trilogy. Granted this was my least favorite of the three films, but that's only because the other two were just that good. The tension between Frodo and Sam gets built up perfectly and the ending hits pretty hard emotionally. However, for such a long movie, a few plot points seem to have been skimmed over (what happened to Saruman?). It also felt pretty misogynistic that there were only three female characters, one was a spider, and the other two were in love with Aragorn, but in a way that's more a fault with the source material than with the movie. Thankfully the visuals and score are both flawless which makes it so that the movie never drags, despite it's serious runtime.",
            "review_date": "2020-11-16",
            "source": "rt"
        },
        {
            "content": "There's nothing to be said about this film that hasn't already been said. This film and series  deserve to have a 100% some of the best films ever made highly recommend",
            "review_date": "2020-11-12",
            "source": "rt"
        },
        {
            "content": "Return of the King is unparalleled in terms of quality when compared to other fantasy movies throughout film history.",
            "review_date": "2020-11-05",
            "source": "rt"
        },
        {
            "content": "The Return of the King concludes the best trilogy saga of all time with a BANGER on the edge of your seat of Hope.A triumph.THE BEST FILM OF ALL TIME",
            "review_date": "2020-10-28",
            "source": "rt"
        },
        {
            "content": "Return Of The King is an epic movie that contains a variety of amazing characters, developed storylines, amazingly large action sequences, great effects, fantastic score, beautiful visual look, and an impactful story about war, courage, love, hope, bondage, friendship, life, and death. It surprisingly never drags and it perfectly ends the trilogy. \n\nRating: A+",
            "review_date": "2020-10-16",
            "source": "rt"
        },
        {
            "content": "I can't described anything in this movie. Everything was supercalifragalisticexpiallidousios, The best movie that I have ever seen in my life. I can't found any single cons in this movie. The scoring was grande, the story was unpredictable and the design was WoW. Overall this movie gave us the moment that I can't forgot in my whole live.",
            "review_date": "2020-10-15",
            "source": "rt"
        },
        {
            "content": "The epic end to a awesome movie series!",
            "review_date": "2020-10-12",
            "source": "rt"
        },
        {
            "content": "An incredible conclusion to one of the greatest movie trilogies of all time.",
            "review_date": "2020-10-12",
            "source": "rt"
        },
        {
            "content": "Concluding an epic trilogy is no easy task, but somehow Peter Jackson (Director) accomplishes the impossible. Our characters on their journey all Recieve beautiful final story arcs and fulfilled all fans expectations of the popular novels. The scope once again is groundbreaking and the final battle is as epic as can be. The climax of the film is heartbreaking and worth every ounce of pay off leading upto this point. This is a perfect trilogy accross the board and even if remade in the future, I don’t think it will have the same natural Impact that Peter Jackson (Director) has created.",
            "review_date": "2020-10-04",
            "source": "rt"
        },
        {
            "content": "I recently got to watch this movie in IMAX and it is still an amazing movie. It's nearly three and a half hours long, but never leads me to boredom for a single moment which is something that can't even be said about movies half the length of it. Everything that's good about the previous two movies-- the score, the action, the story, the acting, the cinematography, the characters--is great about this movie. It takes it up a notch in terms of the amount of action and the amount of epic moments. To this day I still have not seen a movie in theaters that has matched the grandness of this film. Overall, an unbelievably tremendous wrap up to my favorite movie trilogy of all time. 5/5.",
            "review_date": "2020-10-01",
            "source": "rt"
        },
        {
            "content": "https://youtu.be/kOjwmGC6zXU",
            "review_date": "2020-10-01",
            "source": "rt"
        },
        {
            "content": "You know a movie is huge, when it gives you shivers after watching it more than 10 times...",
            "review_date": "2020-09-30",
            "source": "rt"
        },
        {
            "content": "My favorite movie of all time, Return of the King is a perfect movie. The visuals, sets, makeup, costumes and music are just as perfect as the previous movies, all the cast give expressive emotional performances, the stakes are incredibly high so it leads to an exciting and suspenseful movie, there are so many excellent character moments especially with Sam and Aragorn, the battle sequences are genuinely the best ever put to movie, it's perfectly paced with no boring parts and it's so emotional. Those last 30 minutes made me cry hard. This is how you end a trilogy. It ends the story and journey for each characters in an emotionally satisfying way and I could gush about how perfect it is for hours and hours. Also, that ‘For Frodo' line is the best line in the trilogy.",
            "review_date": "2020-09-28",
            "source": "rt"
        },
        {
            "content": "Un gran final para una de las mejores trilogías de todos los tiempos",
            "review_date": "2020-09-25",
            "source": "rt"
        },
        {
            "content": "No words can describe how absolutely incredible it is",
            "review_date": "2020-09-14",
            "source": "rt"
        },
        {
            "content": "I think the whole trilogy is a bit overrated. The story is overrated. The characters narrowly escape defeat several times. I never sensed any of the main characters were in any real danger and I knew they would be protected by their plot armor at every turn. All the main characters go through all this combat and all these battles where the odds are against them, and yet they emerge with hardly a scratch. Each of these movies is too damn long. You can't convince me this movie definitely had to be over 4 hours. There was plenty that could have been trimmed. And if they didn't want to do that, they desperately needed to break each of these films up into 2 movies. That said, the world-building is as good as any movie. The giant elephants and eagles and dragons and trees are all pretty cool. The story is just a bit too disney-like to me. The characters have minimal flaws and are never short on altruism or bravery. The characters are just not that believable. These are good movies but IMDB has all 3 of them in the top 15 all time. I would never put any of them that high. Still worth a watch at least once.",
            "review_date": "2020-09-13",
            "source": "rt"
        },
        {
            "content": "Honestly not a big fan of this one as I dont like massive battles Kinda boring :P",
            "review_date": "2020-09-12",
            "source": "rt"
        },
        {
            "content": "An absolute masterpiece and one of the best movies ever made.",
            "review_date": "2020-09-12",
            "source": "rt"
        },
        {
            "content": "Best book to movie adaptation EVER!",
            "review_date": "2020-09-07",
            "source": "rt"
        },
        {
            "content": "Lord of the rings movies are never dissapointing",
            "review_date": "2020-09-05",
            "source": "rt"
        },
        {
            "content": "Hands down the greatest film I've ever seen. I break it down into 4 categories  when judging a film.\nSetting: 10/10 - the world of middle earth is unmatched (thanks Nee Zealand)\nStoryline: 10/10 - Tolkien nailed it (would be 11)\nMusic: 10/10 - won those oscars for a reason\nCharacter quality: 10/10 - Aragorn, Gandalf, Sam and Gollum, need I say more. I will, I can't think of a single villain like Sauron, I can't think of a villain where you only really see him for around 5 minutes at the beginning of the ‘fellowship of the ring' yet he has such an effect throughout\n\n13 Acadamy Awards well earned (should be more for best actors)",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "One of the best movies of all time.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "This is one of the greatest sequels ever made, this film was epic and the action in this film was top notch. It is in my opinion, the best in \"The Lord of the Rings\" series, and my favorite film of 2003. Great film.",
            "review_date": "2020-08-27",
            "source": "rt"
        },
        {
            "content": "........(QUOTES NOT AVAILABLE)  JUST 100%",
            "review_date": "2020-08-27",
            "source": "rt"
        },
        {
            "content": "The outcome of the trilogy show how gorgeous is a Tolkien piece, the movie brings emotion, comedy like the others. The soundtrack one more time is a masterpiece of Howard Shore who add so much to the movie, Frodo and Sam show us what a short halfling from a hole in the ground can do for our world...",
            "review_date": "2020-08-26",
            "source": "rt"
        },
        {
            "content": "The Lord Of The Rings: The Return Of The King is such an amazing end to a brilliant trilogy, it was honestly a pleasure to watch this on the big screen.",
            "review_date": "2020-08-24",
            "source": "rt"
        },
        {
            "content": "Great movie, favorite parts is the scenes between legolas and gimli. As well as the story that sam’s path tells. Threw all three movies sams tell the strongest and most important and main story even though people are given a choice to choose to focus on sams story or Aragon story. The sams shows clear a path of determination, a story of a man that never would abandon his friend no matter wether his friend wants him because of that sam becomes the hero even though that never crossed his mind",
            "review_date": "2020-08-19",
            "source": "rt"
        },
        {
            "content": "A satisfying conclusion to an epic ride.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "This is one of the best movies of all time and definitely the best of the Lord of the Rings trilogy. The story is outstanding and even with it's very long runtime, it never has you bored.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "A brilliant and epic conclusion to an epic trilogy, combined with Jackson's direction, the script he co-wrote with Walsh and Boyens, the performances of the cast, Shore's score, Lesnie's cinematography, Selkirk's editing, Major's production design, Hennah and Lee's set decoration, Dickson and Taylor's costume design, action sequences, sound design and visual effects, The Return Of The King concludes this visually stunning trilogy with action-packed and character driven form!!!",
            "review_date": "2020-08-02",
            "source": "rt"
        },
        {
            "content": "Not quite as good as the first 2 but still an amazing movie.",
            "review_date": "2020-07-30",
            "source": "rt"
        },
        {
            "content": "A stunning masterpiece. One of the best films ever created. The extended edition is the superior version.",
            "review_date": "2020-07-28",
            "source": "rt"
        },
        {
            "content": "Peter Jackson's The Return of the King is one of those good fantasy films to end one of the most popular trilogies. Frodo (Elijah Wood), Sam (Sean Astin) and Gollum (Andy Serkis) travel to Mount Doom in Mordor to destroy the One Ring, only to be betrayed by Gollum. Gandalf (Ian McKellan), Legolas (Orlando Bloom), Aragorn (Viggo Mortensen) and the other Fellowship members team up with Theoden's army from Rohan, the Army of the Dead and the great eagles to defeat Sauron's army. Meanwhile, Arwen (Liv Tyler), worrying about the fate of Aragorn and Middle-Earth, chooses mortality and slowly dies during the war, only to live in the end. Normally, I don't get invested in these epic fantasy films or television series because it takes time to sink into the environments and characters before I confuse one name over another, like Brego (Aragorn's horse) with Snowmane (Theodon's horse). So when I see The Lord of the Rings (a franchise that contains hundreds of Hobbits, elves, warriors, monarchs, wizards or Orcs and has three-plus hours worth of films), I have to recognize the actors' faces or research them before I learn their character names, specifically for minor ones. However, that does not mean I can't watch The Return of the King and enjoy myself, especially if it's really good.  While I got invested in the epic battle in Pelennor Field with the Mumakil and Fell Beasts, I had resentment for the giant eagles which could have taken the Hobbits to Mount Doom and have them drop the ring in the lava. Also, unless you weren't suckered into seeing the extended cut, you ended up scratching your head wondering where Saruman (Christopher Lee) went since The Two Towers. Nitpicking aside, I enjoyed the action, the character interactions, the costume design, and the emotional ending. \n\n(4 Extended Blu Ray Versions out of 5)",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "A nearly perfect finale to a nearly perfect trilogy.  One of the best ever.",
            "review_date": "2020-07-18",
            "source": "rt"
        },
        {
            "content": "Final installment to one of the greatest trilogy of all times.  Stunning cinematography and special effects for the year 2000. Faithful to its source material. Great cast. Epic battles.",
            "review_date": "2020-07-16",
            "source": "rt"
        },
        {
            "content": "An excellent last adaptation of Tolkien's saga, though the runtime doesn't seem justified and the never-ending endings is irritating.",
            "review_date": "2020-07-08",
            "source": "rt"
        },
        {
            "content": "A+\n10/10\n...........",
            "review_date": "2020-07-07",
            "source": "rt"
        },
        {
            "content": "I absolutely love this film and it is my all-time favorite film and I don't think anything will surpass it ever. For this whole trilogy, it is about the journey and the end instead of the phrase \"Its about the journey, not the end\" and I think that it's about the journey and the end really sums up the whole trilogy. I love the character arcs in this film I really do to see Frodo change and to see Aragorn change really makes me feel good inside to see that I have experienced something truly amazing. This is one of the best films ever made and every aspect of film making is at its best in this film nothing will top the quality of this film in my opinion. I think of the whole trilogy as the three acts for Frodo the Fellowship is the first act exposition and the inciting incident and The Two Towers is the second act, rising action and Return of the King is the climax and the resolution that's how I think it is for everyone else it is the normal three act structure for everyone except for Frodo in my opinion. I just can't stop talking about the fabulous score it just is amazing and I don't know how some can not like at all. These films really challenge the morals of everyone in them especially Frodo with the ring. I love the costumes they made for the whole trilogy and I just learned that they filmed these back to back which is very interesting and I think that is the only film to ever do that. I love how all of the storylines just smoothly weave themselves together. If there is one actor that deserves an Oscar more than anyone in Hollywood right now it Andy Serkis I will preach it until he wins for motion capture because he is better at motion capture than some actors working today. The buildup to the battle/war at the end is amazing and will be one of the best battles ever created and put to screen. I love Elijah Wood's acting in this he has such an emotional range in this trilogy and it is kinda sad that he got snubbed. I love the spider sequence so much there is to much tension and suspense in that scene and the tension and suspense are created amazingly in this film and the set design I absolutely loved for the sequence. I love the final battle/war so much and when they are fighting and the score kicks in and it feels amazing and that's when you feel like you have waited for this since the beginning of Fellowship. That will remain my favorite battle of all time and this has some of my favorite scenes of all time and it will remain my favorite ending of all time and it will remain the best ending of all time in my opinion. The ending really paid off after we have been with everyone through this whole trilogy it is kinda sad to not see them in anything else. I can safely say that this is the best trilogy of all time and I have so much nostalgia for the whole franchise and I hope they release the Fellowship next year for the 20th anniversary. One thing I will say is that spoilers if you haven't seen it just read the next paragraph I love that they crown Aragorn and give the hobbits the respect that they need and deserve because without them they couldn't have returned the ring.\n\nI love the score and I will keep praising it until I die because dang if it is not the best score of all time and the most iconic in my opinion. The sound mixing and the sound editing is amazing in the war at the end with all of the action and the sound and the score it really feels like you are mixed with the amazing cinematography it really feels like you are there with them. I love the location for the final battle it looks amazing looking at New Zealand and the whole set looks amazing. Like before the color grading is amazing and looks amazing against the New Zealand background. The script is amazing and one of my favorites and the character development I absolutely love and finishing the character arcs just fills me with joy inside. I love the action in the final scene and it is better than some of the action films nowadays and the action in all is fabulous and it has two of my favorite battles of all time. The makeup and prosthetics look amazing, so much better than what the Hobbit did. Overall I would recommend this to everyone on the planet.\n💯%",
            "review_date": "2020-07-04",
            "source": "rt"
        },
        {
            "content": "Pure ART!Literally words can't describe the experience and emotions of the epic conclusion of the greatest Trilogy Ever!its literally a Masterpiece.the 3-4 War sequences were Goosebumps and the build-up and fights it was incredibly epic,the \"No Man\" scene at last was literally great.the journey of Hobbits with Ring ,the Gollum's and the fellowship members was satisfyingly concluded in-fact at the end it was so well made i was stunned for a while living it,the music and the visuals at last along with whole movie is literally A piece of ART!the Good-bye scene at last with the amazing background visual and awesome music with lot of emotions it was literally the greatest cinematic moment in the history it was brilliantly amazing,the whole movie is literally A Masterpiece,its literally one of the greatest movie ever made!",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "great movie best of the series ",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "The journey is complete. At the end of the road, all the action and all the suspense plays out in one of the greatest moments in movie history. That's what makes THE LORD OF THE RINGS: RETURN OF THE KING the perfect masterpiece for all movie lovers around the world.",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "An absolute cinematic masterpiece. This film is adventurous, action packed, and compelling.",
            "review_date": "2020-06-29",
            "source": "rt"
        },
        {
            "content": "the greatest movie had ever made. 4 hours without any boring moment amd the best end. I can't imagine how much that's was great. even with somethings like Gandalf's falcons but I can ignore that",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "This trilogy is truly perfect. There's absolutely nothing wrong with any of them",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "A very grand epic fantasy film. A terrific movie to end a terrific trilogy. Peter Jackson has done a great job of piercing action and emotion through the many different story paths throughout. The action scenes are very impressive and the production with the CGI creates a gorgeous world and landscape. High praise to the music throughout echoing the fantasy, the fighting and the impact of the ring. The cast is excellent with a script coming straight out the pages of Tolkien's book. Its hard to name a stand out as everyone does a great job, i enjoyed Sean Astin as Sam, Frodo's companion, Viggo Mortensen offers class and Ian McKellen is always watchable. The battle scenes containing so many characters and must have taken a long time to edit and the camera pans across many different angles as we look from a birds eyes view and close ups. Its looks and feels very dramatic. The make up of the army from Mordor is extremely impressive as a very horrific look. The emotional scenes strengthen the film, and i did tear up as Aragorn says you bow to know one to the Hobbits. The film is very long and could have finished earlier, but we need the sense that the Hobbits get back to real life and things try to get back to normal. It is fine for Sam but Frodo holding the ring has changed. The film feels very mythical and religious. Spiritual elements echo through the film. Frodo and Sams adventure leads to a spider which is a very frightening scene feeling very tense. One of the best fantasy films ever made, you sense the love of being involved from the actors, to the production team. A well deserved Oscar winner.",
            "review_date": "2020-06-21",
            "source": "rt"
        },
        {
            "content": "Great. Epic in the best way.",
            "review_date": "2020-06-19",
            "source": "rt"
        },
        {
            "content": "Continued directing mastery brings the fantasy saga to an end, even if it drags it's feet on which ending it wants to go with.",
            "review_date": "2020-06-19",
            "source": "rt"
        },
        {
            "content": "Only reason I'm taking half a star off is because I feel they could've cut the movie's runtime down. But I believe this is my favorite LOTR movie. One of the rare times when a sequel surpasses the original.",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "Was kind of pissed off the audience score was only an 86.",
            "review_date": "2020-06-13",
            "source": "rt"
        },
        {
            "content": "Incredible. Phenomenal in every way. I cannot say enough good things about these films.",
            "review_date": "2020-06-13",
            "source": "rt"
        },
        {
            "content": "The best film of all time.  Without question.  Return of the Kings continues to showcase the incredible amount of effort that went into the creation of the trilogy.  The dedication that was put forth into making Middle Earth seem visually tangible payed off a thousand times over.  (Huge shoutout to Weta Workshop)  Howard Shore delivers with a score that perfectly matches with Middle Earth, capturing its essence in musical form.  The cinematography is simply stunning.  Without a doubt, this film (and the entire Lord of the Rings trilogy) will go down in history as the greatest fantasy film series of all time.",
            "review_date": "2020-06-13",
            "source": "rt"
        },
        {
            "content": "Amazing ending to this blockbuster series! This movie is by far more intenser than the other 2. There's epic battle scenes which is quite enjoyable to see! This is one of the movies I would see again. Although the movie is quite long(3 hours 30 minutes) it is enjoyable to see. I give this 81% Rotten Tomatoes!",
            "review_date": "2020-06-06",
            "source": "rt"
        },
        {
            "content": "One of the greatest sequels ever made, this movie truly was epic and the action in this film was top notch. It is the best out of all \"The Lord of the Rings\" films, and my favorite film of 2003.",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "The cherry on top of the trilogy. This movie adaptation of Tolkiens' the Return of the King is breathtaking. The cast is phenomenal and the shots, cinematography, and script are perfect. The battle of Pelennor fields is a nail-biter; you almost feel yourself there in the midst of the battle. This is truly a masterpiece adaptation by Peter Jackson and a must-see for lord of the rings fans and people at large.",
            "review_date": "2020-05-30",
            "source": "rt"
        },
        {
            "content": "Return of the King is an incredible conclusion to one of the best trilogies ever made. We get satisfying conclusions to all the characters in the trilogy and the emotional, impactful and epic moments that the previous two films had been leading up to do not disappoint. We get a better look at Golem's character who is one of the most intriguing and the visual effects are stunning. Another must-see film from this incredible franchise.",
            "review_date": "2020-05-25",
            "source": "rt"
        },
        {
            "content": "A classic of our times, you must watch and re-watch it 3/3",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "There are so many iconic and incredible moments in this movie.  I watch the entire trilogy every few months and it NEVER gets old.  Some of the greatest movies ever made, without a doubt.",
            "review_date": "2020-05-23",
            "source": "rt"
        },
        {
            "content": "A mani basse il film piú bello mai esistito, la piú degna delle trasposizioni cinematografiche",
            "review_date": "2020-05-21",
            "source": "rt"
        },
        {
            "content": "Un asombroso final para la saga, llena de grandes efectos especiales y acción, convinado con el hilo de la historia. Se siente un poco más lenta que las anteriores pero se resiste mediante a la expectación de la última batalla en la Tierra Media. Emocionante y eficaz, finaliza la saga.",
            "review_date": "2020-05-18",
            "source": "rt"
        },
        {
            "content": "f**king brilliant. That's it. F**KING BRILLIANT",
            "review_date": "2020-05-14",
            "source": "rt"
        },
        {
            "content": "LOTR the return of the king is a great conclusion to the trilogy. The throw down is a great pay off. The movie has heart and emotion, and great music as well as perfect visuals. The best way to end a trilogy that will go down as one of the greatest.",
            "review_date": "2020-05-13",
            "source": "rt"
        },
        {
            "content": "A magestic conclusion to the saga of the One Ring, managing to overcome all expectations, keeping up to the two predecessors and establhising an epic, bittersweet and suiting finale for its characters and stories.",
            "review_date": "2020-05-12",
            "source": "rt"
        },
        {
            "content": "an epic ending for an equally epic adventure",
            "review_date": "2020-05-11",
            "source": "rt"
        },
        {
            "content": "Return of the King ends the trilogy in remarkable fashion",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "The Lord of The Rings: The Return of the King is by far my favorite film in the trilogy. Amazing performances, especially Viggo Mortenson. Full of action and intensity. Directed and written amazingly as this film gives us an extremely emotionally satisfying ending to one of the best fantasy trilogies. This is a must-see!",
            "review_date": "2020-05-09",
            "source": "rt"
        },
        {
            "content": "A fantastic ending to the best movie trilogy of all time. the Oscars speak for themselves. I recommend anyone who hasn't seen the extended cut to watch that.",
            "review_date": "2020-05-06",
            "source": "rt"
        },
        {
            "content": "An amazing ending to one of the best trilogies of all time. Amazing special effects for a movie made in the early 2000's",
            "review_date": "2020-05-06",
            "source": "rt"
        },
        {
            "content": "It's awesome - Absolute must see!",
            "review_date": "2020-04-29",
            "source": "rt"
        },
        {
            "content": "THE BEST MOVIE OF ALL TIME, AN ABSOLUTE MASTERPIECE OF CINEMA, MY FAVORITE MOVIE OF ALL TIME",
            "review_date": "2020-04-28",
            "source": "rt"
        },
        {
            "content": "Best of the three. Deserved the academy award",
            "review_date": "2020-04-26",
            "source": "rt"
        },
        {
            "content": "For something who tries desperately to be more than a \"really good movie\" the return of the king mostly succeeds",
            "review_date": "2020-04-25",
            "source": "rt"
        },
        {
            "content": "This movie has one of my favorite final scenes",
            "review_date": "2020-04-24",
            "source": "rt"
        },
        {
            "content": "Although it may stretch too long, its breathtaking visuals effects, epic action set pieces, compelling character arcs, and emotionally rewarding story make it for a satisfying conclusion to the lord of the rings trilogy and one of the best movies of all time. Its eleven Oscar wins are totally well deserved.",
            "review_date": "2020-04-23",
            "source": "rt"
        },
        {
            "content": "I love middle earth！",
            "review_date": "2020-04-22",
            "source": "rt"
        },
        {
            "content": "The conclusion to the epic trilogy has finally come, and it doesn't disappoint. Peter Jacksons visionary direction along with the emotionally gripping moments makes the third installment the best. The whole cast is great but the stand out is Sean Astin. A ton of character development ensues and he lights up onscreen. The visuals are ahead of its time and it creates a believable fantasy world that has so many possibilities. The Lord of the Rings is one of the best trilogies.",
            "review_date": "2020-04-20",
            "source": "rt"
        },
        {
            "content": "This movie is 100% better than Avengers Endgame. I wished we had something like this final battle sequence in Avengers Endgame.",
            "review_date": "2020-04-18",
            "source": "rt"
        },
        {
            "content": "This movie is better than the previous two, it is really good",
            "review_date": "2020-04-18",
            "source": "rt"
        },
        {
            "content": "There as few movies I would truly give 5 stars, this is one of them. The whole trilogy leads to this amazing conclusion. For drama and what you have invested in every character, it's the ultimate in a movie going experience. I would definitely List It in the top 10 movies of all kind. It's a truly exciting ending to a long journey for Frodo, Sam and the rest of the endearing characters",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "With the exception of never ending ending, was great finale. Return of the king!",
            "review_date": "2020-04-09",
            "source": "rt"
        },
        {
            "content": "Why the low rating guys? come on! This is one of the greatest film ever 86%? rate it 5 stars for goodness sake",
            "review_date": "2020-04-07",
            "source": "rt"
        },
        {
            "content": "the greatest movie of all time",
            "review_date": "2020-04-05",
            "source": "rt"
        },
        {
            "content": "A an epic milestone for fantasy movies, seventeen years later and still looking fresh. It was and will be my favorite movie ever.",
            "review_date": "2020-04-04",
            "source": "rt"
        },
        {
            "content": "The greatest chapter of this trilogy, which is the greatest movie series in the history of fantasy films.",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "A magnificent film, one of the greatest of all time, and worthy of all 11 Academy Awards that it won.",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "The Return of the King ends the Lord of the Rings franchise with some of the best battle scenes in the history of cinema.",
            "review_date": "2020-03-18",
            "source": "rt"
        },
        {
            "content": "I did not like all the gratuitous violence.",
            "review_date": "2020-03-16",
            "source": "rt"
        },
        {
            "content": "Great conclusion to one of the best film trilogies ever made!",
            "review_date": "2020-03-14",
            "source": "rt"
        },
        {
            "content": "After all this years and watching this movie countless times, for me this is still the best movie of all time not only in his genre. Just breathtaking",
            "review_date": "2020-03-11",
            "source": "rt"
        },
        {
            "content": "More that an exact copy of the book, the power, drama and fantastic adventure, it delivers what al fans wanted, also porves that a very long movie can be worthy and ends a trilogy that can be named as one of the best ever.",
            "review_date": "2020-03-09",
            "source": "rt"
        },
        {
            "content": "The front runner on this week's episode of \"How Many Endings Can a Film Have?\", even considering the tremendous expectations placed upon it by its predecessors, still feels satisfying. (4.5/5)",
            "review_date": "2020-03-04",
            "source": "rt"
        },
        {
            "content": "If you like elephants this is not the movie for you!",
            "review_date": "2020-03-03",
            "source": "rt"
        },
        {
            "content": "I love the series, never tire of watching them",
            "review_date": "2020-02-29",
            "source": "rt"
        },
        {
            "content": "This is the best of the trilogy in my opinion!\nSuperb acting and action scenes makes it just...one of the greatest films ever made!\nElijah Wood is great as Frodo Bagger and has help by the other great actors!\nWile the first two were great! This one was perfect!\nTruly a 10/10",
            "review_date": "2020-02-27",
            "source": "rt"
        },
        {
            "content": "Producing a beloved film trilogy, consistent in quality over all three films, is perhaps one of the biggest challenges in cinema, and after 17 years Return of the King still stands out as not only one of the greatest films of the fantasy genre ever made, but part of one of the greatest (and arguably most epic) film trilogies in cinematic history. Fellowship introduces us to the franchise, Two Towers gives us arguably the best character development and plot advancement, and Return of the King is essentially a three act epic within a larger three act epic; you could argue it's the \"ring cycle\" of fantasy cinema. The third instalment is a monumental piece of filmmaking, masterfully written and acted, visually everything about the film is breathtaking, and each plot strand ties into one another so incredibly well, as it has done since the Fellowship all went their separate ways. Elijah Wood absolutely knocks it out of the park as ever, portraying Frodo's gradual descent into the ring of power's control, and the physical and psychological toll it takes on him with absolute aplomb. Ian McKellen is always a domineering presence on stage or screen, and there could not have been a better cast for Gandalf if they had tried, this is where he really comes into his own as the kind hearted, yet fierce and noble white wizard. Whilst every cast member was spectacular, particular kudos has go to Andy Serkis, whom has become synonymous with the mentally unhinged Gollum/Sméagol, and seeing him portray the character's pre-ring self and subsequent descent into madness was an absolute joy. Visuals and acting aside, the real star of the show is Howard Shore's magnificent score, he must go down as one of the all-time greats of film composition, as the LOTR trilogy film score is one I could just sit and listen to on repeat. I could sit and gush about what makes this such an incredible achievement in cinema until the cows come home, all you need to know really is this: Lord of the Rings is a masterpiece of a trilogy, and anyone who thinks otherwise just doesn't understand it.",
            "review_date": "2020-02-26",
            "source": "rt"
        },
        {
            "content": "Absolutely enchanting. A must watch classic.",
            "review_date": "2020-02-25",
            "source": "rt"
        },
        {
            "content": "[⭐️99%]\n\nWith all trilogies, the third film wraps up everything established beforehand, however not many do it perfectly like The Return of the King (2003) does. The slow buildup of certain characters aims and storylines meet their satisfying end and high throughout this films long runtime. You take characters like Pippin and Merry who from the start felt like nothing more than just comedic relief characters and now have their own character arc and are essential to how the story plays out.\n\nDespite all of the emotional moments that have happened in the previous Lord of the Rings movies, The Return of the King (2003) hits the hardest thanks to its well constructed characters, scenes and dialogue.\n\nThe battles are some of the best ever put onscreen, moments are tense but at the end of the day, you simply cannot feel dissatisfied with the closing chapter to a fantastic trilogy.",
            "review_date": "2020-02-20",
            "source": "rt"
        },
        {
            "content": "Perfect,but Two Towers was just a tad better",
            "review_date": "2020-02-18",
            "source": "rt"
        },
        {
            "content": "The Return of the King after the two towers to me felt like a fantastic comeback, instead of lurking around certain scenes like the previous installment did at times, the return of the king dives right into the main focus of what is to come. Leading up to possibly one of the grandest wars in film history, its epic, its beautiful and poetic and certainly emotional.",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "Such a good film with a wonderful story line and characters. Definitely makes me want to read the books!",
            "review_date": "2020-02-12",
            "source": "rt"
        },
        {
            "content": "God tier, a true masterpiece of the craft",
            "review_date": "2020-02-10",
            "source": "rt"
        },
        {
            "content": "I recently finished the Lord of the Rings trilogy, and I felt pretty satisfied with the ending being The Return of the King. This movie was directed by Peter Jackson, and I feel it greatly portrayed Frodo and Sam's conclusion to their voyage. With the movie focusing on the destruction of the almighty and powerful Ring, that corrupts almost all that touch it and Frodo was tasked with the deliverance of it to Mount Doom. On the way there, he met the fabled Gollum who was a hobbit once born in the same shire, but got corrupted by the Ring. Sam and Frodo met him on their adventure, and since Gollum knew the way to the volcano better than both Sam and Frodo he lead them to there. The Gollum and Sméagol battle was brilliantly played out, and it started my love/hate feelings for the character. Gollum was the corrupted version of Sméagol, and he desire for getting the ring kept growing throughout the movie. The movie was the best of the trilogy in my opinion, and it was a beautiful coda to this masterpiece.",
            "review_date": "2020-02-10",
            "source": "rt"
        },
        {
            "content": "Amazing, but not the best. Expected more",
            "review_date": "2020-02-07",
            "source": "rt"
        },
        {
            "content": "Return of the King starts strong and although it loses steam in the middle, the spectacular battle, iconic design work and blistering finale pump it all up to the quality of its fore-films. \n\nThe film is peppered with cool moments, a dawn raid against the archers of Osgiliath has a total dungeons and dragons feel and Gollum is such a schemer and a villain he's toe-curlingly watchable. The Dead King and co. are a well realised, visually cool bunch of deus ex machina and Gandalf steeling Merry for death is a beautiful moment. The final battle flows extremely well, it's nothing tonally alike to the filthy last stand at Helms Deep, this is trained army vs trained army. The focus of Aragorn's conclusion to be crowned rightfully King is satisfying and the right icing on the cake. \n\nRegarding the extended edition, it's made weakest of the three only insofar as the theatrical of Return of the King is the most complete and impressive of the three. However, the opening scenes of Sauron are the most required and missed from the theatrical and I'm in favour of the many endings of this film because after 11 hours of movie, it earns the right to take an hour to draw to a close.",
            "review_date": "2020-02-06",
            "source": "rt"
        },
        {
            "content": "Best out of all movie",
            "review_date": "2020-02-06",
            "source": "rt"
        },
        {
            "content": "The culmination of the adaptation of the greatest fantasy series of the 20th century (perhaps ever). Acting, effects, dramatic storytelling, score, cinematography, costume, location, this film has it all in spades and then some. It's a worthy adaptation and deserves a watch from any moviegoer.",
            "review_date": "2020-02-02",
            "source": "rt"
        },
        {
            "content": "The most critically acclaimed film of all time (in terms of amount of Oscars won) – and deservedly so. One of the greatest achievement in cinema. Enough said.",
            "review_date": "2020-01-30",
            "source": "rt"
        },
        {
            "content": "This is my favorite Lord of the Rings movie. A great conclusion and one of my favorite movies.",
            "review_date": "2020-01-25",
            "source": "rt"
        },
        {
            "content": "Best Lord of the Rings movie in the trilogy!",
            "review_date": "2020-01-23",
            "source": "rt"
        },
        {
            "content": "Fun, exciting and epic because of the incredible direction by Peter Jackson, the spectacular script by Fran Walsh, Philippa Boyens and Jackson, the sublime special effects, the impeccable costume design, the perfect makeup, the shocking action scenes, the fabulous soundtrack by Howard Shore, the stunning cinematography by Andrew Lesnie and exceptional performances by Elijah Wood, Sean Astin, Andy Serkis, Ian McKellen, Viggo Mortensen, Cate Blanchett, John Rhys-Davies, Bernard Hill, Billy Boyd, Dominic Monaghan, Orlando Bloom, Hugo Weaving, Liv Tyler, Miranda Otto, David Wenham, Karl Urban, John Noble, Ian Holm and Sean Bean, The Lord of the Rings: The Return of the King concludes this practically perfect trilogy in a sensational and unforgettable way",
            "review_date": "2020-01-21",
            "source": "rt"
        },
        {
            "content": "THE GREATEST FILM OF ALL TIME NO QUESTIONS ASKED ESPECIALLY THE EXTENDED VERSION OF THE FILM",
            "review_date": "2020-01-13",
            "source": "rt"
        },
        {
            "content": "Flawless, greatest trilogy of all time.",
            "review_date": "2020-01-11",
            "source": "rt"
        },
        {
            "content": "After having so thoroughly nailed casting, setting, and plot, Peter Jackson took the ending and said, \"Bugger J.R.R. Tolkien, I'm just gonna wipe my big old Down Under with the ending the story deserves and give everyone a shiny, moronic 'Oh, sure, you actually can go home from war to a totally unchanged world.\"\n\nAfter noting the spectacular absence of Tom Bombadil and watching Wormtongue and Saruman die, I expected no less.\n\nI guess I should be grateful, since this lowered my expectations for The Hobbit by 50-75%. And, true to form, after milking THREE increasingly mundane movies out of the shortest book in the series, Peter never missed an opportunity to miss an opportunity.\n\nIf you've never read the books and loved the movies, don't bother. If you've read the books and somehow haven't seen the movies, give 'em a shot, but I'd recommend doing so with a few good beers and some strong glaucoma medicine.",
            "review_date": "2020-01-07",
            "source": "rt"
        },
        {
            "content": "Honestly, the single best ending to a story that has been done until today. It delivers the most satisfying ending you will find in the seventh art, the character development is on point, the emotions it elicits on the viewers are breathtaking, you will feel homesick for a place you have never been and missing people you have never meet. This movie, and the trilogy is a MUST WATCH.",
            "review_date": "2020-01-02",
            "source": "rt"
        },
        {
            "content": "A great ending to a terrific trilogy.",
            "review_date": "2019-12-29",
            "source": "rt"
        },
        {
            "content": "Greatest movie of all time. No question",
            "review_date": "2019-12-29",
            "source": "rt"
        },
        {
            "content": "Simplemente fantástica la batalla de gondor fue suprema un final que vale pena ver",
            "review_date": "2019-12-29",
            "source": "rt"
        },
        {
            "content": "This is the weakest of the three in the trilogy.  The extended cut saves this from being a mediocre film however in my opinion.",
            "review_date": "2019-12-28",
            "source": "rt"
        },
        {
            "content": "A satisfying conclusion to the most consistent trilogy in movie-history.",
            "review_date": "2019-12-28",
            "source": "rt"
        },
        {
            "content": "The best trilogy in the history of cinematography.",
            "review_date": "2019-12-26",
            "source": "rt"
        },
        {
            "content": "The greatest fantasy film that ever existed, it's not often that sequels outperform the original film, but RotK does! Watch the 4 & half hour extended edition and never look back, pure perfection.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "Although it is pointless to raise one of this trilogy's films over the others, as the final of the three, \"The Return of the King\" stands as the pinnacle of epic culmination. While the plot broadens into climactic stakes, our characters become more realized than ever through the enduring themes of friendship and courage. This film's fulfilling completion of the nine hour experience of \"The Lord of the Rings\" is bound to bring bittersweet tears and plenty of rewatches for every moviegoer.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "I don't need talk...",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "This is how a trilogy should be ended. The best of the history of movies.",
            "review_date": "2019-12-22",
            "source": "rt"
        },
        {
            "content": "I think this movie is way too long. You can make do with a 5 minute video that explains the whole plot, instead of watching fights and mythological creatures for 4 hours.",
            "review_date": "2019-12-21",
            "source": "rt"
        },
        {
            "content": "I love this movie now (the extended cut, I mean). It's so good after all these years. The best thing is it's faithful to the source material. I know Tolkien wasn't keen of this format, but I think it's the closest it will ever get to a faithful portrayal of his books in a movie.",
            "review_date": "2019-12-20",
            "source": "rt"
        },
        {
            "content": "Simply the best movie off all times",
            "review_date": "2019-12-19",
            "source": "rt"
        },
        {
            "content": "No doubt this is the best of the trilogy! Keeps the public attention all the time and have a beautiful soundtrack to make everything better",
            "review_date": "2019-12-19",
            "source": "rt"
        },
        {
            "content": "Well, this is the most epic movie of all time.",
            "review_date": "2019-11-10",
            "source": "rt"
        },
        {
            "content": "That will always be the best film that i ever seen in my entire life",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "The final instalment in one of the best movie trilogies of all time, The Lord of the Rings: The Return of the King improves upon its predecessors while being a marvelous adaptation of J.R.R. Tolkien's timeless novel, the Return of the King develops and improves upon the cast of characters, all the performances are flat out amazing, the action is plentiful and superb, the direction by Peter Jackson is flawless, the narrative is highly progressive and pretty much amazing and the movie is filled with kickass and emotional moments, all amounting to the perfect finale that is easily the best fantasy film of all time as well as one of the absolute greatest films ever made.",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "Amazing conclusion to an amazing franchise! Peter Jackson did a phenomenal job with these films in nearly every regard! ",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "This movie is my favorite of the trilogy. I can't help but cry every time I watch it. I'm always stunned, happy and sad at the same time when I watch this movie. It is an absolute masterpiece.",
            "review_date": "2019-10-22",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies ever made",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "Ending made me cry. This is the absolute greatest film in the history of cinema. We are very blessed for god to have sent this masterpiece down from up above. Incredible! Watch it now",
            "review_date": "2019-10-16",
            "source": "rt"
        },
        {
            "content": "Epic and majesty!\n\nThis review will be not so much about The Return of the King, but about the entire Lord of the Rings trilogy as a whole, because it is perceived by me as completely and unanimously as possible. I cannot divide this global history into parts, and therefore I will speak about everything here.\n\nSince I last watched The Lord of the Rings, 6 years have passed, which is probably the biggest break, and I decided to rediscover Middle-earth. Moreover, the Fellowship of the Ring recently celebrated its 20th anniversary. First time watching it with subtitles. I watched, of course, the director's versions, which I strongly recommend to everyone. If you have not watched the director's cuts of this trilogy, then you cannot assume that you have watched The Lord of the Rings at all. This is one of the few films where the theatrical versions are not really complete, which affects the perception.\n\nI see no point in writing something about this, without a doubt, the greatest film trilogy. Everyone knows everything and so - these are films in which all the elements converged in the best way: the script, director's work, camera work, cast and acting, special effects, makeup, costumes, music, atmosphere - absolutely everything! And such an epic saga was not filmed either before or after. Even Peter Jackson himself failed to repeat his success in The Hobbits. Everything that can be good in a movie is good here. The Oscar record speaks for itself, because at that time this award had not yet discredited itself.\n\nEven the Russian dubbing here is one of the best. This time I watched, of course, without him, but on some scenes I specifically included dubbing in order to listen and compare. And almost everywhere it is flawless! As if the original voices spoke in Russian!\n\nI actually just found out this year that there are people who don't like The Lord of the Rings! For me it was a surprise. Paradoxically, with each viewing, I love these films more and more and always find something new in them and somehow rediscover them. Not a single part seems boring or drawn out to me - everything is in its place.\n\nAnd The Return of the King, which is a whopping 4 hours long (I have never seen longer films), looks at all in one breath. I love long films in general, but other long films like The Godfathers, Once Upon a Time in America or The Irishman don't compare to the ease of watching the third Lord of the Rings. I don't know how the creators managed it, that 4 hours fly by faster than when watching some one and a half hour movies.\n\nSome blame the ending separately for the delay, but I think this is absolutely unjustified. In such a large-scale epic, there cannot be a quick end, because all the storylines must be closed. And 40 minutes of denouement was not even enough for me personally. The final scene is synonymous with the phrase \"light sadness.\" This is perhaps the only fictional universe on the screen that I really really did not want to say goodbye. Yes, I would generally watch these films for ages, if there was such an opportunity.\n\nThe Lord of the Rings is truly great. This one definitely deserves the status of a cult classic. I give the highest score to each film and the entire trilogy as a whole! Unconditional masterpieces!",
            "review_date": "2019-10-16",
            "source": "rt"
        },
        {
            "content": "This was our first time seeing the series.  I can’t believe it took this long to see it but it was worth the wait to see it in the theatre.  Amazing movie!",
            "review_date": "2019-10-14",
            "source": "rt"
        },
        {
            "content": "The masterful trilogy concludes. I would only criticise the theatrical release for cutting a few key scenes that were filmed, particularly Saruman's demise. But from Howard Shore's music to the spectacular visuals and storytelling, this is a fitting conclusion.",
            "review_date": "2019-10-11",
            "source": "rt"
        },
        {
            "content": "Not bad for not-book, think Blobbo.",
            "review_date": "2019-10-09",
            "source": "rt"
        },
        {
            "content": "The last chapter is just as good as the rest. The world is well built, the battles are epic and everything else about this movie is a true High Fantasy.",
            "review_date": "2019-10-08",
            "source": "rt"
        },
        {
            "content": "The pinnacle of the movie industry",
            "review_date": "2019-10-06",
            "source": "rt"
        },
        {
            "content": "good drama and effects, but the story is bullshit and to long",
            "review_date": "2019-10-02",
            "source": "rt"
        },
        {
            "content": "This is one of my all-time favorite movies. The acting, the story, the beauty, the clear distinction between the good and the evil - I really couldn't ask for more!",
            "review_date": "2019-09-30",
            "source": "rt"
        },
        {
            "content": "la aventuras llega a su fin y nos trae la mejor batalla que haya tenido una película en la pantalla grandes algo que no volveremos a ver en mucho tiempo ",
            "review_date": "2019-09-28",
            "source": "rt"
        },
        {
            "content": "The Return of The King offers a masterful approach to a three-year buildup of plot and action for one final adventure.",
            "review_date": "2019-09-25",
            "source": "rt"
        },
        {
            "content": "The most touching and beautifull movie of all time, THE masterpiece. ",
            "review_date": "2019-09-22",
            "source": "rt"
        },
        {
            "content": "I loved the extended version! I would definitely watch it again. The 4 hour play time did not scare me away!",
            "review_date": "2019-09-21",
            "source": "rt"
        },
        {
            "content": "Always a classic but even BETTER on the big screen!",
            "review_date": "2019-09-19",
            "source": "rt"
        },
        {
            "content": "Incredible- edge of seat entertainment",
            "review_date": "2019-09-18",
            "source": "rt"
        },
        {
            "content": "Everything. Simply everything.",
            "review_date": "2019-09-17",
            "source": "rt"
        },
        {
            "content": "The best movie what I saw in my entire life.",
            "review_date": "2019-09-16",
            "source": "rt"
        },
        {
            "content": "Truly one of the best movies I’ve ever seen. It was quite long at 4hours, 10 minutes, but it was so much more enjoyable with added footage. The movie makes much more sense for those who may not know the stories as well.",
            "review_date": "2019-09-16",
            "source": "rt"
        },
        {
            "content": "Wonderful to see all 3 movies on the big screen again! A classic and timeless trilogy!",
            "review_date": "2019-09-16",
            "source": "rt"
        },
        {
            "content": "You couldn't ask for a more emotionally satisfying ending. It has the same strengths as the previous films but with an extra emotional punch. It has an excellent plot, epic battle scenes, fantastic characters, authentic acting, solid visual effects, and a memorable film score. It's a very long film, but the pacing is surprisingly good - it's far from boring. LOTR is a must watch trilogy that will forever be known as one of the best fantasy franchises in cinema.",
            "review_date": "2019-09-15",
            "source": "rt"
        },
        {
            "content": "The ending to the Middle Earth Saga started with Fellowship.  It is incredible how many loose ends this film is able to appropriately tie up.  This movie showed with its ending that fantasy can have just as many themes and hidden layers as the most complex cinema genres.\n\nAnd although fans have minor gripes with the film (like the omission of the Scouring of the Shire) it is amazing that we were able to get such a consistent and comfortable escapist fantasy film series.",
            "review_date": "2019-09-09",
            "source": "rt"
        },
        {
            "content": "The best of all three.",
            "review_date": "2019-09-08",
            "source": "rt"
        },
        {
            "content": "Perfect conclusion to a perfect Trilogy. Some people might say it dragged a bit towards the end but for me every scene really adds something to the movie. it gives you such a satisfying conclusion and its just nice that for ones a final movie in a trilogy delivers exactly what you hoped it would.",
            "review_date": "2019-09-04",
            "source": "rt"
        },
        {
            "content": "Too amazing for words",
            "review_date": "2019-09-03",
            "source": "rt"
        },
        {
            "content": "Best movie of all time! Period.",
            "review_date": "2019-09-01",
            "source": "rt"
        },
        {
            "content": "This was the perfect conclusion to J.R.R. Tolkein's series! I loved it so much I watched it three times and cried in the finale.",
            "review_date": "2019-08-26",
            "source": "rt"
        },
        {
            "content": "Stunning, a truly masterpiece.",
            "review_date": "2019-08-19",
            "source": "rt"
        },
        {
            "content": "Outstanding movie, amazing visuals, epic sequences, this is very possibly my favourite movie of all time. Frodo, Gollum and Sam's quest to Mordor is exciting, dark and emotional. The scenes in Minas Tirth are great, especially the amazing battle. I also think Aragorn is at his best here.",
            "review_date": "2019-08-11",
            "source": "rt"
        },
        {
            "content": "The best film of 2003 and of the 2000s",
            "review_date": "2019-08-05",
            "source": "rt"
        },
        {
            "content": "Say, I've got an idea, why we don't we spend weeks choreographing elaborate fight scenes with expensive cgi, and then screw the whole thing over by using shaky-cam? ",
            "review_date": "2019-08-03",
            "source": "rt"
        },
        {
            "content": "The greatest movie of all time! A perfect film packed with awesome battle sequences and tons of emotion. A truly perfect ending to a perfect series. The Battle of Gondor in the middle of the film is the greatest scene in all of film. The battle is long, epic, and thrilling to watch. The film also has a wonderful, bitter-sweet epilogue that perfectly closes out this amazing trilogy.",
            "review_date": "2019-07-31",
            "source": "rt"
        },
        {
            "content": "one of the greatest trilogies ever made. Almost perfect finale.",
            "review_date": "2019-07-25",
            "source": "rt"
        },
        {
            "content": "The absolute greatest movie of all time. Fantastic acting, fantastic visuals, fantastic storyline, and the greatest conclusion any film franchise will ever see.",
            "review_date": "2019-07-20",
            "source": "rt"
        },
        {
            "content": "Peter Jackson must be so proud of himself, and so must his late parents, for a landmark in filmmaking!",
            "review_date": "2019-07-10",
            "source": "rt"
        },
        {
            "content": "The greatest trilogy",
            "review_date": "2019-07-10",
            "source": "rt"
        },
        {
            "content": "As to be expected, the epic conclusion to perhaps the greatest fantasy tale of all time is faithfully adapted in The Return of the King. Despite cutting an important chapter from the novel, the trilogy is brought to a satisfying, if bittersweet, close.",
            "review_date": "2019-07-09",
            "source": "rt"
        },
        {
            "content": "The greatest movie of all time, end of story.",
            "review_date": "2019-07-09",
            "source": "rt"
        },
        {
            "content": "Best movie i have seen\n",
            "review_date": "2019-06-27",
            "source": "rt"
        },
        {
            "content": "After one great adaptation, a really great sequel, it was difficult to end the trilogy, but the return of the King did:A great adventure, a great  ending - and a little bit emotionally part-the lord of the rings:the return of the King has got everything to be the best of the trilogy(and one of all time) ",
            "review_date": "2019-06-25",
            "source": "rt"
        },
        {
            "content": "Predictably, the movie \"Lord of the Rings: The Return of the King,\" the last part of Peter Jackson's trilogy, is no less superfluous than ever before. It seems that full control of the 2003 Oscar ceremony, when the film took all the prizes it had nominated, has already turned the \"return of the king\" into a cult film. A brilliant film you can not remain indifferent to.",
            "review_date": "2019-06-22",
            "source": "rt"
        },
        {
            "content": "Must must must watch \nBest movie of all time\n",
            "review_date": "2019-06-22",
            "source": "rt"
        },
        {
            "content": "Most likely the longest trilogy to be made in film is over, but not without a bang. This final chapter holds up the quality of its predecessors, and ups the action. The end result gives you goosebumps.",
            "review_date": "2019-06-17",
            "source": "rt"
        },
        {
            "content": "It was utter torture getting through this trilogy as although I understand they are some of the most beloved films to come out of the 2000s I just couldn't get into the fantasy and the characters. I only really watched the films so that I could see every Best Picture winner ever and I must say I was not looking forward to watching this one. I enjoyed parts of the first film in the series but by the point at which I watched this I was tired of the hairy feet and the bad slapstick humor. I just can't believe that the Academy would reward a film like this and when looking at 2003 and considering the fact that the fantastic Lost in Translation (2003) was also nominated it is a travesty that this muddled mess won. I wouldn't tell anybody who doesn't already love the books and doesn't require character development or an understandable plot to ever watch this.\n\nMerry, Dominic Monaghan, and Pippin, Billy Boyd, are reunited with Aragorn while Gollum, Andy Serkis, continues in his plan to betray Frodo, Elijah Wood, and Sam, Sean Astin. Then Frodo manages to escape from Gollum when he discovers he is evil and Arwen, Liv Tyler starts dying. A bunch of battles happen and then the One Ring finally gets destroyed as Gollum is thrown into the fires of Mount Doom while he holds it. Aragorn becomes king, everybody is happy and they all bow to the 4 hobbits.\n\nMy head hurts just thinking about this film and all of the things that occur seemingly for no reason as we interact with people who have reactions and motivations that don't seem vaguely understandable. I needed something, something to care about and this film gave me nothing. The ring is evil and must be destroyed so that Sauron can't take over the world but why do we spend so much time getting to Mount Doom and why do there have to be so many extraneous plot elements. The same screenwriting team worked on this film as all the others and they seem to have abandoned all attempts to humanize the characters and explain the plot developments. Those were the only reasons that I liked The Lord of the Rings: The Fellowship of the Ring (2001) and with a complete absence of that in this film I really couldn't connect.\n\nAs with the first two films the visuals were dazzling and I have no criticisms of the special effects used and everything looks beautiful. Unfortunately these visuals weren't in service of a great or even coherent story. Films like Blade Runner (1982) and 2001: A Space Odyssey (1968) use gorgeous visuals to draw you into dark stories that comment on our place in the world as humans and our relationship to technology, this film has none of that depth. Why couldn't Peter Jackson who made a great film in Heavenly Creatures (1994) explore something deeper than good vs. evil over a lethargically paced 2 hours and 40 minutes.\n\nLiterally the only moment that shook me out of my stupor was the kiss at the end but that was my lizard brain talking as I had been thinking about how great The Bridges of Madison County (1995) was instead of torturing myself with this movie. Had any of the female characters had more screen time, we see Arwen have a vision of Aragorn and her son and at the end she is Aragorn's prize, maybe I could have engaged. Eowyn technically carries out an important action but we don't really spend any time with her and Otto and the lesser actress Tyler get nothing to work with. Oh my, Lost in Translation is a better written and directed film than this.\n\nThis may be the worst Best Picture winner ever, I'm serious it's worse than Gandhi (1982) and The Broadway Melody (1929). At this point I'm seriously annoyed that this is a thing that even exists, let the fans have their books but don't inflict an entire series of films on the human race. Don't see this unless you absolutely hate yourself because it's a real chore to get through and you are left with nothing at the end of it.",
            "review_date": "2019-05-16",
            "source": "rt"
        },
        {
            "content": "It not very convenient to watch, especially the extended edition, but it's the best movie I've seen!",
            "review_date": "2019-04-28",
            "source": "rt"
        },
        {
            "content": "Pretty much perfection.\n10/10",
            "review_date": "2019-04-24",
            "source": "rt"
        },
        {
            "content": "Really beautiful end of an epic!",
            "review_date": "2019-04-04",
            "source": "rt"
        },
        {
            "content": "Can I give this movie 400 stars out of 5?",
            "review_date": "2019-04-02",
            "source": "rt"
        }
    ]
}