{
    "rating": 3.5,
    "release_date": "2011-08-19",
    "num_reviews": 104,
    "genres": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "summary": "A retired spy is called back into action, and to bond with her new step-children, she invites them along for the adventure to stop the evil Timekeeper from taking over the world.",
    "reviews": [
        {
            "review_title": "A unimaginative, pointless, cheap family film",
            "content": "Hopes were not high coming into Spy Kids: All the Time in the World. It is the fourth film in a franchise suffering from diminishing returns, plus it was using the stupid idea of smell-o-vision. And this family film does not disappoint.Marissa Wilson (Jessica Alba) is a top OSS spy who retires after capturing a super villain, Tik Tok, and starts a family with her husband Wilbur (Joel McHale) and stepchildren Rebecca (Rowan Blanchard) and Cecil (Mason Cook). A year later a new villain has emerged, the Time Keeper, who speeds up time using the Armageddon Device to punish humanity for wasting time. Marissa is called back by the OSS director, Danger D'Amo (Jeremy Piven), to recapture Tik Tok which should lead them to the Time Keeper. But the Time Keeper sets out to kidnap Rebecca and Cecil because Rebecca has the only thing that could stop the Armageddon Device.There are many problems with Spy Kids: All the Time in the World. It's a cheap and unimaginative film where you could easily predict how they would play out. We have seen these story elements so many times before: the dad is a workaholic; there is animosity between step-mum and step-daughter as the step-mum tries to get closer to the children; the revelation of a lie, and so many others. The humour is crude, mostly poo, fart and vomit gags, basically the lowest common denominator which most children will easily outgrow. The other major route of humour is the barrage of puns: time puns, dog puns and smell puns – we're not stupid! The action is rudimentary; it is easy to expect much better from Robert Rodriguez who just uses poor CGI and quick cuts. And if you can't guess who the Time Keeper really is then you haven't seen enough movies. Spy Kids: All the Time in the World feels like it is a movie that is only made for a quick buck, not for any love of the material or the need to tell a good story.A movie aimed at children should be able to enliven their imaginations: Spy Kids: All the Time in the World is not going to do that. The artificial CGI scenes just look too fake for children to accept and buy into the action and the basic predictable plot will mean that children will not love it. Adults and parents will feel nothing but suffering when watching this movie. This is just a mindless movie with no imagination, which is ironic considering it makes a point that children make better spies because they have more imagination. Children are smart; they ask questions, see plot holes and come up with ideas involving sci-fi concepts. The best family and children's movies are clever, well-plotted affairs and often have good ideas behind them. Spy Kids: All the Time in the World does not share those traits. Plus this movie carries on the awful trend of spies with babies not working.Most of the acting is sub-par. The child leads are bland and not natural actors; it's your typical weak-child acting, and they are no Chloe Mortez or Kodi Smit-McPhee. McHale was truly unconvincing as the father and again a typical bad performance in a bad family movie. Alba was a punch bag for gags to be bounded off on. Ricky Gervais seemed to be having fun, but I'm sure that's because he got a paycheck for saying bad lines in a recording studio. Piven is much the same, having fun and just being over the top.As movie fans we expect better from Rodriguez, who's done great movies like Sin City, From Dusk to Dawn and the \"Mexico\" Trilogy. Let's hope he is doing this movie so we can finally get Sin City 2.And I am sure you are asking the big question – what was the Scratch-and-Sniff card like? It was just a bunch of sickly sweet smells and simply just a gimmick. But you already knew that.",
            "review_date": "2011-08-20",
            "lang": "en"
        },
        {
            "review_title": "I rate this film as a parent who took his kids...",
            "content": "...Took the family (5 year old son, 2.5 year old daughter) to see Sky Kids 4 today..Speaking as an adult who saw all 3 of the original SPY KIDS movies in the theatre, this is easily the worst of the series. Joel Mchale (who i have actually become a fan of based off his THE SOUP and COMMUNITY work), Alexa Vega and Daryl Sabara give some incredibly bad performances. Embarrassingly-so. Jessica Alba does what Jessica Alba does (thank the Gods she's cute and met Robert Rodriguez), and Jeremy Piven....actually i liked Piven. His character had an interesting story- arc, and he gives a solid performance.Some of Ricky Gervais' one-liners were funny, too.The rest of the film was pretty unbearable. However, speaking as a parent who was out hoping to show his kids a good time, i actually have to give this movie a solid rating. My 2 kids enjoyed the heck out of it, from the talking dog to the baby decking a bad guy, the kids loved it. And my son had a lot of fun keeping track of when to engage the AROMASCOPE scratch card. A nice film for younger families, i think.",
            "review_date": "2011-10-15",
            "lang": "en"
        },
        {
            "review_title": "The worst of the series, and one of the worst movies so far this year",
            "content": "I thoroughly enjoyed the first two Spy Kids films, they were fun, entertaining and ideal family films. Spy Kids 3 was rather mediocre and disappointing, but any horrible assets that film had was nothing compared to this.When I entered the theatre to watch this, yes I wanted to see it despite the trailer not looking that good, I thought if it is bad surely it can't be as bad as The Adventures of Sharkboy and LavaGirl. I was wrong, as awful as that film was Spy Kids 4 takes the cake as Rodriguez's worst film.The film for starters looks cheap. The camera work at best is odd, and the effects lack clarity. The gadgets looked cool from the outset but once the nappy bombs for instance are introduced they lose their appeal very quickly.I didn't think much of the soundtrack either. I found it rather generic here rather than jaunty and memorable. And Rodriguez's direction is his most unfocused and inept directing job in my opinion of his career.The script is awful, relying far too much on tired slapstick and heavy-handed messaging, while the story is rushed and much too thin for the film's running time and the action is dull and not helped by the haphazard editing.Acting-wise, this film is disappointing. It was nice to be Daryl Sabarra and Alexa Vega here but other than the basic concept of the movie, them and Rodriguez, there seemed to be no connection to its predecessors. The new kids do what they can, but they aren't as confident or as appealing.Jeremy Piven does give his all into a very underwritten and uninteresting villain part and his two other roles as well but at points it feels like he's overdoing it. Danny Trejo is wasted, Antonio Banderas was cut which is yet another reason why this doesn't feel like a Spy Kids movie, Jessica Alba does nothing with her role other than look pretty, while even Ricky Gervais is flat.The cast are not helped by how their characters are written. The characters here are so cardboard, it is difficult to engage with them on any level.Overall, despite the trailer I was all for seeing this film. But it was awful(as part of a franchise and on its own terms) and a big disappointment. 1/10 Bethany Cox",
            "review_date": "2011-08-27",
            "lang": "en"
        },
        {
            "review_title": "The Vidiot Reviews...",
            "content": "Spy Kids: All the Time in the World in 4DWhen you've got two active adolescent agents in your home, you've got to ensure you have plenty of Flintstones Cyanide Pills on hand.Fortunately, the step mom in this family adventure is an ex-intelligencer.Trading in her cloak and dagger for diapers, femme fatale turned housewife Marissa (Jessica Alba) is called back into action after the villainous Timekeeper (Jeremy Piven) begins to steal time.But when the Timekeeper targets her stepchildren (Rowan Blanchard, Mason Cook), Marissa must divulge her past, which ultimately leads to their tutelage under a former Spy Kid (Alexa Vega).Now, the new recruits and their robot dog (Ricky Gervais) must stop the Timekeeper before it's too late.The fourth installment of the Spy Kids franchise, All the Time in the World is a fart infused, infantile, chroma keyed atrocity. Besides, as an undercover child agent, wouldn't most of your assignments involve you luring in online predators? (Red Light)",
            "review_date": "2011-11-25",
            "lang": "en"
        },
        {
            "review_title": "A Juvenile Effort Meant for those Under Five",
            "content": "I have often said that in order to enjoy mindless movies like \"Transformers\", we should \"leave our brains at the door of the cineplex\". Well, in order to enjoy this \"Spy Kids\" sequel, we need to lower our IQ to the level of four-year olds! 'Mindlessness' doesn't quite cut it, it is juvenile indulgence, meaning, it is only for kids below five.And if you have been following the cinema ads and promos, you would know that this movie comes in 4D - with the added dimension of 'smell'. For that, viewers are given a numbered card (called Aroma-Scope) so that they can scratch-and-smell when the number appears on the screen. This is a childish gimmick aimed at kids. For adults, it is more of a nuisance because the scents are faint and the exercise distracts us from the action on the screen. Although there are many fart and poop scenes, the Aroma-Scope only provides scents of chewing gum and other edible stuff (thank goodness for that). History has demonstrated that all smell-o-vision gimmicks mostly stink.Marissa Cortez Wilson (Jessica Alba) is such a dedicated spy that even when she is nine months pregnant, she manages to take down notorious villain Tick Tock (Jeremy Piven) before going into labor and retiring from her spy duties. Her aim is to devote all her time to her newborn and her step-kids, Rebecca (Rowan Blanchard) and Cecil (Mason Cook) and hubby Wilbur (Joey McHale).Soon, however, she may not have that much time. One year later, Tick Tock and accomplice, The Timekeeper (also Piven), are back at their attempt to rob the world of 'time' - and Rebecca, Cecil and their 'guard dog' Argonaut (voice of Ricky Gervais) must save the world (what else?). Also, they team up with Marissa's niece and nephew, Carmen and Juni Cortez (Alexa Vega and Daryl Sabara reprising their former Spy Kids roles) to make this mission a family reunion of sorts.Writer-director Robert Rodriguez seems to be milking the same old cinema-script cow, urging parents to spend more time with their kids. This 'message' has been used by almost all family movies throughout the decade. The time-theft and time-travel conceits can be puzzling to children even if they allow Rodriguez to make use of all sorts of time-related gags. Of course, Rodriguez cannot resist the poop and fart gags, as well as throwing food all over the place. These, I understand, are the laugh-out-loud staple for American kids below five.Among the cast, Blanchard and Cook are suitably cute and effective as the new title characters. Bringing back former Spy Kids, Vega and Sabara, is a good idea, adding a nostalgic touch for parents in the audience. Ditto that for Danny Trejo's short cameo as Uncle Machete. However, the irony of Daddy Wilbur being a 'Spycatcher' on TV is lost on the kids and scores no points with the adults.As for Jessica Alba (as Marissa, the younger sister to Antonio Bandera's character), she provides the main box-office lure, nothing more. Strictly kids' stuff. (limchangmoh.blogspot.com)",
            "review_date": "2011-08-17",
            "lang": "en"
        },
        {
            "review_title": "Rodriguez's most delightfully surprising film",
            "content": "Considering it's a sequel that sounded like it could be awful as there was none of the original cast attached the project, it's a really fun and consistently entertaining ride that is great for the whole family! 8 years after the previous Spy Kids, we follow new characters including Marissa Wilson (Jessica Alba) a retired spy who is called back in to stop a menacing new threat, The Timekeeper (Jeremy Piven). Along the way, her step-children discover the world of espionage and want a slice of the action! I'm pretty bemused at how badly this was received; I think it's a really fun and care-free kids film with cool gadgets and pretty sweet performances. The kids Rebecca and Cecil played by Rowan Blanchard and Mason Cook fit the roles nicely even if the Cortez's are missed a bit. The Timekeeper also turns out to be the best villain in the series with a cheeky yet deep performance by Piven and a backstory that makes you sympathise for him; often the best villains are ones you can empathise with on some level. Let's not forget Ricky Gervais' vocal performance as the dog which is a must see for Gervais fans! There are also some nice appearances from characters in the original trilogy and that definately heightens this one to feel more like an authentic Spy Kids film. My only reservation is the 4D technique used; it's going to date the film very quickly and the prompts used at the start don't work as well when your at home rather than the cinema. Nevertheless if you have your doubts like I did, give it a go; you may be pleasantly surprised!",
            "review_date": "2020-03-30",
            "lang": "en"
        },
        {
            "review_title": "Multiple Copies",
            "content": "I'm aware that many people like to encounter films as a small, unchallenging adventure. That isn't possible with me, but I have something similar: sometimes a simple film is a relaxed encounter with the filmmaker, a sort of illustrated visit in his home.I like Rodriguez. I like his joy in image and his independent enthusiasm. I do not ever expect him to produce something that changes my life, like fellow Austinite Malick can. But sometimes you just want to hang out. One thing that is impressive is knowing that he creates his films mostly in his own studio with greenscreen, networked to special effects subcontractors. He must have had to do things that few others do in order for his work to seamlessly integrate with his life.So, though there is nothing profound about him except his passion, visiting a film can simply relax into that passion. I am particularly hooked on the Spy Kids franchise because the first one had so many inside references to old AI tools and techniques that I assume he worked very closely with someone from that era, perhaps even someone I know. Perhaps it was a side effect from setting up his personal production infrastructure.But it also because I know he is coming at this as a dad who enjoys his kids and basically wants to share at a cinematic level. That is why, for instance that I tolerate the over top 'dad message' about the importance of spending time with your kids now rather than be absent in a studio. (Yes, that is the basic plot.)The first film was themed on AI as mentioned. The second on genetics, and the third on a Tron-like game. This one plays — in the most superficial way — with speculations on parallel universes and time joins. Others will inform about the amazingly bad acting by both pairs of siblings, the really off- beat pacing and the general heavy-handed nature of the thing. But under all that is a genuine human, being genuine and open, inviting us into the world he decorated himself (there's a joke about that). Where else but with Rose's influence will you get a superspy kicking butt first as she goes into labor and later with the baby strapped on her chest. That alone will stick with you.Ted's Evaluation -- 3 of 3: Worth watching.",
            "review_date": "2011-09-01",
            "lang": "en"
        },
        {
            "review_title": "Kids will get a kick out if it, but it's not a patch on the first movies",
            "content": "Like Jaws 4 and Superman IV: The Quest For Peace. Spy Kids 4 or \"Spy Kids: All The Time In The World\" is a Franchise killer. Although it was a moderate financial success against its $27 million budget. It is such a poor movie, it ended any interest in any future movies. Mason Cook (in his first movie) and Rowan Blanchard (in her 2nd) are not as annoying as most child actors and are certainly cute enough, but they lack the chemistry that Alexa Vega and Daryl Sabra had in the first three movies. So Jessica Alba is pretty much left to carry the movie on her own. She tries hard but the movie is missing some of the charm and magic that made the first movies so likable. It also misses the talents of Antonio Banderas and Carla Gugino. I give it 4/10 1 for Alba, 1 for Vega. 1 for Sarba, and 1 for the kids I'm sure most kids will like it, mine certainly enjoyed it, just not as much as the original three.",
            "review_date": "2014-09-02",
            "lang": "en"
        },
        {
            "review_title": "I wish they'd just stopped after the first one.",
            "content": "The original \"Spy Kids\" movie was a cute little kids film which was actually enjoyable for adults as well. So, the studio did what they often do...take a good idea and beat it to death with sequel after sequel! As a result, his fourth installment managed something no other \"Spy Kids\" movie did...it managed to make IMDB's infamous Bottom 100 List. In other words, it's among the 100 wide release films that are hated most by IMDB users.In order to try to keep interest in the franchise, later films added gimmicks to keep the kids interested. This one has several....it's in 3D, it has 'smell-o-vision' (theaters were equipped with machines that dispensed scents) and there's a talking robotic dog....all of which loudly scream out 'jumped the shark'.When the movie begins, you'll notice that barely anyone from the original movie is here. This makes sense, as the two children from the first one were no longer kids...as a decade has passed. Interesting, the fully grown kids from the original films DO show up later in this movie as their original characters. And, since the kids in the film are new, so are the parents. One is a TV host of a show called \"Spy Hunter\", the step-mom is an actual spy for OSS*.When a super-villain named the Time Keeper starts affecting the passage of time, the step-mom is called into action. Almost immediately after, minions of this baddie show up and try to abduct the kids...and they realize their step is a spy! How do the kids defeat this first wave of minions? By hurling puke bags at them...an excellent metaphor for this picture!So, was there anything I liked about this film? A few things. I appreciated how the boy in the film wore hearing aids. You rarely have deaf or hard of hearing characters in movies. The only sad part is that it didn't look as if they hired an actual hard of hearing kid for this part. The look of the film is also nice...they clearly spent money on the movie and came up with some cool gadgets. And, finally, I did appreciate that they brought back the grown up spy kids...a nice touch.What I disliked mostly was the scatological nature of much of the film. These were just gross and unnecessary...and guaranteed to offend and bring down the quality of the production. The film also lacks originality and it looks like there have just been a few too many trips to the well, so to speak. What was original, but unwanted, was the robot dog. While a few of his comments were kind of clever, mostly he was there to provide potty humor.The bottom line is that I definitely did NOT like this film but feel that kids may like it...parents certainly won't in most cases. The same things that turned me off might be enjoyed by some kids...especially the robotic dog. So, I'll give it a 1 for parents and a 5 for kids...and will split the difference for my overall score.*There really was an OSS. The Office of Strategic Services was created for WWII and later was renamed the CIA.Three times could be the charm...but what about four??",
            "review_date": "2019-02-21",
            "lang": "en"
        },
        {
            "review_title": "Smell it",
            "content": "The movie tries something that hadn't been done for a long time. It tries to reach out and tickle the one sense that isn't being reached out to: smell. The fact that you have to scratch a number on a piece of paper you get, every time it appears on screen, can be a pain though. Still kudos for trying something.That won't help with the story, that is too easy to see and guess for any adult. But they are not the main audience for this movie. This is aimed mostly at kids. They might kinda like it. It's not as bad for them and if you watch it with them, you might enjoy it because of that. I'm not sure if they will include \"smell\" cards for the DVD/Blu ray ... and how long the smell lasts. Apart from the gimmick there is not that much more there.",
            "review_date": "2012-01-21",
            "lang": "en"
        },
        {
            "review_title": "Dumpster fire of a film",
            "content": "This movie is utterly terrible and should have never been made. Awful in every way.",
            "review_date": "2020-08-27",
            "lang": "en"
        },
        {
            "review_title": "I love this piece of absolute garbage",
            "content": "This is honestly one of the most enjoyable movies I've ever seen, I love just how atrocious it is.I love this piece of trash, it's honestly a guilty pleasure and it was one of my favorite films when I was little, embarrassing.",
            "review_date": "2022-01-13",
            "lang": "en"
        },
        {
            "review_title": "Not worth it (warning, spoiler)",
            "content": "Jessica Alba plays a spy turned mom who is so sneaky no one in her family knows. WARNING:SPOILER Of course, by the end of the movie her husband and all the kids are involved, including the baby and the original Spykids are reunited.My family enjoyed the first three Spykids movies so of course we had to see the fourth. They shouldn't have bothered making the fourth. There is too much bathroom humor including poopy diaper and vomit bag ammo. It wasn't even funny.In fact, I didn't even think it was worth my time to post a review, but my older daughter said I should warn everyone. So this isn't just an adults opinion. My kids didn't like it either.",
            "review_date": "2012-12-14",
            "lang": "en"
        },
        {
            "review_title": "Escapism at its finest.",
            "content": "The real purpose of a movie is to entertain (escapism) - to distance you from your problems for a short period of time. If you will look at this movie from the perspective of a person viewing movies for entertainment purposes, then this movie is good (not very good since there are a lot of better escapist movies out there). If you look at it from the perspective of a movie critic, then this is a horrible movie, filled with clichés and poop jokes.The first film of this franchise may have had some cliché plot points, but it didn't rely on poop and fart jokes to move the story or try to make the viewer laugh.This movie has the usual 'stepdaughter-hates-stepmom' and the 'geeky brother' story lines along with the happily ever after ending. It seems the movie thinks that watching these story lines is entertaining to kids, when in fact, it's not (speaking from my perspective as a 13 year old kid). To be frank, it's quite annoying.However, this movie doesn't lack on the entertainment value. CGI all-around, gadgets everywhere, this movie has tons of cool stuff to keep the viewer at the edge of their seat. There are jokes that if you watch first may seem funny, but in the end will make you think \"is that joke really funny, or is it offensive\".Bottomline is, this movie can be good or bad, depending on your perspective. To me, it's escapism at its finest.",
            "review_date": "2014-05-27",
            "lang": "en"
        },
        {
            "review_title": "It's a kids movie after all...",
            "content": "I don't think this was a bad film, granted it wasn't a good film but for me I couldn't help relate it back to the original movies and in that sense I think it did well, it didn't stray too far from the original plot lines and I liked that because I was afraid after all these years it would have changed completely.So many of these reviews rate it as \"cheep and crappy\", well it's definitely cheap, the graphics are pretty much exactly the same as the original films and its not going to win any awards for being a brilliant flick but the movie wasn't made for YOU, it was made for the kids.I think as a kids movie, or family movie, it does well and I believe the children will love it just as I loved the originals when I was younger. Yes the plot is cliché and predictable but to a kid it's a whole other world where they can be a hero without growing up.",
            "review_date": "2011-09-21",
            "lang": "en"
        },
        {
            "review_title": "The worst yet",
            "content": "The fourth instalment of the interminable SPY KIDS saga was made almost a decade after the third. A new, younger pair of siblings are the central characters here, with the now-adult kids from the originals making extended cameos. Truth be told, ALL THE TIME IN THE WORLD is the worst of the franchise yet. Expect bad guys with ridiculous high-pitched voices, repetitive fart jokes, and bad acting all around. The CGI isn't quite as terrible as in the third film but it's still pretty terrible and the whole thing feels like an overblown vapid mess. It says something when the funniest thing in the movie is a robotic dog voiced by Ricky Gervais, of all people.",
            "review_date": "2018-03-13",
            "lang": "en"
        },
        {
            "review_title": "reboot ultimately fails",
            "content": "OSS agent Marissa Wilson (Jessica Alba) retires after capturing time manipulating villain Tick Tock (Jeremy Piven). Her husband Wilbur (Joel McHale), step-kids Rebecca (Rowan Blanchard) and Cecil (Mason Cook) don't know her secret life. Wilbur creates a TV show hunting spies. A year after having a baby daughter, OSS director Danger D'Amo (Jeremy Piven) recalls Marissa to battle villain Time Keeper (Jeremy Piven) who is speeding up time to destroy the world. Marissa had given Rebecca a necklace with the Chronos Sapphire which is the only thing that can stop the device. When bad guys come looking for the Sapphire, Rebecca and Cecil discover Marissa's secret and their dog Argonaut (Ricky Gervais) can actually talk. Carmen Cortez (Alexa Vega) reveals that Marissa is her aunt and the Spy Kids division was deactivated after something happened with Juni Cortez (Daryl Sabara) seven years ago.I like the idea of two new kids taking over. I even like Ricky Gervais. However, I would have prefer Robert Rodriguez do more to update the series. Also Marissa bringing the baby along isn't cool or even funny. Carmen and Juni don't need to return for this installment. It may work better to reboot the franchise without them. This reboot obviously didn't work unless Rodriguez want to continue with a lesser straight-to-video production.",
            "review_date": "2015-12-30",
            "lang": "en"
        },
        {
            "review_title": "Not bad, but please be more original.",
            "content": "Writer, director Robert Rodriguez, seems to like to entertain kids, or he's just bored, reviving a franchise that does need to be. Now I was entertained by the first two Spy Kids movies, but the third one was rip off of Tron(1982).Jessica Alba is amusing in her role, as a retired spy, wanting to become stepmother to her husbands(Joel McHale The Soup)kids, and having one of her own. But then an old enemy comes back in the picture, and she is called back into action. But will her husbands kids become the new spy kids?The two original spy kids make an appearance, they are Alexa Vega and Daryl Sabara, and you know they are not kids anymore. But that was a big problem for me, cause I feel the films focus went more on them, and less on the new spy kids, it was like the new generation was making an appearance in there own movie. Jessica Alba was good, so was Joel Mchale. But they where convincing as a couple, now Antonio Banderas and Carla Gugino was more convincing. But all in all an amusing film, had interesting effects. But go in this movie knowing, what too expect.",
            "review_date": "2011-08-21",
            "lang": "en"
        },
        {
            "review_title": "Spy Kids 4: All the Time in the World",
            "content": "The first film is the only one to bother with, the second was okay and the third was awful, I did not have high hopes for this fourth instalment, which in 4D meant for cinema goers meant 3D effect and smelling or feeling things, not for me watching on TV, directed by Robert Rodriguez (From Dusk Till Dawn, Sin City). Basically Marissa Wilson (Jessica Alba) on the surface appears to be just an ordinary mother with a new baby and married to famous spy hunting television reporter Wilbur Wilson (Joel McHale). Her intelligent twin stepchildren Rebecca (Rowan Blanchard) and Cecil (The Lone Ranger's Mason Cook) don't want her around, thinking she is uncool, in fact, with her husband unaware, she is a retired secret agent. Her true identity is only revealed to Rebecca and Cecil when they enter the underground layer of the house, full of spy gadgets and gizmos, and they become entangled in a world domination plot, the maniacal Timekeeper (Jeremy Piven) threatens to take over the planet by slowing time. Marissa is wanted back in action by the Organization of Super Spies (OSS), home of the greatest spies and where the now defunct Spy Kids division was created. Rebecca and Cecil are surprised by the revelation of their \"boring\" stepmother, and with their bickering ways they must put their differences aside and work together to save the world, and they get help from former Spy Kids, now teenagers, brother and sister Juni Cortez (Daryl Sabara) and Carmen Cortez (Alexa PenaVega), and robotic talking dog Argonaut (voiced by Ricky Gervais). In the end, after defeating the Time Keeper and his identical henchmen, Danger D'Amo and Tick Tick (both also Piven), time is intact and restored, and the Spy Kids program is revived, with Rebecca and Cecil going on to become recruiters of new agents. Also starring Danny Trejo as Uncle Machete, Chuck Cureau as News Anchor and Jeepers Creepers' Jonathan Breck as Wilbur's Boss. The previous instalment was a complete mess, it crossed the line between expensive trash and cheap rubbish with its use of special effects, unfortunately things have not improved with this fourth instalment, the special effects are pointless when you combine with a predictable and stupid story, I perhaps tittered at the voice of Gervais and some spoof references, but the charm has disappeared and it feels like the kids themselves are responsible for putting it together, this is one the kids and the family should not even bother with, a crap fantasy action adventure. Pretty poor!",
            "review_date": "2015-10-25",
            "lang": "en"
        },
        {
            "review_title": "Possibly the worst movie of all time!",
            "content": "This movie is not only the worst movie of the summer, it could possibly be the worst movie I have ever seen. I took my two boys aged 7 and 4 to watch this sorry excuse for a movie. The boys actually were fairly entertained, but I must say they are not exactly seasoned veterans of the movie watching experience.We saw it in 2D but also had the '4th D' experience. This amounted to a card they gave you that you scratch and sniff at certain points during the movie. It is a horrible gimmick that does not even work. I scratched as hard as I could and could only smell a faint flowery smell. That is only one minor flaw of the movie.The other flaws are as follow. The acting is horrendous. How they continue to let Jessica Alba act and even STAR in a movie is a decision that some Hollywood exec will eventually pay for with their job. Her lack of acting abilities were only surpassed by the rest of the cast. But it was not entirely their fault as the film's basic plot and script was about as thin as Kate Moss on a hunger strike.So what do you combine with horrible acting, a thin plot and countless moronic lines written by the worst screen writers they could dig up? Mindless violence that is not suitable for small children. This movie is supposed to be about spy kids I presumed, based on the title. Most of the scenes and actions were played out by adults and the plethora of punching and kicking scenes was immature and detrimental to young, easily influenced minds.This movie is disturbing for young children and is completely inappropriate for children of all ages. It also is so horribly acted and the screenplay so ill-conceived that adults are left wondering how in the world Hollywood can continue to put out such dribble and expect us to shell out our hard earned dollars on such mindless 'entertainment.'To sum it all up, avoid this movie at all costs. Even if your children have seen the other versions and beg you to see it be strong and suggest alternatives. Show Hollywood that you will not be swayed by their slick advertising and inept film-making.",
            "review_date": "2011-08-21",
            "lang": "en"
        },
        {
            "review_title": "Not Bad At All!",
            "content": "In one of the most surprising happenings that occurred to me, I found out that I actually liked the fourth installment in the Spy Kids franchise for the most part. The first two films are definitely better but this is way better than the horrid third film. I guess I liked this film because it brought back so many memories from my childhood. That was true when Carmen and Juni appeared on screen. I know the acting was cheesy and there were plenty of potty humor, but I couldn't bring myself to hate this film.Robert Rodriguez's film is about an evil guy who is bent on making time go faster so a retired spy and her kids are recruited to turn time back to normal.As I mentioned earlier, the acting is kind of cheesy. Jessica Alba is pretty good and is quite nice on the eyes. The kids are decent even though they say some weird stuff. Ricky Gervais makes an awesome dog with his voice.Overall, this is a decent film but I can see why many people despised it. Despite my thumbs up, I think it's time for this franchise to hit the bucket as I can see some wear and tear. This film wasn't even asked for in the first place but it's a nice distraction for the kids. It doesn't have the great visuals as the earlier films, but it wont matter to the kids. I rate this film 7/10.",
            "review_date": "2013-04-04",
            "lang": "en"
        },
        {
            "review_title": "A surprise return of the Spy Kids",
            "content": "Although it wasn't any good the 3rd 'Spy Kids' film at least wrapped the story up. It's surprising then that the director decided to go back and revisit the franchise with this sequel/reboot, that didn't really go down well with the public.The main draw for me was seeing the original 'Spy Kids' (Alexa Vega and Daryl Sabara) all grown up, and it was nice to see them assisting the new generation in a pass the torch way.Unfortunately the plot isn't strong enough, and the new 'Spy Kids' aren't half as endearing. Jeremy Piven chews scenery in his role, and the less said about Ricky Gervais as a talking dog the better.This film was perhaps meant to start a new series, but it ended up being an odd final outing for the franchise.",
            "review_date": "2017-06-01",
            "lang": "en"
        },
        {
            "review_title": "1",
            "content": "Please no more. It is possible to watch first pat of spy kids but other.. God please no just no...",
            "review_date": "2018-12-06",
            "lang": "en"
        },
        {
            "review_title": "Stop dropping the title",
            "content": "I have very fond memories of the original \"Spy Kids\" movie that came out in 2001. Ever since then, a sequel was made once a year probably so the lead kids wouldn't get older. They ended up making a sequel eight years later and it's even more pointless than you would imagine. This movie features a new stepmother who's a spy trying to stop a villain named Tick Tock (really dumb supervillain name) along with the Timekeeper. We get this tired cliché that actually happens to both parents in different jobs, not having enough time for their kids. The worst thing about this movie is the crude humor.There's a robot dog that literally pees oil and poops bombs. Oh, and he can fart for no reason other than that it entertains him. Farting dogs didn't work in \"Space Buddies\", why did they think they would work here? There's even one scene where the boy character has to throw up in barf bags so he can throw his barf at the bad guys. This was released in something called 4-D, which apparently added smells or something when it was in theaters. The 3D looks horribly out of place and if 3-D is dead, 4-D was the nail in the coffin.The special effects are really bad and I read that this movie was mostly made because of something Robert Rodriguez had in his contract with Harvey Weinstein. We should have been to tell he was a huge scumbag for being responsible for this atrocity. These movies started out great, but declined in quality with every sequel all leading up to the worst one of them all. Seriously, the original only has a rating of 5.5 here? It's got a 93% on RottenTomatoes! Any film with a baby throwing food in her mother's cleavage can't be good. *",
            "review_date": "2018-05-31",
            "lang": "en"
        },
        {
            "review_title": "Spy Kids: A So Bad it's Good Review",
            "content": "This is arguably the worst film that Showtime currently has to offer, so far.I don't know about you, but I was raised on the Spy Kid films, I loved the first one, it introduced me to a brand of films: the slapstick Three Stooge-Esq animation and action captured my attention as a small child, and this was even before I had a conception of what good acting was, truly, if you place a child in front of a monitor and put such a laughable film like this on, they'll think these are real people sadly. But, if you plop it front of them 10 years later, they're going to be laughing like a pack of hyenas, not at the jokes, but the story and acting. ﻿ Now that I am in my teens, I have a good conception of what a good movie is, and what a bad movie is, and I can say with pride; that this, Is the Worst Film 2011. ﻿ A few weeks-ago, I put the original trilogy on, because I hadn't watched it in a while, and I can still say that the movies still holds up, even after the 10 year gap of not watching them, they still manage a smile to my face, not out of stupidly, but because of the jokes and characters, (not to mention that they are one of many childhood gemstones of mine.) ﻿ This morning I was surfing Showtime and saw this listed, with no mind to the universal panning by critics, I put it on, because I'm one of those guys who, if I start something, I gotta finish it, and oh, my. Am I regretting that decision. ﻿ There are so many problems with this movie, that I could actually list them. ﻿ 1) Jessica Alba, she is still acting 2) The kids in the movie are extremely annoying 3) The acting is just... terrible. 4) In the beginning of the movie, Jessica Alba's character is on mission during pregnancy. This is a recurring joke in the movie, in which while she fights crime, she has her toddler in a baby holster. ﻿ The extremely slow paced film soon becomes an bother of the viewer,to the the point where I checked the clock, what felt like 50 minutes, was a mere 20. If a film goes that far down the cutting room floor, I am forced to give the film, a: ﻿Negative 10.5 Ticket Stub out 10 Tickets. ﻿ A Note to Parents: if your kids ever misbehave, put this on, it Will scare them back into line.",
            "review_date": "2013-06-04",
            "lang": "en"
        },
        {
            "review_title": "Director in poorly lit?",
            "content": "It's terrible. It's a tragedy that both Jessica Alba and Joel McHale from The Soup played characters in this. Butt-bombs, barf bags, etc. It takes toilet humor to the extreme. Sure little kids will find it enjoyable, but anyone over the age of 10, stay away from this and never look back! Also 4D, really? Doesn't most moviegoers hate 3D? Why 4D? It's just 3D, but with those stupid pop-up numbers to make you scratch the number and smell those stickers that smell worse the cigarette smoke. And one last thing. A TALKING Australian-ACCENT DOG (no joke) with face-palm inducing one-liners such as \"Somebody put that on YouTube.\" and stuff like that. But there is only one thing that I like about this movie. Carmen and Judi are back. They got the original actors that played them and was defiantly a nostalgic tribute to the first 3 movies. All in all, just save your money. If you really want to see how bad it is, wait till it comes on RedBox.",
            "review_date": "2011-08-21",
            "lang": "en"
        },
        {
            "review_title": "makes good on its promise, it's just that the results are uninspired",
            "content": "Marissa Wilson is one of the top agents of the OSS. Having just completed her latest mission, she retires to spend time with her oblivious husband (an unskilled spy hunter), two bickering stepchildren (the daughter with whom she has a strained relationship), and their newborn child, but her attempt to settle into the domestic life comes to an abrupt halt when a villain unveils a dastardly global scheme involving the passage of time. Marissa promptly returns to the OSS to try and deal with the threat, but the unanticipated involvement of her stepchildren (along with her husband's sudden rise in ambition) create more complications in an already difficult assignment. With a barrage of visual effects, gizmos and gadgetry, and tepid juvenile humor, this plays out like an unremarkable video game. **",
            "review_date": "2019-11-23",
            "lang": "en"
        },
        {
            "review_title": "Fun for the Right Age",
            "content": "I took my four kids (6-13) to see it knowing ahead the risks, having seen one or two of the earlier Spy Kid movies. For a kids movie, Spy Kids was just average. The movie worked great for the younger audience (6 & 9 year old), as they enjoyed the physical humor, frequency of jokes related to bodily functions, and baby humor.My older sons found the movie boring, and one even feel asleep. So, if you are looking to kill two hours, Spy Kids would work for a younger audience (under 10) - but be forewarned about the numerous bodily function jokes related to many parts of the body.A final word on Aromascope - it doesn't work. All of our scents smelled like strawberry kool-aid, except #4 was kind of minty. While a fun idea, I'm glad to have missed out on the blue cheese, fart, and vomit smells.",
            "review_date": "2011-09-09",
            "lang": "en"
        },
        {
            "review_title": "Spy Kids: All the Time in the World in 4D (2011) - Aroma-Scope is So Obnoxious These Days!",
            "content": "So, it's been a while since we have seen the \"Spy Kids\" in a movie, and the last time we saw them was in the 3-D movie \"Game Over\". Which was okay, but I was just there for the 3-D. Now, we get newer characters, a newer 3D technology, and we get \"Spy Kids 4-D in Aroma-Scope\". You know, \"Aroma-Scope\" is where they give you this card, so when a number pops out during the movie, you scratch the number on the card, and you smell it. That's pretty much it. But there are so many disgusting things in this movie that you just don't want to smell. I'm glad I didn't see this movie in Aroma-Scope, cause I honestly didn't want to sit through that torture. The 3-D is okay, though! Anyways, Jessica Alba, who is incredibly hot, is a retired mom who now is the stepmother to two crazy kids, one who is this cool kid with a hearing aid, and always bugs into situations, and then you have this annoying little girl pulling out all these pranks, and you just want her to shut the hell up. Their dad, played by Joel McHale, is a television star who doesn't have the time in the world to spend time with them, that's because this stupid villain named the Time Keeper, portrayed by Jeremy Piven, is trying to change time itself, and such bull-crap. So, they meet up with the original Spy Kids, Carmen and Juni, played by Alexa Vega, who's so hot today as an adult, and Daryl Sabara, who wasn't as good as he was as a child. They gear up, and they try to stop the Time Keeper. Then, we have our movie! What? I was just sitting there, listening to the jokes and gags, and they're just not funny. But the only thing funny about this movie was the talking dog. Ricky Gervais plays the voice of the talking dog, and he says jokes that are funny. The rest is just nonsense. Also, when you put Jeremy Piven, Jessica Alba, and Joel McHale in a movie like this, and they were all dumb, you just start to wish that they got good paychecks for this mess. Besides, the movie throughout was just so weird. Director Robert Rodriguez really wanted to make a family film for everybody, but all he made was a family film for nobody at all. That's why Rodriguez should never take movie ideas from his kids. The 4-D Aroma-Scope was super annoying, the cast looked embarrassed to be a part of this mess, the directing was childish, two hot chicks, and a dog that's super funny. All of that lead to a surprisingly annoying family flick. \"Spy Kids: All the Time in the World in 4D\", in my review, \"a lazy and childish excuse for cinematic technology\".",
            "review_date": "2012-02-13",
            "lang": "en"
        },
        {
            "review_title": "Horrid... just plain HORRID!",
            "content": "What can I say, I thought it was a good movie. I already watched the last ones which were quite good (part 1 and 2 were very nice! After that it went all down-hill). But part 4 really beats the cake. Alright, special effects are OK, but the rest is just hogwash. There is just no tempo in this film whatsoever. I think even tiny toddles will cry when they see this piece of garbage!!! Please, I beg you. Let the Spy Kids grow up to be real men and stop with the series!Now I know why this film was chugged on DVD as fast as it could: to rake up even more money from gullible customers... well, one things for sure. I saw this movie for the first time last week and it was immediately the LAST TIME!",
            "review_date": "2011-12-30",
            "lang": "en"
        },
        {
            "review_title": "What a load of shitake mushrooms!",
            "content": "Robert Rodriguez's Spy Kids franchise has gone seriously downhill since the first movie, with All The Time In The World in 4D easily being the worst adventure yet. An incredibly messy story, a glut of cheap-ass CGI special effects, godawful direction, a pair of bland moppets in the lead roles, enough dreadful 'time' puns to last me until the end of time, and the inclusion of a scratch-and-sniff gimmick that smacks of desperation, all go to make this film a real stinker.About the only good thing about this Spy Kids flick (for me at least) is the return of Alexa Vega as Carmen Cortez, who has grown up very nicely indeed and who looks fantastic in her body-hugging spy outfit (far better than Alba in my opinion). Vega's presence made it a tad easier for me to stomach all the puerile toilet humour and crap one-liners from smug comedian Ricky Gervais (as a talking dog), but I still found it hard to make it through to the end.",
            "review_date": "2012-06-24",
            "lang": "en"
        },
        {
            "review_title": "This is for kids and young of heart, not critics",
            "content": "I took my kid to this so I wouldn't have to sit through The Help. I wasn't bored and my kid liked it too. I have no idea what all these other people are whining about...its a kid movie that tries to throw in some humor for the older crowd. The smell thing was kinda dumb but it was a promotion gag...what did you expect...maybe you wanted to sniff real dog gas? Not me. OK, it probably doesn't really deserve a nine but I tried to make a point after seeing the stupid 2.8 rating that it sure as heck doesn't deserve. All you people canning this fun little flick need to get a life and maybe STOP GOING TO KIDS MOVIES IF YOU HATE THEM ALREADY. Heck, seeing Jessica Alba and the grown up hottie from the old spy kids movies was well worth the admission for me. Thank goodness I was able to talk my daughter into seeing this instead of The Help which everyone is TELLING YOU TO LIKE. Later film goers!",
            "review_date": "2011-09-05",
            "lang": "en"
        },
        {
            "review_title": "Robert Rodriguez has still got the magic !",
            "content": "Yes, Robert hasn't lost his touch. When a man has that much talent and imagination, you wonder how long he can keep it up. He is a genius, and I don't use that word lightly. He has invented a new kind of movie here, with the spy kids series. A movie that empowers children instead of what Hollywood has always done with children's movies. The spy kids movies are a refreshing change and I'm glad to see it continuing. The first three were ground breaking and very special. I was so glad to see that this one lives up to that. Although not as good as the first two, which were superb, I rate it about the same as the third one. It may be hard for some to embrace the new cast, which happens every time a new James Bond is cast. I think everyone is just as likable as the originals. Reviews that cut down the acting, plot or whatever don't understand what Rodriguez has done. This movie, as with the other three, is for children and people who love children. If you don't consider yourself in one of those categories then you won't get it.",
            "review_date": "2011-08-26",
            "lang": "en"
        },
        {
            "review_title": "Farty fun for kids",
            "content": "I went to see this 4th entry in Robert Rodrigez' Spy Kids series with a 9 year old and a 13 year old, and they thoroughly enjoyed it. They enjoyed the story and the action, and they laughed at the slapstick, and the humour (much of which involved unsavoury smells and substances emanating from a dog and a baby). This film was pretty much pitched straight at them, and worked very successfully - on that level I must judge it a critical success.Personally, as an adult male, Jessica Alba in tight leather is probably the high point of this movie, although I have to say that she is very ready to make herself the butt of sight gags. Apart from that it is mildly, but not greatly, entertaining (I find fart jokes funny, so that was a plus).Rodriguez has fun playing with 3D - the use in this film is far more gimmicky than in most of the other 3D movies over the last two or three years.To address one of the criticisms levelled at this movie: yes, the message is one that we have seen a hundred times in movies before. But that's us oldies - if you're 10, then you may well never have encountered that message before.",
            "review_date": "2011-08-26",
            "lang": "en"
        },
        {
            "review_title": "Tick Tock.....",
            "content": "This film is aimed squarely at kids. The whole franchise has, straight from the word go.And while this film does stink to high heaven, my daughter loved it and laughed all the way through. Thats why i wanted to see it, to entertain my daughter, and it did it's job.Rodriguez makes great quality movies for adults, look at his filmography for the evidence, when it comes to kids movies, he goes even more over the top than he does in his normal movies.This is why i cannot stand all the hate, In 'once upon a time in Mexico', Depp has his eyes taken out. In 'machete' Trejo chops 3 guys heads off at once. In 'desperad' there is a guy with a rocket launcher.So whats the big deal with this.The acting isn't very good, but i've never liked Alba for her Thespian skills, and the rest of the cast are just fodder.The story is okay, and the inclusion of Gervais as the talking dog is painful, even he sounds embarrassed.So why the film is bad, i'm sure the auteur was not making it for people above twelve.",
            "review_date": "2011-11-10",
            "lang": "en"
        },
        {
            "review_title": "Not Oscar-caliber, but high-concept family fun-oh, and 24 Pivens!",
            "content": "I don't understand why this movie is getting panned so badly. No, it's not Oscar-quality, but most movies aren't. When I go to the movies my goal is usually just to have a good time, and Spy Kids: All the Time in the World fit the bill for me, with the added bonus of a message that so often goes ignored. (For the record, the movie is billed as 4D but I saw it in 2D and without the Aromascope card.) For anyone who hasn't heard much about this movie, here's a brief synopsis. OSS (I'm sorry, I've forgotten what it stands for) agent Marissa Cortez Wilson makes a deal with OSS chief Danger D'Amo: she can retire to raise a family after one last mission: capturing the villainous Tick Tock, who has stolen vital OSS information. A year later she's raising her baby daughter and trying to bond with her twin stepkids, Rebecca and Cecil, but Rebecca still resents her for trying to take the place of the twins' late mom. Meanwhile, Marissa's husband Wilbur is launching a new reality show that follows him as he tries to catch spies. Unbeknownst to Wilbur, his wife is a spy and has been called out of retirement to stop Tick Tock and his boss, the Timekeeper, from stopping time. As Marissa is dragged back into service, her niece Carmen recruits Rebecca and Cecil in an effort to revive the OSS's now-defunct Spy Kids Division.The performances range from solid to fantastic. Newcomers Rowan Blanchard and Mason Cook play off each other well as the squabbling twin siblings. I hope they'll continue to do well in the future. As the kids are recruited, they learn that their dog Argonaut is actually an OSS-issue robot dog being used to supervise them. Ricky Gervais provides Argonaut's wisecracking voice, and you can tell he's having fun doing it. Joel McHale's specialty is playing the man who doesn't have all the answers but is positive he does. Wilbur Wilson is one such overly cocky character, and McHale throws himself into the role with his typical wacky aplomb. Alexa Vega and Daryl Sabara return as original Spy Kids Carmen and Juni Cortez. Their roles are relatively small now, but Vega and Sabara retain the chemistry that makes them so believable as siblings. Jessica Alba proves she's more than just a pretty face, showing pathos and surprising comic timing as Marissa tries to save the world and patch up her relationship with Rebecca.Jeremy Piven gets his own paragraph because he probably has the hardest job in the movie, playing the triple roles of the Timekeeper, Tick Tock, and Danger D'Amo. While the Timekeeper is something of a stereotypical supervillain, Piven's other roles come with unique challenges. He completely transforms his face and voice as the grotesque henchman Tick Tock; in fact, I wouldn't have known it was him if I hadn't seen him on Leno and Kimmel; but his third role is the toughest. The Timekeeper turns out to be none other than Danger, who is desperately trying to reconnect with his late father after a time-travel experiment in his childhood separated them. His sorrow and regret seemed to run deeper than the D'Amos and their time-travel experiment to Piven and his own late father, a suspicion that was later confirmed in an online interview. Watching him long for what can never be was heartwrenching and made me wish I could step into the movie and try to comfort him-both Danger and Piven. Playing what is billed as a triple role but comes closer to 24 roles once henchmen, duplicates, time travel, and the elder D'Amo are factored in is fraught with physical and emotional challenges, all of which Piven handles superbly. He gives his multiple roles his all, and as a result he may have delivered one of the best underrated performances of the year.I would like to conclude by mentioning that Spy Kids: All the Time in the World in 4D is already getting Razzie buzz-and that said Razzie buzz is largely undeserved. Go to this movie expecting nothing but a good time with a good message-you might be surprised at what you find. I was, and I can't wait for the Blu-ray so I can relive my amazing discoveries in the comfort of my own home.",
            "review_date": "2011-09-01",
            "lang": "en"
        },
        {
            "review_title": "Arguably the worst film Senor Rodriguez ever made",
            "content": "Shorts in my opinion is the second worst film he ever made.Rodriguez's problem is that he makes his kids' movies for HIS kids only. They come up with a lot of ideas. Unfortunately they're not old enough to come up with good ideas.The film opens with a 9 month pregnant Jessica Alba who is about to give birth any minute. And she is doing a mission. Okay, I know this is just a movie but..... what kind of organization lets A 9 MONTH PREGNANT WOMAN GO ON A MISSION? She's doing all these crazy stunts and doesn't even have a miscarriage. For a family film, this is just offensive.What other sins does this movie have. Well, we have the typical \"girl doesn't get along with her step mother\" cliché, wooden acting from Jessica Alba, Joel playing the same a****** he always does, bad CGI, the villain sounding like a chipmunk and making bad time jokes, gross out humour (we have a scene where a boy throws 4 bags of vomit on an enemy ship and we see it splatter in it's disgusting yellow glory complete with the boy saying \"Never underestimate the power of puke.\" and the baby farts in EVERY single scene she's in) and we have Ricky Gervais doing the voice of a robot dog.Also, how stupid is Alba's character in this film? She takes her baby along for her mission, even though the bad guys are most likely to kill them if they're spotted. (How did this woman get to be an agent anyway if she is so thick?) The villain shows his past on a video. This takes place in the 30's. How was this possible. How did they get an HD camera? How did he do close ups and editing? Who was filming all of this? This shows you how lazy Rodriguez is.I doubt that there would be a Spy Kids 5.",
            "review_date": "2013-10-26",
            "lang": "en"
        },
        {
            "review_title": "Spy Kids All The Time In The World",
            "content": "Spy Kids: All the Time in the World(2011) Starring:Jessica Alba,Joel McHale,Jeremy Piven,Alexa Vega,Daryl Sabara,and Simon Pegg Directed By:Robert Rodriguez Review And to think I use to enjoy these pieces of crap when I was a kid. When I was little I was having fun with the Spy Kids sequels,Lost dreams and Game over 3D. But I watched them again and had a second opinion thinking that they were stupid. This sequel makes them look like the godfather. In the most recent Spy kids movie Jessica Alba is playing a spy who has character name that I really don't remember or care about,who has her last mission catches the bad guy has a baby. Year after that some time keeper villain or whatever the heck his name was,makes time go faster and wants to go back in time to spend more time with his father.Jessica Alba recruits her kids and they must take some diamond and stop the Armageddon device and the time keeper. What immediately ticked me off about this movie is all the marvel references like for example , there is a chase scene in the beginning where the kids are in some CGI spacecraft and there being chased by the time keepers henchmen and it looks like there on the green goblins glider. But wait the references don't stop there,they also have a fight sequence going on and one of the kids have some hammer hands and guess what he says \"it's hammer time\" and then he lifts one of his hands and lightning is surging through it. That's when I lost it. The movie of course even brings back the original spy kids,but here's a problem with that,they do the cliché of he/she is dead but they come back for the finale of the film for fan service although I doubt this series has fans and with this movie they lost them. Spy Kids all the time in the world is one of those family movies that make me hate live action family movies while the sequels before this were bad this is the worst. I give Spy Kids:All the Time in the World a half out of five.",
            "review_date": "2016-09-06",
            "lang": "en"
        },
        {
            "review_title": "fun family film",
            "content": "I honestly do not understand the hate/low ratings of this movie.I took my 11 year old daughter, saw it in 3D and had a BLAST!It was just a silly, fun film with lots of cool action scenes and a great message on how important it is to make the most of every minute, because you can never get time back.The trailer pretty much sums up the movie, so I felt we got what we expected.I am not going to spend too much time on the plot - the trailer and other comments have done that pretty well.The good:1) lots of action 2) I was never bored - and based on the previous comments I really expected to be looking at my watch (pun intended) but never did. 3) The message. I feel living in the 'now' is more important than ever before. 4) Special effects, while nothing to win any awards, were both functional and frequently interesting. 5) Having the original spy kids back (as adults) was a REAL treat, and - for me- the real highlight of the film. I kept thinking - why didn't they have Carmen as the mother and Juno as her brother that had to help fight the bad guys? They would have been SO much better!6) It was truly a FAMILY film! Not that many films I feel comfortable taking my child to, so that in itself was great.The okay to bad:1) The aroma card was really, well, strange. It COULD have added something. But the #'s flashed on the screen so fast, and it was so hard to see the # and scratch it off, that by the time I was finished on one # it was already time to do another! I couldn't smell ANY difference between the smells, though my daughter definitely could! But it really didn't add anything.2) The dog. 90% of the jokes from this creature were just unfunny. I think one - maybe - two jokes made me smirk.. That as about it.3) The kids were okay, but definitely didn't have the appeal of the original spy kids.4) The high-voice time keeper REALLY got to me, it was so annoying!5) Jessica Alba was just so-so. Would have preferred to see the original Carmen in this role.6) The 3D was 'eh.' There were a LOT of times it COULD have been used to great 'in your face' effect, but never was. While it did add 'some' depth to the film, I felt the movie would have been just as fine in 2D.6) The husband and Jeremy Pliven were also - okay. Nothing special.The ugly:1) Okay, I REALLY loved the message of the film. But did it have to be HAMMERED into our heads EVERY scene? I lost track of how many times I heard \"spend more time with you kids\" \"you can't get back time\" \"make every minute count\" etc. Subtlety this wasn't. I kept thinking that somehow this was an apology from the director to his kids for not being with them for some extended time. Have no insight into this, but it seemed that he felt he had to prove this point as hard as possible.2) The barf and poop jokes needed to go. Really.3) The time travel motif was WAY too confusing for kids - and even me! Unless you feel comfortable explaining the movie \"Primer\" to your child, be prepared for some MAJOR confusion. Time travel is difficult enough -they didn't have to make it even more complicated!All in all, we enjoyed this film and there were some really fun scenes.I actually liked this a little better than #2 (never saw #3).Normally, I would say 'good film, but wait for the DVD,\" but I do think seeing it on the big screen helps - even in 2D.7/10",
            "review_date": "2011-08-24",
            "lang": "en"
        },
        {
            "review_title": "Every bit as enjoyable as the first three!",
            "content": "Anyone who hates this movie as much as some of the previous reviewers do, has obviously forgotten what it's like to be a kid.The latest addition to the Spy Kids collection has at its core the values that all the previous movies had as well - it's all about kids becoming more mature, and about pulling together as a family. Sure, I could do without quite as many fart gags, but I never liked those when I was a kid, either. Featuring Jessica Alba as Marissa Cortez Wilson, and Alexa Vega and Daryl Sabara returning once again as a grown up Carmen and Juni Cortez - the original Spy Kids - this movie has some great action sequences and special effects, and it all adds up to a great experience for kids of all ages - even kids who are all grown up.I loved all three previous Spy Kids films, and even primed myself by watching them again this past week. I took my 15 year old daughter to see this one for her birthday today, and she absolutely loved it, as did I. She hasn't seen all three of the other ones, so she didn't recognise any of the cool gadgets at the OSS' Spy Kids Division, but that didn't keep her from having a really good time. I hadn't watched a movie in 3D in probably 30 years - back when you had to wear those goofy green and red cardboard glasses, and if you didn't wear the glasses you couldn't make any sense of the picture - so watching this in the relatively new RealD 3D format was a real treat.Score: One point off for the modernized version of the failed \"SmelloVision.\" My daughter and I both decided to abandon the \"Aroma Scope\" cards after the first three scents really didn't smell like much of anything. But a bonus point at the same time because unlike SmelloVision, which blasted the smells right in your face, now you have the option of not using the scratch-and-sniff cards if you don't want to. So one point down, and one point up. But one point off for having just too many jokes and gags based on bodily functions. The movie would have been just fine without them. I give it an 9 out of 10.",
            "review_date": "2011-08-27",
            "lang": "en"
        },
        {
            "review_title": "Messy and heavy handed",
            "content": "I love the Spy Kids movies - even Spy Kids 3, despite its flaws.When they announced that Spy Kids 4 was on the way, I had mixed feelings. Yeah, it was cool to see another Spy Kids movie on the way and as the cast was locked into place, seeing Alexa Vega and Darryl Sabarra coming back was a total blast. Then it started to get a bit worrying with news of the gimmick of smell-o-vision being used to try and sell this one.The end result? A big mess. On the plus side, the effects and the 3D in this are better than they have been in previous outings. There is some fun to be had seeing Juny and Carmen come back as grown up Spy Kids and there are some nice little links to the original trilogy. The new Spy Kids are kinda fun but not as cool or engaging as the original two and Jessica Alba is pretty game to put up with some of the crap she's put through here. And some giggles can be had from Ricky Gervais' spy dog and Jeremy Piven's multiple appearances.That said, the smell-o-vision thing is just plain distracting (granted, it's not overdone and is largely confined to the starting 20 minutes) with the large numbers flashing on screen and beeping to make sure you actually do scratch and sniff. The comedy is far too heavy handed and relies more on poop and fart jokes than in previous outings and is aimed strictly at the lowest common denominator - talk about dumbing down! And the message is hammered home with all the finesse and subtlety of sledgehammer to the crotch. There are numerous times where the whole \"spend time with your kids/parents\" is said direct to camera and after about the third or fourth time, it gets preachy.It's a shame that Robert Rodriguez felt the need to restart the series with such a lame and heavy handed mess, given just how much fun the first three had to offer. And, on a personal note, I was gutted to see that Uncle Machete was relegated to a blink and you miss him cameo after being built up so well. Aah well, I'm guessing there are plans for another couple movies so there's a chance that it can redeem itself but I think that after this, it's gonna have to work hard!",
            "review_date": "2011-08-19",
            "lang": "en"
        },
        {
            "review_title": "Ok action movie, but not a comedy",
            "content": "After watching the first three movies in the Spy Kids franchise I was interested to see this movie. After seeing that people had rated it poorly as noted on the movie's Wikipedia page, I was ready for a movie that would not be that great.This movie does not focus on Carmen and Juni but rather the stepmother and father of Carmen's children. The concept of the Timekeeper is interesting as it is similar to the villain in the 1990s Inspector Gadget movie in that he wants to stop time.Positives:1. Villain is humanized in that you can emphasize with him and his goal (to spend more time with his father), although you don't realize his ultimate goal until the movie's last 20 minutes. This is similar to the other movies where the villain either turns against his invention (Spy Kids 1) but different from the villiain who wants to rule the world (Spy Kids 2), or wants revenge on the world for locking him in cyberspace (Spy Kids 3)\n2. The gadgets used by the two new Spy Kids have cool effects\n3. A good family movie I guess in that the mother and father are relatable, although the father is so clueless that he doesn't know he has been married to a spy for 2 years even though he is the \"spy hunter\" (a person who tracks spies) who is fired from his job later on in the movieNegatives:\n1. An annoying talking dog, making me think I am watching Family Guy. While the dog helps in the first half of the movie, by the second half he just sits around and does nothing. Why?\n2. Bad or non-existent jokes. This movie is supposed to be a comedy but isn't funny\n3. While the two new spy kids work together, they are more annoying than Juni and Carmen by a long shotThere is probably more but I think this movie does not have the spark of the previous ones. It probably shouldn't have been made at all. The action and excitement of the other movies is not here, even Spy Kids 3, and the OSS seems more incompetent than ever. Spy Kids 3 should have been the end of this franchise (as was originally planned), not this movie.",
            "review_date": "2019-01-08",
            "lang": "en"
        },
        {
            "review_title": "regards above review/Spoiler above",
            "content": "I disagree I think it is nice at times to watch a movie you don't have to put brain power into and that is mindless. Sure there can be some horrible movies but come on give me a break. Having over expected feelings over a movie seriously it's a movie. I did not expect anybody to have so much much time to put so much in depth thought into a movie sure some I could see that but not this. Some times semi cheap effects can still be cool and as long as it is not a complete waist at least watching once and not terribly slow drawn out and over corny with no action what so ever, Than no I think there are kids that could like this movie. To say none will is a very huge statement to make considering there is not factual way of knowing for certain all will not like it unless go to each and all and ask all that will watch the movie. Please be more educated and wise with what indicate and say before do and please respect that you have the right to freewill and freedom of choice but using it wisely and not spoiling it for others who could like movie. It is selfish and inconsiderate, I will say since you were speaking of kids being smart and educational aspects. What it is to truly be wise , smart and educated is to know the right time and place to say something and as well how to say something but not talking out of emotion and impulse but through a well thought out mind frame and with potential at the same time being considerate of others and knowing for a fact what say is legitimate and 100% the truth and nothing but the truth. Its kind of like the saying don't be a hypocrite and practice what you preach there for being what preach and that is all I am saying. (Wisdom)Knowing the right time and place and how to say what is needed.There are many truths in this world people have but all in all only one truly truthful way exist and the others not real. So please be true to your word and don't preach what can not follow.Even though I am for certain what I have said was not your intention and was not your goal and in know way though what communicated was coming off like what said. Good people can have good intentions and direct something with the goal to be caring honest and truthful but as all in life are not perfect even good people as myself mistakes and errors can for certain still happen and indications not intended be looked at in a way and view did not expect and justified. Peace and it is not my goal to be judgmental harsh and for sure not my goal to be rude which is not my intention with what have wrote and indicated. I always look to self improve myself so even any aspect this has come off wrong suggestions are welcome and have no problem self improving and doing better.",
            "review_date": "2011-08-20",
            "lang": "en"
        },
        {
            "review_title": "I'm closer to my inner child!",
            "content": "I'm so glad I loved this movie. It's not normal that so many people find it so bad. So much resentment, such poor capacity of wonder... I hope you people do find the time to spend with your loved ones. Loved the message, loved the way it all flowed. I had a great time. A great experience to share with wife and kid. The acting is actually nice. The special fx are just enough. Not eccentric, not about visual wonder, but rather just perfectly adapted to convey purpose and meaning. The scenery is excellent. The script consistent. Predictable? So what? Is there anything more predictable than death? And that doesn't stop us from living. Nor does that stop us from enjoying life. It's not an excuse. I love this movie.",
            "review_date": "2012-10-22",
            "lang": "en"
        },
        {
            "review_title": "If you are a kid and like poop comedy it is OK",
            "content": "What can I say, after lots of effects that clearly is cheaply made - lots of poop, puke and slime jokes, it only goes downhill.First of all, no one seem to have a brain - which is to expected for a kids movie, but do we have to sink so low ?The father keeps saying he have never caught a spy, I guess it is supposed to make you laugh, as his wife is a spy - OK, wait, she is a former spy.Tons of boring, really boring, time jokes. However, times don't fly when you see the movie, or does it ? because all clocks spins like crazy.So what happens when the time runs out - when no more time left ? Absolutely nonsense concept - but it justify that a bad guy can wear a clock helmet to cover his face. Wow....OK, as we are kids, lets just throw all the food on the floor - lets be good examples too other kids.",
            "review_date": "2015-04-01",
            "lang": "en"
        },
        {
            "review_title": "Why the hate?",
            "content": "Why are so many people hating on this film? I took my kids (6 & 8 y.o) and we thoroughly enjoyed it. I thought the action was very well done and the acting was sound. Loved Alba, thought Piven was great. Re. Joel McHale: so often talk show hosts can't act (they play themselves), but though he wasn't called on for much, he was believable as someone other than Joel McHale. I enjoyed the head-twisting Guillermo Del Toro-esque stuff. Loved the art design. The inside of the machine and all the swirling gears...that was cool.I know the text about family is maybe a tad hackneyed but it was more strident than before in this one, which made me wonder a tad re Rodriguez's own anxiety. IN any case, I was entertained and the kids were too (which made me feel good about time with the kids!) I loved it. We even kept the 4-d smell card (which admittedly did not work very well) so we could remember the experience. Summary: We have seen all the Spy Kids movies and I thought this one was the best. I felt like RR finally hit his stride. Honest. Maybe I'm missing something but I loved it.",
            "review_date": "2011-09-01",
            "lang": "en"
        },
        {
            "review_title": "Back to the old classic spy kids",
            "content": "Really you already know whats really going to happen to a point, there some great stuff. What i like about this is that they have some old classic stuff back when the first two were spy kids. not to mention i thought it was so cool to see Alex veg and Darrel back into action again. Brings back some good old times. as for some people saying its being milk all movies are milk. Lets look at the list transformers, harry potter, chronicles of naria and plenty of more. there not \"bad movies\" nor do you need to bring your level IQ down, sure there some jokes for kids, babies but there some funny stuff you just got to laugh at. English dog that sounds like James bond? hilarious and some other things. I watch all the spy kids. I did enjoy the fact they didn't make the boy so scared or pick noise or be a bit odd in the movie like they did with juni. the only thing i got a problem with there was no real story in it. and it was way to short. still a good movie to rent for the kids and as a parent its not a waste of time. you can enjoy some of it as well.whats better wasting time doing something not with your kids or spending time with your kids? even if you do not enjoy the movie do you think your kids enjoy shopping for clothes and groecy ??? spend time with your family.",
            "review_date": "2011-11-25",
            "lang": "en"
        },
        {
            "review_title": "Not That Bad; Analysis of Rodriguez",
            "content": "This movie is a very interesting thing indeed. Most people have given it terrible reviews.... And I completely understand why. This film has a lot of bad going for it. But it somehow still works.In my opinion, a bad film is a film that can't decently handle it's plot and pacing. The Room serves as a good example of a really bad film. Production comes second, which is what everyone is criticizing, and within reason.I think understanding this film all comes down to one thing: the director. Rodriguez is a good director and knows what he is doing (he made Sin City after all). The plot and script, while not to my taste (and with too many puns), work. Everything is tied up, the plot is consistent, and the lessons are learned without feeling forced.What makes the film really weird (emphasis on the word weird and not bad) is the production. The effects are really bad (and cheap) and the acting is just... Weird (there's no other word to describe it). The script is also just weird. Sort of \"trippy\" in a way. I felt like maybe the script writers were on some hardcore drugs at some points. Obviously, though, that's not the case. Rodriguez was just having fun making an over the top kid's movie. He didn't take it seriously, and neither should the critics. I think the most important thing to find out is do kids like the movie. Because if they do, Rodriguez definitely achieved his goal and this film was a success. Unfortunately I have no idea since my younger cousins haven't actually seen it.Why did I watch the film then, you ask. Curiosity on how one of my childhood movie sagas would continue. And in all honesty, while I haven't seen the originals in over a decade, I remember them a lot better. But maybe my expectations were just lower back then and this is a decent follow up.Either way, I give this film a 6 on 10. While the film has a strong script (as far as weird kid's movies scripts go), which makes the film watchable and definitely entertaining if the subject matter tickles your fancy, just everything else about it is a turn off for anyone but a kid. I would not recommend it to adults or teenagers. If you happen to have Netflix and are running out of good kids movies to occupy your child's mind, this isn't a bad choice. Otherwise, do not go out of your way to get this movie.",
            "review_date": "2013-11-09",
            "lang": "en"
        },
        {
            "review_title": "Remember who you are!",
            "content": "There are lots of reviews about Spy Kids on here that are obviously written (I suppose) by adult movie buffs who criticice just about everything about it from an ADULT point of view. Come on people, this movie was made for kids - not for you! A rating of 3.4 is grossly unfair to the producers and the director and everyone who helped make a great movie for under-ten-year-olds. OK, it isn't the greatest kids' film of all time but it IS certainly worth more than that!I didn't have the benefit of 4D (or even 3D) at home and so I can only imagine how exciting it would have been on the big screen with all the latest technology thrown in. But I will happily watch it again with my grandkids - and I'll bet THEY will give it more than 3.4!From an adult point-of-view, I thought Ricky Gervais as Argonaut the dog was very funny - which, in itself was good because it just goes to show how funny he can be without needing to resort to profanity.I was very tempted to give Spy Kids a 10 out of 10 just to drag the average up a bit but then I figured one vote isn't going to make that much difference so I gave it what I really thought it was worth - a 6 (but then maybe I should have waited for my grandkids to tell me what they think it's worth). I'm looking forward to sharing it with them.",
            "review_date": "2012-06-08",
            "lang": "en"
        },
        {
            "review_title": "Must Watch",
            "content": "One of the most Awaited Movies of the year and it surely delivers. The idea of time being sped up is really well thought of by the director and come honestly how many $d movies have you seen Off lately. The added dimension to the movie of Aromascope is basically smell and you have to experience it its totally fun. The movie is fast paced and gripping and all the character do justice to their roles. The chemistry between Jessica Alba and the new spy kids is very endearing whereas Jeremy piven plays his part amazingly well. The movie is well justified keeping in mind the target audience and assures to entertain kids as well as adults. Totally worth a watch",
            "review_date": "2011-08-20",
            "lang": "en"
        },
        {
            "review_title": "I really wish I could enjoy Rodriguez's kids' movie ventures as well but I just can't!",
            "content": "'SPY KIDS: ALL THE TIME IN THE WORLD': One Star (Out of Five)Robert Rodriguez's fourth film in his popular kids' movie franchise in which he performs his usual writing and directing duties as well as several other functions including producing, cinematography and music. I'm a big fan of Rodriguez, he's actually one of my favorite writers and directors, but I hate his kids' movies; I love all of his films except the ones he aims at children. I admire him fully embracing his inner child, creativity and unchecked imagination but I just don't think it works with his kids' films. Sure they're entertaining and amusing to children but they offer them no other value and have absolutely nothing at all to offer adults (except a painstakingly annoying film going experience). A good kids' movie should be entertaining to adults as well as children and Rodriguez's films definitely don't have that quality. As far as the 'SPY KIDS' films go (as well as his other kids movies) this one is by far the worst as well. It was simply painful to watch and one of the most unpleasant film going experiences I've had all year!It's been eight years since the last 'SPY KIDS' film and stars (of the first three films) Antonio Banderas and Carla Gugino are nowhere to be found in this installment. Jessica Alba stars this time around as retired spy Marissa Cortez Wilson. She's married to a TV 'spy hunter' reporter named Wilbur (Joel McHale of TV's 'THE SOUP' and 'COMMUNITY'), who has no idea she's an actual spy. The two have a newborn baby together but Wilbur's ten year old twins Rebecca (Rowan Blanchard) and Cecil (Mason Cook) don't appreciate their new stepmother. All that changes when Marissa is called back into action to stop the evil villain Timekeeper (Jeremy Piven) from taking over the world and the kids get involved in the action. The original 'Spy Kids' Carmen (Alexa Vega) and Juni Cortez (Daryl Sabara), Marissa's niece and nephew, return to help the new 'Spy Kids' out. Ricky Gervais costars as the voice of the family dog and is the film's one saving grace! The movie completely scrapes the bottom of the barrel clean! There's not much lower Rodriguez could have gone in trying to appeal to the laziest part of children's minds. One could argue that movies like this make kid's dumber but I wouldn't go that far. If I had kids that wanted to watch this and just be entertained for 90 minutes I'd probably let them but I certainly wouldn't want to watch it with them (unless I hadn't already seen it I guess, because of the Rodriguez factor, but under no other circumstances). A good kids' film should be one you can enjoy watching with your children and get something out of as well (like 'THE MUPPETS' from earlier this year, or the 'STAR WARS' films). I really wish I could enjoy Rodriguez's kids' movie ventures as well but I just can't. It's too bad he doesn't put that amazing talent to better use; I know there's a truly great family film in him, he just doesn't know how to channel it yet.Watch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=ioQaCI5Qk34",
            "review_date": "2011-12-22",
            "lang": "en"
        },
        {
            "review_title": "only for 12 year olds",
            "content": "I remember when Spy Kids first came out. I really liked it. Of course, I was also a kid back then. This movie isn't for anyone over the age of 15. It's filled with barf and gas jokes, the older crowd will be just disgusted by it because they aren't funny. And there wasn't a whole lot of cool spy devices in this. Seeing a spy on a mission carrying her baby around is just too much on the silly side.The dog was cute, he should have been the babysitter. Jeremy Piven wasn't much of a villain as Tick Tock. He's trying to steal time and as we find out it's because of his tragic childhood.FINAL VERDICT: Not worth it",
            "review_date": "2012-11-06",
            "lang": "en"
        },
        {
            "review_title": "The death of a franchise",
            "content": "An early Hollywood cash-grab, clearly riding of the success and cult surrounding the original Spy Kids trilogy. Lost all the charm the originals had, and the surprisingly good child actors of the first 3 films, have been replaced by the blatantly terrible child actors in this one. The humour went from quite witty, with some elements for adults too; to the expected toilet-humour you get from and lazy kids film. The beauty of the originals, was that they weren't rated 'U' for kids, they were 'U' for everyone. Anyone could watch the originals, whereas this can only be watched by children not smart enough to understand why they're seeing.",
            "review_date": "2018-05-05",
            "lang": "en"
        },
        {
            "review_title": "A Bit Tired But Still Fun",
            "content": "Checking on the IMDB, I found viewers were upset because it's a movie made for five-year-olds. Yes indeed, it is, and visually striking and a lot of fun, as the next generation comes online.I have a soft spot for Robert Rodriguez' movies -- and not just because he has a cool first name -- ever since I talked a bunch of people into seeing EL MARIACHI; we had a fine time with its comedy elements, while the rest of the audience stared dourly at the screen at the Angelika expecting Cinema. Tio Tortuga is a genius, I tell you, and Rodriguez' efforts in making low-cost movies, using computers well, is a far more worthy use of my viewing time than seeing the latest Transformers garbage.Thinking like a five-year-old for an hour or so is a pleasant occupation, I can tell you. And do.",
            "review_date": "2022-04-11",
            "lang": "en"
        },
        {
            "review_title": "A Great Kids Film!",
            "content": "I think the film has been given a lot of negative reviews on IMDb but the intended audience is for children. I loved the film, the combination of new characters with the previous Cortez kids, to me, improved the film and made it a fun watch. There were a few moments that I found humorous and moments where I actually felt for the characters.Jessica Alba (Susan Storm in Fantastic 4) was an amazing addition to the cast and really brought her character, Marissa, to life. Overall the acting was really good for such a young cast and the story line was different from the first 3 films but I believe the third spykids film (Game Over) was not a very good story line. This film is slightly dark at times but the quality of the film and the issues tackled within the story make it a fantastic watch.I think as a kids film it is pretty awesome and I loved watching it. I would definitely watch it again.",
            "review_date": "2013-07-02",
            "lang": "en"
        },
        {
            "review_title": "It smells . . .",
            "content": "\"I don't like to go to the movies to see violence or some kind of spy thing with all kinds of information you have to assimilate to understand the plot.\" Pia ZadoraThe scratch and sniff card accompanying each admission to Spy Kids: All the Time in the World in 4D is one of the most coherent parts of the experience. Eight times sniffing with some barely discernible smells makes sense, so to speak, if you're writer/director Robert Rodriguez trying to outdo the vibe of his El mariachi or even a previous Spy Kid movie. He needs antihistamine for clarity of purpose and unity of story.Jessica Alba is called back to service as a spy to stop the Time Keeper from taking the world's time so he can go back to his dad. Straight out of Bat Man's Joker. Oedipus this is not although the film would have done well to explore more fully the Freudian undercurrents. At best, Rodriquez sprinkles around a kid's vomit, a dog's flatulence, and a dirty diaper for laughs and for critics like me to discover hidden meanings (I'm still thinking). New spy-step kids help pregnant Marissa in the fight while feckless dad (Joel McHale), a TV spy catcher, is sidelined with identity issues that Sophocles and Freud would have appreciated. Even old spy kids return, but to no avail because the plot is a series of set pieces with some nifty graphics but no depth.The \"super rich sensory multidimensional experience\" promised by a talking dog in the beginning of the film doesn't quite jibe with what I heard a young boy in the men's room say to his friend: \"What a cheesy movie!\"That's as bald an indictment as I have heard about any film aimed at this 10 year old. Although the effects are not cheesy, the story line and characters are. Robert Rodriquez is not, at least when he's not cranking out his fourth Spy Kids.",
            "review_date": "2011-08-23",
            "lang": "en"
        },
        {
            "review_title": "Pants poopingly awful?",
            "content": "That was the byline for a previous review of this film. I want to commend the author for his fine way with words. Actually, this is a good family film that children should love. After all, the kids in the movie get to outsmart adults and save the world. When I was watching this, I was thinking of the late Desmond Llewelyn, he was the actor who played Q the weapons officer in the early James Bond movies. I wondered what he would think of the \"gadgets\" used here. This is the only spy movie I have ever seen where vomit, dirty diapers, and dog flatulence are used as weapons. Oh my bad, I have to realize this is a kids movie and they have to be gross to pull in the youngsters. I had never seen any of the previous Spy Kids movies so have nothing to compare this to. I was just bored and had nothing to do and watching this film helped pass the time, what a great recommendation for it! Seriously, the one positive message in this film is that the two children learn to love their stepmom and respect her when they didn't at first. This movie deals with a villain tinkering with time, but there is a more important message about time in it. The message is how important time with your loved ones is. The dad in the movie realizes this. Maybe this is something parents can discuss with their children after they watch the movie together.",
            "review_date": "2011-09-01",
            "lang": "en"
        },
        {
            "review_title": "Such a disappointment",
            "content": "I am by no means the target audience for this movie, so maybe your 9 year old will love it, but I do like children's films and have very much enjoyed the Spy Kids franchise. Instead of clever plots, well drawn characters, and well written scripts, we get this piece of dreck.The kid's are one dimensional, the adults are blithering idiots, and the bad guy, didn't really seem all that bad. We are constantly inundated with 'Time' jokes, that frankly aren't funny, and I don't think many under 30 would even 'get'. I saw this in 2D, so the special effects were simply odd looking. And I'm ever so glad I missed out on the 4D scents. It appears (and I don't think this counts as a spoiler)that we are treated to the aromas of vomit, bleu cheese dressing, passing gas to name a few.Mostly it just lacks charm. One of the best parts of the original movie was the parents desire to protect their kids from violence, not the case here (Mama takes the baby (who doesn't have a name for some reason) on her return mission). Even the sets lack the vibrancy of the earlier films.It's really hard to believe that Robert Rodriguez had anything to do with this, let alone that he wrote it.",
            "review_date": "2011-08-19",
            "lang": "en"
        },
        {
            "review_title": "Not Particularly Enjoyable Film",
            "content": "A retired spy (Jessica Alba) is called back into action, and to bond with her new step-children, she invites them along for the adventure to stop the evil Timekeeper from taking over the world.I must confess up front that I am not familiar with the \"Spy Kids\" franchise, and only watched part four because it was sent to me for review. Based on other reviews, this is supposed to be -- by far -- the worst in the series, and I hope those reports are right, because it is something of a stinker.I am still confused about Robert Rodriguez. He makes kids films, he makes gory films. He hangs out with Quentin Tarantino... he just seems to do it all. This may be a blotch on his record. But the point I was trying to make (poorly) is that I cannot really follow his train of thought on writing movies...Was anyone offended by the pregnant fight scene? I was not, but I can see other people getting upset. Did anyone else think there were far too many time puns? Did anyone else think it was far, far too coincidental that Joel McHale wanted to make a show about spy hunting? I mean, he has no history with spies and coincidentally has a spy wife. How does that happen? And how does he not know about the panic room? I do hope this is the end of an era... the kids have grown up and Antonio Banderas does not even bother to show up. It is time to move on.",
            "review_date": "2011-11-21",
            "lang": "en"
        },
        {
            "review_title": "just beyond garbage.",
            "content": "I hate it when they have a good series going and then 10 years later they ruin it with all loads of different actors and an entirely different plot.Well if thats what you feel like then don't go see this film.Even the 4D is garbage!So i give this film a 3.5 stars out of 10.Spy Kids 1,2,3 were good,nothing wrong with them but if you don't like cheesy movies then your in for a waste for 10$ tickets.Yep Spy Kids had returning main stars but they weren't great.Like Danny Trejo only had like a half a cameo because all he did was freeze and he didn't make any noise.Antonio Banderas was supposed to have a supporting role but they cut him out. FINAL WORDS:NO GOOD",
            "review_date": "2011-08-22",
            "lang": "en"
        },
        {
            "review_title": "great",
            "content": "it was great the 4d rocks it was funny it was cool, it was fun it was packet you will like this movie a lot it was a really good movie to see it was a good 3d movie i think you will like it too it was funny i think it was a blast go see it today before it gets sold out i really enjoyed it you will too it was a silly movie it was i enjoyed it so much i give it a 4 to of 4 stars that is how good it is it was the best spy kids move ever it was the bomb to watch to see to smell it is the best popcorn movie you could see it was a really funny movie for the family to see it was better than glee 3d it was better than toy story it was better than toy story 2 it was better than toy story 3 it was funny you will have to see because if you don't you missed out on this good movie it was really funny you will see 3d the whole way though the it was great for everyone whole movie to see it was a blast to see it in 3d it was just a good movie you will like it a lot because it was just a good movie to see it was funny it was silly it was stupid my mom said it was for kids but i loved it a lot it was a really good movie i enjoyed it a lot and you will like it too it was funny it was so good it was funny it was a great 4d movie it was a great 3d movie you will like it was so good it was a funny fun movie to see go see it today before it gets to be a sold out movie it was really really good 3d movie you will like it a lot it was a great 4d movie to see you peoplewill like it a lot go see it today it is a funny funny funny movie you will like it so much it is a 4 star movie by me 3 stars by my mom it was a hoot it was a really good movie this was the best movie i saw this year please hit yes that you liked my review it was a blast it felt if you ware in the movie it was a movie that should play for a year it was a funny funny funny funny movie to see it was a funny movie i hope you enjoy it i like this movie in 4D a lot and the 3D was good",
            "review_date": "2011-08-20",
            "lang": "en"
        },
        {
            "review_title": "The audiences aren't stupid",
            "content": "After watching about two scenes from the movie, my thoughts were, \"if this were a 90s movie, I'd probably give it a 6/10\" but it's 2011 for crying out loud. I read some reviews saying it's for kids, leave your minds by the door to enjoy the movie. Speaking as someone who watched the first three installments as a kid and teen, this was a disappointment. Bland humor, terrible effects, bad lines and delivery. Maybe it's similar to the first installment in effects but that was 2001 and that was the best they could do. And that's why we enjoyed it. My parents enjoyed it then and they didn't have to drop their brains and forget every ounce of sensibility to do so. We saw the best effects, animations and adventures of that time and we had to think outside the box to understand it. It's different with this movie, it was 2011, better technology, new ways to add elements to the movie and this was the best you could come up with? I hope by 2020, we won't be asked to act like zombies, forget we have brains or go with the excuse \"for 4 year olds only\" to enjoy epic fails like this. You know how you can do better? Don't treat the audience like senseless carrots.",
            "review_date": "2017-01-22",
            "lang": "en"
        },
        {
            "review_title": "It's okay family fun",
            "content": "Robert Rodriguez is an interesting director. Not only is he the maker of violent films like Sin City and El Mariachi, from time to time he also directs kid's movies. He really loves films and that counts for him. Unfortunately the next installment (or should I say: reboot) of Spy Kids is a little bit disappointing. And that comes from a fan who loves the first trilogy.Spy Kids 4 is more a reboot than a sequel. We get new kids, but the story is the same as in part 1. Charming Jessica Alba is the stepmother of young Rebecca and Cecil but doesn't do a good job because her spy past gets in the way. Just when things turn out for the better Jessica gets called back into OSS duty when the criminal she once arrested has a plan to steal all the time in the world. The two kids discover that stepmum is a spy and of course they follow in her footsteps. A new generation of Spy Kids is born.The opening scene, in which a very pregnant Jessica Alba does her last mission and arrests the bad guy, is actually pretty hilarious. But then it all goes downhill. The two kids aren't as charming as the original kids and for the rest, well, we have all seen it before. Crazy gadgets, crazy special effects... The ending has something to do with timetravel and the one who can explain it to me deserves a medal.Luckily the movie has its moments. Jessica Alba looks pretty hot and proofs she can do both action and comedy. When the old Spy Kids enter the movie, some of the magic returns. Alexa Vega (Carmen Cortez) has grown into a pretty lady. Her nostalgic tour of the old Spy Kids department becomes a very strong scene. Too bad Daryl Sabara (the original Juni Cortez) is so different from his boy-self that we can hardly recognize him. In the end the message that it's important to support your family gets smacked in your voice too many times. Yes, we understand what you're saying. What's also bad, is that because the two new Spy Kids are much younger than the kids from part 2 and 3, the action and (slapstick) comedy is mainly meant for kids 6-9. That makes Spy Kids 4 a real kiddy movie. That's bad news for the parents.I really wished that this movie would be good, because I loved the humour in the first three Spy Kids movies. But even the 3D is bad and the Smell-O-Rama cards don't work. So I'm afraid this could well be the definitive end of the Spy Kids series.6/10",
            "review_date": "2011-09-09",
            "lang": "en"
        },
        {
            "review_title": "Absolutely horrendous. My childhood memories have been spoiled.",
            "content": "The first Spy Kids was released when I was five years old. For years afterward, I loved everything to do with spies. I watched the two subsequent sequels, read the spin off book series, and fantasized about being a secret agent. Of course I outgrew this, but when I heard they were making a fourth movie, I was excited. However, the negative reviews set me off. Could it really be that bad? Well, a few days ago I decided to rent it on my Playstation and watch it with my little brother. A few minutes later, I shut off the movie, deleted it, and convinced my brother to choose a different film. That was the first time I've reacted this way to a movie. What was wrong with it? Let us count the ways: 1.) WAY too many puns. I counted about three puns in the three minutes we got into the film.2.)The villain had an utterly pointless high voice, and acted too much like a children's villain (skipping, high-fiving frozen people? Really?) 3.) Probably the worst part of all (for parents, that is) is the amount of explicit material for a \"family\" film. Essentially, the first part of the film focuses on a pregnant woman who goes into labor in the middle of a fight. Then, right in the middle of confronting the villain, she gasps and says, \"My water just broke!\" That's the point where I shut off my film. Many parents will probably find this film to explicit for children.Granted, I only got a few minutes into the film. But from what I saw, I could tell that this movie lacks everything that made the original movie great.",
            "review_date": "2012-05-02",
            "lang": "en"
        },
        {
            "review_title": "Spy-Kids: All the Crap in the World",
            "content": "Spy Kids: All Time in the World is not good in any way possible, bringing back Carmen and Juni could even save the film. The special effects were as bad as ever(I could tell the main villain's mask {which was supposed to be a clock, which was made of fabric.} was totally fake.)The robot dog was not funny, they didn't even take the time to make it look like least like a puppet when it talks. Now Rodriquez needs to go back to making more mature films unless he is 100%-no, 100,000% sure he can make a good children's movie again.If you just have to see this movie it comes on the only movie channel that would accept it, Showtime.",
            "review_date": "2013-04-16",
            "lang": "en"
        },
        {
            "review_title": "\"Spy Hunter: The Hunt for Mommy\"",
            "content": "Decent watch at best, probably won't watch again, and can only recommend for younger audiences.Well, they definitely managed to get weirder by using time dilation and time travel, it's the worst. Time travel is way too deep a concept to do properly in children's entertainment, but, that said, they did a decent job of dumbing it down so maybe some of the kids could grasp it.Again, it weird to see big celebrities come in when I don't think kids would appreciate it, especially Jeremy Piven, who I know is hard to get signed onto a movie.Again, they spent a lot of time on weird effects or yada-yadaing through a sequence instead of concentrating on a movie of substance.Admittedly the deliveries were pretty good, and the script was alright, despite including time travel, but with all the time spent on the dog, and avoiding action or spending too little time building a scene, the movie evens out with there being less interesting things that good.I think kids will get into, and find a lot of the movie, especially that poor dog, hilarious.",
            "review_date": "2020-10-08",
            "lang": "en"
        },
        {
            "review_title": "I Hate You, Stepmom! Really Resent You. Can't Stand You. And Some Spy Stuff Thrown In.",
            "content": "Spy Kids [4]: All the Time in the World in 4D (1:29, PG, 3-D) — SF, 3rd string, sequelRobert Rodriguez seriously needs to set 4 = end for this series. It's lost any zip it may once have had.The plot make Inspector Gadget look like Dostoyevsky, and the kid actors (Rowan Blanchard as Rebecca Wilson and Mason Cook as her hearing-impaired younger brother Cecil) are either painfully inept, badly directed (by Rodriguez), or both. Jessica Alba plays their stepmother Marissa, a retired spy, and the script totally beats to death the idea that Rebecca has never accepted her and continues to resent her, despite Marissa's plaintive overtures. Really, when I say they beat this theme to death, it's almost as if that was the primary plot of the movie, instead of what I guess was intended as a fun-filled romp with gadgets, talking robot dogs, a mad scientist, and Beagle Boy henchthugs.Alexa Vega and Daryl Sabara return as the now young-adult alumni spies from the previous movies. Corny dialog, preposterously cheap special effects, bright colors, blatantly badly choreographed fight scenes, and many other wink-wink-nudge-nudge, \"see how you're in on the joke\" corner cuts also make a return engagement, but it's as if everyone involved had been thru them a thousand times before, and the result is like overcooked celery: It just lies there, limp, soggy, and unappetizing.I write my reviews for adults, who should definitely, absolutely stay away from this turkey, but I can't imagine that kids of any age would find it interesting or exciting, either.The 3-D was a post-production conversion hatchet job, probably the worst I've ever seen, and if for some reason you feel compelled to see it despite the above warnings, for heaven's sake save your money and see it in 2-D instead.Oh, the 4th D in the title? It's supposed to be for Aroma-Scope, an 8-spot scratch-and-sniff card that apparently was distributed in some theaters so you could snuffle along with the story. I noticed that 1 numbered star flashed on screen (the \"scratch now\" cue) in company of the line \"Never underestimate the power of puke.\", and I was grateful that my theater hadn't provided me with the full 4D experience.Why does it get a 2 instead of a 1? I did allude to Jessica Alba, right? Did I fail to mention the black-leather jumpsuit?",
            "review_date": "2011-09-07",
            "lang": "en"
        },
        {
            "review_title": "Rodriguez, what were you thinking, man?",
            "content": "He obviously wasn't. This film felt as though it had no effort put into it, I'm not quite sure why it was even made. Don't waste your time.",
            "review_date": "2020-03-24",
            "lang": "en"
        },
        {
            "review_title": "Spy Kids 4",
            "content": "I find it impressive that a FOURTH Spy Kids movie was even pitched, let alone released as this incoherent travesty.",
            "review_date": "2019-11-21",
            "lang": "en"
        },
        {
            "review_title": "I SPY with my little eye something awful",
            "content": "This is definitely the worst spy kids movie ever made and 1 of the worst of all movies. The scenery was too boring or twisted. What is with a spy baby, a spy dog, and a villain who doesn't know what he was doing until the kids showed him the real truth? The kids who played the spy kids didn't even go on a mission until the last 20 minutes of the movie to experience being spies. The father was creepy showing an eye brow look to his son to look tough and his show was dumb. How dare filmmakers imitate a similar home to where The Cortezes lived in! Acting was poor. Same goes for the gadgets. What was ironic was the new spy kids looked much younger than the original spy kids, when they started being spies. I think this was just a movie to laugh at how poor of a job it was made.",
            "review_date": "2014-02-03",
            "lang": "en"
        },
        {
            "review_title": "entertaining. better than i thought it would be",
            "content": "this movie was not as good as the first three spy kids movies. but it was better than i expected it to be. it brings in two new kids to be the stars which was one of it flaws and a new mother and father. which is another big mistake. if your going to make another sequel to a successful film franchise don't change the stars. i couldn't imagine as a rocky without Stallone. i couldn't imagine another Hannibal without Anthony Hopkins. some things just shouldn't be changed. this movie is about two kids who's mother has passed away and the father who is a spy hunter marries a spy pretending to be an interior decorator (Jessica alba). he must not be a very good spy hunter. now she caught a villain named the time keeper who is played by Jeremy piven. who also plays three other different characters. one good guy, one bad guy, and henchmen. but it all makes sense at the end. so Jessica Alba's character catches the timekeeper while pregnant and after she does she goes into labor and retires. now the timekeeper has escaped and now is after he kids. to help they bring back Carmon and juni to help. which was a very good idea. bow this movie was a shocker. it wasn't like the other spy kids movies. they didn't have the original characters from the other movies in this film. for example. floop, minion, uncle Felix, the two parents of Carmon and juni but Antonio banderas was casted to return, but they cut there scene. why on earth would they do that to a big star like Antonio banderas. how dare you Robert Rodriguez. in fact the only original character that was brought back other than Carmon and juni was uncle machete (danny trejo) who you see for two seconds and he is frozen. but this movie was pretty good surprisingly without them. Jessica alba who has been criticized many time by he acting skills brought an entertaining well acted performance for an action comedy film. but i still miss the stronger women figure Carla gugino who played the mother in the other three spy kids film. kids will probably love this film. this film is for more of the younger spy kids fans than the others have been. teenagers and adults may like it, may not. it depends on your interest. but the comedy and action is much more kid like than the others. still a fun, action, comedy for the whole family. and a movie that you don't have to think a lot. i say see it.",
            "review_date": "2011-09-01",
            "lang": "en"
        },
        {
            "review_title": "Makes time stand still.",
            "content": "A theme of the movie is to make the best of you time. If you want to do that, don't see this movie.It's an acceptable family movie but be prepared to answer plenty of questions from the kids. Why is the good guy the bad guy? How did the boy get stuck in time? Why did he come back old this time? Where did all the copies of the guy come from and why are they the same age?There's a 4D smell card gimmick that is a distraction. The scratch and sniff takes you away from the lack of action on the screen and gives you a repeated smell of sweet cardboard.Kids who recently saw the original \"Spy Kids\" on DVD preferred the original over this confusing reboot. A bright spot is the Ricky Gervais wise cracking dog. Thinking about quality family time, go on a picnic.",
            "review_date": "2011-08-22",
            "lang": "en"
        },
        {
            "review_title": "Pretty bad",
            "content": "Spy Kids 4 is an improvement on 3, so it at least gets credit for that. Unfortunately it is a rather bland adventure without the best acting, there are a couple of fun moments and children may enjoy.Plot is average and the acting from the main kids was pretty rough, I have to admit the talking robot dog did get a couple of laughs out of me.3/10: Below average children's film, not particularly good in any category",
            "review_date": "2021-02-21",
            "lang": "en"
        },
        {
            "review_title": "Very exaggerating",
            "content": "First of all, I was disappointed by the absence of \"Antonio Panderas\" from this movie. Another thing is the silly gadgets they used in the movie. HEY PEOPLE, \"A SPY DETECTOR\" !!!!!!!!!!! what the ......... ? This is the worst gadget movie I've ever seen. And why did they use the same gadgets from the old parts? THIS MOVIE DOESN\"T WORTH WATCHING IT. Even the story is very weak. talking about time machine AGAIN!!!!! I don't mind making a movie about time machines but it should be innovative and creative. AGAIN I advise you not to watch this movie. It is very very very boring. I regretted that I wasted an hour and a half watching it.",
            "review_date": "2011-11-14",
            "lang": "en"
        },
        {
            "review_title": "Garbage",
            "content": "Garbage, garbage, garbage. I don't think I even smiled once so appalled was I. All the poop and barf and fart humor was just insulting, the chemistry between the parents was not there, their love not believable at all. I liked the kids' acting though. Jessica Alba is a sexy mama but that is out of place in a children's movie if you ask me. And then I can't stand movies that are just mainly battles, especially a kid's flick. The plot made some sense (but had some major flaws) but the message was spelled out way too much and repeated over and over just in case we didn't get it. Perhaps I am old-fashioned but I like children's films to be cute, imaginative, non-violent and beautiful (as an art form).",
            "review_date": "2011-09-14",
            "lang": "en"
        },
        {
            "review_title": "Way too ambitious for a sequel in a bad franchise",
            "content": "Stunningly, the combination of the Weinstein Brothers, Ricky Gervais, Jeremy Piven, Joel McHale, Jessica Alba and Robert Rodriguez results in a not just a cinematic mess but not even an interesting cinematic mess. Gervais and McHale are among the smartest men in comedy and yet the film isn't even fleetingly funny. Rodriguez and the Weinsteins makes visually inventive pictures and yet the film is a bewildering assault of cheesy CGI. The core problem may be the writing – the characters may just have nothing funny or interesting to say and Rodriguez may have tried to overcompensate by having the animators work overtime. The writers certainly display a high level of ambition. The plot conjectures about the nature of time and toys with the paradoxes inherit in traveling backward in time in between fart jokes and a shopworn stepmother plot. To complain that children will not grasp the plot falsely suggests there are adults who get it. In short, there are far more entertaining children's movies require a lot less effort on your part.",
            "review_date": "2011-08-28",
            "lang": "en"
        },
        {
            "review_title": "Crappy Cash Grab",
            "content": "Shame on this film....shame. This 4th instalment to the fantastic Spy Kids franchise is extremely disappointing.\nSpy Kids 4 was made ages after the first trilogy as if someone thought it would be pretty cool to bring back the series. It was not.\nInstead of bringing a new generation to the amazing adventures of Spy Kids, it's filled with extremely cheap fart jokes and horrible writing. I went to see this film in the cinemas and it claimed to be in '4D' what they really meant was a scratch and sniff card that was all just fart smells. The main conflict of the film is that time is speeding up, however the film does not show that at all apart from clocks functioning faster. Remember show don't tell? This movie doesn't. Overall pretty dumb and cheap cash grab and I'm glad no one remembers it.",
            "review_date": "2020-08-03",
            "lang": "en"
        },
        {
            "review_title": "The Worst Spy Kids Film",
            "content": "Spy Kids: All The Time In The World goes even lower than the previous two to the point of being unbearable. I'll admit the one and only redeeming quality is at least it's not like the third film and unfinished. But it doesn't forgive everything else is unfunny in so many levels. From my view, I never once either laughed or even chuckled. The film is filled with disgusting jokes and awful gadgets. The story has came out broken down and a disaster. It does not have a proper continuation after the trilogy. The action in this movie is completely outdated and cringy. The logic in this movie makes absolutely no sense. The visuals look like it cannot be afforded to upgrade considering this is the lowest budget of the franchise. And the characters are completely unappealing and have little to nothing to put effort into. Do I really need to say something to anyone? Don't watch this movie. I'm not even sure if fans of the trilogy are gonna like this as much. Because this is one of the most soulless films I've seen in my life that doesn't want to continue its story. So please, stay away from this movie. I'm not afraid to admit, the franchise is better off to stop right here. In fact, it should've been a stand-alone film. Because Spy Kids is an example that would be fun for the kids. But with the sequels, they've gotten stupider and stupider and stupider. And this brings the franchise to an entire new low. This thing even feels it's the end of the world for the franchise.",
            "review_date": "2021-11-12",
            "lang": "en"
        },
        {
            "review_title": "And I'm a Spy Kids fan!",
            "content": "What to say? Me and my brother (18) and his friend (also 18) went to the cinema and decided on Spy Kids 4D most based on our previous liking original 3 movies and the fact that 4D could only be interesting in cinema, not video. And so I expected a decent and fun children's flick, with warm message and lot of fun action.So, I was ready to love this movie in a children's kind of way and to see the Spy Kids legacy was supposed to be fun. BUT, when I saw the movie, I was totally disappointed. It was awful. The real value of this pic is exactly that three stars that average ratings gave, but I gave it more due to my admiration for Rodriguez, Alexa Vega and Daryl Sabara. And seeing them all grown up and looking so cool and attractive was the best part of the movie, although their characters didn't do squat this time. They were kinda just... there, even more than Banderas and Gugino were before. But it was nice seeing them anyway. Although, for Alexa and Daryl fans out there, if you really wanna see them now in something worthy, go see Halloween, Repo or Machete.I know that the story is supposed to be bubbly and childish, but I think that they were totally out of proportion with plot-holes and defying gravity and common sense, for anyone older than 7. And there are many children's movies who are still innocent and fun, but far more realistic anyway. I didn't expect much realism anyway, but 30% of realism couldn't harm even the most imaginative films in the world. The talking dog-robot, shiny colors, gadgets who look more like MacDonalds toys than anything else (I suppose their replicas are supposed to be in promotion), ALL IS OK by me. BUT, I draw the line at villains WHO NEVER PUNCH OR TRY PUNCHING ANYONE, not even adult characters! They just stand there and wait to get hit!! Also, performances were OK, adequate for this kind of film, no one's acting was above or below the OK level. Jeremy Piven was actually really fun as the main villain (Gosh, I 'spoiled' the 'unpredictable' plot twist!) and his image was kinda cool.And I usually like kids, and I'm ready to defend them any day, but the little girl was SO ANNOYING!!! If she was an adult she would be called a name starting on B, no doubt. And the way she treated Jessica! I never thought I would say that, but she needed to get hers, and not her brother instead, who was kinda cute.Effects were decent, but 4D was awful! At least in my cinema. NOTHING was going out. Numbers couldn't be scratched out, just on them, and all smells were kinda similar, mostly like peppermint.And yeah... 'Spy Detector'... right! But I guess it is OK if you are 7.",
            "review_date": "2011-11-24",
            "lang": "en"
        },
        {
            "review_title": "it's funny cos it's crap",
            "content": "terrible movie!!as soon as i saw the advert in a shopping center, i thought, \"thats gonna be a terrible movie\". as soon as i saw the trailer i thought, \"wow, that is going to a pathetic movie\"i watched this movie with a friend and we spent the whole movie insulting it, pointing out flaws, mistakes and holes (which came up often), bad acting and basically predicting the entire movie, which was very easy.this movie was a miserable effort, and the only reason i gave it 2/10 was because the dog Argonaut was absolutely HILARIOUUUUUUUUUUUUUUUUUUUUS, loved that British accent and his smart ass attitude. if not for him, it would have been a 1/10.",
            "review_date": "2011-09-27",
            "lang": "en"
        },
        {
            "review_title": "Average Film",
            "content": "\"Spy Kids: All the Time in the World in 4D\" does not have interesting end it's little dis-pointed if you watch all spy kids movies. Story is created only for kids. The film has good 3D effect and from the Aroma Scope is good. Watch it in 4D you will like it. Average film for me. card of 4D has good smell , but only children will love it. for me this film is Average film. 5 points from me. If you want good time with your children then go go go... At an innocuous hour and a half, the connect-the-dots simplicity of the plot goes down smoothly, while the oft-recited platitudes about family and time actually hold some water given that most of them are being recited— and learned by—children. As far as babysitting devices go, you could do far worse. Visual effects range from passable to pitiful, and the film has the overall look of a direct-to-video quickie.",
            "review_date": "2011-08-22",
            "lang": "en"
        },
        {
            "review_title": "Trash. Watch the first 3, then dump this",
            "content": "I have to say, it really deserves a negative 99. Now, I absolutely loved the trilogy of the Spy Kids movies. I was sad it was done, and wanted a 4th and 5th and so on. But when I saw this, I was outraged about how stupid this was. Now, since Robert Rodriguez is done directing good movies, I wish this movie never happened. This just absolutely downgraded the whole Spy Kids franchise. I hated this movie. Oh, and the 4D was just annoying. One time, a kid farts and it tells you to smell it. What kind of a movie does that. Well, I don't see any new movies using it, and that was a smart move. If this movie was called anything else, I would of still thought it stunk, but putting the Spy Kids title on it just made it worse. Jessica Alba did the best she could, for her role was stupid and meaningless. Carmen and Juni were a big success. The other 2 know it all brats, one a child who is hearing impaired, and 2, a prank pulling, bad acting, brat daughter who defines the word selfish. Snow White and the Huntsman has better jokes than this (And Snow White has no jokes). The plot to this story was the typical plot. A step mother with two step kids, one who hates her and a Spy Hunter T.V. show star husband. But the step mother is actually a spy. When the two kids are attacked, they have to get in to action and fight against the time keeper. For some reason, Carmen and Juni are in this, but they are a lot older. This a stupid movie, and the only thing good about this movie was the talking dog voiced by comedian Ricky Gervais. I don't know how they got him for this $2,000 picture. At one part, where the bad actress who does the prank star step daughter is attacked by some giant claw, she tries to avoid it and turns her head to the side, avoiding the claw. If you look closely, you can see her smiling. This was a huge disappointment, and awful film. Absolutely terrible. D-.",
            "review_date": "2012-12-12",
            "lang": "en"
        },
        {
            "review_title": "The children really enjoyed this",
            "content": "We saw this as the initial part of a birthday party as it was on at Kids Club. So with eight children in tow we went in to watch the film in 2D and notionally using 35m film stock and also with the cards.The plot is the usual formula, black and white, good and bad with the one in between who needs redemption but the action scenes are good and the smells gave the children the chance to say \"what a pong\" or similar even though the smells were not that different. At least it was an attempt at seeing whether you looked it or not, just like whether you like 3D or not.There is no need for much plot enlargement as other reviews give most of it away but my wife said that she would want to get this on DVD as soon as we came out of the cinema so it must have been good.",
            "review_date": "2011-11-06",
            "lang": "en"
        },
        {
            "review_title": "Worth the watch. :)",
            "content": "Spy Kids: All the time in the world (4D)(Even though the whole movie is about time running out, the reason behind the title will become clear soon enough)Overall a good entertaining movie even though it doesn't have the same atmosphere that the 3 previous films held together despite having completely different plots each time. The dramatic music is held back ever so slightly and only once Alexa Vega returns do you feel more in tune with the Spy Kids world. Ricky Gervais as Argonaut keeps the humor going big time! Perhaps just for those who are British like me, I don't know what Americans think of him and most importantly, I don't care. The funny thing is Argonaut seems to act completely bored with the movie after a while, maybe the dog found it boring, but the movie kept me glued to the screen. There's nothing more annoying than the villain having a STUPID, high pitched American accent, I'm not sure what State this comes from but jeez Louise, it's so irritating. Did I miss a caption saying \"3 years later\" at the beginning of the movie? Or does that baby grow up really fast? Is she the only one affected by time speeding up? I'll have to check that out again. In one scene Alba basically uses her baby as a human shield - great. Alba, my goodness... There IS such a thing as babysitters.. but no, go ahead, endanger your babies life.. I'm sure you have your reasons :)At one point does Alba say \"Your really starting to tick me off\"? Well, that might be bad enough for a movie about time, clocks and what-not but the first time I watched it I thought she said to the -oh so squeaky villain- \"Your really starting to get me off\" Why.. err.. I didn't see the attraction but okay! :) Maybe she's into squeaky voices, who knows. How many times does a revolting stench have to pop up in the movie? So your meant to scratch the right number before someone in the movie farts in your face, there should be a warning. So glad I didn't see this in a 4D Cinema :DPretty average acting from the kids, but hey, they're just kids, they will get better in TIME. Zomg, I just had to. Sooo, the main villain we have is the Time Keeper, yes. He isn't an epic bad-ass like what Floop, Minion or the Toy Maker were. Though we don't see much of him in the first 45 minutes of the film, most likely due to the fact that his costume almost made me wet myself.. we wouldn't want that in the Cinema's would we? But hold the phone, we've already got the farting stench, we might as well have the stench of pee to go along with it.. moving on. (I've caught cheesy disease from this movie, excuse me.)I couldn't wait for Alexa Vega to get out of that uniform... you know she's 22 now? I know right, where did the time go. It was nothing to do with the Time Keeper if thats what your thinking. Eight years since Spy Kids 3-D: Game Over. I feel old. \"Ohh Shii-Take Mushrooms!\" Almost fell for it this time Alexa, almost. I liked that part, it brought back memories of kids trying that one at school after the first Spy Kids, though they still got detention anyway. Where I'm from and probably everywhere else in the English speaking world, saying $hit isn't such a bad thing.Cecil (the boy) seems a little heartless or at least emotionless when it comes to his mum being dead. Rebecca is torn up about her mum being gone but he really doesn't care. I thought he was just bottling up his feelings, as boys tend to do only to reveal how he feels at the end, but no, he couldn't care less. Hell yes, Ralph returns. Remember Ralph? He was awesome. I used to want a Ralph.. when I was small.. Remember Robosapien? He was my Ralph. Kids will love this movie, not sure about adults, but it's definitely a good family film.\"It's not about how much time you have, it's about what you choose to do with it.\" I felt something from this movie and the messages within it, probably just because I, like loads of other people, can relate to these things. I regret some of the time I've wasted. The movie tells the audience about the regret you will feel once you've lost the time that you should have made the most of. Sure, the movie wasn't the BEST movie ever but it was far from the worst. I've never seen a movie try to spread this message before, it's interesting. A definite eye opener. So wake up, your clock is ticking, just like everyone else's.",
            "review_date": "2011-08-25",
            "lang": "en"
        },
        {
            "review_title": "Plain cheesiness for little kids",
            "content": "The movie itself was pretty awful. The plot, the CGI, the humor-everything. The idea to put in a couple of hotties may have got a few million profit, but still it was pretty cheesy. By the end of the movie, I just wanted to get away from all the clocks and gears in my sight. I mean, how was there a color video of an experiment in 1930? 1/10, unsuitable for everyone.. I don't suggest you \"waste your time\" on this movie. I hope there won't be an even worse \"Spy Kids 5\" . . . Because of movies like this kids start To think that planes can fly with one wing and that AI has already Been invented. I do not recommend this to anyone",
            "review_date": "2013-05-02",
            "lang": "en"
        },
        {
            "review_title": "Better than what I expected, but it was still awful",
            "content": "This movie that I realize has a great 4D option that was great, but the story and how the characters work and relate is okay. The worst part, well there's a lot of stupid and useless parts. The first one is the story line. The story line was a little waste of time for most people, but some people really loved it, unlike me. Second was some of the animations that were used in some of the scenes. If you've seen the trailer of how the dog talks, in the movie it was ten times worse than the trailer by far. Third, well there's nothing else awful. On the other hand, there was some good family humor that I loved, but it wasn't the best out there.",
            "review_date": "2011-11-19",
            "lang": "en"
        },
        {
            "review_title": "A family movie with good core values",
            "content": "The basis is that both Tick Tock and the Time Keeper are at large and are speeding up time, intended on actually stopping time. It's up to Rebecca and Cecil to join their stepmother, who's a retired spy, in defeating the villains and save the day. It is at the OSS that Rebecca and Cecil meet OSS boss and former Spy Kid Carmen Cortez. In the meantime, Rebecca and Cecil's father, Wilbur works at Spy Hunters, a local television show about hunting and capturing spies. The only problem, though, is that he has yet to catch a single spy. That is until his spy compass points him towards multiple spies.This film stars Rowan Blanchard (Girl Meet World) as Rebecca Wilson, Mason Cook as Cecil Wilson, Joel McHale (Community) is Rebecca and Cecil's spy hunter and happy-go-lucky father, Wilbur Wilson, and Dark Angel's Jessica Alba as their stepmother Marissa Wilson, who also happens to be a spy. Jeremy Piven (Entourage) plays three roles in this movie: Danger D'Amo, Tick Tock and Time Keeper. Ricky Gervais voices Agronaught, their talking dog, who also happens to be a spy.The writing is pretty good and funny, as is the directing, and acting from the like likes of Alba, Blanchard, McHale, Cook and Piven. Altogether, they make the movie funny! Alexa Vega and Daryl Sabara reprise their roles as Carmen and Juni Cortez, respectively, and Danny Trejo reprises his own role as Uncle Machete. Alexa's acting wasn't as good in the beginning as it has been in the past, but she can be forgiven as it had been eight years since Spy Kids 3-D: Game Over, the third instalment was released. It also improved over the course of the movie, as did Daryl's.You would think that the fourth Spy Kids movie would not be as good as the first three, but it's just as good. It is, perhaps, just as good as the first! Of course, there are some things that the parents will pick up on and cringe about, but not the children; these little details will go over the children's heads. The graphics and lighting, though, like with the first three movies, are great!One of the great things, though, is that it still maintains that strong core value, which is that even as we grow up, family is everything and we are stronger as a team rather than fighting against each other. Together, we can waver any storm!The premise is really good, like the first instalment, as are the writing, directing, casting, lighting, visual effects, audio, scoring and producing! The movie is enjoyable for the whole family, not just for the children, with funny moments and lots of action, as well as stretching the imagination, introducing families to a world beyond reality. In the world of Spy Kids anything is possible! Parents, who grew up with the Spy Kids franchise, all of which began nineteen years ago in 2001, will be able to share their favourite movies with their own children.When Alexa first appeared, I thought her acting was a bit wooden, but it has been at least eight years since Spy Kids 3-D: Game Over was released, and her acting got better (or I could overlook it) the further we got into the movie.There are two downsides to this movie, both of which will go over the children's heads:\n1. Jessica Alba's fake pregnancy belly was... well, it wasn't fitted correctly and was clearly a fake.\n2. It was produced by the Weinstein brothers, which includes Harvey Weinstein.Other than this, the movie was pretty good, fun for the whole family, and that is why I would give it a 6.5, but seeing as the rating system doesn't include fractions, I will give it a seven out of ten.",
            "review_date": "2020-04-25",
            "lang": "en"
        },
        {
            "review_title": "Another stupid Spy Kids movie.",
            "content": "This movie is a beginning of a new era of Spy Kids. Robert Rodriguez once again wrote the script and directed a movie by himself. This information tells us how big egomaniac he is. This is also the reason why all of the Spy Kids movies were bad. Even the world crisis could not stop Rodriguez; some people are broke and hungry, while he spends a lot of money for such junk, also called as a disaster. I was also at the premiere waiting in a big, long line of people with my 3 friends and all I learned from this movie was that Mason Cook and Rowan Blanchard (Cecil and Rebecca Wilson) are only ''wannabe'' superheroes or spies or whatever they should be. I also have to mention that one of my friends(I'm not gonna mention names) had to change his pants after the premiere, but not because he was scared or anything like that, it was because I threw up all over his pants, because the movie was so bad. The idea of ''Aroma-Scope cards'' was dumb such as the story. I give this movie a thumbs down and a rating 4 out of 10 (only because I fell sorry for the ''Spy Baby'' and that dog; they were fantastic).",
            "review_date": "2012-08-24",
            "lang": "en"
        },
        {
            "review_title": "Don't be mistaken it is a movie for kids",
            "content": "And my son adored it so an eight is only fair. Asking him it would have been 1.000.000 points but you have to understand through the eyes of a child, like in the movie.",
            "review_date": "2019-07-11",
            "lang": "en"
        },
        {
            "review_title": "An awful film.",
            "content": "The only reason I even watched this in the first place is because I noticed that Joel McHale was a cast member. I regret that decision, because I realized that I just wasted about 1 hour and 50 minutes of my life watching this uncomfortably bad, cheap, and terrible film. Do NOT watch this! It is most certainly not worth the time it takes to watch it.",
            "review_date": "2021-03-24",
            "lang": "en"
        },
        {
            "review_title": "Very Disappointing",
            "content": "Remember the movie I Robot? There's a scene where Will Smith puts on a pair of brand sneakers. I believe that's called product placement. If throughout the movie, on the other hand, the sneakers had come on screen again and again, with Smith repeatedly saying how great they are, then it wouldn't have been a movie, but a commercial. That is what Spy Kids IV is. A huge 121-minute long commercial for \"family\".While Rodriguez's movies usually have a \"family\" message to them, in this case it's way over-the-top. The word \"family\" is endlessly repeated until it bogs the story and the mind down. Even worse, the plot itself seems to exist only as a means of allowing the \"family\" message to thrive. The fact the puns with \"time\" and \"clock\" are equally endless doesn't help one bit. I've simply no time for them.As for the characters, the only interesting one is the dog. But it's not nearly enough. If you're a big Spy Kids fan, you'll enjoy seeing Juni and Carmen all grown up. Again, it's too little. And to be honest, their presence doesn't help the plot at all. There's too many adult non-essential adult characters using up screen time. I've read other reviews and, trust me, this is not about grumpy adults who don't get it. Sure, some kids may like the movie. But that doesn't mean it's good. Just like adults like crappy movies that no younger person could enjoy, this is a movie that might be enjoyed by some kids, but that very, very few adults will be able to watch through until the end.To summarize, adults might consider spending time with their family instead of watching Spy Kids IV. Or, you know, simply just watch a different movie...",
            "review_date": "2011-11-07",
            "lang": "en"
        },
        {
            "review_title": "\"No one ever notices time, until it's gone.\" - Tick Tock.",
            "content": "A couple children discover their step-mom was a spy and become unwitting targets of the super villians, Tick Tock and Timemaster.I've never seen any of the other Spy Kids films. I was in the generation where when the original trilogy came out (2001-2003) I was in high-school and the film was targeted at a much younger audience. However, I am a 3D aficionado so when Spy Kids 4-D came out I was very much aware of it but only got around to watching in on 3D bluray very recently. The film is extremely childish, its a kid film after all, but I actually didn't mind the premise of it and the child actors were surprisingly likable. The action scenes aren't anything to write home about but they were fun and it's very family friendly so long as you like fart and poo jokes. The cast was interesting and it had some great names in this like Jeremy Piven, Jessica Alba, Joel McHale and Ricky Gervais as a talking dog. They arnt exactly used to their fullest potential but as an adult, I appreciated the star power. Although the jokes are aimed at children and not overly funny to me, there is one or two which I genuinely laughed at such as Jessica Alba trying to look cool and bonnet slide across a car while pregnant and chasing a bad guy! And even though I have no nostalgic connection to the first 3 films, I appreciate the fact that they got the original child actors back (now both in their 20s at this time) to resume their characters. There is a little twist in the tail I didn't see coming in regards to the bad guys, the story wasn't as cut and dry as I had expected and I lobe it when a movie is unpredictable for good reasons. But the twist in the story also leads to one of the films biggest let downs - the kids play almost know role in the eventual ending, and argument can be made if the kids were never around the outcome of the story would of remained the same. Maybe I missed something though... but to me, the ending would of happened with or without them which is odd considering the film is named after them! The only other big let down is the overreliance on CGI backgrounds. They are not looking good or holding up that well after all these years... has a very fake look to it all and sometimes took me out of the film. The 3D was noticable and had a few gimmicky shots, but I don't feel it was as well utilized as it could of been. The smell-o-vision cards that came with the movie also didn't impress me. When the number flasher on screen that's the number your rub n sniff to help create the immersion of if you were actually there and could smell what they smelt but the numbers all ended up smelling the same anyway and I don't know if that's because the cards are old, spent too much time trapped in a bluray case together and tainted one another OR were they never that great to start with and all smelt the same anyway???Final Verdict: As a kids action film, I think it's more than adequate and children under 10 or 11 should really enjoy it. It's easy to understand (mostly), plenty of cheap laughs for young ones and it has likable, relatable characters. For us adults, it's not fantastic but then again it's not for us! But I have to say, Jessica Alba, in a full body leather suit is a winner any day of the week ...",
            "review_date": "2022-08-31",
            "lang": "en"
        },
        {
            "review_title": "The Spy Kids Franchise Should Have Stopped At The Third Movie!!",
            "content": "When I sat down and turned on this movie I was expecting something good, like the other movies were. But I was very disappointed and upset that I wasted an hour and a half of my valuable time watching this! Let me explain.First of all, I think this movie was very predicable and frankly, cliche. For example, There was a father who was a workaholic and didn't have time for his children, CLICHE. And there was a step mother and of course she didn't get along with the daughter. CHICHE! But besides the cliche, The movie was very predictable and you knew what was going to happen the whole movie.Second of all, The movie seemed like it was low budget and the acting was not the best. I understand they are children but the acting could have been a little bit better. Other then that, the cgi was ABYSMAL I think anybody could make cgi better then that!In conclusion, I think this movie was not worth watching and if you do end up watching it you would have wasted your time.",
            "review_date": "2019-06-17",
            "lang": "en"
        },
        {
            "review_title": "Not Good",
            "content": "I must say after taking my brother to see this in cinema, I was annoyed.First off I have been a fan of Spy kids since I was a child, always said I was going to be a spy like them. The first two was good... The third, was okay but this? It was a waste of my money and in my opinion ruined everything else.Even the 4th dimension was rubbish. I couldn't smell a thing, not matter how hard I would scratch it. Another pointless thing.All in all, I wouldn't recommend this movie for anyone, not even the young. My brother even hated and he usually loves these types of movies. It was a waste of time.",
            "review_date": "2015-01-11",
            "lang": "en"
        },
        {
            "review_title": "Oh god. Put me out of my Misery",
            "content": "Seriously. What did I just watch?. Cringiest movie ever. I had to right this review down the millisecond the movie ended. I was watching with my siblings. We absolutely hated. Not funny. Terrible TERRIBLE CGI. This just couldn't get any better. If your a Sht movie enthusiast. Go ahead. Take a look. You'll love this one. Be sure not to die of cringe. Cuz this movie is disgustful.",
            "review_date": "2022-07-01",
            "lang": "en"
        },
        {
            "review_title": "Not worth the time",
            "content": "I adored the old spy kid movies and really looked forward to this one but the out of the box concept and the repeated irking TIME jokes, especially by the main villain, just lost the focus and the essence of the movie. Also the fact that the scenes just blared out the movie without proper direction and flow caused, at least me, to get annoyed and a bit perplexed within the first few minutes. It would have been better for the franchise if they had left it at the 3rd part or made kind of a spin off or something with some kind of side mission of Juni.Sorry if I was too harsh but i just watched this movie and wanted to convey my point of view to somebody.",
            "review_date": "2011-11-08",
            "lang": "en"
        },
        {
            "review_title": "Slows down your brain function, thats how bad it is!",
            "content": "I went to the cinemas, and i had to choose between 2 movies \"Frgiht Night\" and Spy Kids 4, and i made the worst choice of my life and perhaps the worst choice of humanity, i chose Spy Kids :( I regretted my decision but as soon as i walked in, thought maybe well, you know Jessica Alba's innit its probably gonna be funny, i mean why would such a known actor do a lame and stupid movie, with fart-jokes filled in it like my head was filled with self-humiliation when i watched it? But sadly she did it :'( About 40 minutes into the movie and i was literally lost, there was no direction, no story line and really lame jokes. It couldn't get any worse, before that British-talking dog started talking, i was literally about to cry. The theatre was such a dead place, even the kids weren't laughing. Hell, me and my friend started playing Fruit Ninja, on our phones. I could feel that i am going dumb. I, to be honest, lost my sense of humour after watching it and this will always stay with me. I used to think about things in a different way, but sure as hell, not after watching this. The only scene, where i forced myself to laugh was well... i don't even remember, it was something like going along with the crowd and feeling weird after about 3 seconds of awkward laughter. I wouldn't watch this movie EVER again, even if was as the cost of my life!",
            "review_date": "2011-10-05",
            "lang": "en"
        },
        {
            "review_title": "10 years later",
            "content": "Okay, so I am rating this movie 10 years after its release. Perhaps because I watched it again simply because I enjoyed it so much during its original release.I took my then 6 year old grandson to see this when it first hit the local theater. Unfamiliar with the Spy Kids series, I wasn't sure what to expect. But the concept of a movie in 4-D movie seemed too good to pass on.What an incredible story line. Although I was there for my grandson, I was drawn in by the bizarre story line. The writer has an incredible imagination. I had never seen anything like this.Of course I had to watch the first three Spy Kids movies to better understand the characters, which made me appreciate SK4 that much more.I don't understand all the low viewer reviews. Do they not understand this is a kids movie? Not sure what they expect.",
            "review_date": "2021-07-19",
            "lang": "en"
        },
        {
            "review_title": "Not expected",
            "content": "As a 19 year old girl, growing up with spy kids 1, 2 & 3 was one of the best things about being a child, believing in the movie and the characters, the hidden truths that it lead to, but seeing spy kids 4D was absolutely devastating, not to mention such a let down. To have an amazing sequel of movies with the same characters over time such as harry potter and then saying for the last film, you know time for a change let's put in different characters, destroys the movies before. Spy kids 1, 2 & 3 were great movies for all kids, adults, and families to enjoy, but spy kids 4 was nothing, had poor comedy, not much of a story line, a spy mum, new characters, was a waste of time and money. The movie felt about 10 minutes long and not planned just put together. A talking dog.. well adleast he was British still didn't make the matters any worse. Despite juni and carmen being older now, if they still managed to be in it why not base it around them again and still have the ending with new kids spy kids unit.There were a few positives such as having the original characters appear also there were some great quotes towards the end about family, which stood out, but with the use of the actual film, the quotes weren't recognized for what they were.Hopefully if there is a spy kids 5, there is more effort put in, but it won't ever be the same now, especially knowing what happens, spy kids is officially done.Unfortunetely the movie was awful, and despite wanting to rate it more it was about a 1 out of 10, when compared to spy kids 1, 2 & 3.",
            "review_date": "2011-09-27",
            "lang": "en"
        },
        {
            "review_title": "Probably the worst film I've seen in recent times.",
            "content": "I know it's for kids, but really.Someone stumped up with $27 million dollars to make this load of rubbish, and some half decent actors actually saw the script and agreed to participate. I can't believe it.",
            "review_date": "2021-07-29",
            "lang": "en"
        }
    ]
}