{
    "title": "Apollo 13",
    "rating": 8.0,
    "release_date": "1995-06-30",
    "genre": [
        "Adventure",
        "Drama",
        "History"
    ],
    "summary": "Stranded 205,000 miles from Earth in a crippled spacecraft, astronauts Jim Lovell (Hanks), Fred Haise (Paxton) and Jack Swigert (Bacon) fight a desperate battle to survive. Meanwhile, at Mission Control, astronaut Ken Mattingle (Sinise), flight director Gene Kranz (Harris) and a heroic ground crew race against time -- and the odds -- toStranded 205,000 miles from Earth in a crippled spacecraft, astronauts Jim Lovell (Hanks), Fred Haise (Paxton) and Jack Swigert (Bacon) fight a desperate battle to survive. Meanwhile, at Mission Control, astronaut Ken Mattingle (Sinise), flight director Gene Kranz (Harris) and a heroic ground crew race against time -- and the odds -- to bring them home. [Universal]… Expand",
    "critic_reviews": [
        "\"The Right Stuff\" will endure as the more ambitious movie, but this book-faithful, 2-hour team effort shrewdly keeps its eye on the ball.",
        "Perhaps the most impressive feat of this film is sustaining white-knuckle tension even though the chain of events is well-known.",
        "Ron Howard's film of this mission is directed with a single-mindedness and attention to detail that makes it riveting.",
        "With no frills and no commentary, Howard and company have made the kind of absorbing thriller we have in mind when we wistfully sigh, \"They don't make movies like they used to.\"",
        "By sticking resolutely to the facts of the most amazing rescue mission of all time, the movie builds tremendous suspense, even though most people will know how it came out.",
        "Howard lays off the manipulation to tell the true story of the near-fatal 1970 Apollo 13 mission in painstaking and lively detail. It's easily Howard's best film.",
        "Apollo 13 is humanized by Hanks's reassuring portrait in courage, by Harris's nicotine-stained fingers and Quinlan's lacquered French twist.",
        "The direction may not be flashy, but it is controlled and confident; the frames unfold with a no-nonsense, nuts-and-bolts realism that, in this era of laser-blazing Batplanes, seems downright welcome.",
        "The film, despite its raggedness, is stirring. In the end, this failed mission seems like the most impressive achievement of the entire space program: a triumph not of planning but of inspired improvisation.",
        "It's a riveting, nail-biting, two-buckets-of-popcorn return to form for Howard.",
        "Tom Hanks, Bill Paxton, and Kevin Bacon try to get inside the skins of these space-age pilot jocks, but the roles, as written, don't give them enough to work with.",
        "It's exceedingly linear structure, while unavoidable, renders it rather methodical and shallow in characterization.",
        "Curiously empty and instantly forgettable.",
        "The lean and efficient screenplay, based on the book \"Lost Moon,\" by Lovell and Jeffrey Kluger, is full of the terse poetry and dry humor of people in crisis.",
        "Self-conscious about its heroism with portrayals that lean toward the glib and the professionally uplifting, the film milks our sympathies too readily to be emotionally convincing.",
        "This meticulous but ultimately rather pedestrian drama gradually won me over as a minor if watchable example of the \"victory through defeat\" brand of military heroism that John Ford specialized in.",
        "I just wish that \"Apollo 13\" worked better as a movie, and that Howard's threshold for corn, mush and twinkly sentiment weren't so darn wide.",
        "Howard spins the story with enough gusto and gumption to make it reasonably entertaining."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Ron Howard's \"Apollo 13\" may be boring as hell with some cheesy moments, but the realistic direction and the powerful lead by Tom Hanks makes this space movie a movie you must watch.",
            "review_date": "2011-09-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Based on a very dramatic event that got the globe coming together at the time praying that the astronauts would be okay, Apollo 13's realistic story and strong performances made it not-better-but-as-good-as the real event. Apollo 13 wasBased on a very dramatic event that got the globe coming together at the time praying that the astronauts would be okay, Apollo 13's realistic story and strong performances made it not-better-but-as-good-as the real event. Apollo 13 was supposed to be the third shuttle to land on the moon but an oxygen tank exploded and the astronauts found themselves in a real situation. Going through hell to get back to Earth, the guys finally made it and the world was happy. An interesting story but very simple. Thanks to writers William Broyles Jr. and Al Reinert, the story became a complex challenge of life or death situation. Also helped by strong performances particularly from Ed Harris and Kathleen Quinlan, Apollo 13 became an instant classic when it came out in 1994.",
            "review_date": "2010-12-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A cast of remarkable actors do some of their absolute best in a story well crafted by the directorial expertise of Ron Howard. \"Apollo 13\" is a solid, rousing, and beautiful historical drama.",
            "review_date": "2012-11-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I did not like the movie one bit. First of all, most of the time it is just too obvious that this is a movie, the set looks way too artificial. Fake. Then, all the acting is too forced. Forced cool, forced dramatic, forced heavy, it is justI did not like the movie one bit. First of all, most of the time it is just too obvious that this is a movie, the set looks way too artificial. Fake. Then, all the acting is too forced. Forced cool, forced dramatic, forced heavy, it is just too easy to see that these are actors acting. It is just never convincing. If every look, every word, and every movement wants to forcefully convey significance, everything becomes just too much. That is what happened with this movie. Together with the ever dramatic soundtrack, it becomes unbearable to watch. In addition, how close is this to the truth, that two of the crew members so obviously do not trust the third crew member ?\rIn all, there is no drama because every second is dramatic. No change in pace, no change in intensity. One you want to walk out of after 10 minutes.Quite a shame with that incredible cast.",
            "review_date": "2010-12-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was watching this on my laptop, and about an hour in I accidentally closed the tab. I didn't bother re-opening it and continue watching. It is a very well made movie, with great direction. But I ended up not caring at all about the 3 leads,I was watching this on my laptop, and about an hour in I accidentally closed the tab. I didn't bother re-opening it and continue watching. It is a very well made movie, with great direction. But I ended up not caring at all about the 3 leads, in due to how boring this film is. i can handle boring, so long as I care about the characters. But I really didn't. The film does nothing to establish what these men are like. To us they are just random people who are in a space shuttle, and we don't care if they live or die.",
            "review_date": "2013-08-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Okay, I'm old; I was in college when this happened and I remember TYs set up around campus so we could keep up on the latest developments.  But this movie goes in depth to show how it affected the people involved, not just the 3 astronauts,Okay, I'm old; I was in college when this happened and I remember TYs set up around campus so we could keep up on the latest developments.  But this movie goes in depth to show how it affected the people involved, not just the 3 astronauts, but their families and the ground crew trying to bring them back.  You talk about making tough decisions where it's life and death.  This included having the whole world watching.  That's pressure.  Who knew what the controllers and engineers at the Manned Flight Center were doing?  I don't have many DVDs but this one is in my collection.",
            "review_date": "2015-11-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I personally think that Apollo 13 is the best movie ever made, the combination of drama and historical accuracy really brings to light what happened in the vast empty of space all those years ago.",
            "review_date": "2018-04-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nago Apollo 13 is one of my fav movies of all time so Apollo 13 is about Jim love gets to go on apollo 13 but last minute one of his crew members gets the measles but he still wants to do the mission so he did it with a backup crew member named Jack right when everything is going plan they launch they are doing everything correctly but then Jack stirs the tanks and that is when stuff goes down so Apollo 13 is one of my fav movies because I really like space movies that include first man and apollo 18 I have never seen ad Astra or installer I definitely will tho so yeah this movie is great the filmmaking is great the actors are great also u like everything what is going on the score is great also I believe that this movie made tom hanks career this movie is so great and his performance wow unbelievable when I first watched this movie I did not notice that Kevin Bacon was in this which is nuts this movie has great mommens it has sad moments it has intense moments like there luck is so bad they have trouble with the heat shield of course the fuel tanks and co2 also but they still live So allround a great movie with great story telling great cast great filmmaking so I give Apollo 13 an A",
            "review_date": "2021-02-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of my all-time favorite movies. Saw it in the theater with my then elementary school aged children; bought it when it first came out on VHS, and now own the DVD version. It's a wonderful, fact-based story that inspires by This is one of my all-time favorite movies. Saw it in the theater with my then elementary school aged children; bought it when it first came out on VHS, and now own the DVD version. It's a wonderful, fact-based story that inspires by its focus on courage, perseverance, and teamwork. Have really enjoyed the DVD special features that include commentary by Jim and Marilyn Lovell.",
            "review_date": "2006-05-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great acting, directing, dialogue.  Very intense with the Apollo disaster and astronauts, interesting family problems and politics.  A little slow at times but that really does not effect how good the movie is overall.",
            "review_date": "2011-03-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A reasonably good space film with good acting and music though takes a while to get going.",
            "review_date": "2019-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great acting performances. Tom Hanks, Bill Paxton, and Kevin Bacon were incredible. It's epic length must be considered. Although acted very well, it was boring at some times. Overall, I give it an 8. If it was cut down maybe to 120 minutes IGreat acting performances. Tom Hanks, Bill Paxton, and Kevin Bacon were incredible. It's epic length must be considered. Although acted very well, it was boring at some times. Overall, I give it an 8. If it was cut down maybe to 120 minutes I might give it a 9. It's length is probably why I certainly agree with their choice of Braveheart as Best Picture winner.",
            "review_date": "2011-11-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic acting in a fantastic movie. This is one of Tom Hank's best films and is one of my personal favorites. The movie can get boring at times but overall its realistic, interesting, and well done.",
            "review_date": "2012-08-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great acting as always from Tom Hanks, as well as good supporting turns from Bill Paxton, Kevin Bacon, and Ed Harris, as Apollo 13 manages to capture the suspense, excitement, and potential tragedy, that is packed into this true story. TheGreat acting as always from Tom Hanks, as well as good supporting turns from Bill Paxton, Kevin Bacon, and Ed Harris, as Apollo 13 manages to capture the suspense, excitement, and potential tragedy, that is packed into this true story. The film is certainly slow at points, but for me, throughout, I was very intrigued by the film. From when they were preparing to when things start going wrong to the end, I was hooked. The film is never great, so to speak, but it was still very good and, while it needed no help in doing so, did a great job creating suspense when things went wrong, as well as sympathy for the families of the men aboard. The suspense is constant and really leaves you on the edge of your seat as you see the inner workings of the ordeal and it almost leaves you in tears as you watch their families deal with the ordeal back at home. Overall, a very enjoyable film that is not great, but is still very good.",
            "review_date": "2014-04-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best movies I have ever seen. Wonderfully acted with a powerful story. Even though you know the ending, it still has you on the edge of your seat.",
            "review_date": "2012-12-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's definitely a movie you should watch on the fourth of July, to get a better emotional kick. Ron Howard does a great job making this film seem as real as the actual Apollo 13. It has suspense, tension, and relief even though everyoneIt's definitely a movie you should watch on the fourth of July, to get a better emotional kick. Ron Howard does a great job making this film seem as real as the actual Apollo 13. It has suspense, tension, and relief even though everyone already knows how the story ends, and that takes plain good filmmaking. It's for sure to have people cheering 'USA' on the inside.",
            "review_date": "2019-03-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The most astonishing thing about this movie is that it really happened! You can experience a precarious travel. It's sometimes a bit booring, but I can't complain about sth. else.",
            "review_date": "2014-03-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "from director Ron Howard ( Rush , DaVinci Code and the producer of Changeling ) which DaVinci code was good movie also as the over rated Changeling was good as well  . Anyway the movie stars tom hanks as a space astronaut which sounds goodfrom director Ron Howard ( Rush , DaVinci Code and the producer of Changeling ) which DaVinci code was good movie also as the over rated Changeling was good as well  . Anyway the movie stars tom hanks as a space astronaut which sounds good and is awesome for  the Acamedy Award Winner as his performance was sort of out breaking also tempting , danger thrill in space but it was cool in 3d great directing from Ron Howard . Grade A",
            "review_date": "2014-09-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Apollo 13 is a riveting experience about reaching to the edge of a dream and backing off for family. Extraordinary performances and score. If you are anyone who is anyone you have to see Apollo 13.",
            "review_date": "2014-08-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Dramatically stunning, and at times at the profound level, Apollo 13 is a magnificent retelling of the doomed Apollo space mission. It succeeds in fleshing out the heroism and determination in what is the quintessential modern story ofDramatically stunning, and at times at the profound level, Apollo 13 is a magnificent retelling of the doomed Apollo space mission. It succeeds in fleshing out the heroism and determination in what is the quintessential modern story of mankind's greatest adventure and victory over adversity.",
            "review_date": "2015-03-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I just saw this film for the 1st time in a long time and I forgot how great it was. You really saw the terror in everyone's eyes and their emotions. It actually is one of the only movies that gets me choked up because I recognized the braveryI just saw this film for the 1st time in a long time and I forgot how great it was. You really saw the terror in everyone's eyes and their emotions. It actually is one of the only movies that gets me choked up because I recognized the bravery the actual astronauts had to go through. Simply amazing. 9/10",
            "review_date": "2015-07-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is a pretty intense movie with a lot of thrills with the Space ship potentially killing everyone. But also It had some parts like the mess els guy being accidentally put on the ship and the loss of the wedding ring in the shower were just stupid.",
            "review_date": "2017-05-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Lovable and enjoyable, Apollo 13 will keep all your eyes on the movie while grabbing popcorn and a seat. Come join the excitement Apollo 13 has got for you!",
            "review_date": "2016-02-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Apollo 13 - In my opinion, one of the best sci fi films ever made. The intense scenes and great acting all make the 2 hours of film worth it to watch. Though it may get a tad boring and confusing at times, it still is a great piece of artApollo 13 - In my opinion, one of the best sci fi films ever made. The intense scenes and great acting all make the 2 hours of film worth it to watch. Though it may get a tad boring and confusing at times, it still is a great piece of art from Ron Howard. I recommend this film. 10/10",
            "review_date": "2016-02-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Apollo 13 is a truly masterpiece, because of it's cool mix of true history, serious work, suspense, gorgeous interpretation, intelligent direction and great story-telling. This fantastic film could become some kind of boring for the futureApollo 13 is a truly masterpiece, because of it's cool mix of true history, serious work, suspense, gorgeous interpretation, intelligent direction and great story-telling. This fantastic film could become some kind of boring for the future audiences (and it is now), but it's not them fault. And that's why this film is the best of 1995.",
            "review_date": "2016-05-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If Bob Dole and other industry critics want to continue attacking Hollywood, they’d better not see “Apollo 13.” With its rah-rah, gung-ho, can-do attitude and cast full of good-looking young white men in buzz cuts, this engrossing account ofIf Bob Dole and other industry critics want to continue attacking Hollywood, they’d better not see “Apollo 13.” With its rah-rah, gung-ho, can-do attitude and cast full of good-looking young white men in buzz cuts, this engrossing account of the nation’s most perilous moon shot embodies what many people consider to be old-fashioned American virtues in a virtually pristine state. Sufficiently suspenseful despite its historically preordained happy ending,slightly overlong real-life thriller will appeal to mainstream audiences across the boards and land a commercial bull’s-eye for Universal.\r Scarcely embellishing the story of how three astronauts barely avoided becoming the first Americans to die in outer space, director Ron Howard and his team walk a narrative line that’s almost as narrow as the course of the mission itself. Pic’s exceedingly linear structure, while unavoidable, renders it rather methodical and shallow in characterization. There is also something of the sense of the film as a live-action storyboard, so highly developed is its sense of organization and calculated effect.\r Nevertheless, the film works in a primal way as the story of three brave explorers who manage to find a way home in the face of hazardous obstacles and heavy odds. The verisimilitude with which the mission has been visualized is impressive, and the positive, virtuous, “failure-is-not-an-option” posture of the characters has been adopted winningly by the entire cast and crew.\r Placing the opening scenes in a family context manages the twin feats of conveying some needed exposition and establishing the film’s wholesome credentials. A bunch of NASA personnel and their kin assemble to watch the dramatic moment on July 20, 1969, when Neil Armstrong became the first man to walk on the moon. The host, family man Jim Lovell (Tom Hanks), was aboard Apollo 8 when it passed just 60 nautical miles above the moon, and he’s only got to wait nine more months to get his chance to become the fifth man to set foot on the lunar surface.\r As the April 11, 1970, launch date approaches, command module pilot Ken Mattingly (Gary Sinise) is exposed to measles and has to be replaced by swinging bachelor Jack Swigert (Kevin Bacon). But by the time they and lunar module pilot Fred Haise (Bill Paxton) blast off on their 600,000-mile trip, the public has come to regard moon missions as almost routine and worthy of only passing interest.\r Two-and-a-half days later, and 50 minutes into the picture, this attitude abruptly changes. During a routine “stirring” of the oxygen supply, an oxygen tank explodes, which quickly leads to three significant problems for the crew: a dissipating oxygen supply, reduced power on board and a filtering system on the blink, leaving the men susceptible to carbon dioxide poisoning.\r Through this critical portion of the six-day mission, events in Houston prove considerably more dramatic than goings-on in space, where the men shiver and await the fateful moment when they must attempt re-entry. A number of nicely individualized scientists and nerdy computer geniuses argue the merits of different courses of action, with Kranz making the ultimate decisions through a sort of consensus by decree. While chain-smoking flight director Gene Kranz (Ed Harris) overseas the rescue operation,  some of the key contributions are made by Mattingly.\r Physically, “Apollo 13” pulls off some stunners, notably the giant rocket launch, the separation of the boosters as the spaceship soars away from Earth, the views of the moon and scenes of weightlessness that were filmed aboard a high-flying Air Force plane that afforded the actors brief moments of zero gravity. Kudos to the special effects hands at Digital Domain, production designer Michael Corenblith, costume designer Rita Ryack and the army of technicians on board for an outstanding display of authenticity. Dean Cundey’s lensing works to seamlessly blend f/x work with normal scenes, but look of the images leans toward the grainy and soft.\r Casting Hanks as Lovell gives the film a human center, someone with whom the audience can easily feel at home, but his dramatic opportunities are more limited here than of late. His most powerful scene has him calming down his two partners when their dilemma threatens to get the better of them late in the journey.\r Bacon brings a colorful cockiness to the one “Top Gun”-style flyer in the bunch, while Paxton is obliged to suffer quietly with a high fever during much of the journey. Harris’ coiled tension provides a strong focus of attention in the control room, and Kathleen Quinlan gives depth of feeling and understanding to the necessarily compartmentalized role of Lovell’s omen-fearing wife.\r “Apollo 13” will inevitably be compared to the only previous large-scale film about the U.S. space program, 1983’s “The Right Stuff.”  New effort is much more succinct and conventional in its aims and will no doubt play more successfully with the public.",
            "review_date": "2016-03-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The film fulfills in accurately and truthfully reproducing the events of a lunar mission that went wrong and became a race against time to bring astronauts home and alive. The actors also fulfill their task; but it feels that it is due toThe film fulfills in accurately and truthfully reproducing the events of a lunar mission that went wrong and became a race against time to bring astronauts home and alive. The actors also fulfill their task; but it feels that it is due to generate suspense.",
            "review_date": "2020-06-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "was it the door..Apollo 13\n\nIt takes too much of the time to set the plots and the characters (almost the first hour is spent on it) but when it hits, it hits hard and fast with gripping screenplay that keeps the audience engaged until thewas it the door..Apollo 13It takes too much of the time to set the plots and the characters (almost the first hour is spent on it) but when it hits, it hits hard and fast with gripping screenplay that keeps the audience engaged until the curtain drops (its second act is thrilling). Ron Howard makes it look like easy and effortless through his brilliant execution skills but unfortunately isn't supported well enough on the editing department. Tom Hanks leads the way with another stellar performance from his side and is supported by a great cast like Ed Harris and Kevin Bacon. Apollo 13 isn't as important or nail biting as the makers think but it surely is witty and thought provoking that was just piled upon by the undercooked emotions like it was essential to install.",
            "review_date": "2018-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie tells the story of the Apollo 13 mission, one of the most famous missions to the Moon, not because of it's success but because it almost became a disaster.The script is based on actual facts and could be somewhat boring for thoseThis movie tells the story of the Apollo 13 mission, one of the most famous missions to the Moon, not because of it's success but because it almost became a disaster.The script is based on actual facts and could be somewhat boring for those who don't know the theme but, since everything was barbarously simplified, anyone understands it quickly. Unfortunately, this effort to synthesize and simplify has made the plot unrealistic, predictable and forced, especially if we take into account the jokes around number 13 and other minor situations like that. The plot gives great attention to how the astronauts was prepared and chosen, as well as how NASA sweated to bring them back. In this field, the film is engaging and leaves the audience stuck to the screen. Another issue that it tackles, in obvious criticism, is the initial lack of interest from the media in that mission, but this is ancillary. The film has some special effects but they're not attractive or stunning except for scenes in zero gravity. Personally, I didn't have any problem with that, I think it leaves more room for drama.As for actors we need to consider the following: the cast is full of stars (Tom Hanks, Bill Paxton, Kevin Bacon, Gary Sinise, Ed Harris...) but the film definitely doesn't know what to do with them. Hanks is the protagonist but is misused and spends more than half the film's length wishing for the Moon and trying to control his flight colleagues. Ed Harris, in a supporting character, shines almost as much as him and holds the final half of the movie in an excellent performance, but within the standards the actor has accustomed us to. The rest of the cast does not shine and there are several supporting actors who end up being demoted to extras with lines.In conclusion: it's a satisfactory movie but its far from being really good. The blend of a strong cast, a script reduced to the basic and an uninspired direction is as inefficient as a Ferrari engine in a Beetle.",
            "review_date": "2018-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Apollo 13 is a dramatization of the incredible true story of three astronaut-actors who were stranded in a sound stage on a Universal Studios lot when a gaffer absent-mindedly locked them in for the night. Well acted. Highly recommended.",
            "review_date": "2018-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Such a classic, awesome movie.  This is just one of those movie that when you are flipping through the tv and find it on you just have to stop and watch it.  It never gets old.",
            "review_date": "2018-11-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Movies about historic events are always pretty interesting in itself, and Apollo 13 is no exception. The astronauts have to overcome situations no human on Earth has had to deal with, and the movie shows this in great detail. That's a treatMovies about historic events are always pretty interesting in itself, and Apollo 13 is no exception. The astronauts have to overcome situations no human on Earth has had to deal with, and the movie shows this in great detail. That's a treat to see.The acting is well done, especially by Ed Harris playing Gene. He's shows leadership, a positive and calm attitude and probably saved the astronauts with those qualities. The scenes with control and the shuttle are very entertaining.However... the scenes with THE WIFE are extremely annoying. Besides the fact that Jim Lovel's wife in this movie has the worst haircut i've seen in a long time, she interupts the interesting scenes repeatedly with staring at radio's and tv's. We get it, you are worried about your husband... but that should not have been shown this much. And that also goes for that particular school kid who looks like he's trying to catch flies with his open mouth.By the end of the movie you'll feel like it would have been a better movie without the harrasing of the wife scenes, but it does keep you on the edge of your seat. I give this movie an 8/10, it is an excellent movie.",
            "review_date": "2018-11-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The mission control scenes are some of the best in any movie about space travel. It amazingly captures the preasure everyone was on, and how instensely they had to work to figure out how to get the astronauts back home.",
            "review_date": "2020-09-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Houston, we have a problem,\" meaning in this case we don't have a problem. Apollo 13, a film that describes a real event. Despite the fact that you know how the plot will turn out, the film keeps you in constant suspense. The star cast of\"Houston, we have a problem,\" meaning in this case we don't have a problem. Apollo 13, a film that describes a real event. Despite the fact that you know how the plot will turn out, the film keeps you in constant suspense. The star cast of the film, led by Tom Hanks, seems to be a big plus.With a pinch of exaggeration, this film can be considered an ageless classic that not only spaceflight enthusiasts must love. 8/10",
            "review_date": "2022-01-11",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 53
}