{
    "rating": 9.3,
    "release_date": "1953-07-01",
    "num_reviews": 150,
    "genres": [
        "English"
    ],
    "summary": "One night in 1944 in a German POW camp housing American airmen, two prisoners try to escape the compound and are quickly discovered and shot dead. Among the remaining men, suspicion grows that one of their own is a spy for the Germans. All eyes fall on Sgt. Sefton (William Holden) who everybody knows frequently makes exchanges with German guards for small luxuries. To protect himself from a mob of his enraged fellow inmates, Sgt. Sefton resolves to find the true traitor within their midst.",
    "reviews": [
        {
            "content": "\"If I ever run into any of you bums on the street corner, let's just pretend we've never met before.\"\n\nWilliam Holden stars as cigar-gnashing 'general store' operator J.J. Sefton, whose crude attitude and stiff prices make him persona non grata in his barracks. When everyone in the bunks suspects a rat is hiding among them, leaking information about escaping POWs and clandestine equipment, the eyes naturally turn to Sefton; to stop good men from going to their deaths (or perhaps to prevent more bruises from appearing on his face), Sefton takes it upon himself to find the real spy among them. An early war thriller with elements of black comedy, Stalag 17 is somewhere between The Great Escape and M*A*S*H, and spends even more time building up the camaraderie between its characters than it does developing the main plot, with surprisingly ample opportunity for director Billy Wilder to use the same crossdressing humor that he would refine in Some Like it Hot a few years later. But despite the mixing of war film and comedy, Stalag 17 never feels jagged, as he constantly uses levity to allow his prisoners a brief escape from their dark reality. As a result, it's funny and exciting without being disrespectful to what was still a fresh memory for many veterans. \n\nAnother great one from one of the best midcentury American directors. Wonder if Robert Strauss ever got his date with Betty Grable. (4/5)",
            "review_date": "2023-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having watched Hogans heroes for many years this movie always comes to mind, the show uses footage from the show in the first season and owes a lot to the basic set up and character of Stalag 17.\n\nWilliam Holden is excellent in role, Peter graves is as well a wonderful counterpoint and best performance prioir to mission impossible.\n\nMy main criticism is the voice over but I've never been a fan of voice over.",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A few awkward moments—minor things that gave a lightness on stage seem just a bit forced in the film—but minor they are. And with solid performances (especially the ones from Holden and a youthful Peter Graves), adept direction and an amusing screenplay, \"Stalag 17\" is exemplary in its representation of WWII films of the post-war period. It's climactic ending gives satisfies our American desires for optimism and justice.",
            "review_date": "2022-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic war film. For a POW camp film the quality lies in the plot and characters rather than the escape. A great script keeps you hooked. Hasn't aged at all.",
            "review_date": "2022-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunned by how much I hated this. The slapstick comedy was the total opposite of what I expected, it bashes you over the head with very unsubtle, dire humour, lots of shouting and pretty childish jokes/pranks, usually accompanied by an unbearable shriek or irritating voices. Couldn't bring myself to care about the fate of any of the characters because I legitimately wanted the officers to kill them, especially Animal. Absolutely love Billy Wilder usually but this was unbearable.",
            "review_date": "2022-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A near masterpiece with William Holden bringing some gravitas to Billy Wilder's comedic drama. A great story that spawned hundreds of comedy sketches over the next few decades.",
            "review_date": "2022-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Billy Wilder might be my favorite director ever. Holden holds the tension in his character so well its unbelievable. Moving subject material with very funny scenes. Go watch.",
            "review_date": "2021-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised at the amount, and level, of comedy I found in a suspenseful film taking place almost entirely within the wires of a German ran POW camp. I have never seen the play so can make no comparisons but Wilder impresses per usual with his ability to craft a script full of engaging suspense woven with dark humor found in the sharp dialogue and scenes of situational comedy.\n\nHolden was excellent as the lead but this film featured many colorful performances from both the captured and the captors, that the entire supporting cast deserves credit as this really felt like a \"whole is greater than the sum of the parts\" situation.",
            "review_date": "2021-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good. Great blend of comedy and suspense.",
            "review_date": "2021-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stalag 17 is a one of a kind movie that describes a U.S. POW soldier and their imprisonment in a German prison camp. I love the performances, direction, screenplay and set designs. Overall, Stalag 17 is an awesome war film that still manages to find success in today's world.",
            "review_date": "2021-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Offensive in so many ways. The comedy is reminiscent of Allo Allo or Abbott & Costello (I.e rubbish), and the drama seems so totally out of place amongst the slapstick that it just lacks any potency. Noisy and offensive acting and a childish stereotyping of the Germans means you can't take this seriously on any level. Maybe it rang true as comic relief when it was made in the early 50s but it is an uncomfortable watch in the 2020s.",
            "review_date": "2020-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This fantastic adaptation is a must see for its performances.",
            "review_date": "2020-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At first it felt a little strange to watch a comedy about a World War II German POW camp. But then I got caught up in the story and interested in the characters and really began to enjoy this movie. Stalag 17 is an odd mix of silly humor and dramatic situations, but it finds a balance that is pleasing without feeling disrespectful. I'd never heard of this movie before my father recommended it, but I'm glad I watched it.",
            "review_date": "2020-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just saw this movie for the first time. I was surprised that it is still worth watching while it is almost 70 years old now. This movie is still exiting and compelling and does not bore for even one minute even while the whole movie takes place in a german prison camp. Great performances of the entire cast, and especially from William Holden. At the other hand, I have never been disappointed by a Billy Wilder movie.",
            "review_date": "2020-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty corny overall, esp. the so-called comedy. Hasn't aged well, but yeah, Holden is solid. A young Peter Graves is good as well. But all the German characters are hack jobs.",
            "review_date": "2020-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, the setup to the movie and all the shots are amazing. I'm hooked. I love how they all stepped forward to back Animal up for throwing the Ocarina at the Commandant's feet. Watching the chubby German guard get all giddy while playing volleyball was hilarious. Animal and Harry are the power duo. Like Abbott and Costello. They're really funny. \n\nQuite an entrepreneur this Sefton guy was. Running little horse races with mice, opening up his own distillery and even letting the boys have a little peep show so they could check out the women on the other side. One of the more interesting things in the movie that kept me attentive was wondering who it was that was giving information to the Krauts. \n\nThat scene with all the boys making fun of Hitler was priceless. I'm glad that they we're making films that parodied Hitler back then. Interesting how the Commandant puts his boots on for the call to his chief just so his chief knows that he's still in full uniform. That was a nice little piece of detail. Holy shit! I was not expecting the informant to be who it ended up being. That was some brilliant casting for that role. You would have never expected it to be him since he seems to be part of the boys and he kind keeps to himself. But thinking back, his restraint on talking a lot makes more sense now. The informer plays the game really nicely, has a great poker face. Terrific ending. \n\nLike I've said with every Billy Wilder movie - his way of taking a serious topic and making it lighthearted and funny is one of the most impressive things I've ever seen. Charming to a fault, you really get to see just how Wilder's view on the world and life is like. Clever and witty like all of Wilder's movies but this one is definitely special to me. \n\nI definitely have to own this one. It was that good.",
            "review_date": "2020-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yesterday I finally saw STALAG 17, Billy Wilder's 1953 Classic that set the stage for MASH, HOGAN'S HEROES and countless other war satires. William Holden only took the Sefton role under orders from the studio, and did not feel comfortable accepting the Oscar for the part. And there's no question the award was an apology for SUNSET BLVD. The script gives depth to even minor characters, right down to Tommy Cook's mailman, while Franz Waxman's uncredited score is a clinic on minimalism. As I watched this, I realized I last saw this as a pre-teen and it was one of my late Dad's favorite films. More relevant than when it was filmed. Classic and Essential.",
            "review_date": "2019-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sarcasm, satire and not so subtle messages about war, loyalty and survival wrapped in a ground breaking dramedy. ",
            "review_date": "2019-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stalag 17 definitely lost its steam in the much less interesting second half, but the first one was excellent and quite entertaining. The movie is at its best when it's funny and it wildly succeeds as a very amusing, sophisticated black comedy with quirky characters, fun situations and a knack to make even the worst circumstances humorous. The characterization is mostly excellent and Billy Wilder's direction is reliably terrific.",
            "review_date": "2019-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best films I have ever seen",
            "review_date": "2019-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seemed like a POW farce.  It made the Nazi into imbeciles.",
            "review_date": "2019-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true classic. While the slapstick is laid on pretty thick at times, the ensuing drama and tension plays out extremely well, culminating with a truly satisfying ending. William Holden plays his role superbly and the Oscar he was awarded for his performance was truly earned. One of the better and more unique war flicks worth seeing.",
            "review_date": "2018-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can see why William Holden won an Academy Award for his performance. He doesn't seem like he's playing a part at all, but that he is his character. The script is great, the suspense is great, and every action in the film serves a purpose. There is a lot of good humor in this film, and also it touches on why jumping to conclusions can lead to big mistakes. Stalag 17 sits well in the company of all other POW films, and it's a great WWII period piece as well. Billy Wilder is a master of cinema.",
            "review_date": "2018-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most memorable movies of all time.... ",
            "review_date": "2018-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stalag 17 is a movie that definitely has some tonal shifts in it. At times it is very lighthearted almost like a Hogan\u0092s Heroes type of humor. The different personalities of the POWs makes for some good chuckles when that\u0092s what they\u0092re attempting. However, there are other times when the mood of the film transitions and things get more serious. This is a German POW camp during WWII, so it makes sense that there would be some heavy stuff going on. The movie created a fairly good mystery about who was the snitch, because we could safely assume as an audience that William Holden wasn\u0092t really the guilty party. I\u0092m still not decided on whether the shifts in tone always work, but it never felt awkward so I just went with it.\n\nThe choice to use a voiceover was not a smart one for a number of reasons. For one, it was a pretty lazy way to set up the story. Also, Cookie wasn\u0092t a significant character and I kept wondering why they chose him as the person presenting this story. Finally, there just wasn\u0092t enough voiceover included. If you\u0092re going to go this route for setting up your story, then there should be more moments where the voice shows up, to transition from one set piece to the next. It\u0092s just one nitpick I had with the movie, there were a few other flaws but I don\u0092t want to seem like I\u0092m trashing this enjoyable film. I had a good time watching Stalag 17. It has some good actors, and they clearly are having an enjoyable time making the movie, which translates into a good time for me too.",
            "review_date": "2017-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wilder's film is a wonderful and poignant love letter to prisoners of war and there prevailing of the awful and horrifying acts befell upon them. Wilder is a master of camera work, his long unbroken takes are a thing of immersive and engaging brilliance.",
            "review_date": "2017-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i am certainly one to agree that die hard is a terrific Christmas holiday time movie\nas is lethal weapon\nmy point here is to add this much older film to the cannon of darkly comic action\nhard core dope movies set in part around xmas holidays\nto the cannon\nenjoy or dont\nlove julesy",
            "review_date": "2016-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd say that this would definitely be my favorite WWII film! I enjoyed every minute of it!",
            "review_date": "2016-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's probably a version of this movie that's an unrelenting pressure cooker but Wilder's trademark wit takes the movie down a more interesting and entertaining path. Holden's performance is perfection.",
            "review_date": "2016-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "William Holden is my favourite actor. He talked in a cynical, clear attitude that was the star of all his films. But he wasn't full of himself, he was aware of his surroundings and people around him, putting everything together and resolving everything with his stance that wins everyone's hearts. \n\nI always thought this would be great for a noir detective: but this film did one better and proven me right. An officer takes the blame of being a rat, but the cold shoulder doesn't affect him, then in a matter of minutes he exposes the real rat and escapes from his POW camp, and all while being a true movie hero! And for that, everyone knew what was capable of and rightly gave him his Academy Award For Best Actor.",
            "review_date": "2016-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WAY better than The Great Escape.",
            "review_date": "2016-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stalag 17 (1953)\nHolden gives one for his finest performances in this edge-of-your-seat POW story that stills packs a wallop. American soldiers devise escape from German prison camp. One for Wilder's best too.",
            "review_date": "2016-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd say that this would definitely be my favorite WWII film! I enjoyed every minute of it!",
            "review_date": "2016-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Billy Wilder shows us for the first time he's not only a master of Drama but also Comedy with ''Stalag 17'' (with many more comedies to come in his career, e.g, Some Like it Hot and The Apartment), a dark, satirical comedy in a backdrop of a POW camp in World War II.\n''Stalag 17'' shines with rich characters beautifully portrayed by known and unknown actors in combination of yet another masterfully written script by Wilder himself",
            "review_date": "2016-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stalag 17 is an incredible film. It is about two escaping American World War II prisoners who are killed and that a German POW camp barracks black marketer is suspected of being an informer. William Holden and Otto Preminger give excellent performances. The screenplay is well written. Billy Wilder did a great job directing this movie. I enjoyed watching this motion picture because of the drama. Stalag 17 is a must see.",
            "review_date": "2016-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best war movies of all time!  It is primarily a comedy but with some dramatic undertones woven throughout the film.",
            "review_date": "2015-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is some good period comedy and loads of fun interplay to be had here, but the proceedings are anchored by an outstanding performance from William Holden. Where the film suffers is in its repetitive cuts to the film's comedic relief duo, and a mostly useless narration. The direction and cinematography are also skillful and adept. I wouldn't consider this a must watch for newer audiences, though the film is quite good if not a little long for its simplistic story.",
            "review_date": "2015-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic class act studded with amazing performances.  A POW may not be a fun place to live, but this two hour visit is very enjoyable.",
            "review_date": "2015-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Billy Wilder film I had never seen before.  A P.O.W. comedy, not an easy feet.  Greta script and strong acting.  William Holden got an Oscar for it.   Highly recommended!",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny film with great acting. Of course unrealistic but it doesn't matter in the measures of the theme and genre. Wilder is truly genuis director that made films in different genres and types.",
            "review_date": "2015-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "#241 - Well here's another great little film from the 50's and a great performance from Robert Strauss as Animal. Remember vaguely watching this as a kid and my Dad always referring to the housing around Ardwick, Manchester as Stalag 17 before the ripped it all down. Hahahaha flixter has Michael Moore (Bowling of Columbine starring in the film!!!",
            "review_date": "2015-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best kind of humor is based in humanity...and as inhumane as war can be, it is still filled with humans. Stalag 17 mixes the sober realities of WWII with surprisingly consistent humor like they were two peas in pod because its humor stems from hopelessness, acting as a necessary coping mechanism. A beautifully performed and singularly contained character dramedy that is as timeless as it is old-fashioned.",
            "review_date": "2014-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cinema rarely gets any better than this.",
            "review_date": "2014-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, gritty, and well acted, this well rounded war film does a good job of making you care about the characters on screen and wanting to see what happens next.",
            "review_date": "2014-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nStalag 17 contains a story that could have easily won me over, a tale about an informant living with the American prisoners of war and leaking out their secrets and plans. Stalag 17 explores the life of these prisoners, showing us their physical and emotional problems, which I felt is the most interesting aspect of the film, but sadly the impact of it was dampened by the lightness of Wilder's direction. These are stories and feelings that I personally feel should be handled with a bit more solemnity in order for it to be emotionally impacting. The comedy in this film was too strong for my tastes, as it overwhelmed the film's story and characters; though I did thoroughly enjoyed the Betty Grable gags. Even the film's antagonists, the Germans, don't pose a certain sense of danger; I understand that they aren't the film's primary villain but shouldn't I feel a sense of danger if they do get caught? The prisoners converse with the German guards like as if they were buddies. At least Wilder was able to create the danger in the film's mystery, the informant, not knowing who it actually is and anything they say in the barracks may be leaked out. Though I couldn't let myself get in deep with this film, I was superficially entertained throughout this film, not one moment did I feel like it was getting dull. The film's large moments are the ones that truly shined in this film, particularly the film's end, possessing this sense of excitement and suspense that I haven't seen from Wilder before. Stalag 17 also features a great protagonist, J.J. Sefton, who is an opportunist, doing whatever he can to make his stay in the barracks more comfortable and catered to his liking, equality and brotherhood are at the back of his mind; it is by the end of the film that you would debate in your mind whether or not his intentions were truly virtuous. Stalag 17 may have its issues but they weren't enough to stop me from enjoying this film.",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nStalag 17 contains a story that could have easily won me over, a tale about an informant living with the American prisoners of war and leaking out their secrets and plans. Stalag 17 explores the life of these prisoners, showing us their physical and emotional problems, which I felt is the most interesting aspect of the film, but sadly the impact of it was dampened by the lightness of Wilder's direction. These are stories and feelings that I personally feel should be handled with a bit more solemnity in order for it to be emotionally impacting. The comedy in this film was too strong for my tastes, as it overwhelmed the film's story and characters; though I did thoroughly enjoyed the Betty Grable gags. Even the film's antagonists, the Germans, don't pose a certain sense of danger; I understand that they aren't the film's primary villain but shouldn't I feel a sense of danger if they do get caught? The prisoners converse with the German guards like as if they were buddies. At least Wilder was able to create the danger in the film's mystery, the informant, not knowing who it actually is and anything they say in the barracks may be leaked out. Though I couldn't let myself get in deep with this film, I was superficially entertained throughout this film, not one moment did I feel like it was getting dull. The film's large moments are the ones that truly shined in this film, particularly the film's end, possessing this sense of excitement and suspense that I haven't seen from Wilder before. Stalag 17 also features a great protagonist, J.J. Sefton, who is an opportunist, doing whatever he can to make his stay in the barracks more comfortable and catered to his liking, equality and brotherhood are at the back of his mind; it is by the end of the film that you would debate in your mind whether or not his intentions were truly virtuous. Stalag 17 may have its issues but they weren't enough to stop me from enjoying this film.",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Light comedy about POWs and that's it. Not really sure if it was meant to be anything else but if it was then it has failed dreadfully.",
            "review_date": "2014-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A group of American POWs discovers that there is an informant in their midst.\nKind of a war movie lite, Stalag 17 is more entertaining than moving and more delightful than most war films typically are.  William Holden's characteristic insouciance fits right in, and the rest of the cast basically follows suit.  Once one gives in to the film's tone, it becomes worth watching, even if the reveal comes too early, diffusing most of the potential suspense.\nOverall, this is a strong, entertaining, genre-defying film, but it's not perfect.",
            "review_date": "2014-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie. Very entertaining and enjoyable. Funny, light-hearted, and yet dark.",
            "review_date": "2014-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great performance by the underrated William Holden bolsters this POW film that finds the elusive mix between dark comedy and serious drama.",
            "review_date": "2014-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My dad had a VHS copy sitting in a treasured spot for years, but hating war movies in general, I never dared view it... until now. This is a masterpiece of craft-- screenwriting, casting the ensemble, individual performances, directing... just wow.",
            "review_date": "2014-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic POW film. Holden won an oscar but the entire cast is great.",
            "review_date": "2014-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one classic that has it all: action; suspense; intrigue - even laugh-out-loud comedy. Stalag 17 (the story of a group of American WWII POWs inside Nazi Germany who must ferret out a spy within its ranks) is a thrilling, funny and endlessly entertaining flick that is strongly written, directed and acted. Holden and cast are excellent, with plot twists and genuine yuks-a-plenty. Who's the rat inside Stalag 17? Find out for yourself. As eventual knock-off Schultz of Hogan's Heroes would say: \"I know nothing . . .\"",
            "review_date": "2014-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not really built for war.\n\nIn World War II the Germans have a large POW camp with a mixture of troops from the United States and ally forces.  When every escape attempt is thwarted the troops quickly become suspicious that someone within the camp is tipping off the Germans for favors.  Can the troops identify if they have a threat and who it is?\n\n\"Such nice boys.  It makes me sick to my stomach.\"\n\nBilly Wilder, director of Some Like it Hot, Sunset Blvd, The Apartment, Double Indemnity, Sabrina, The Seven Year Itch, and The Lost Weekend, delivers Stalag 17.  The storyline for this picture is very good and way better than your standard war drama.  The dialogue and characters are very well written and the acting is first rate.  The cast includes William Holden, Peter Graves, Otto Preminger, Robert Strauss, and Neville Brand.\n\n\"Always remember just because the guards are dumb doesn't mean they're stupid.\"\n\nI have become a fan of the eccentric Hollywood actor and director Otto Preminger so I decided to give this movie a shot.  I can tell you this is a very well done picture and is perfectly paced with a nice blend of humor, drama, and action.  This is a worthwhile picture that is definitely worth a viewing and borderline worth adding to your DVD collection. \n\n\"Stalag is the German word for prison camp.\"\n\nGrade: A",
            "review_date": "2014-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holden is great. Lembeck and Strauss had me rooting for the Germans.",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stalag 17 is the story of a group of unheroic American war prisoners spending time in a Nazi prison camp during the Second World War. Based on the Broadway play, Billy Wilder's film is less of an ordinary formulaic escape film and much more an edgy portrayal of American G.I.s as ordinary people whose main goal is keeping their own sanity by keeping themselves entertained with jokes, games and pin ups, and only occasionally and slowly plan an escape. A great screenplay and a great Holden performance, who stars as the cynical and even selfish Sefton.",
            "review_date": "2013-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uneven in tone, and rather too silly for me.",
            "review_date": "2013-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oscar winner Bill Holden, Best Actor. Comparisons to TV series Hogan's Heroes abound in this WWII comic-drama.  Though Stalag 17's writers sued Crosby Productions and lost, they really should have won. The character from Hogan's Heros are too comparable and the many comic sets and stunts are direct copies of Stalag 17.   But others claim not so.\r\n\r\nVeteran \"B\" actors include Neville Brand as Duke, Peter Graves (tv's Lassie, Airplane), Robert Strauss as Animal.\r\n\r\n[img]http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Hogan%27s_Heroes_Title_Card.png/219px-Hogan%27s_Heroes_Title_Card.png[/img]\r\n\r\n\r\n\r\nSEE the entire film yourself and decide, but this film is nowhere near on the level of the best WWII films made, despite Director Billy Wilder making it:\r\n\r\nhttp://www.youtube.com/watch?v=xsrbKSb5pr8\r\n\r\n[img]http://upload.wikimedia.org/wikipedia/en/thumb/a/a5/Stalag_17.jpeg/220px-Stalag_17.jpeg[/img]  William Holden, star Stalag 17\r\n\r\n[img]http://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Bob_Crane_Colonel_Hogan_1969.JPG/180px-Bob_Crane_Colonel_Hogan_1969.JPG[/img]  Bob Crane, star Hogan's Heroes\r\n\r\n\r\nREVIEWS:\r\n\r\n90%\r\n A serio-comic anecdotal screenplay based in a historically accurate setting. Wilder was a non-conformist genius; no wonder at the top of every signifi...\r\n \r\n100%\r\n best black and white film i've ever seen \r\n\r\n[img]https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcRDCn4vpjScW-kzuIG66EwEamZJZ4V8Fw5W0fr9IW_XCit-7-pA[/img]  Legend director Otto Preminger stars as the Commandant Colonel of Stalag 17\r\n\r\n\r\n\r\nNOTES:\r\n\r\n1    Donald Bevan and Edmund Trzcinski, the writers of the 1951 play Stalag 17, a World War II prisoner of war story turned into a 1953 feature film by Paramount Pictures, sued Bing Crosby Productions, the show's producer, for infringement. However, their lawsuit was unsuccessful, as a federal judge found \"striking difference in the dramatic mood of the two works.\"  \r\n\r\n2     In his book, My War, Andy Rooney, who was a friend of the Stalag 17 authors, changed the facts to portray their suit as successful, stating that \"...someone at CBS apparently ripped off their idea and made a television series called Hogan's Heroes of it. The television program had too many similarities in character and plot to be coincidental, and when Don and Ed sued the network they won a huge award.\"\r\n\r\n3     In spite of its three Emmy nominations, TV Guide in 2002 named Hogan's Heroes the fifth worst TV show of all time (p 180, Running Press, Philadelphia, 2007).\r\n\r\n4   Holden won the Academy Award for Best Actor in a Leading Role. His acceptance speech is the shortest on record (\"thank you\"); the TV broadcast had a strict cutoff time which forced Holden's quick remarks.\r\n\r\n\r\n\r\n\r\nWilliam Holden as J.J. Sefton\r\n Don Taylor as Lieutenant Dunbar\r\n Otto Preminger as Colonel von Scherbach\r\n Robert Strauss as Stanislas \"Animal\" Kasava\r\n Harvey Lembeck as Harry Shapiro\r\n Peter Graves as Price\r\n Sig Ruman as Sergeant Johann Sebastian Schulz\r\n Neville Brand as Duke\r\n Richard Erdman as Hoffy\r\n Michael Moore as Manfredi\r\n Peter Baldwin as Johnson\r\n Robinson Stone as Joey\r\n Robert Shawley as Blondie Peterson\r\n William Pierson as Marko\r\n Gil Stratton as Clarence Harvey \"Cookie\" Cook (Narrator)\r\n Jay Lawrence as Bagradian\r\n Erwin Kalser as Geneva Man\r\n Paul Salata as Prisoner with Beard\r\n Edmund Trzcinski as himself (Edmund Trzcinski \"Triz\" \"I believe it man\")\r\n\r\n\r\n\r\nDirected by\r\n Billy Wilder\r\n \r\nProduced by\r\n Billy Wilder\r\n \r\n\r\nScreenplay by\r\n Edwin Blum\r\n Billy Wilder\r\n \r\nBased on\r\n Stalag 17 (play) \r\n by Donald Bevan and Edmund Trzcinski\r\n \r\nNarrated by\r\n Gil Stratton\r\n \r\nMusic by\r\n Franz Waxman\r\n \r\nCinematography\r\n Ernest Laszlo, ASC\r\n \r\nEditing by\r\n George Tomasini\r\n \r\nDistributed by\r\n Paramount Pictures\r\n \r\nRelease dates\r\n May 29, 1953 (UK)\r\n July 1, 1953 (US)\r\n \r\nRunning time\r\n 120 minutes\r\n \r\nCountry\r\n United States\r\n \r\nBudget\r\n $1,661,530\r\n \r\nBox office\r\n $10,000,000",
            "review_date": "2013-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A serio-comic anecdotal screenplay based in a historically accurate setting. Wilder was a non-conformist genius; no wonder at the top of every significant genre list is one of his movies. Only a one half star demerit for the stage-bound lighting. Nothing less than amazing, and with must see Special Features.",
            "review_date": "2013-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark humour, melodrama, silly, interesting, and exciting tale(s) of life in a German POW camp. The fantastic movie created from a great play and lead to a successful tv series (Hogans Heroes).",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best black and white film i've ever seen",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful tale of life in a German WWII POW camp. Some of the humor I was not expecting from a Billy WIlder picture.",
            "review_date": "2013-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of, if not the best movie ever",
            "review_date": "2013-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie even with flawed plot..",
            "review_date": "2013-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty entertaining but not that funny.",
            "review_date": "2013-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Holocaust movie set in the concentration camp, only this time it's well crafted as an involving spy game with intense black humour. With the presence of Otto Preminger, Robert Strauss as 'Animal' and the seemingly jolly German guards, Stalag 17 makes you forget you are actually witnessing the Nazi atrocities. The plot may seem simple in contemporary times, but the wise Billy Wilder's talent is well showcased by blending the seemingly incompatible torture and humour without awkwardness.",
            "review_date": "2013-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good war prison break film.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the Stalag 17 a lot.\n\nIt was an interesting film with an interesting twists.\n\nI like how the film did not reveal the actual person revealing the secrets within the Barracks until after half the film. \n\nThe story was very well done.\n\nI was surprised the commandant had his men place boards on the ground so that he would not get muddy. I was surprised by the amount of mud.\n\n The comic relief characters and the guy who announces information to all the barracks saying adieus all the time were the only things I did not like about the film. I did like the twist towards the end of the film as well as the final escape in the film.",
            "review_date": "2013-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "entertaining and definitely light-hearted despite the war theme. \nthere was only one thing that boggled me - why have 'cookie' narrate the story? that character was such a wallflower.",
            "review_date": "2013-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as directing goes, Billy Wilder is the perfect example of versatility. And as far as \"Stalag 17\" is concerned, this peculiar off-beat war-comedy fits perfect within the directors oeuvre. It's quite enjoyable to watch the sardonic Wilder weave this tale with a beautiful interplay between hilarious comical elements with a much darker, cynical tone produced from the brilliant performance of William Holden.",
            "review_date": "2013-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Billy Wilder shows that he can do comedy too.",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This films shows more of the brutality of the prisoner of war camps than the more well-known 'The Great Escape' and since most the film is set within the hut it doesn't quite escape its stage origins. However it's a great mix of drama and comedy and it's great seeing Holden in another camp (he would return again in 6 years time for 'Bridge on the River Kwai'). Like the previous Wilder film ('Sunset Boulevard') Holden isn't playing a likeable character but the unknown traitor in the hut is the real villain and therefore you still end up rooting for him. Comparing this to 'The Great Escape' or even 'Kwai' shows the difference in attitude between the British and Americans. You get a feeling in 'Escape' that all the British soldiers will stay friends for life. In 'Stalag' you get the feeling that all the Americans hate each others guts! It provides an interesting tension to the film.",
            "review_date": "2013-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like war movies, this is a must see.",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just watched Billy Wilder's gritty, tense WWII POW drama \"Stalag 17\" (made in 1953). William Holden, Peter Graves, Harvey Lembeck, Robert Strauss, Don Taylor, and Neville Brand are all brilliant. Lembeck and Strauss bring a lot of humour that both lightens and underlines the drama and tension. Wilder casts fellow director Otto Preminger in an acting role as the Camp Commandant. It's the story of a group of American prisoners in Stalag 17 as they come to realise that one of their number is an informant. Everyone suspects Sefton (William Holden) because he has a lot of sweet deals with the camp commanders, wheeling and dealing to get privileges. The tension builds around whether he really is the informant and if not then who it is. Once you find out who it is, the tension shifts to what Sefton will do and how he can expose the informant or whether the informant will continue to get away with reporting his information to the Nazis. Interesting to compare this to the tv series \"Hogan's Heroes\" which was set around a group of allied prisoners in Stalag 13, and which also featured a somewhat bumbling German Sergeant named Schultz. (Everyone involved in \"Hogan's Heroes\" has always denied that there was any direct influence between the film and the sitcom). Stalag 17 is a brilliant film that shifts from humour to tension and drama and the finale is a little edge of the seat.",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorites of all time",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie that inspired Hogan's Hero, but so much more. One of my favorite classic movies of all time",
            "review_date": "2013-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Astounding! Funny and brilliant. It catches your interest and stick your eyes open from the beginning until the end.",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When two escaping American World War II prisoners are killed, the German POW camp barracks black marketeer, J.J. Sefton, is suspected of being an informer.",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful film.Has some funny moments but stalag 17 is really a character film as we get to watch these soilders in the day to day life in pow camp.Fascinating watch.",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Written, produced and directed by Billy Wilder, adapted from Donald Bevan and Edmund Trzcinski's Broadway play of the same name, this is a blackly comedic prisoner of war drama, with some brilliant performances and some crackerjack dialogue typical of Wilder. It's a good, tight ensemble and it's a different kind of POW film, instead of being dark and gloomy, it's engaging, entertaining and exciting. Set in Stalag 17, somewhere near the Danube River, the camp holds Poles, Czechs, Russian females and in the American compound, 640 Sergeants. In Barracks Four, there is J.J. Sefton (William Holden), Harry Shapiro (Harvey Lembeck), Stanislas \"Animal\" Kasava (Robert Strauss), Joey (Robinson Stone) and Price (Peter Graves). Morale in Barracks Four is down after Manfredi (Michael Moore) and Johnson (Peter Baldwin) were shot dead trying to escape. The camp is ruled with an iron yet fair fist by Colonel Von Scherbach (Otto Preminger). After Barracks Four are punished, suspicion grows amongst the men that one of them is working for the Nazi's. This is a clever and thrilling film, and it's one of the best POW films ever made, with good, tight direction and writing by Wilder, who gets the best from his cast, (Holden won an Oscar for this), and it's got moments of inspired comedic dialogue through the drama of surviving in the camp.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dense narrative with incredible acting. Relevant to everyone anytime. Bullying to macho-image to trust to social criticism to nazi-depiction. Great theme tune.",
            "review_date": "2012-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stalag 17 is an amazing mix of drama and comedy. The story is well written and so astonishingly performed that the whole watching process turns into absorbing experience of witnessing a great movie happening.",
            "review_date": "2012-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A humorous take on a WW-II POW camp. Great humour and an easy watch, a classic in many respects.",
            "review_date": "2012-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lighter look at the camps where POW were held. Comedy is some places but overall a good plot line and film. Enjoyable to the end. Very much in the vein of The Great Escape.",
            "review_date": "2012-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "William Holden puts on a great performance, and well acted by the entire cast.",
            "review_date": "2012-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly recommended to those who loves prison drama movies .",
            "review_date": "2012-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the writing of \"stalag 17\" is so smooth and flows together so nicely, led by a damn fine performance from william holden. the comedy never over shadows the drama and vice versa.",
            "review_date": "2012-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could've and should've been so much better. http://bit.ly/fvHhi5",
            "review_date": "2012-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half of the film feels like a portrayal of an all too idyllic POW camp as plenty of fun is had by all, even the Germans, but in the second part when William Holden begins hunting down the traitor it comes into its own.",
            "review_date": "2012-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is truly one of the greatest films.  Stalag 17 has it all: great acting, a funny script, and the perfect mix of comedy and thriller genres.  William Holden won a Best Actor Oscar for this film and completely deserved it.  Billy Wilder is one of the most versatile filmmakers that has ever lived and with this film, he infuses political commentary with a gripping story and unique and three-dimensional characters.  If you have already seen Sunset Boulevard, this is absolutely the next Wilder film you need to see.",
            "review_date": "2012-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true wartime classic",
            "review_date": "2012-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best film of all times! I love the simplicity of the comedy",
            "review_date": "2012-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable farce from Billy Wilder, well written characters successfully portrayed, especially Robert Strauss as Animal.",
            "review_date": "2012-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good post WWII movie about WWII",
            "review_date": "2012-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wilder brings his great characterizations to bear in a rather dark portrayal of enmity between POWs.  Holden has cynicism down to an art form here.",
            "review_date": "2012-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Billy Wilder is one of the few directors of the era that can keep my attention throughout.",
            "review_date": "2012-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute classic from Billy Wilder.  Great plot - tense, gritty drama, with very funny interludes and dialogue.  The only (minor) problem is that sometimes the farce and the drama don't gel.\n\nSolid performances all round.\n\nSurely the movie that launched the POW drama.  You can see influences in this movie in just about every POW movie/series, especially Hogan's Heroes (down to both having a friendly, bumbling German sergeant named Schultz!).",
            "review_date": "2012-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This really wasn't what I was expecting but unfortunately not in a particularly positive sense. It is far more comedic than I imagined it would be, unfortunately I only laughed two or three times. That said the non comic elements amount to an interesting film and if the comedy had tickled me perhaps I'd have appraised this differently.",
            "review_date": "2012-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stalag 17 is one of those films that you can watch over and over again. So well written. Award winning acting and direction.It is very believable for the dramatical storyline and the humor seems to be just right.",
            "review_date": "2012-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best war movies of all time.",
            "review_date": "2012-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Writer-director Billy Wilder's enjoyable prison comedy-drama takes a look at life at a German POW camp populated by American sergeants and run by a deceiving commandant (Otto Preminger) and sergeant (Sig Ruman). When one recent escape plan goes wrong and the camp's wiseguy (William Holden) thought the plan was going to go wrong anyway, the other POWs begin to suspect that he is secretly informing the Nazis of their escape plans. Stalag 17 is unquestionably one of Billy Wilder's most entertaining features thanks to a fantastic script that shows us what prisoners of war would do to kill their time while in enemy territory and Robert Strauss' hilarious, scene-stealing performance as \"Animal\".",
            "review_date": "2011-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent combination of a dramatic story with the juxtaposition of humor mixed in.  It reminded me of M*A*S*H and Hogan's Hero's where you have a serious war going on in the background (and also the main plot of the spy,) but throughout there are comedic moments.",
            "review_date": "2011-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a solid story, good characters, too gradual of an intro build up for not so fascinating an exposÃ (C), then again for the time, probably very sophisticated",
            "review_date": "2011-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone should see \"Stalag 17\" at least once in their life. It's one of the best war movies I've ever seen. The acting is perfect, especially by William Holden, who won an Oscar for his portrayal as Sefton. Sefton is the perfect \"non-hero\". This is thoroughly entertaining, with comedy, drama, and edge of your seat suspense. I definitely recommend it!",
            "review_date": "2011-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of all the great Billy Wilder's films, this one feels a tad slight and dated, with its trite portrayal of a WWII POW camp and formulaic mix of American goofery and Nazi vs. Ally politics.  That is not to say the film is quite entertaining, given a cynical, almost self-defacing performance from William Holden (who won an Oscar for his efforts), pacy direction, and Wilder's darkly cynical tone. The Nazis aren't really portrayed as villians here, merely as rivals on the other side of a contest, and Wilder innovatively uses deft camera setups and a quick breathless pace to dispense of the weight of adapting a play to the screen.  The end result is fun and entertaining, and has to be viewed with an iota of sympathy, but Otto Preminger as a German commander and the film's entertaining payoff are well worth the effort.  Good fun.",
            "review_date": "2011-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Upon trying to figure out what to say about \"Stalag 17\", a friend of mine simply commented, \"Why not just write a one word review: brilliant\". Ladies and gentlemen, never has a person more succinctly and completely described the hilarity and greatness of this film. The film is brilliant. What more can one really say after that?",
            "review_date": "2011-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was really excited to see this, since I knew it was the seed of inspiration for my favorite series Hogan's Heroes. The similarities are astounding - from a tubby guard named Schultz to the \"no escape\" record of the Kommandant to the fraternizing and trading between prisoners and Germans. It was humorously incredible!\n\nBut the movie was as well, standing on its own. The opening scene with the overview of the huge prison camp really let us know what we were in for. I loved that they made a movie out of this concept. War and other dark subjects are frequently expounded and explained on film; the plight, struggles, hope, and humor of prisoners of war should get their share of attention from a civilian world that so often is ignorant of these military realities. A little introduction to this world can easily lead to more research, greater appreciation, and perhaps even a lifelong study (as what happened with me for my WWII appreciation, courtesy Hogan's Heroes).\n\nBut on with the movie - I was really surprised by the rich combination of drama and humor, laughter and poignancy, and of the brief character studies of many of the occupants of Barracks 4. Robert Strauss (as \"Animal\") and Harvey Lembeck (as Shapiro) really stole the show; their characters and acting really shine. The plot picks up about halfway through the film and doesn't let up from there. There are many memorable scenes (getting to the Russian women), laugh-out-loud moments (the reading of Mein Kamph), and heart-clutching moments (the lieutenant's interrogation).\n\nThe Collector Edition's accompanying mini-documentary on the real POWs of Stalag 17 puts the film in perspective and really made me appreciate what they went through.\n\nOverall, a fantastic movie - rich and richly acted.",
            "review_date": "2011-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very entertaining POW movie from the master of trick endings, Billy Wilder. This is slightly more straightforward than some other Wilder movies but the acting is top notch and the fact that the entire movie is confined to one location does in no way make it less of a journey. Great film.",
            "review_date": "2011-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspiration for the TV series Hogan's Heroes, this black-and-white classic is one of my all time favorites.  But unlike the later TV series, behind these colorful characters is serious...and lethal....business.",
            "review_date": "2011-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid, entertaining POW movie oddly mixes a lot of goofy humor with death, but it ultimately works as a mystery and escape thriller.",
            "review_date": "2011-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The suspense in Stalag 17 is great, but the film was spoilt a little by very healthy looking actors playing POWs.  I also wondered whether the Germans would have quite as unperturbed by POWs having a radio - in some of their occupied territories they certainly weren't.",
            "review_date": "2011-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Hogan's Heroes\" this is not, but it's still a good film.",
            "review_date": "2011-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Hogan's Heroes\" this is not, but it's still a good film.",
            "review_date": "2011-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A genius POW camp movie, Wilder has his typical dark humor and a mysterious/suspenseful story line. All of the actors did a superb job, and there's plenty of time to get attached to the characters (or keep predicting who will be the informant).",
            "review_date": "2011-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Spawned the TV Series Hogans Hero's.It is a toss up which is better.Both More Fun than should be possible on a POW Premise.",
            "review_date": "2011-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a good, old movie.  Set in a German prison camp during WW2, Stalag 17 is well-written, acted, and thought-out.  This isn't a \"we do this and we save the war cause\" movie.  Instead, it centers around a group of American soldiers in one barracks who would love to be anywhere but there.  However, in their attempts to escape, it becomes apparent that there is a rat among them.  From William Holden's great role as Sefton, the Sergeant no one trusts, to the scene stealing, comedy relief of Animal, Stalag 17 hits on all fronts.  Take the time and give it a look.",
            "review_date": "2011-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark humor, intrigue and great screenplay! Excellent performance by William Holden! An original story which is worth to see!",
            "review_date": "2011-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After enduring 3 hours recently for \"The Great Escape,\" I was groaning at a similar setup and hoped I was not in for another 2 hour prison break film. I should have known better, for the film twists into a brilliant chess-match between bunkmates of the (perhaps?) falsely accused Nazi-sympathizer. Well played.",
            "review_date": "2011-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly entertaining but the humor sneaks up on you lightening quick. If you aren't careful you can miss it. Several laugh out loud moments, but with serious undertones. An unrecognizable Peter Graves joins William Holden for the kicks.",
            "review_date": "2011-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could've and should've been so much better. http://bit.ly/fvHhi5",
            "review_date": "2011-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw many great wartime prison escape movies like \"The Great Escape'' and others..... but this is unique !! creative and funny...from a ifferent point of view this movie was made . Billy Wilder did a good job..and specially acting was awesome !",
            "review_date": "2011-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly remarkable war film. The script is amazing and the way the plot unfolds is fantastic. William Holden does a magnificent performance as the lead, and the mystery behind the \"snitch\" is very intriguing. All around one of the best war films I've seen.",
            "review_date": "2011-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, but a lot of the comic elements don't really work. They're a clash of tone with the more sober aspects of the story. It's a similar problem to the one that plagued The Great Escape, though this movie is shorter and William Holden plays a much better and more believable character than Steve McQueen. Stalag 17 is well paced and has some exciting \"ah-ha!\" moments, especially near the end.",
            "review_date": "2011-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, but a lot of the comic elements don't really work. They're a clash of tone with the more sober aspects of the story. It's a similar problem to the one that plagued The Great Escape, though this movie is shorter and William Holden plays a much better and more believable character than Steve McQueen. Stalag 17 is well paced and has some exciting \"ah-ha!\" moments, especially near the end.",
            "review_date": "2011-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like a lot of old movies, it's a slow pace. It was much more silly than I was expecting.  It was almost 2 hours of people being much more cheerful than they should have been in a POW camp.  What I really liked about the movie was the stuff about the spy.",
            "review_date": "2011-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit silly for WIlder, but overall a great film. Also, Preminger as the Nazi guard...doesn't get much better",
            "review_date": "2011-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. I watched it over and over last night. Everything is amazing about this film.",
            "review_date": "2011-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow now that was totally WICKED and and if you are into classic humor with suspense, this is a must watch....Loved it!\n\"How can you defeat your enemy with a bunch of clowns?...........We can laugh them to death.\"LMAO",
            "review_date": "2011-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Top 5 war films of all time. Better than the \"Great Escape\". One of the most underrated movies ever, and one of my personal favorites.",
            "review_date": "2011-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderefully cynical performance from William Holden",
            "review_date": "2011-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not at all what I was expecting, and I loved it more as a result. I knew beforehand that it was directed by Billy Wilder but for some reason, likely as I was aware William Holden won an Oscar for his portrayal of Sefton in it, I was expecting a rather grim, more seriously-played war film. What I got was a very funny comedy that just so happens to be set in a German POW camp. The duo of 'Animal' and Shapiro provide a lot of the laughs, and were seemingly granted as much screentime or thereabouts as Holden himself. This equality amongst those cast in Stalag 17, combined with the fact that the lead character of Sefton often comes across as selfish and cynical, shows just what a brave director Wilder was, and helps give the film an 'all in this together' type spirit - vital to a POW camp - that some 'star vehicles' would not be able to achieve. There is tension and excitement involved in the plot in addition to the plentiful humour, and it all works together really well. A genuine classic.",
            "review_date": "2010-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic thriller/comedy from Billy Wilder. Great film.",
            "review_date": "2010-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plot/Summary\nSet in a German POW camp, this comedy alternates between raucous dark comedy and pathos as seen through the eyes of a cynical prisoner.\nMY Review\nNobody has ever escaped from Stalag 17. Not alive, anyway.\"\n Absorbing drama about American POWs in a German World War II camp. Apparently, someone amongst the prisoners is a traitor, but who? Fascinating assortment of characters exhibit real camaraderie. Although there is an expected gravity underlying the proceedings, never before has a POW camp been enlivened by so much humor. Even legendary film director Otto Preminger as the evil camp commander, appears humorously benevolent. In the hands of a lesser director, the mix of comedy and drama would be jarring, but writer-director Billy Wilder flawlessly adapts the 1951 Broadway play with a discerning eye. Actor William Holden is also brilliant as the cynical and self centered prisoner, J.J. Sefton, ostracized for the preferential treatment he receives from the enemy. It's a brilliant achievement that earned him the Academy Award for Best Actor. His portrayal anchors a film already overflowing with brilliant performances. Another great escape was found.",
            "review_date": "2010-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Billy Wilder is one of the few directors of the era that can keep my attention throughout.",
            "review_date": "2010-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After watching this film, I defy anyone who says William Holden wasn't a good actor! This is a classic Billy Wilder film full of outrageous characters, tough situations and his movie will remind many of the a 60's sit-com set in Stalag 13.",
            "review_date": "2010-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Between 3 and 3.5 stars. Even in such a hard situation as it describes, Wilder finds his way to create a comedy.",
            "review_date": "2010-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfectly balanced World War II film(or a POW film to be more specific), with the elements of comedy and drama contrasting and merging at the same time to great effect. On one hand, the whole humorous tone of the film was incredibly, almost single-handedly carried by the characters of Shapiro and Animal(Harvey Lembeck and Robert Strauss, respectively). While the complex tone of human spirit and survival against all odds flawlessly embodied by William Holden(in an Oscar-winning performance) as J.J. Sefton on the other. In the expansive magnitude of films such as those of the war genre, it's very rare for a picture of this kind to play with the \"whodunit\" plot device. But the screenplay(based on a theatrical play) has brought the film into its revelatory climax without being very obvious of what(or who)it is pertaining to. Besides its thrilling suspense and trivial comedy contained throughout as it heads into a surprise ending, \"Stalag 17\" also shows the side of soldiers unblemished even by captivity; that of their extreme devotion of preserving a much-admired \"war hero\"(Lt. Dunbar) from certain death. But once they looked at J.J. Sefton with disdain and brow-raising judgments, both to his stance, his cigarette-trading antics, and their hunch of him being a \"stoolie\", they never were aware that they're looking at yet another hero. He conforms with his captors, he's a loner in their ranks, but his ultimate gallantry's what really counted.",
            "review_date": "2010-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining POW comedy with one of William Holden's great performances. Not Billy Wilder's best, but still has a sharp script and a lot of great moments.",
            "review_date": "2010-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Billy Wilder masterpiece. It has comedy and suspense, and it works perfectly as a comedy and as a thriller set in a \"Stalag\". William Holden is great specially in the end, which was excellent and one of the best endings I've ever seen. It's pefectly told, written and directed. An amazing motion picture.",
            "review_date": "2010-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my favourite movies from Wilder, it's a subject that's close to his heart, and is still in the memories of many people: WWII concentration camps.  This movie is about a POW camp really, but it's still related to that theme.  Anyway, it balances dark comedy and drama so delicately and brilliantly I loved it.",
            "review_date": "2010-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this at Cinema La Placita.  I didn't really know what to expect out of it.  It was a really good movie.  The story line kept me hooked through the entire movie.  I'm not much into war movies.  I would highly recommend this to just about anyone.",
            "review_date": "2010-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First, get yourself a hundred cigarettes for the Kraut guards. Then get yourself another face.",
            "review_date": "2010-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very different portrayal of a POW camp. Billy Wilder focuses on the interplay between lots of macho men with too much time on their hands. Much of this is very good, but at times it felt worryingly like 'Carry On Colditz': a couple of the more overtly comedic characters really got on my nerves, and most of the German guards were next seen in 'Allo 'Allo!\r\n\r\nIt's all held together by a great performance by William Holden as the cynical JJ Sefton, who trades with the Nazis, bets against escape attempts and generally upsets everyone else. Not that he cares much.\r\n\r\nThe drama of the mystery behind the traitor in their midst is really interesting, but gets hidden by some hit-and-miss (mostly miss) slapstick that felt very out of place to me.",
            "review_date": "2010-08-07",
            "source": "rt",
            "lang": "en"
        }
    ]
}