{
    "rating": 9.3,
    "release_date": "1953-11-03",
    "num_reviews": 250,
    "genres": [
        "Japanese"
    ],
    "summary": "The elderly Shukishi (Chishu Ryu) and his wife, Tomi (Chieko Higashiyama), take the long journey from their small seaside village to visit their adult children in Tokyo. Their elder son, Koichi (Sô Yamamura), a doctor, and their daughter, Shige (Haruko Sugimura), a hairdresser, don't have much time to spend with their aged parents, and so it falls to Noriko (Setsuko Hara), the widow of their younger son who was killed in the war, to keep her in-laws company.",
    "reviews": [
        {
            "content": "A beautiful, subtle, and understated film that is surprisingly poignant and moving. I wouldn't have appreciated this film is a younger man, but as a 60-year-old empty nester with aging parents, it really resonates. It's also an interesting look at life in post-war, Japan. No monsters or samurai in Ozu's greatest films, but none are needed.",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "Boring.   You have to be in a film school frame of mind to like this",
            "review_date": "2022-11-18",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is an evocative and very personal film that is a wonderful example of the nuanced emotions that one can feel when viewing a film by a master of their craft. Yasujiro Ozu is now considered one of the greatest filmmakers in the history of cinema, of course he wasn't internationally praised until nearly seven years after his death. Akira Kurosawa and Kenji Mizoguchi were both more well known at the time than Ozu for a variety of reasons. The most prominent reason was that distributors thought his films were \"too Japanese\", by that they meant that the traditional customs and way of life in Japan wouldn't be understood or appreciated in the West or other places besides Japan. The films of Ozu were gathered and shown after his death to great critical acclaim and one thing was certain with all his films, they are universal in their themes and messages. His films touch on everyday problems and issues concerning everyday people and situations, most involving a family dynamic or some other type of close relationship.\nIn Tokyo Story we see the lives of an elderly couple as they travel very far in order to visit their busy children living in the hustle and bustle of Tokyo. The film is comprised of a week or so of everyday life for the people involved and tells a beautiful, albeit very sad and contemplative story of appreciating one's elders, family especially, as they won't be around forever. The film's emphasis is on spending the time left wisely and lovingly. The story is so simplistic in it's narrative and filmed as if the camera is merely observing unobtrusively. Many sequences are shot as if the cameraman is kneeling down and the effect is both thoroughly personal and restrained. No single character is emphasized or framed differently in order to keep the feeling of intimacy and keeps the viewer simply a passive observer. Ozu let's hit character and their actions be the movement as he uses very little movement on the part of the camera, taking great care in setting up his shot well in advance. While simple from a visual and narrative perspective, it's Ozu's personal and emotional touch that elevates his works above so many of his contemporaries.",
            "review_date": "2022-10-16",
            "source": "rt"
        },
        {
            "content": "Sentimental without being maudlin, touching without being manipulative, Tokyo Story is Yasujiro Ozu's masterpiece about the passage of time and the inevitable disintegration of the nuclear family as children begin to carve their own paths in life.  It's the simple story of an elderly couple who travel to Tokyo to visit their children and come to the sobering realization that they have started to become a burden to their offspring.  Presented in Ozu's unique style of low stationary camera angles, perfectly framed shots, and beautifully blocked scenes, it is a meditative tale of life and death, a classic worthy of the praise that has been heaped on it over the years.",
            "review_date": "2022-09-07",
            "source": "rt"
        },
        {
            "content": "Ozu's  1953 Tokyo Story is a less touching version from the  1937 film:Make way for Tomorrow. I would highly recommend the original Leo McCarey version\nWriting Credits  \nViña Delmar\t...\t(screen play)\n Josephine Lawrence\t...\t(based on a novel by)\n\nThe main issue I have had with all of Ozu's work is simply the fact that his characters appear shallow compared to other renditions to similar circumstances.  Setsuko Hara's Emotionally detached reactions towards love or marriage truly bother me. Not to mention the materialistically  driven motives of each character favoring financially stability and routine above choosing to marry for love. I simply cannot relate or enjoy listening to or observing pointless small talk that takes up most of Ozu's movies time while ignoring the deeper aspects of the actual problems. I therefore cannot credit or rate this movie well, because it is as I mentioned a copy from a much older and better version.",
            "review_date": "2022-07-09",
            "source": "rt"
        },
        {
            "content": "\"Tokyo Story\" is a long movie, and it must be admitted that the viewer may feel its length. Trivialities aside, it is hard not to be awed by the incredibly well-rounded scope of the film's vast and yet quietly understated ambitions. Through the seemingly leisurely format of an elderly couple visiting their adult children in Tokyo, Ozu evokes an epic vision of inter-generational conflict, the bittersweet transience of life (mono no aware), and generally pervasive human frailties in a fashion that merely observes with empathy without deigning to comment. Furthermore, these achievements occur in the context of a naturalistic depiction of life that upholds its dignity through eschewing the melodrama of artificial manipulation. On account of this strength, the film can prove a culture shock to the new initiate while requiring a degree of patience from even the most devoted viewer, yet it would be substantially false to regard \"Tokyo Story\" as more of a challenge than a pleasure. Its quiet regard for humanity and all of its concurrent good intentions and personal failings leaves us in tears and inspires us (without preaching) to treasure our own interpersonal relationships that we've come to take for granted. Although made in post-war Japan, the film feels destined to remain timeless and universal, securing its place within the pantheon of those greatest works which touch deeply upon the relevant themes of life which we should all care so much about.",
            "review_date": "2022-06-13",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is simple. It has a very simple story, minimalistic camera movements and even a contained setting. Yet, the characters and their interactions are rich with detail and human drama. The film was made almost 70 years ago, yet the themes and topics are very much relevant today. Every bit of emotion is genuine and does not feel forced. The static camera consists of incredible blocking and composition. Director Yasujiro Ozu used these simple ideas to create an enduring masterpiece.\n\nTwo elderly people visit their children and grandchildren in Tokyo. Their children however, have no time and aren't able to take great care of them. The elderly Shukishi and his wife are sent to Noriko, the widow of their youngest son who was killed in war 8 years prior. By the end of the film, it is the turn of the children to travel the other way.\n\nThe film just immerses you in and there are no artificial elements to break that immersion. It just feels so real. If a character leaves a room to go downstairs, their absence is shown for a few moments to let us actually grasp that moment. Shots consisting of people are mostly placed on the ground or eye level which let me notice and appreciate the superb composition. The last 20 or 25 minutes almost had me in tears. One, because of the obvious emotion present and the second is because it shows our own fears and flaws. It really effective.\n\nThis film is a masterclass in almost every aspect of simple, low budget filmmaking and I have no doubt in calling it one of the greatest films ever made. It is perfect in every sense of the word with shots and scenes that will stick with me forever.  5/5.",
            "review_date": "2022-05-07",
            "source": "rt"
        },
        {
            "content": "Why did it take so long for me to see this film? I don't know why that is, other than being behind with my movie watching due to studying, and I am still kicking myself because Tokyo Story was one of the best films I've seen in quite some time. I haven't seen enough of Yasujiro Ozu's work to judge him as an overall director, but seeing Tokyo Story it is very easy to see why anybody would consider it one of his finest achievements or him as a master film-maker. Tokyo Story is beautifully shot, everything looks homely and evocative and the shots, frame and cinematography are done to perfection. And Ozu directs very sensitively and assuredly, it is said that he specialised in middle-class family melodramas and I have no trouble believing that. The story is quiet and meditatively paced but never bored me, because every bit of writing, family scene and character was dealt with in such a poignant and intelligent manner. Tokyo Story is also helped by some truly wonderful acting. Setsuko Hara just epitomises gentle kindness, making us warm to Noriko easily, while Chishu Ryu and Chieko Higashiyama play their roles with nuanced and affecting dignity. In conclusion, a beautiful and deeply moving film in all respects. 10/10 Bethany Cox",
            "review_date": "2022-03-18",
            "source": "rt"
        },
        {
            "content": "An overly stereo-typical story where the vamp is overly menacing and the man is overly manipulated!!",
            "review_date": "2022-02-05",
            "source": "rt"
        },
        {
            "content": "it's all been said by the critics. Ozu is one of history's top directors, and this is one of his top films.",
            "review_date": "2021-04-15",
            "source": "rt"
        },
        {
            "content": "The first time I saw this movie I liked it, but it left me wondering what all the hype was about. After familiarizing myself with Ozu's oeuvre and then watching Tokyo Story a second time I realized what an amazing film it is.",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is the GOAT of all Japanese movies. Overall, I have nothing to say but love and respect.",
            "review_date": "2021-01-26",
            "source": "rt"
        },
        {
            "content": "You must watch now. Absolutely fantastic.",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "Absolutely beautiful despite its seeming simplicity. A fascinating masterpiece.",
            "review_date": "2020-09-02",
            "source": "rt"
        },
        {
            "content": "この偉大な映画は国境を越えて感情を揺さぶる日本の宝",
            "review_date": "2020-07-13",
            "source": "rt"
        },
        {
            "content": "Ozu's masterpiece may look very simple at first glance, but it is extraordinarily complex when you watch theough it. The characters filled with each of their own personalities and the story itself, simple but such a poignant family drama which is told is such an understated way. The film often makes you take pity or feel disgusted at the characters. But in the end, the film reminds us that we are just like them, that we are humans, and that what we're watching is simply a reflection of what and who we are.",
            "review_date": "2020-05-27",
            "source": "rt"
        },
        {
            "content": "Yasujiro Ozu proves he has a way with human emotions like no other in his magnum opus.",
            "review_date": "2020-05-18",
            "source": "rt"
        },
        {
            "content": "Touching movie with relatable and realistic characters. Even though this movie is from the 50s, but the value this movie holds is very universal and relevant to our global society. The story of children living in big city on their own with their own issues, welcoming their elderly parents from the countryside. The acting maybe looked stiff, yet the message the actors delivered is somehow implicit and meaningful.",
            "review_date": "2020-05-11",
            "source": "rt"
        },
        {
            "content": "In his pièce de résistance, Yasujiro Ozu employs his signature low-angle framing and static camera movement to accent the heft of melancholy and lonesomeness of senescence in a poignantly observed family drama about a pair of geriatric parents visiting their children in the post-war titular prefecture.",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "Masterfully made, and genuinely touching.",
            "review_date": "2020-04-30",
            "source": "rt"
        },
        {
            "content": "Yasujiro Ozu's sensibility combines the particularities of Japan with universal questions about family and generational conflicts in a masterful work that remains fresh after half a century.",
            "review_date": "2020-03-27",
            "source": "rt"
        },
        {
            "content": "Domestic tragedy about the universal experience of aging parents' disconnection with children they raised",
            "review_date": "2020-03-24",
            "source": "rt"
        },
        {
            "content": "Revealing its characters and plot through context rather than simply informing the audience, Tokyo Story is a masterful demonstration of conveying emotional impact without relying on base shock. A beautiful exploration of how both tradition and the individual interact in the context of both timeless character struggles (greed, ambition, and selflessness) and a turbulent, changing environment. (4.5/5)",
            "review_date": "2020-03-06",
            "source": "rt"
        },
        {
            "content": "An interesting look into postwar Japan, and although it is true that it slowly grows in you and it becomes absorbing and familiar, it also true that it won't rank among my favorites Classic.",
            "review_date": "2019-12-27",
            "source": "rt"
        },
        {
            "content": "An interesting fact about Ozu is that he was one of the first director's to break the 180 rule (a filming guideline that two characters in a scene should maintain the same left/right relationship to one another); and I think he breaks it to great effect. When he depicts dialogue scenes he doesn't simply use the shoulder/reverse technique, but instead opts to focus directly in on his actors faces. This is important because in this film, the actors' performances are intentionally dialed down to increase the realism of the piece. So when his characters speak, Ozu uses this close-up shot to let the viewer examine the character and pull out the more subtle emotional nuance from the performance. And that method works to an amazing degree in this film because the entire story revolves around the fading relationships between the young and the old, and how in a modern world, family can drift apart. When the young characters talk to the old ones, rarely do they say anything of substance to each other. Most of the interactions between the grandparents and their children is filled with feigned niceties, forced concern, and surface level small talk. The notable exception to this is the relationship between the grandparents and the widow of their deceased son, which is quite close and intimate. And that is one of the great ironies of the story, as noted by the grandfather: Out of all the people in the family, the only one who shows any deep caring towards the older generation is the one who isn't related by blood. And this is Ozu's way of shining a light on the society of the modern world and more specifically post-war Japan. It isn't a critique or a praise, he is simply saying that the times are changing. No longer does family necessitate warmth and love, care is something to be received from the caring. And this is why Ozu's cinematography is so crucial to the themes of the film: it allows us to see through the feigned niceties. For example, the daughter of the main characters is nothing but polite in her dialogue. In fact, if we only read her lines in a screenplay she would seem like a devoted daughter, but when Ozu isolates her face in the frame, and shows her in close-up, we can tell there is no emotion behind her words, and that her caring is a mere polite facade. The widow of the deceased son on the other hand is quite the opposite. The words she says are - for the most part - quite similar to what the daughter says, but when Ozu lets us examine her face, we can tell from her eyes and expressions that she truly does care for her parent-in-laws. Another technique Ozu utilizes is his intricate framing. When Ozu shoots a scene it is usually framed through the context of the surroundings. We often see shots through doorways and hallways, or between two objects. And when Ozu frames these scenes he doesn't use cuts to jump around the frame, instead he holds the shot and lets us observe the scene, letting the actors shift the frame instead of the camera. By doing this, Ozu allows the viewer to examine the scene through an impartial lens. We see what's happening and are permitted to observe how the characters interact and talk. And this works to great effect in understanding the relationship in how each character feels toward each other. There is a scene in which the grandmother tries to show love towards her grandson, which he responds to by running out of the room, and subsequently the frame. But instead of cutting to where the boy is running to or shifting directly to the next scene, Ozu lingers on the existing frame, showing the grandmother alone in the room. We, as the viewers, can see that the grandma is isolated from her family. Though every interaction she has is pleasant, there is no love. The adults can hide their lack of intimacy behind pleasantness, but the child, immature in nature, is not old enough to obscure his inner feelings, runs away from his grandmother. And you can tell she feels this invisible distance, just by her standing alone in a frame.\n\nThe depth that Ozu's cinematography creates is the pinnacle of what Hitchcock called \"pure cinema\". There is much more to be said about his filmography and why it's so artful, but the way in which he blends theme and function is what stands out to me the most. By doing less with the camera, Ozu achieves unprecedented depth. And that's what makes this film a masterpiece.",
            "review_date": "2019-09-24",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is a respectful work - to its characters and to its audience. Ozu reminds us to slow down and appreciate our lives and those we share it with. If you are willing to accept it’s gentle rhythm then you will find a film truly human and timeless in quality.",
            "review_date": "2019-08-20",
            "source": "rt"
        },
        {
            "content": "If you can surrender to the slow, stately pace and the lack of action, then there are many rewards in Ozu's portrait of a dysfunctional Japanese family hiding their resentments behind smiles and formalities. The camera stays low and never moves, life goes on, rivers flow.",
            "review_date": "2019-08-17",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is a story about the collapse of the ie, the traditional Japanese family structure, in the face of modernization. However, this topic is explored in such a way that it remains relevant 65 years later and half a world away. The portrayal of a group of siblings so absorbed in their own problems to spend time with their elderly parents is sufficiently relatable that it made me feel deeply guilty for neglecting to spend more time with my grandparents. The writing and structure prevent the film from feeling exploitative or sentimental, and the actors deliver beautifully understated performances, effectively conveying the subtexts underlying much of the dialogue. The movie is also expertly shot, with a rather distinctive style where the camera seldom moves and is placed lower than is typical for dialogue scenes. Breaking established conventions regarding cinematography can be risky, but Yasujiro Ozu is has sufficient skill to make this something akin to the signature style of an esteemed painter rather than the distracting misuse of the Dutch angle in Battlefield Earth. With its lack of much in the way of an overarching plot or defining events, Tokyo Story is a film I appreciate more than I enjoy, but viewing the film gave me the intense sense that I was watching something special.",
            "review_date": "2019-06-10",
            "source": "rt"
        },
        {
            "content": "Superficially it might look slow, but I think it is perfectly edited. Each scene effectively makes a point that adds to the story and moves it forward. Visually, many shots are well composed. Ozu never moves or pans his camera because he doesn't need to. He chose the perfect angle and composition for each shot, so the camera doesn't need to move. And the best part, I think, is that it is very evocative without melodrama. That's a huge contrast with most popular movies that rely on sensational drama and exaggerated characters. This movie skips all of that, and yet the more you think about it, the more you feel its depth.",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is a marvellous example of unmistakably Ozu's work focusing on the relationships of family members. In his famous manner of low camera positioning, Ozu is showing the inevitable events of life when children grow up and drift always from their families. In a melancholic way, Tokyo Story shows kids related hopes and expectations of the old people, their feelings to all the family members, peculiarities of the morality within family relations, westernisation of the Japanese society and many other themes. All these features are collided with the character of Noriko and young daughter of Hirayama family, who are very different from other young family members. The most important things for Ozu are always revealed in the dialogues. In the key dialogue, Noriko (portrayed by incomparable Setsuko Hara) talks about the life with young Kioko saying she is not able to understand her older siblings so far and ends up saying the even understanding won't take far: with her famous radiant smile, Setsuko Hara says life is nothing, but disappointment. The fantastic shots of nature by Ozu also worth mention ï¿ 1/2\" they are brilliant to enhance story telling.",
            "review_date": "2019-04-06",
            "source": "rt"
        },
        {
            "content": "Love this movie, I watched it with my mother and we both felt happy and sad after this amazing masterpiece.",
            "review_date": "2019-03-20",
            "source": "rt"
        },
        {
            "content": "3/5\nIn 1992, Sight & Sound established a Director's poll of the greatest films, to go along with their critic's list, established in 1952. In 2012, Citizen Kane was knocked off the top of both lists, replaced by Tokyo Story on the Director's list. In addition, it appears in Ebert's Great Movie series, described as one of the greatest films ever. He stated that he was \"near tears in the last 30 minutes.\" So when I had a perfectly timed 3 hours to kill before meeting friends at a bar just a few blocks from the SFMOMA, at the exact time they were showing the film, I couldn't resist. \nAll of the praise was lost on me. I understand that the traditional Japanese family relationships were breaking down. There's a funny contrast between how the grandfather interacts with his family, and how he drunkenly describes them later when downing sake with two old friends. Some of the adult children were boorish, and the grandkids were obnoxious, but so what? None of this was extraordinary to me at all. \nOzu is famous for not moving his camera, but the shot compositions were not impressive. I'm no stranger to cinematic waterworks, having just lost control during Capernaum, and even getting misty during Stan & Ollie. Tokyo Story was an interesting window into a period of change in Japan, but that was all.",
            "review_date": "2019-02-16",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is a scathing indictment of how people mistreat their parents and take them for granted as they grow older. At least I think that was the point of the film. Most of the time I was too busy trying to stay awake, because it is such an uneventful and bland movie. It’s a slice-of-life drama, and any time I use that as a description for a film, it probably means I hated it because I was bored. The older couple are sweet, and they had one nice daughter-in-law, but otherwise most of the characters were annoying and forgettable. This movie also pushed my limits of remembering Japanese names, because I could not keep track of who they were talking about half the time. There isn’t much flow to the story, in fact there are often simple cuts from one scene to another where it is suddenly revealed that days or weeks have passed during that cut between scenes. It makes the whole film seem disjointed and odd. Although nothing is quite as unusual as the way Ozu shoots all the conversations. We are constantly bombarded by moments where someone talks directly to camera in the middle of a conversation. Instead of shooting over the shoulder of the person who’s being spoken to (as most filmmakers would do) we are put in the position of that person as someone talks directly at us. Then it will switch back to a wide shot where we see everyone in the room, then to another person looking at the camera, and so on. Not only does it look weird, but it also takes away any normal flow to the conversation because you can tell there was a cut as they repositioned cameras setting up for the next sentence. It was such a conscious choice that I kept wondering why Ozu chose to film scenes in that fashion, so it took me out of the film. I did not enjoy Tokyo Story at all, but clearly I’m missing something because it is a well-loved movie for many people, it’s just not for me.",
            "review_date": "2018-12-12",
            "source": "rt"
        },
        {
            "content": "If I had to say something about this movie I'd say It's a \"True movie about ever changing human nature.\"",
            "review_date": "2018-08-17",
            "source": "rt"
        },
        {
            "content": "A beautiful film, quietly observant and universally recognisable on every level. I found it genuinely moving (particularly towards the end) and there aren't enough films being made like this at the moment, which saddens me.",
            "review_date": "2018-08-04",
            "source": "rt"
        },
        {
            "content": "A moving and heartwarming story.",
            "review_date": "2018-06-18",
            "source": "rt"
        },
        {
            "content": "Ozu achieves a profound sense of realism and crushing melancholia through his transcendent approach.",
            "review_date": "2018-06-04",
            "source": "rt"
        },
        {
            "content": "Life really is disappointing ",
            "review_date": "2018-04-20",
            "source": "rt"
        },
        {
            "content": "The best movie of Japanese ever made of all times in the world",
            "review_date": "2017-12-28",
            "source": "rt"
        },
        {
            "content": "A touching story about family, priorities and aging that is as relevant to watch today as I imagine that it was 70 years ago!  I had an enjoyable afternoon watching this.",
            "review_date": "2017-12-26",
            "source": "rt"
        },
        {
            "content": "An epic film. Amazing script. However many films you watch by Ozu it is always a life changing experience. However old the movie is, it is always so touching and uptodate.",
            "review_date": "2017-12-25",
            "source": "rt"
        },
        {
            "content": "No matter you are to understand how Post-war Japan was like, how the Japanese endured sorrow or the traditional Japanese family values, Yasujiro Ozu's Tokyo Story remains a masterpiece on film history.",
            "review_date": "2017-10-16",
            "source": "rt"
        },
        {
            "content": "Perhaps the best film I have ever seen. A masterpiece.",
            "review_date": "2017-09-10",
            "source": "rt"
        },
        {
            "content": "Bored silly. Moral of the story: don't be a dick to your parents.",
            "review_date": "2017-07-12",
            "source": "rt"
        },
        {
            "content": "I find it amazing how the themes of changing culture, generational differences, and family growing apart translate so well to today, not just postwar Japan. The minimalist, patient approach allows the viewer to identify with and experience the power of the emotions the characters do. Often regarded a true masterpiece, this is the best film of 1953-- a year in which many of the best films either came from Japan (see Ugetsu) or were about war with Japan (From Here to Eternity). This one transcends the era better than the rest, touching on universal, existential, deeply touching aspects of life.",
            "review_date": "2017-04-23",
            "source": "rt"
        },
        {
            "content": "An elderly couple head to Tokyo to spend a few days with their children and grandchildren.  While their children are initially glad to see them, and the parents are models of patience and pleasantness, the novelty wears off pretty quickly for the children and they soon view the parents as a hindrance more than anything else.  Then an event highlights the divide between the two generations...\n\nEngaging and emotional drama from famed Japanese director Yasujiro Ozu.  It wasn't always looking like it was going to be that great though.  While always engaging, the pace is very slow at the beginning.  The first 60% or so is all scene-setting - Act 1 essentially.  Things ramp up once the aforementioned event occurs, and this makes the wait worth while.\n\nQuite emotional, ultimately, and quite balanced in its views.  It looked like it was going to be fairly judgmental in its observations, but the final few scenes add a different perspective.  Having a character that was able to see both sides of the issue helped a lot.\n\nNot quite the masterpiece it is made out to be, but very good nevertheless.",
            "review_date": "2017-04-14",
            "source": "rt"
        },
        {
            "content": "Timeless themes of family, love, loss and selfishness. A bit long and their way of speaking was rather annoying.",
            "review_date": "2017-03-30",
            "source": "rt"
        },
        {
            "content": "I don't know what it is about Ozu's way of filming things, but I just find it pretty plain and kind of boring. I know he likes to use natural framing, which is nice, but it's just plain most of the time. \n\nThese kinds of movies might be a little bit too real for my taste. That's something I've realized Ozu is great at doing. He's good at making you see the real side of things within family matters and matters of loneliness. \n\nIt also touches on themes like death and how as you get older, you become more detached from your parents. \n\nOverall, pretty good movie, even though boring and flat at times.",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "Had to see what all the fuss was about.  \nReal feelings, very thought provoking, and well made.",
            "review_date": "2016-12-17",
            "source": "rt"
        },
        {
            "content": "Good luck staying awake.",
            "review_date": "2016-12-14",
            "source": "rt"
        },
        {
            "content": "It is very rare for me to truly love a Japanese film due to personal issues, but this film man... it hit me on so many levels. I loved every second of \"Tokyo Story\" and I found it beautifully melancholic and profoundly moving. I have to say it is not for everyone and requires a certain kind of patience; it unfolds at the speed of life and it allows us to be an observer, looking at an every day life of ordinary people in post-war Japan. The themes of family and generations affected me emotionally that it actually made me feel nostalgic for my own culture, which almost never happens from watching a Japanese film. It is tender, complex, and quietly devastating and I have to say this just became one of my favorite films of all time. \"Tokyo Story\" is a great film.",
            "review_date": "2016-11-16",
            "source": "rt"
        },
        {
            "content": "Boring movie. Good overall themes, and good writing. But, the acting was really bad and the movie was so slow. I wasn't very impressed.",
            "review_date": "2016-10-16",
            "source": "rt"
        },
        {
            "content": "One of the great ones; Ozu's classic manages to be poignant and funny at the same time.  A must-see.",
            "review_date": "2016-08-02",
            "source": "rt"
        },
        {
            "content": "The closest thing to watching real life on screen. Yes, the story is fictional. But it's believable. Nothing is exaggerated. What this film is about is family, generations, and time. We change, so does everyone else, and so do the times. As we age, things and people we once knew become different things and different people. This is true for everyone at any time. This film asks its viewers to contemplate their own relationships, with their family and surroundings. Cherish the time we have with the people and things we love; never take that time for granted.",
            "review_date": "2016-07-01",
            "source": "rt"
        },
        {
            "content": "Excellent if you know what you are getting into and actively seek it out. In stark comparison to modern works, this film relies heavily on the kind of work it seems only Ozu does. In the world contra standard technique, Ozu is no doubt a god. \nSo different these films can be from modern cinema I doubt many that do not come to it of their own volition will come away with a good experience. \nIt's not incredibly complex unless you make it so, yet the film is not something easy to accurately convey to another.",
            "review_date": "2016-03-24",
            "source": "rt"
        },
        {
            "content": "Slow paced simple story about grandparents' feelings towards their children and vice versa. Modernization of japanese life versus polite traditional disguise of true feelings",
            "review_date": "2016-03-19",
            "source": "rt"
        },
        {
            "content": "It's initially a bit slow to start, but picks up.  A beautiful, sad, moving movie about life and death and the divide between generations.  You'll want to hug and spend a lot of time with your parent(s) after watching this one.",
            "review_date": "2016-03-04",
            "source": "rt"
        },
        {
            "content": "\"None can serve his parents beyond the grave.\"",
            "review_date": "2016-02-16",
            "source": "rt"
        },
        {
            "content": "Absolutely a contender for the --best film ever made, anywhere--. \nCertainly, incomparable if not the best.",
            "review_date": "2016-02-16",
            "source": "rt"
        },
        {
            "content": "Ozu's long shots, knee-high camera placement, and collapsed perspective made a greatest film of all time. No story could be simpler. An old couple go to the city to visit their children and grandchildren. Their children are busy, and the old people upset their routines. In a quiet way, without anyone admitting it, the visit goes badly. The parents return home. A few days later, the grandmother dies. Now it is the turn of the children to make a journey.",
            "review_date": "2016-02-10",
            "source": "rt"
        },
        {
            "content": "Shaking themes up for his third film with Setsuko Hara, Ozu's \"Tokyo Story\" explores the difficulties of family connections when everyone is grown up, and the loneliness of long-time empty-nesters.",
            "review_date": "2016-02-09",
            "source": "rt"
        },
        {
            "content": "If when we get what we want, doesn't necessarily make us happy, what is loneliness then?",
            "review_date": "2016-01-29",
            "source": "rt"
        },
        {
            "content": "Wonderful insights into what goes on behind the scenes in a normal-ish Japanese family .. Most of all, love the slow pace as compared to the visual hitting on the head in western films. this' much better.",
            "review_date": "2016-01-15",
            "source": "rt"
        },
        {
            "content": "Our Daily Free Stream: Ozu - Tokyo Story (engl. subt.). Zum Tod von Setsuko Hara: Ihr Lächeln, wie ein wehmütiges Eingeständnis mit dem Leben. Ihr Gespür für flüchtige Gesten führen uns in die Welt der leisen Zwischentöne. Sie war das Gesicht des japanischen Kinos und als Schauspielerin prädestiniert für die Kunst Ozus. Aus diesem Anlass zeigen wir heute Tokyo Story. - Keine Geschichte könnte einfacher sein: Die Grosseltern reisen in die Stadt, ihre Kinder und Enkelkinder zu besuchen. Die allerdings sind beschäftigt, was die alten Menschen verärgert. Still, ohne dass es jemand zugibt, verfehlt der Besuch seinen Zweck eines Miteinanders. Nach der Rückkehr stirbt die Grossmutter wenige Tage später und nun ist es an den Kindern, eine Reise zu unternehmen. Aus diesen Elementen hat Ozu einen der grössten Filme aller Zeiten gemacht; eine Geschichte, die noch lange nachwirkt und tiefe Emotionen weckt. Tokyo Story ignoriert die Momente, die andere Filme gesucht hätten: Die grossen Kino-Szenen. Er will nicht unsere Gefühle verstärken, sondern Verständnis erregen. Tokyo Story erreicht das in einem Masse, dass ich nahezu während des gesamten Finales heulen musste und mir sicher war: Ja, dieser Film kann uns ein wenig Erkenntnis bringen und einige Schritte weiter weg führen von unseren Fehlern! Die Charaktere sind universal angelegt, fast scheint es so, als blicke man in einen Spiegel. Ozus Drama stellt unsere Natur bloss. Es ist nicht einfach so, dass wir uns von unseren Familien entfremdet hätten. Wir verschanzen uns vor ihnen, um uns den Fragen des Lebens nach Liebe, Arbeit und Tod nicht zu stellen. Doch diese Flucht in Floskeln und Ablenkung - ein japanischer Film, der mittlerweile über 60 Jahre alt ist, deckt das alles auf! Ozu erweist sich nicht nur als grosser Regisseur, sondern auch als erfolgreicher Lehrer, denn sein Film wird zum Freund. Tokyo Story eröffnet mit bittersüsser Musik, die aber nie zum Zweck eingesetzt wird, unseren Affekt zu erhaschen. Ozu liebt Wolken, Rauch und leere Strassen, wie kein anderer Regisseur erweckt er mit jeder Einstellung meine Zuneigung. Seine Kamera bewegt sich fast immer auf Augenhöhe der Protagonisten und wird nahezu nie bewegt. Jede Einstellung wirkt wie eine eigene Komposition, fast möchte man sie als Bild rahmen. Ozu liebt die Stille, Bewegung wird immer nur durch die Figuren erzeugt. Der Grossvater lächelt viel, wenn er zuhört - schliesslich antwortet er \"Ja\". In seinem Blick aber sehen wir, dass das Gesagte nicht dem entspricht, was er meint. Vielmehr spüren wir, wie er sich davor schützt, seine wahren Gefühle zu offenbaren. \"Ja\" drückt auch die Reue darüber aus. Manchmal entdeckt Ozu Details im Bild wie die wunderschöne Teekanne. Fast ist es so, als ob die Kamera sie gefunden hätte und nun präsentiert. Wenn die Familien-Mitglieder beisammen sitzen, sehen wir meistens mehrere im Bild. Gefühle werden in ihren Gesprächen verschlüsselt, selbst übertriebene Bekundungen sind nur zum Zweck des Verbergens da. Während des Begräbnisses der Grossmutter versammelt sich die Familie und wieder sehen wir sie vor uns - in einer Reihe. Diesmal aber sind ihre Tränen echt. Chishu Ryu als Grossvater beschliesst den Film: Alleine zu leben wird sehr schwer für ihn werden, die Tage werden sehr lang sein.  mehr auf cinegeek.de",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is an honest, bittersweet tale of compassion found in a generation gap. It is visually distinct and has the honor of being one of the best movies of Japan's golden era.",
            "review_date": "2015-12-19",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is such a unique and emotional movie filled with relevant themes honestly depicted, likable and realistic characters, superb performances and such a fantastic directing from Ozu and brilliant cinematography. Its pacing is sluggish, but it is a fascinating and even an artistic experience that is emotionally rewarding and visually beautiful to behold.",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "What more can be said about this film? Well, saying it's the unqualified masterpiece of all Asian cinema is a start.",
            "review_date": "2015-09-06",
            "source": "rt"
        },
        {
            "content": "Foreign cinema at its absolute best",
            "review_date": "2015-08-25",
            "source": "rt"
        },
        {
            "content": "Bitter truth about family bonds, but didn't engaged me as much as I expected.",
            "review_date": "2015-08-12",
            "source": "rt"
        },
        {
            "content": "Beautiful, sad and wise. One of the greatest films of all time.",
            "review_date": "2015-07-21",
            "source": "rt"
        },
        {
            "content": "I always find movies that are deemed 'classics' to be quite fascinating. Some films have truly stood the test of time and still remain as relevant today as they were in their own time. Inevitably, some of these films are not always the most popular among the general audiences, being treasured primarily among film historians and directors. When I got round to watching Tokyo Story, I have to say, I didn't see what all the fuss was about. Yes, I completely understand the films messages, and its theme of familial estrangement is a topic that will never cease to be relevant. But the truth is I've seen other movies that address this issue much better, most notably would be the Jack Nicholson drama About Schmidt. Even in the movie Birdman, despite it being something of a sub-plot, it was more resonant and affecting because in both of these cases I felt much more of a connection to the characters who experience these feelings. The pacing in Tokyo Story is far too leisurely, and while some of the dialogue is very poignant and even quite melancholy, most of the actors don't look sad or disappointed, they look bored. When you combine this with the camera-work, which is to say that it never moves during a scene, simply cutting back and forth and filming from near the ground, the film achieves virtually no fluidity or forward momentum. Maybe this is intentional, and is supposed to put us in the main characters state of almost living purgatory, but it made me feel like I was watching a wooden, poorly acted and clumsily assembled set of clips taken from a handful of cameras a person had simply left round their house to film whatever was going on. It may be regarded by many as a masterpiece, but it's not a film I'll be watching again anytime soon.",
            "review_date": "2015-07-21",
            "source": "rt"
        },
        {
            "content": "???????\"?\"?\"?\"?????????????????????????",
            "review_date": "2015-07-12",
            "source": "rt"
        },
        {
            "content": "This film reflects the essence on the importance of a family member, especially the parents. It reminds me of some soap opera on some Asian TV shows. But the story is so heavy with a dark drama element that you will remember for a long time. The only problem I have with the film is the interaction between the characters as they look at the cameras. It is kind of weird to me. But beyond that, every performance is fantastic. I love how Ozu made a family oriented drama traditionally in a Japanese way. Definitely a must watch. Lesson learned, treat your mother, father, brother and sisters as long as you still live with them and see them happily alive. 4 out of 5 stars.",
            "review_date": "2015-06-03",
            "source": "rt"
        },
        {
            "content": "Ozu's character studies are unlike anything in cinema. These films will resonate in your psyche long after the film ends.",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "One of cinema's most cherished pictures. A japanese tale, that is oddly enough, similar to tales we hear of in America. This movie fascinatingly studies the inevitable separation of families, and the inevitable painful regret one could have after a parent's death. This is a deep character study. I feel like a uncultured fool for saying this, but at times, it just seems uneventful. A lot of dialogue, and not a lot of action. Some of the shots are amazing. I appreciated the camera work in some of the conversation scenes, with the camera placed at ground level. Very complimentary of the Japanese custom, and very clever of Ozu to structure the image as such, in such a talky film. All in all, keep a very sharp attention span throughout, or you will be very agitated. It's a film worth giving a chance, namely through it's notoriety alone.",
            "review_date": "2015-04-01",
            "source": "rt"
        },
        {
            "content": "Gives your moral compass a sturdy shake; which deserves a 4 star recommendation.\nBut I have to be honest; there was something about the film that stopped it from being a personal favorite. I have yet to mentally verbalise why. When I do I'm sure I'll write it here.",
            "review_date": "2015-03-04",
            "source": "rt"
        },
        {
            "content": "Instead of sensationalizing everyday life it portrays it so accurately that the smallest events take on enormous significance. This might be the first film I've ever seen that portrays the death of a family member correctly.",
            "review_date": "2015-02-21",
            "source": "rt"
        },
        {
            "content": "The omission of Ozu's oeuvre is definitely an unerring embarrassment for any movie aficionado, thankfully TOKYO STORY comes to my rescue, presumably Ozu's most renowned work, tellingly it merits all kudos it gets, gracefully scrutinising the post-WWII mental disposition of Japanese people, and quietly tearjerking in eliciting recollections and rumination between parents and their children. Parenthood is not for everyone, but we all have parents, we forever hold a sense of regret towards them, especially in the oriental culture, filial piety is the foremost virtue to measure an individual's worth, at least viewed by other family members.\nkeep reading my review on my blog: http://wp.me/p1eXom-1Oy",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "A very moving drama about an elderly couple and their selfish children. Yasujiro Ozu never moves the camera once and everything is shot at a low, sitting angle. Important events happen off-screen and we are told, like most of the character about it through dialogue. There is great characterization and it is one of those movies that doesn't need to be flashy to tell a great family drama.\n\nGrade: A",
            "review_date": "2015-02-08",
            "source": "rt"
        },
        {
            "content": "The most intimate family drama around, Ozu's film is simplicity personified: an elderly couple visit their children and grandchildren, become a burden, go home and then the grandmother gets ill. What kidnaps your attention in Tokyo Story is a smile, a sigh, a well-timed look of defeat. Tokyo Story is often called a masterpiece with very good reason. The cast do an excellent job, managing to make you feel all the more emotional by saying nothing at all. Ozu also uses the back drop of Japan to wonderful effect, exaggerating the coldness the parents feel from their children. It is the most stylish cinematic experience imaginable, defined by a low static camera, random facial close-ups and unique use of sound. Much more soulful and engaging than its arthouse rep suggests, Tokyo Story is a tender, tragic and transcendent picture of old age ignored.",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "This film reflects the essence on the importance of a family member, especially the parents. It reminds me of some soap opera on some Asian TV shows. But the story is so heavy with a dark drama element that you will remember for a long time. The only problem I have with the film is the interaction between the characters as they look at the cameras. It is kind of weird to me. But beyond that, every performance is fantastic. I love how Ozu made a family oriented drama traditionally in a Japanese way. Definitely a must watch. Lesson learned, treat your mother, father, brother and sisters as long as you still live with them and see them happily alive. 4 out of 5 stars.",
            "review_date": "2014-12-04",
            "source": "rt"
        },
        {
            "content": "This timeless masterpiece of cinema, elegantly delivers a profound message to its audience in such a way that everyone will be able to identify with the themes dealt with in this beautiful piece of art. Simply perfect!",
            "review_date": "2014-11-26",
            "source": "rt"
        },
        {
            "content": "Was this an artistic film? yes. Did it share some good insight into aging? Yes. Was it interesting? No and there in lies my main problem with the film. Its told at a snails pace with little to no emotion or dialogue. The movie seriously needed some editing with half of the scenes being way too long. It makes me wonder if Japanese people are still like this. What i mean is they make Japanese people seem very cold, emotionless, stiff, and quiet. I cant imagine them being like this still today, but it makes me wonder. The wooden acting and script certainly didnt help make the movie more interesting. Also while you do distance yourself from ur parents after a certain age, i found most of the children's behavior mean and rude to their elders. This confused me because I thought Japanese treated elders better than us. An overrated and overlong film-the type u fall asleep to.",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "There is a still grace that permeates every frame of this drama about aging. This stillness of camera reflects the film's view: that just because our lives are often full of repetitions and monotony, that doesn't mean they can't be filled with beauty. In this stillness, there is a recognizable family, full of emotionally honest performances and melancholy humor that is birthed right of the reality of the story. Stunning, bleak, yet utterly true.",
            "review_date": "2014-11-19",
            "source": "rt"
        },
        {
            "content": "O drama de uma velhice que, não conseguindo acompanhar o movimento das novas gerações, jaz estagnada e abandonada por seus descendentes.\n\nLeia mais: http://cinema-mon-amour31.webnode.com/news/era-uma-vez-em-toquio-%28tokyo-monogatari%29%2c-de-yasujiro-ozu-%28japão%2c-1953%29/",
            "review_date": "2014-10-19",
            "source": "rt"
        },
        {
            "content": "This film has a strong reputation as one of the classics of cinema but I'm not sure I see what all the fuss is about. The basic idea is that a family is falling apart, but it doesn't seem to have anything else to say other than what a shame that is. I was expecting some hard-hitting social commentary or a detailed character study. Not a bad film, but I feel it's rather overrated.",
            "review_date": "2014-10-06",
            "source": "rt"
        },
        {
            "content": "An impressive achievement of character development and composition.",
            "review_date": "2014-10-01",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is one of the greatest dramas to come out of Japan, its emotional performances, thought provoking script, and great direction from Yasujiro Ozu influencing many movies to be made after, and many movies to still be made.\n\nFull Review: http://www.movie-blogger.com/movie-review/amazingly-emotional-and-relatable-film-classic",
            "review_date": "2014-09-23",
            "source": "rt"
        },
        {
            "content": "This film is an absolute masterpiece, from one of the all-time greatest directors, Yosujiro Ozu.  I hadn't seen it in years, and it was great to see it again in Blu-ray.  It follows an elderly couple who travel a great distance to visit their children in Tokyo, who seem ungrateful and treat their parents as a nuisance.  A simple and beautifully told story about family relations that anyone can relate to.  A MUST watch!",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "An exceptionally well told story of the passing of time, and the importance of embracing each second with your family while you have them with you.",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "A beautiful film about the ever-changing nature of life and a people on the mend after the cataclysm of World War 2. This exploration of life's unpredictability and the consequent generational discord is treated solemnly, but with a warm sense of understanding that permeates the screen. The characters are often distraught by the hand they have been dealt, but they seem to have an odd grasp of it. Pain and joy often come hand in hand and Ozu magically captures this push and pull between happiness and sorrow flawlessly. He also succeeds in making these grand statements about change, death, selfishness, guilt, generational disputes, and life's disappointing continuity, without feeling too didactic. On top of these qualities, the way Ozu plays with space is something I have never seen before. Even in the most intimate of places, we can become disoriented. Although we often take the same steps over and over again, life is always a labyrinth of constant change. Like Kurosawa's Stray Dog, Ozu also focuses on the oppression of the heat. From the kids worrying about how to get rid of the parent's burdensome visit, to the Grandparent's trip to a spa meant for a younger generation, each character clutches a fan, attempting to comfort themselves from the uncomfortable atmosphere. It is just one of the many symbols of a people trying to do what they can to cope with such a tentative existence. I can see why this film has been raved about over the many decades since its initial release. It's message is timeless, but the approach feels so fresh. It is an outstanding film and one that should not be missed. A+",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "Utterly heartbreaking and beautiful in equal measure. This is one that everybody should watch.",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "nothing short of a brilliant masterpiece by Ozu. Truly the best work from the master himself. Knee level cinematography and director slowly narrates the family values one has to overcome during old age. Loved it",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "Ozu's Tokyo Story is wholy naturalistic, it typifies the mood of becalmed acceptance that distinguishes his work from other social critic directors. The photography, performances and script are all massively understated which makes for a film very demanding of it's viewers' patience. Only one shot in the film moves and even that is one that tracks with inconspicuous slowness, but while this may not be the most dramatic or even entertaining picture to come from 1950s Japan, it is certainly one of the most incisive, carrying great emotional and philosophical weight.",
            "review_date": "2014-05-06",
            "source": "rt"
        },
        {
            "content": "Summed Up By The Short Conversation Near The Start Of The Film As The Parents Arrive, Amazed They Could Travel So Far To Tokyo In Such A Short Tune; \"Yesterday We Were In Onomichi, Now We're Here...I'm Glad To Have Lived To Thus Day, The World Has Changed So Much Now\", \"Yes It Has Mother, & You Have Stayed The Same\", \"No We Have Changed Too...We're Old Folks Now..\"...2-Hours Later The 'Oldies' Are Left To Just Disappear As The Kids Move On, All Too Busy. A Meaningful Story With Universal Themes Of Family Time Vs Pursuing Life & Personal Goals, Ultimately Not For Everyone Cos It Also 'Got Old' & Out- Dated, But Worth It If You Put In Some Time.",
            "review_date": "2014-04-27",
            "source": "rt"
        },
        {
            "content": "Um casal de idosos vem a Tokyo visitar seus filhos, mas eles não têm tempo de recebê-los. O choque de gerações é intensificado pela origem rural dos pais, que não conseguem entender o ritmo frenético da cidade grande. É um drama lindo, especialmente pela positividade e humildade do casal de idosos.",
            "review_date": "2014-01-12",
            "source": "rt"
        },
        {
            "content": "A moving, emotional story about a retired elder couple (Chishu Ryu, Chieko Higashiyama) who visit their children in Tokyo, only to be greeted coldly and as if they are not wanted, for unknown reasons. A tough, difficult, but ultimately frighteningly realistic portrayal of how parents are treated as being a \"nuisance\" as they get older, and how when their children grow up, they view them as a potential hindrance for them accomplishing and maintaining their adulthood. It is a slow-paced movie, very slow, but it is done so in order to show the importance of a long life lived well, in this case the parents of this family. The last half hour is heartbreaking and hits home for me concerning when I lost my grandmother rather suddenly and unexpectedly, so this film definitely has a piece of my heart concerning the topic of parents/grandparents and how we can sometimes, unfortunately and often unintentionally, not show them the love they deserve to have at all times.",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "Sensitive modern classic.",
            "review_date": "2014-01-04",
            "source": "rt"
        },
        {
            "content": "Aloof, but effective.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "One of the first foreign films that I have seen in entirety.  I figured that this would be the best place to start since I am half Japanese.  I was not disappointed by this film it's beauty  and emotion was infused into the entire movie.  The director Ozu builds up this bottled emotion until it bursts onto the screen.  Beyond this the movie takes a look at relationships between spouses, mothers, fathers, children, and grandchildren.  Thats why I believe the movie has held on so well is because it will always be a relevant subject.  Ozu gives brutal honesty of the way of live, while also telling us to treasure the time that we have on Earth with the people we love.",
            "review_date": "2013-12-19",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is a very demanding drama that requires the utmost attention and fullest patience of the viewer. Unlike many other dramas, Tokyo Story is a drama that requires the viewer to pay attention to every expression, every mannerism of its characters, every scene, and every line of dialogue to fully appreciate the scope of the film. It's a superb drama that is for anyone who enjoys a good serious drama that really makes the viewer think, rather than bombard them with what emotions they're supposed to feel. It's a very restrained and meticulous film like someone sharpening a blade to perfection, but when that blade is sharpened, it cuts deep, which is exactly what this story does. It's a film about changing times, changing attitudes through generations, love, loss, and many other themes. It's a film that will hit the viewer like a sack of bricks, if you pay attention, that is. If you don't follow it carefully and give it the attention it requires, it will leave you behind and you will flatly dismiss it as a bad drama because you weren't careful. It's a marvelous film that really makes the brain think about different things and it's a true masterpiece of cinema that should be more widely appreciated. If you love a good art house drama, Tokyo Story is not one to miss.",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "This slow-burning masterpiece about the drifting apart of the generations, time's inexorable passage, and one woman's struggle to overcome her repression, is one of the two or three best films of all time.",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "As a viewer from the eastern culture, to me, this is quite general interaction between the family members as well as between the generations. Not a bad film as the pace and all settings are just right, but a bit over valued as there could be more things to be described than this ordinary story line.",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "Film as art that inspires one to be a better person--and also, maybe call your parents more often.",
            "review_date": "2013-10-27",
            "source": "rt"
        },
        {
            "content": "A masterpiece. Arguably the finest film of the 1950s.",
            "review_date": "2013-10-12",
            "source": "rt"
        },
        {
            "content": "Ozu's long shots, knee-high camera placement, and collapsed perspective -- as gorgeous and unsettling as a Cézanne -- gather power over the duration, but time itself is the master's most potent weapon.",
            "review_date": "2013-10-01",
            "source": "rt"
        },
        {
            "content": "By examining the subtleties of the everyday, Ozu achieves a sense of grandness and a certain emotional power not seen in many films that all result in a poignant critique on the disintegration of family.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "Yasujiro Ozu admitted to having been inspired by Leo McCarey's film Make Way for Tomorrow when making his domestic drama masterpiece Tokyo Story. Yet, the two films are different though both are magnificent and harrowing in the way they deal with their relatively similar stories. Ozu's style is simplistic in both cinematography and mise en scene - the camera remains still and doesn't move much. However, aided by some great acting, the emotional charge of the melodramatic situation is heightened in a very sensible and genuine way, which makes Tokyo Story's message of humanity and family thankfulness all the more harrowing and emotionally compelling.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "It's slow and hard to get excited about but as the end nears it starts to get a little more poignant as you've built up a fondness for some of the characters. Nice to see how people were in 50's Japan though.",
            "review_date": "2013-08-25",
            "source": "rt"
        },
        {
            "content": "In a calm, simple, and noble-minded movie, Ozu shows where the purest sentiments rest. A marvel of sociology.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "I decided to watch this movie merely by it's placement on the most recent Sight and Sound poll. I knew literally nothing about the plot and while it's hard to call this an \"exciting\" movie I ended up getting caught up in it nonetheless and moved by its message of treasuring your parents while you still have them.\nThe slow pace is definitely not for everyone and some of the acting is static but its hard to resist that emotional punch.",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "Aside from the story and direction, the use of black and white, framing, music were well-executed. It's one family drama that you should watch. I wonder whether Kore-eda took inspiration from this film for his movie \"Aruitemo, Aruitemo\" (Still Walking)\n\nOne of the memorable lines was \"Isn't life disappointing?\"",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "This 1953 movie is considered to be the best work of Japanese director, Yasujiro Ozu.  Director Ozu died in 1963.  This film came to the US in the early 1970s on dvd.  Ozu made films that explored the lives and relationships of ordinary Japanese citizens.  The movie is shot in black and white.  Some have listed this movie amongst the 100 best films ever made.  So, I decided to check it out.\n\nThe story is well done.  It held my interest.  Im not certain I would consider it in the list of top 100 movies.  Although, all of the principal actors were competent; none of them stood out for me.  There is an English language commentary included on the dvd by a film historian.  The commentary was very interesting and helpful in understanding and appreciating the film.\n\nIt was a worthwhile, at-home, trip to the flics.  This is a movie for film fans who also have an interest in, and appreciation of, Asian culture.",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "Behind the platitudinous pleasantries we express to our families & our loved ones, the painful loneliness of mortality is always looming over us. Youth is forever busy as the elderly are brushed aside.\nThese are the undercurrents of this powerfully depressing film about a couple visiting their grown children in the city just one last time. Even the tragedy of death cannot hinder their bustling lives, these ungrateful children.\nThe composition of this film is amazing with dialogue spoken directly to the audience, as if to involve us intimately in the slow death of time. Our view is always slightly skyward, always slightly hopeful that love will prevail. \nLife, like this film, has a funny way of keeping us grounded.",
            "review_date": "2013-07-02",
            "source": "rt"
        },
        {
            "content": "I don't know whether it's a cultural difference or something else, but Tokyo Story seems odd and stiffly acted, and it is therefore hard to appreciate it in the same way as many critics do. However, subtlety and a thematic road less traveled provide something that is able to be followed throughout the picture.",
            "review_date": "2013-07-02",
            "source": "rt"
        },
        {
            "content": "Perfect movie!!! \n5/5",
            "review_date": "2013-06-27",
            "source": "rt"
        },
        {
            "content": "A quiet masterpiece, never over acted, not a single scene out of place. Directed with so much restraint, striving to keep the story in the fore, the film aims not for singular moments, but in pushing its entirety to triumph.",
            "review_date": "2013-06-10",
            "source": "rt"
        },
        {
            "content": "Perhaps has the best cinematography ever made",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "Director Yasujiro Ozu quietly examines the outer layer of manners and customs which in turn insulates and isolates a post-war Japanese family. Ozu's solitary knee-high camera position (kneel and shoot) invites us to look up and beyond the polite bows and guarded conversation to the raw emotion that circumstance has forced to the surface. The final farewell scene with sister-in-law Noriko (Setsuko Hara) and youngest daughter Kyoko (Kyoko Kagawa) cries out for human contact yet we are rewarded only with a simple clasping of hands. \n\nThe original title \"monogatari\" refers to the ancient Japanese literary form, telling us so much more than the English  \"Story\". Perhaps \"Tokyo monogatari\" should remain the title in any language. \n\nOzu explains very little and offers us everything with this profoundly introspective master work.",
            "review_date": "2013-06-04",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is a beautiful, emotionally devastating film that really shows a side of society that immensely disappoints me. I guess you can say that I developed an instant personal connection to this film, since I've witnessed similar situations. Having to go through the immense lost of my grandfather (who was not only my grandfather, but someone who I can call my dad and my best friend) and knowing for a fact I will be missing him for the rest of my life until I die, I felt greatly disgusted by how a lot of the children in the film treated their parents. I come from a culture where we would NEVER put our parents or grandparents in an old person's home, and we would be more than willing to take care of the people who raised us just the same way they took care of us. If I have to make sacrifices in my job and my me time, then I would make no hesitation, because I LOVE, as well as RESPECT my grandparents/parents. Whatever differences we may have wouldn't even matter and in the end it never did. Not to trying to tell anyone how to live, but I think that showing some compassion and respect towards the people who did a lot for you shows a lot of character. My grandfather may not be with me now, but to know that I did the best that I could to make him happy and not feel alone gives me a sense of comfort in knowing that he was happy.\r\n\r\nWe unfortunately live in a society where we all are too busy and have places to be, and it sometimes cannot be avoided, but once we deliberately start to distance ourselves from people, then it becomes a problem, especially for the people we should give more time and attention to. This is the me generation, and we are flooded by technology and corporations trying to exploit many aspects of our lives, which dilutes so many of the basic, yet most important aspects of our humanity. A film like this just goes to show that our so called leaders in society don't put much of an effort in influencing us to stay connected or in at least trying to create outlets that will bring us closer as humans. Instead we live in a system that brings out selfishness. While life can be at times unrestrained in its cruelty, at least we have movies like 'Tokyo Story' that shows a sense of humanity in its most raw and purest form. I like to watch films to escape, but especially ones that show an utmost honesty about our society and what 'Tokyo Story' says to me from watching it is that while life is beautiful and still worth living, it can still be immensely disappointing. What makes Tokyo Story such a strong film is that it brings out the harsh reality that exists in our society, in that many people don't put in any effort to maintain the strength of a bond towards their family. What's the point of being part of a family if that person doesn't even have the heart to set things aside to spend time with their parents?\r\n\r\nThe fact that this film can tug at many people's heart strings goes to show just how much this film is an emotional punch to the gut, in that it shows aspects of human nature that is far reaching and universal. While Japan is one of the many diverse cultures in our world, we still share many of the same issues that can exist in any family relationship. Any film that make me feel this much empathy for its characters is something special and 'Tokyo Story' is that special film.",
            "review_date": "2013-06-03",
            "source": "rt"
        },
        {
            "content": "I have not cried so hard in a while, thanks to Tokyo Story, I was able to experience the  raw and powerful drama. The premise is simple, an elderly couple visiting their children in the big city, but their children do not have time to serve them except for their daughter-in-law, who showed them unconditional kindness and yet not related by blood. Ozu used the still camera technique which created the quietness and the low angle shots allowed the viewers to observe the characters in great detail. The set was brilliant, it fully presented the post-war Japan. The dialogue was amazing, pure and honest. Tokyo Story is a must see for anyone",
            "review_date": "2013-05-18",
            "source": "rt"
        },
        {
            "content": "Monday, May 13, 2013\r\n\r\n(1953) Tokyo Story\r\n(In Japanese with English subtitles)\r\nDRAMA/ SOCIAL COMMENTARY\r\n\r\n  Co-written and directed by Yasujirô Ozu focusing on a particular situation anyone can relate depicting a time if parents ever felt unwanted by their already grown up children and their families.  Two elders, Shukishi Hirayama (film veteran Chishû Ryû) and his wife Tomi Hirayama (Chieko Higashiyama) visiting Tokyo to see their already married son and daughter and their grandchildren.  But upon their visit saw them as a burden to their busy lives even after not seeing each other for a very long time.  It's realistically poignantly portrayed despite the time and setting. \r\n\r\n4 out of 4 stars",
            "review_date": "2013-05-13",
            "source": "rt"
        },
        {
            "content": "A classic and sentimental  family drama.",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "A classic from Director Ozu. Typical demonstration of Ozu's movie style and how he use the camera. For those who does not live with their parents, they may want to have a phone call immediately to their parents after watching this movie.",
            "review_date": "2013-04-18",
            "source": "rt"
        },
        {
            "content": "Anyone who watches this movie will invariably reflect on their own relationship with his/her own parents and seek to make it better.  Worth watching just for that reason alone.",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "An incredible observation of human nature.",
            "review_date": "2013-04-01",
            "source": "rt"
        },
        {
            "content": "Deep waves of emotions inside these peaceful pictures.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "solemnly shot in fixed frames, laconic but revealing, contains behavior that can be unfathomable for the average western joe but it appears to be sincere and honest, no pink colored glasses. The subject is difficult, and the story makes the most of it in only 130minute",
            "review_date": "2013-03-14",
            "source": "rt"
        },
        {
            "content": "Brilliant and timeless masterpiece that transcends place and time.",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "When you see this movie, you know... It's a amazing masterpiece.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "Each scene is like a painting, very beautiful. It was more than 25 years ago when I watched this movie at first time. It is a good movie.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "A simple story with a powerful effect. You never quite appreciate the family in your life until they're gone, and even if you're not a blood relative, you can still take the time to make someone feel special and loved.",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "The first hour was riveting. But then, by the second half, it was as if Ozu did not know where to further his story any more. The film took several weird turns, many of which are undeveloped, or ideologically questionable. Still though, there is something memorable to take away: \"Isn't life disappointing?\" I think this is the most famous quote from Tokyo Story. However, whether this line is justified is questionable, given the thinness and plainness of the characters.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "Perhaps I will come to respect it more as I grow older. But for now, this isn't the right film for me.",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "(Watched Sat 29 Dec 2012) Still one of my favourites, I can see its flaws clearer now, certainly - it's overlong; the coda is too drawn out with unnecessary exposition at odds with its earlier subtlety; and the characters veer into archetypes more than real people - but it's still a beautiful, powerful film.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "This is one of my favorite movies i was so enthralled by its calm story of two grandparents visit to Tokyo.",
            "review_date": "2012-12-20",
            "source": "rt"
        },
        {
            "content": "mukemmel bir film. hiç yapayliga kacmadan o kadar iyi yansitmiski duygulari... ve gercekleri...",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "After finally getting a chance to see more classic Japanese films I've realized a reoccurring and successful formula; keep it simple. Now I mean that in all respect because simplicity means nothing about how powerful a film can be, and Ozu's Tokyo Story is powerful in its simplicity. This is my first of Ozu's films but he really seems to be a worthy of the title of a master filmmaker. His framing and composition of shots are beautiful. Now in terms of the narrative it simply is a family drama but one that it is so powerful in its familiarity. A film that has a slow pace and that may not be appreciated outside of film buffs, but for anyone who truly wants to see how the medium at its most humane, look no further.",
            "review_date": "2012-12-02",
            "source": "rt"
        },
        {
            "content": "This critically acclaimed Japanese film directed by Yasujiro Ozu has a relatively simple plot having to do with a kind elderly couple going to Tokyo to visit their adult children and extended family. They are excited to see the big city but it is not quite like they had expected. Furthermore, all their relatives and family have very busy lives making it difficult for them to spend time with the couple. The eldest son who is a doctor and then a daughter who owns a salon decide to send their parents off to a spa. Unhappy, the elderly couple return to Tokyo but they feel like they are imposing. Finally, the two of them head home and there the wife becomes ill. Because she is dying, her children do decide to visit. However, after she has passed away it seems they all too soon forget her and go on with life. This film is an interesting study of the void between generations. It also uses realism and focuses on the manners of the Japanese without fully criticizing them.",
            "review_date": "2012-11-21",
            "source": "rt"
        },
        {
            "content": "Che dire? Un regista unico. L'inventore dell'inquadratura \"ad altezza di cane\", idelae per la rappresentazione della vita negli interni giapponesi, con la macchina da presa piazzata lì, immobile, senza un solo movimento. Poi ci sono le storie. storie familiari. Tokyo Monogatari insegna che è la gente dal cuore nobile ad amarci e non necessariamente le persone a cui siamo legati dallo stesso sangue. E chi guarda piange. anche se nel film si piange davvero poco, senza il sensazionalismo del cinema occidentale, ma con una pacatezza quasi. magica. E' cinema vero. E' il più giapponese dei registi giapponesi.",
            "review_date": "2012-11-16",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is quite possibly the greatest film ever made.",
            "review_date": "2012-10-30",
            "source": "rt"
        },
        {
            "content": "overrated by pretentious critics, it uses some clever devices and is subtle in representing contemporary Japanese family life eroding away. However static dialogue and often boring segments really effect the audiences enjoyment.",
            "review_date": "2012-10-17",
            "source": "rt"
        },
        {
            "content": "Good, but I was expecting more from the \"greatest film of all time.\"\n\nhttp://popwatch.ew.com/2012/08/01/sight-and-sound-greatest-films-poll-citizen-kane-vertigo/",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "One of the greatest films of all time.",
            "review_date": "2012-10-02",
            "source": "rt"
        },
        {
            "content": "no wonder it was called Yasujiro Ozu masterpiece. With simple massage and cinematography, delivers  a very touching and humanly stories.",
            "review_date": "2012-09-24",
            "source": "rt"
        },
        {
            "content": "Really nice. Even the most quoted part is \"  Isn't life disappointing?/ Yes, it is.\" my fav was: you can't take care of your parents when they are in their grave .",
            "review_date": "2012-09-22",
            "source": "rt"
        },
        {
            "content": "Yasujiro Ozu has created a truly one-of-a-kind film. Because of its uniqueness, Tokyo Story's simple family drama and elegant cultural statements puts this film on the \"Best Films Made\" list. Could words really describe the value behind art film?",
            "review_date": "2012-09-18",
            "source": "rt"
        },
        {
            "content": "Thought it was an ok film, with Ozu trying to get empathy for the mother and father which in a sense works. Film didn't have that kicking edge for me though.",
            "review_date": "2012-09-13",
            "source": "rt"
        },
        {
            "content": "a powerful Japanese drama about   expectations and what life really is , well done Ozu",
            "review_date": "2012-09-11",
            "source": "rt"
        },
        {
            "content": "Director Yasujirô Ozu has made a beautiful, slow film, free of sentiment. He uplifts cinema as a whole by showing how it might move us, implore us to be better people.",
            "review_date": "2012-09-06",
            "source": "rt"
        },
        {
            "content": "Not the Cry Fest I assumed was coming, but a masterpiece among masterpieces. Very sad but very understated in the best Ozu fashion. The grown children are not the nicest but you can understand their predicament. Setsuko Hara saves the day once again. I love Setsuko Hara.",
            "review_date": "2012-09-02",
            "source": "rt"
        },
        {
            "content": "Its incredible how much can happen in a story where nothing seems to happen.",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "The greatest movie I have ever seen.",
            "review_date": "2012-08-30",
            "source": "rt"
        },
        {
            "content": "Delicato, intimo, profondissimo, zen. Grande film.",
            "review_date": "2012-08-29",
            "source": "rt"
        },
        {
            "content": "One of the greatest films ever made.",
            "review_date": "2012-08-25",
            "source": "rt"
        },
        {
            "content": "average and overestimated",
            "review_date": "2012-08-24",
            "source": "rt"
        },
        {
            "content": "Considered a cinematic masterpiece, late director Yasujiro Ozu's \"Tokyo Story\" is a deeply affecting tale of an ageing couple's visit to see their four children.\n\nIn black and white and with a usually motionless camera, Ozu followed an unforgettable holiday of father and mother Shukishi and (Chishu Ryu) and Tomi Hirayama (Chieko Higashiyama) from the seaside to the city.\n\n\"It's like a dream being in Tokyo,\" says Tomi, having arrived by train; one which quickly becomes a nightmare.\n\nThe partners' children become frustrated with having to entertain. Their eldest daughter Shige is particularly disdainful (Haruko Sugimura) - a testament to the actress' portrayal of the character - and tries shipping them off to a resort, encourages her brother to buy them cheaper food and uses her widowed sister-in-law Noriko (Setsuko Hara) as a local tour guide.\n\nThe dignified, timid and unassuming Hirayama seniors never vocalise their pain, but events often result in their heads simultaneously pointing south as they realise their children have become utterly egocentric. It takes 122 minutes until a family member uses the word 'selfish'.\n\nNoriko, however, is a doting daughter-in-law; they share a gentle bond over their lost husband and son. Contrast, instead of overpowering dialogue and drama, is the main storytelling tool.\n\nThemes of regret, bereavement, friendship and family are explored slowly, but never painfully so, in this gripping journey. Sixty years have passed since this film was made. Its meaning is timeless.",
            "review_date": "2012-08-23",
            "source": "rt"
        },
        {
            "content": "One of the best movies i've seen to this date . Chishu Ryu's performance was just heartbreaking .",
            "review_date": "2012-08-22",
            "source": "rt"
        },
        {
            "content": "For a film that started slow, and pretty much put me to sleep in the first hour, it sure brought it all back around in the second half. Which, in turn, makes the first half not as bland as it appears to be. \nWe have a simple story of an elderly couple from a smaller outlying village going to visit their children in Tokyo. We find out what all the children(who are all grown adults with lives of their own now) do for a living, and how they handle having their parents in town. \nThe parents are basically stand ins for all of our parents. Sure, this is a story that takes place in Japan, but it could be happening anywhere in the world. It's a human story, not a geographical one.\nThe whole story has a tinge of melancholy to it. The parents realize that their children have gone on living without them, and have very busy lives, which makes them feel almost intrusive. \nEventually, there is a tragedy that occurs, which brings them all together. I could not help but think of my own life and family, with our own tragedies, during these sequences. It really hammers home how, at the core of it, we all want the same things. A family that is there for each other when it matters, being one of those things. \nThis really is a sweet story, and a movie that I would recommend, but you must have patience. It starts slow and stays there. But as long as you are human, there is something here for you to relate to.",
            "review_date": "2012-08-20",
            "source": "rt"
        },
        {
            "content": "Very thought-provoking. It doesn't force anything, but in its visuals and simple dialogue it makes one consider the way he treats his loved ones. We are all \"too busy,\" or live too far away, to be there. This film reminds me that love isn't convenient. It's sacrificial and available. Great film. Slow, and not at all for the average viewer, but well worth watching and thinking about.\r\n\r\nWatched alone on the downstairs T.V. at 12:25 A.M. on Saturday, August 18, 2012. So it felt like I watched it on Friday the 17th, but technically it was the 18th. Not sure why I'm including that detail. I just want to clarify to my future self.",
            "review_date": "2012-08-18",
            "source": "rt"
        },
        {
            "content": "Yes, the film's styling is clearly dated but the story itself seems as timely as ever.  The tale of two aging parents finding that their busy children don't have time for them is something that many today will be able to relate to.  The storytelling is masterful, clean and crisp and almost matter-of-fact.  The brave faces that Shukichi and Tomi wear as their children shrug them off on each other during their family visit will break your heart.",
            "review_date": "2012-08-17",
            "source": "rt"
        },
        {
            "content": "gledati pod obavezno! ne moe se opisati snaga emocija i relanost ovog filma!",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "En \"Tokyo Story\" Ozu nos presenta una historia de manera clara y directa sin enfatizar el melodrama que probablemente otro director hubiera hecho. La camara se situa baja, casi en reverencia ante los acontecimientos ordinarios de sus personajes y en los momentos donde suceden cosas inesperadas, los personajes lo aceptan con dignidad y respeto. \n\"Tokyo Story\" es una cinta lenta que requiere de nuestra paciencia pero los personajes trascienden la pantalla y al final Ozu nos recompensa con una historia muy humana y emotiva que lidia con temas fuertes como las relaciones, el deseo y la muerte sin predicar ni exagerar sus emociones. Es una joya del cine.",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "The best foreign films are where one can follow its actions and appreciate it without relying too much on fluency in language. Tokyo Story uses dialogue effectively and fully, unlike most other great foreign classics, but just like them it dispenses with the need to understand that language at all. After all, its theme of the effect of urbanization upon parent-child relations was poignantly displayed, and I don't think even a lack of dialogue would have spoiled that level of poignancy. It departs from most of the norms foreign films of the like of the Apu Trilogy and Rashomon established, by showcasing urban affluence. All throughout the scenes of Tokyo - chimneys emanating smoke waste, apartments upon apartments in an urban jungle - were displayed using a deliberately slow camera pace. The metaphor of the parent-child separation, brought on by the complexities of urbanized living, did not pervade the rule, however, as an unlikely \"daughter\" - the widow of their war-slain son - showers them with ideal kindness not even proportionately meted out by their blood sons and daughters there, the youngest of whom arrives late even for his own mother's funeral. Overall it's a deeply felt film, produced to represent the social divide that would greet urbanization, and can indeed be applicable in any such country, not just in metropolitan Tokyo.",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "#3) Less is more to the extreme.  I struggled to adjust to the style of the movie at first, but once I did I was locked in to one of the most peaceful and heartbreaking movies I have ever seen.  I see how this is top 10.",
            "review_date": "2012-08-12",
            "source": "rt"
        },
        {
            "content": "As great as it is, it is sometimes tedious and overlong.",
            "review_date": "2012-08-06",
            "source": "rt"
        },
        {
            "content": "I Don't Like Yasujiro Ozu.",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "Will remain the crown jewel in the works of Ozu for hundreds of years to come. Arguably the most important film in Japanese cinema.",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "Not on the same level as Citizen Kane like it's often said to be, but still one of the greats.",
            "review_date": "2012-08-02",
            "source": "rt"
        },
        {
            "content": "undeniable verisimilitude, I suppose one has to experience the conflict that arises from a generation gap to genuinely grow into this film",
            "review_date": "2012-07-30",
            "source": "rt"
        },
        {
            "content": "We are selfish beings who ignore those around us ( especially the old and the young).",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is not incredible for how massive it is, but for how simple its story and characters are. These are snapshots from every day life put into a context that is thoughtful, powerful, and engaging. A true masterpiece.",
            "review_date": "2012-07-18",
            "source": "rt"
        },
        {
            "content": "Words cannot describe the quality of this film. It's understated, uplifting, heart-breaking, and triumphant all in the same breath. We care so deeply about the characters and their actions that we might be kneeling beside them, watching as their successes and follies unfold in front of us. I love the characters of Tokyo Story as I would love a second family, and so few films can claim to have accomplished that.\r\nA summary? How does one summarize the human experience? As to the film, all I can do is label it the greatest ever made.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "One of the best films I have ever watched. A heart-wrenching, pitch-perfect, well-acted and brilliantly written masterpiece by Ozu Yasujiro which successfully describes the change of Japan's values of family and filial piety.",
            "review_date": "2012-07-15",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2012/07/tokyo-story.html",
            "review_date": "2012-07-13",
            "source": "rt"
        },
        {
            "content": "All them trains. This one's real sad. Go watch it and cry into your hot dog.",
            "review_date": "2012-07-10",
            "source": "rt"
        },
        {
            "content": "It's difficult to put in words just how perfect Ozu's Tokyo Story is, or even to describe what, exactly, it is. It isn't like any other movie out there. Whether it's the simple-yet-unsettling camera placement, or the timeless, universal slice-of-life drama held within. It pulls emotion from its audience while subduing its own. It truly is one of the most remarkable films ever made.",
            "review_date": "2012-07-08",
            "source": "rt"
        },
        {
            "content": "Strong movie.. Describes the busy cities....\nRecommend.",
            "review_date": "2012-06-30",
            "source": "rt"
        },
        {
            "content": "Languid. Poignant. A calm observation of human nature without any sentimentalization and condemnation, using methods that Ozu mastered. Trying to express the depths of this masterpiece through words is a futile effort. A much more rewarding 2nd watch.",
            "review_date": "2012-06-02",
            "source": "rt"
        },
        {
            "content": "It seems a bit slow. but you really have to enjoy cinema to enjoy this. And maybe sit and think about what the movie is really trying to depict.",
            "review_date": "2012-05-31",
            "source": "rt"
        },
        {
            "content": "Director Yasujiro Ozu never moves the camera but communicates such poignant  themes of age and generational conflict through static framing. Just its distant placement communicates the feelings of detachment that the characters are going through. The simple story and slow pacing make the film an experience like we're living among these characters in postwar Tokyo. However slow the film may be, I was never uninterested in the lives of an elderly couple struggling to maintain connection with their children. Though they do see their kids (now all grown up), the only one who gives the couple thorough attention is their daughter-in-law, Noriko, played by Ozu regular Setsuko Hara. Noriko is impossible not to fall in love with. She has little wealth herself, but her giving deeds and kind smile make her one of my favorite female screen characters of all time. At the end when Noriko breaks into tears, afflicted by loneliness and convinced that she is not a decent woman, i nearly cried. A perfect film and one of my favorites!",
            "review_date": "2012-05-26",
            "source": "rt"
        },
        {
            "content": "I personally don't like classic Japanese films and this one did nothing for me.",
            "review_date": "2012-05-15",
            "source": "rt"
        },
        {
            "content": "Realism. This film was best shown by the line, \"Life is disappointing\". It is a simple story that paces itself for a somber and tragic build up. It captures the shortcomings of Imperial Japan. It also showed how people appear to be good, but in fact are not. Only those who truly are deserve better, but of course they don't always get it. This film is unique however in its presentation, and thus it is special.  1001 movies to see before you die.",
            "review_date": "2012-05-04",
            "source": "rt"
        },
        {
            "content": "One of the strongest contenders for greatest film ever made and one of the most moving.",
            "review_date": "2012-04-12",
            "source": "rt"
        },
        {
            "content": "The description of the movie I had read on the outset described the children as \"cold\", which I have to disagree with in my understanding of modern Japanese culture.  The parents were greeted respectfully, but in a distracted manner as the children were greatly preoccupied with their careers.  Still, it is telling that in the daily bustle of post-war Japanese society, they were less than willing to take time from their work to fully attend to their parents.  The family unit has indeed changed.  This is a beautiful film on the human condition, and it translates well across cultures.",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "Tokyo monogatori is an heartbreaking movie shooting with heart poetry and love showing the universal nature of man kind in a study of parent-to children relationship in the post war japan.A common family history told with an unique talent  with one conclusion and one only;To love and care about the people important to us before they leave us . This is yasujiro  ozu best and it is impossible for any viewer aware of the strength of Tokyo monogatori not to be move about it.This is art and definitely human study at his very best.",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "Needs to be seen by everyone who loves film. Not only because of how masterful the directing is, but how influential Japanese film has been over the years, particularly the films of Yasujiro Ozu.",
            "review_date": "2012-04-03",
            "source": "rt"
        },
        {
            "content": "Perhaps because of its unrelenting objectivity, Tokyo Story is one of the most heartrendingly evocative films ever put to celluloid.",
            "review_date": "2012-03-27",
            "source": "rt"
        },
        {
            "content": "A beautiful film about the ever-changing nature of life and a people on the mend after the cataclysm of World War 2. This exploration of life's unpredictability and the consequent generational discord is treated solemnly, but with a warm sense of understanding that permeates the screen. The characters are often distraught by the hand they have been dealt, but they seem to have an odd grasp of it. Pain and joy often come hand in hand and Ozu magically captures this push and pull between happiness and sorrow flawlessly. He also succeeds in making these grand statements about change, death, selfishness, guilt, generational disputes, and life's disappointing continuity, without feeling too didactic. \nOn top of these qualities, the way Ozu plays with space is something I have never seen before. Even in the most intimate of places, we can become disoriented. Although we often take the same steps over and over again, life is always a labyrinth of constant change. \nLike Kurosawa's Stray Dog, Ozu also focuses on the oppression of the heat. From the kids worrying about how to get rid of the parent's burdensome visit, to the Grandparent's trip to a spa meant for a younger generation, each character clutches a fan, attempting to comfort themselves from the uncomfortable atmosphere. It is just one of the many symbols of a people trying to do what they can to cope with such a tentative existence. \nI can see why this film has been raved about over the many decades since its initial release. It's message is timeless, but the approach feels so fresh. It is an outstanding film and one that should not be missed.",
            "review_date": "2012-02-16",
            "source": "rt"
        },
        {
            "content": "Ozu's profound masterpiece rightly deserves its place amongst the greatest films of all time.",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "Admirably pure and well-intentioned movie, but a little too slow and plodding for my taste. Hard to sit through and mostly unsatisfying. At least it had some consistently beautiful establishing shots and music throughout.  \n\nThere was also some really moving dialog and acting towards the end. I was relieved when the exceptionally poignant last 15-20 minutes redeemed it a little bit.",
            "review_date": "2012-02-04",
            "source": "rt"
        },
        {
            "content": "The third film by Yasujiro Ozu that I've seen, early on I was thinking to myself that it's no better than either The Only Son or Late Spring, and was not sure of its elevated reputation. But by the end I was very much moved and now I can see why it's regarded in such high esteem. The subtlety of the film adds to its power and the story is probably even more relevant today than it was in 1953.",
            "review_date": "2012-02-02",
            "source": "rt"
        },
        {
            "content": "Simple and fantastic!!!!",
            "review_date": "2012-01-24",
            "source": "rt"
        },
        {
            "content": "A broad masterpiece somewhere between a painterly Kurosawa tale and a Woody Allen domestic travel piece.",
            "review_date": "2012-01-22",
            "source": "rt"
        },
        {
            "content": "A movie made of details. Very slow-building.",
            "review_date": "2012-01-13",
            "source": "rt"
        },
        {
            "content": "The late film director Yasujiro Ozu once said, \"I have formulated my own directing style in my head, proceeding without any unnecessary imitation of others.\" That's a bold statement, and from nearly any other director I'm aware of, it would be a false one. However, only a few minutes into his film Tokyo Story, I knew the statement was accurate. Nobody makes movies the way Ozu did. The camera work and portrayal of his story is wholly original, and his careful examination of characters is completely refreshing.\r\n\r\nOzu's camera is positioned consistently low and still, providing a frame of an entire room. Characters enter the frame, talk, then leave. End of scene. Often, if there is a close up of a character speaking, they are nearly centred in frame, looking just past the camera. To see western film conventions so completely disregarded was bizarre, but Ozu's incredible story telling quickly dispatched any unease. His themes are so universal, and yet so personal, they did away with any cultural or film style barriers.\r\n\r\nTokyo Story is about an elderly couple, Shukishi (Chishu Ryu) and Tomi (Chieko Higashiyama), who travel a great distance to visit their many children living in Tokyo. They are met with kindness, but are provided with little attention; their children are now adults with busy lives and their own affairs to consider. The eldest son is a doctor of moderate success. Understandably, his work takes precedence over his parents' visit, and all other aspects of his life, much to his own children's distaste. Their oldest daughter is a selfish woman who runs a beauty salon, and does the least to welcome her parents. Their youngest son lives far away from the others, and is the most detached from family affairs. Their youngest daughter is the only child to live at home with them, though she spends much of her time on her education. Another son died in the war, leaving a young widow Noriko (Setsuko Hara), who is the kindest and most generous of the family.\r\n\r\nThough it is never outwardly said, much of the family considers this visit to be a burden. They try to pawn off the responsibility of entertaining their parents to one other, which results in the elderly couple spending most of their time resting, for lack of anything to do. The couple is eventually sent to an expensive resort to get them out of the way for a few days. However, the resort is too lively a place, and they return early, much to their eldest daughter's displeasure. She is not a mean person, but she is selfish and claims to be more busy than she is. Such is the case with all the children, save Noriko, who isn't even related by blood.\r\n\r\nThe many characters of Tokyo Story come alive through their mundane interactions. Ozu brings in his audience by focusing on the universal. We know these characters because we are these characters. We are the ungrateful children, the disappointed parents. We mean no harm, but cause it through our inconsiderate nature. We can never do enough for friends, family, or ourselves, so to varying degrees, we give up over time and fool ourselves into thinking otherwise. We drift from our family. We never meet our potential. We try less, and care less. It takes tragedy for us to realize the selfishness of our ways, and even then, we change little. But are we to blame? Perhaps it's only natural. Tokyo Story doesn't provide answers, only asks us to consider the questions.\r\n\r\nBut Tokyo Story isn't damning. There is a calmness to the characters, especially the elderly parents, when dealing with all aspects of their lives. The father's demeanour changes little when recollecting fond memories of his long life, or the death of family members. He understands the inevitability of life, and doesn't blame his children for being imperfect or selfish. He is disappointed, but never scornful. He merely appreciates what good comes his way, and accepts all else as a fatalistic routine.\r\n\r\nAt no point is the movie exploitative. There are no tricks or manipulative conventions. The film presents itself with an authenticity that is as valuable now, if not more so than when the film was released nearly sixty years ago. In an era of film where emotions are often thrown around as carelessly as special effects, Ozu's movies are a reminder of the power of careful, honest storytelling. Few film makers are as honest in their craft as Ozu. \r\n\r\nThe week before I watched Tokyo Story, my father was admitted to the hospital. A mass was discovered in his abdomen, but it was a long while before this mass was identified. After news of a particularly difficult night for him, I stayed home from work and decided to take comfort in the discovery of a classic film. As the story's themes presented themselves, I considered stopping the movie. I would not be emotionally prepared for such a challenging film, I thought to myself. However, Tokyo Story gave me great comfort and reassurance, more than any other film I've seen. I have not been the perfect son, but nobody ever has. I love my father, and I still have time to show it. That week I visited him and let him know how I felt, and was one of the lucky ones for it.\r\n\r\nwww.fromthereel.com",
            "review_date": "2012-01-12",
            "source": "rt"
        },
        {
            "content": "Kinda hits you late but overall an average watch.",
            "review_date": "2012-01-07",
            "source": "rt"
        },
        {
            "content": "Kinda hits you late but overall an average watch.",
            "review_date": "2012-01-01",
            "source": "rt"
        },
        {
            "content": "Ozu takes a page out of De Sica's book, a story so simple and yet incredibly powerful, and poignant. It's one of those films that tries to make you cry but doesn't make it obvious, and is very subtle. One of the best Japanese films ever made.",
            "review_date": "2011-12-29",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is such a brilliant, perfect, masterpiece of a film that it's devastating. The emotions while heavy aren't forced, you feel like one of the other family members. Even the cinematography suggests that by positioning itself at eye level with the characters. The camera doesn't move either, just perfectly framed shots. Earns its billing as one of the greatest films ever made.",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "Tokyo Story is one of the most beautiful tragedies to ever grace cinema. The model of a family in post war Japan is incredibly and simply human. Frozen, forced smiles and the distance between family memebers during the modern age has never been so prevalent and true than in this film. The tragedy of a old, aging couple being ostranged from the attention of their grown children feels incredibly genuine. The dialogue always feels realistic, even when the family awkwardly tries to keep smiles on their faces with an elephant in the room. Ozu's cinematography is matched only by the impeccable acting on the screen; it feels universally human.",
            "review_date": "2011-11-26",
            "source": "rt"
        },
        {
            "content": "Filmed with static, knee-high cameras in simple, orthogonal set-ups, Ozu produces a strangely physical space into which characters come and go as a simple story is woven by naturalist performances.",
            "review_date": "2011-11-26",
            "source": "rt"
        },
        {
            "content": "Slow moving but poignant slice of Japanese family life. Feels a lot like a modern independent character driven drama. The ending is very moving and well done. It also reminds me a lot of Leo McCarey's Make Way for Tomorrow, also dealing with busy or selfish children not knowing what to do about their elderly parents.",
            "review_date": "2011-11-15",
            "source": "rt"
        },
        {
            "content": "On the surface it may appear quite old and distantly foreign but the underlying complexity of the themes such as family relations, ageing, social and generation clash along with the film's delivery of raw emotions make this one of the most beautiful, tragic, emotionally engaging and universal films ever made.",
            "review_date": "2011-11-11",
            "source": "rt"
        },
        {
            "content": "Wow, this movie is as simple as they come. It is also glorious in its simplicity. The camera barely moves at all. It is one of the best examples of poetry in any art form, and a movie I would buy in a heart beat.",
            "review_date": "2011-10-26",
            "source": "rt"
        },
        {
            "content": "If I ever get a chance to rate movies based on their human values and depth of relationships,  I will place this movie at No.1 position.",
            "review_date": "2011-10-01",
            "source": "rt"
        },
        {
            "content": "The film didn't necessarily live up to the hype in my mind, but it is gorgeously rich in its simplicity. It simply portrays life, and that's all a film must do.\n\nI may write a full review at a later time...",
            "review_date": "2011-09-30",
            "source": "rt"
        },
        {
            "content": "A subtle and gentle film that looks into ordinary human lives with extraordinary empathy and understanding.",
            "review_date": "2011-09-29",
            "source": "rt"
        },
        {
            "content": "A superficially boring film that only grows upon further reflection, especially when one ponders its themes of the woes of aging and the irony of parenthood. The most devastating image is watching the grandmother follow her grandson while he pays not a care to her, and Shige is a deliciously exploitative character.",
            "review_date": "2011-09-13",
            "source": "rt"
        },
        {
            "content": "A straightforward story of generational conflict, within the strict cultural norms of Japan, this film has additional advantages of being atmospheric and having generally clear subtitles faithful to the original Japanese audio. Following the parents through their visit to Tokyo, and back home again, was an experience oddly like what we might see in the west 50 years later. No shocks, no surprises, much gentility and thought. I loved it.",
            "review_date": "2011-09-12",
            "source": "rt"
        },
        {
            "content": "Ozu's profound masterpiece rightly deserves its place amongst the greatest films of all time.",
            "review_date": "2011-09-08",
            "source": "rt"
        },
        {
            "content": "Isn't life disappointing?",
            "review_date": "2011-08-30",
            "source": "rt"
        },
        {
            "content": "An Intensely moving film.",
            "review_date": "2011-08-19",
            "source": "rt"
        },
        {
            "content": "Jeffrey Overstreet said that it was not very common for most of the moviegoers to sit through the whole movie. I accepted his challenge...\r\n\r\nThe movie is about two grandparents living in Onimichi who visit their children living in Toky, That's the whole story..\r\n\r\nAt first I just looked at what happened, expecting nothing special. But how fortunate I was when I felt I got Emotionally involved. I especially had great sympathy for the character called Noriko. I think I even got to learn something very important (no facts, but more questions). \r\n\r\nTokyo story is a great film indeed, I hope it will get the attention it deserves in the decades to come.\r\nI recommend Tokyo Story to every serious moviegoer in the world.",
            "review_date": "2011-08-10",
            "source": "rt"
        },
        {
            "content": "Beautifully poignant story, but drags a lot. The first act is over an hour and could have easily been compacted since we follow the wanderings of the grandparents for what seems like an eternity. The second and third acts move much quicker and are far more interesting anyway. I still can't help but think that I much prefer Ozu in color. This movie was well-composed, but it felt a lot like giving a painter two colors to work with. Also, why did people think Setsuko Hara was beautiful? She always looks so strange to me.",
            "review_date": "2011-07-28",
            "source": "rt"
        },
        {
            "content": "I don't think \"subtle\" is the right word, but throughout the 136 minutes (you'd think a movie like would seem longer, but the slow pace and dialogue actually make this seem shorter than it actually is) there is a palpable tension bubbling under a great sense of calm that avoids any false sentimentality and portrays the human condition in the simplest way possible. Subdued brilliance.\n\nThere's a lack of predictable cinematic blow-off and action here and most moviegoers would fucking hate this, I really don't think I'd ever recommend this to anyone.",
            "review_date": "2011-07-21",
            "source": "rt"
        },
        {
            "content": "\"Sooner or later, everyone who loves movies comes to Ozu.\"",
            "review_date": "2011-07-20",
            "source": "rt"
        },
        {
            "content": "It is a heart breaking story. But we are all these selfish kids indeed. With the picturesque photography, Oza has seriously put the issues of filial piety into the story, and no worse than the classic Ballad of Narayama.",
            "review_date": "2011-07-17",
            "source": "rt"
        },
        {
            "content": "It's hard to love it when it feels like a lesser version of Akira Kurosawa's brilliant and moving film Ikiru. Don't get me wrong, it's heartfelt at times, but there are so many moments where the dialogue is so wooden and flat, and the editing is just sloppy, that it pulled me from the characters whom I wanted to love. Most of the actors look like they are acting, which makes sense at first, but as it goes along Noriko is still over the top aggravating. But the parents play their roles perfectly, always putting on a fake smile in front of the children, then showing their pain when they are alone. The bar scene has to be the strongest part of the film. The men are discussing what it was like to raise their boys, and the father says that even though his son is a doctor he is still just a neighborhood doctor, which disappoints him. I think what disappoints him is that his son isn't around when he comes to Tokyo. I also love the scene between Noriko and the mother. Noriko was married to their son before he died, but she is the only one who spends time with them. The film stays true in not going off on some ridiculous plot points. We know the mother doesn't feel well: she is quite forgetful, and not in a goofy way. Ozu keeps things focused on just following these characters' lives. I would say it's good, but I don't understand how it gets it's standing as a masterpiece and one of the best films of all time.",
            "review_date": "2011-06-23",
            "source": "rt"
        },
        {
            "content": "A fantastic and unblnking look at life, family and death.",
            "review_date": "2011-06-06",
            "source": "rt"
        },
        {
            "content": "Universally lauded...in most critics top 10s of all time...but like 'La Dolce Vita' which is similarly held in high esteem I found this incredibly dull.  Yes it looks at family relationships, yes it examines how post-war attitudes were changing in Japan...I get it, but come on surely some sort of dramatic events are required?  I don't want to sit for 2 hours watching an old couple on holiday in Tokyo and then Cough! Splutter! Oh don't worry I'm sure the old lady will be fine...",
            "review_date": "2011-05-26",
            "source": "rt"
        },
        {
            "content": "Yasujiro Ozu, probably one of the most acclaimed directors in all of cinema. After I heard that I knew I needed to see his films. And out of all the ones I saw, \"Tokyo Story\" is definitely his best.",
            "review_date": "2011-05-05",
            "source": "rt"
        },
        {
            "content": "This film is considered one of the best films in history.\r\nAnd I think I know why.\r\n\r\nThis film tells us what life is, and what the family is.\r\nThe camera shows us an ordinary everyday life of Japanese people with deliberation.\r\n\r\nBoring? No!!\r\nIt is story of my father, mother, brother, sister, and me.\r\nIt deserve 5 star, no, six star!!!",
            "review_date": "2011-05-05",
            "source": "rt"
        },
        {
            "content": "Was last year when I saw this so it s a little hazy, but from what I remember I enjoyed it. It showed the difference in values from different generations of a family.",
            "review_date": "2011-04-25",
            "source": "rt"
        },
        {
            "content": "Possible SPOILERS. It's not likely it will spoil much seeing its in the film's description, but still.\r\n\r\nThis film is subtly acted and realistic, though, at the same time, quite theatrical. It basically comments on how lifestyles, generation by generation, follow a certain loop where children want to be as far away as possible from their parents and how it greatly it affects parents. A mother and father go a great distance to visit their children in Tokyo, and none of them take some time off their busy schedules to spend time with them. Only Noriko, a widowed daughter-in-law takes a day off from her equally busy schedule to spend with them. Noriko seems to be the only one interested in actually seeing the parents at all, and yet she isn't even related to them, while the blood related children and their family just want to get rid of them so they can get on with their lives. Eventually things take a turn for the worst that makes the children wish they had spent more time with their parents. \r\n\r\nOzu masterfully directs this film with beautiful imagery and an intriguing plot, that looks into the lives of some post-war Japanese citizens as well as gives a powerful message.",
            "review_date": "2011-04-19",
            "source": "rt"
        },
        {
            "content": "Tokyo Story directed by Yasujiro Ozu.\r\n\r\nThis film is our film, this story is like the stories of each home in Pakistan. How, so-called modern kids abandon their parents. I wonder each frame of the film, is story of how families in other parts of Asia are affected.\r\n\r\nThis film may not be well-received in West, where there is lack of cultural bondage, I'm not against West, but the value of culture in Asia, particularly, Japan, China, Pakistan, India and other countries is much higher than any other countries. \r\n\r\nPakistan, and India started making movies, about family relations, which are classified and well-received in their own manners, Tokyo Story did it back in 1953. \r\n\r\nI guess I'll have to show this film to my father.",
            "review_date": "2011-04-09",
            "source": "rt"
        },
        {
            "content": "Thankfully I can look beyond my own emotions and enjoyment level and recognize why Tokyo Story gets so many plaudits for it's story and unique way of filming.  Unfortunately, it still doesn't change my mind about the sheer utter boredom it induces.  I feel like it's the kind of movie that would be perfect for every old person to watch on their death bed as life slowly slips away.  Give the old goat one last beautiful glance in to family life...it's morbid!",
            "review_date": "2011-03-31",
            "source": "rt"
        },
        {
            "content": "This movie has some redeeming aspects, such as its message and its beautiful appearance, but it is vastly overrated. There is very little exceptional about it, and it explores particularly tepid family drama with few actual problems and little tension; the movie should have been cut down by a third or more. It is lethargic and ordinary.",
            "review_date": "2011-03-29",
            "source": "rt"
        },
        {
            "content": "A beautifully crafted, acted and filmed story following a family and friends through various days and a family bereavement - does go slowly but is just so believable and honest the 2hr 16m flies by. Beautiful and well worth watching.",
            "review_date": "2011-03-14",
            "source": "rt"
        },
        {
            "content": "In addition to Kurosawa, another director named Ozu came out with a slew of films during the 1950's, but unfortunately they were not released into North America right after completion. They made it in the 1970's and boy, are they deservably so well respected. \"Tokyo Story\" is about a mother and daughter who come to visit there grown-up children, only to be ignored by all of them, except the one who is diseased (died in assuming WWII). The deceased's widow, in fact, is the only who takes care of them, a breath fresh air compared to all the others. Like Vittorio de Sica's \"The Bicycle Thief,\" this film is simple in its storytelling, but emits power so grand. It's beautiful and lovely and tragic, especially when the mother passes away from an illness. Truly a magical film and so natural in its filming and acting. Seems lifelike. NOTE: Some areas lack subtitles, but are easy to translate without the words on the bottom just through reactions.",
            "review_date": "2011-03-11",
            "source": "rt"
        },
        {
            "content": "Slow moving, but beautiful and insightful to the generation gap happening after WWII in Japan. The connections between the characters (or lack of) is very real and convincing.",
            "review_date": "2011-03-08",
            "source": "rt"
        },
        {
            "content": "all-time classic, a masterpiece! 100%",
            "review_date": "2011-03-08",
            "source": "rt"
        },
        {
            "content": "Fue como ver \"nosotros los pobres\" pero en japonÃ (C)s!",
            "review_date": "2011-02-28",
            "source": "rt"
        },
        {
            "content": "I can see why this film is considered Yasujior Ozu's masterpiece. The story is brilliantly written and told. The casting seemed to be ideal and the roles played superbly. It is evident that each shot was chosen with precision and cut into sequence with even more care, displaying Ozu's trademark style. The pace may seem to be a bit long for a modern American audience, but it fits with Ozu's style and does justice to his storytelling.\nIn short, Tokyo Story is a great Japanese Character Drama.",
            "review_date": "2011-02-27",
            "source": "rt"
        },
        {
            "content": "What a piece of crap. The cinematography was absolutely disgusting. It's quite possibly the ugliest movie I've ever seen. None of the characters were interesting or sympathetic, they just sat around with retarded looks on their faces. And there was no emotion or atmosphere in the entire movie.",
            "review_date": "2011-02-21",
            "source": "rt"
        },
        {
            "content": "Critically in the top 10 ever, but can't love it like that yet. Rewatch planned in 10 yrs.",
            "review_date": "2011-02-16",
            "source": "rt"
        },
        {
            "content": "sublime. Vintage Ozu.",
            "review_date": "2011-02-09",
            "source": "rt"
        },
        {
            "content": "For film-schoolers, it's five stars. For film-buffs, it's four stars. For everyone else, it's three stars at best.\n\nThe film moves slow but deep. Even though the plotline is shallow enough. An old mother and father travel on the train from Hiroshima to Tokyo to see their children and grandchildren. It's been a long time. And the kids don't seem very interested in their visitors. They pass 'em around and even pack 'em off to an out-of-town spa. Only the widowed daughter-in-law seems thoughtful of them. The parents decide to give up and head back to Hiroshima. They lament about how they were treated. The mother falls to her deathbed. The kids turn up out of respect, then hurry right off again. Dad's left sitting exactly where he started, but now he's alone. Fin.\n\nOstensibly, the film is talking about how family roles and society in Japan has changed after the end of WWII. That Japan's just not so family-centric and respectful as it had been. Or maybe the film is just talking about how things and people always change and leave old folks behind. And it can't be helped. But life goes on and stops for no one. In any case the message is pretty dated.\n\nBut whatever the message, it's told well. By the time Act II opens, the viewer is vested in these characters and wants to know more about how they are going to settle into their interpersonal relationships. By Act III, the characters that stand tallest are teaching the viewer a thing or two about life choices.\n\nFilm-schooler and film-buff-wise, Ozu teaches plenty. The most obvious is camera-angle. He continues to shoot from just about six inches off the floor at a rather precise angle that captures the entire length of the characters, a bit of what hangs over their heads, and a good bit of background depth as well. Ozu sometimes identifies location by the pendant lamp that hangs within it. Yet the shot never looks coming to be from as low as it actually is. Ozu here shows a preference for mid-length hall shots that communicate a lot, even when the hall is empty. And Ozu transitions are interesting:  tight, quick, simple and clever. And there's gobs of parallel duality well-executed in this film. Not as much as Hitchcock stuffed into \"Vertigo\" a few years after this film, but plenty none the less. And here it's sort of more obvious yet still subtle at the same time. Interesting.\n\nRECOMMENDATION: Even though it turns up on a lot of \"best ever\" lists,  casual film-watchers aren't going to care for it. For one thing, they'll find it just too slow. Serious cinema connoisseurs, however, will patiently observe and learn.\n\nNB: It's a whole lot easier to watch this film if you know the family tree going in. The English translation doesn't make clear who's-who. I had to get it from Googling and the DVD commentary....\n\nHirayama Family: Shukichi, the father. Tomi, the mother. \n\nKyoko. The youngest daughter, who still lives at home and is seen there with Mom & Dad at the beginning of the film.\n\nKeizo. The youngest son. He lives in Osaka and works at the Osaka railroad station office. Mom & Dad are planning to see him on the way to Tokyo. He doesn't actually appear on screen until very late in the film.\n\nKochi. The eldest son. He's a doctor, specifically a neighborhood general practitioner who stays quite busy. Mom & Dad stop at Kochi's house first after arriving in Tokyo.\n\nShige. The selfish eldest daughter. She owns her own hairdresser's shop and lives there with her hen-pecked husband, Kurazo.\n\nNoriko. The kind-hearted, widowed daughter-in-law. Her husband Shosi Hirayama went missing in action during World War II. She works as a clerk at the Yoneyama Trading Firm (which has Bridgestone Tire as a major account).",
            "review_date": "2011-01-28",
            "source": "rt"
        },
        {
            "content": "Bought this movie in college when I started getting into Japanese Cinema thanks to a World Cinema course I was taking.  Tokyo Story is a simple story done perfectly.",
            "review_date": "2011-01-27",
            "source": "rt"
        },
        {
            "content": "Just watched and enjoyed this slow-moving but endearing Japanese classic from 1953. A poignant piece about parent-child relationships which offers us an evergreen reminder that things don't change very much over time. As the insightful tagline on the trailer says, \"as long as life goes on, relationships between parents and children will bring boundless joy and endless grief\".",
            "review_date": "2011-01-26",
            "source": "rt"
        },
        {
            "content": "Thought many critics consider this as one of the best film ever 100% on rottentomatoes and all. I'm not so enthusiastic about Tokyo Story. it focusing to much on human values. The People are to perfect a perfect family, there's no conflict in this movie, it's the Teletubbies.",
            "review_date": "2011-01-23",
            "source": "rt"
        },
        {
            "content": "I am left completely mesmerized by Ozu's masterpieces. In Tokyo Story, he delves in so simple, yet profound meditations on themes like marriage and mortality. It's just amazing.",
            "review_date": "2011-01-22",
            "source": "rt"
        },
        {
            "content": "I read a review that said \"everything about Tokyo Story feels so real.\"  But that's not what I see.  The acting is stiff and emotionless, and, maybe typical of communication style in Japan in the 1950's, everyone is so proper and formal to each other that there is no sense of human connection between these characters.  Even within this family, they are so formal and polite that if you didn't know they were family, you would think they were strangers meeting for the first time.  Even Noriko, the only \"real\" character has very little emotion.  It is kind of awkward when you see her saying \"life is disappointing\" with a broad smile on her face, as if she is reading a line that she doesn't understand.  But, all the critics here on RT seem to give it rave reviews, so I guess there's something I'm missing.  Just like \"The Bicycle Thief\" it seems that this classic probably would not appeal to viewers today.",
            "review_date": "2011-01-15",
            "source": "rt"
        },
        {
            "content": "What can I say about a filmmaker like Yasujiro Ozu that has not been said already. Veteran film critic Roger Ebert says about Tokyo Story \"It ennobles the cinema. It says, yes, a movie can help us make small steps against our imperfections.\" \nOzu's belongs to an exclusive category of minimalist directors who believe that art is a collaboration between God and the artist and the less the artist does the better. Ozu hardly makes cuts, hardly moves his camera, hardly ever changes the angles. In other words, he does very little as a director to 'make' you feel in a certain way yet he manages to make you squirm, make you uncomfortable and drains you emotionally because the characters, the settings, the situations, the dialogues are too close to comfort, they could very well be mirroring our own lives. \nTo describe Ozu's handling of his subject as subtle would be a gross understatement. There is no outward conflict, every character is nice to the other yet we as an audience are fully aware of the conflicts beneath the surface, the hatred, the jealousy, the annoyance, the disappointments etc. \n\nTo hail Ozu as one of the finest directors ever would not be overstating it because he takes a subject which is so simple, a story that is hardly original, characters that we have seen in other films and gives us something so deeply layered and complex that at the end of the film, we really are not sure where we stand, what should be done, how to solve these issues.  \n\nFilmmakers use various techniques to make an audience feel closer to the character. Some filmmakers rely on writing, some filmmakers rely on camera angles and close ups. Ozu shuns away these techniques, and instead in some strange metaphysical way takes us right at the centre of the household and experience and live life with them.",
            "review_date": "2011-01-15",
            "source": "rt"
        },
        {
            "content": "Beautiful, poignant and masterly crafted.",
            "review_date": "2011-01-07",
            "source": "rt"
        },
        {
            "content": "Expertly and delicately crafted.  Characters will remain unforgettable.",
            "review_date": "2011-01-07",
            "source": "rt"
        },
        {
            "content": "I'm sorry, I did not get it. I mean I got all that old parents and grown-up children thing. But not that one of the best movies of all time.",
            "review_date": "2010-12-23",
            "source": "rt"
        },
        {
            "content": "A beautiful story, drawing all its magnetic power out of its characters. The movie offers no flashy cuts or visual feats (in fact, the camera only moves once in the whole movie, otherwise it is always placed stationary at the same height) nor does it present us with a riveting plot, neglecting even to show some big events, which we only hear about from the characters.\n\nDespite that, for more than 2 hours, it keeps you hooked to the fate of two elderly parents who visit some of their children in Tokyo, only to find that their children have changed over 20 years, and have lives too busy for them. The optimistic sadness of the old couple is heartwrenching and the end deeply touching.",
            "review_date": "2010-12-15",
            "source": "rt"
        },
        {
            "content": "A great movie.\nNo matter how much is said it will still be less to such a great movie.\nSeldom such a movie comes.Long live asian cinema",
            "review_date": "2010-12-09",
            "source": "rt"
        },
        {
            "content": "I ashamedly remained skeptical for too long in this movie.  Here's compensation.",
            "review_date": "2010-12-06",
            "source": "rt"
        }
    ]
}