{
  "title": "Solaris",
  "rating": 6.7,
  "release_date": "2002-11-27",
  "genre": [
    "Sci-Fi",
    "Drama",
    "Mystery",
    "Romance"
  ],
  "summary": "A story of love, redemption, second chances and a space mission gone terribly wrong.  (20th Century Fox)",
  "critic_reviews": [
    "Solaris achieves an almost perfect balance of poetry and pulp. This is as elegant, moody, intelligent, sensuous, and sustained a studio movie as we are likely to see this season -- and in its intrinsic nuttiness, perhaps the least compromised.",
    "Clooney brings raw intensity to his role; his scenes with McElhone are rooted in a fierce romantic yearning.",
    "Soderbergh's film is probably not the equal of either Tarkovsky's 1972 predecessor or the memorably Byzantine prose of Lem's novel, but in the end, almost despite himself, this able craftsman has made a brave and lovely companion piece to both of them. His ending is pure cinema at its most marvelous and moving.",
    "Though glazed in chilly surfaces -- the Kubrickian spaces, Cliff Martinez's gorgeous ambient score, the elliptical editing rhythms of Soderbergh's recent work, particularly \"The Limey\" -- the film contains a surprising depth of feeling within its egg-shaped head.",
    "It's an entirely different animal from Tarkovsky's hypnotic but opaque take, and it's an entirely different animal from most studio product in general -- Soderbergh's Solaris is a gorgeous and deceptively minimalist cinematic tone poem.",
    "As things turn out, Clooney’s butt is just one of the many delights to be found on a trip to Solaris.",
    "The Soderbergh version is like the same story freed from the weight of Tarkovsky's solemnity. And it evokes one of the rarest of movie emotions, ironic regret.",
    "Philip Messina's claustrophobic sets and Cliff Martinez's elegantly creepy score add to the film's distinction and work off Clooney's performance and Soderbergh's staging to create an hypnotic spell and suggest a cosmos full of spiritual possibility.",
    "I find Soderbergh's Solaris an eminently more satisfying experience than Lem's. This is a film as elegantly directed as any by Kubrick, one which is superbly acted and brilliantly scored, as spellbinding a work of cinema as we're likely to see for some time.",
    "Essentially a solemn, splintered meditation on lost love: a movie about personal space, in space.",
    "Soderbergh does a fine job creating a moody atmosphere of pervasive anxiety. The ending can be interpreted a few different ways and should ignite debate about its meaning.",
    "To appreciate Solaris, the new film by Steven Soderbergh, it helps to downshift your moviegoing metabolism to a level approaching the cryogenically frozen: The movie's that cerebral, that contemplative, that slow.",
    "The film's real appeal won't be to Clooney fans or adventure buffs, but to moviegoers who enjoy thinking about compelling questions with no easy answers.",
    "Neither as effective nor as ambitious as Kubrick's masterpiece, but it's still a compelling cinematic experience for those who are willing to abandon themselves to the unforced, measured rhythms of an issues-based motion picture.",
    "A darkly brilliant sci-fi movie about emotions so deep, the story could be taking place within the chambers of the heart instead of an arid space station. At the same time, it is a coldly theoretical piece that could leave viewers unengaged.",
    "That level of acting-without-words demands the likes of a Bruno Ganz or a Klaus Maria Brandauer, not a Clooney. Even when flashing his bare derrière in a sex scene, he isn't revealing nearly enough -- his work is just skin deep.",
    "For those who have seen Tarkovsky's moody original, let me say that Soderbergh skims the fat from the 1972 film. What's left is a rich stew of longing.",
    "So beautifully made (everything in it is understated except the gorgeous good looks of its stars) and turns out to have such real cumulative power that it is worth holding out to the end.",
    "Soderbergh, who hasn't ever attempted a film of this sort before, brings his gifts brilliantly to bear, with gorgeous shots of outer space, delicate, swift edits and a captivating score by his longtime collaborator Cliff Martinez --  But when the script becomes more about telling -- or, rather, arguing -- than showing, the film loosens its grip.",
    "Solaris, an exploration of outer space and inner anguish, reminds us that science fiction can embrace adult ideas and human drama as well as technology and futuristic action.",
    "Can't touch the 1972 film's austere poignancy, and McElhone lacks the bewitching beauty of Natalya Bondarchuk in the original Solaris. But the project's gravity and ambition can't be denied.",
    "While I could tell the love story was supposed to be moving, I kept feeling the characters' passion struggling against the virtuosity of Soderbergh's direction, which is so tight, so gorgeously lit, so worked that even when he wants scenes to be emotionally incandescent, they wind up detached, even chilly.",
    "Ends up more challenging and intriguing than personally involving, and while these are far from small things, it is only human to hope for more.",
    "Steven Soderbergh's Solaris is an uptight movie -- the opposite of his scintillating \"Out of Sight.\"",
    "For all its flaws, though, Solaris is a good try, and a definite improvement over the dull remakes Soderbergh has been sleepwalking through lately.",
    "Missing is most of Tarkovsky's contemplative and mystical poetry (which is why it's 90 minutes shorter), and added are some unfortunate Hollywood-style designer flashbacks -- The story is still strong and haunting, but I'd recommend seeing this, if at all, only after the Tarkovsky.",
    "Even by the art film standards it apes, Solaris lacks conviction. And although it's meant to be restrained and free of emotional hysteria, the result is a movie that pretty much lies dead on the screen for an hour and a half.",
    "Retooled into a sleek pop fable that doesn't bother to connect all its dots, the movie aspires to fuse the mystical intellectual gamesmanship of \"2001: A Space Odyssey\" with the love-beyond-the-grave romantic schmaltz of \"Titanic,\" without losing its cool. It's a tricky balancing act that doesn't quite come off.",
    "Soderbergh, in essence, has come up with a plodding and far less psychologically arresting version of ''Ghost.''",
    "The real irony is that for all its integrity, the film isn't nearly as thought-provoking as Steven Spielberg's recent \"A.I. Artificial Intelligence\" or \"Minority Report\", and nowhere as entertaining.",
    "Despite its undeniably pure and earnest intent, Solaris is equally undeniably an arid, dull affair that imposes and maintains a huge distance between the viewer and what happens onscreen.",
    "If Soderbergh set out to make a galvanizing conversation piece, he has certainly succeeded. But this cold, occasionally dull movie practically defies you to embrace it.",
    "It could hardly be called rip-roaring. I should report that it drives about a quarter of the audience out of the theater before it is half over. That's because it's slower than molasses in Siberia.",
    "Soderbergh, the writer and director, has slowed his metronome almost to a crawl, has repeated and delayed and protracted, in an attempt at depth. The net effect is a small paradox: incomprehensibility caused by drag, not by rush.",
    "Solaris is a film where people...often...speak... like... this, and the camera moves slowly across sterile interiors.",
    "A ponderous and dreadful film."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This is the kind of movie that people with pretentions but without brains will love. Merely asking deep questions doesn't make a movie smart. For that you need some answers, or at least some thought provoking angle. This movie has This is the kind of movie that people with pretentions but without brains will love. Merely asking deep questions doesn't make a movie smart. For that you need some answers, or at least some thought provoking angle. This movie has neither. The constant flashbacks and \"what if\" questions are extremely predictable and rarely lead anywhere. That said, it isn't the worst movie ever. The restrained acting is enjoyable and the camerawork and scenery sets a nice mood. In short, this isn't an intellectual masterpiece, but it's no disaster either. If you think everyone who doesn't like it just can't understand it, you're a cunt and pretty daft too.",
      "review_date": "2006-06-07"
    },
    {
      "review_title": null,
      "content": "Headline: \"Solaris\" ...a unique sci-fi conception. Virtually fantastic with provocative dialogue. Different from the ordinary. And extraordinary from the ordinary. Clooney shines, but only a dull light. Cool idea. Poor execution. With strong Headline: \"Solaris\" ...a unique sci-fi conception. Virtually fantastic with provocative dialogue. Different from the ordinary. And extraordinary from the ordinary. Clooney shines, but only a dull light. Cool idea. Poor execution. With strong inside-emotions and calm elements, Solaris will keep your angerment to a minimun level. And is a good movie to fall asleep and to calm down in. But really, for full thought sake, this picture's dull and dreary. Not dissapointing, it's just so boring.",
      "review_date": "2008-04-01"
    },
    {
      "review_title": null,
      "content": "This is a disappointing movie. It has a rendering of  a beautiful planet but forgot that it was supposed to be mostly ocean and not mostly plasma like the consistency of a star. Most of the movie was spent lingering on Clooney and McElhone,This is a disappointing movie. It has a rendering of  a beautiful planet but forgot that it was supposed to be mostly ocean and not mostly plasma like the consistency of a star. Most of the movie was spent lingering on Clooney and McElhone, neither one seeming to have any need to blink (which I found really disturbing). I didn't really feel any more empathetic towards them with all of those close ups, really. It could have saved at least 10 minutes of pointless slow panning and closeups. Also, please put a shirt on Clooney and wipe his sweat. Another sore point I have was the kid: he has the ability to corporealize on will depending on the plot, the other creatures didn't have this ability. I gave it one point because I believed Viola Davis' character really went through something difficult and was the only one who I felt was a real human being. I gave it another point because aside from the time wasted on Clooney and McElhone, the movie didn't feel like it was too slow.",
      "review_date": "2013-09-22"
    },
    {
      "review_title": null,
      "content": "This film was very underwhelming. Trying to sell it as being better than the original by having A-listers doesn't make your film better. The acting is fine, but not stand out, and the story plods along exceedingly slow and it's very boring.This film was very underwhelming. Trying to sell it as being better than the original by having A-listers doesn't make your film better. The acting is fine, but not stand out, and the story plods along exceedingly slow and it's very boring. There is a noce atmosphere over the whole film of isolation, loneliness and higher presences being in control, bit it still does not save the film from being over all boring. The ending is nice though as it leaves enough ambiguity to make different conclusion to how YOU want to see it, and saves the film from being a 2 or 3 out of 10. You can give this a miss and watch the original instead. Some people may enjoy it more though because of it's ending though.",
      "review_date": "2015-01-02"
    },
    {
      "review_title": null,
      "content": "Mindblowing emotionally, and stunningly beautiful. This is a really slow movie but if you can just sit back and let the fantastic soundtrack, spectacular visuals and emotion twisting plot slowly wash  over you, then this will become your newMindblowing emotionally, and stunningly beautiful. This is a really slow movie but if you can just sit back and let the fantastic soundtrack, spectacular visuals and emotion twisting plot slowly wash  over you, then this will become your new favourite movie.",
      "review_date": "2011-02-03"
    },
    {
      "review_title": null,
      "content": "Solaris is one of the most original, unique and intriguing science fiction films ever made. Steven Soderbergh takes cues from 2001: A Space Odyssey and runs with them into the modern age. The film also sees a true powerhouse performance fromSolaris is one of the most original, unique and intriguing science fiction films ever made. Steven Soderbergh takes cues from 2001: A Space Odyssey and runs with them into the modern age. The film also sees a true powerhouse performance from George Clooney. Solaris has mystery, beauty and emotion sown into every frame. Phenomenal stuff!",
      "review_date": "2012-10-24"
    },
    {
      "review_title": null,
      "content": "Not nearly as bad as most people make it out to be. I don't see how people would fault this American version for being different from the Russian, since neither captures even half of the thematic focus of the novel, which undoubtably isNot nearly as bad as most people make it out to be. I don't see how people would fault this American version for being different from the Russian, since neither captures even half of the thematic focus of the novel, which undoubtably is infinitely better than any other form of the story. The novel manages to study the relationship between parallel topics of an introspective, psychological love story and a philosophical exploration on the limits of scientific understanding, subjectivity, practical implications of religion, etc. (the whole boat-load). The Russian film focused on the latter, while, as might be expected, the American went for the former. So I can't really see how anyone says they appreciate the book in its entirety, praise the 1972 film but dismiss the 2002 one. So all that aside, this film does its niche fairly well. The cinematography, soundtrack, acting, writing are all fairly above par if not spell-binding (the acting is really far more compelling here than in the Russian; those who say otherwise are just being stubborn). The pace is slow which can definitely turn off a lot of people, but it provides a dream-like, Lynchian trance for those who sit the whole thing out.",
      "review_date": "2011-10-13"
    },
    {
      "review_title": null,
      "content": "Mesmerizing, beautiful, intellectual without being pretentious, introspective and immersive...at least for those with patience and intelligence enough to appreciate it. Solaris is film art with a haunting soundtrack, great acting, writing andMesmerizing, beautiful, intellectual without being pretentious, introspective and immersive...at least for those with patience and intelligence enough to appreciate it. Solaris is film art with a haunting soundtrack, great acting, writing and photography and is a decent interpretation of Stanislaw Lem's book.",
      "review_date": "2016-09-10"
    },
    {
      "review_title": null,
      "content": "A film that ultimately rewards patience and attention - abilities often absent in today's audience. Jeremy Davies' quizzical Snow is a superb creation.",
      "review_date": "2011-12-14"
    },
    {
      "review_title": null,
      "content": "A beautiful, romantic and thought-provoking film. A slow and introspective journey into the nature of lost love. Definitely not for the unwashed masses (it's measured, complex and open ended - nothing gets blown up and there's not a singleA beautiful, romantic and thought-provoking film. A slow and introspective journey into the nature of lost love. Definitely not for the unwashed masses (it's measured, complex and open ended - nothing gets blown up and there's not a single car race),  but worthwhile if you love cinema and  appreciate a good story.",
      "review_date": "2012-04-06"
    },
    {
      "review_title": null,
      "content": "Just wow. On pretty much every front, Solaris is an exceptional film. George Clooney is marvelous here. My main criticism with him, as much as I do like him, is that he frequently seems to just play himself in many films. Here, however, heJust wow. On pretty much every front, Solaris is an exceptional film. George Clooney is marvelous here. My main criticism with him, as much as I do like him, is that he frequently seems to just play himself in many films. Here, however, he does anything but. Steven Soderbergh's direction is great and the visual effects here of space and of the planet Solaris are breathtakingly gorgeous and really something to marvel at. In that way and in terms of what it all means, reminds me a lot of 2001: A Space Odyssey. Very ambigious, confusing, slow, and beautiful, Solaris is really quite brilliant, though a tough nut to crack. Personally, I am still racking my brain over what everything in this one meant and trying to figure out what I am supposed to take away. Ultimately, however, I think this is an orange you can peel in many different ways, which makes it all the more intriguing. Personally, I think there are many plausible explanations, whether they be on reality (what is truly real?), love (and its everlasting nature), and death (where will we reunite, if we ever do? letting go or can you truly ever let go?). It raises many interesting questions and it may not have all the answers and is most certainly very flawed at times and leaves many unanswerable questions (unless \"I don't know\" is an answer). However, in spite of that, I adored this one. I love films with ambiguity and ones that raise many questions that make it fun to discuss and this is a classic example of that. Now, I would never recommend it to anyone, because if I did, odds are they would come back and call me an idiot since this one is an acquired taste, but I loved it all the same.",
      "review_date": "2014-08-20"
    },
    {
      "review_title": null,
      "content": "It might not exactly be George Clooney's most riveting outer space adventure, with a whole lot of moral intrigue and a bevy of beautiful images from one of Hollywood's most aesthetic directors, \"Solaris\" is definitely worth the watch.",
      "review_date": "2013-10-11"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies. It jumps between genres, which I think throws people off. Seems like it's going to be a scary movie, but turns into a thoughtful movie about love and loss.\rI really don't know why it reviews so poorly, but youOne of my favorite movies. It jumps between genres, which I think throws people off. Seems like it's going to be a scary movie, but turns into a thoughtful movie about love and loss.\rI really don't know why it reviews so poorly, but you should give it a chance.",
      "review_date": "2014-11-03"
    },
    {
      "review_title": null,
      "content": "This is yet another example of why Americans should not remake foreign films. They messed up the 7 Samurai with \"Tthe Magnificent Seven\", turned the original Japanese Ring films into a mess losing the plot, then with this classic RussianThis is yet another example of why Americans should not remake foreign films. They messed up the 7 Samurai with \"Tthe Magnificent Seven\", turned the original Japanese Ring films into a mess losing the plot, then with this classic Russian film, tried condensing it into the usual \"slot\" on time and cut and paste all the meaning out of it. Please Amerian film makers. Leave foreign films alone so that people can see for example, this beautiful haunting Russian arthouse film rather than dross.  To anyone who liked this American version, you should see the Russian version and the actress Natalia Bonderchuk is much better and far more convincing than Natasha McElhone.",
      "review_date": "2011-09-25"
    },
    {
      "review_title": null,
      "content": "Brainless?",
      "review_date": "2002-12-04"
    },
    {
      "review_title": null,
      "content": "George Clooney plays an ordinary psychologist who ventures into space to solve the mystery of why the crew of a space station and their rescue party have disappeared. Cause that seems like the logical choice for a space rescue. Why not justGeorge Clooney plays an ordinary psychologist who ventures into space to solve the mystery of why the crew of a space station and their rescue party have disappeared. Cause that seems like the logical choice for a space rescue. Why not just hire an oil rig worker instead? And why not go alone why you are at it there George. That’s smart. Great setup writers.\r Enjoy mesmerizing scenes of what could be improv dialog as Clooney slowly discovers what’s been going on. Things start to happen, scenes change locations from darkly lit corridors, to darkly light rooms! It’s epic!\r Just when the action picks you might be thinking “Hey, this is like The Abyss and 2001 but only if those movies sucked.” And you’d be correct. While the film does have some nice scenes and tries to create a slower paced movie there is much to be desired. From super close camera angles and a lack of scope or space that’s included in other similar space tales. It makes this sci-fi tale rather void of fun and magic.\r Clooney being a psychologist has no meaning in this film. That aspect was not explored, nor was his backstory or his character. Having career training in mastering human dialog and interactions it’s strangely bizarre and out of character the way Clooney’s character behaves to mysterious new people aboard the space station.\r Sci-fi fans might want to steer their space ship away from this asteroid of a movie.\r Their Tag Line - “There are some places man is not ready to go”\r- Ya, Into the theater to see this movie.\r Alternate Tag Lines\r 1.\t“You don’t need to be a psychologist to figure out this thriller.”\r2.\t“Reasons why people find real space boring. Check.”\r3.\t“Rouge space station, cool effects, missing crew. No way can they mess this movie up. Right? ”\r Hits\r -\tNice concept, if a bit worn out.\r-\tNaked George Clooney.\r-\tThe title sounds cool.\r Misses\r - Character development & plot.\r- George Clooney’s butt shown.\r- Earth scenes don’t look futuristic enough.",
      "review_date": "2015-07-14"
    },
    {
      "review_title": null,
      "content": "I'm with the twist-off-their-heads respondent -- what in g-d's name is wrong with you people? i pretty much despise clooney, think soderbergh's batting .500 in his career (love _schizopolis_, despise _ocean's 11_ with theI'm with the twist-off-their-heads respondent -- what in g-d's name is wrong with you people? i pretty much despise clooney, think soderbergh's batting .500 in his career (love _schizopolis_, despise _ocean's 11_ with the passionate commitment the film itself lacks...) and was, nonetheless, completely unprepared for the haunting tone poem they wrought. what an achievement! now, compared to tarkovsky's version, this is merely a gloss on the themes implied by stanislaw lem's book...but what a gloss! \"plodding\"? quit quoting owen gleiberman, whose review one can barely be read without being distracted by the ax o.g. is plainly grinding -- never mind about your theories of how soderbergh approaches filmmaking, HOW WAS THE FILM?!? i guess a film that honors silence and a viewer's own capacity for not being led by their nose-rings through a narrative -- for only 96 minutes, you twitchy intellectuals, thank you very much -- could be called \"plodding,\" and those who do so could be called something else. its accomplishment is all the greater for seeming so effortless -- it has social critique, romance, philosophy, humor (i.e. jeremy davies, who, especially after _secretary_, is going through something of a twitchy period himself), conscience-stricken drama and a lovely, brief homage to tarkovsky is the \"kelvin's sick\" sequence. oh, yeah, and GEORGE CLOONEY'S BEST PERFORMANCE EVER!! maybe the best he'll ever do -- such range and engagement in the character's process, who knew? not you who diss this film, surely. doesn't this little fact count for anything with you numnutzes? i can see a weak box office for such fare, but not $9.5 million weak on a holiday weekend, and definitely not to receive an \"f\" rating from the similarly disposed nutzes on cinemascore.com. it is not flawless, nor wholly free of pretense, but it's as pretty damned close as a soul could hope for in today's hollywood. bravo, soderbergh, clooney, mcelhone, davies, viola davis, even james cameron, for this gorgeous, provocative reflection on desire and karma. i can't wait for this film to be rehabilitated, as it most certainly shall be, in the years to come. on the subject of nose-rings, i'm convinced half of the dismissive sentiment of \"cineastes\" is confusion over the unique tone of the film, wedded to witless diatribes that reinforce said lack of understanding. if you'd been told that this was a good film, i firmly believe you'd be leaping to _solaris_' defense. don't believe the negative hype -- see it for yourself. for IQs only slightly higher than today's temperature, i believe this is, among other things, a great date movie...",
      "review_date": "2002-12-06"
    },
    {
      "review_title": null,
      "content": "Amazed at the passion the negative reviewers display with their hatred of this movie, and the anger they feel  at folks like me who genuinely enjoyed it. When you say they just don't get it, it only makes them angrier and more defensive, so IAmazed at the passion the negative reviewers display with their hatred of this movie, and the anger they feel  at folks like me who genuinely enjoyed it. When you say they just don't get it, it only makes them angrier and more defensive, so I will instead say this; if you didn't like the movie, say just that. Don't say it was crap, or stupid or whatever, because there are many people, far more accomplished and thoughtful (not to mention well-spoken) than many of you negative nancies, who put their heart and soul into this movie. Are you saying they are all stupid? Would you say that to their face? Why else do think think people tell you that you just don't get it? Stop being dick-holes and simply acknowledge that it's not your kind of movie. I found it to be intriguingly tense and thought provoking. Does that mean I think you are retarded for not agreeing with me? Well, ...yes, yes it does.",
      "review_date": "2012-06-08"
    },
    {
      "review_title": null,
      "content": "I liked the premise of the movie I really did, however even if I tried to like it, I couldn't pass this type of slow pace with a lot of dull moments, it could be slow, but made differently. There were a lot of questions unanswered. How didI liked the premise of the movie I really did, however even if I tried to like it, I couldn't pass this type of slow pace with a lot of dull moments, it could be slow, but made differently. There were a lot of questions unanswered. How did the replicas appeared? They dream about them, but how do they form exactly? Everything is strange, a team had disappeared but it seemed like they just loose a coin, it didn't look like a problem...\"We lost the security patrol team, and now the Dr.Gibarian needs you, Dr.Kelvin.\" Nice...really nice, a solo man adventurer, with no backup team, cameras to record the events, nothing. People are dying and disappearing and we will send Dr.Kelvin, with nothing to record the events, no one to report to, that's kind out of place.\r I don't like ambiguous things, I like movies where all at same level, depending on the universe they are into, are explained.",
      "review_date": "2016-03-10"
    },
    {
      "review_title": null,
      "content": "Solaris 2002 is completely underwhelming. I did not watch the original Solaris from Tarkovsky and am not familiar with the literary original. I can only rate the film itself. And honestly, the only thing that attracts attention here is theSolaris 2002 is completely underwhelming. I did not watch the original Solaris from Tarkovsky and am not familiar with the literary original. I can only rate the film itself. And honestly, the only thing that attracts attention here is the acting of George Clooney. There is nothing else to watch here. The plot is so generally delusional",
      "review_date": "2022-07-27"
    },
    {
      "review_title": null,
      "content": "D'un côté, j'ai envie de dire que c'est nettement mieux que le Solaris soviétique et je ne fais pas allusion aux moyens ou au budget (pas comparables du tout évidemment) mais au scénario et au rythme général beaucoup moins soporofiques... carD'un côté, j'ai envie de dire que c'est nettement mieux que le Solaris soviétique et je ne fais pas allusion aux moyens ou au budget (pas comparables du tout évidemment) mais au scénario et au rythme général beaucoup moins soporofiques... car ici le film ne fait à peu près qu'une heure et demi !Mais ça reste encore trop, hélas... le problème doit venir du bouquin original aussi chiant et ballot qu'une séance d'hypnose chez le marabout du coin et cette nullité absolue transpire jusque dans les deux adaptations à des décennies d'intervalle.C'est donc passionnant comme un épisode de Derrick et aussi stupide finalement que cette pauvre psychanalyse de comptoir qu'elle est censée être... et dans tout ça le gars Clooney ne s'en sort toujours pas... du tout. Il devrait retourner faire des Nescafés au lieu de prétendre faire l'acteur parce que ça ne va pas... du tout. Il n'est pas le seul à dire vrai, car seul Ulrich Tukur se débrouille vraiment ainsi qu'un autre inconnu au bataillon, l'Irlandaise quant à elle sourit bêtement et la Noire est vraiment très laide en plus de mal jouer, très mal jouer. On se demande comment on peut jouer aussi mal que ça ? il faut demander à What Else.En bref, mieux que Solaris premier du nom mais encore trop, beaucoup trop mauvais et chiant.",
      "review_date": "2020-02-29"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is quite a curious film. I say that as it has a definite mysterious feel to it from the outset, with the viewer not getting much in the way of insight into whats going on but the more we see, the more intriguing and complicated things may appear. George Clooney does well in his role as a psychologist and I thought it was quite atmospheric, with a real looming sense/feel to it and believable people acting erratically while on board the isolated research station in space. Its a bit of a slow burner of a film but its certainly not a bad one. I liked that the background music/sound effects weren't too loud and 'in your face' and I thought the dialogue was quite good at times, although it can't be said that there's constant dialogue as some times scenes pass without long and convoluted discussions. One thing I found a little frustrating was that in some scenes, the dialogue was quite quiet, with characters talking in hushed tones - this may be an issue for people who are hard of hearing. This film has a somewhat philosophical side to it, which I quite liked. The focus on a lack of memory intrigued me. Also, some scenes feature relatively shaky/jerky camerawork, which might frustrate some viewers.This is definitely more of an arty/'deep' philosophical film than anything else and so it may seem a bit pretentious to some but in any case, overall; yes, I would recommend this film as I personally found myself pretty engrossed in it.",
      "review_date": "2021-11-26"
    },
    {
      "review_title": null,
      "content": "It is based on an old sci-fi novel so take into consideration the science part of it will be kind of dated. I like slow suspenseful movies much more than non stop action but still this just didn’t do it for me. Not awful but not entertainingIt is based on an old sci-fi novel so take into consideration the science part of it will be kind of dated. I like slow suspenseful movies much more than non stop action but still this just didn’t do it for me. Not awful but not entertaining or thought provoking enough.",
      "review_date": "2020-03-30"
    }
  ],
  "num_reviews": 59
}