{
    "rating": 0.0,
    "release_date": "2017-10-27",
    "num_reviews": 84,
    "genres": [
        "Biography",
        "Drama",
        "History"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Heart Touching!",
            "content": "The most amazing foreign language film I've ever seen (and one of the most heart touching films ever, period)! I didn't plan on watching it, my parents and I were looking through movies and happened to come across this one and my mum said we'll just watch the first 10-15 minutes or so. Ended up watching the whole thing and not regretting a single second.",
            "review_date": "2019-11-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Good movie!",
            "content": "I am not Turk, so my perspective is no Xenophobic.I have to congatulate both the story and the movie, which is extremely well done , BRAVO!",
            "review_date": "2021-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Damn, Ninjas are Cutting Onions in this One!!!!",
            "content": "Definately deserving to be in imdb top 250 so that more and more people get to know about this epic journey of war, seperation and a heartfelt reunion will make your eyes watery feeling the grief and struggle of Suleyman. His hopeless efforts to survive the war and to take care of the little girl like his own daughter only to be seperated from her for 60 years will make you question the justice of the two nations towards Suleyman.\nDefinately a movie to be on your watchlists and to be seen by the whole world to enjoy this true story like both our characters enjoyed meeting each other like the stars aligned just to fulfill their promise to protagonist. A gem of Cinema and its power to tell a powerful story; not to be forgotten easily.",
            "review_date": "2020-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best true story movie in this year.",
            "content": "This is the first time for me to watch a Turkish movie. Plot, scene, acting and the story are all great. I should try more Turkish. Alsi, As a Korean, I must say Thank you to all Turkish veterans who risked their life to help my country which had nothing but ashes. Thank you so much. We couldn't be what we are now without your sacrifices.I hope more people watch this movie.",
            "review_date": "2018-09-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful, touching, inspirational.",
            "content": "I admit, 'Ayla: The Daughter of War' is not entirely what I expected. Part of me expected a war movie in the veins of 'Warsaw 44'. However, 'Ayla' is far more emotional, and not so much about war, but rather about humanitarian response to war situations. In this regard, it was truly exceptional.If the little girl doesn't steal your heart, nothing will. If Suleyman doesn't win you over as a caring individual and father figure, chances are nothing will. Ismail Hacioglu was fantastic as Suleyman, a character I really cared about and rooted for. 'Ayla' is a beautiful, touching and heart wrenching story. The film revolves around Turkish soldiers being sent to Korea, who encounter a young girl - as the only survivor - during one of their field missions. What follows next is a beautiful story among the horrors of war.Based on fact, this is an incredibly inspirational story. The film reminded me - to a certain extent - of the Chinese film 'Aftershock' and the Korean film 'Ode to my Father' - both exceptional films in its own right.'Ayla' is by far one of the most endearing war films you will ever see. Despite the dramatic element, the film also delivers some very effective comedic moments. 'Ayla' is a one of a kind war film, but might not satisfy everyone's taste in a war movie.",
            "review_date": "2020-09-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "True bonding",
            "content": "The part where the real pics and videos were shown 'live' got me teary eyed.",
            "review_date": "2019-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ayla",
            "content": "Ayla: The Daughter of War All is fair in love & war... Even at war; the sense of human value reflects, Winsomeness has its effect, we all need love ... despite that I am responsible for every child either mine or not, they ought to be safe and happy... Love is beyond language & nationalism... the world needs love",
            "review_date": "2020-03-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nothing is impossible in a movie",
            "content": "That could be served as a candy bar to forge the diplomatic relationship between two totally different countries. The good gesture offered by the goodwill Turkey movie maker was quite recommendable. There's no harm to do so that would show the people of the world that Turkey is a nation with great heart and profound humanitarian goodwill. Both of the North and South Korean governments and their people would fall in love with Turkey, especially their soldiers.",
            "review_date": "2021-01-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best well made true story",
            "content": "You will enjoy this well made movie which takes you from Turkey to Korea spanning a period from around 1950 to around 2010. It very touching, there are scenes of war, scenes of pure joy and tears of separation and joy of unification. All these scenes are acted very well, movie is well paced, does not drag itself, does not get political as it mainly focuses on the strong bonding of father daughter relationship between the Turkish man and the Korean child he found and protected for more than a year. There is no boring scene and you may shed some tears. Watch it.",
            "review_date": "2021-09-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great opening scene, wonderful closing scene",
            "content": "The trailer of movie talks about a lot of thing about it. But all scenes are completely warming up your blood. You are laughing at some scenes, crying at others or smiling like Ayla. There's war and demand of peace, there's hopelessness and hope, there's humanity and love in this movie. After theater there were a lot of people who were crying. :)",
            "review_date": "2017-11-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Caution : If u r an human being then it's going to forced u for cry.",
            "content": "The most powerful true story based emotional war movie i have ever experienced.\nMy friends, don't miss it.",
            "review_date": "2020-09-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely a great movie!",
            "content": "In my opinion this movie one of the best Turkish movies. First of all, this movie has a real story. In the Korean War, the Turkish army did great things.So history lovers might enjoy this movie.Also,the movie was very impressive.The relationship between the Turkish soldier and the little Korean girl was very beautiful.In summary,I really recommend this movie to watch.",
            "review_date": "2017-10-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "awesome movie",
            "content": "This movie is based on true story of a Turkish Sergeant Suleyman Dilbirligi's who went to Korean war in 1950. He found a little girl who lost her all family in the war and Suleyman cared this little girl until he left from Korea. However, they could meet again after 60 years. Actually, this is the best Turkish movie that I have ever watched till now. It is really pretty hard to explain my emotions that I've felt when watching the movie. From the beginning to the end, the movie made me locked. I strongly recommend you to watch this incredible and excellent movie, believe me, you will never regret and I am exactly sure that you will feel the pure love and innocence.",
            "review_date": "2017-10-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Deserved Oscar Nominee for Turkey",
            "content": "This movie was coming with it's own unique aura. We had knew that, the movie will be good from it's trailers, TV advertisements and etc. I'm proud that, this movie is our Oscar nominee. Also I'm very thankful to those whom worked for this movie, to bring us a masterpiece. The movie is so emotional that me, I consider myself as a non-emotional person, even I wasn't able to hold myself to not to cry. Being based on a true story makes it even better on my opinion. You can hold yourself to not to cry on the whole movie but just wait for the credits. When you watch the movie you'll understand what I'm talking about right now. Again, thanks to everyone who involved in this piece of art and show us real facts lived on battle zones. \"MUST WATCH IN THEATHERS\"",
            "review_date": "2017-11-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "OMG",
            "content": "I literally cried throughout the entire movie, and i hardly cry, wow, what an amazing sorty , and the movie captured it really well, great cinematography , music, EVERYTHING. I highly recommended watching, what a great masterpiece. Well done.",
            "review_date": "2019-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best turkey movie..",
            "content": "Very touching movie.. but idk why that time.. korean doesn't accepted adoption to turkey 🤔",
            "review_date": "2020-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Missed opportunity",
            "content": "Sadly the jingoistic elements, more prominent in the earlier stages of the movie, and out of touch unrealistic fighting scenes take too much away from what could be a memorable experience thus rendering it incomplete and hollow. The old adage less is more is once again proved correct.",
            "review_date": "2017-11-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Multicultural Movie",
            "content": "This movie is not local movie,ıt is multicultural movie..We watched a lot of movie about 2nd world war subject but this is after 2nd world war duration .If you want to cry when you watch movie,this is right option.War weary daughter is most important character.Sometimes crises create good chances,nice things in life.For daughter hero finds new father.Humanity win at this scenario.Korean,Turkey,United States are drawn together.Mr. Tekindor and Mr. Hacıoglu plays very well.",
            "review_date": "2017-11-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Missed Opportunity To Memorialize Forgotten Heroes.",
            "content": "Firstly, \"Oscar nominee of Turkey\" was a tag to attract Turkish audience. And i think it worked.Turkish soldiers who went on a mission for the Korean war were dramatic piece of history. None of us give enough credit for those spared for securing Turkey's position in modern Western World and NATO. But we know these soldiers proved both fearless and humanitarian during their duty. Was it a wise choice to send them and how it resulted? Here is not the place to answer. But we can say this movie was quite numb to the politics of 1950s and took just what it needed from those days.Based on a real story that we heard on TV before, scenario was the strong point of the movie. But instead of giving it the depth and character development it deserved, script plunged into silly sentimentality at all. Ismail Hacioglu, Ali Atay and even Cetin Tekindor failed to deliver something special from their selves. To make things worse like TV series seen on TRT TV like \"Diriliş: Ertugrul\" there were absurd and unrealistic fight scenes, Turkish Airlines and Hyundai ads. There was an irrelevant jump to the 1999 earthquake and scenario felt disconnected.Cinematography was not bad, there were beautiful shots and high quality. The real footage at the end was charming.Overall; another extravagant and shallow Turkish blockbuster film made a lot of fuss but nothing gained.",
            "review_date": "2017-12-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An underdog, which is competent enough to win the Oscar and be remembered for at least decades!",
            "content": "I have read a few reviews here before writing this and want firstly I want to state, that the negative ones have to be mostly ones, which only have the purpose to degrade this movie, because it is Turkish. Sorry mates, but you are gonna fail... again! THIS MOVIE IS JUST EXCELLENT! Why? 1) The actors aren't some no-names! They are proved people with talent for acting! 2) The story is based on a real one. 3) This movie combines all possible parts of peoples and especially the Turkish people and shows, that nation, humanity and love is above everything else! You can see Turkish communists, nationalists, humanists, Muslims, Atatürk, Americans, Koreans, the UN, different cultures and so on all living side by side. 4) Great special effects, great equipment is used.Just go and watch it! You won't regret!",
            "review_date": "2017-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mükemmel",
            "content": "In 1950, amidst the ravages of the Korean War, Sergeant Süleyman stumbles upon a a half-frozen little girl, with no parents and no help in sight. Frantic, scared and on the verge of death, this little girl captures the heart of Süleyman, who risks his own life to save her, smuggling her into his Army base and out of harms way. Not knowing her name and unable to communicate with her, Süleyman names her Ayla, in reminiscence of the moon on the fateful night during which they met. The two form an instantaneous and inseparable bond, and Ayla, almost effortlessly, brings an uncanny joy to the Turkish brigade in the grip of war. As the war comes to a close however, Süleyman's brigade is told that they will be returning home. Süleyman cannot bear abandoning Ayla, and does everything within his power to take her with him. After repeated failure, he is forced to give Ayla to an orphanage, but doesn't give up on the hope of one day reuniting with her. Will the two ever get back together?",
            "review_date": "2017-10-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ayla",
            "content": "I loved this movie. It was based on a true story and it showed us the world could be a good place even at war days. This movie makes you laugh and cry . And I think you should watch it",
            "review_date": "2020-02-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "this review tells the movie's outline",
            "content": "It's a great movie. Based on a true story.That makes me so emotional and I cried when I watched. Turkey's Oscar nominee. This movie to deserve it. If you like drama movies you must watch Ayla. The cast is very good. The acting is very good. Korea's only brother country is Turkey. So this movie is telling our history.",
            "review_date": "2017-10-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent movie",
            "content": "It was the best Turkish film I watched.All benevolent people around the world should watch this movie. I hope that children will not be victims in battle.Everyone was crying after watching this movie. I was about to cry but I did not cry. It's a controversial film.The battle scenes were also very beautiful.Film is also a positive feature inspired by a real achievement. I recommend you watch this movie.",
            "review_date": "2017-11-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "emotional",
            "content": "The emotionality of the film was too much and it really made emotion feel. the acting was very good(especially front roles.) it was a realistic film. the soundtrack was impressive.\nbad features; the film moved much faster than it should. there were expected action scenes. apart from that. and fighting-battle scenes were not realistic, more action-oriented. And so many things like that were lowering quality. like cliché events and characters. it was a beautiful and impressive film with sentimentality.",
            "review_date": "2018-09-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heart touching movie..!!",
            "content": "A korean girl become orphan because of world war then a turkish help her being father and gaurdian...unfortunately he left her in korea and went to turkish...after 60 years fortunately they meeting together..\nSoul melting movie..by hearikng itself i xan feel this movie..\nMust watchable movie..!!!",
            "review_date": "2020-08-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the most dramatic events in history...",
            "content": "As i say, this movie is the one of the most dramatic events in history. The reletionship between Ayla and Suleyman soldier is pretty like bond between father - daughter... Story was magnificent.\nA beautiful story like this could only be told so bad...\nAn ordinary person could have made another emotional impact even if it tell this story to another person directly...\nSorry Can Ulkay but you screwed up your first job.\nSorry Yigit Güralp but you screwed up AYLA's story like your previous jobs.\nYou must have worked so hard to make a film and ruin such a wonderful story ...This is my personal opnion.",
            "review_date": "2017-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very emotional but a missed opportunity",
            "content": "I watched this movie with previous knowledge of the Turkish Brigade in Korean war and the actual story of Ayla and Süleyman. I thought the subject is interesting and it would be successful especially for Turkish viewers. However at the end I had mixed feelings about it. It was quite emotional, for a father to watch. There were quite funny parts as well. However, I think it was a mistake to use the identities of the original people in the movie as it probably portrayed characters quite differently. Süleyman in the movie was down right obsessive and too irrational when it comes to leave her in Korea. Behavior of his actual daughter against him later in the movie was also unusual. From what I know, actual events did not unfold that way. Actual events were emotional and dramatic enough, why put unnecessary agitation?During the war, Turkish soldiers were known as fierce fighters and not to retreat without a good fight. Indeed during the battle of Wawon (Kunuri) they fight against overwhelming Chinese troops for their life. When their ammunition depleted they fought with knives rocks and fists. In the movie they try to insert this with little success IMO. Perhaps portraying actual events more realistically would be much better (watch Tae Guk Ki for the contrast in battle parts). I think with more side stories and less deliberate emotional push, this movie could be very good. I would give a 6, but for the effort, it deserves a 7.",
            "review_date": "2017-10-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Incredible cute little story",
            "content": "Sergeant Suleiman from Turkey finds a abandoned little girl in the war field while he serves in Korea. This little girl captures the heart of Suleiman and he takes her of him and name her as Ayla. The extraordinary father daughter relationship brought a heartwarming joy to other soldiers in the amidst of war. When the war comes to close Suleiman been asked to return to home country, but he is hesitant to abandon Ayla. Rest of the story narrates what happened to Ayla when war is over and will he takes her with him or not??Its an incredible movie based on a true story. The cuteness of Ayla and her bonding with Suleiman will definitely steal our hearts.",
            "review_date": "2020-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great story ruined by a bad director",
            "content": "A heart-aching \"based on true events\" story. Could have been better without Ali Atay -playing himself as always-. I wish a remake of this movie with a better Turkish director and an editing team would be possible. Commercials of the movie introducing it as \"The Turkish candidate for Academy Awards candidates\" is also problematic.3 points for the story, 3 points for the little girl, and 1 point for the sake of development of Turkish film industry.",
            "review_date": "2019-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Please don't forget the children's of war",
            "content": "May be it's not objective to write something about my nation. But i think there is not much examples like Ayla in human history. While living in the rage of war thinking different when you see a little helpless girl in battlefield is so hard. Film based on a real story. Real good action scenes bundled with a strong emotion of humanism. Great acting . Also soundtrack have a great impact in the quality of film. Ayla was a lucky one when you look at the numbers in human history. We host more than 1 million children of war in our country while in deep sorrow while thinking the ones we cant rescue... And a strong message to politicians : Who can explain the cause of tears shed by a children of war ?",
            "review_date": "2017-11-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "absolutely perfect",
            "content": "A very good movie... a true story... one of the rare movies I've ever cried for.. watch it and have it watched.Good acting, right story, and permanence.",
            "review_date": "2022-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best movie",
            "content": "Just saw this amazing movie, clearly I can say this movie will be one of my all-time favourite..\nLove from India...",
            "review_date": "2021-06-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good",
            "content": "Although this movie is overrated, it was a good movie.The detail that makes this movie overrated is that it was made for people to cry. It has a good topic on it. The movie is inspired by the real event. It was an emotional movie. The little girl was very cute.",
            "review_date": "2021-08-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Has a big potential , but wastes it",
            "content": "This movie has a big potential. But unfortunately,movie waste this potential. First of all, this movie is far from war psychology. The motivations of the characters are not told to us correctly. I think the emotions of the characters in a good war movie is so important. But in this movie , characters inside are too empty. They say nothing about war.At the same time, movie uses unnecessary scenes to make audience cry.The second half of the movie is completely different than first half.İts like watching two different movie.There is a big problem about time jumps.The older part of the main character is longer than necessary.In addition, the film contains propaganda than necessary. Also in movie war has not been shown to be painful on both sides. So the war in the film is not neutral and realistic.But on the other side Ayla has great acting. Every actors and actresses perform flawless.Production is beautiful. War scenes are exaggerated, but pleasant and realistic.As a result Ayla is an average movie.Not bad,but not that good.",
            "review_date": "2017-11-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "best movie ever",
            "content": "This is great movie with a true story of a soldier and a little girl. It nominated for the Oscar Award. Though it already gets the Oscar of our hearts. The script is so incredible and shockingly true. While you are watching you will laugh a lot and you will cry a lot too. I have watched it three days ago but i already miss that characters in the movie like they are real. I want to watch it again and again. Give this movie a chance. You won't be regret it.",
            "review_date": "2017-11-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "expectation",
            "content": "I was expecting more from this film because there was a very good cast",
            "review_date": "2018-04-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Horrible fluff",
            "content": "As a huge fan of Turkish cinema I tend to give all Turkish movies a 10, that's just how we roll in Turkey but I guess living in the West inifidel ways are rubbing on me and I'm starting to feel that maybe we shouldn't be misleading international movie community and treat others the way we'd like to be treated. So for this one, I'm calling it the way I see it, it's dreadful, overly emotional fluff with poor directing and acting that's common in Turkish movies but is probably perceived as a bit premodern elsewhere. Best skipped unless you're really aching for a Turkish movie about the Korean war.",
            "review_date": "2020-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Turkey and South Korea co-op",
            "content": "The movie is opening up with a beauty of korean nature, and you see the little village where is Ayla living.\nThen suddenly the North Korean troops enter the village and plunder everything, kill everybody, including girl's parents.\nAfter this scene you are in Turkey, and watching Süleyman's life. \nI don't want to talk more about progress of movie.\nLets skip this and talk about the other things.\nI think the history lovers will like this movie, but generaly the drama part is dominating it.\nAlso i have to say that the stars have a great performing, especially the little girl whose name is Kim Seol.\nHer acts was spectacularly. This little girl provided the fluency of the movie. I really like it.\nNow lets take a look at the cinematography.\nThe Korean cinema industry definitely master in this.\nYou will fall in love with the shooting.\nBriefly, I recommend you watch this movie, it adds a lot to your life.\nOh one more thing, don't miss the after credits scene.\nWell, is there any bad thing of Ayla movie?\nOf course there is. I think some scenes make no sense, they were unnecessary.\nBut it keeps a low profile. I mean it is not a big problem with the movie.",
            "review_date": "2018-03-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "we cannot even imagine such a story that he lived ((",
            "content": "i have seen the documentary long time ago & cried a lot.movie was great but if you know that's a real life story than all you can do crying & trying not to annoy others...recommend that first see the documentary than the movie! cast was amazing! especially \"Ali\" he wasn't acting he lived & died!",
            "review_date": "2017-11-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What an Masterpiece Movie 😭😭😭",
            "content": "This movie is based on true story of a Turkish Sergeant Suley man Dilbirligi's who went to Korean war in 1950. He found a little girl who lost her all family in the war and Suley man cared this little girl until he left from Korea. However, they could meet again after 60 years. Actually, this is the best Turkish movie that I have ever watched till now. It is really pretty hard to explain my emotions that I've felt when watching the movie. From the beginning to the end, the movie made me locked. I strongly reco mmend you to watch this incredible and excellent movie, believe me, you will never regret and I am exactly sure that you will feel the pure love and innocence.",
            "review_date": "2020-03-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must watch movie",
            "content": "Very nice movie. Real story. Very emotional. If u are thinking to watch a good movie, please don't miss it.",
            "review_date": "2020-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The film is not natural",
            "content": "Characters are not realistic. Looks like bad nationalist American movies.\nHe does agitation, but he can't do it.",
            "review_date": "2019-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "historical errors",
            "content": "Perfect real story. The story is in the year 1950 and 1951 but unfortunately almost every detail in the movie is from late fifties or even sixties... almost none of the cars, jeeps, radios, anti aircraft guns, choppers used in movie does not exist in 1950. let alone the details as terrible M4 Shermans or plastic water tanks, you may easily see a 55 Chevy around... there are only two cars to exist in the year 1950 as I noticed in the movie.",
            "review_date": "2017-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Weak cinematography perfect story",
            "content": "The bugdet is over the standarts of film industry in Turkey for this film. Still i was able to see cuts and edit problems. Almost every gun fight scenes over exaggerated. The guy walks onto 3 guys and kills them bam bam. I mean cam on... This isnt a super hero movie. The more reality the better this film could've been but i think director kinda spoiled it a bit. Other than that production was great as i said. Overall it could have been much better. What i saw did not satisfy me but the story. The reason i am giving 7 point is because of the story. It can be the most impressive film based on a true story i've ever seen.",
            "review_date": "2018-10-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heart touching movie",
            "content": "I cried. I recommend to all watch the movie. It's really a heart touching movie. Ayla is really a cute girl.",
            "review_date": "2021-07-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Average Melodram",
            "content": "It's just an another emotionally heavy movie for mass crowds.Acting is not believable.A heavy budget movie that tailored just for an Oscar nomination but fells apart short.There are hundreds of such movies all around of world each year.It is not a remarkable work.İf you are an emotional person who like to cry when eating your popcorn don't forget your handkerchief.Don't waste your money.",
            "review_date": "2017-11-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "About movie",
            "content": "I watched the movie \"Ayla: The Daughter Of War\" in my school years on the recommendation of my classmate. The film is based on real events, and this fact immediately hooked me, since such films have always caused me only positive emotions. It can be seen that everything in the film is as idealized as possible, and the emphasis is only on the relationships of the main characters, but still it's worth watching the film to remember once again that you need to believe in goodness and love, and even more to believe that there are men in our world who are ready to live for the sake of children and give them their love.The film itself tells how in 1950 the main character Suleiman, along with Turkish troops, was sent to Korea to participate in the Korean War. And while on patrol, he finds a little girl whose whole family died. The girl didn't say anything, so the soldiers started calling her Ayla. Knowing nothing about the upbringing of children, Suleiman, however, is completely immersed in taking care of Ayla and, naturally, this leads to the fact that he becomes attached to her as a daughter. Of course, one could say - there was no need to get attached, but they pulled the child out of the horror of the war. Therefore, Suleiman and his wife are heroes in my eyes, because all these years they have not given up and fought to find Ayla, their named daughter.If we talk about the acting master class, then I would like to single out the girl - the main character. At first glance, there is a feeling that the child is somewhat sedentary, insensitive and just does what her told. But when you look into her eyes, you feel unselfish love, warmth, peace, wisdom in them, and they have such sincerity and life that is ready to calm an adult and make them believe in the best, even though the fact is that tanks and machine guns are rumbling behind their backs.If we talk about the work of the director and cameraman, there are no bloody scenes in the film, or scenes with elements of violence, nor do they show excerpts of how someone was torn apart by explosions, of course there are scenes with murder, but they are shown casually and not in close-up, it would be impossible to do without them, everything-still a film about the war and the events that took place during that wartime. The scenery in the film is military-field, which can be dug up wherever there is land, so almost the entire film only shows slums, poverty, devastation, land.Summing up, we can say that it turned out to be a really correct and very strong film, which I advise you to watch unequivocally and without any doubt.",
            "review_date": "2022-09-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Emotional Movie!",
            "content": "The film has some flaws and I felt like the second part had some disconnections with the first one, but anyway it is worth to watch it! And the fact that is based on a true story makes it even more emotional and touching! I recommend watching it :)",
            "review_date": "2018-06-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another ridiculous movie. I give this one star to the real story.",
            "content": "I like the story itself a lot, the child and a Turkish soldier at the Korean war. It sounds interesting already, right? But they ruined that story with this movie. It was another movie with bad acting + bad script + shallow characters + over exaggerated scenes.\nI couldn't see that characters were in a war, it was like they went there to have fun. They had no idea what they were doing. They showed everything different than it was.\nI lost my grandfather in that war, it's disrespectful to those people who forced to go there and gave up on their lives.The best thing was only seeing the real actors of this story, and the rest was a complete mess.\nAli Atay's character and acting was too bad I was shocked, because I'm a huge fan of his most famous TV series. He was acting like Mecnun, as he usually does in every project he is in, and it doesn't make him a great actor.\nThe other actors were also not well chosen.The story made us cry, not the movie. And I think the score of this movie is overly high than it deserves.",
            "review_date": "2019-04-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing",
            "content": "A must watch movie for sure. You won't remain dissapointed",
            "review_date": "2019-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very nice real story bad application.",
            "content": "I know similar stories from korean war as a grandson of a veteran. I was excited by the cast too. But awefull scripting and bad directing ruined a perfect potential. As a movie lover I would like to ask the crew: how come you have spoiled that much that Ali is going to get shot begining from the concert scene? ( the dialogs, taking off the helmet)\nHow come you can not shoot an earthquake sceene?I am really sorry that this perfect cast and original story is ruined like this",
            "review_date": "2019-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Propaganda video to make the sponsors happy",
            "content": "Seemed more like a propaganda video than a proper movie, with sponsor companies overshadowing the mediocre acting and agitative screenplay. A terribly missed documentary opportunity, though. The story itself deserves to be used in talented hands to be filmed. But not like this one that spent millions to use equipments and technical staff to create such a shame. The only touchy part was to see the real people in the end.",
            "review_date": "2017-11-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Number one turkish film",
            "content": "It is the movie of Turkish cinema that has the best scenario and fiction ever. It is the number one Turkish movie.",
            "review_date": "2020-04-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Touching",
            "content": "I have no idea to say about this movie but it's something very precious. The storyline is normal, straight forward, but I can't predict anymore. I thought this movie is telling about war, including the violence on it, in fact it's all about compassion and love.",
            "review_date": "2022-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "10/10",
            "content": "Take the Korean War from a different angle, watch the native strangers everywhere It's a full-fledged masterpiece that can impress. will take place in the Oscars and even take an Oscar and return home In progress.Especially when it is a true story and the heroes of this story are still alive, it creates a different pleasure against the filament. I highly recommend watching your document with the documents of the South Koreans about Ayla after watching the film.",
            "review_date": "2017-11-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "best of drama films",
            "content": "One of the best FIM I've ever seen. the end of the movie was very nice.",
            "review_date": "2018-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Touchy",
            "content": "Ne of the best Turkish movie. Solid material, very dood script, nice cast and acting.",
            "review_date": "2019-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "too long second part",
            "content": "You can be sorry for loosing your adopted child after trying to reach her. But after 47 years the guy still sorry and thinking her like the first day. Come on no one buys it. Actually the second part is totally unnecessary. You can easily drop it and jump to the last scene.",
            "review_date": "2019-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece",
            "content": "Amazing,mind blowing,superb, fantastic,mervelus ,must watch masterpiece",
            "review_date": "2018-08-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Best Movie Ever!",
            "content": "I really recommend this movie for everyone especially for those who really like heartwarming movie. This movie are based on the true story so it really hit me. I cried!!!!!!!!!! I wish i could be like ali and suleyman. I also want a wife like nimet!!!!! For those who doesn't like this movie and watch this after seeing my review you can chat me on instagram. Lets have a debate on the message. Azrolhalil.",
            "review_date": "2021-07-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Shockingly bad. Anyone who likes this enjoys emotional kitsch",
            "content": "Every few years, America makes a movie about how going to Vietnam made their soldiers sad :(. This is the Turkish knock-off version of that. Not really interested in soldiers who felt emotional in a war they were on the wrong side of.No thanks. Watch it if you are sado-masochistic and/or like staring at paint dry.",
            "review_date": "2021-03-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic story to be watched,, amazing production and actors",
            "content": "Love it from the beginning till end,, my tears couldn't stop,, I'm fan of turkis films,, this one really hit my heart.",
            "review_date": "2021-05-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very heartwarming movie.",
            "content": "I absolutely adore this movie. Very few movies can move me the way this movie did. The acting is very convincing and I love how, amidst all the chaos in the war, Suleyman continued to care for Ayla, treating little Ayla as his own. No matter the language barrier they have, love and humanity do bring people together. Not gonna lie, I cried hard when he had to leave Ayla. But spoiler alert...they did reunite after 60 years. Happy ending indeed.",
            "review_date": "2022-05-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best biopic film I have ever seen.",
            "content": "After the film, I was still impressed for a few days, this is a masterpiece, the film is really based on a real story, after watching I watched many video interviews with people about whom the film was made.",
            "review_date": "2021-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "masterpiece.",
            "content": "I m not qualified for comment this. Watch it, feel it.",
            "review_date": "2020-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Alya daughter of war",
            "content": "Pls let me watch movies in heard good movies Alya.n it beautiful story not see all saw trailers tempertory I just want full movie. I hope get soon watch movies til end n Alya is beautiful n I know true story n long time ago.",
            "review_date": "2022-07-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Breathtaking",
            "content": "No need to say more about this movie, it's a masterpiece and deserves the highest scores in each and every category. Ayla : Daughter of War should have won the Oscar but just because it's a Turkish production it has not even been listed for a nominee. I congratulate everyone who has been involved in the process of making this great movie!",
            "review_date": "2018-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Based on a true story..",
            "content": "Already watched the movie for 3 times.. I believe that it is the best Turkish movie ever made. The story is about a little Korean girl and a Turkish soldier back in the 1950's. It will definitely touch your heart. It is said that the film is going to nominated for the Oscars; I have no doubt that it deserves an Oscar :)",
            "review_date": "2017-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing",
            "content": "This film is a true story so it's very exciting.Everybody cried who watched this film without me.",
            "review_date": "2018-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of best movies a ever watched",
            "content": "Really good movie,Actors are really good,story is real and not boring i think u can watch this movie",
            "review_date": "2020-08-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Like For Like The Movie",
            "content": "I think the movie story about daughter and the family. So if you watch this moview very scary or good.",
            "review_date": "2020-09-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing",
            "content": "Incredible picture editing, soundtrack combined withan amazing story that will make you laugh at times and cry uncontrollably.",
            "review_date": "2019-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A masterpiece with tiny flaws",
            "content": "I was super hyped since the releasing of the first trailer. And I do not regret watching this masterpiece - but there are a few tiny little things that bothered me.Attention spoiler! We get to see the story of Süleyman and Ayla. The dosage of Süleymans story was perfect - not too much, not too less. But what I missed was Aylas life after the war. How she adopts to her life without Süleyman. We hear that her husband dies and and that she works as a cleaner but I wanted to see the little Ayla missing her father Süleyman but not giving up on her life. The second thing was the war. Yes it is a story of Ayla and Süleyman but personally I wanted to see more details of the war, the soldiers, their psychological status and maybe more war scenes. There were a few - but apparently not enough for me. Although I missed some little things I've enjoyed every second of this movie. The actors were great. Every scene they played I felt with them. The soundtrack, the editing and the effects were literally on point. I would watch Ayla again and again and won't be bored with it.(If I have any misspellings I'm sorry ignore them :) )",
            "review_date": "2018-01-20",
            "lang": "en",
            "source": "imdb"
        }
    ]
}