{
    "title": "G.O.R.A.",
    "rating": 8.0,
    "release_date": "2017-03-10",
    "num_reviews": 77,
    "genres": [
        "Adventure",
        "Comedy",
        "Sci-Fi"
    ],
    "summary": "A slick young Turk kidnapped by extraterrestrials shows his great « humanitarian spirit » by outwitting the evil commander-in-chief of the planet of G.O.R.A.",
    "reviews": [
        {
            "review_title": "Pretty Fun",
            "content": "Despite a lot of complaints that non-Turks would not find this funny, I did. I have seen it twice now. I do quite enjoy it and find much of it funny, with some parts extremely funny. Granted, a few things were not especially original, or were pretty tired or crude without being humorous to me, but these were minor problems and films like this always have some jokes that don't appeal to everyone. I cannot say I don't like a movie simply because I personally don't like some of the jokes or gags. Overall, the film was quite well-done and most of the jokes or spoofs of culture and films worked quite well.One fun thing is to see this sort of film made from a Turkish perspective, rather than American. It puts a new twist on some things, even jokes that we've seen before or which would have been in an American or other film.In part, I am sure my enjoyment of the film is helped by the fact that, while hardly being fluent in Turkish, I do know some Turkish and am quite familiar with the country. Therefore, while there are a number of very Turkey-specific jokes, I was able to enjoy at least some of them. I would therefore agree that a decent understanding of at least Turkish culture and recent history, if not the language, will enhance one's enjoyment of the film.Other humour in the film seems pretty universal. As a result, there are quite a lot of jokes and spoofs that I know many Americans and Western Europeans would get. Again, while some are tired or crude, many are really quite funny and pulled off quite well.I think that my biggest complaint is that some themes were not taken far enough. For example, more could have been done with the carpet salesman thing since that part was really quite funny and had more potential than the film exploited.In the end, this is a pretty well-made, funny, and entertaining film. It could have been better, but it works well and should provide quite a few laughs, especially if one knows much about Turkey. It's rather silly, but that is pretty much the point, and the silliness here is mostly quite entertaining.Although not really relevant for my discussion, I shall add that this film is also a milestone for Turkish cinema in terms of the special effects and production values for a film of this sort. I think it's important to recognize this, even though I was primarily concerned with giving my opinion of the film's content, etc. Thus, while one may be able to criticize some visuals compared to some big-budget Hollywood films, the production values/special effects are pretty good, especially considering the context.",
            "review_date": "2005-03-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Commandant Logar, an object is approaching...",
            "content": "I have inflicted this film on every house guest for the last two years. Why have I done this? First, because I am exceptionally cruel. Really, that's true. But second, I have done this because it is a very clever film from an unlikely source. How many Turkish films have you seen lately? Okay,\"Once Upon a Time in Anatolia\" should be a must-see for everyone, and you might have stretched to \"Iklimer\" or \"Three Monkeys\", but after that? After that is \"G.O.R.A.\" This film is strangely unappreciated. As I tell all those who fall within my grasp, this celluloid baby is the best Turkish sci-fi comedy ever made. Of course, they retort: how many Turkish sci-fi comedies are there? But that's not the point. Instead, you should prepare yourself for an onslaught of charm from the very talented comedian Cem Yilmaz, who also wrote the film. (Which is probably why he gets to kiss the stunning Ozge Ozberk.) No, it's not perfect- there are a few too many moments of physical comedy with Ozkan Ugur, one fart joke too many with Rasim Oztekin, but overall, it's a great antidote for those who don't expect smart comedy from outside the traditional powerhouses of the international film circuit. And for those of you who don't know - the fourth element is not wood.",
            "review_date": "2012-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Turks in space",
            "content": "Well, first of all, this movie is a good project. There is no science-fiction film in the history of Turkish cinema, and if you think about the budget, which was about 4 Mio. USD and nevertheless huge for Turkish proportions, George Lucas wasted a budget of 125 Mio USD for Star Wars Episode III, then it is the optimum of what has been created.The story is no revolution, but no one ever expected that. Cem Yilmaz realised his vision of \"Turks in space\" and made his work well. His love for details is average.To understand everything in that film, first you gotta be Turkish, since a big part of the humor is based on the street language that Cem Yilmaz is using perfectly. The second thing is, you have to know some US Science-Fiction movies like Star Wars, Matrix or Star Trek. Only the combination of these two requirements makes the movie really funny.G.O.R.A is unusual to the Turkish public, so this is why some people didn't like it I think. I consider this work as new era of special fx in Turkish movies.In the end, it is a solid Turkish space movie.",
            "review_date": "2005-05-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I laughed the whole time, it was great!",
            "content": "I saw this movie today and thought from the first scenes that it would be a disappointment, but when Cem Yilmaz (the main actor) showed up the movie became really funny. He is a macho Turkish man who is kidnapped by aliens. The reference to many sci-fi movies is nice, but the real fun comes from the dialogs Cem Yilmaz makes. It's the first time I saw a Turkish film with so many special effects, that is great. The only bad sides are that it makes just to many jokes about homosexuals which becomes boring and the hero saves the planet just to easy. But it's a comedy, not the filming of a book so that is understandable. The most hilarious part is at the end when Arif (Cem Yilmaz) jumps in the air and makes a karate move like in Matrix with the camera turning around him. The only difference is, this time he makes a very strange move!hehe",
            "review_date": "2004-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A fantastic Turkish Space Movie",
            "content": "A fantastic Turkish Space Movie !!!Maybe my background has a big role that I find this movie the best movie at last time. We are overrun all time with the US films and film industry.There are only the best US films, US film makers and the view of US to all idea's. Forget it! G.O.R.A. is a proof that the other people can make a good film, with a good view of the another angle.I thank the maker and the actors/actresses of the film very much that they have given a good gift with this film.",
            "review_date": "2004-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A classic",
            "content": "Everybody can find a scene to laugh. Awesome writing, i even read the uncut parts, i suggest you to buy the book(uncut scenario). If you dont laugh watch it alone! You can lie to others buy not yourself.",
            "review_date": "2020-09-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I laughed the whole time, it was great!",
            "content": "Cem Yilmaz's best film no doubt.I still know the jokes by heart.",
            "review_date": "2021-08-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "good piss take",
            "content": "Arif is a typical Turkish bloke selling carpets to tourists in Western Turkey. He is also obsessed with creating fake pictures of UFOs. Then he gets abducted by aliens from the GORA planet. After all there is no rule that says aliens can only abduct people from the USA. Nor is there a rule that says that only Americans can make contact with extra-terrestrial life forms. So what happens if aliens abduct a Turkish carpet seller ?Basically, GORA is a good piss take of the more popular sci-fi movies such as Starwars and Matrix. And that's fine with me, because I believe both Starwars (feel the Farce) and Matrix (I know Kung Fu) are extremely overrated movies. The sense of humour in GORA is Turkish. That is neither a praise nor an insult. It is just Turkish. The subtitles don't help either. For some reason Turkish movie producers hire awful translators who sometimes even mix German with English. Translation between languages that are as different from each other as Turkish and English requires slightly more than a word-by-word correspondence. I hereby offer my services free of charge. Just ask. Had the subtitles been any better the movie could have achieved some international recognition as a comedy movie. Turkish speakers should definitely watch this movie. They'll have a good laugh. Non-Turks should give it a try.",
            "review_date": "2004-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Turkish Movie",
            "content": "I think that gora is by far the best & funniest Turkish movie ever made.Cem Yýlmaz's acting performance is great. One negative thing about the movie is that it contains far too many local jokes which makes the movie quiet Turkish audience oriented.Cem is great as a writer too we hope to see his work in a sequel gora 2 or even 3. little explication for the foreign readers: Cem Yilmaz is the best stand up comedian in Turkey he is half-way between Jerry Seinfeld and martin Lawrence. He mostly uses his daily experiences in his scripts and plays. He also used some of his play jokes in the movie too.",
            "review_date": "2004-12-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great science fiction comedy / spoof",
            "content": "This film parodies various earlier films and is so joke-driven that it often comes close to breaking the fourth wall, but it also works as a 'straight' science fiction comedy. It is based on the tried and tested premise of an everyday character suddenly being catapulted into a space opera plot. Earlier classics based on this premise include Turist Ömer Uzay Yolu'nda (1973) (also known as 'Turkish Star Trek') and The Hitchhiker's Guide to the Galaxy (1981).The film has high production values, which makes it stand out among Turkish films (at least compared to earlier films). Apparently it was only marketed in Turkey, which is a pity because most of the humor is international. Some of it pokes fun at specific Turkish circumstances, but can be understood by an international audience. The few untranslatable elements, such as the weird pun that motivated the movie's very name, could easily have been glossed over in the translation.My only complaint is that for my taste, the film contains far too many jokes related to male homosexuality. Fortunately they are not as blatant, pervasive and obnoxious as those in Dreamship Surprise: Period 1, a far worse science fiction comedy / spoof that also came out in 2004. (This German film enjoyed some limited international marketing and I believe is much better known internationally than G. O. R. A. is.)",
            "review_date": "2021-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No Offense",
            "content": "But if you are not Turkish or really smart you cannot understand this movie. Its the funniest movie ever and its not like regular \"american\" comedy which is all about funny faces and screaming. But the best american comedy are the comments here :D Some people taught this movie is a Hollywood wannabe . But it actually is a make fun of hollywood movie.Sorry guys get back to your movies we all know its a huge problem for you to read subtitles.",
            "review_date": "2022-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "funny movie watchable",
            "content": "It's a funny movie. Watchable. I liked it. It's those mind odd funny stupid movies, you would like to watch while drinking.",
            "review_date": "2021-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Novel Perspective",
            "content": "There are several movies set in Turkey that has been remembered quote by quote such as Hababam Sinifi, or the works of Zeki Alasya and Metin Akpinar. This one has been the greatest work of Cem Yilmaz, a collection of his observations and witty comments on Turkish lifestyle. When you ask people about a quote from Hababam Sinifi, almost everyone in the country will remember and show their appreciation of the work. Just as Hababam Sinifi, GORA has been the reference point for many jokes that has been used by all age groups in Turkey. I for myself watched it at least a dozen times and still can find novel jokes and anecdotes while watching it. It is full of both subtle and explicit jokes in every scene. It would not be fair to expect a great cinematic experience from this very movie as scenario and the rest is secondary to the jokes, and it is an early work of Cem Yilmaz and his crew together. However, if you want to study Turkish culture, this movie will be one of the greatest examples of the society.",
            "review_date": "2020-06-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My first movie!",
            "content": "Yes, this is the first movie I watched in the cinema. And I wanted it to be the first comment I made on this platform.By the way, it was a movie that I laughed a lot and had a lot of fun.",
            "review_date": "2021-10-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect comedy with bad luck",
            "content": "The movie is funny. Except some essential Turkish jokes, it's comic for any one. There are so many details that can make a man laugh.We seen large super computers at Matrix, that loaded something to Neo, in GORA they used a Commodore 64(a computer classic :) )to do it. An android fortune tells to princess with Turkish coffee, these kinds of details are make movie much more funny. Story is great, acting is great, details are great, some Special effects are not so good, but it's not a Hollywood movie, and also CEM YILMAZ, he wrote and also played perfect. He is really funny and perfect as in his other advertisement movies and old movies",
            "review_date": "2004-12-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "hilarious...",
            "content": "What are your expectations when you go to see a film? The most noticeable characteristic of Turkish people is that they are able to subtly critise their own culture through comedy and this is what the film has done superbly. When I read general reviews of this film, including the ones on this site, I can't help but see how Cem Yilmaz has quite cleverly and creatively worked a variety of cultural characteristics into a fictional theme. I believe that viewers who have reviewed the film in a light of this have done it justice... and come on, if there are so many 'Arif's out there, how can we still question whether or not there are extra- terrestrial life forms out there too! :-)This is a highly successful and thoroughly hilarious film. When I walked out of the cinema, it didn't even cross my mind to analyze the film in the way I usually would.. I mean why should I? I really don't believe the writer or director even thought of doing this themselves. it's not 'persona' or anything. I experienced two hours of solid laughter. I mean what else would I have wished for? (When I think back though, the only down side was I didn't buy enough pop corn...:-))Personally, I didn't feel the need to overstress the superb quality of the visual effects either. Yes they were surprisingly fantastic, very 'Hollywood', but this didn't add or take away from the film in any way. Put it this way, if a song is beautifully written then it will sound great even if you were to just serenade it. But if the song is crap/ badly written, then even the London Philharmonic Orchestra can't do much with it believe me!In short, this film must not be missed! Leave all your expectations at home and don't watch it with any intention of reviewing it... just sit back & enjoy.",
            "review_date": "2004-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Quite entertaining movie with an outstanding comedian",
            "content": "Cem Yilmaz has been the most outstanding comedian during the last 10 years in Turkey and he continues to do so. What he did so far is a great achievement and Turkish people knows that. He primarily makes stand-up shows but he is also busy with writing and acting; in which he is very successful in my opinion.The movie here looks like it's all around Cem Yilmaz, but we must say that the other people of the movie did their job just as successful.This a sci-fi and a comedy movie. Cem Yilmaz plays a typical Turkish guy who runs a carpet shop. He is also busy with producing fake UFO photos. Then he is taken by an alien spaceship and transported to the planet Gora.The situation of a typical Turkish guy in a sci-fi environment was quite funny for me, but also I guess that a non-Turkish viewer would find it just as funny. Other characters are acting quite well. Ceku (Ozge Ozberk) is gorgeous.This is the biggest budget used in a Turkish movie so far, so don't expect poor scenes behind.",
            "review_date": "2005-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Classic!",
            "content": "It's very very hard for someone who isn't Turkish to understand this film. It's such a good film that our family gets together and watch it every year and you understand it different after every time you watch it.",
            "review_date": "2019-07-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good for beginning",
            "content": "The Turkish films I have seen from my childhood to G.O.R.A. have based on love, politics, and daily events. Turkish movie industry hasn't produced one good action and science fiction film yet, but G.O.R.A. is a beginning for the films including detailed computer effects which are usually used in the most basic science fiction film.Yes, G.O.R.A. is not a science fiction film. However it contains too many computer based effects that have ever used in a Turkish film. Also these effects are produced by Turkish movie companies. At some frames the effects were so basic and awkward, but being a comedy film could handle this crude details.Anyway, G.O.R.A. is a simple Cem Yilmaz film. As a classical behavior of Cem Yilmaz, it contains galore slang dialogs. However at the most frames of this movie you won't be able withstand your laughs.",
            "review_date": "2004-11-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Vitality",
            "content": "The movie has great sense of humor! The actors are really understanding the Director's idea. I am happy for the making of one such vital movie. I spoke with a lot of people from Sofia, and they really appreciate the appearance of G.O.R.A. movie. I don't know if someone has decided to manage this movie outside Turkey, but I am sure, it will be successful in all parts of the world, where people have not lost their sense of humor. I would like to say, that everyone, who likes the fantasy genre, should/has to/must:) watch this movie. It makes a new reading in the idea of fantasy films. The serious situations are mixed with a lot of jokes, which I enjoyed a lot. The story is intriguing, the characters are realistic and original. This movie is counterpoint of all movies, which are made too seriously without the necessary depth/reason, which we are able to find in many funny movies. In G.O.R.A. movie we are able to find enough human sense and wits. The relation with the Matrix and other fantasy movies is made with easiness and only in service of the screenplay. The main idea is original. I hope that this is the way of the funny fantasy movies to develop in the future. The real life is not so funny and this sort of movies make people laugh for near 2 hours and forgot the daily issues. I would like to send my sincere greetings to the G.O.R.A team, and wish them other successful movies.",
            "review_date": "2005-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "G.O.R.A: Cringe inducing",
            "content": "G.O.R.A is one of the most famous Turkish films ever made, for a combination of interesting and disastrous reasons.The film ran into a lot of production issues and for that reason it took over 3yrs to make. What caused further complications is that G.O.R.A had the highest budget of any movie to come out of the country, they had a tremendous amount riding on the film.Did it do well? Absolutely, it was a huge success and spawned 2 sequels.\nDid I enjoy it? Absolutely not.G.O.R.A tells the tale of a Turkish carpet salesman who is abducted by aliens and made into a slave. Through his adventure he meets various wacky characters and deeply annoyed me from start to finish.You see the film is a comedy, a very camp comedy and unlike anything I've seen come out of Turkey before it. This is not exactly a standard Turkish film, they really gambled on this one. I'm glad it worked out for them, but I scratch my head in confusion as to how/why.The jokes are frequent, this is quickfire humor but very few of the jokes hit their mark. The jokes are silly, puerile, and I definitely wasn't the demographic. Sure I like goofy childish humor, I'd class Baseketball (1998) as one of my favorite films but this was unfunny and overkill.Considering the budget everything is ugly, the cast join our lead in being deeply annoying and the movie does it's best to parody Hollywood and some of the most well known sci-fi movies such as The Matrix (1999) and The Fifith Element (1997). Sadly in doing so they embarrass themselves, original humor clearly isn't their forte and they have even less acumen for parody.The film isn't devoid of redeeming qualities but it's certainly very niche.The Good:Opening was simply unfunnyA small handful of laughsThe Bad:Vast majority of jokes are unfunny and childishLead walks a fine line of funny and really really annoyingToo long",
            "review_date": "2019-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best",
            "content": "Without a doubt, this is the funniest Turkish movie.",
            "review_date": "2021-08-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "G.O.R.A is the funniest film ever!",
            "content": "G.O.R.A is the funniest film ever! You just can't stop laughing while watching the movie. There are references to popular films such as 'Star Wars' and 'Matrix', but the film is definitely not a copy of these films. Also there are references to Turkish culture, which would make some foreigners not understand some of the jokes. As well as this, there are jokes that they would even laugh at more. About the summary: Arif is a carpet seller and a tourist guide. He also tries to produce and sell fake UFO pictures. While he is trying sell a carpet to a customer, he is kidnapped by aliens. The spaceship, controlled by the commander Lugar brings him to the planet GORA with other slaves. Then the adventure starts...",
            "review_date": "2004-11-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "one of the funniest movies i have seen",
            "content": "this movie combines comedy and action in a way that no movie i have seen has, understanding the language is better because the sub titles are way off at some points but in the end it is a great movie. also the way cem yilmaz can play both arif and logar helps the movie a lot, he does a great job at becoming the characters he played and his comedy makes it a lot better, bob marley faruk is also a lovable character along with princess ceku who besides being beautiful is also a very talented actor. movies like scary movie have tried to make fun of other movies while providing some sort of comedy and action yet they fall short, unlike this movie which includes at least 4 spoofs of movies that are extremely popular, i forgot to mention the great effects and the songs used throughout the movie",
            "review_date": "2006-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a space adventure with a touch of comedy and a love story",
            "content": "Arif (Cem Yýlmaz) is a Turkish carpet salesman, which tries to sell fake photos of aliens wandering on the skies of Turkey to tourists. One day, his dreams come true, he meets real aliens, but as a twist of luck, those aliens are evil, and captures earth people to work them as slaves in the mines of planet GORA. Logar (Cem Yýlmaz) is the evil commander of the entire GORA army, and wishes to marry the daughter (Özge Özberk) of the president of the planet (Cezmi Baskýn) for the ultimate power & glory. Logar is holding a grudge against Turks, for his father is an explorer, has visited Earth once, only to be mistreated by Turkish farmers. Arif has a full agenda. He has to escape from prison, stop a fireball approaching GORA, harness his real inside power with the help of the wise guy Garavel (Özkan Uður), help the lovely princess find his long-lost 'real' father, stop the evil plans of commander Logar and at the end, find a vessel to return to earth. In an addition, he is in now in love with the princess, and the feelings are mutual!As a whole, GORA is a mixture of action \u0096 adventure and comedy. Blended with seriously distinguished special effects, paradises movies like Star Wars, The Fifth Element and The Matrix. An additional flavor is the integration of Turkish lifestyle and the way of life to a planet light years away from earth. As one of the best comedians of Turkey, Cem Yýlmaz has a great success in plotting the outline and a very successful characterization of the two main and opposite characters of the movie - the evil commander Logar and the funny, practical thinking carpet salesman Arif. The supporting cast is also well chosen, helping the audience feel the overwhelming presence of the lifestyle and characters of an alien planet.Special effects, flashing costumes and extremely sophisticated make-up increases the value of the movie as a whole, making GORA one of the best produced space adventures of all times. The balance of action and comedy, Turkish humor and its international perception is well applied, and the general rules of making a quality cinema production are strictly followed. As a faithful movie fan, I would suggest GORA to every audience who want to go to a movie, have hours of fun and laugh and leave the theater with a happy smile on the face. Just a humble reminder, do not believe all of what they told you on other space movies. There is at least a planet out there, whose inhabitants are funny, incompetent and less evil than the evil trade federation, the sith, the goa'uld, the wraith and the cylons",
            "review_date": "2004-11-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This was a brilliant movie",
            "content": "First thing I want to say about this movie is that it was one of the funniest movies I've ever seen. The movie is Turkish and about 2 hours. 2 hours of unlimited fun and laugh..Making fun of things is what Cem Yilmaz does best. Very original jokes made me and my friends have a lot of fun. To describe G.O.R.A. I can use lots of words like SUPER, PERFECT, BRILLIANT...Cem Yilmaz really knows how to make people laugh.In this movie, he had been in more than one roles and he could handle all very good. I congratulate him. He has done a great job.You have to see this movie!!!",
            "review_date": "2005-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie, superb Cem Yilmaz",
            "content": "* This is my first movie comment, so please don't get too serious with it :) *After watching G.O.R.A. last week for the first time, I was so excited, that I wasn't able, to stand a week, without watching the movie, so I visited it last weekend again and I think, that this movie is the best production in Turkish comedy movie history :)The special effects, the set and especially the actors were all doing a great job! It was a real surprise, that this movie was even better than Cem Yilmaz's comedy acting in \"Bir Tat, bir doku...\"!But there are some negative points for the \"foreign\"-movie visitors: The humor is all around Turkish-lifestyle, so they maybe don't understand most of the funny lines and acting. Further the subtitling was really bad! Most of the movie was inside the G.O.R.A. prison and so it was not able to read the white subtitles on white background. A slight shadow under the text would helped a lot.Sure this movie doesn't has the emotional deepness of for example Vizontele, but it's a funny movie and far better than some German pendants like \"Traumschiff Surprise\".I don't want to loose much words about the plot itself, because other users did this already very well, but I can say, that almost EVERY minute in this movie had jokes, that were so awesome, that you were not able to NOT jump out of your seat :) Especially the scene, where arif and ceku where creating some kind of romantic atmosphere and bob marley faruk farted while he was sleeping right next to them. I know, it sound very childish, but the overall acting and the reactions from cem yilmaz were so unbelievable funny, I was not able to hold my tears from laughing. *In fact I hate fart-jokes and crappy fart-movies like \"Nutty Professor II: The Klumps\" and others...*Although most of the environments were done very well, sometimes you were able to see not so well done background images and some scenes were used twice... But nothing, that would distract you from the main aspect of the movie: Making you laugh :)",
            "review_date": "2004-12-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worth to see",
            "content": "If you went to Cem Yilmaz's stand up show GORA may disappoint you. It doesn't make you laugh every 20 seconds like show. We expect too much from Cem Yilmaz and GORA frankly cannot satisfy us. But in spite of this GORA is a worth to see movie. Not a wasting time. The biggest disadvantage of GORA is that the filmmakers spend too much money and effort. This is why it's clear that they can't delete any scenes. If they did that I'm sure GORA could be funnier movie. Cem Yilmaz is a very very unique person. While I'm watching the movie sometimes I thought that Cem Yilmaz plays like in a home-video. But he has money and made this home-video a movie which can be seen in a theatre.",
            "review_date": "2004-11-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a comedy potboiler",
            "content": "Maybe it's highly time to produce realistic original films for the Turkish movie producers. When I went to see that movie I just thought I could see something different and I could laugh.Well what did I find? Cem Yilmaz who just tried make people laugh with his expletive goofs? I was pretty surprised to hear people laugh when Cem Yilmaz hurled his billingsgate all over the theater? Has anyone of you seen someone who watches a Hollywood movie laughs just because he or she has heard someone saying \"Bullshit or F*ck in English. I don't have to pronounce the Turkish FOUL-MOUTHED words he uses to make people laugh. And viewers..they are conditioned to laugh everything that man says..And what is that about parodying Matrix or something like that. If you wanna see a parody of a block-buster go and rent Scary Movie that will do. This movie is nothing than a pot-boiler.",
            "review_date": "2005-07-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hilarious!",
            "content": "This movie takes one of the best abilities of us, the Turkish folk: To be able to make fun of things (especially in difficult situations), and puts it on the screen. Although most of the jokes are local, I'd love to see how a foreigner would react to the movie. The Turkish reaction is obvious: Many, many laughs.It is hard to comment on a comedy movie's plot, but I can say that G.O.R.A.'s is at least as \"meaningful\", or as good as The Matrix' or Star Trek's.And special effects deserve a single word: \"Stunning!\" Until now, Turkish sci-fi movies had been known for their special effects, or more specifically, their lack thereof. However, G.O.R.A. seems to have made the turning point in the Turkish movie industry. Watch it to see \"what we (as in 'the Turkish folk') can do\", if not for the hours of fun you are bound to have.",
            "review_date": "2005-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Interesting offering of Turkish pop cinema",
            "content": "I was much more impressed with \"Vizontele,\" the last collaboration between Cem Yilmaz and the director of \"GORA.\" But, \"GORA\" has its funny moments and production-wise, it is a considerable improvement over Turkish films in past generations. As a Turkish-American, I have a slightly different view of Turkish films than most people who live in Turkey. I have liked some Turkish films like \"Baalayka\" and \"Polizei\" more- neither of which are popular films, but I have been slightly less impressed with domestic box office hits like \"Ucurtmayanlari Yurmasinlar/Don't Let Them Shoot the Kites\" (1989). I think there are some major problems with GORA as the last message poster from Ankara pointed out. The film is way too long, and there are far too many bathroom jokes. And, though the film has better production values, Cem Yilmaz is not quite the exceptional talent that the late Turkish comic actor Kemal Sunal was. (Sunal was in \"Polizei\" and was to star in \"Baalayka\" before dying of a heart attack preparing for a flight to work on the film!) But, \"GORA\" does illustrate Turkey's dilemma of trying to find a place in the world. The aliens in this sci-fi/comedy seem to show how Turkish people see the outside world. And, there are some funny moments such as when Yilmaz pretends to be a sensitive man to woo an attractive alien woman. It is also funny to see people from outer space speaking fluent Turkish! Yes, I'm still laughing over that one! Unfortunately, I don't think the film's humor would carry over to viewers outside Turkey who are unfamiliar with the complicated cultural traits of the country. It is for this reason that Sunal is deservedly an icon in Turkey, but not a familiar figure in other nations. When it comes to Turkish humor, the rest of the world will sadly never get it.",
            "review_date": "2006-03-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A space adventure comedy with a mixture of action and love",
            "content": "Arif (Cem Yýlmaz) is a Turkish carpet salesman, which tries to sell fake photos of aliens wandering on the skies of Turkey to tourists. One day, his dreams come true, he meets real aliens, but as a twist of luck, those aliens are evil, and captures earth people to work them as slaves in the mines of planet GORA. Logar (Cem Yýlmaz) is the evil commander of the entire GORA army, and wishes to marry the daughter (Özge Özberk) of the president of the planet (Cezmi Baskýn) for the ultimate power & glory. Logar is holding a grudge against Turks, for his father is an explorer, has visited Earth once, only to be mistreated by Turkish farmers. Arif has a full agenda. He has to escape from prison, stop a fireball approaching GORA, harness his real inside power with the help of the wise guy Garavel (Özkan Uður), help the lovely princess find his long-lost 'real' father, stop the evil plans of commander Logar and at the end, find a vessel to return to earth. In an addition, he is in now in love with the princess, and the feelings are mutual!As a whole, GORA is a mixture of action \u0096 adventure and comedy. Blended with seriously distinguished special effects, parodises movies like Star Wars, The Fifth Element and The Matrix. An additional flavor is the integration of Turkish lifestyle and the way of life to a planet light years away from earth. As one of the best comedians of Turkey, Cem Yýlmaz has a great success in plotting the outline and a very successful characterization of the two main and opposite characters of the movie - the evil commander Logar and the funny, practical thinking carpet salesman Arif. The supporting cast is also well chosen, helping the audience feel the overwhelming presence of the lifestyle and characters of an alien planet.Special effects, flashing costumes and extremely sophisticated make-up increases the value of the movie as a whole, making GORA one of the best produced space adventures of all times. The balance of action and comedy, Turkish humor and its international perception is well applied, and the general rules of making a quality cinema production are strictly followed. As a faithful movie fan, I would suggest GORA to every audience who want to go to a movie, have hours of fun and laugh and leave the theater with a happy smile on the face. Just a humble reminder, do not believe all of what they told you on other space movies. There is at least a planet out there, whose inhabitants are funny, incompetent and less evil than the evil trade federation, the sith, the goa'uld, the wraith and the cylons",
            "review_date": "2004-11-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "one of the best movies of the year",
            "content": "There was much hype about this movie because of the long delay in the release of this movie.Luckily,we all got to have a chance to see this movie,finally.I certainly loved the movie and Cem Yilmaz was very good as well as almost all the other actors in the movie.There was however one flaw about the movie.Cem Yilmaz reminisced us from his old stand up comics in some of the parts in the movie and some surroundings and situations were very familiar to the audience while he was mentioning some of the stuff in the movie in his stand up comics about how Turkish people would be and act like if they were to go outer space or meet the extra terresterials.So,that left us with some old material of his but hey that didn't stop us from laughing anyway.It was the first serious take on the term space and aliens in the Turkish film industry so we have to give the guy props for that.I recommend first and foremost every Turk to go see this movie.For the international guests,I would like to point that there are some jokes in the film that appeals only to Turks of such can be seen in the British comedies.",
            "review_date": "2004-11-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funniest movie ever!",
            "content": "G.O.R.A. is the funniest movie ever!!First of all do not think that \"should i watch this movie?\" just watch it. It is the one of the best Turkish movies ever.This movie has the best, tech in 2004 in Turkey. The humor in this movie contains a lot of Turkish jokes.I watched this movie like hundred times. And i will watch this movie again and again and again. Cem Yılmaz made a great movie. He is absolutely brilliant man. The scenario, costumes, characters everything is great.You have to watch this movie!!",
            "review_date": "2014-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny, witty space comedy",
            "content": "Funny, witty comedy about space and science fiction movies. The obvious references to Star Wars and Matrix have been used cleverly as elements of humor. Cem Yilmaz, a stand-up comedian and not an actor in real life, excels in his lead role as Arif the carpet seller who is captured and taken to the planet G.O.R.A. as a prisoner. Both Ozan Guven, in his superb performance as gay robot 216 from GORA, and Rasim Oztekin as \"Bob Marley\" Faruk, another Turk captured by the extra terrestrials, deserve a lot of credit. To be able to understand some of the subtle jokes one has to be somewhat familiar with the happenings in the daily life and culture in Turkey.The music and visual effects are pretty good. Overall, it is definitely a movie worth watching. I would rate it 8 out of 10.",
            "review_date": "2004-11-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Fun",
            "content": "This movie is nothing but great fun. If you are going to theaters for fun don't miss this one. It makes people laugh from beginning till the end and it never makes people get bored. Cem Yilmaz never offered us more than fun and you should not expect more of it. Please watch this movie considering that this was a comedy movie.Anyway, this movie tells us the story of a classic Turkish tradesman, Arif. He is captured by Gorans, and kept in the planet GORA. Cem Yilmaz builds this movie upon the humorous sides of the Turkish people like swears, sex, friendliness and sophistication!.----------------------Only watch for fun----------------------",
            "review_date": "2004-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It was very funny.Classic CEM YILMAZ style.",
            "content": "I watched the movie in Mons,Belgium in Turkish.Thats very fun.It was very funny. Classic CEM YILMAZ. He has a nature talent. He has his own way ,own creation of jokes.If he continues to make films ,the world will understand his humor better and love it. He is a stand-up comedian for almost 10 years now.PERFECT FUN(NY).U BETTER WATCH IT. KA FA 1500People can understand Turkish culture by this movie.I HAVE SEEN IT TWICE AND I DEFINITELY WILL BUY THE DVD.",
            "review_date": "2004-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the Turkish Louis de Funes",
            "content": "My mother loved the movies of the french comedian Louis de Funes, so we had to watch them too. I never understood the french humor. It is just acting busy and silly, there seems to be no clue to it.\nGora is a typical Louis de Funes movie, but then Turkish. Looking through what is for me is boring humor I tried to find something that stood out, but found nothing. Cardboard decors, poor acting, silly references to other movies, some childish farting and sex jokes, some jokes were so old they have a beard (red, pill, blue pill, is this the matix? No, it is my heartpills. Pfff heard that 1000times)Apperently Cem Yilmaz is fan of Louis de Funes, in the final scene he dreses somewhat like him and the scene seems to refer to the 60'sAll in all a waste of time if you're not into 'silly-french style' humor, but from me a point for the though-cute Ceku who lightens up to movie at some points",
            "review_date": "2019-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "excellent parody",
            "content": "i have seen the movie upon the advices from my friends.It is so funny and it casts an interesting view upon the extra terrestrials.It s worth seeing...i love it...i will go again to see it.It also dramatizes a girl's familial story. Cem Yilmaz's performance is adorable in the movie. It uses the traditional Turkish patterns in a talented way. The movie's progress come to an end with a warning to movies like StarWars or other space movies in which space related creatures are portrayed as being 'evil'. Everyone should see it! when i was watching it, everyone was laughing at the jokes and humorous acts by Cem Yilmaz.i remember that i laughed most when a weird Japanese guy, after a quite long time, began speaking Turkish with the emphasis on the special accent.",
            "review_date": "2004-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the best science fiction movie in the Turkish film history",
            "content": "They worked a lot and spent lots of money that any other Turkish producer was unable to do. The visual effects are really good.(Except the motorbike scene) They take some scenes from movies like Matrix and Starwars but Cem Yılmaz(writer of scenario) changed those scenes according to his funny thought. Also Ozan Güven,the 216 robot,has done his job perfectly. Its so funny that a robot can look at 'kahve falı' for a princes of G.O.R.A.. Also the music and the dance from Turkish traditions is a perfect representation of the Turkish Society,that the Turks are really funny and colorful people.Finally, I can only appreciate them for their courage..",
            "review_date": "2004-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wait for TV release",
            "content": "Cem Yilmaz must understand that shooting a movie is much different from stand-up shows. Gora lacks the script and it is long, this is why you can't stop yawning. People only laughed at swear words and gay attitudes. Visual effects are too blurry in order to cover up details.Gora is a media-overblown balloon fated to pop. Newspapers and TV programs had been talking about the movie for two years even nobody had known what the movie was about except for it was a space movie. Because of several lawsuits the movie could not be released for a long time, and this made a great publicity, everyone had positive expectations.You'd better have a peek when it's on TV.",
            "review_date": "2004-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely Fantastic Movie for Turkish Viewers",
            "content": "The movie is absolutely brilliant. All dialogs are very well written and clever as I expected of the witty man. With superb characterisation, great gags and stories that surpass anything Turkish that was on the big screen until now. This is Turkish movie at its best, an offbeat science fiction comedy that has to be watched to be understood. I don't think it stands a chance in the international theaters as most of the jokes are only understandable in Turkish language. I don not think the dialogs would make any sense to anyone foreigner. Because of the fact that producers had financial problems during the making of the movie which could not be helped meant that there had to be more commercialised scenes than I expected.",
            "review_date": "2004-11-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Overrated",
            "content": "After months of advertisement the movie is capable of breaking the audience record in Turkey. Yet, if I try to be objective, disregarding that it is a Turkish film and written by the best comedian in Turkey, I don't think that it was more than average neither as a sci-fi nor as a comedy. Many of the jokes are based on ordinary, sometimes vulgar, slangs that I rarely appreciate as funny. In some scenes the film looks like rather a science fiction with no humorous aspect at all. The references to other films are far from being smart; even I could hardly grasp what was funny in some references. On the other hand, the cast was quite successful. Only Özge Özberk (as Ceku) somewhat reveals her lack of experience; but her charming look in several beautiful dresses compensate this. I also liked the costumes. Picturing was OK despite the focusing seemed odd to me in some scenes.Cem Yilmaz displays a good performance and I believe that the film would be unbearable without him. But it is impossible to praise his achievement as a writer. The scenario have not fulfilled my expectations from Yilmaz, who could have definitely done a better job. I don't think that the film is more than mediocre, so my vote is a solid five over ten.",
            "review_date": "2004-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A comedy that didn't really make me laugh",
            "content": "G.O.R.A. is a movie which I haven't heard about before watching it on Netflix. I had no idea that it is one of the most famous Turkish movies ever, I just knew that it is a Turkish sci-fi, something I've never seen before.Now, this may be the source of my issues with G.O.R.A. I know virtually nothing about the Turkish culture, so it's possible that I didn't understand some of the jokes intended for the local audience. Still, a good comedy should have at least some jokes that everyone will find funny, no matter their background. For me, G.O.R.A. doesn't have this. Yes, there are numerous references to the classics such as Star Wars, The Fifth Element, and the Matrix, and they are all fine, but I wouldn't call them funny as such. Then there are jokes about farting and poor sexual double entendres, which I found cringeworthy.What I liked about the movie was the general design of the world. The aliens costumes were really interesting and I felt they really helped to build the characters which otherwise may have been pretty flat. The special effects may not be the best in the world, but for this type of movie they were enough.\nI can't really say anything about the acting, as I felt like the actors weren't given much to work with. Almost all characters are one-dimensional and none of them has much character. This made the watching of the movie even more difficult for me, as I couldn't force myself to care about any of them.I realize that the movie is commonly loved and that my opinion is a dissent, but unfortunately I found G.O.R.A. unfunny and pretty boring.",
            "review_date": "2019-11-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "In My \"Best of Comedy\" List",
            "content": "oh, what a great movie that was! i was 13 years old when this movie came out. i watched sixty times already...i still remember all scenes, all movie lines.. all cast are compatible and endear themselves to viewer. great combined with comedy and science, i have to say special effects are not great, but it's not a big budget movie. if you're not looking for a perfection, you can blink the fact. inspired from \"Turist Ömer Uzay Yolunda\" movie. i never forget this movie! great job Cem Yilmaz! this movie is definitely on my \"best of comedy\" list in top ten.Brilliant!",
            "review_date": "2016-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mediocre",
            "content": "Gora is nothing more than a mediocre spoof on popular SciFi-classics as The Matrix, Star Wars and Star Trek. Sometimes funny, most of the times irritating, unfunny, boring and flat. This movie doesn't deserve a 7.4, I'd personally give it a 6 ( and than I'm still being nice...) You know, I just can't understand that there are so much people around here that seem to find Gora so incredibly funny. Sure, it has its moments, like the little man that is neglected throughout the entire movie or the machine blowing wind in Matrix-style, but most of the time the humour is so immature and simple. And what's with all those old fashioned gay-jokes!? It must be years ago that a Western comedy made jokes about gay's just because they are gay...Watch the trailer, than you won't have to see the movie itself. It isn't worth your time, though it isn't that bad...:)",
            "review_date": "2005-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mel Brooks meets Bollywood halfway",
            "content": "A rare Turkish attempt to mimic Hollywood production got one thing right - the trailer is infinitely better than the film itself. Over time it has taken on a life of its own on the Internet, with a couple of ostensibly clever jabs at \"Matrix\" and \"Star Wars\". See it and that's about as much fun as you will get out of the entire feature. See the rest if you think it'll help you infer something about Turkish culture. Beware, though: you might come to a conclusion that the Turks have quite a low grade sense of humor and that practically everybody can be a comedian there.\"G.O.R.A.\" tries to spoof the Western Sci-Fi genre. It fails so badly at it that the only thing it achieves is to make one appreciate the spoofed material even more. The jokes that worked in the trailer just fell flat in the actual film because they came off random and gratuitous, without a proper set-up.The space between is filled with inanity and randomness, as far as the viewer accustomed to the coherence of Western films is concerned. Characterization is poor and unconvincing, plot points are disjointed as if several story lines were forcibly merged into one, pop references are crude and literal (\"I've seen it in the Fifth Element!\"), the fourth wall is smugly being broken (\"This goes out to you, Hollywood!\"), there are unnecessary flashbacks that slow down the plot, there is a heavy reliance on shallow stereotyping to elicit humor, and the main character, a sleazy everyman who just can't shut the hell up, is one of the most insufferable leads I've ever seen on screen. I'd feel sorry for one Cem Yilmaz who plays him, hadn't he been the one who wrote the daft script in the first place. In an act of vanity he also took up three more roles here and has only achieved something of note with the role of main villain.The production value, as seen in the trailer, largely holds up throughout the film. Visibly, most of the budget went into the special effects, the costumes and the sets. However, already at the cinematography level things fall apart, as one can observe the uneven color grading, mistakes in the lighting setup and so on. Furthermore, the art direction is overly glossy so everything looks more like a commercial than a feature film, but all of that is at least passable. What is uniformly bad is the cast, who are simply lost in space, and the director who doesn't know what he wants out of the scene and the actors, has little understanding of camera positioning and movement, and has no knack whatsoever for comedic timing and pace. The overall feel one gets is that, while there is always something happening on the screen, the plot never gains a momentum.Perhaps all this is just a cultural thing and perhaps one has to live in Turkey to be in on all the nuances and jokes. As far as I'm told, \"G.O.R.A.\" broke the box-office records in the native country. But it has a clear ambition to speak to the Western audience as well and, seen through that scope, one must admit that by far the funniest thing about this \"comedy\" is the undeservedly high rating on the IMDb.",
            "review_date": "2016-10-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eh",
            "content": "I watched the first half hour, but I didn't find it that funny. Also the story was too aimless and shallow for me to really care. If you find this funny, you'll like it. if you don't then you won't.",
            "review_date": "2019-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "English/Turkish still roxx",
            "content": "this film is one of the funniest Turkish films I've seen, its definitely about time that Turkish cinema took advantage of the special effects and the fantastic actors around. Cem Yilmaz had a big role,, COZ HE IS THE STAR, and to be honest he did his job well, also remember nutty professor and all the roles eddie murphy did,, (u do, so there u go!!) don't diss cem yilmaz for taking multiple roles, i just hope more directors and actors get into this parodical comedy scene in turkey and more Turkish films come over here for me to enjoy,, (sort out the sub titles tho, i mean i understand Turkish but,, what about the people that don't?) anyways thats all i gotta say au revouire for simdilik :)",
            "review_date": "2004-12-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Turkish Movie I Ever Seen ..",
            "content": "G.O.R.A.Yup .. The best Turkish movie I have ever seen! This is one of the coolest Sci-Fi Comedy spoof movies ever! There were also another Sci-Fi movie called \"Dünyayi Kurtaran Adam\". But it was the WORST movie ever ..Scenes have been taking from Star Wars and stuff .. Bad role play and a storyline ..But G.O.R.A. is one of the funniest thing.Funny movie, funny role plays, funny story lines, funny bad words .. It makes THAT movie funny .. :)Cem Yilmaz, the funniest guy ever .. So Peace to him! :)Please .. Go watch this movie and have fun with it, since it has taken long to make it .. ;)",
            "review_date": "2005-06-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A well-realised sci-fi pastiche backdrop for a pitiful series of well-worn parodies...",
            "content": "Turkish comedian Cem Yılmaz (\"Her Şey Çok Güzel Olacak\" & \"Vizontele\") and director Ömer Faruk Sorak (\"Asansor\" & \"Vizontele\") re-unite to spin-out a sketch from the former's \"Bir Tat Bir Doku\" stand-up show into a record-breaking Turkish box office hit.Turkish tour guide and carpet salesman Arif (Cem Yılmaz) is abducted by the evil Commander Logar (Cem Yılmaz) and taken to Gora where he is chosen by the mysterious Garavel (Özkan Ugur) to rescue Princess Ceku (Özge Özberk) in an uninspired comedy set-up.Cem Yılmaz puts in a rather insipid performance as the stereotypical Turkish every-man Arif but comes alive in his brilliant turn as Commander Logar with solid support coming from the likes of Özkan Ugur, Rasim Oztekin, Ozan Guven and the gorgeous Özge Özberk.The film-makers' three year struggle with budget and technical problems paid-off with a convincingly realised sci-fi movie pastiche that acts as a magnificent backdrop for a tired series of parodies and gags that are more well-worn than one of Arif's carpets.\"I learnt to look at life from a different angle.\"",
            "review_date": "2010-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "disappointment",
            "content": "there are many examples before that movie which are \"top secret,\"naked gun\",airplane etc\" this movie is worst'em alli like CEM YILMAZ(i think the most popular comedian in Turkiye)but he is not acting best as he act in stand-up shows,and of course if you take away him from this movie you'll vote 0(zero) to wholeCem's first movie(herþey çok güzel olacak)was ten times funny than this onethe only good point is ;there are many effects ,costumes much more(this is the first time in Turkish cinema)in my opinion watch the movie and count how many times did you laugh i went the earlier session today i watched and i disappointed",
            "review_date": "2004-11-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a must film for the people who want to experience how a Turkish guy behaves when he is kidnapped by aliens",
            "content": "The movie is about a carpet seller,Arif, who is kidnapped by Goraean forces.He tries to make his way back to earth from the very first moment he is put into prison.There he meets \"Bob Marley Faruk\" a guy who was kidnapped 8 years ago and they become best friends.Then he meets Princess Ceku(who doesn't want to marry the general of the Goraean Army) and 216(an android) and the group is ready to find a way to escape from Goran.It is definitely must for people who especially live in Mediterranean countries whose lifestyle is quite similar with Turkish lifestyle. If you watch the movie to criticize,you will criticize almost everything,but you must not forget that this film is shot to criticize all the clichés in the film industry.So just watch it to laugh,then you will have a great 120 minutes of entertainment.",
            "review_date": "2004-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "must-see..",
            "content": "Hi guys,It was the most joyful and successful Turkish movie I have ever seen.Very good graphics, whole movie is full of fun and not only teases some American movies in a very clever waybut also has a concept and an original theme itself.I recommend all Turkish people go and see the movie, and all other people who don't know Turkish, I say: go and learn some Turkish, it is worth it.By the way according to me this film should not be translated into another language.",
            "review_date": "2004-11-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Last half of the movie wasn't necessary",
            "content": "I laughed a lot in the first hour but the other part was boring also overused sexual jokes didn't made movie funnier.",
            "review_date": "2020-05-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Avoid at all costs",
            "content": "This movie is garbage. I thought i found a nice entertaining comedy from across the world based on the IMDb rating it has, but I was wrong.This so called comedy is full of obvious childish jokes disguised as \"parodies\" and predictable punchlines and situations, you may think the humor didn't translate well because I'm not from Turkey, but I don't think that's it.Granted this is the first Turk movie I ever watched, but humor can be a universal thing, and comedy is capable of breaking cultural barriers, but this is not comedy, this is just a foolish attempt to make a movie out of a bunch of ideas for \"funny sketches\", but the jokes are obvious, they felt outdated and worst of all simple, like the kind of jokes a child will tell you, just one step away from \"Why did the chicken cross the road?\".The worst part is that there is a sequel,but the only way I would ever watch that (or this movie EVER AGAIN) is if I was forced in a \"Clockwork Orange\" fashion strapped to chair. Movies like this shouldn't exist.",
            "review_date": "2017-04-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Has no significance as a movie. A crap.",
            "content": "Its crap. Even the set design and make up was better at 1963 made Space 1999. The film has a weird Indian atmosphere. The digital effects and visual quality are no better than a home project. Waste of money and time. Its a film produced for the sole aim of collecting sponsor money. The jokes are in Turkish and they cant be translated because they are based on cultural elements and curses. The producer of this film (Yilmaz Erdogan - a kurdish actor)is known by his over promoted ordinary projects. The producer collected over 3 million usd from the advertisers and sponsors for the film before its post production, which is an extremely high amount for the Turkish movie market.",
            "review_date": "2004-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Quite funny (for people in \"western\" culture)",
            "content": "I really liked this parody! Well, I had to read the subtitles all the time and I'm not a member of the Turkish culture, so all I can point out is my own \"western\" point of view (if there is a thing such as this). The parodies of Hollywood movies aren't new themselves, but a parody of Hollywood coming from \"another\" culture - that's just brilliant! The movie plays with both American and Turkish stereotypes, mixes them with lots of exaggerations and special effects - and in the end there is a Sci-Fi-parody which is fun throughout the movie. In my opinion, this movie works in theaters only; I can't imagine watching it on DVD at home. Nevertheless, it's fun! I'll give G.O.R.A. a 6 out of ten!",
            "review_date": "2004-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It is a blast !!",
            "content": "The movie is great, although there are some minor issues with focusing, and some gags being just not funny but the rest is simply fabulous. The film contains many easter eggs (like movie posters in the producer's office or the name of the space ship), lots of hidden sponsor stuff too.But my idea is you have to know Turkish and be in the age group of 25 to 40 to enjoy it to the fullest. How many of the youngsters have seen a Commodore 64 and the famous tape drive that comes with it ?Just go and see it it will not be a disappointment.",
            "review_date": "2004-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the Turkish accepting of faked future !",
            "content": "it might be the best but its not the first Turkish sci-fiction movie. and all are comedy. Turist Omer, the non-colored Turkish film is the first making fun of futuristic sci-fiction pictures; very much same as GORA, without any technical knowledge managing to survive in the danger of the future (The unknown). the second film was a little more serious; was played by the movie hero Cuneyt Arkin known with playing roles as a hero in the history. as it is quite clear on name of the film which was called The Man Who saved The World, is an old example of 20. centuries movies like \"the 5.element\" , super heroes of Hollywood \"supermen, batman\" etc. Hollywood productions with the subject of saving the world. the funny part of the film was that this time Cuneyt Arkin was a men-kind who used martial arts to fight the enemy with lacer weapons and carried rocks 10 times heavier than his own wight.the actor comedian Cem Yilmaz belongs to this generation. reading comic books beside.10 years ago when he first started his stand up talk shows, space and sci-fiction appeared as criticized subjects in his shows and was giving very effective signals to the Turkish audience. the misinforming effect of the pictures seemed as an important problem for Yilmaz personally. the comedy was the best weapon to fight it. it worked and the Turkish audience loved it.Yilmaz was effected and inspired by the older Turkish films as mentioned before but carried the idea further and made a very well finish.the Hollywood films, making fun of the other films like karate kid, matrix, Rambo etc. seems as a great help in doing so well with GORA.stay well (hoscakalin)! savas",
            "review_date": "2004-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best mom, one of the best !!!",
            "content": "When I first heard about the film, I though \"what garbage are we going to put out this time?\" Then I read some comments on IMDb and decided to get he film and watch it. Sure enough I was not disappointed. The film has a good enough plot, lots of throw backs to Hollywood blockbusters, very good visual effects, good comedy acting. I don't expect anyone who doesn't understand and speak Turkish to fully appreciate this film, but as a Turkish person i liked it very much and will definitely keep in my library. Lots of small jokes will be lost in translation but hey I never seen a Turkish film as polished and well put together as this one, ever! So it gets a complete 10 out of 10 from me just for it's daring alone. Well done boys and the girls !!! Afferin cocuklar!!!",
            "review_date": "2005-04-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unwatchable Trash",
            "content": "Terribly and embarrassingly acted, atrocious writing, directing, and editing, and special effects that are in likeness of films from the 1950's or 1960's. There isn't a single positive quality to this overly long dumpster fire. All involved should be ashamed.I was appalled to see that this film earned an 8.0 from the users. This is a clear example of biased and unqualified users rating something inappropriately.The \"caterpillar\" crawling across the main characters face is incredibly distracting, and the costuming is a joke. The characters can't even believe what they're doing, in such a farcical piece of nonsense.I'm so disappointed to have seen even a moment of this...",
            "review_date": "2022-12-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The only thing funny was to hear them talk in Turkish",
            "content": "The first thing you realize when watching this movie, is that it is blury. It looks like watching a Turkish tv soap opera from the '60s. The impression remains when the \"acting\" starts. Nothing funny about this movie and the story as dull as the acting. Don't get fooled by the other reviews, which were obviously paid for. A complete waste of time, but fortunately it is obvious after a few moments into the movie.",
            "review_date": "2019-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Only imagination...",
            "content": "in my opinion, this movie related \"a dream\" of Cem Yilmaz is that about Yilmaz's most popular talk show subject \"the turks on the space\". if you imagine that, it is a conflict and funny. because of that, lot's of different culture live together at the same place. And lot's of people has the the lot's of cultural differentiations. lot's of people can't understand the this amazing film around the world because of this situation like the local jokes and personal imaginations. (something like smoking the cigarettes in a spaceship on the space, it's means that, \"turks can do it\" so, this was a local joke) but, I can give a guarantee about film, it's really very funny! ONLY WATCH IT, don't try to understand everything!",
            "review_date": "2005-02-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the worst",
            "content": "I know one thing: This film is bad even in Turkish standards.Do not count on the rating as one can easily see that most of the people rated with a \"10\" even without watching it. It is relative but the film was not even funny. A non-Turk will find this movie a poorly cast absurd sci-fi. Poorly designed scenes has been modified with computer affects to look better. There were several focusing errors at some scenes. The picture quality is not good. I'm not sure if it was a problem only with the copy i watched but the sound mix was also bad. Finally, nearly all hot spots were shown at the trail.I would not recommend you to watch if you do not know Turkish and want to waste 2 hours.",
            "review_date": "2004-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "GORA an average film by world standards",
            "content": "Relying mainly on coarse language and unsubtle innuendo, much of GORA's humour would be lost on a western audience. True, it attempts to make fun of Star Wars, Matrix and the Fifth Element to name a few well known films, but overall the humour was a bit tedious. Moreover, the image of a Turkish villager attempting to mount a robot is confusing, the only explanation being that the Turkish psyche may see men of that society as being fixated on one thing only.More entertaining was Cem Yilmaz's portrayal of a fast talking carpet seller and perhaps more could have been done to develop this character. The special effects and cinematography were excellent for a non Hollywood film.",
            "review_date": "2005-03-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the best amusing film in turkey",
            "content": "G.O.R.A is one of the best amusing film in turkey. some of people criticizes the film because of witty remarks that is insufficient but this is not true for me. yeah maybe according to Cem Yilmaz's live effort , his effort on the film is not sufficient but still he deserve at least eight and half point. on the other hand special effects are very good according to Turkish film industry even more better than all of the films that have taken movies in turkey. so it deserve ten point :) meanwhile G.O.R.A is the third film is about science fiction in turkey. and it is the most successful film in this kind. Cem Yilmaz and Kemal Sunal are the Best :)",
            "review_date": "2005-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A new era in Independent Movie Industry",
            "content": "Ömer Faruk Sorak' s new movie G.O.R.A. is one of the most groundbreaking Turkish movies of all times. With the sarcastic approach to classical space movies, screen writer Cem Yýlmaz shows his determination on making a statement: Independent movie making is all about experimentation and willing to fight. A plot of a movie can always become a point of discussion, but in G.O.R.A.'s case, movie critics and the audience should not blur their minds with these arguments. The quality of special effects / film budget ratio is so high, that the post-production stage of this movie should be carefully analyzed.If an independent production team can produce a movie with this quality, the entire Turkish / East European movie makers should start utilizing the use of technology in their productions. After all, when we are talking about developing the Independent Movie Industry, isn't it about attracting attention? For years, twisted plots and boring old scenarios were re-made into movies over and over again, forcing the average movie-goers to watch mainstream movies just for their visual effects. G.O.R.A. has nothing less than National Lampoon's sarcastic view, or nothing less than the visuals of an $ 50 mil. Hollywood sci-fi. Now G.O.R.A is playing all over Europe. Why not give the Independents a change? It is certainly not as good of a movie as Scream(!) but the audience will have to deal with that.",
            "review_date": "2004-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful Comedy only for Turkish culture",
            "content": "All i can say about this movie is it's a regular copy of Austin Powers.. Don't expect much of it.. if u have seen American - English Austin Powers , u may take a look at this Turkish version of it... you might also see how it is making fun with Matrix , Jackie Chan movies , Crouching Tiger , Fifth Element and more.. To understand this movie's comic remarks.. u need to know some about Turkish culture. But the good part of the movie. Finally Turkish movie producers had started using computers to put some digital effects . this is good .. The leading player of the movie Cem Yilmaz is a stand up show host .. not a movie star.. Don't expect much of him too.. i give this movie 2 on 10..",
            "review_date": "2004-11-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cringe",
            "content": "Unfunny gay jokes conjoins with Cem Yilmaz's bad and cringe acting. Okey at least he tried but this can't change this movie is cringe as hell. Am okey with gay jokes but this is another level and too much even for me.",
            "review_date": "2022-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A film that is only an advertisement",
            "content": "I could not understand the reason for the attraction to this film. This film just has the famous scenes that are copied from great Hollywood productions that are modified just to add a sense of humor. Cem Yilmaz is a great comedian but not a director. The poor quality jokes about the matrix were just \"disgusting\". We could also see nearly all of the funny moments at the film in its trailer. A very high level of advertising made \"GORA\" to be viewed at the most of the cinema halls. Even some of the cinemas only show \"GORA\" but it is not worth it. People watch this film because everybody else watches. It is obvious that no one would remember this film after a year or two.",
            "review_date": "2004-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "contains some nostalgia, with great fun",
            "content": "The film is really fantastic, the aliens abduct a Turkish man, and he is a carpet salesman in ,probably ,Cappadocia, he is brilliantly intelligent and also funny, but this is somehow because that he is so pure and naturally behaving even though he's in another planet named G.O.R.A. One of the funniest and nostalgic scenes of the film is the one with Commodore 64. No Pentiums and some sort of that stuff, only and only the Commodore 64 the greatest computer:))))I laughed for minutes when i watched that scene. if you want to see a science fiction movie mixed with humor go and see this one.The way it approaches to subject is so much different than most other science fiction movies. I give 9 over 10. Go Cem Yilmaz go, who catches you be (English mixed with Turkish:)))",
            "review_date": "2005-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "one of the best comedies in Türkiye",
            "content": "I think that, this movie is one of the best comedy shot; interesting and good screenplay good jokes but... using of many swearwords makes a movie a little bit pushing. Cem Yilmaz (also writer and producer of that movie) plays very good but, although he had some experiences as actor in some movies, he is still not enough to become a player on world stage. Other players are successful as well, and I think the choice of actors and actresses are well done. Screenplay and technology used during shots are quite new and expensive in the Türk cinema but, with increasing income the producers will tend to use better and better (thoug expensive) technologies in their films. So as a result of my comment I can conclude that although some lack of experience of movie makers in Türkiye (especially in that kind of comedy), I believe it will lead the Türk cinema to a better stage... Let's see what Cem Yilmaz will do in Part II :)",
            "review_date": "2005-12-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best Turkish comedy",
            "content": "Cem Yilmaz is a genius for sure. However you need to know Turkish culture people very well to understand most of the jokes in the movie. He is able to pick up sentimental and mostly overreacting in the public. Especially ones who have really much confident while talking. Many dialogues more than funny. Most of the time I feel pain in my stomach. It's a sci fiction with lots of affection in it. Great job man",
            "review_date": "2020-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"just try to remember if u can\"",
            "content": "It is hard to be Turk. Our nation likes exaggeration. One day you are a patriot the other day you maybe a traitorous. It's same in arts also. Most of the fans of the film will forget it so soon you wouldn't believe. I don't think it's the best Turkish comedy film. It's an insult for our film industry, to say that. Please realize that \"the most popular\" doesn't mean \"the best\". We can't compare the box offices to say \"the best\" movie. I believe most of the people would say another movie as the best movie, although \"titanic\" is at the top of world all time box office. G.O.R.A. is not a movie yet; it's just Cem Yilmaz's stand-up on theaters. I feel sorry for the director....",
            "review_date": "2004-12-01",
            "lang": "en",
            "source": "imdb"
        }
    ]
}