{
    "title": "Judwaa 2",
    "rating": 3.6,
    "release_date": "2017-09-29",
    "num_reviews": 104,
    "genres": [
        "Action",
        "Comedy",
        "Drama",
        "Romance",
        "Musical"
    ],
    "summary": null,
    "reviews": [
        {
            "review_title": "Bollywood is not progressing because of this",
            "content": "Rating: NA Veteran actor Rishi Kapoor said that Bollywood makes garbage movie because film lovers don't want to watch good movies. This is partly true. Cine goers seek entertainment, not preaching documentaries. However Bollywood has always been best when it mixes entertainment with light moments and some lessons. Whenever such movies are made they work wonders. Judwaa 2 does not fall in that category. It is a typical pot boiler that takes Indian film industry and audience 20 years back to a senseless subject for over two hours and you are forced to move out before your head blasts. There was no point in making the remake of a typical comedy that makes you smile even today. With added loudness and overacting by the three leads, this movie is an indigestible Masala.",
            "review_date": "2017-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Movie gave me Cancer.",
            "content": "I thought the 90s were already over. Don't know why they choose to remake the movie and call it \"Judwaa 2\". Everything was same like the early movie \"Judwaa\" then what's the point in making remake. I think Bollywood is running out of story. They just copied everything don't know what to watch. Movie made me sick can't tell about acting also when all frames are cliché.If you know this is a remake you are old too. I could write better stories than this in my sleep. Call me Bollywood.",
            "review_date": "2017-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Garbage !!!",
            "content": "20 years back David Dhawan made the comic caper Judwaa, which was illogical, but still a light entertainer with rib-tickling comedy scenes and good performances. Push forward button to 2017, Judwaa 2, made by same director, same premise, same scenes and even same background, yet to fails to deliver.Judwaa 2 tells the story of twins who gets separated at their birth due to unusual circumstances and meet each other in their adulthood.Sometimes I wonder whether Bollywood prepares any script before directing any film. Spending so much on location, songs and dance would not give inception of a good film unless script is thoroughly worked upon. There is no definition of Story, Script and direction tin Judwaa 2. The main drama unfolds in the later reel which again is intolerable with screenplay written by a school kid. Editing is horrible. The torture goes on for almost 2.25 hours. Art direction is good. Cinematography is nice. Songs are tuneful (again all the songs. baring one, is lifted straight from the original. Dialogues are less-impacting. Performances are over- topOverall, a pathetic film in every sense. Poor- 1/5",
            "review_date": "2017-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "this is the kind of movie because of which people think Bollywood sucks.",
            "content": "a guide on how to make a Bollywood movie.1) take a guy (who thinks he can act but in reality a goat can act better then him) he must be son of a director or an actor. 2) take some hot girls(acting skills not required coz no one gonna watch there acting anyway) 3) copy script from Hollywood or tollywood.4) take old songs n put some shitty music in it(lets call it remix) 5)make girls dance to those shitty songs in short skirts n let the guy show his abs.6)go to every accessible place on earth for promotion.7) cross your fingers and hope for stupid people to watch your movie.8)profit.",
            "review_date": "2017-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "From 1997 to 2017, what has not changed at all in this film is its inherent misogyny and racial jokes",
            "content": "David Dhawan who has made three dozen vacuous comedies, with an enviable success ratio. He was even crowned the undisputed king of comedy once. Here, he gives you a rebooted version of his 1997 comic-caper of the same name. The earlier one had Salman Khan, this one has Varun. It helps that the leading man has a mammoth following with today's kids. And, he is viewed by those clued into Hindi mainstream cinema as a combination of Govinda and Salman, both of who carried off their kitsch routine with a certain flair. Varun doesn't let you down either. Whether he is playing a geek or a goon, he is absolutely endearing and delivers, exactly what his daddy orders him to.The script (if you can call it that) is a combination of familiar gags borrowed from Manmohan Desai films. The sidekick stammers, the hero repeats dialogue from various masala movies, the villain develops amnesia when hit by a coconut, a football butt allows his memory to return, etc. There's nothing intelligible here so please stop searching.It's basically innocent fun meant to pander to the child in you. The only 'wicked' thing here are the heroines' skimpy costumes (just kidding). The girls, Samara (Taapsee) and Alishka (Jacqueline) are brought out for chartbusters - Chalti Hai Kya 9 Se 12 and Oonchi Hai Building. They sportingly kiss, cuddle and are happy horsing around doing precious little.Lame lyrics, loud gags and leggy lasses never really hurt anyone. Believe me, at one point, you're tempted to join Varun when he is doing those perfect pelvic thrusts. Judwaa 2 could be a substitute for your Dussehra party. Consult Salman, even he sportingly shows up in a cameo in the end.",
            "review_date": "2017-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rubbish and crap",
            "content": "Don't watch this really stupid movie, even if you get free tickets. Acting is pathetic, story is crap, the only thing good is Jaqueline Fernandez only because she looks good. If you have watched the first part, there is absolutely no difference just additional stupidity. There is unnecessary fight scenes and overacting. Even the jokes are not funny. Watch this movie if you want a free headache. Still recovering from mine.",
            "review_date": "2017-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful CopyPaste",
            "content": "Varun dhawan doesn't know how to act still he tries... I don't know why This is so awful I don't understand why do opeople make such brainless films...it spoiled an iconic film like Judwaa with full on copy paste...with this film its clear that David dhawan has made it only for his son but the son of nepotism tried to copy salman by acting like Govinda...its name should Bhaadwa2 not Judwaa2 this film doesn't deserve the iconic tittle judwaa...wastage of money and time... Now give me my money back",
            "review_date": "2017-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why would you still go to watch a movie in 2017 which has a story used in 90's.",
            "content": "The reason masala movies work so much in India is because we normal Indians have this complex where we crave City lifestyle and the so- called \"CHAKA-CHAUNDH\" of the cities. And the producers and directors had been cashing-in on that. but in the last few years, especially when Varun Dhawan came into existence in Bollywood, a lot of people's perception have changed. a lot of people want some sensible cinema to be made. But there's still a large chunk of people who watch such movies(no offense)which make no sense. (Don't tell me that you don't need to make sense out of comedy movies.) Even comedy movies need to have some sense in them so that the viewer could go home with an overall nice experience. This movie has nothing for the people who want some sensible movies, it caters to people who are fine with this kind of non-sensical content because these movies are light hearted movies and you just have instant laughter. which is still OK. But i have problem with those people who just watch such movies because they love the actor in the movies.It's just blind fan following. they just wanna look at the actor in the movie. Nothing else.SPOILERS AHEAD:Movie is just a remake of the old movie where salman khan was in the lead role. That movie was at-least good considering the time when the movie was made(20 years ago). They have made the same movie with the same plot. father's a cop, mommy has twins, villain takes one child throws him at a railway line, blasts his den and tells the father he blasted the den along with his child. some random lady picks up the child. now he becomes a hooligan punk or thug or whatever it's called. Father moves to foreign country with mommy and the other child. both boys meet randomly in their youth and then begins a barrage of stupidity which some people in our country find amusing while some others find cringy.Same as the old Judwaa with nothing new accept girls this time will be wearing bikinis and swimming while wearing them(because Indians wanna see girls in films wearing bikini, that's what women in industry do most of the time... look just sexy, no acting needed), get kissed without approval cuz then the boys in the hall be shouting and whistling and cheering. and yeah there'll also be some teary moments in the film because almost every Indian comedy film makes you sad right before ending the film with a laughter.Point is: Why would you go to watch a movie when you already know exactly what is going to happen in the film. And also considering the fact that you yourself know that the film has a too old and clichéd plot which will never make any meaningful experience for you.Piece of advice: Although Rajkumar Rao isn't chocolaty like Varun Dhawan and his new movie doesn't have this much masala but it is also a comedy as well as drama. But the movie has something that Varun Dhawan's movies will never have. AND THAT IS ORIGINALITY(because you always see him mixing Govinda and Salman in his acting) if you plan to spend some money to watch a film, watch NEWTON instead. Worth the experience.",
            "review_date": "2017-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Please, don't activate in your DVD Player! It wasn't wonderful! No twin magic can save this Bollywood film. This movie was awful!",
            "content": "Identical twins has always show up far more frequently in movies than fraternal. The reasons, why, identical twins are so popular in cinema, is because how visually striking, they are. They add symmetry, symbolism and sometimes comedic moments to any story. However, if not use right, they come across, unoriginal and gimmicky. \"Judwaa 2\" is one such example. Loosely based on the Jackie Chan's Hong Kong action film 1992's 'Twin Dragons'. The sequel/reboot directed by David Dhawan follows the same tiresome formula of Dhawan's original movie, 1997's 'Judwaa'; which in turn is a remake of the 1994's Telugu film, 'Hello Brother'; by having two brothers, rowdy, Raj and nerdy, Prem Malhotra (Varun Dhawan in a dual role) find each other in a series of badly pace & edited, comedy of errors & sometimes unrelated filler hijinks, after being separated at birth, when an international crime had occurred. Along with over the top & unrealistic, illogical unbelievable coincidences like a loose soccer ball hitting an amnesiac, four twins with all the same names, meeting at the same time at a hotel or an oddly time, fist fight at a very well-known ivy college, it also comes the same type of dumb crass humor & unfunny slapstick that the original film, had; out of place, musical numbers, and awkward fake-looking slow motion, wire work, action scenes with cartoony sound effects like the offensive fight in Lord Ganesha's temple that can make any audience member, cringe in pain. If that wasn't enough, the film also has a jarring off and on simultaneously dual body-reflex that the twins can share whenever the script, ask for it. It's really awful as there are scenes in the film, where it is activated, yet the two twins don't share the same reaction to physical pain or body language. Unfortunately, the low brow comedy gets even worst, with its offensive sexism overtones. It demeans and objectifies women, big time. Apparently, it's alright to slap total stranger's derriere & rub against the domestic help, whenever you feel like it, as long as it play off, as laughs; which is all wrong. The normalization of sexual harassment is hard to watch. All these vulgar outdated characteristic should've just stayed in the 90s. The film also depicts the women of the film as nothing, but sexy love-interests. Actresses like Taapsee Pannu as Samaara and Jacqueline Fernandez as Alishka Bakshi, really don't do much, but look pretty. Their characters are very shallow. As for the leading man, Varun Dhawan. He was alright in the role, but, much of his performance suffers from overacting. Nevertheless, it wasn't as annoying as the supporting cast. Listening to supporting performers like Rajpal Yadav as Nandu, whine all the time, made my ears, bleed. If that wasn't enough, the movie has two highly pervert characters in Balraj Bakshi (Anupam Kher), Alishka's father & his unnamed assistant/brother in law, (Atul Parchure) whom are a little too involve in Alishka's relationship. Whenever, they were, on screen, spying; it was very cringe worthy. I felt like I was going to vomit. Another problem with the movie, is its racism fairness overtones. Like other Bollywood films, there was very few dark-skinned Indians in this comedy. It really didn't represent the whole of India, at all. Most of the dark skin characters were extras or clumsy side characters, such as Inspector Kuldeep Dhillon (Pavan Malhotra) & Passport Guy (Johnny Lever) who has little to do. As for British performers, they barely use them, besides Donna Preston. So, there was really no reason to set the piece in the United Kingdom. Nevertheless, I do give it props for using some of the London locations & words from the English language to make the settling, stand out more, due to the lack of English performers. Other praise, I'm willing to give, is the fact that the songs in the film, like 'Tan Tana Tan' and 'Oonchi Hai Building' were fun to listen to, even if the musical numbers doesn't match, with what's happening much of the rest of the movie. Even, the film score was not that bad to hear. Some of them, can even become, my phone ringtone. Although, the music is alright, overall, the terrible overweigh the goods. A terrible dated comedy made from some very nepotism people. It's represent everything wrong with Bollywood. Don't bother watching it. Avoid the film at all cost, as if, it's an evil twin. It totally not worth finding.",
            "review_date": "2018-03-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "don't waste your cash",
            "content": "dint understand why do Indian producers waste money on stupidity VD the actor seems like the most stupidest actor of Indian cinema 2017and to add this film , nothing compared to J 1just non sensible movie . all actors look desperate to shine but none did.i can just rate its time waste and 1 star",
            "review_date": "2017-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Judwa 2 – Film defies astrology so totally!",
            "content": "Judwa 2 – is a film about twins separated at birth. One reaches the slums of Versova and the other reaches the plush bungalow of his parents in London! One becomes an illiterate, tapori (brash) kind of person – happily singing, dancing and flirting with any female he sets his eyes on and the other is suave, sophisticated and gentle.The above makes one wonder about the elaborate astrological charts that get generated for individuals! How on earth the twins had such a drastically different astral configuration\u0085.they both had exactly the same time, date, place even minute of birth\u0085yet both had such different lifestyles!So does it mean Karmas override Horoscope? Maybe the two different souls had different set of karmas and hence one reached the slums and the other reached the bungalow!Second observation – Indian cinema use females as fillers to give cheap thrills to we, the people! Both the young and attractive heroines were made to wear scanty panties and asked to jump high and low so that the viewers catch a glimpse of their chaddies! Period. And then they showed that a filthy rich daughter of a mall owner went all dizzy up on being kissed by the slum dweller of Versova! This has been shown in many films by the way! As far as I remember – in Betaab – Sunny Deol kissed unruly Amrita, In Hum Dil de chuke Sanam, Ajay Devgan kissed Aishwarya\u0085and many more such films\u0085.and mind you that becomes the turning point in the heroin's life! She becomes totally smitten – dhili-dhali – silly pilly after being smooched! Ridiculous! In real life such an incident will usually call for a lot of trouble for the male – in Kolkata, better not try these stunts or you would be beaten publicly!Anyway, so basically often it is shown in Hindi films that a filthy rich girl falls for a rustic beggar!Such concepts raise the expectations of the poor slum dwellers and such smarties start singing and eve teasing ordinary family girls thinking that if filthy rich female in the film could fall for a slum dweller, why wouldn't some middle class family girl fall for me!? And when nothing of this sort happens, we hear cases of acid bombs and rapes and murders! Kiss trends in Hindi CinemaWhatever little understanding I have of this world, I think the richer you are, the more heightened and refined would be your tastes\u0085I really don't understand why Bollywood shows such concepts of utter mismatch! Even in the film ' Jab Harry Met Sejal' – the diamond merchant's daughter sticks to a tour guide\u0085.gets overly pally with him and even performs like a raunchy pole dancer to impress him!! How stupid can that be!Third observation: Charles, the criminal, had a very loyal and faithful group of people working for him! Wonder what kind of counselling or incentives these criminals give that their employees stick to them like glue! Need to learn such things from criminals!",
            "review_date": "2017-10-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "worst movie of 2017",
            "content": "What is the need to copy already a crap movie.judwaa 1 was also pathetic movie of salman khan and so is judwaa 2.pathetic actors and actresses who don't know how to give expression .all giving same wooden expressions in every scene. the image tapsee pannu created with her earlier movies like pink and naam shabana is diminished after this crap movie . She has nothing to show like talent she acts like a zero . She don't even know how to smile properly. Please save ur ass from this movie and save ur money too.",
            "review_date": "2017-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Judwaa Rebooted.",
            "content": "Trying to create the same magic after 20 years, David Dhawan makes a disaster known as Judwaa 2 which stars his son Varun Dhawan in a double role.David Dhawan directing a film after 3 years and that too a remake of one of his own films which was a hit in 1997 seemed to be exciting before it's release but eventually it lands up becoming a mindless entertainer.Sachin Khedekar who plays the role of a father of twin sons who helps the police to catch a smuggler, gets in trouble when that smuggler takes one of his twin and keeps him on the railway track. But that child is saved as his brother turns on the right side and as they both have a reflex action the one on the railway track also turns. I laughed sarcastically at this scene and this same continues throughout the film and makes me get irritated.The twins Raja and Prem are played by Varun Dhawan, his performance is like a toothache. Varun has delivered the same performance which was in Main Tera Hero. Varun's SRK mimicry is also preposterous. Screenwiter Yunus Sajawal has written a horrible screenplay, which should be avoided these days. Actually I can't get it that even after 20 years, such kind of screenplays are written and are also accepted. The dialogues are penned by Sajid - Farhad which are partially funny, the dialogues like \"Ammi jaan kaha karti thi.....\", are contempt. Thus by writing such screenplays and creating no logic makes the Indian audience's mentality the same as it was 20 years before. If I take a film like The Terminator (1984) as an example, that was written and directed by Cameron and was really nice. But in 2009 he made Avatar which was also good but better than his previous films. That happened because he didn't try to create the same magic. Over here the writers have written the same cliché screenplay and the director has directed in the same manner which makes me bored. In one of the scenes while diffusing a bomb Raja says that he should cut the red wire as red was lucky for him. This scene makes me completely baffled and later becomes terribly annoying. Thus the screenplay and direction lacks innovation. Something that I liked in the film is Ayananka Bose's cinematography, which is top-notch. The frames are really impressive. Also the editing goes well. I really don't get one thing that what are actors like Pavan Malhotra and Sachin Khedekar doing in such a film? Such great actors in such a film! I really didn't like it.Comprehensively, this cynical film has a lot of funny scenes that make you laugh for no reason as it's a film which makes no sense. I'm going with one out of five stars.RATING: 1/5",
            "review_date": "2017-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Horrible Movie",
            "content": "There is nothing to special to write about this movie. Even if I write the most negative review, that will also be nothing in the honor of this movie. bad acting, bad direction. They din't even tried to create a new story with the concept of twins. Same old movie with new characters. Even songs are same. Pathetic. And that pathetic acting by that so called actor Varun Dhawan. Nepotism sucks. Tapsee Pannu ready to ruin her career from this bad movie. Stay away from this movie. Or the choice is yours. Your money your time.",
            "review_date": "2017-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An irrelevant ignorant failure",
            "content": "Other than the awful script the only thing which is worse in the movie, is that you have to bear the awful overacting of VARUN DHAWAN....the only good thing about the movie was cameo of Salman khan and surely that say's a lot about the quality of the movie...wouldn't recommend it to even ISIS",
            "review_date": "2017-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Double Is Indeed Trouble!",
            "content": "A remake of the beloved 1997 Hit Judwaa starring an endearing Salman Khan in dual roles, Director David Dhawan, who helmed the original, has made a remake of his own hit, but only this time, the magic is missing!'Judwaa 2' Synopsis: Prem and Raja (Varun Dhawan in dual roles) are twin brothers who are seperated at birth but are uniquely connected to each-other via their reflexes. They reunite as adults and set out to take down the underground smuggling world.Though a box-office success, 'Judwaa 2' is low on laughs and logic. Varun goes all-out & delivers a slapstick performance, but ends up overdoing it often. But. at least he tries & remains committed all through. He is, undoubtedly, the sole saving grace.The rest of 'Judwaa 2' is woman getting spanked by its heroes, sometimes, even kissed without their consent & the rest involves some prolonged action-sequences where the bad-guys get beaten up to a pulp. This is a lazy film, that only entertains in bits. Varun Dhawan surely has a long career ahead, but this film isn't his best.",
            "review_date": "2018-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Usability Suggestion to IMBD : Please include minus rating . :D",
            "content": ":D I am not able to find minus rating , and this movie does not deserve even 1 rating ..it's unfair for this movie and Varun Dhawan . Please add minus rating so we viewers can give - rating to these type of great movies .",
            "review_date": "2017-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lavish but doesn't hit the right chords like the original one.",
            "content": "JUDWAA 2 REVIEW : I hope whoever is reading this review might have seen the 90's Judwaa film, because anyhow even if you don't want to, somehow comparison will obviously be made with the remake and i think it will be unfair to the new film as we all know film-making has changed so much in last 20 years. Same story which looked logical and interesting in 90's would look illogical in Today's internet generation. So i'm bit confused about reviewing Judwaa 2 cause i have seen 90's Judwaa many times and i enjoyed it lot so comparison is obvious and that's unfair. Let it be, i don't want comparison but somehow it will be made so, let me try to balance both the things.Judwaa 2 has same basic story of original Judwaa but has got different screenplay and few changed characters. Not a single character hits the old films characters magic. Not even Varun, he tries but fails to match Salman's one of most memorable characters, not his cup of tea. Even on individual level, he's not much impressive, Decent. Lead actresses got only hot chicks and thighs to show rather than showing acting talent. Music is disappointing and too loudy, sounds irritating at some moments. For e.g. Prem's ragging song and Rocky's defeat song was completely useless and highly irritating. Screenplay is fairly good in first half and too stretched in second half. Few illogical moments such as Football scene and couple of more scenes could have been removed or could be done in logical way. Even when The End was looking perfect it was again spoiled by Bomb scene. Even most anticipated Salman's cameo too looks completely needless, it comes at the End when there was no need of that scene, and even that scenes wasn't much good. Cinematography is Below Average overall but too bad in that 'Beach Song'. Only plus thing about the film has to be it's production value. Judwaa 2 holds upper hand in lavishness compared to Judwaa. Varun's clothes, actresses dressing, cars looks too lavish and posh. Direction looked confused and tricky. I can't believe the last film of David Dhawan was a good entertainer but despite better story, goodwill of Judwaa's popularity and high scale production value David failed to match his own last film Main Tera Hero? I mean, how much disappointing it is. He tried too much to make it a complete money making entertainer but ignored basic things like making a decent watch for audience, Or may be there was a pressure of recreating old magic again in different era, for different audience. Hence proved, old good films shouldn't be touched, let them remain Old and first of it's kind, people say Old is Gold for some reasons mate, you don't listen to people and ruins old ones just for the sake of money and lose your standard.Overall, Judwaa 2 is Strictly Average film and can be watched once with family in this festival weekend. But i personally don't see this (don't deserve) film in 100cr club, or may be it can touch it by the help of Holidays and enough mass elements in the film. A potential Blockbuster is ruined by Director's typical money making film and trying to be in a safe zone vision. Sorry Varun Dhawan but you have to wait more for your First Blockbuster. I give 5/10* to this one.",
            "review_date": "2017-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Poorest sequel in Bollywood History",
            "content": "Poorest in all categories. Weakest acting, poor direction, no screenplay, no story, bad music mix and there is nothing at all to it.\nHoped for some really great comedy of the year from super hit comedy director \"David Dhawan\", but he fails in all areas.Director just ruined the classic super hit Original Judwa with Salman Khan. I am more disappointed about that actually. Original judwa was and still is fantastic flick to watch but this remake/sequel ruined not only itself but the original one.May be one day these comedy makers would reLearn how to make a comedy, not giving hope on that so far.",
            "review_date": "2018-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst Movie of the Year",
            "content": "*This movie is a Ctrl C + Ctrl V of the classic Judwaa.* Varun Dhawan proves to be an annoying on screen presence while his so loving dad (David Dhawan) centers the whole movie on his son. I feel sorry, but I can't stop myself from taking crap about this film, because it is CRAP, and so I'll save my energy and another dose of mental illness trying to recall this movie.",
            "review_date": "2017-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So bad that couldn't be good",
            "content": "I really had hard time watching this movie, it's sooo bad and not coherent at alll, the plot the acting, the supposed to be \"comedy\" scenes, even the \"action\" scenes everything was really awful and it's really disappointing that BW continue to make such bad films, i gave it 2 stars because of the songs and the dance performances they're the only enjoyable things in this movie.",
            "review_date": "2021-01-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No such remakes please!",
            "content": "Tone & Story: Remake of Judwaa where the brothers get separated and later get together is what the story is based on. Along they even find a villain and take over. The scenes are full of humor but lack sense most of time. It's not new with David Dhavan movie. Synapses connected between the twin pair is really an interesting concept (half mark for that), but no justice is done, still to the story (0.5/5).Direction, Screenplay, Cinematography: (1.5/5).Music: Most of the songs are remix from the songs in original version (2/5).Acting:(2/5) Final Verdict: Light comedy that most of you would enjoy [(1.5/5)(6.5/10)].",
            "review_date": "2017-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Judwaa 2 is not a great entertainer in spite of Varun Dhawan's terrific performance.",
            "content": "Judwaa 2, a film by David Dhawan, is the remake of Salman Khan's Judwaa (1997). David Dhawan is known for his comedy films. David Dhawan's combination with his stars viz. Govinda, Salman Khan etc. had certainly done wonders in the past at box office and also as far as entertainment values were concerned (in nineties). Judwaa with Salman Khan was no exception to this. Judwaa 2 is just a copy of the original Judwaa, with certain changes to the dialogues so as to incorporate the contemporary what's app jokes. In fact, 1997 Judwaa is remake of Nagarjuna's Telugu film Hello Bother (1994), which was in turn inspired from Jackie Chan's Twin Dragons (1992). Years went by, obviously the world has changed. The sensibilities of the audience towards a film or the plot have already changed in last twenty years. Many jokes, or situations of the earlier version shown in Judwaa 2 seemed absolutely out of context, misfit and irrelevant. So, one of the pertinent questions which arise is whether this remake of Judwaa 2 was required at all or not. One thing is for sure that Varun Dhawan is the ideal choice to pull off the double role. Varun Dhawan is one of the contemporary actor who really puts his heart and soul into the characters, which we saw in his few films especially Badlapur. In Judwaa 2 as well, although Varun Dhawan is in terrific form, but not in his original form, he imitates Salman's style at many points. Varun Dhawan has certainly made the two lead twin characters look different through his mannerisms, but comparisons are bound to happen between the original Judwaa Salman Khan and Varun Dhawan. Judwaa 2 is not a great entertainer, although, there are certain moments, where one bursts out into laughter. The film begins with a businessman Rajiv Malhotra's (Sachin) presence of mind to help the police to catch hold of a criminal Charles (Zakir Hussain). Parallelly, Rajiv's wife (Prachi) delivers twin boys at the hospital. Charles runs away with one of the boys as a revenge, he gets caught but the child gets separated from parents. So, that is how Prem and Raja (Varun Dhawan) are introduced. Prem is brought up at London and Raja at Mumbai Versova. Prem is sophisticated music loving student and Raja is tapori. Raja also reached London along with his friend Nandu (Rajpal Yadav) with the help of Pappu Passport (Johny Lever). And that is when, challenges for Prem and Raja begin as they were born as conjoined twins, which means when they are in the same geographical location, their reflexes are same. Alishka (Jacqueline Fernandez) and Samaira (Taapsee Pannu) are the girls in Raja and Prem's lives respectively. Confusion becomes the conflict in the script. Alishka and Samaira keep getting confused signals when Prem and Raja happens to come in front of them at different points of time. Kissing becomes an integral part of the screenplay whenever the leading girls meet the boys. The film also takes a dig at various actors by using their dialogue delivery style viz. Shahrukh Khan, Ranveer Singh etc. What happens in the film and how the story moves further is known to us. But yes, please do watch the full film for the climax scene, which has a surprise in store for the viewers.Varun as Prem and Raja does get maximum screen time. Tapasee certainly tries her hand in comedy after Pink, Naam Shabana, and she is good as well as far s her comic timing is concerned, but she had nothing much to do. Jacqueline does that in which she is good at i.e. giggling. Anupam Kher as Samara's father Bakshi, Rajpal Yadav as Raja's friend Nandu, Pavan Malhotra as Officer Dhillon, Ali Asgar as Doctor, Vivan Bhatena as Alex, one of the villain, are all underutilized in the film. Johnny Lever just appears for a scene. One of the weakest link is Samaira's mother's character portrayed by Upasana Singh on screen. Her character is so poorly sketched, who is shown to be flirting with her daughter's boyfriend. Judwaa 2 is not a great entertainer in spite of Varun Dhawan's terrific performance. The sensibilities of the audience towards a film or the plot have already changed in last twenty years. Many jokes, or situations of the earlier version seemed absolutely out of context, misfit and irrelevant. So, one of the pertinent questions which arise is whether this remake of Judwaa 2 was required at all or not.",
            "review_date": "2017-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why why",
            "content": "Why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why why. This review here is more original and creative than the waste of a movie this whole thing is. I just found it on Netflix and played it. Why was this movie made? Why did they release it? Why is Varun trying so freaking hard to be so abysmal? So many why's that will never have an answer.",
            "review_date": "2019-05-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very incoherent jokes with over-acting and the music is the only highlight.",
            "content": "Somehow I don't understand why Bollywood insists on making sequels or remakes but I guess the producers are just on the verge of saving their production houses like NHG who are responsible for average films like Rangoon and Housefull 3.I always found David Drawn to be a cheesy filmmaker but some of his films really do make you laugh like Partner, Maine Pyaar Kyun Kiya, and Mujhse Shaadi Karoge. Even the first Judwaa was funny and hilarious especially when Karishma Kapoor was a legendary actress back then.So the movie revolves around Prem and Raju, twin conjoined brothers who were separated at birth by a gangster. Prem is based in London with a high-class status but his weak and geeky motives leads him to a big problem especially with a split personality where he shows off these unusual reflexes like kissing a girl or slapping a person for no forsaken reason. Raja on the other hand lives a low class life in Mumbai working for a fisherman and he is strong and the bravest of one the twins. How these 2 encounter each other and fixing the past behind them is basically what this film is about.Quite frankly, this movie is constantly below average. The trailer was something I had zero expectation in as well. Although Main Tera Hero was disappointing, I still liked some of the comedic factors in that film and it was sort of a delight to watch but this one tries really hard. The writing is the terminated achievement in the film. The script was too clichéd and I felt some of the scenes were just modified to look like the original film.The acting was like somebody came on set just to make a quick buck. The six pack abs on Varun's body managed to outdo him in terms of performance. This guy just doesn't want to leave his comfort zone.Jacqueline Fernandez isn't really known for her acting and putting her in a film like this speaks volumes for itself. Even Taapsee was somebody I didn't like in the film although she was attractive, but still she lacked the justice she had in Pink for Judwaa 2.The cinematography was absolutely cartoonish. Ayananka Bose has trouble picking the right camera for such films or is it the editor using a cheap software in a scene where Varun falls on the roof of a building.The music is outstanding and gives you the nostalgic feeling Anu Malik managed to give. Oonchi si Building and Chalti Hai Kya 9 to 12 were modified nicely and brings back that vibe from the previous film.Overall, this movie is quite a disappointment. Very clichéd script along with mediocre performances also lets not forget the underwhelming cinematography and eating but despite a few laughs and good music, Judwaa 2 is worth watching but on Netflix or a T.v Broadcast.Quite some hype was created for this film. So the box office will be good surprisingly the theater during the 2:45 pm show was 75% full. 2.75/5- Just save your money this weekend and wait for Chef which looks overwhelming but a remake is a skeptical factor for every film like this one.",
            "review_date": "2017-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a Crap - come out from movie hall in between",
            "content": "Why you make this film?\nNo story line, No Acting ... Why Why WHy...\nAnyone can do better this director.",
            "review_date": "2018-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Varun carries this terrible story on his shoulders",
            "content": "Judwaa 2 is an Indian Hindi film directed by David Dhawan starring Varun Dhawan, Jacqueline Fernandez and Taapsee Pannu. It can be called a Slightly Twisted Remake of 1997 film 'Judwaa' With very few changes in the story, this movie is very predictable for the people who have watched the prequel. This movie has very rare laughs unlike the prequel. The story seems to be illogical at so many parts. This movie does a decent job for the young viewers who just want mindless entertainers but for the elder or logical audiences, this flick is just a mess!Performances - Varun Dhawan is good in his role of Raja and Prem. He does a good job in differentiating the characters of Raja and Prem and carries the burden of whole movie on his shoulder.Jacqueline is simply an attraction for the male audience. She looks hot throughout the film. Her acting is definitely poor in this movie but even a good performance from her wouldn't make a difference to this terribly scripted filmTaapsee tries her best to make this film a good one, she acts really well and looks hot.Music - This Music Album is given by Sajid Wajid, Anu Malik and Meet Bros. The Iconic Song 'Chalti hai kya 9 se 12' and 'Oonchi hai Building' entertains. The lead casts dance really well. 'Aa Toh Sahi' is a good and entertaining song with good music. ' Suno Ganpati Bappa Morya' is a good tune with horrible and senseless lyrics.Summary - This is a below average movie with a good performance from Varun and Taapsee, a few laughs, a good looking cast and fantastic music.Should I Watch this? Varun fans and people expecting a mindless entertainer with glam and good songs might like this one but for the rest of the people, it's better if you stay away from this!",
            "review_date": "2017-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nothing but garbage",
            "content": "What is wrong with this film?the whole film is full bad jokes,I don't understand how anyone was laughing watching this movie.this movie is purely nothing but 100 percent grade A piece of monkey bile.",
            "review_date": "2018-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not Bad!",
            "content": "I had a good luck with this because I haven't seen Judwaa 1 and the fact that max. of the movie is copied didn't bother me.The movie is entertaining and enjoyable. Varun Dhawan is the pillar that holds the movie and keeps you entertained.A good movie but nothing special.You will surely enjoy it if you haven't watched 1st part.",
            "review_date": "2017-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This had the same Soul as the Original",
            "content": "JUDWA 2 - Ask yourself . Did you liked the original Judwa. If the answer is no them you will pretty much hate it (unless you like Varun Dhawan a lot but then again there will be very few people who likes Varun without liking his Dad's movies from the 90s). And if the answer is Yes , then you have every reason to watch this.But let me be clear first. This is not a sequel . it's a clear cut remake. The story-line is same , some of the Jokes are same , even two of the songs are same , hell the Lisping character of RajPal Yadav is just anyone's downed version of Rangeela from the original played by Sakti Kapoor. And of course Varun Dhawan is just doing the Salmaan Act (just like he did the Govinda Act in Main Tera Hero , and he did it very nicely in both these movies).The jokes worked most of the time and didn't worked a few times. Then again if only you liked the jokes from the Original Judwa. But there was a comic scene where Three of the Ladies from the movie are being kisses at a time , and you would be amazed to see who the third lady is apart from the two lead actresses. Best scene of the film.There is nothing to talk about the story-line. Like I said it's a remake , hence Two Judwa brothers get separated at birth , and after many years fall on the same city and the whole sequences of confusion starts on. And that's it. So please please please , leave your brain at home , because this is a Dusshera release with David Dhawan being the director.Sajid Farhaad's dialogues were what keep the movie on track. I think sometimes , why they write good jokes for David Dhawan and write crappy jokes for Rohit Shetty.When it comes to acting , as I said Varun Dhawan did the whole Salmaan Khan act , sometimes even using the same way of Dialogue delivery , and he really did well. But apart from him it's Rajpal Yadav and Tapsee Pannu who really shines. Truly there was nothing given to Tapsee , she was just a candy girl in the movie (Same as Jacqueline) but she really tried to act . You can see her performing , it's like she is in some other movie altogether , giving the movie more importance then it deserved. Even her dance step were awesome.Talking about dance , The songs were exceptionally shot. Very entertaining , choreographer definitely deserve fool marks. The action sequences were nice too. And London looked pretty beautiful , which actually it always does. The whole movie has been shot with Digital camera instead of usual Film Camera , so it give it a different look for a change..Salmaan Khan's cameo was not interesting to me. Pretty badly executed and not required for the story. at all. Also there were some emotional scenes which didn't worked at all.This was not on the level of Humpty Sharma and Badrinath ki Dulahniya. But definitely better then Main Tera Hero and all the Recent Rohit Shetty movies. Including (I think) upcoming Golmaal Again whose trailer looks Horrible.Watch it . It's a pretty nice festival film. And I was myself at least one day Late.6.9/10 by ANuP APu KuMaR",
            "review_date": "2017-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "copy and paste",
            "content": "Firstly,its a reboot of 1997 blockbuster judwaa starring salman khan, same scenes, same dialogues,same songs,same characters.basically, its old wine in a new bottle.The heroines have done their job decently,nothing to shout about.Varun dhawan has shown that he is the next big superstar of bollywood. in this movie also. he is a typical bollywood hero.PLOT:Twin gets separated in the beginning, but their reflex actions are mentally attached. so if one hits then other also hit as simple as that and comedy of errors happens all over the movie afterwards.villain is same like the original.so the plot is samethere is nothing to spoil, its totally reboot of judwaa and if u haven't watched judwaa, watch that first.VERDICT:don't spend money if u don't like mindless comedies,if u r a typical bollywood masala movie fan,then you can give it a watch.SPEND MONEY ON MOVIE TICKETS WISELY!!!!(Free advice)",
            "review_date": "2017-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not Recommended",
            "content": "The Worst movie I have ever watched, better if I would have taken a sleep for 2hr -_-",
            "review_date": "2020-08-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not so good movie",
            "content": "Not so good movie to watch especially the old one was better the songs are pretty good but movie fails to impress the audience.",
            "review_date": "2020-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nonsensical movie",
            "content": "Bollywood - pls stop making non sense movies. Nepotism will take bolllywood deep down the path of self destruction",
            "review_date": "2018-10-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "How can anyone appreciate such cheap films",
            "content": "David Dhawan will test your patience level with Judwaa 2. It is filled with crass jokes and cheap humour. Women are treated as objects. I don't know how the girls working in it accepted their roles. Varun Dhawan's character spanked their asses and they really don't have any problem.Varun Dhawan was all about jumping and dancing. There is not a single dialogue which he delivered normally. As if two Varun's were not enough, both girls behave as puppets, only dancing to his tunes. Tapsee Pannu was comparitively less irritating,but her mom? She was happy when Varun's character forcedly kissed her daughter. And that idiot doctor, even his name(Surname) is a hindi expletive and he spoke that in an ugly manner. Can it get any cheaper than this?Jokes are terrible. Varun Dhawan in an emotional mood says, 'Ammi jaan kehti thi,... Chittian Kalaian ve'. Who writes dialogues like this. Atleast half of the jokes are sexual.Censor board can cut a few swear words matching the situation from Masaan, but they allow disgusting films like Judwaa 2 for some reason.",
            "review_date": "2020-08-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst copy-paste,, n varun is no way near to young salman..!!",
            "content": "Judwa 2 is one of the worst movies I have ever seen which moreover is like a movie with no bind to the storyline..not for a single moment I felt glued to the movie..it felt like hundreds of bits and pieces joined together but no genuine storyline in it..and comedy wise it looked like there's no continuity..the characters were appearing and throwing punch lines of the great indian comedy show.Also Salman Khan's cameo in the end was like a forced special appearance which didn't make any sense.It's nowhere even near to the original Judwa.Tapsee n pawan malhotra,,oh plzz dont be part of such movies..,!!",
            "review_date": "2019-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is a funny movie and yeah the have to be there dances are not that awkward",
            "content": "For starters the locations were chosen well and are a good appetizer.When I wrote this review there were hardly any votes and the rating was 3.7. Well, it is definitely an above 6 for me, and for some funny scenes it jumped just over 6.5, so I could give it a 7. I don't regularly watch Hindi movies, but I have seen good ones and bad ones. This one was more towards the refreshing ones.It got all the needed distractions like the BMX chase, some roof and street jumping, so it never really got boring. Some nice action scenes which could have done with a bit less violence. So please do not take your one and two year olds like the guys next to me in the cinema.The main actor, Varun Dhawan did a solid job, playing these two different characters, Jaqueline Fernandez seemed to enjoy the dance lessons before and was in sync with Varun, and Tapsee Pannu, well, she is just gorgeous.All together a nice comedy with some sidekicks to other movies like Three Idiots. I enjoyed it. I tend not to over analyze movies.",
            "review_date": "2017-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "They Made the Same Film with the Same Scenes 20 Years Later...",
            "content": "What can I say at least the songs are good but they copied that as well from the original movie. The villains were awful the acting was ok but I mean its the same film with literally THE SAME DIALOGUE! Are you kidding me? This is what people spend their money on. I feel like this would be 6/10 or 7/10 if it was even in least bit original but I can't promote this scam save your money for a better film or just do something else. Heck it isn't worth illegally streaming just watch the original film if you want a good, original and decently acted film.",
            "review_date": "2020-08-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad",
            "content": "First the idea got my attention , but after some time the movie gets awful with a lot of plot holes and lack of acting \nI couldn't even continue watching the movie",
            "review_date": "2018-05-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not up to the mark but still enjoyable !!",
            "content": "No logic, no story....Just nonsensical entertainment,few really laughable scenes,cliché action sequences,old yet enjoyable songs, fun-filled acting by the 2 actresses & an energy-packed performance(including over-acting) by Varun Dhawan sums up Judwaa 2 !! I knew the sort of movie I was going to watch so I enjoyed it thoroughly,apart from some boring portions. :) Having watched Judwaa previously, this one brought back some good old memories of it's predecessor, with certain scenes almost completely copy-pasted, including the dialogues.Varun has tried to pull this off extremely well and almost carries the entire movie on his own shoulders !! Some people might literally find the movie nothing less than a disaster....but if you know this kind of cinema,if the masala entertainers are your thing, you won't be that disappointed. Leave your brains at home & dance to the \"tan tana tan\" with the Dhawans, provided mindless entertainment amuses you.",
            "review_date": "2017-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I thought it was a crap movie but it wasn't it",
            "content": "Judwaa 2 is a really funny romcom and action movie it has all the elements that Bollywood needs. The songs are brilliant they make you wanna dance to the music or at least tap your foot to the beats. Varun dhawan did a very nice job acting in a double role film his comic timing was amazing and also Jacqueline Fernandez did a really good job and her comedy was much better than in A Gentleman, Tapsee Paanu hands down she did a really good job specially in a comedy movie which she hasn't done. I would really recommend this movie your going to laugh a lot if you like comedy, action, and romantic movies.",
            "review_date": "2017-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very enjoyable flick",
            "content": "Judwaa 2 is the sequel to judwaa which released in 1990s . Varun dhawan playing the double role is awesome and is quickly becoming one of my favorite actors . Jacqueline Fernandez and taapsee pannu are good . The supporting cast is all good . The direction is Great. The screenplay is clever and witty and at times makes very clever jokes . The music is good and the movie is overall a very good time . Judwaa 2 is a definite recommendation from me and try to see it in the theaters because this movie deserves to be seen on the big screen.",
            "review_date": "2017-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thourghly enjobale movie",
            "content": "The movie was actually enjoyable. I thought this was going to be a modern crap but I'm glad they stuck to the roots. The movie isn't too westernized as the Bollywood music can be most of the time nowadays. I was actually happy to find out that it had a lot of 'desi' masala in it. Not every modern movie has to be made in western style. There are some that are good. Then I also hate some 'desi' stuff in some movies. It can be annoying at times. But this movie being a sequel needed to be this way. It was thoroughly enjoyable.",
            "review_date": "2020-07-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Forget this movie exist.",
            "content": "If I could, I would rate this movie somewhere distant at minus infinity. I would be sleeping peacefully, had my friends not urged me to go along with them to watch this movie. MOVIE? No, it's one of the biggest stain on bollywood. What's that dirty smell? It's Judwaa 2. Yuck! That acting, that script, every effing aspect. I waste my time every now and then but then I'll forever regret I wasted my time on this whatever. If you've not watched this yet, count yourself blessed.",
            "review_date": "2017-12-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ruined a 90's favourite for me",
            "content": "There isnt much to say about this boring two hour film, it's simply a remake if you can call it that of the original Judwaa. If you've seen the original and even if you don't like it as much you'd have to admit it is better than this piece of junk.Anupam Kher is a legend in my eyes but he couldn't replace the original comedy of the great Kadar Khan, those scenes with the \"wrong number\" dialogues cannot be reused with feeling forced and they weren't even funny. I could not watch this film without remembering scenes from the original at least Salman played both characters with a bit more finesse, Varun copying Salman's style just makes him look silly. Mannerisms that cannot be repeated and dialogue delivery that makes you slightly sick. I personally enjoyed the original there's a lot of nostalgia behind it. The last fight scenes cannot be matched and shouldn't have been. I am really surprised that Salman Khan endorsed this second film and even made a cameo, what a wasted scene that was. Anyone who's considering watching Judwaa 2 don't bother just watch the original again.",
            "review_date": "2018-09-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "very good film by David DHAWAN",
            "content": "I went to see this film when it came out and I really enjoyed it because of the cast and story line . I like David DHAWAN film a lot but found this one very funny and catching . The cast is very good and even though varun dhwan is my favorite actor and jaqueline fernadez and tapsi pannu is my favorite Actress I really enjoyed this comedy Romance film",
            "review_date": "2017-11-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bekar",
            "content": "I dont understand why Varun Dhawan is considered a good actor. With rubbish and nonsense acting he does.",
            "review_date": "2021-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A disaster of a movie",
            "content": "One of the worst movie till date. Aak thuu. Waste of time",
            "review_date": "2020-12-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watch with right expectations",
            "content": "One cannot judge a fish by its ability to climb a tree. Or, choose a dessert from the restaurant menu and then complain why it does not have salt and pepper. That, is the problem with most of the reviews here. If you don't know what to expect from Judwaa 2, the problem lies with you and not with the movie.Now, I am all for movies with intellect, social message and creativity - loved the ones like Dhanak, Trapped, Bareilly ki Barfi, Newton, Nil Battey Sannata etc. These movies are a fresh breeze that has rejuvenated Bollywood but one cannot carry the same expectations to Judwaa 2.Judwaa 2, pretty much delivers what it promises - decent action, mindless comedy, peppy songs, bollywood grooves and mild emotional scenes. Anyone who has directed as much as a street play, would know how difficult it is to make audience laugh. This movies does that well enough for a large target audience. If that was not the case, finer comedies like \"Bareilly ki Barfi\" or \"Dum Laga ke Haisha\" would have earned more than one-fifth of Judwaa 2's collections.Now to prove yourself an intellectual - try finding a cancer cure, build some artificial intelligence programs or write a Booker winning literature piece - don't take the shortcut of hollow and misplaced criticism.",
            "review_date": "2018-01-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Review",
            "content": "Very good, awesome majedaar movie.\nI think old people who have watched judwaa 1 doesn't found it interesting but I loved this movie. Nice acting by my lovely Tapsi pannu nd mah bro Varun Dhawan.",
            "review_date": "2018-11-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Entertaining and fun movie - just don't ask too many questions !",
            "content": "Entertaining remake of original Judwaa which was done by Salman Khan. Varun Dhawan plays a dual role (Raja / Prem) with Jacqueline Fernandez (Alishka for Raja) and Taapsee Pannu (Samaira for Prem).Prem's father meets a person (the villain) on his flight from London to Mumbai. Upon landing, the villain keeps a water bottle filled with smuggled goods in his co-passenger's bag so that he comes out clean when Airport police checks him.Prem's father rushes to hospital to know that he has twins and the villain visits him in the hospital (how !?) so that he can take the water bottle. But, Prem's father has already intimated the Police and they catch the villain. When he tries to escape, he takes one of the twin babies (Raja) and leaves it near train track, runs to a godown, and blows it by opening a gas cylinder making the police and Prem's father believe that Raja was inside and is dead (due to the blast). Villain is presented to court and is sentenced to jail. Due to villain's strong network, Prem's father is advised by the Police to go elsewhere. Prem, his father and mother go to London, settle and he is raised there while Raja is raised in Mumbai.As the story unfolds, all the characters travel to / meet in LondonFun concept is that when the twins are in nearby, each others are connected and action done by one are mirrored by the otherPlot holes:There are a lot of scenes where twins are nowhere nearby but they mirror actions - There are a lot of scenes where they are next to each other, but they don't mirror their actions",
            "review_date": "2017-10-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fun, goofy entertaining film!!",
            "content": "There is a user named Takethispunch who is clearly an Indian trying to look cool by going around on IMDb and trashing every single Bollywood film on its release day (often without even watching it)... this has to be spam? Either delusional or extremely try-hard for attention but unfortunately people like this hamper the film discovery experience for Americans like me.Anyway:Had a fun time watching this one. Varun Dhawan is a great performer, both on the acting front and the dancing front, and has a strong screen presence. The film is quite silly, so leave your seriousness at the door before coming in. The songs are really catchy! And the girls (unfortunately are pretty dumb characters) do provide added eye candy and silliness.Watch to chill out",
            "review_date": "2017-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "UTTER NON-SENSE",
            "content": "The last one was dumb..the new one dumber....mainstrean bollywood commercial movies are just money-making,audience fooling business oriented movies...no use of a healthy brain to see these movies...",
            "review_date": "2018-05-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Please Improve your Storyline as well as Casting",
            "content": "They might have thought that Taapsee has lost some weight so she was perfect for the role but when will you understand that it's all about acting not only looks and figure. So disappointed with Taapsee's role.",
            "review_date": "2020-09-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "entertaining!!!",
            "content": "It's a good movie if you have watched the franchise!!! If you didn't like the first one and came to watch this one then idk what were u expecting because it's a remake.",
            "review_date": "2022-06-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What the ffffffff did I watch",
            "content": "Now I would want to watch Judwa (original) to get this crap out of my head, what a terrible movie. This dude is what he is because of his name, terrible actor.",
            "review_date": "2019-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Salman's Judwaa was better",
            "content": "Judwaa 2 is a pathetic film...Now I know that Salman is really good. Varun is not even 1% of Salman",
            "review_date": "2021-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Judwaa 2: Half the fun, half the excitement.",
            "content": "Been a somewhat fan of the original. As a kid watched it few times and enjoyed. Unfortunately can't say same about this one.Comedy was forced, not funny & annoying. Characters were weak and one dimensional. Varun Dhavan does not have even a quarter of charisma, Salman Khan had. Jacqueline Fernandez & Taapsee Pannu were just eye candy.Only good things this movie had are strongly connected with the original. Songs were good. The best 2 of them (Oonchi Hai Building and Tan Tana Tan Tan Tan Tara) were remakes from the original movie. *SPOILERS* The ending with original Judwaa was surprising and really good. *SPOILERS*Overall, Judwaa 2 is simply not fun as Judwaa.5.5/10",
            "review_date": "2017-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste and garbage",
            "content": "This is a waste product which shouldn't be recycled.",
            "review_date": "2021-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst movie",
            "content": "Totally worst boring movie Varun Dhawan is over acting and story was not good 😠",
            "review_date": "2020-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pathetic movie",
            "content": "This is a real garbage of a movie. Just trying to seduce with those heroines not wearing enough clothes but that attempt also falls flat.",
            "review_date": "2020-07-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Crap !!!!",
            "content": "Who ever giving 10 ratings to this movie really need to go mental hospital . What a crap really one of worst movie it is even more bad than the prem ratan dhan payo",
            "review_date": "2020-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fun-derful, brains switch off Movie",
            "content": "Judwaa 2 - Fun-derfull movie. Remake of Salman Khan's movie Judwa. Its a Movie about twins who got separated after birth because of some unfortunate circumstances. Besides face they don't have anything in common as were raised in different environments. However, they had a mirror impact for each other's actions. The circumstances they face and how they got reunited is what the movie is all about. David added Varun's uniqueness in this remake. Though I don't remember the original story completely though believe that there are many changes made. Story is good, songs are good, comedy is relevant as per age. Varun and Jacqueline did a good job however Tapsee seemed unsuited(uncomfortable as well) for this role. After her first Bollywood movie Chasme Badoor she didn't got much opportunity to do Bollywood masala movies hence got shifted to strong kick-ass characters. This lack of expertise was quite visible. Maybe this movie can get her back to masala-romantic arena. Rajpal Yadav tried to add his charm though Varun was enough as per comedy. Overall it's a complete time-pass movie(though nothing original) and you can spend your hard earned money on this.",
            "review_date": "2017-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watch the Original",
            "content": "Even by David Dhawan standards this is a bad film. According to me one should remake a film only if one can improve it or add something good otherwise they should be left as it is. The original Judwaa which is in itself an average film has now been further downgraded to Judwaa 2. No logic,No story,only scenes put together. Everything is lacking in this film.Even if you watch all the movies in a year skip this one. Watch Original Judwaa instead.Two stars only for Jacqueline and Tapsee.",
            "review_date": "2017-11-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb movie",
            "content": "I love this movie it was superb varun dhawan done superb acting in this film he is the best actor",
            "review_date": "2018-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I don't like the acting of Varun Dhawal. He did overacting",
            "content": "Overacting of Varun Dhawal and Jaqlien Fandanize make the movie to flop. Tapsee Pannu is better than both of them.",
            "review_date": "2020-06-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What the hell did i just watch",
            "content": "Absolute rubbish! These people can't even copy properly. I was cringing throughout the entire film. Pathetic acting by VD & Sara. This just made me realise that it's not worth it to waste your money and time on Bollywood movies.",
            "review_date": "2022-03-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Varun davan plz leave the bollywood industry",
            "content": "Most disgusting movie of the year why u are in bollywood after kalank and judwaa 2",
            "review_date": "2020-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A One Time Watch",
            "content": "Lets make it clear.If you are going to watch a Varun Dhawan film do not care for logic.The film is just a commercial potboiler to be watched if you are bored. The movie has comedy and action which is enjoyable. It is the exact copy of the original.Coming about acting there is not much acting scope The film entirely lies on the shoulders of Varun. The heroines don't have any role in movie and there is a cameo by Salman Khan.The music department disappoints and especially watch out for the climax. Overall it can be watched as a stress reliever. A one time watch",
            "review_date": "2017-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Huge Banner film fails again to impress",
            "content": "Totally Illogical story , overacting by lead actors & actress . No comedy timing at all . Disappoints all the audiences . Waste of time & money",
            "review_date": "2020-08-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst acting by Varun dhvan",
            "content": "This film has huge fan base but for legndery Govinda not for this star kid with 2 rupees acting skill",
            "review_date": "2020-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Complety bad movie",
            "content": "Why reuined the orignal.\nJust over acting varun\nTotal Garbage movie",
            "review_date": "2020-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent remake and stress-reliever",
            "content": "WORTH A WATCH ONCE! Varun Dhavan may not be a Salman but brings an equally good performance in this remake of the classic Judwaa. This is a great movie to watch after a stressful work week without worrying about anything. Some comic scenes are noteworthy. Besides Varun, Rajpal Yadav, Johnny Lever and other characters have at least one \"bring the house-down\" scenes. If you are in the mood for good, clean comedy, great songs, visuals, FUN, and are wanting for or OK to \"leave your brain behind\" typical David Dhavin-style, this is a must watch.",
            "review_date": "2017-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Film makers of this movie should be jailed.",
            "content": "One of the worst movie ever seen, utter garbage. David Dhavan should be ashamed of himself.",
            "review_date": "2020-08-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pathetic",
            "content": "Somebody please explain Varun that no mater how hard he tries he can do only Overacting. Aur ye judwa 2 ko Twins 2 kaun likha he be??",
            "review_date": "2021-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "Nowhere near the original. Watch it only if you're a fan of the lead cast.",
            "review_date": "2022-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is very boring, awful.the actingof Varun Dhawan is very poor most of the time he looks doing over acting.Wacthing this film means making insane your self.",
            "review_date": "2019-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the funniest and entertaining film i have seen",
            "review_date": "2019-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie ever! I watched it twice within 12 hours. The songs are top notch too!",
            "review_date": "2018-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "leave your brains at Home but made me wanna watch the original again",
            "review_date": "2018-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hardly any improvement on what was quite a low bar set by the original.",
            "review_date": "2018-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Judwaa 2\n\nThe director wastes our time in creating different episodes of the \"twin\" crisis and forgets to put anything in it except for some lame one liners. not only is the movie sexist but also has some major flaws in script and execution.",
            "review_date": "2018-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie must watch everyone great binding package of laughter for families and couples strongly recommend everyone to watch this for one time.",
            "review_date": "2017-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two and half hours of nonsense! No morals, treats women as an object. The movie doesn't make sense even for a second. Don't understand how films like this become a hit in India.",
            "review_date": "2017-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "silliest movie I've ever watched.. I left the movie early - thats how bad it was!",
            "review_date": "2017-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good movie it makes you laugh whistle and enjoy the movie",
            "review_date": "2017-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So predictable, signature bollywood movie, lots of song, replays and over reactions..  Overall watch only if you fond of bollywood",
            "review_date": "2017-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Judwaa 2' is cringe worthy cinema at its best, which despite Varun Dhawan's spectacular act is a letdown due to its uninteresting old fashioned humor.",
            "review_date": "2017-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed it and even my friends.?? and the last scene the entry of bhaijan was awesome..",
            "review_date": "2017-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Faltu movie...copy paste and release same $$$$ again. Keep taking advantage of foolish audiences Bollywood !",
            "review_date": "2017-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Varun Dhawan's impressive dual performance as well as some hilarious moments can't save \"Judwaa 2\" from a plot that doesn't make sense, terrible villains, lame songs, scattershot humour, bad directing, unsatisfactory editing, and a slipshodVarun Dhawan's impressive dual performance as well as some hilarious moments can't save \"Judwaa 2\" from a plot that doesn't make sense, terrible villains, lame songs, scattershot humour, bad directing, unsatisfactory editing, and a slipshod script. There is some enjoyment to be had, but leave your brains out of the theatre.",
            "review_date": "2017-10-06",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "rt_rating": 3.3,
    "rt_summary": "Twin brothers Raja and Prem are separated at birth after their father exposes a kingpin and his racket. They eventually come together to battle a smuggling ring and save their family from certain doom.",
    "meta_rating": 4.8,
    "meta_summary": "Twin brothers born to an honest businessman are separated at birth when their father exposes a smuggling racket and a king pin. One of the brothers is thought to be dead but only resurfaces stronger after living life on the streets to reunite with his family over a sequence of events and twist of fate. Genetically bound by reflexes both theTwin brothers born to an honest businessman are separated at birth when their father exposes a smuggling racket and a king pin. One of the brothers is thought to be dead but only resurfaces stronger after living life on the streets to reunite with his family over a sequence of events and twist of fate. Genetically bound by reflexes both the brother’s lives interlink in strange ways and a comedy of errors. They eventually come together to destroy the smuggling nexus and save their family from a downfall that awaits them.… Expand",
    "vibes": [
        "least",
        "recent",
        "romantic",
        "impressive",
        "double",
        "fresh",
        "hollow",
        "mild",
        "lazy",
        "annoying",
        "dual",
        "sexual",
        "comic",
        "cynical",
        "exciting",
        "lucky",
        "preposterous"
    ]
}