{
    "title": "Tubelight",
    "rating": 3.9,
    "release_date": "2017-06-23",
    "num_reviews": 181,
    "genres": [
        "Drama",
        "War",
        "Action",
        "Adventure",
        "History",
        "Fantasy"
    ],
    "summary": "A story of two brothers set during the Sino-Indian war, 1962: the younger one who's at war at the borders and the elder who's at war with his own world.",
    "reviews": [
        {
            "review_title": "Worst Movie of Salman Career comes when he is at Top",
            "content": "This movie is a complete disaster in all aspects from story, direction, acting and music. Only good things are some of the locations shown in movie. Salman Khan tried to do a Koi Mil Gya Character here but falls flat. Worst part is the thing which you hate most in movie is none other than Salman Khan, this movie is even bad than London Dreams and Jaaneman. Biggest disaster movie from Khan released on Eid. A complete journey of boredom that simply never ends, when leading actor disappoint at such a level than other supporting cast good acting was also ignored that happen with Sohail part here, he was very god in his extended cameo role. I am Salman Khan fan and watched all of his movies enjoyed all of them but his 3 movies Jaaneman, London Dreams and this are really painful but in other 2 movies Salman was average but in this movie I am running our of words how bad his acting was.At least this type of movie was not expected from kabir Khan who lacks completely on Direction part.I Will rate this 2/10",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Little Light!",
            "content": "Kabir Khan & Salman Khan are a combo to reckon with. Their first collaboration was the Smash Hit Ek Tha Tiger & was followed by an All-Time Blockbuster with Bajrangi Bhaijaan. Expectations from their latest effort 'Tubelight' are expectedly gargantuan. But sadly, 'Tubelight' fails to deliver.Reason? 'Tubelight' stands on a faulty script, that despite noble intentions, never takes flight. This tale of two torn-brothers aims to be an affecting tale on brotherhood & love, but what is eventually served here, is a bland film, that never hits the point.'Tubelight' Synopsis: Laxman (Salman), a man-child simpleton, believes his faith will bring back his brother Bharat (Sohail Khan), who gets lost while in Battlefield in the Sino-Indian War. 'Tubelight' stands on a tiny plot & Writer-Director Kabir Khan gets stuck midway. Once Bharat leaves for war, the narrative just becomes stoic. And Laxman's relentless effort to bring back his brother with the power of 'faith' is overlong & tedious. Also, the sub-plot involving Laxman's relationship with a Chinese Family, of a mother & child, don't add much to the goings-on. To give its due, 'Tubelight' begins well & the camaraderie between real & reel life brothers offers genuine charm. But that doesn't last long. In short, 'Tubelight' doesn't make good use of its tiny plot & just goes on 136-minutes. Kabir Khan's Writing is the weakest link here. Though his intentions are to deliver a noble message of love & peace, but the Writing isn't tight enough. Also, there are too many songs in the film & they only drag the film. Khan's Direction is alright. Aseem Mishra's Cinematography is fantastic. His work deserves all the credit, as 'Tubelight' is a visual delight. Editing needed to crisper. Pritam's Score is nice, but the songs don't appear useful in the film beyond a point. Art & Costume Design are decent.Performance-Wise: Salman falls flat in his portrayal of Laxman. As a man-child driven by unshakable faith, the superstar tries to stretch the actor in him & even makes a sincere effort to justify the part, but his performance appears mechanical. Its sad that both Kabir & Salman aren't in form this time around. Sohail Khan gets little to do as Bharat, although his scenes with Salman are sweet. The Late/Great Om Puri shines in his final role as Salman & Sohail's mentor. The Legend grabs your attention in a supporting role. Mohammed Zeeshan Ayyub is perfectly mean as the bully. Matin Rey Tangu & Zhu Zhu lend able support. Yashpal Sharma is wasted. And Shahrukh Khan barely leaves a mark in a cameo.On the whole, 'Tubelight' offers very little light! A Huge Disappointment!",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very watchable and nice movie - don't blindly follow the critics reviews",
            "content": "I just saw Tubelight now on Star Gold HD. To begin with, I really do not understand how critics operate. Nor why Tubelight did so poorly at the box office.This is such a watchable movie. The story was interesting, the locations were fantastic, the acting good, the cinematography exemplary, even the songs were catchy .... what more is required for a film to be entertaining?At worst I could say that it stretched a bit, just a bit, and perhaps there was too much music. The story is meant to be fictional and every film isn't meant to depict absolute stark reality. Tubelight held my interest, made me laugh, made me smile and even made me cry my heart out towards the end ... just before the happy ending! Salman was great as Laxman and the little child Matin was adorable. Om Puri - I think his last film .... may he Rest In Peace. Every actor performed well.I enjoyed Tubelight and I am really glad that I do not choose to watch films based on critics reviews.",
            "review_date": "2017-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Over melodrama+cringe worthy scenes=Tubelight",
            "content": "\"Its one of the worst films of bollywood and nothing new to offer.\"My rating- (1/5)As the title suggests full movie is like Tubelight. It tests your patience and they could have reduced 40 min to make it \"atleast watchable\". This is a torture from kabir khan and salman khan. Everyone before the release was like \"tubelight will break Bahubali's collection\"But after the release after hearing initial reports producers reaction be like -\"Hope at least it will get more than bahubali actor's salary\"positives-1.)Salman khans innocent and childish acting. He has that cute charmness on his face and i really loved his performance. (Only thing which can make you glued to the screen)2.)Shahrukhan's cameo. His presence and combo scenes with salman was good.(celebration for both the fans)3.)Brother bonding scenes (emotional)Negatives-rest all are negatives and gives viewers a big headache.Overall- If you have any enemy's please take them to this movie or if you want to breakup with your girlfriend then this movie is the best option. Try it. (Try at your own Risk)",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pathetic",
            "content": "This movie is another Salman pathetic movie. Poor acting and direction. Tubelight rests on poor plot and lacks the power to enthrall and mesmerize. I am sure it will make money and be declared as blockbuster but this is not worth watching. Only good thing about movie is to see Om Puri",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must watch",
            "content": "I think people giving review hate good movies with happy ending. Salman khan is doing great job with putting movies like these. I can watch this movie with my family and same goes with Bharat. Trust my words i had watch every possible tv series and anime but bollywood has its own touch.",
            "review_date": "2021-07-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "fails to live upto its title and eventually falls flat completely",
            "content": "TUBELIGHT is a story about a man's unshakeable belief. Based on the adage, 'Faith can move mountains', the film revolves around the life of a simpleton named Laxman Singh Bisht (Salman Khan). Because of his exceedingly gullible nature, he gets nicknamed as 'tubelight', thanks to his inability to grasp, understand and analyse things like others. The story starts off with a narration by Laxman, wherein he takes the audiences through his childhood to adulthood. While the world doesn't take him seriously, the one man who always stands by Laxman and has complete faith in him is his younger brother Bharat Singh Bisht (Sohail Khan). One day, in the wake of the Indo-China war, the Indian Army invites applications from young Indians to join the army and serve the nation at the time of crisis. While Laxman gets rejected outright, Bharat gets chosen to be a part of the Indian army to go to the border to fight against the Chinese invasion. Life falls apart for Laxman when he gets to know that there is no contact with Bharat and that he may have died in the war. That's when Banney chacha (the late Om Puri) tells Laxman to have faith that his brother Bharat will return. Does Laxman Singh Bisht's faith fight the test of time, does Bharat Singh Bisht return back home safely, and what happens ultimately of the Indo-China war is what forms the rest of the film.While the promos of TUBELIGHT simply 'lightened' up everyone's excitement about the film, the film fails to live upto its title and eventually falls flat completely. The film's story (Kabir Khan) is raw, extremely half-baked and totally convoluted. The film's screenplay (Kabir Khan, Parveez Shaikh) is very convenient and rests on a wafer thin plot that gets stretched way too long, thus, spoiling the film's novelty in a big way. The screenplay seems to have been born out of convenience rather than conviction. Even though the film has been based on the adage 'Faith can move mountains', TUBELIGHT just does not hold any kind of solid content to mirror the same. The film is not at all convincingly made in the context of a backdrop of a war as it lacks the emotional connect with the audiences. The film's dialogues (Manurishi Chadha) are just about average and very much unlike a typical 'Salman Khan film'.",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It doesn't even flicker for a moment",
            "content": "It is difficult to believe that a Director with good track record can node yes to lead such a lame story and screenplay. It seems that someone else of his name has directed the film. Director must be aware of the lead actor strength because of his long association with him but in this movie he totally exposed actors weakness. In emotional scenes sometimes lead actor looks funny sometimes irritating. All characters and actors in film look visibly alone even being connected to each other. Film is so slow that you pray to its end in climax. First they punch you irritating assumed emotional pre climax then kick you with childish climax. That shoe exchange excuse is so stale and repeated. Kid looks cute but then his name was kept, thinking it is funny but repetition of his name sounds eventually filthy. Background gun shots sounds as cannon shot. I just cherished a moment when lead actor throws ash and second lead actor runs and then diffuses as ash. Performance wise all good actors are wasted. Especially lead actor doesn't fit this character.",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tubelight Review: Salman did attempt something which is both heartwarming and commendable.",
            "content": "Movie: Tubelight (U)Rating: 4.5/5Salman Khan: the star who has delivered a lot of commercial successes comes up with something different this time. Since this isn't usually what he delivers, I can't say that this film will turn out to be a big box office success. Largely because Indian audiences still don't understand what to expect from a film after seeing the trailer. The trailer already what kind of a film this one was going to. The negative reviews did make me doubt my choice of watching this film. But after I watched TUBELIGHT, I realized that it's indeed a very powerful and engaging film while it's entertaining too.TUBELIGHT is not what one usually expects from a Salman Khan films, so obviously it might not impress everyone. But will definitely work for those who love emotional films. The emotional scenes are portrayed very well and almost every such scene brought tears in my eyes. Salman Khan is indeed the biggest strength of the film as it's hard to imagine someone else do the character he did. It's really commendable that he did something of this grade. Sohail Khan, the late Om Puri, Zeeshan Ayyub, Martin and Zhu Zhu give good performances and every character is very well written.The story and screenplay of TUBELIGHT hold a lot of promise, and the film delivers on that front. The music is good. The action sequences are well filmed, and so are the locales captured. The editing is fine but could've been better towards the end as the pre-climax episode seems a little extended. But the film still holds your attention with the power of emotion and you leave your seat with a different experience. This must be enough to summarize how good the climax is.Overall, TUBELIGHT is a different experience so it will definitely entertain those who love such kind of emotional war-action drama films. Salman Khan's name is enough to bring people to the theatres. And further, Kabir Khan's solid direction is enough to entertain them with something they'll love to take home.",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste of time and money",
            "content": "Save your money and your time and avoid this broken Tubelight. This is not awful, it's worse than that. The story is non-existing and over acting is prolonged, and painful. The worst part is non-essential over dramatization. There are better movies available! NOT RECOMMENDED!",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Save your money and your soul",
            "content": "I have watched 100 of movies in theatres but this is the first time I got out from the cinema hall. Could't bear this garbage after interval. No storyline , only melodramatic drama and music. Film is racist , a Chinese name is called gu (SHIT) real name was guo. Even though they know Hindi but accent is that of katrina kaif (lived throughout there life in India)A man catches fire but it is supposed to be funny. I have no idea how the film ends because I walked out after interval , but listening from other people does not improve after interval.One of the worst performance ever by salman khan. I hope this film flops so that in future such shits are not made",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic film that has not gotten the recognition it deserves.",
            "content": "Laxman (Salman Khan) is a mentally challenged adult who is devoted to his younger brother, Bharat (played by Khan's real life brother Sohail). When tension breaks out on the China/India border, Bharat joins the army. Laxman is lost without him, so a friend (Om Puri) encourages him to follow Gandhi's teachings and increase his belief. Meanwhile, a mother (Zhu Zhu) and son (Martin Rey Tangu) of Chinese descent move to the village, creating dissension among the community. The young boy and Laxman become good friends. Armed with a new friend and increased faith, Laxman tries to end the war through his hope.This is a marvelous film about love, hope, and the bond between brothers. The chemistry between the Khan brothers was natural and perfect. Salman Khan played a mentally challenged man with excellence, and was simply amazing in the role. The sets and locations were gorgeous. The songs and choreography were also good. Overall, this is a fantastic film that has not gotten the recognition it deserves.",
            "review_date": "2017-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It takes nerve of steel to watch Tubelight which is fused from the very beginning",
            "content": "What do you in life when you are bullied, laughed and doubted - you believe in yourself. If you believe in yourself and the keep the hope alive, nothing can beat you. Tubelight, remake of critically acclaimed \"A Little Boy\", does sends out the message but is far from being properly executed .. Tubelight tells the story of a special man (Salman Khan) whose IQ is well-below his age but is a gem-of-a-person. Praying for his brother's (Sohail Khan) return from Indo-China War, he starts fulfilling a wish list.Kabir Khan, who gave us some memorable films like \"Kabul Express\", \"New York\" and \"Bajrangi Bhaijaan\", Tubelight will come as shock for his followers and especially for Salman Khan's fans. The well intentioned film sits on a wafer-thin plot and the screenplay is weaker than a woman's tear. Of course, there are few moments which is enthralling. For instance, Salman Khan taking courage to slap his naysayer who he hurts the Chinese family. The scene where Salman Khan thoughts that his brother is dead at the Army camp and closes his ears pretending not to hear the sad news is one of the finest moments from the film. Unfortunately, the scenes are less to keep up the momentum of the film which falls flat on the face and tumbles down into a rabbit hole.Cinematography is superb capturing the beautiful locals of Manali, Kashmir and Ladakh. Art direction is pretty impressive. Background score is just about okay while the music piece by Pritam is decent with \"Radio\" song being best of the lot and well-choreographed. Coming to the performance, Salman Khan tried something different with his honest performance. However, few scenes I felt he was overboard and could have worked on his expression. Zhu Zhu was good in her part. The young chap playing \"Guo\" was amazing. Sohail Khan was just about okay while Om Puri and Mohmammed Zeeshan Ayub were excellent.Overall, Tubelight has been a big disappoint. Watch it only if you have not seen \"A Little Boy\". Below average 2/5",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst movie of the year",
            "content": "Today I thought that I should watch this movie so I booked tickets for the movie. The show was at 12:00 PM. When it was the time for intervals I was regretting my decision.Salman does not know how to act and he was annoying. I suggest you not to watch this movie and waste your money. I think it's enough for now Bollywood is intolerable",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tubelight is a zero watt bulb",
            "content": "Keep your brains outside the movie theatre before watching movie. Salman did the same job while making it... Sohail deserves Oscar for the consecutive flops added to his list. Worst screenplay worst acting worst storyline (little boy movie is way better) n Worst direction... Even d audience laugh at every serious n emotional scene. Only thing better in d movie is \"nothing\".",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't go with the baseless reviews.",
            "content": "It's a very good movie with great emotions. But according to so called critics they reviewed that it's the worst movie. They are great performance of salman and it's pure it's gives a strong relationship of brothers. Watch with your view surely you will like it. Thank you.🙏",
            "review_date": "2021-08-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pathetic and over the top!!!",
            "content": "After a long time we have a Salman Khan movie that has the main character portrayed in a very boring, over the top and irritating way. It has a very thin plot and the movie lacks soul. The only saving grace are the beautiful visuals and a decent act by all the others involved. Most of the emotional scenes come across as unbearably farcical, crippled by what is possibly the worst performance of Salman's career. The problem of the movie seems to be Salman himself as he tries really hard to come off as slow-witted but the effort falls flat on its face. Although the movie has a good message to convey but it hardly gets conveyed. The songs tend to slow the movie down even further. Really disappointed!!!!",
            "review_date": "2017-06-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better Switch Off This Light. ♦ Grade F",
            "content": "Kabir Khan's films are always based on magnification of a small idea that looks good on theory, but becomes preposterous on reel. His latest Bollywood feature drama is the newest example.Laxman (Salman Khan) is a dim-witted young man who lives with his younger brother Bharat (Sohail Khan) in a small North Indian town. He is called \"tubelight\" by his fellow town-dwellers because of his doltish nature and his inability to muster general things at the usual human pace. Bharat knows that his brother needs his support to survive, but still enlists himself for the army. With no one else to go to, Laxman now finds solace in a young boy named Guo (Matin Rey Tangu) who everybody misguidedly thinks hails from China, a neighboring country which India is currently at war with.Director Khan, along with co-writer Parveez Sheikh, narrate a straightforward story here and try to exaggerate it beyond limits. The basic idea that they try to convey is about Laxman's undying love for his brother and his unabashed faith in this love that will possibly help his brother come back hale and hearty post the war. As stated earlier, while that story looks good on paper, watching the Khan brothers enact it with a couple of supporting actors (albeit talented) is real pain. Mostly because the whole drama is highfalutin nonsense that does not induce any kind of emotion, let alone tears. An added dash of ambiguous magical realism does not help either, as one will find out if one manages to finish watching the film.Although, the film is too politically correct to not appeal to the average Indian audience. Of course, it may not matter to the international crowd, but when the makers inculcate thoughts of patriotism (nationalism, if I may) into the dialogues, one knows what the story is trying to achieve, and thus pay attention. One could look at this film as a message to the several unpatriotic citizens of India who should sign up for the army and look for Laxman's prayers to stay alive. Utter nonsense! Forget what's in the epitaph and hail the country!At the end, however, one realizes that all that Laxman did was fool around with his new friend and his friend's mother. For an average film-goer, the experience would be foggy, unsatisfying, and deeply disappointing because of factors that are not only related to a poor script. The quality of acting is not that great either. Watching Salman Khan wince as he tries to act like a half-witted grown-up is cringe-worthy. The popular notion that he cannot act might finally be becoming more apparent. His brother Sohail has a small yet pivotal role, and he too seems over-occupied. Supporting actors Om Puri, Zeeshan Ayyub, Zhu Zhu, Tangu, and Brijendra Kala put up a better show.The score is ambient, but the songs did add to the stupidity of the entire 2-hour long show. I am personally not against songs in Bollywood films, but when they are unnecessary, it's better to leave them out. Some exciting shots of northern locales of India, but other than that, it's just Salman and his borderline mockery.Overall, there are far too many negatives in this film, which is a remake of a 2015 Mexican film called Little Boy. Even if you are optimistic about the Kabir-Salman duo or are a fan of any of the actors, skipping it would be in the best of your interests. Do not even watch the original.BOTTOM LINE: Kabir Khan's \"Tubelight\" must be an ambitious project, considering that it released during a big festival time in India, but as standalone cinema it does not hold any ground. You might as well switch off this tube light.Can be watched with a typical Indian family? YES",
            "review_date": "2017-06-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "disaster movie",
            "content": "This is disaster movie of year. Director made this movie to showcase Salman acting skills. But Salman cant act. He is known as superstar not as an actor. Late Om Puri Ji is only saving point for this movie. He has again proved his versatile acting skills. Camera work is good and some locations are good.",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Deserves more than 10 stars",
            "content": "Script is truly genius. Its not like most other bollywood movies filled with item songs. This is different and sits among top Indian films of all time.Very much recommended.",
            "review_date": "2018-03-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst Movie Ever",
            "content": "Complete copy of Hollywood little boy. Pathetic acting n screen play. Torture for audience.Songs r average. How can someone make these kind of movie. Worst movie ever. Story line based on self believe. But after seeing these movie everyone might lose their self believe.Film is very slow nothing happens only a pathetic actor who pretending of a dumb boy always crying.",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Technically Strong but disappoints in plot and Honesty",
            "content": "Being Salman Khan comes with a responsibility, sometimes that turns into : i'll do anything and fans will still watch. The original movie LITTLE BOY is so honest as we can believe a small childs fantasies and innocence. but tube light seems like forced. the easiest way to gain sympathy is by showing the protagonist as a non matured kid, innocent and childlike. we have had a long history of that in bollywood, gain sympathy by showing some rare disease (pa, guzarish, barfi) or show non realistic themes.locations and cinematography is wonderful, so is the other cast. Om puri and the little child. rest it just feels like a safe bet by kabir khan, put a goody goody world and ppl will grab it.of course one can't argue with salman fans as they get personal in case anyone criticises the movie. how ever it's more important to understand who exactly are they helping in this case, their IQ or Salman Khan",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This Tubelight is dull.",
            "content": "First thing first, I am not a Salman hater. I went into this movie expecting another good experience, because that's exactly what Bajrangi Bhaijaan did for me. I was disappointed.This movie means well and wants us love our neighbors, but when the main man of the movie (this movie is 95% Salman) is unconvincing and at times, annoying, you just cant enjoy the movie. I liked what Salman did in Bajrangi. I didn't like what Salman did in this. I cant make up my mind on if he was trying too hard to be a convincing disabled childlike-man or not trying at all, because most of the times the camera was on Salman, he's making extremely silly and at times annoying distorted faces. I know kids and people with similar disabilities do that too, but what Salman was doing looked like he was making fun of such people, far from convincing us that he was one of them. Then again, making Salman play a disabled childlike man was never a good idea.This movie can get emotional (trying too hard at times) so you might want to bring tissues along. The plot is pretty simple, Laxman aka Tubelight does little but wholesome things to increase his 'yakeen' which he believes will bring his brother back from war. The cinematography is breathtaking, but the war scenes were disappointing and poorly choreographed. The film's music was thoroughly enjoyable, especially Nach Meri Jaan and Radio.The supporting cast was pretty good. The late Om Puri showed us his excellence for one last time, acing the role as Banne Chacha. Sohail Khan played his part well, nothing else to it. Zhu Zhu was great whenever she was great on-screen, so was little Matin Rey Tangu. Zeeshan Ayyub was convincingly good in his role. SRK's cameo was (no pun intended) magical.5/10.",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't judge the movie by critic reviews. Watch yourself.",
            "content": "\"Worst movie ever...\", \"Don't waste your money...\", \"Salman Khan is not able to act...\"... IMDb and more are filled with such reviews. Guys, what do you want to watch? Item numbers? Actress in skimpy outfits? Kissing scenes? Do you expect Action in a Drama movie? Tubelight is a beautiful drama/war movie. Its about strongly believing in what you want. And Salman Khan did a great job. My 5yo son, who was not so focused when watching Jungle Book, watched Tubelight from the start to the end. He had tears in the emotional part and agreed that he enjoyed. What else do we expect? Don't judge by online reviews. Watch the movie yourself!",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the Best and must watch",
            "content": "I liked this movie a lot.Very good looking film with beautiful story . Gooddirection . Amazing writing and cinematography . Salman Khan sir portrayed his character very beautifully and looks like why he's One of the Best actor of his generation over the globe 🌎. This movie also explored positivity spiritual aspects like believe very nicely. The people will learn something good .",
            "review_date": "2022-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very good",
            "content": "Very good Relationship Story war between brothers very Emotional",
            "review_date": "2019-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I am not a Salman Khan Fan but this was not as terrible a movie as per the other reviews",
            "content": "I was excited to see the movie because of Kabir Khan, the amazing songs and the backdrop of Indo-China war, which not a lot of Bollywood movies have covered. I prebooked tickets for Saturday Night. Then came the reviews-- critics and movie-goers, everybody panned it. Most were like- no story, bad direction, terrible acting. Not being a regular Salman Khan fan, where I only liked a handful of his movies such as Tere Naam, Pyaar Kiya To Darna Kya, I was a bit apprehensive. I watched the movie yesterday and I liked the movie, the songs, the child actor, the story and most importantly Salman's courage to pick up a non-conventional role. I mean I understand it is no Shawshank Redemption and may not be the best Bollywood movie either but it is definitely an above-average, emotional rendering of a man's story who is not a stereotypical hero, set in a time where things were different, filled with positive messages about nationalism, acceptance, war and \"yakeen\"(belief).My suggestion, go watch this with your family. It is a tearjerker and definitely one of Salman's best acting roles after Tere Naam.",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Abosolutely brilliant!!!! One of sallu's best...",
            "content": "Tubelight is a film about a mentally unstable or rather mentally deprived man whose brother has been at war for long time and he although didn't get any news regarding his brother's whereabouts is hopeful that one day his brother will return. Will his brother return or his hopes will be over forms the Crux of the film.\nThis film generally got negative reviews from everyone, but I give a damn. Salman's character is like a child and having problems which he is well aware but he is not concerned about these but all he concerns about is his brother. So Salman acted that way. It is painful to see when Salman is actually giving performance according to his character then all are saying all kind of negative talks. He deserves distinction for his effort. Rest of the casts including Sohail are efficient. The locales and especially soundtrack are just awesome. Radio song and main agar are the best of the lot. There is emotional content in the film that is very much real. Feel of the film is terrific. Sometimes good films become flop and vise- versa. Tubelight expectedly flopped because people in our country don't like good film with entertainment. This film is definitely better than those nawazuddin films.\nBottom line is tubelight is a gem that no one cared about...but as I said I give damn!\nAs the tagline says,'kya tumhe yakeen hai' I would say mujhe yakeen hai k Salman can do good roles besides comedy and action.",
            "review_date": "2019-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heart touching movie!",
            "content": "This movie has many aspects to watch!It shows the sibling's love...!It shows the power of believing!It shows that a differently able people are the only one who are truest in today's world and teaches us to love them and understand that they are just different!!A movie beyond critics.I give a 10/10 for making a brilliant movie.Salman & Kabir khan's finest performances!",
            "review_date": "2021-10-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Emotional and heartwarming tale of brotherhood",
            "content": "Very nice movie by Salman. He attempted a different role and did justice to it. The story is very deep and the ending made me cry. Great acting by Sohail. The little kid actor was very cute and acted well.",
            "review_date": "2021-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you have faith u can move mountains.",
            "content": "First of all a message to Salman, haters are going to hate. In my opinion you and Sharukh both are doing a great job if you are trying to choose amongst sensible movies. So keep up the good work.As far as acting of Salman is concerned it was better than average. I also felt he was not hitting the gym for all the time during which he was acting for this movie, to suit up for the role.Cinematography was brilliant.Music was above average. Music did add to the emotions of audience. In some parts I felt most of the music was just like from one of the songs, of Kabirs previous movie Bajrangi Bhaijaan. I dint mind the duplication as I enjoyed it.Only thing disappoints is that the movie in some scenes does not appeal emotionally or as the movie should have been. So whatever was set, turns out to be an average.",
            "review_date": "2017-06-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Please Watch Yourself ! Don't Judge This Movie By Critic Reviews.",
            "content": "Love cannot be found where it doesn't exist, nor can it be hidden where it truly does.",
            "review_date": "2021-06-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant, amazing and emotional...just loved this movie...!!! YES YES YES",
            "content": "The movie was brilliant, acting by all was amazing...Salman and Sohail Khan were amazing together...i strongly advice please watch the movie with friends and family, it has some funny scenes and some emotional scenes...One advice to the critics who said anything negative about the film, go and get a life, this movie couldn't be any better...",
            "review_date": "2017-06-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "terrible case of casting",
            "content": "#Tubelight is not your typical senseless Salman Khan film, guess that explains the poor box-office results. The film is not very bad, but this is a terrible case of casting. Both brothers, Salman n Sohail, look too old n bulky to play the central n innocent characters. Also, it is ethically incorrect to pass off an Arunachal Pradesh kid as Chinese. Om Puri is perfectly cast n you definitely will miss his presence henceforth. The film is based on the concept of \"faith\" n creates situations wherein the hero is expected to do impossible things like move a mountain or stop the Indo-China war. Hardcore Salman fans can give it a miss, others can watch it. Rating 2.5/5.",
            "review_date": "2019-07-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Emotional movie not for the Salman bhai fanboys",
            "content": "This is a very nice, sweet and simple movie. If you are expecting action and over the top heroic stunts with not so funny one liners, this is not your type of movie. It has a simple story of a mentally challenged person trying to cope up with the loss of his only family member in this world. You would certainly find an emotional connect with the acting of Salman khan if you have lost someone close recently. Also I think it was a bold movie for Salman Khan since his fanboys expect him to behave in a very manly (men also cry btw) and strong heroic manner. But in this movie he is showing his emotional side which probably is the way anyone will react in such a situation. All the characters have done proper justice to the role. If you want 2 hrs of emotional drama then this is a good movie with a relatively positive ending. Don't go by other reviews. It is a genuine movie with a pure heart and soul. I was never a salman fan but he has actually given his best. I care more about the effort of the actors and directors. I saw that they have given their best in a different script with an honest attempt.",
            "review_date": "2017-06-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Love this",
            "content": "I don't know why other people are giving less positive remarks but i love this movie its emotional at last and also the storyline is good.",
            "review_date": "2021-06-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Faith Can Move Mountains,But Not This Half-Hearted Piece Of Cinema ! \"",
            "content": "Both the earlier collaborations between Salman and Kabir khan,\"Ek Tha Tiger\" and \"Bhajrangi Bhaijaan\" were universally acclaimed films that set the cash counters ringing at the box office with the latter being one among the biggest hits ever in the history of Bollywood cinema.With \"Tubelight\",Kabir Khan has tried to cash upon the Bhajrangi Bhaijaan's success by churning out a movie that follows the narrative style and treatment of Bhaijaan which sadly doesn't work due to its flawed screenplay and a mediocre performance from Salman Khan.Undeniably the weakest film from Salman Khan & Kabir Khan in recent years,Tueblight has a melodramatic story-line that's overly preachy and monotonous for the meaty part of the narration,with the \"Bhajrangi Bhaijaan\" hangover making it even worse at multiple instances in the course of the narration.Kabirkhan does try to include quiet a few political statements in the movie which are honest and socially relevant,but the lackluster story-line spoils the impact and renders the movie as just a slow-paced drama without any notable high point as such.Salman looked innocent playing a developmentally disabled man who believes in Faith more than anything,but failed to make any emotional connect whatsoever unlike his films in the recent past.Sohail Khan enacted the role of Salman's brother convincingly,but looked much older than his real life brother on screen.Among others,debutant child actor Matin Rey Tangu and Chinese actress Zhu Zhu played their part well.Songs and BGM were adequate.Overall,Tubelight is a strictly average rip off of Alejandro Gomez Monteverdes's 2015 flick \"Little Boy\" that can turn a decent watch if you go with very low expectations !",
            "review_date": "2017-07-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tubelight may have its good moments but Salman Khan is a miscast as the lead role.",
            "content": "Tubelight (2017): Everyone got surprised when Salman got a disaster in his career after 7 years of consecutive successes.Tubelight,which is a remake of 2015 Hollywood film Little Boy is released amidst huge expectations as it is from Bajrangi Bhaijaan combo.But surprisingly,Tubelight failed in impressing audience.What's the reason? Plot: In a small picturesque town in North India, Laxman (Salman Khan) lives with his younger brother Bharat (Sohail Khan). The two have no other family and are inseparable. Laxman's world comes crashing down, when war breaks out and Bharat gets drafted into the Army. A helpless Bharat leaves a devastated Laxman behind. News from the border only worsens, as the tension continues to escalate. Seeing the carnage around him and worried for his brother, Laxman decides he must stop this conflict and get his brother back.My Review: Salman Khan has come a long way from the days of bare-chested fight sequences and gyrating dance numbers – a combination that brought him some of his biggest hits and sent legions of his fans into rapture.The change began with 2015's summer mega-hit Bajrangi Bhaijaan, in which the star sought to build bridges between India and Pakistan; it continued through last year's biopic Sultan, where an ageing action man pondered how best to use his muscle.Both the films are very good and considered one of the best performances from Salman Khan.But Tubelight did not.Even if the film's scenes are inspired from Little Boy,Tubelight has Bajrani Bhaijaan vibe to it.Salman Khan's act and his friendship with a kid,all resembles the Bhaijaan.Even though the movie has lot of content to become a emotional film,it is wasted as the film tries to be too melodramatic.There are some things that actor Salman Khan does very well — like barreling through action scenes, romancing women and dancing to Bollywood songs, with or without a shirt.Delivering a nuanced performance in the role of a developmentally disabled man? Not so much.Playing a mentally challenged character has by now become a rite of passage in Bollywood — Salman Khan's A-list box office rivals, Shah Rukh Khan and Aamir Khan, have both portrayed characters on the autism spectrum with skill and sensitivity, in My Name Is Khan and Dhoom 3, respectively; while Hrithik Roshan's attempt to play an intellectually disabled character in Koi...Mil Gaya and its sequels but here Salman tries too hard.But his dedication deserves a mention.This film has strong performances from Om Puri,Chinese actress Zhu Zhu and Mohammed Zeeshan Ayyub and surprising cameo from Shah Rukh Khan.SO,Tubelight may have its good moments but Salman Khan is a miscast as the lead role.My Rating 5//10",
            "review_date": "2017-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Remake of a movie , which was not that good by itself.",
            "content": "TUBELIGHT - Bollywood has a great talent , they can take a 1hr 40min movie and remake it into a 2hr 30min film. Adding whole lot of songs , extra description , lengthy email conversations etc. At least away from his usual 'beat the bad guys' characters. That's something positive. Yes it surly is.To declare first , I would be a wrong person to considered for telling you about this movie. The reason being I have already Seen 'LITTLE BOY' the movie from which TUBELIGHT has been copied (or officially remade , I don't know exactly) . Which I didn't liked much. So for me , TUBELIGHT is a remake of a Hollywood film which I think was not worth remaking. But they did it. And did it decently. It's better then it's original. But not great.The storyline is very manipulative and convoluting. It's based on the message that \"you can do everything if you have faith\". But the message is given in a wrong way. And by wrong I mean that much wrong that parents would take care of their small children to make them understand that message correctly or they can take itin a wrong way.Emotional moments were not that great as Bajrangi Bhaijaan . Yes I know , that's a high bar to achieve. But TUBELIGHT didn't even came close to it , even after being made by the same team. So I guess that's a valid comparison. When it comes to performance , I don't actually have any complaint with Salmaan. He did an earnest job. But again , when I compare it to Amir Khan (Dhoom3 , Ajay Devgan(Main Aisa Hi Hoon) , Hritik Roshan (Koi Mil Gya) , SRK (My Name Is Khan) playing similar roles , Salmaan fall short. Speaking of SRK , his cameo was really flat or I can say , nothing special with that.Didn't liked the VFX , too many animated scenes were there , easily seen that it's done with computer. Songs were too many. Radio , Tinka Tinka , Kuch Nai , all three stopped the flow. Only , nach Meri Jaan and Main agar add to the flow. I mean again , the length of the movie could have been short , really easy.But yes , it's a passable film. Not bad. Jokes work. Salmaan's performance work . And I really liked two Chinese actors Zhu Zhu and Matin Rey Tangu. They both acted really good.So yes , movie may work for hard core Salmaan fans. Or for those who have enough time for a long movie. Didn't quite worked for me. Check your requirements before watching it.6.4/10 by ANuP APu KuMaR",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best of Kabir and Salman",
            "content": "One of the best performance of Salman and excellent emotional ride.Unlike other Bollywood movie not much masala. The idea of hope and belief was presented very well.People giving bad review need some intellect to understand the message of the movie.I agree that there is a lot of sobbing in the movie but that's because of the emotional message the artists want to convey.",
            "review_date": "2017-06-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Kabir Khan should read this if he intends to work with Salman Khan next time.",
            "content": "Salman Khan has been on the verge of great Indian Cinema with movies like Bajrangi Bhaijaan, Sultan, Partner, Hum Dil De Chuke Sanam, and Wanted. Everything about Salman Khan has been accurate starting from its screenplay to his tremendous acting. So basically this movie is a remake of a Hollywood flick that goes by the name of Little Boy which starred David Henrie and Emily Watson which did become a critical failure. After watching this movie, I felt that a remake wasn't really necessary plus the dramatic factors were exactly the same between the 2 movies.So basically, Laxman Singh Bisht is a Ladakh boy who is very dependent on his brother. He is a man child due to his symptoms but is very loving and respectful. His brother joins the army to fight the Chinese but appears missing which actually shows him being caught by Chinese soldiers which occur during the war. Laxman meets this magician who is played by a special actor who gives him powers where he can shake the ground using his mind. With the help of a child and his mother who get lost during the war, how Laxman gets his brother back is basically what this movie is all about.The teaser was a masterpiece making me realize how excited I was for this film.It breaks my heart to say this but it is a disappointing film. Kabir Khan would've still made this film successful if he produced a much more coherent screenplay. I know how much he loves doing favorable films like risks to get the job done but alright, the 1st half he managed to keep the film overwhelming but the benefit of the doubt lies in the 2nd half where the movie drags for another hour and a half making it boring and less comedic/tear jerking. The acting was consistent but not too great.Salman Khan manages to give a phenomenal performance as Laxman and keeps the film going until the end so that is something that kept me satisfied but the dialogues were rather perky like the \"yakeen\" line when he is asked to believe in himself to find his brother.Sohail Khan was surprisingly good but not too good and does bring back some mentality from his previous washouts like Main aur Mrs Khanna or Miane Pyaar Kyu Kiya.Matin Rey Tangu was adorable but his role doesn't bring any tears just like what Harshaali Malhotra did in Bajrangi Bhaijaan but he was good in term of acting but in some parts of the film.Om Puri's role will be remembered and also remembered as an inspiration to Bollywood.Zhu Zhu was just there and really didn't do much for her role so she was bit effortless and bland.Priam's music is a nightmare except the Radio Song which still plays in my head. He has been making horrible music since Dangal but Raabta had some refreshing tunes but yeah Priam's album is a losing streak.Overall, this movie is undoubtedly one of the most Disappointing movies of 2017 and I though after the teaser, it was something else. Don't waste your end money this weekend and I'd rather buy a Bajrangi Bhaijaan DVD but for Salman Khan's performance, I can partially recommend it for the big screen but later it will be a regret.2.5/5- Box office is the usual 400-500 crores but won't beat Baahubali 2 which is at the top of the game sitting on 1800 crores.Eid Mubarak everyone!!!!!",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Recommended Movie | The Best Movie",
            "content": "It's beautiful film. Salman is as usual at his best. I don't know why media think it is let down. Bhai's fans did not like their bhai as a tube light i guess. But movie is must watch. It's family drama. You can watch with your family without feeling awkward not even for second.Thank you Salman Khan.",
            "review_date": "2017-07-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My opinion..plz don't waste your time on this...",
            "content": "Well to keep it short and simple... This movie basically revolves around salmans character for 80% of the film.... The movie is awfully slow paced with a very weak plot... sometimes you might find yourself thinking what on earth is going on... Well the only good thing is that.. Salman has acted very well...and has tried best to keep it together...other than that its just a slow boring kind of a movie which you should try avoiding...",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Pure Piece of Art. Great acting by Salman khan.",
            "content": "I went to the theatre with expectations and the moviw went beyond my expectations. Best acting by Salman Khan and Terrific Direction by Kabir Khan",
            "review_date": "2018-04-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't go by negative reviews",
            "content": "It's a beautifull film and great acting by Salman Khan. A very heartwalming film must watch",
            "review_date": "2021-02-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Its not the greatest but not the worst.....",
            "content": "Tubelight is another Kabir khan and Salman Khan movie together.... It is borrowed from the movie LITTLE BOY(2015).... Make no mistake the movie is complete drama movie... it wants to based on the character study but it fails somewhere...It is the last film of Om Puri who is great in this movie...The movie is about two brothers... its based on those two brothers relationship which we needed to care about to follow the story and to care about the journey of both brothers... but there relationship is very poorly developed and that fails this condition.. The characters of the village were great.. the relation between Main Character(Salman Khan) and the Chinese kid is great... The dialogues are good in this movie... some dialogues in some scenes gives you some lessons of life type dialogues which is good actually...There is few very Small war sequences which was fantastic...The acting pretty average from every one except Om Puri and Mohd. Zeeshan Ayyub... those two were fantastic in their roles...The songs were not needed.. it should have been 15 min shorter, it felt long... The movie depends on Salman Khan's acting and the the relationship between two brothers... both those fails and the whole movie seems flat.. The screenplay is good but it falters on directing and acting in so many level...Tubelight is a kind of drama movie that no one expected it to go that route.. the plot is good but execution is average... the movie is average... 5.9/10....",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better to enjoy baahubali again for this eid instead of tubeight believing it will break baahubali record",
            "content": "What,this movie will break bahubali record?How can few brilliants compared this myth to epic?Who said salman is great actor in India? Acting is worst.Before calling salman as great actor there is a tami movie called Deiva Thirumagal.Vikram in this movie make you cry to the core with his mental disability problem which is similar to laxman character.At least salman,kabir could watch this movie and take vikrams reference,style,body language before taking revenge on audience with this piece.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good story but average movie...",
            "content": "Acting is fantastic, direction is good but average screenplay ruin the movie ... climax is the highlight..",
            "review_date": "2021-05-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bhaijaan meets Barfi.",
            "content": "I would have never gone to see this movie had I seen the rating here. 4/10 is a bit harsh. The underlying message is noble. I'm sure a lot of people from Eastern part of the country are made to feel like India is not their country because of their outward appearance. The cinematography was excellent as always, Kabir shows his National Geographic talent here. The plot was predictable and not at all nuanced. A huge emotional element to the movie that would appeal to some. It was not my cup of tea. Honestly it is about time Sallu stopped doing this type of lead roles meant for someone in their early 20s, he looks old and so does Sohail with his prominent double chin. Wonder where Kabir goes next - Sri Lanka or Bangladesh. Please hire some new blood next time.",
            "review_date": "2017-06-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nice movie.",
            "content": "Watch the movie and i found its a good movie its not like Bajrangi Bhaijaan but its a good movie and good story. Salman khan acting is good in the movie and Good entire team work, Nice location from Northern India. But here lots of people giving negative review Because they hate Salman khan i don't know but its there thinking any how the movie but they will give him wrong negative review on Salman khan movie. The Tubelight movie its good movie.",
            "review_date": "2017-07-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie",
            "content": "Story a1..\nSalman acting super ..\ndirection super...\nDemerits\n#screenplay\n#editing\nThoda slow hai... But full of emotion hai\nLuv it 😍",
            "review_date": "2019-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Despite its limitations, this movie can save the world...",
            "content": "Having been extremely underwhelmed by the trailer, I decided to watch this movie since my expectations were rock bottom. My expectations were so low, in fact, that the movie could only disappoint me if I suffered a stroke during the viewing and died. Having watched the film, I can tell you now that I wish I did have a stroke, it would've been far more pleasant than watching this calamity.That being said, I'm sure this movie will be a huge financial success- such is the new low of Bollywood. And in this, the last nail in the Bollywood coffin, we see a steroid jacked 50 year old playing the part of a mentally disabled man-child, in a movie brazenly copied from an English title. I gave this film 2 stars because despite its limitations as a movie, I can see it being effective as a method of torture. Prisoners in Guantanamo would sooner gouge out their own eyeballs using spoons laced in chili oil, than watch this movie. To that end, it may have its uses yet.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The key of enjoying Tubelight have low expectations",
            "content": "Kabir Khan's attempt to make a flop film converted in blockbuster is awesome in his way unfortunately indians could not take this as a masterpiece may be they are tired 'cause they already made 2 highest grossing films on 2017. (winked emoji) The bounding among Salman-Sohail showcased by Kabir is extra entertainment. Salman Khan doesn't jutified the lead character but his performances were not embarrassing, he did quiet good. As example, Ranbir could have been done better. Zhu Zhu's appearances are good. Om Puri and Zeeshan Ayyub performances are awesome. Music by Pritam is so mediocre this time, background score by Julius Packiam is praiseworthy! Slow pace is one of the drawback. Cinematography of Aseem Mishra is awesome. If you want to enjoy Tubelight have low expectations and don't watch IMDb ratings-reviews.",
            "review_date": "2017-09-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nothing special in this cute flick but it's only Salman whose innocence and honest acting makes it a decent watch",
            "content": "Nothing special in this cute flick but it's only Salman whose innocence and honest acting makes it a decent watch. The way he stayed in his character throughout was remarkable.Storyline Rating: 2Acting Rating: 3 Salman Khan: 4 Sohail Khan: 2 Om Puri: 3 Mohammed Zeeshan Ayyub: 2 Yashpal Sharma: 3 Isha Talwar: 3Direction Rating: 2Music Rating: 2Cinematography: 3Editing: 3",
            "review_date": "2017-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie made me sob so hard(and I never cry)! Beautiful",
            "content": "I have absolutely no idea what these negative reviews are talking about. They seemed to have watched a different movie. I created an account just to review THIS MOVIE after seeing so many negative reviews.Watching Salman Khan in this type of role is amazing and this time time the superstar really becomes an \"actor\". YOU WILL CRY WHEN HE CRIES, trust me. This movie is the 2nd movie ever to make me sob and I have watched a lot of movies both Hollywood and Bollywood. To sum my opinion up: If you don't watch it in theater you are seriously missing out. 100% emotional roller coaster",
            "review_date": "2017-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It hits you if you can relate",
            "content": "It's neither the fault of KK nor the viewers that this movie didn't do well. The reach of subject was wide however the context and execution was fiction based and artistic. It's difficult for such movies to succeed commercially or even critically sometimes as they are too close to the director.I loved it as I could relate to it. The setup engaged me. Hope it would engage you too at some point.",
            "review_date": "2019-11-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very emotional film",
            "content": "Guys please don't check negative reviews of the film, all are haters. It is a beautiful film must watch for everone",
            "review_date": "2021-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is a wonderful film. It is an emotional roller coaster of a story.",
            "content": "T U B E L I G H T (2017)To begin with I'd like to inform and encourage everyone to ignore the detractors of this film. This is a wonderful film. It is an emotional roller coaster of a story. DO NOT listen to people who tell you that it is bad film or that Salman hasn't performed well and so on.It is a simple beautiful story of a child like man who starts 'believing' that his belief can bring back his brother. Salman as 'Lakshman the Tubelight' is spot on with his performance. Wonderfully supported by Late Om Puri ji, little child actor from Arunachal Pradesh, Matin Rey Tangu is a delight to watch. His mother played by beautiful Zhu Zhu is amazing too, although they messed up with her dubbing. Sohail Khan has tried very well too and the couple of scenes he had, he is very efficient an effective.Superbly, beautifully shot by Aseem Mishra, Tubelight is film that relies of Salman Khan's emotions which I personally feel he has managed to communicate perfectly and very sweetly with his performance. I heard, read somewhere that this is his 'worst performance', I totally disagree. On surface level it might seem a bit silly but when you watch the film you feel the conviction with which it has been delivered.This film is a very relevant for India right now. It touches on many social issues and debates that we all need to think about.Racism against minorities, Patriotism, Empathy for Disabled people, the language wars, Alcoholism, Spirituality, pain and loss of loved ones, martyrdoms of our soldiers, it is an amazing film. One of the best aspect of the film is how the 1962 war with China is depicted. Wonderfully shot and directed, the battle scenes are very, very believable. Another aspect of the film that I really loved is that the film did not bash Chinese. Even Chinese soldiers are talked about with respect as India soldiers, except by a couple of characters who are really angry with China but who also by end have change of hearts of sorts.One of the most important reason that you should watch this film is Om Puri ji This is his last performance and it is wonderful as ever. He was as natural and a delight to watch as ever! Propagating the messages of Gandhi ji, his character and look is perfect and looks the part.The main message of the film is to have 'Self Belief'. With it one literally move mountains!Highly moving, highly emotional, highly fun and entertaining and highly satisfying, this is a must watch!Hats off to Kabir Khan for making such a lovely film.My ratings:: 8/10 (Deducting 2 for bad CGI at couple of places!)",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Salman Khan... Not such a \"little boy\" ... but u can watch dis movie !",
            "content": "Its a good watch, an entertainer I must say ! As always Kabir Khan tried to convey a novel message thru the movie. There are many good aspects in the movie, however, unfortunately you can see the flaws clearly as well. Locations, themes, actors and characters are excellent. But again, its a little too much of Salman, mixed up between being a weak , innocent and child like brother. Most likely- the message was to say he is a special child with great will power ! The relationship between Salman and the child was honest and very well depicted. How ever it was too much mockery to keep addressing the name as Goo thru out the movie, when clearly the name is Guo. Some of the Indian names are often made fun of in many sitcoms, to an extent the fun part here is also understandable as the broader message is clearly on being united. Overall it felt like I read an average book with awesome visions and imaginations of the era picked up for the movie. What made it not so good is the melodramatic and mixed up ending, clearly looked like an attempt to cater to Indian crowd who actually expect perfect and happy ending ! Its good to see Salman evolve as an actor. He did get naturally teary in the movie, specially given that \"Bhai chara\" is something he connects with all his heart! BTW with both the brothers their age and maturity shows up, although was not very uprightly deterrent in the movie. I would look forward to seeing Salman mature further and bring in more gender dominance in the movies :)! His charm, Kabir's touch of moral messages and true events and more dominant diversity will be a great deal to watch for ! Good way to say goodbye to Mr Ompuri - one of the legendary actors in Indian cinema.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "#Makaut #Mar_Points #Lockdown_Activity",
            "content": "Being Salman Khan comes with a responsibility, sometimes that turns into : i'll do anything and fans will still watch. The original movie LITTLE BOY is so honest as we can believe a small childs fantasies and innocence. But tube light seems like forced. The easiest way to gain sympathy is by showing the protagonist as a non matured kid, innocent and childlike. We have had a long history of that in bollywood, gain sympathy by showing some rare disease (pa, guzarish, barfi) or show non realistic themes.Locations and cinematography is wonderful, so is the other cast. Om puri and the little child. Rest it just feels like a safe bet by kabir khan, put a goody goody world and ppl will grab it.Of course one can't argue with salman fans as they get personal in case anyone criticises the movie. How ever it's more important to understand who exactly are they helping in this case, their IQ or Salman Khan.",
            "review_date": "2021-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's no Sultan. Think I prefer Mr. Kahn do action flicks.",
            "content": "Tubelight is about a man with the strange nickname who loves his brother dearly and when his brother joins the army during the conflict between the Indians and the Chinese during the 1960s, he looks to the teachings of Gundi to create a miracle to get his brother to come home, that miracle comes in the form of two Indians of Chinese decent who move into the village.Salman Khan plays Tubelight in this one. When I think of Salman Khan, I'm always thinking Bollywood's answer to Sylvester Stallone, I don't know why Stallone particularly, but that's what I'm thinking. In a lot of ways it makes sense because Stallone has done some strange so-so dramas in his career, and this is Khan's. I went in expecting a lot more action and adventure, but as it turns out this is more of a drama. It's an OK one, I'm not disappointed really, but I will say that Tubelight has nothing on the last Kahn movie I saw, Sultan, which was a pretty great drama.It's a very neutral film, allowing it to appeal to the massive audience, with a simple story on tolerance. How very interesting to see a movie on tolerance from a different culture. India was at war with China during the 60s, and at the rate that China was taking out the Indian army (according to the movie) it's understandable why Tubelight's small village was unkind to anyone with a Chinese face. Despite being a movie set in a different time in a different land the message it hits upon is very current for an American Audience (or anyone who judges a book by it's cover) Not that big a fan of musicals. Some of the Bollywood songs in this film are alright, but a lot of them feel like they were written by Disney composers, which I guess really sticks with the massive appeal of the film.So overall, I was hoping for an action film but still Salman Kahn delivered a movie that was not all that bad I guess.Oh, and rest in peace Om Puri who the movie was dedicated to. Whenever I watch these Bollywood films he was a face that I recognized more than Khan's, so it's sad that I will not see that face again.",
            "review_date": "2017-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "All positive rating are Hoax. Do NOT trust them",
            "content": "If you anyone rate this movie above 3 or 4 is clearly a Salman Khan Fan or has no sense about movies. This movie is the most cringe worthy boring piece of Crap with Salman Khan's wannabe Forrest Gump styled acting. All his fans have rated the movie 10/10, about 2500 of them that's why it has an average of 4.4/10 on IMDb. Official rating is just 2/10 that's all. Really not worth spending Rs. 300-500 on this over melodrama senseless movie with no logic( all Salman Khan Movies). Bollywood has to change. They cant be run by these stupid actors making flop remakes and giving terrible performances. Many good films are not brought into spotlight because of this stupid film release on Eid. So o final thought by me, don't watch this movie and go eat out somewhere with the money. If you are a Salman Khan fan reading this, i suggest you go **** yourself. Salman is cancer so is his fan-base.",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Was Overall a good emotional movie",
            "content": "People should understand that cinema is not about dance music and time pass. the Prime moto of movies are to convey a message which salman and sohail did . It was a good emotional and touching movie depicting the bond between two brothers and also how belief and faith can help you achieve whatever you want, Also I would like to add salman has never in such a role and he truly justified his role . I can say i am a salman fan but still the above is the honest review about bhai. Guys please support these movies with a message and a cause.",
            "review_date": "2017-07-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Salman's acting damn High",
            "content": "I think It's one of the best movie, Tubelight means Hope, movie is little bit slow but script is real Nife",
            "review_date": "2018-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very good",
            "content": "Very good Story about Brotherhood and war I like it Salman Khan Performance was great",
            "review_date": "2019-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent Movie and Acting",
            "content": "This movies is one of the best movies of Salman Khan. Acting wise its very good. Story is very powerful which shows that how love can change the world. Only a bunch of stupid people has rejected it because they do not know what is a real art. This is an art movie of Salman khan not an action movie like Dabbang. I would like to say thank you to the team of Tubelight for making such an excellent movie. Please keep making such movies so that world would know this fact that human beings can only live peaceful by spreading love among each other and war is not a solution. Thanks,Regards, SAM",
            "review_date": "2017-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"A Good One Time Watch\"",
            "content": "Don't know why this film is gaining negative reviews. After reading the reviews, I still decided to watch the movie ready to criticize it. But after watching the film I had a change in my opinion. It was really entertaining. Now saying about the movie, it is about Lakshman (Salman) whose brother is his life. But when his brother is selected for the war, he is shattered. But his hope and faith keep him waiting. That's the storyline. Some said it was overly melodramatic. But I think the statement is wrong. There was a good amount of drama woven into the narrative but never loses it's grip. The other thing to applaud is its camera work and background score. Those sections were neatly done. But there are also negatives in the movie. The film sometimes moves in a slow mode. And also the climax need not be long drawn. Now coming to the performances, Salman proves yet again he can carry a film on his shoulders. Sohail Khan has also done a wonderful job even though he had less role. Also the supporting cast which includes Zhu Zhu, Martin Rey Tangu, Isha Talwar, Om puri and Mohammed Zeeshan Aayub has also done their roles neatly. So overall this movie can be considered a clean family entertainer and will be a bang for your buck. My rating: 3.5/5",
            "review_date": "2017-07-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rare Brotherhood Movie in Bollywood, Rare people will Understand",
            "content": "Those people who lost there beloved brother.. or living far from them can only understand this movie.. there is no masala or nangaai in the movie.. that's why I think the ratings are low.. people these days wants to hear \"gaali galoj\", intimacy etc etc kinda things..\nI don't know why people don't understand this master piece..\nActing was superb.. like I told.. the ones who love there brother will definitely shed tears while watching this movie..\nI loved this movie..\nThank you Kabir Khan sir, Salman sir and entire team for making this movie.\nAll artists had done there part beautifully..\nThis one is close to my heart..",
            "review_date": "2020-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A moving film that will make you think.",
            "content": "It looks to me like there is some kind of campaign against this gem of a film. I have no idea why and couldn't care less. I loved this film.I was behind Laxman from start to finish and hated to see him being bullied but my heart went out to him as he tried to will things to happen. Wouldn't we all love that power from time to time?This film kept my attention throughout and that doesn't always happen with all Indian films I watch and I was particularly thankful that the music wasn't shrill as it often is during these films. My ears were very happy they didn't have to endure the pain that can sometimes accompany listening to the songs in Indian/Bollywood films.I cried more than once during the film as we neared the end. I believed in Laxman and thoroughly enjoyed all the performances.Ignore the hate, go and watch it and make form your own opinion.",
            "review_date": "2017-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Booooring",
            "content": "Okay for the First half an hour but after that you keep yawning. Bakwas.",
            "review_date": "2021-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "not any light at all",
            "content": "One of the worst movies in India . do not know why people still hero worship when they make such stupid movies . the hero does not know how to act , maybe take some lessons from prabhas. But when the main act isn't convincing, the film becomes just like the title: too much flicker, too little glow. The one word that's bandied about in every other line in the film is 'yakeen': ironically, that's the one thing we don't. Believe, that is. Despite its fluffiness, Bajrangi Bhaijaan was a sharp skewering of communal differences, and a strong call for cross-border 'bhaichara' Tubelight aims for the same mix, but falls flat.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "dumbest movie",
            "content": "honestly this is the first movie which i have skipped in interval.. literary I was regretting why I came to watch.. he still dnt knowing what is acting and plus Sohail khan added his CHARM on this seriously.. I strongly recommend you don't waste your time and movie for it.. instead of this you can watch TUBELIGHT on the wall in your home at least its provide something better to us..",
            "review_date": "2017-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This 'Tubelight' didn't have a good fight.",
            "content": "Based in Kumaon, the film is an official adaptation of Little Boy, but it is nowhere close to the original one.Set in 1962, the worst part of the film is its weak plot and sloppy execution. Tubelight is by far Kabir Khan's weakest film. Though the entire film is about brotherly bond, it hardly touches you. The film has uncountable glitches which makes it an absolute mess. While Bajrangi Bhaijaan is a film, which makes me sit in front of the television even today, Tubelight hardly strikes a chord. It fails to enlighten nor manages to get rid of the gloomy darkness in the world of entertainment. You can definitely skip this one and instead watch Kabul Express, Bajrangi Bhaijaan at home.My Rating : 2/5",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Phenomenal",
            "content": "I can't imagine why this movie wasn't a breakthrough of the year. It's got everything, and it is so well written and directed. We rarely see Salman Khan deliver deeply emotional performances, but this was exquisite. I do have a personal connection to this story as I have 4 sons myself with one on the spectrum, but it's a lovely lovely picture- grab the tissues.",
            "review_date": "2018-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tubelight review",
            "content": "Normally I would start out my review by saying the film name and name of the director. But I am ashamed to associate Kabir Khan's name with this film even. I saw the trailer of the film and I knew that \"OK. It may not be Bajrangi Bhaijaan but let's give it a chance\". In short, I had not kept high expectations with this film. But I was utterly shattered after the film finished.Plot: Laxman tries every possible thing to bring his brother Bharat back when he gone for war.Story and Direction: Let's actually summarize as to what Kabir Khan has done till now: 1) Kabul Express - A film set in Afghanistan about 4 people. 2) New York - About 4 Muslim people in New York City. 3) Ek Tha Tiger - A love story between a RAW Agent and ISI Agent 4) Bajrangi Bhaijaan - A man's struggle to send a kid back to Pakistan 5) Phantom - A story about an ex army man to take revenge on those people responsible for 26/11.A common factor noticed in all these films - Muslims. Kabir Khan has used this angle in many stories of his in one way or another. Not that I have a problem with this. I guess he has used this angle very nicely in his films. Kabir Khan must have thought \"Enough with the Muslim thing. People will think that I have nothing else to show. Let me use the Chinese.\" This film was a mistake from the very beginning. This film is just nothing. I don't expect things like this from Kabir Khan (Yes, I am saying that this is worse than Phantom). The first 20-25 mins were good. I even teared up a bit. The very first scene where the village is shown on top of a mountain was hilarious. But after that it was just s***. The second half even sinks further. There were so many implausible things done in this half that made me think \"What the hell Kabir. You are better than This\". The entire Chinese people subplot was useless. It had no base. And the Climax. O My God, So much clichéd. I started to actually laugh there. And I am beginning to hate the word \"yakeen\" (meaning: Belief). The number of times this word was said was unimaginable. And the things done with this \"yakeen\". O My God, it sucks. Kabir tried to replicate several things from Bajrangi like the way Salman introduces himself and the way the end credits come. I guess he hadn't come out of the BB fever. I saw some people getting out of the hall even before the film finished. And that is never good. One thing though the photography was very good. And the locations too. Performances: Salman Khan made the biggest mistake of his career signing this film. I always say that he is not a great actor but an excellent entertainer. This film showed his deficiency in the acting department. He cannot cry!!!! Sohail Khan sucked in every scene he appeared (especially in the climax). Om Puri's role made me realize that why he is of a great loss to the industry. Zeeshan Ayyubn was also a great addition. Matin Rey Tangu and Zhu Zhu were also good in their emotions. SRK made that 10 minute cameo something to watch for.Music: Pritam again has done wonders with the music of this film. I can't fault even a song of this film. Radio and Naach Meri Jaan were easily my favorites. KK's song (Main Agar) at the end was the icing on the cake.Favorite Scene: Easily it is the SRK cameo. The charisma of SRK never dies, even in a cameo.Worst Scene: Very easy. The climax. So clichéd and so bad acting. O My God.Verdict: The film is easily the worst of Kabir Khan (out of all his films) and Salman Khan (of recent times). The film as I said was a mistake from the very beginning (The source material itself has a 22% rating on Rotten Tomatoes). I being a big Salman Khan fan myself advise anyone not to go watch this film. It is full of s*** and absurdity. Even the music couldn't save this film.I am going to go with a 4/10.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Whats wrong???",
            "content": "I don't know about the taste of the world. All I know is that I watched and loved the movie. A different story line combined with amazing acting by Salman Khan make it a great treat. If you have a soul that really feels the emotions... This movie is gonna make you laugh and cry. Moreover, it gives an amazing lesson of belief and faith. For me it was 9/10 ... Watch it and decide yourself!",
            "review_date": "2017-06-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "really could not connect to this movie...",
            "content": "to be true, this is my first review on any movie. i watched tube light yesterday. it was my first day first show. because i had already watched its original concept i.e. 'little boy', from the beginning i knew the scenario... I was thinking during the entire movie that something would be different from the original movie but i was totally wrong. i felt it's okay to adapt the movie.. but unlike the original i could not connect to the feelings & emotions that protagonist would want us to. One of the finest directors in today's generation Kabir Sir & greatest superstar Salman Sir gave us masterpiece with Bajrangi Bhaijaan.. it's obvious to expect more... but with tube light i was disappointed. Since, i m a big fan of Salman Sir... it was a one time watch for me.",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heart touching",
            "content": "Its a under rated film with good script and acting including emotion.",
            "review_date": "2021-05-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Story.",
            "content": "It's high time we ditch the mainstream movie plots containing A love Story, Main Lead beating 10 People at Once. I accept the acting By Salman Khan was not That great. Sir Om Puri's acting was Great as Usual. But hey, At least this movie is the beginning of new Bollywood Era.",
            "review_date": "2017-06-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zero watt tubelight",
            "content": "Director tried to make a 9 but failed miserably to make a 6 either.Gave 2 stars. 1 star for the Chinese actor and 1 for cameo of SRK.",
            "review_date": "2020-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't understand that y r there so many negative reviews",
            "content": "I don't understand y there are so many negative reviews if u r a shahrukh khan fan and Salman Khan fan u should go watch the movies its about a brother trying to bring back his brother who went to war during the war between India and China and tries to bring him back him home safely. It's a very emotional,cute,and a little comedy movie if u don't like emotional movies I would still recommend u to watch the movie.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sallu played himself but...",
            "content": "His real persona is even dumber than reel. All puncture waalas have made his movies earn the way they do.",
            "review_date": "2021-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why it works, and Why it doesn't.",
            "content": "The Story has been credited to be based on The Little Boy and adapted to Hindi by Kabir Khan and Parvez Shaika with the help of Manurishi in the dialogues department. For me the story is about an over-grown man- child Laxman Singh Bisht's tussle with his low self-esteem and lack of confidence. Well, that's like Forrest Gump who is going through an identity crisis, and instead of people saying 'Run Forrest Run\u0085', this one has 'Jal Ja.. Jal ja\u0085tubelight\u0085 jal ja\u0085'After the first act, the film starts echoing with the whole theme of Yakeen ki taqat (Faith can move mountains) which instead of inspiring, might end up depressing the viewer by the end of the film. However, the picturesque location and amazing cinematography and background score will keep you glued to the seat. This is the whole issue about the movie. While writing Tubelight Movie Review, I am really not going to give away what is in it, because if you leave out the Chinese family, the film will still be alive, because they are just there. The film falls flat in the second act, and the rest of the thing is just predictable.",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The most underrated film of Salman Khan and of 2017",
            "content": "I don't know why people have given such negative reviews for this film. Most of the people saying this movie is a flop haven't even seen the film ( I was one of them until now). This film is Salman Khan's one of the finest works. Trust me you need to see this movie and then decide for yourself if you haven't yet. Believe me you won't regret it. This movie will make you laugh but it'll definitely make you cry as well (If you're a human and have emotions). Watch this if you haven't. I made an IMDB account just to write a review after seeing so less rating about it. It's not the BEST MOVIE EVER. But it also doesn't deserve such low ratings. If you're still reading my review you know you need to watch this movie",
            "review_date": "2020-11-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is the movie with full emotions... Loved it",
            "content": "How people hate this movie??? I know why... The reason behind is All body want hot and kissing scene that not happened on movie... This is a best movie of salman i ever seen... this movie is based on madness of love for his younger brother and really very emotional movie... this movie shows you how important is you when you are not with our family... Really this movie will make your cry... if you don't have emotions don't go for it... Thank you",
            "review_date": "2017-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"An awful movie, Its Bajrangi Bhaijaan all over again with a Chinese kid\"",
            "content": "Summary (no spoilers) The movie is about a man named Laxman, who is autistic goes on a journey to find his younger brother Bharat, who goes missing during the Indo-China war in 1962.My Review (no spoilers)The plot of this movie was really bad. It looked like a bad rip-off Bajrangi Bhaijaan. Extremely bad script and some awful directing by Kabir Khan. Salman has a lot to do to improve his acting skills as I felt it was overacting in this whole movie and none of the rest caught my attention. All the songs in this movie were senseless. I felt this movie was struggling with the ending as the director did not know if he had to end it on a good or bad note. Overall a really bad movie, a complete waste of time.My RecommendationNo, it will be precious two hours and sixteen minutes of your life which you will regret wasting on this.My Rating0/10",
            "review_date": "2017-11-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Salman should retire now. Era is over",
            "content": "Worst acting, worst direction, everything useless.. Era of Salman is over, he should retire now.. Still there are other actors who inspite of there age are doing great work, but Salman on oppposite is doing just worst..I am not going to watch any further Salman movies period. He should take a voluntary retirement now and quit the movies part.Disappointing audience every time with crap work.",
            "review_date": "2017-06-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bakwas . Disaster",
            "content": "Never ever watch any salman movie from now . Ek hi type ki movie . Salman you deserve 0 star.",
            "review_date": "2021-05-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Salman Acting saving grace",
            "content": "Picture is different as compared to SK other films. Acting and Songs are very good",
            "review_date": "2020-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Salman Khan's(Laxman's) younger brother,Bharat goes to war.Laxman wants to bring him back using his \"Yakeen\" (hope) despite all odds.",
            "content": "It's such a disappointment when a movie which could have been really good, turns out to be something this terrible !!! Began well, certain scenes were really enjoyable, the sibling fun, Om Puri's phenomenal performance yet again and obviously SRK's guest appearance(just loved his look).... But that's quite it..Apart from some fun & frolic, the movie turned out to be a disaster !! Salman has tried his best to pull off this one, but the role just doesn't belong to him... The war scenes were just about okay.Could connect emotionally to a very few scenes & the climax, well, it was just a saga of hoping when the movie ends !! Phew !! Terribly slow, almost torturous at times,Kabir Khan also didn't know what to do with this one... It isn't this simple to evoke sentiments, he needs to understand this.He had the opportunity with this one, but made a mess out of it..There were moments which could have been beautifully portrayed and so much could have been done but only God knows what the director had in mind, if at all he had something... AVOID IT !! Just a REALLY, REALLY BAD movie !!!",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Its not good, but you cannot call it bad",
            "content": "Tubelight is one of the biggest disappointments of 2017. The positive aspect of this movie is Salman Khan, and the negative aspect too is Salman Khan. Positive because Tubelight was able to rake some moolah only because of him, and negative because he is unbearable on the screen this time. No doubt he tries hard, but its not his genre and we as audience know what he is capable of. There are only a few actors who prove us wrong and take us by surprise with their acts. Unfortunately Salman Khan is not one of them. However, Kabir Khan did take us by surprise because we expected some top kind of film from him, but he disappointed us. I do not know why was Zhu Zhu casted here and what impact did she make? Useless! The characters are poorly written just to copy the little boy plot with minor changes, but that doesn't surprise at all.",
            "review_date": "2017-07-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Shut it off",
            "content": "Stop playing with Money and time of Viewers.\nThis movie is a complete scrap",
            "review_date": "2020-07-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just......don't even try!!!",
            "content": "Not worth watching or to even waste your time on this garbage....",
            "review_date": "2020-07-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tubelight : 0 Watt",
            "content": "It is a period film draws back the time of 1962, the time of Sino- Indian war. Its a story of two brother and one among them is Laxman Singh Bisht(Salman Khan), a slow-witted person, who grows up under the protection of his lovable and caring younger brother Bharat Singh Bisht (Sohail Khan) in a small town Jagatpur in Kumaon. While others always tease Laxman and bully him and call him Tubelight while Bharat shuts them up and protect his brother always and call him Captain. When Indo-China war broke out, Bharat and other youngsters from the town join the Indian Army and go to the front for battle. Laxman also tries to join Army but fails the physical test and as such stays back home. Due to Bharat's joining Indian Army, Laxman is left all alone, and its very difficult for him to sustain as he is very innocent and not able to protect himself. An Indian woman of Chinese origin Lee Ling (Zhu Zhu) comes from Calcutta to stay in the same town with her little son Guwo (Matin Ray Tangu). While being Chinese, Laxman hates them at first, but he is forced to follow the Gandhian principle of befriending enemy by Banne Chacha (Om Puri). Accordingly, Lee and Guwo turn Laxman's only friends in a place where all others were mostly teasing or unkind in their approach towards him. Laxman kept inquiring from the army chief posted in their city about the where about and well being of Bharat to which he doesn't get the suitable reply. Banne Chacha tells him that faith can even move mountains, which Laxman being innocent, takes seriously and tries to do that. Moreover, Laxman also kept believing that his brother, who has been captured by Chinese Army, will return from the battle front and declares that he will get Bharat back with his 'YAKEEN'. ANALYSIS: The concept of the movie is good in today's time when every now and then there is a demand for nationality certificate by one way or other but with minor changes in Little Boy, Tubelight doen't inspires us and script looks weak and doesn't look like a movie type. I didn't get what filmmaker want to prove when Laxman tried to move the mountain with his faith, doesn't it sounds stupid in real life. I mean there are countless ways to teach the power of faith. Moreover, there is now comparison between Kabir Khan's Bajrangi Bhaijaan & this one. There many unnecessary characters in the movie. The movie also fails to make an emotional connect with audiences unlike Bajrangi Bhaijaan. Some scenes are hilarious such as Laxman's calling Guwoo and Goo through the film, or his apologizing to the temple priest, his schoolmaster and an elderly woman for his mischieves committed in childhood. But overall Salman fails to enact or sometimes overact innocent Laxman. Movie also seems stretched specially in the second half and also climax is predictable. Salman's act in the last scene to bring Bharat to sense, reminded me of Kamal Haasan's act in Sadma to make Sridevi recognize him. One more thing is indigestible that how such bulky one like Bharat (Sohail Khan) is able to join army, he must have done some hard work to curtail his belly to perform this role. Music is also not that good and some songs were unnecessary in the film. WHAT'S GOOD: Some songs, Salman's act in the last scene, beautiful camera-work and Shahrukh's cameo. NOT GOOD: Weak script, mixed performances, predictable climax and lack of emotional connect. STAR PERFORMANCES: This one is not the best performance of Salman Khan. Good chemistry with his buddy Sohail and the last scene of the movie is also beautifully performed. Sohail Khan has a very average performance with literally no expression. Chinese actress Zhu Zhu and child actor Matin Ray Tangu played their part with perfection as much as role they have. Late Om Puri also delivers a good performance. FINAL WORDS: Unlike its name Tubelight flickers but fails to shine and as such, fails to make an impact. MAJA NAHI AAYAA YAAR..... My ratings for this movie is 1 out of 5 stars.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Slow, Boring, and Disappointing",
            "content": "Eid feels incomplete without a Salman Khan movie. Over the last few years he has ruled the box office and fans' hearts with his larger than life persona. He reunites once again with Kabir Khan after Ek Tha Tiger and Bajrangi Bhaijaan. Naturally, the expectations from the duo were massive. The result, however, is a film that never quite takes off. For me this was the biggest disappointment of the year so far because I expect a lot from my Eid releases and they almost always deliver. Tubelight will stand as the exception. I hope.Tubelight is a tale of two brothers caught in the Indo-China war in 1962. Laxman, played by Salman Khan, is an innocent man whose mind never fully develops in the traditional sense. This has caused him a lot of sorrow growing up but his spirit is still intact. His partner on this journey is his always supportive younger brother Bharat (Sohail Khan). When Bharat joins the army and is considered MIA, Laxman's belief in the power of hope and faith is put to the ultimate test. Based on the movie 'The Little Boy' this is an interesting story that tries hard to make you care but the film's slow as molasses pace bores you more than it moves you.The fault in this production is entirely the writers. The movie runs for over 2 hours but there are only a handful of memorable moments. The bond between the brothers is sweet and a few of the schemes that Laxman comes up with to bring his brother back are entertaining but everything in the middle is painfully dull. Kabir Khan as writer and director disappointed me more than I thought possible. I sighed often and wished the man behind Bajrangi Bhaijaan would come back. What happened, Mr. Khan? Why the complacency?Another thing that didn't completely work for me was Salman Khan's portrayal of Laxman. Naive and childlike isn't his forte and that's quite apparent here. Fierce, humane, and even innocent are characteristics he can easily embody but there are clear limits. Mind you, there are a few scenes he handles marvelously but overall the impact was missing. Sohail Khan is surprisingly genuine and the much talked about debut by Chinese actress Zhu Zhu is decent. The brightest sparkle in the sea of actors is the late Om Puri who wonderfully portrays the brothers' makeshift uncle and town elder. Farewell Mr. Puri, Indian cinema will miss you.The film's locales are gorgeous and the mounting is impressive but the lame script spoils the mood. Throwing a cute kid into the mix doesn't make up for a weak screenplay. Tubelight is the kind of movie that shoves emotions down your throat and forces you to care. This does cause your eyes to get wet but you gain very little satisfaction from the experience. I was left bored and annoyed. Don't test your viewer's patience, Mr. Khan. We know you're capable of much better things. And that goes for you too, Mr. Khan.https://stuffiwatchblog.wordpress.com/2017/06/26/tubelight/",
            "review_date": "2017-06-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "literally torture",
            "content": "My friends made me watch this two hours piece of crap. I haven't watch any Salman's movie since wanted. This made me proud because i save around 5k from this. So, it was a remake of Little Boy. Little boy is around 1 hour and 45 minutes of excellent work. And then remake is of around 2hour 15 minutes piece of crap. I still don't understand why Indian cinema is obsessed with all the dancing. This was like 10-15 years ago, now grow up. Well it's all up to producers to select the script but tubelight is produced by Salman khan himself. So we can not expect any intelligence from him. Acting- lets be honest, Salman khan cant act, neither sohail khan, and third brother too. Some critics are saying that this movie shows how worst salman can act, then i must say that these guys haven't seen mr khans movies at all. This was last movie of late om puri, he is decent as always. Direction- according to previous work of kabir khan you cant expect any thing new from him. And this movie is example of that. He is always been average. Music- its typical salman khan kabir khan music, so just avoid. Afterall i really feel like IMDb should introduce minus number in rating column.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Movie",
            "content": "It's a great movie, but you think it's over. But the unfinished. Good Movie.",
            "review_date": "2019-01-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tubelight Failed to light",
            "content": "The movie is based 'Little Boy' And it fails miserably to stand out ,me and my brother decide to give it this movie , in just half and hour we know that we made an horrible mistake as salman actually try to act for kabir khan, in whole movie salman plays and character of an mentally disabled 50+ year old try to be in 25 , salman acts like retarded and try to move things by hand movemnt and eventually create an earthquake by doing bad diarrhea face makes you cringe , the movie is so slow and cringe worthy it even makes crying scene laughing one .. so my friends even if you decide to give this movie a try ..well ., all the best .!",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zero star Rating",
            "content": "Please stop making such movies.Won't review this movie. This is utterly disgusting and terribly awful.",
            "review_date": "2021-05-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tubelight - A Huge Disaster after Sultan.",
            "content": "1. SUMMARY: Laxman Singh Bisht (Salman Khan) a good-hearted person, keeps faith in himself that his brother Bharat Singh Bisht (Sohail Khan) will return alive from the 1962 Sino-Indian war. Will Laxman's faith bring his brother back alive?2. STORY, SCREENPLAY AND DIALOGUES: Story and Screenplay penned by Kabir and Khan and co-written by Parveez Shaika is pathetic. The audience fails to digest such a script, however the dialogues in the this film are good.3. PERFORMANCES: Salman Khan's performance is worth a watch. The rest of the cast has also done a good job.4. DIRECTION AND OTHER TECHNICAL ASPECTS: After a few huge hits Kabir Khan has directed a torture due to the films weak narrative style. Songs by Pritam are good whereas Background Score by Julius Packiam wasn't as good as the songs. Cinematography by Aseem Mishra and Editing by Rameshwar S. Bhagat had to be improvised.5. BOX OFFICE VERDICT: Made on a budget of 100 crore this film can gross around 130-150 crore nett at the box office due to it's negative WOM. Overall Kabir Khan could make a Blockbuster but has ended up making just a Hit, that too only because of Salman Khan's star power, i.e. the film will gross above 100 crore only because of Salman Khan's star power.6. RATING: Beacuase of the film's horrible script I'll give it 0.5/4.",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad movie",
            "content": "Not able to watch this movie such a bad direction screenplay and acting..",
            "review_date": "2020-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bollywood Garbage",
            "content": "One line review-Even makers don't wanna watch this movie.",
            "review_date": "2018-07-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "excellent movie",
            "content": "the movie is fantastic, the story is different and very touching.most of stories are about love relationship but this is about brothers relationship very well written. i couldn't stop my tears for sad situations or even happy situations. salman khan did the role very good. also the songs and the music is very interesting.",
            "review_date": "2017-11-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful Movie - No Logic- Awful Acting - Money Waste",
            "content": "Please guys save your money. This is an awful movie with no story line and Salman Khan's acting is at its worst . This guy has put in no efforts in creating a realistic life like breathable character. Looks like a nursery kid is acting. I hope he knows this himself that he has done an awful work as an actor. His old work was good. But this movie-unbelievable. When you have such a Top actor your expectations are high. Well with Salman you lower it down now than sea level. This movie shows a downfall of Salman as an actor. Apart from this, the movie has no good story line. It has a good idea but story wise poorly plotted. There are no logics. Put your brain out in the tiffin box and then watch this movie coz its far far away from calling a realistic movie. Personally, after watching this movie i am 200.9473% sure,\"I don't think this Salman dude can act at all. Please ban him from acting.\" This movie is going to disappoint so many people. I swear.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "GOAT",
            "content": "GREATEST MOVIE OF ALL TIME, ANYONE DISAGREES I'LL CHIN THEM.\nSALLU BHAI ROCKS GREATEST ACTOR OF ALL TIME. DE NIRO SUCKS SALLU BALLS.",
            "review_date": "2019-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Story is so weak",
            "content": "Story of this movi is so weak and fill what happening in film we can't understand but acting of Salman Khan is very good . He is played mentally challenged man .and really his acting is good but some scene I thought he is doing overed but overall Salman acting is good..and it is not like other Salman Khan film . Salman is trying to experiment in his films but story is bad ....",
            "review_date": "2020-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Average story",
            "content": "Didn't like the plot and the way story turns out...but yes SK have done great job.",
            "review_date": "2021-06-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Solid movie; don't understand the hate",
            "content": "I honestly don't understand the hate on this movie. It's obviously not perfect, but this cannot be rated lower than the horrid mess called Prem Ratan Dhan Payo.People calling it the worst movie ever are, in my humble opinion, massively overreacting. The story, albeit a bit stretched, is quite an emotional one. All performances are pretty good, except Salman Khan's one, who is sometimes exceptional, sometimes ridiculously bad. Music is fine, it matches the movie well and only appears at key moments. My point is, it's far from a perfect movie; it's a good movie nonetheless. I'm honestly shocked this is rated so low, and even more flabbergasted that the borefest of a movie Prem Ratan Dhan Payo is rated higher. Overrall, somewhere between 6.5 and 7.5; it's a lesser version of Bajrangi Bhaijaan (which they struck gold with). It's worth your time and money.",
            "review_date": "2017-06-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "crap movie",
            "content": "This movie is an example of what happens if you cast wrong actor for wrong role.I watched little boy like 2 year ago and liked it very much.when I heard that tubelight is a remake of little boy I thought what this desi version has extra compared to original.but alas there is nothing new and the most irritating factor of this movie is salman itself.instead of casting him if director had cast good actor the movie would have been watchable.seeing salman act as a dimwit is one of the worst part of this movie.the emotion scenes,comedy scenes are overdone by him.while watching emotion scene it doesnot touch our heart and comedy totally useless. the director and salman were trying to cash success of their previous 2 hits with this crap but they failed miserably.because of salmmn star power this movie may get in 100 crore club but distributor will have heavy loss and will think about investing in salman's future projects.thumbs down to tubelight for such a crap screenplay,acting and direction.my vote is 1 because there is no 0 vote option in IMDb.",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "For me Tubelight is Salman's best film & one of the finest Bollyw film I've ever seen",
            "content": "For me Tubelight is Salman's best film & one of the finest Bollyw film I've ever seen. The film is jst a masterpiece, brilllliant story, good music & fabulous performance by Salman who played his difficult role of a mentally weak man beautifulllllly. The 1st time I watched this I was thinking abt it for 2 days, I watched it 2 more times and all 3 times I had my eyes all wet watching it. Such a heart touching mov, full of emotions & compassion fr one bro to another who is a special pers. I feel so sorry that movies lk Tubelight nvr work in India and the fact that the audience (haters) r reviewing this as such a bad film. I advise those who r going to see this to keep those tissues handy.",
            "review_date": "2021-04-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ghaaslet.",
            "content": "Sullied the name of tubelight. This does not dispel darkness. It glowss in ignorance",
            "review_date": "2020-05-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie",
            "content": "I watched this movie.It is not superb but good.Acting is average.If you watch this movie,I am sure you all love this.But our expectation was too high for salman and kabir khan.They fail to fulfill our expectation.If you don't expect too much then you can go and watch this movie.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Believe",
            "content": "The movie starred Salman Khan and his younger brother Sohail Salim Abdul Rashid Khan. In movie, they were also shown as brothers, Salman being the elder brother while Sohail Khan being the younger brother. The movie showed how strong brotherly love could be and how intense it is. The second thing that movie showed was 1962 Sino-Indian War. Diverse actors like Zhu Zhu and Matin Rey Tangu were also starred. And Om Puri once again won my heart. Om Puri, Amrish Puri and Javed Sheikh-you cannot underestimate them at all. They are the best. Salman Khan's acting seemed bit off though. There were amazing songs by Atif Aslam , Rahat Fateh Ali Khan, British singer Kamaal Khan and Javed Ali in the movie that made the movie more zesty. The moral was about Believe. Believing has the ability to change the fate and the world. And inner strength to endure such courage could give you loads of miracles in life. Shahrukh Khan was also featured in one scene, who was shown as a magician, who initiated the asset of believing in yourself to Laxman(Salman Khan). Salman Khan as Laxman is an innocent character and boneheaded while his younger brother Bharat is brave and intelligent. Gandhi's school of thoughts are also presented in the movie, and how he has shown peace and kept intact with the principle of Satyagraha. The character of Gandhi was also shown in mini scenes along with that Om Puri's character was shown to firmly believe in Gandhism and he was the one who taught this to Laxman.",
            "review_date": "2023-02-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Straight movie",
            "content": "This Film will be the biggest flop if Salman Khan is not part of this. Its better to stay at home and eat pizza instead of watch this movie on cinema.With out any suspense, climax even nothing to watch in it. Salman Khan did nothing to save his brother except trust (Yaqeen). Yaqeen word uses too many times which creates headache and Im sure after watching this you will hate this word yaqeen.",
            "review_date": "2017-06-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I want my money back",
            "content": "Salman Khan is a very bad actor in entire Bollywood industry",
            "review_date": "2018-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tubelight again the best of all time by Salman khan",
            "content": "Excellent movie...again the brilliant performance by Salman Khan. This movie is very emotional and its very different from all other movies...Wonderful and best movie of all time... I am a Salman fan and whosoever don't like it,don't blame the movie and say rubbish...after all he is an actor and if you all have any problem then please don't watch his movies for the one who is not fan of Salman khan",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Poor acting and story completely ripped off from \"The Little Boy\"",
            "content": "Pathetic attempt by Sallu to shamelessly copy from the English movie \"Little Boy (2015)\". Even stole the scenes, setup and direction too. What a shame. Lately Bollywood was doing great with new unique original stories and then comes this Tubelight. I guess Sallu needs to turnoff his TubeLight and retire now while he is ahead in the game!",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Obnoxious movie",
            "content": "This movie is one of the pathetic movie I have ever watched. Users who have had given it 8-10/10 star seems to blind follower of Salman Khan, just because of his stardom. Few pointers:\n1. It is an absurd attempt to create Little Boy Hollywood movie. Salman should have made a way for child artist to recreate such creativity rather than acting like a 8 year old guy. \n2. Salman's attempt to incarnate Hritik Roshan in Koi Mil Gaya has miserably failed.\n3. The only positive thing is serene locations, which also seemed to be created by computer graphics.",
            "review_date": "2018-03-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing movie. I dunno why so much negative comment.",
            "content": "This movie is just amazing like other movies of the lead male actor. I just got shocked why so many negative reviews are lying here. Some movies are so outstanding that not everyone can get up to that class. If you wanna feel some real emotions, you must give it a try. Trust me, you won't get disappointed.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tubelight has beaten Dangal",
            "content": "This movie is really good, the concept of using your belief to move mountains was inspiring people to believe more. Although the movie was great it was not Bajrangi Bhaijaan great. The movie essentially is made for all families which is the main reason why the whole movie got a UAE certificate.The Actors: -Salman Khan: Did a very good way of acting as a disabled person 10/10-Sohail Khan: He really did good but not enough where he still has bumps 9.5/10-Zhu Zhu: no words needed 10/10-Martin Tangu: I love the bond with Salman and Martin, but martin can be too excited 9/10Story: an adaptation from the Hollywood movie \"Little Boy\" (2015) I know people that watched that film will hate this film because it was \"Copied\", FYI it is completely different from that movie, but the concept is the same. 9/10Songs: Tinka Tinka Dil Mera, has brought me to tears. 10/10",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tubelight's Role is not Perfect for Salman Khan's Personality",
            "content": "Hi friends,I am fan of Salman Khan but the role in movie is not suited on Salman Khan's personality.I love the concept of Tubelight. Instead of Eid it should be released on 15th Aug. Kabhir khan's direction best as ever. Music is entertaining.",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is worst film of Salman Khan in recent time - Grade F",
            "content": "I expected a lot from Salman-Kabir but they didn't live up to it. First, it is a remake of a little boy in all words, common do some original stuff be inspired don't just make it same. Salman is missed cast here as a Tubelight role he is aged and bulky didn't convince me that he is late. It all looks so fake here. The plot is so weak too, I watched a little boy and that little boy is truly a little boy which makes sense that he is very close to father and wants him back as a child perspective a realistic stuff, which here is not even near to your imagination.I think a fool also cannot enjoy this film. Salman is lucky enough to get good work but this script is so bad that I can say it now Salman is not a cinematic/understand good cinema/understand the story at all. I like him as a human being but here he lost me from now on I will never book a ticket without reading other reviews.Kabir's screenplay same based on a little boy which was far better this, other actors were okay no extraordinary work. I miss om puri but this movie is such a waste Bajrang one was far better than this. The cinematography is Okay but your character and story need to speak something and at least make a sense as a visual medium. But in the final nothing works.I wasted my time and money to this pathetic and a bad film. Please skip it even if you are Salman Khan Fan.",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "blockbuster movie with blockbuster acting by Salman khan..masterpiece",
            "content": "Tubelight is the film that is rarely made in Bollywood so without any delaying go and watch the movie.Its a Salman carrier best performance you will fall in love with Salman.One word MASTERPIECE and blockbuster written all over it.What a direction Kabir Khan nailed it superb job.Sohail Khan is at his best what a performance.Last but not the least all character have done their beat a must watch film all i can say.BLOCKBUSTER.",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wasted my money",
            "content": "This is one of the worst movie of Salman Khan. He is one of the best actor in industry but the role given to him, didn't match his personality. I mean the way we want to see Salman in movies.First part of movie is good and then it start on going avg track of boring content with zero meaning according to me. You need to watch this movie so you can add it your worst list. I wasted my money now its your turn.Movie story is good but actors used for characters just didn't fit in. Its weird.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Boaring",
            "content": "Kya boring movie gw. Sushant Singh Rajput fans only.",
            "review_date": "2021-05-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Salman please do action movies",
            "content": "I think salman tried to copy dharam ji in ghazab and hrithik roshan of koi mil gya but failed miserably ....his crying moments made us laugh...some scenes are just he cannot act ...but he should continue doing action movies...he suits better in shirtless fights and poor storyline but audience love salman only for that started 10 years back shirtless ritual...and doing fun like HAHK",
            "review_date": "2018-03-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good Plot but Poor Direction/Execution",
            "content": "The movie has a good, and emotional plot, but the direction could not lift this movie up to the expectation. From the acting point of view, Sohail performed well than Salman. The background location was good, but not exploited fully from viewer's point of view. Also, one thing which I suggest that Salman must not have used his own voice as story narrator. If it would have been another voice, there might have been a weight in the movie. Further, the pace of movie varied at various places. The director gave undue advantage to certain scenes whereas important scenes (such as battle, struggle etc.) were cut short.Overall the plot was good, but due to poor direction and average performance, the movie could not be made up to the point.",
            "review_date": "2017-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good massage with Tubelight",
            "content": "If you are going for typical salman khan's movie then you will disappointed. This movie is not for typical salman khan's fans.I will not tell you the story but the scenes the performance of salman and the co-stars are really very good. Go and watch it has nice massage for people.",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not A Great Movie From Salman Khan and Kabir Khan",
            "content": "Director Initially tried to give justification to the title of the movie \"Tubelight\" but it couldn't help him to make a great story. Tubelight mainly lacks of script, it's like a body without a soul.The Movie doesn't have any great dialogues and screenplay. Background Score of the movie is good, but it had been covered up the screenplay, so BGM doesn't make any sense.War Scenes have created a Curiosity but didn't help the audience stick back to their seats. Music is Average.Salman tries to give his best, but couldn't create the magic like Bhajrangi Bhaijan. Mukesh Chabra have also been failed in casting the right people for the movie. Characters of Om Puri, Mohammed Zeeshan Ayyub are not up to the mark. Zhu Zhu tried to do her best but yet failed to impress the audience. SRK Cameo also wouldn't the movie.Not but not the least Martin Rey's performance was the only thing which held the movie.Positives:- War Scenes, Martin Rey Tangu Performance.Negatives:- Story, Screenplay, Dialouges, CGI Work",
            "review_date": "2017-06-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Total Time Waste",
            "content": "this movie is such a shame for Bollywood and especially for Salman khan because its a 90% copy of the great Hollywood film \"Little Boy\" released in 2015. The whole idea is copied in a drastic way, although i watched tube light complete but watching this film was the time waste. i suggest readers to watch Hollywood's Little Boy which will surely bring tears in your eyes as it did for me if you have soft heart",
            "review_date": "2017-09-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wow ! Must watch movie ....",
            "content": "Wow wow wow !! Just outstanding movie of salman khan...this is salman & Kabir class...after a long time I have seen awesome movie of Bollywood ..thnx to salman for his great acting ...all the character are good but salman khan is just outstanding ..trust me I am not a fan of salman khan but this movie cried me a lot ..it is really very heart touching movie ...I am going second time at night show ... I can say that tube light is must watch movie ..go with family and trust u will enjoy the movie ...I give 10 out off 10",
            "review_date": "2017-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Loved that real life acting. Go watch and enjoy your very own emotions balanced and maintained and owned by a single film!!",
            "content": "Don't you know to make a film is to be carried out by every people in there. To be honest every responsibility I think was carried out by Salman. Later on whole story was well written superbly executed and directed, songs were awesome - all of man's emotion, captured in a single film is worth an Oscar which means it's not a joke at all now! Go watch and enjoy your emotions that are also well balanced and maintained throughout the film.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wastage of time and money",
            "content": "Complete waste of time And Money.Pathetic movie. Would suggest the actor to concentrate more on selling Being human Vests, briefs than acting and spoiling is fame. Purchased Gold class ticket. Instead of that I should have gave the money to beggars. They would have felt so happy. Feeling very guilty watching Tubelight movie.",
            "review_date": "2017-06-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "#MAKAUT #Mar_Activity",
            "content": "I have been a child book reader , so the movie was a perfectly fit for my taste.The movie is a little too cheesy and for some time frame bores.But overall bollywood need such creative shots..",
            "review_date": "2021-06-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Boring",
            "content": "Full of old cliches and gibberish twists. Movie could have got its short and sweet climax with satisfied ending but its heinous ending after all those turns made it worthless",
            "review_date": "2018-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wrost movie",
            "content": "What a dumb is this. This actor thinks public as a toy. Hatt kya movie h re ye.",
            "review_date": "2021-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst Movie Ever",
            "content": "When the Tubelight movie trailer get released, I find the trailer emotional and interesting but wait what did click on my mind? I have seen the scene where Salman Khan is trying to move the mountain. I then realize that the movie is a complete copy of \"Little Boy\" Bad trailer Bad remake movie. Without good story and screenplay movie is crap and same happened for tube light. Only with Star power movie won't run.please don't watch it",
            "review_date": "2017-10-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I can't give less then one star",
            "content": "This is what bollywood is loosing it's shine.. due to this kind of so called selmon. Just think 1000 times before watching his movie.",
            "review_date": "2021-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just like a Tubelight",
            "content": "A tubelight is a mediocre form of illumination, not as bad as a fire lantern and not as good as an LED.So too is this movie. Not deserving of the lowest scores nor the highest. Every actor in this movie is so well cast with the exception of one; Salman looks far too competent and strong to pull off playing a weak dimwit but he does try his hardest. A standout performance was given by Martin and Zhu; the two Chinese actors that almost had me convinced they could speak Hindi.Cinematography and soundtrack are excellent however the plot and pacing leaves a lot to be desired. The long runtime means it's best watched over two sittings rather than one.The subject matter covered in this film spans a bloody time in history between two nations that are still at each other's throats and tubelight illuminates a path forward for both countries; not with dazzling brightness but a glimmer of hope.",
            "review_date": "2021-02-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst movie acting worst direction worst",
            "content": "Worst movie & direction.movie not upto the mark.Worst movie acting worst direction worst\nWorst movie acting worst direction worst.",
            "review_date": "2021-09-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wrost movie of the year",
            "content": "Plzz don't waste your time on this do not watch this wrost movie of Salman Khan\nWrost. Wrost movie awards goes to this movie\nInvest your time in other movies time is money.",
            "review_date": "2022-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Salman Khan and Kabir Khan team tried so hard to create a emotional movie and somehow they succeeded, but...",
            "content": "Salman Khan and Kabir Khan team tried so hard to create a emotional movie and somehow they succeeded, but to be honest after 30 minutes I was really irritated by their emotional concept throughout the movie. I mean they had 2 hrs and 16 minutes and in this long duration they only shows us melodrama which appears really fake.Lets take a brief look on the movie:*Story/Plot - 1/10I really feel sad to give such low reviews for story but what to do if makers make a movie only with a concept. Honestly their is no story in this movie, it has a concept which includes long and boring melodrama scenes, some not so hilarious comedy, pointless characters and irritating dubbing of Chinese character played by \"Zhu Zhu\"(by the way she is beautiful).*Cast/Acting - 2/10I always admires his character in Bajrangi Bhaijaan,Tere Naam and Baghban but in this movie his acting is too much annoying! I can't deny the fact that he is the Superstar of Indian Movie Industry but when I was watching this movie I really asked to myself that what the hell he is doing in this industry! Anywayas we all expect Mohammed Zeeshan Ayyub, Yashpal Sharma and Om Puri played their role nicely and performance of Sohail Khan was also okay. And what can I say about Zhu Zhu and Matin Rey Tangu, I am still searching on google and Wikipedia about their role in this movie. Why they are in this movie is a mystery!*Direction/Cinematography - 3/10Cinematography is very good, the visuals and the smart work of camera will make you fall in love with the locations but in other hand weak direction makes it boring. Director stretched the movie with no point, no plot and just sucked my brain, time and money.*Music/Background Score - 5/10When we talk about a Bollywood movie then it become important to consider Music of the movie. Soundtrack of this movie are good and very soulful except two tracks \"Naach Meri Jaan\" and \"Radio\". But sill songs like \"Main agar\" and \"Tinka Tinka Dil Mera\" in the voice of Atif and Rahat Fateh Ali Khan are enough to make us happy. Background Score is Average, not something that can gain attention.***OVERALL REVIEW***[ 2.75/10 ]Have a nice day. :)",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste of time",
            "content": "Only thing to show for is the Mega Star Salman Khan. Even Salman Khan could not get an extra star out of me. What were the producer thinking. After a long time I have seen this real disappointment. Theme maybe good, but nothing supports it for being a movie. Save your time and money.",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One time watch",
            "content": "Though story is not that great but the performances are very clinical. Specially, Salman, Matin and Zeeshan are worth watching. Moreover, you will get to watch the legend Om Puri for the last time. Songs are very soothing and beauty of the nature has been captured as much as possible.",
            "review_date": "2017-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Boycott Bollywood",
            "content": "Please all boycott Bollywood and gang useless movies.",
            "review_date": "2021-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "#MAKAUT #Mar_Activity",
            "content": "I liked the movie because of its visuals. Set in picturesque locales, it looks beautiful. But, it's Salman Khan who let us down with his unbearable acting or else it would have been a better watch if other hero like SRK was on board.no storyline. So dissapointing. I went to movie hall and spend my money on this nonsense. Felt like claiming refund. I wonder these people put so much efforts. But why not have a proper storyline.",
            "review_date": "2021-06-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "flop same old bollywood melodrama predictable",
            "content": "well IMDb you must allow a 0 rating for this movie. utter shambolic and predictable storyline typical bollywood melodrama. both khans looking silly and bulky. yakeen word is used so many times wonder they could have titled it yakeen. movie pace is so slow that you can attend washroom and still the plot won't change. useless use of SRK. this movie tries to preach a boring message very same to the one done through jai ho. this happens when you copy a movie which has been panned by critics.",
            "review_date": "2017-06-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Boring emotional melodrama!",
            "content": "Salman's acting ain't good and so as Sohail (overacting) Martin Rey and Md. Zeeshan gave flavours to the climax.. 1 star for them! The duo, SRK n SALMAN, together took away 1 star for 7 mins.. A bit humorous and emotional but unnecessarily exaggerated the movie, which was quite boring. Dull acting, avg music and avg cinematography.. Copy of 'A Little Boy'.. Only watch if you're a die-hard Bhai Fan👊",
            "review_date": "2017-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "bad movie",
            "content": "1 of the worst movie .... total money waste ...... bad story lineup.... a bore film ... just have 1 thing for which peoples r watching it is SALMAN KHAN and no such special thing to see such movie... haven't expected such a movie from great star... suggest not to watch this :( if want to go .... just pretend to go for time pass and nothing else :P",
            "review_date": "2017-06-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst movie",
            "content": "Selmon bhoi.Salman Khan, Kabir Khan film gets its message right -- love conquers all -- but it is the messenger who fails. The effort of playing a slow-witted man shows on Salman in every frame. It is the supporting cast including Matin Rey Tangu, Om Puri who are the film's strength.A man child. Or a child-like man. Salman Khan has had long practice of playing one or the other kind of male, and has aced both. His latest alter ego takes the child-like aspect of man several notches higher. Salman's character Laxman Singh Bisht is called, disparagingly, 'tubelight'. Why? Simple. It flickers. It takes time to switch on. And then, and then only, there is light.",
            "review_date": "2022-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "It is good emotional movie kabir singh salman sir was good one time watch",
            "review_date": "2022-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very indeering and a movie well worth watching!!!",
            "review_date": "2021-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Got Mental Trauma after watching this Movie. Too much Vomiting.",
            "review_date": "2021-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst Movie Ever Black Day for Bollywood and salman khan fans",
            "review_date": "2019-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "People may judge this movie based on that one scene of earthquake which they saw in trailer. I have seen the full movie and it is definitely one of the best movies of Salman Khan.I seriously don't know why this movie is so much criticized.I loved this movie.",
            "review_date": "2019-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie's most glaring issue is that it plays it too safe. Instead of consistently focusing on the theme of belief and love, it would of been much more interesting and entertaining if they focused on character development, Uncle Bane did not have any guilt for basically pushing the army to Lakshman's brother, and the whole town felt like they were focused too much on Lakshman and his personal life, they also push the audience towards thinking that everyone besides the uncle, his assistant, the army major, and the Chinese family, are heartless (for constantly laughing and poking fun of Lakshman) and stupid (for considering the earthquake a miracle) . One thing that I thought was funny was the presence of the Chinese family (excluding the father) during the brother's reunion, and we can all associate their presence with the whole idea of using the child's reaction to enforce the emotional reaction from the audience, THEY were supposed to take Guo's grand father to the hospital in Calcutta due to his injuries. However they left him mid way when they picked up the major on their way to Calcutta. Overall an average movie that tries to play off of Salman's previous hit 'Bajrangi'. Hope India stops pushing the suspension of belief.",
            "review_date": "2017-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was emotional I started creI loved the movie the only downside to this movie was the set up looked cheap as I would have liked the setting to look more real but the story line and everything thing els was good",
            "review_date": "2017-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movie we Indians have. To learn a lot. \n\n\"Faith\" \n\nGreatest movie",
            "review_date": "2017-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Critics panned this just like they did to Little Boy. To the rest of us normal beings, this will definitely touch your heart if you allow it to.",
            "review_date": "2017-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a block buster movie.",
            "review_date": "2017-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest movie of our generation. Tubelight combines seemingly distant concepts of quantum mechanics, art, and philosophy with ease under the overarching message that love conquers all. A must see experience for people of all ages and nationalities. People are on the fence about this one because it's a game changer.",
            "review_date": "2017-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't listen to critics.   This is very good movie.   The follows the life's of two brothers.  One strong and perfect and the other brother has issues and faces lots of ridicule.   I laughed and cried.  The story shows so many things.   The horrors of war.   Separation.   Not knowing.  Bully's.   Culture conflicts. Survival, never giving up and belief.   Note,  the movie is not in English.  But, they did excellent job on English captions.   Movie is 2 hours and 40 minutes.  So, go prepared to watch excellent movie.   Go, as this is a really good movie that tugged at my heart.",
            "review_date": "2017-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie. Really emotional and a wonderfully relevant plot about tolerance and acceptance. The acting was iffy, but as the movie progressed it got better. I believe the negative reviews come from the lack of romance and \"item songs\", either that or people just don't agree with the over all message of the movie. My family and I loved it.",
            "review_date": "2017-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was so taken by this movie. Did not understand 1 word spoken but, subtitles were good. I loved loved loved it. I have never been so connected to a movie as I was this one. It was Great start to end. Music, dancing, humor and sadness..it was a complete story. Thank You",
            "review_date": "2017-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Tubelight' is disappointing as it rests on a poor plot and lacks the power to enthrall and mesmerize despite some likable camaraderie between the Khan brothers.",
            "review_date": "2017-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the movie may be a blatant copy of Hollywood''s 2015 movie Little Boy, the bollywood version does its best to keep the charm of the original film. It may not win reviews but it is a clean movie about brothers.  What was refreshing about this movie was the lack of a romantic story and the racism that lies in India. Racism towards other races living in India is not a common story told in bollywood. For its efforts, the movie is well paced, has a good cast and has moments that will make you laugh out loud.",
            "review_date": "2017-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible disconnected",
            "review_date": "2017-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredible emotional ride! Salman's best performance and for many his best film to date.\n\nMust watch for every cinema goer.",
            "review_date": "2017-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, Portrait better than Little Boy.",
            "review_date": "2017-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm one of the lucky few that have seen Tubelight one day before the rest of world as it has released in the UAE today. Ok, so how would I describe Tubelight...... I think this will probably one of Salman Khan's best performances of his career. Each character has performed very well especially the little kid. The film has been shot beautifully and the songs move the storyline forward which is rare these days. Both adults and kids will love the film as there is no vulgarity and there is both plot twists and light comedy moments. \n\nA proper family film worth ones money.",
            "review_date": "2017-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Well shot and well intentioned, Tubelight should have been a light in Salman Khan and director Kabir Khan's careers. However, the attempted tearjerker is contrived from start to finish. It also tries to manipulate every scene to make itsWell shot and well intentioned, Tubelight should have been a light in Salman Khan and director Kabir Khan's careers. However, the attempted tearjerker is contrived from start to finish. It also tries to manipulate every scene to make its audience cry, which in the end left me more exhausted than emotionally invested in the plot and characters.",
            "review_date": "2017-06-24",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "rt_rating": 4.7,
    "rt_summary": "A man remains unshakable in his beliefs and love for his family.",
    "meta_rating": 4.0,
    "meta_summary": "In a small picturesque town in North India, Laxman (Salman Khan) lives with his younger brother Bharat (Sohail Khan). The two have no other family and are inseparable. Laxman's world comes crashing down, when war breaks out and Bharat gets drafted into the Army. A helpless Bharat leaves a devastated Laxman behind. News from the border onlyIn a small picturesque town in North India, Laxman (Salman Khan) lives with his younger brother Bharat (Sohail Khan). The two have no other family and are inseparable. Laxman's world comes crashing down, when war breaks out and Bharat gets drafted into the Army. A helpless Bharat leaves a devastated Laxman behind. News from the border only worsens, as the tension continues to escalate. Seeing the carnage around him and worried for his brother, Laxman decides he must stop this conflict and get his brother back.… Expand",
    "vibes": [
        "common",
        "bold",
        "heroic",
        "bulky",
        "dead",
        "enthralling",
        "wise",
        "catchy",
        "exemplary",
        "fictional",
        "glad",
        "stark",
        "understandable",
        "mediocre",
        "alive",
        "sweet",
        "ashamed",
        "implausible",
        "responsible",
        "unimaginable",
        "useless",
        "brave",
        "diverse",
        "eld",
        "inner",
        "intelligent",
        "intense",
        "grand",
        "heartless",
        "mid",
        "childish",
        "consecutive",
        "melodramatic",
        "hopeful",
        "terrific",
        "unstable",
        "flat",
        "worth",
        "thin",
        "unconvincing",
        "wholesome",
        "brief",
        "pointless",
        "sill",
        "smart",
        "soulful",
        "convenient",
        "convoluted",
        "gullible",
        "raw",
        "unshakeable"
    ]
}