{
  "title": "The Lord of the Rings: The Return of the King",
  "rating": 8.9,
  "release_date": "2003-12-17",
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "summary": "Sauron's forces have laid siege to Minas Tirith, the capital of Gondor, in their efforts to eliminate the race of men.  The once-great kingdom, watched over by a fading steward, has never been in more desperate need of its king. But can Aragorn (Viggo Mortensen) answer the call of his heritage and become what he was born to be?  In no smallSauron's forces have laid siege to Minas Tirith, the capital of Gondor, in their efforts to eliminate the race of men.  The once-great kingdom, watched over by a fading steward, has never been in more desperate need of its king. But can Aragorn (Viggo Mortensen) answer the call of his heritage and become what he was born to be?  In no small measure, the fate of Middle-earth rests on his broad shoulders.  [New Line Cinema]… Expand",
  "critic_reviews": [
    "The conclusion of Peter Jackson's masterwork is passionate and literate, detailed and expansive, and it's conceived with a risk-taking flair for old-fashioned movie magic at its most precious.",
    "An epic success and a history-making production that finishes with a masterfully entertaining final installment.",
    "The second installment was better than the first, and this one is best of all. It has spectacular action scenes and imaginary creatures, and it’s by far the most moving chapter. The performances have deepened.",
    "The second half of the film elevates all the story elements to Beethovenian crescendo. Here is an epic with literature's depth and opera's splendor -- and one that could be achieved only in movies. What could be more terrific?",
    "Represents that filmmaking rarity -- a third part of a trilogy that is decisively the best of the lot. With epic conflict, staggering battles, striking landscapes and effects, and resolved character arcs all leading to a dramatic conclusion to more than nine hours of masterful storytelling.",
    "Those who have walked beside these heroes every step of the way on such a long journey deserve the emotional pay-off as well as the action peaks, and they will be genuinely touched as the final credits roll.",
    "Labeling this as a \"movie\" is almost an injustice. This is an experience of epic scope and grandeur, amazing emotional power, and relentless momentum.",
    "Jackson is rare among the makers of epic movies in that he knows how to do the small stuff, too. The Return of the King has “heart”--how else could it pump out all that blood?",
    "The most emotionally satisfying because, in addition to having both more intimate drama and more spectacular battles, it resolves all of the issues raised before.",
    "A majestic conclusion to a nine-plus-hours epic that stirs the heart, mind and soul as few films ever have.",
    "Like all great fantasies and epics, this one leaves you with the sense that its wonders are real, its dreams are palpable.",
    "As good as each individual movie is, the third film vaults the work into the stratosphere of classic movies. Key characters are enhanced, new civilizations visited and battles fought more intensely, while feelings and motivations are plumbed more deeply and movingly.",
    "As completely real on the psychological level as its up-to-the-moment visual effects have on the physical.",
    "It's been a long time since a commercially oriented film with the scale of \"King\" ended with such an enduring and heartbreaking coda.",
    "It might be the cinema's most astonishing holy war film. The Lord of the Rings took seven years and an army of gifted artists to execute, and the striving of its makers is in every splendid frame. It's more than a movie--it's a gift.",
    "Jackson had the vision, persistence, insight and patience for this mighty job, plus the smarts to shape stage veterans and overlooked film actors into a seamless cast. He's made himself as immortal as a movie director can be.",
    "Feels like a miracle, a movie that exceeds even the most formidable expectations without straying from its singular path. All hail this King.",
    "It rises, all on its own, to the realm of masterwork.",
    "A phantasmagorical slab of epic entertainment that satisfies on every conceivable level.",
    "From the acting to the special effects to the landscapes to the cinematography, editing and music, to the details of decor, wardrobe and armaments, we never once feel that we are in anything but the hands of an absolute master of the medium.",
    "First and foremost, it soars because its grand design and numerous story problems were worked out half a century ago by a guy named Tolkien, and Jackson was smart enough to realize this.",
    "This movie is not only a thrilling experience, it closes the book on a truly satisfying trilogy.",
    "This film is a miracle, an extravaganza equal to its predecessors and in some ways more stunning. It is a profound testament to the extraordinary power of moving images and sound.",
    "The deep satisfaction of The Return of the King is in surrendering ourselves to the finale, in letting Jackson's superb storytelling (with due credit to co-screenwriters Fran Walsh and Philippa Boyens) surround us like a blazing campfire tale -- which it does, gloriously.",
    "Ties everything together with a dazzling synthesis of pagan animism, heroic quest mythology, orientalism, Pre-Raphaelite imagery, 1950s sci-fi creature features, and Hollywood war epics.",
    "Then, finally, there are the endings, all six of them...For us outsiders, it seems like too much of a good thing...But all those are minor rants: The big fact is that The Return of the King puts you there at Waterloo, or Thermopylae or the Bulge, any desperate place where men ran low on blood and iron and ammo, but not on courage.",
    "All in all, it's a fitting conclusion to the series, and yet there are disappointments built in. For one, Jackson has opted not to film Tolkien's downbeat \"Scouring Of The Shire\" epilogue.",
    "I love Jackson's \"Rings\" saga despite his propensity for whimsical animation whenever he tries to strike a chord of dread or menace.",
    "Yet what I felt when the lights came up at the end of this visionary, titanic, relentless experience was something different: a strange relief that it was, at last, over.",
    "There is little enough psychological depth anywhere in the films, actually, and they exist mostly as surface, gesture, archetype and spectacle. They do that magnificently well, but one feels at the end that nothing actual and human has been at stake.",
    "This is a film in which ideas resonate as well as action. Gandalf’s words to Pippin about death have a muscular poetry.",
    "In short, this Krakatoa is at once exhausting and riveting. It's a technological marvel, and for those not with the program, a bit of a bore.",
    "It’s odd and unfortunate, however, that The Return of the King just barely misses the eye-misting emotional wallop of the series’ previous installment, The Two Towers, which had a lyrical subtlety underpinning the vast vistas of growing chaos (and Christopher Lee hardly hurt matters) and hobbits-in-peril.",
    "Though an estimable success overall, The Return of the King has several scenes too many and too great a concentration on battles.",
    "The Return of the King is too long...The various story lines...come together in stilted, episodic ways. The narrative is less-than-seamless.",
    "The [final] battle is vast, and undoubtedly required thousands of hours of matching puppetry, robotics and computer code, but it is not without tedium.",
    "Despite its length, the film only starts feeling as long at the end -- or, more correctly, ends. Serious fans of the novels will be prepared for the serial codicils, but the uninitiated are likely to think the film is over several times before it actually is.",
    "If The Return of the King was 2 1/2 hours long, it would have rocked. It would have been better than The Two Towers, which is the best film in the series.",
    "Add a lot of dull acting -- except Sir Ian McKellen and Andy Serkis -- and you have an uneven movie with yawns aplenty."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This is simply a masterpiece.\rYou will never see a trilogy like this one, essential for your cinematographic culture. The Return of the King is the prove that third parts can be much better than the first or second one.",
      "review_date": "2012-12-16"
    },
    {
      "review_title": null,
      "content": "It's a perfect epic. There's not one false step. The battles are incredible, the characters just as fun as ever. This movie is basically flawless. One of the best ever",
      "review_date": "2011-08-09"
    },
    {
      "review_title": null,
      "content": "This movie is supreme in every aspect: visualy, story-wise, directing and with an extraordinary soundtrack. My personal favorite ever since I saw it!",
      "review_date": "2008-09-26"
    },
    {
      "review_title": null,
      "content": "There's nothing that I can say in praise of this film that hasn't already been said. One of the best movies, of the best movie trilogy ever made. Stunning, stunning, and stunning.",
      "review_date": "2012-06-06"
    },
    {
      "review_title": null,
      "content": "the best trilogy ever created. Peter Jackson has done what most people thought was impossible, made 3 amazing movies. Lotr deserved all 17 of its Oscars and probably more. this will remain my top 3 movies ever!!",
      "review_date": "2012-07-21"
    },
    {
      "review_title": null,
      "content": "Quite possibly the most satisfying and epic conclusion to an already perfect trilogy, the Return of the King is a testament to both the genius of the filmmakers and the original author J.R.R. Tolkien. It blends seamlessly with the FellowshipQuite possibly the most satisfying and epic conclusion to an already perfect trilogy, the Return of the King is a testament to both the genius of the filmmakers and the original author J.R.R. Tolkien. It blends seamlessly with the Fellowship of the Ring and the Two Towers to create the journey and story that , and yet stands on its own as a masterpiece, a masterful piece of cinema that will endure till the end of days. Its visual grandeur, cinematographic excellence, musical dexterity, haunting narrative, and ultimate perfection coalesce to create a tale, unlimited in emotional richness, that will resonate through the ages. Every viewing of the film for me is a journey in and of itself, one that ultimately ends in tears (I hear Gandalf lamenting right now \"I will not say do not weep, for not all tears are an evil\"). I fondly recall the midnight premiere of film and how, when I looked around at the audience during the Grey Havens scene, there was not a dry eye in the house, including my father who has (forgive me for the clicheness ) the emotional range of a teaspoon. If that isn't evidence for the profound emotionality of the film, then I don't know what is. Little scenes throughout the film as well elicited such powerful reactions from the audience I couldn't help but feel even more emotion because of that. The Ride of the Rohirrim, Aragorn's speech, Gandalf and Pippin's moment during the Siege of Minas Tirith, and many other scenes throughout the film, whether they induced goosebumps or tears, created an energy in the theatre that was both palpable and moving. Once the text \"The End\" appeared on screen, there was a moment of silence, and then an uproar of applause and cheering. Once again, brought to tears. In any case, the Return of the King is and will ever be a Goliath among films, and I cannot imagine that a film will ever be made that will come to dwarf a film such as this.",
      "review_date": "2012-12-20"
    },
    {
      "review_title": null,
      "content": "Yes the epicness itself, the best movie i have ever seen, an amazing plot, battles, messages, effects, and a well rewarded 11 Oscars, 10/10 without any doubt. A masterpiece. The best of the trilogy also in my opinion, another amazing thingYes the epicness itself, the best movie i have ever seen, an amazing plot, battles, messages, effects, and a well rewarded 11 Oscars, 10/10 without any doubt. A masterpiece. The best of the trilogy also in my opinion, another amazing thing about it is of course the Wonderfull Awesome Soundtrack that perfectly fits with the storyline, Good work Peter Jackson, I hope the hobbit will be as good.",
      "review_date": "2012-07-29"
    },
    {
      "review_title": null,
      "content": "The Lord of the Rings trilogy is the greatest trilogy of films ever made, and this is one of the finest examples of brilliant filmmaking of all time.  Peter Jackson is an incredible visionary, the cast is great, it adapts the book very well,The Lord of the Rings trilogy is the greatest trilogy of films ever made, and this is one of the finest examples of brilliant filmmaking of all time.  Peter Jackson is an incredible visionary, the cast is great, it adapts the book very well, and it all adds up to one of the best films ever made.",
      "review_date": "2013-01-27"
    },
    {
      "review_title": null,
      "content": "I really enjoyed the epic and emotional complexity of the entire film.  While the ending may seem overly long (at over 3 hours, that is a bit excessive), but the film is brought to a conclusion that is magical and satisfying.  I enjoyed theI really enjoyed the epic and emotional complexity of the entire film.  While the ending may seem overly long (at over 3 hours, that is a bit excessive), but the film is brought to a conclusion that is magical and satisfying.  I enjoyed the action, the visuals, the script, the music and the acting.  This is a great fantasy film that will live on forever.",
      "review_date": "2013-07-14"
    },
    {
      "review_title": null,
      "content": "The trilogy has been building to this finale! and it does deliver! at over 3 hours ROTK never seems to make the audience loose interest. the action is better then ever, the characters are put in parell and when you watch this film you have toThe trilogy has been building to this finale! and it does deliver! at over 3 hours ROTK never seems to make the audience loose interest. the action is better then ever, the characters are put in parell and when you watch this film you have to go all the way through because it holds you down and wont let you  leave",
      "review_date": "2014-05-05"
    },
    {
      "review_title": null,
      "content": "This film clearly is the best triology made of our time and we are so lucky to have live this experience thoughout 2001-2002 and 2003 phenomenon, The Hobbit is coming soon!!!!! i have a feeling that this will be as good as this threeThis film clearly is the best triology made of our time and we are so lucky to have live this experience thoughout 2001-2002 and 2003 phenomenon, The Hobbit is coming soon!!!!! i have a feeling that this will be as good as this three brilliant masterpieces",
      "review_date": "2011-04-15"
    },
    {
      "review_title": null,
      "content": "Its the awesome final to a awesome trilogy and tops even its two predecessor. I lost myself in the film, when I was watching it. The best in the trilogy and one of the best films to be ever made.",
      "review_date": "2013-03-04"
    },
    {
      "review_title": null,
      "content": "The beginning is may seem a little fast, playing various information to the public, but the rest is perfect, and ends in a phenomenal trilogy Peter Jacson, besides revolutionize the industry of special effects, it proves that it has specialThe beginning is may seem a little fast, playing various information to the public, but the rest is perfect, and ends in a phenomenal trilogy Peter Jacson, besides revolutionize the industry of special effects, it proves that it has special effects like mixing first and an epic story in a single film.",
      "review_date": "2013-05-19"
    },
    {
      "review_title": null,
      "content": "Cormac P., heres what i want u to do, BURN IN HELL!!!!!!!!!!!! SO DON'T YOU ANDREW K!!!!!!!!! How can you how can you say that its nothing when everything about this movie is spectaculer. Even you, yes you Frieda L, you can suck my cupCormac P., heres what i want u to do, BURN IN HELL!!!!!!!!!!!! SO DON'T YOU ANDREW K!!!!!!!!! How can you how can you say that its nothing when everything about this movie is spectaculer. Even you, yes you Frieda L, you can suck my cup of tea. And everyone that disis it like Robert H, Leigh C, David R, Arleen, Dwayne R, Jawad S, Joe B, J R, Goliath, Harriet, Bob B, Sally L, Rebecca R, Fantasy, Jude T, Simon L, C B, Antonio A, John D, Joyce T, Rick S, Sweet angle, Brian K, Mike G, Jeffery G, Matt B, Eric M, Matt R, Maria T, Marcus B, Matt P, John S, Sam K, Joe C, i want you all to die and rott in hell!!!!!!!!!!!!!!!!!! You have no joy in this series so all of you all are full of s&^%t!!!!!!!!!!!!!! you all are the weakest link. goodbye. ",
      "review_date": "2004-01-20"
    },
    {
      "review_title": null,
      "content": "It's a movie with a lot of war i love it.",
      "review_date": "2006-01-04"
    },
    {
      "review_title": null,
      "content": "These films show film journalists and fans everywhere that fantasy films can be absolutely superb. And this film has been the perfect end to what has been an epic masterpiece and adventure.",
      "review_date": "2008-04-06"
    },
    {
      "review_title": null,
      "content": "The best movie ever made.",
      "review_date": "2004-06-18"
    },
    {
      "review_title": null,
      "content": "The greatest book in the world has rightfully become the greatest movie in the world. 10 out of 10 any day! Tolkien is by far my favorite author, and out of all the books turned into movies, this was the best. Howard Shore conducts aThe greatest book in the world has rightfully become the greatest movie in the world. 10 out of 10 any day! Tolkien is by far my favorite author, and out of all the books turned into movies, this was the best. Howard Shore conducts a legendary score second only to John Williams. Every aspect of this movie was as impeccable os the novel itself. If Tolkien were alive today... (sniff, sniff)",
      "review_date": "2011-05-07"
    },
    {
      "review_title": null,
      "content": "A masterpiece of the film the battle of Pellenor Fields when they introduced the Mumakils were absolutely breath-taking. I did felt however that Faramir should've given just a tad bit more screen time even a minute. But thats the most minorA masterpiece of the film the battle of Pellenor Fields when they introduced the Mumakils were absolutely breath-taking. I did felt however that Faramir should've given just a tad bit more screen time even a minute. But thats the most minor of the minor problems so I thought this film was EPIC! the ending was a drag though",
      "review_date": "2012-01-09"
    },
    {
      "review_title": null,
      "content": "An epic conclusion to one of the best movie trilogies of all time. Great characters, action scenes and a story that we cared for. The Lord of the Rings delivered to the hype and although its cheesy at times it makes up with it with its charm.An epic conclusion to one of the best movie trilogies of all time. Great characters, action scenes and a story that we cared for. The Lord of the Rings delivered to the hype and although its cheesy at times it makes up with it with its charm. Masterpiece.",
      "review_date": "2012-02-06"
    },
    {
      "review_title": null,
      "content": "With surprisingly better pace than its predecessor, The Return Of The King provides a graceful and majestic yet thrilling end to the trilogy that is Lord Of The Rings. I almost cried.",
      "review_date": "2012-12-15"
    },
    {
      "review_title": null,
      "content": "I had to rate this movie because is my all time favorite, I mean, with 12 oscars you can't go wrong, the feeling I get everytime I watch it is epicness, the music, the effects, the acting, everything is perfect and is a must see for anyI had to rate this movie because is my all time favorite, I mean, with 12 oscars you can't go wrong, the feeling I get everytime I watch it is epicness, the music, the effects, the acting, everything is perfect and is a must see for any medieval/fantasy fan. 100/100 Best movie ever",
      "review_date": "2011-12-12"
    },
    {
      "review_title": null,
      "content": "I am happy to see the awarness of the community. Reviews of those people who do not understand epicness and quality of this movie from some reason , are found unhelpfull. On the other hand almost everyone agrees with those who giveI am happy to see the awarness of the community. Reviews of those people who do not understand epicness and quality of this movie from some reason , are found unhelpfull. On the other hand almost everyone agrees with those who give compliments to this movie , peter jackson , and of course great tolkien. I watched whole trilogy many times and i can only say , that it is the greates trilogy ever. By my opinion all three of these movies are best there is in the movie world. If someone hasnt still watched it , chances are slim but , he should watch it right away , not just this one but whole tirlogy. Thank you community.",
      "review_date": "2012-01-20"
    },
    {
      "review_title": null,
      "content": "A fitting end to the greatest film trilogy ever created. Everything, from the acting, to the cinematography, to the special effects, to the score, is flawless. Return of the King retains Tolkien's ascending level of excitement and A fitting end to the greatest film trilogy ever created. Everything, from the acting, to the cinematography, to the special effects, to the score, is flawless. Return of the King retains Tolkien's ascending level of excitement and suspense. Yes, Jackson removed some scenes, but in the interest of time, it was worth it. Lord of the Rings is spectacular in every regard; LOTR is to our time what Star Wars was to the late 70s-80s....purely amazing filmmaking.",
      "review_date": "2005-11-07"
    },
    {
      "review_title": null,
      "content": "Flawless CGI really brings Tolkien's creatures to life in this film. Peter Jackson has done it again, he was made for adapting long books to long films. With King Kong the plot had to be stretched because Jackson obviously wanted anotherFlawless CGI really brings Tolkien's creatures to life in this film. Peter Jackson has done it again, he was made for adapting long books to long films. With King Kong the plot had to be stretched because Jackson obviously wanted another long film, like one of these LotR movies. But with Jackson working with Tolkien's books he couldn't have gone wrong. He filled the cinematic Middle Earth with almost everything Tolkien described, and followed Tolkien's sequence of events quite closely. At some points the film sores to give a feeling that you're watching a true legend unfold before your eyes, like the scene where the Witch King gets killed by Eowyn. Sir Ian McKellen is a terrific actor and some of the lines which actors say carry real wisdom in them. The musical score was absolutely beautiful, the best of any movie I've ever seen and probably ever will see. The plot was the most engaging and interesting ever, with fight-scenes all over the place to keep the less taken-in among us in our seats. Even the fight scenes have their own emotional beauty to them. And although the ending of the film was heavily criticized for being too long, I feel it was necessary as it was not a case of ending the film, but ending the film for each character in turn. The film deserves all the 10/10s it recieves, and is truly a masterpiece.",
      "review_date": "2006-04-01"
    },
    {
      "review_title": null,
      "content": "Perfect.",
      "review_date": "2004-02-02"
    },
    {
      "review_title": null,
      "content": "Awesome.",
      "review_date": "2004-03-02"
    },
    {
      "review_title": null,
      "content": "Best movie ever.",
      "review_date": "2004-06-19"
    },
    {
      "review_title": null,
      "content": "One of the greatest films of all time.",
      "review_date": "2005-12-05"
    },
    {
      "review_title": null,
      "content": "Peter Jackson is an absoloute marvel at filmaking, even the spectacular action scenes have their share of emotional beauty. The Return of the King is one of the greatest movies I have ever seen, surpassed by Jackson's King Kong.",
      "review_date": "2006-02-03"
    },
    {
      "review_title": null,
      "content": "Greatest movie of all time, and for those of you that give it 0's you are ignorant people that haven't read the books and decide that watching the movie should do it all for you. You people can go watch dawn of the dead or some Greatest movie of all time, and for those of you that give it 0's you are ignorant people that haven't read the books and decide that watching the movie should do it all for you. You people can go watch dawn of the dead or some shit and give it 10's and have no idea what a truly great movie entails.",
      "review_date": "2007-12-03"
    },
    {
      "review_title": null,
      "content": "It kept me focused the entire 3+ hours, and excited. That is a testament to a truly great epic. It had everything I could ask for in a fantasy movie.",
      "review_date": "2008-07-08"
    },
    {
      "review_title": null,
      "content": "Everything but the acting was perfect. Not, the acting wasn't bad it was a bit more than ok even. Yes, i agree with that, and everyone who didn`t liked the series, but that isn`t the point! it`s a fabulos story told perfect it` doesn`t Everything but the acting was perfect. Not, the acting wasn't bad it was a bit more than ok even. Yes, i agree with that, and everyone who didn`t liked the series, but that isn`t the point! it`s a fabulos story told perfect it` doesn`t need even more exagerations from the actors to ruin it. it was acted as it should have been. Few movies ever made me cry this made me more than cry at the end.",
      "review_date": "2009-02-17"
    },
    {
      "review_title": null,
      "content": "First you complain about the first two movies not wrapping up the story.....now you complain about the complete opposite. I watched the extended version of this film and was actually surprised that it was 250 minutes long. Seemed like a lot First you complain about the first two movies not wrapping up the story.....now you complain about the complete opposite. I watched the extended version of this film and was actually surprised that it was 250 minutes long. Seemed like a lot less. Anyone who's read this book should agree that if Peter Jackson had ended it the same way tolkein did it the climax would have come at the hour-and-a-half mark, with 3 more hours to go, which is fine for a book which is read in multiple sittings but tourture for a movie. I'm glad Jackson ended it like he did and wrapped everything up. Well done sir!",
      "review_date": "2005-12-14"
    },
    {
      "review_title": null,
      "content": "By far this is my all time favorite movie. It surpasses virtually every other movie in every way. The lord of the Rings Return of the king is a must see before you kick the bucket.",
      "review_date": "2011-01-20"
    },
    {
      "review_title": null,
      "content": "I love this movie so very much. Every time i see it, it still tears me up after watching it at least 9 times. Even though it is really hard to tell what there saying( another marvelous feet by the director). An incredible movie that i thinkI love this movie so very much. Every time i see it, it still tears me up after watching it at least 9 times. Even though it is really hard to tell what there saying( another marvelous feet by the director). An incredible movie that i think has the best freaking ending ever.",
      "review_date": "2011-03-13"
    },
    {
      "review_title": null,
      "content": "The best film I've ever watched. It combines everything I love about films. Superb directing, passionate acting (with the exception of Bloom), amazing music, and the ability to grab and not let go. This film (and trilogy) completely fulfillThe best film I've ever watched. It combines everything I love about films. Superb directing, passionate acting (with the exception of Bloom), amazing music, and the ability to grab and not let go. This film (and trilogy) completely fulfill the definition of epic.",
      "review_date": "2011-02-22"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nthe best film ever, it really is, it is even better than the two towers, the storyline is better than ever, when gollum betrays frodo and sam, oh i love that bit...",
      "review_date": "2012-02-12"
    },
    {
      "review_title": null,
      "content": "A perfect movie, it has anything you could possibly want: action, romance, adventure, comedy, war, fantasy... ItÈ",
      "review_date": "2012-03-16"
    },
    {
      "review_title": null,
      "content": "Superb in every way. Watch the films first, then read the books. An adventure so epic that it will be your measuring point for future fantasy films of the sort.",
      "review_date": "2012-03-21"
    },
    {
      "review_title": null,
      "content": "Contiene las mejores escenas de accion que he visto. Es aun mejor que las dos anteriores y resulta ser una de las peliculas mas entretenidas que he visto. Peter Jackson logra adaptar las tre historias perfectamente y al final nos da comoContiene las mejores escenas de accion que he visto. Es aun mejor que las dos anteriores y resulta ser una de las peliculas mas entretenidas que he visto. Peter Jackson logra adaptar las tre historias perfectamente y al final nos da como resultado la mejor trilogia de todos los tiempos. The Return of the King es una joya del cine moderno y un clasico instantaneo.",
      "review_date": "2012-04-03"
    },
    {
      "review_title": null,
      "content": "The final and best entry in the Lord of the Rings trilogy. Sauron begins his final assault on Middle Earth, Gondor is losing and thr rightful king, Aragorn must return to the throne. Frodo and Sam arrive in Mordor but Golum will do anythingThe final and best entry in the Lord of the Rings trilogy. Sauron begins his final assault on Middle Earth, Gondor is losing and thr rightful king, Aragorn must return to the throne. Frodo and Sam arrive in Mordor but Golum will do anything to stop the ring being destroyed however Frodo himself is feeling the effects of the ring and also does not want it destroyed. Its up to Sam to help Frodo through this final struggle to destroy the ring and save Middle Earth. A stunning conclusion to a fantastic trilogy of films, some of the best in cinema history.",
      "review_date": "2012-12-08"
    },
    {
      "review_title": null,
      "content": "This is one of the greatest films of all time! It brings an end to the epic tale of the fellowship and it is just perfect. Great book-to-film conversion. The extended version is better though, it includes The Mouth of Sauron as well as otherThis is one of the greatest films of all time! It brings an end to the epic tale of the fellowship and it is just perfect. Great book-to-film conversion. The extended version is better though, it includes The Mouth of Sauron as well as other juicy little tidbits.",
      "review_date": "2012-06-17"
    },
    {
      "review_title": null,
      "content": "Return of the King is probably my least favorite in the trilogy, but that doesn't make it in any way a bad movie. The battle scenes are awesome, but they get a bit repetitive after a while. Also, this one was a bit harder to follow than theReturn of the King is probably my least favorite in the trilogy, but that doesn't make it in any way a bad movie. The battle scenes are awesome, but they get a bit repetitive after a while. Also, this one was a bit harder to follow than the other two. Other than that though, this is a great conclusion to one the best movie franchises of all time!",
      "review_date": "2012-07-03"
    },
    {
      "review_title": null,
      "content": "this movie is perfect, it deserves much better critic than the user score is. the film does great job in all aspect: story-wise, graphics, an perfect soundtrack, and great acting by the characters. it's a perfect ending of the trilogy. in mythis movie is perfect, it deserves much better critic than the user score is. the film does great job in all aspect: story-wise, graphics, an perfect soundtrack, and great acting by the characters. it's a perfect ending of the trilogy. in my opinion the film deserves a (99) of 100 in metacritic.",
      "review_date": "2012-07-19"
    },
    {
      "review_title": null,
      "content": "This movie and the last two movies are fantastic,but,this movie close the trilogy with a lot of success.The producers of the movie are geniuses.But not only them.Also the director and the writers.",
      "review_date": "2012-10-27"
    },
    {
      "review_title": null,
      "content": "This is by far one of my most favorite movies of all time. Great actors, special effects, a great script and a lot of great characters that are easy to remember, and you will never forget them.",
      "review_date": "2012-12-25"
    },
    {
      "review_title": null,
      "content": "For Jackson to shoot The Lord of the Rings with a local crew in New Zealand, a country at the edge of the world with little stake in its doings, is a marvel which may only be repeated by Jackson himself. Apart from the international cast, theFor Jackson to shoot The Lord of the Rings with a local crew in New Zealand, a country at the edge of the world with little stake in its doings, is a marvel which may only be repeated by Jackson himself. Apart from the international cast, the people who were actually working to bring us the trilogy, like special effects, were Kiwis. The majority of this credit must go to Jackson for his leadership and vision, and for succeeding in hiring an able team.\r The Return of the King is the concluding chapter in the trilogy. The story is picked up where it was left off at the end of The Two Towers. We are shown a glimpse into Gollum's past. The rest of the fellowship reunite at Isengard. Saruman's fate is omitted from the theatrical edition, which I always found odd given his importance in the previous instalment.\r It is a time for festivities in Rohan in the wake of the victory at Helm's Deep. An accident shows us Sauron's plans for Minas Tirith, the legendary capital of Gondor. The fellowship breaks again in a  different way. Gandalf rides to the city to find the steward reluctant to lift even a finger for its defence. Needless to say, things work out and Rohirrim ride for Gondor's aid. Faramir, dejected by his father, rides out in a last ditched effort to reclaim Osgiliath.\r A family heirloom is returned to Aragorn which he uses to find help in the most unexpected places. Another plot device if you ask me. If you keep an eye out for them, they become very obvious. Jackson could have lessened its impact or omitted it entirely, making sure the battle was won through the prowess of battle commanders, which he failed to do so. As Fellowship never purported to show us a huge battle at all, and did not have to resolve it, I will forever hold it in higher regard than Return. The Two Towers resolved its battle much more satisfactorily, but Return has got much more on the former in other areas, so the second place goes to the latter.\r Orcs begin the attack on the city. Gandalf leads the defence. The battle looks grander than the one at Helm's Deep, the besieging armies and weapons more awe-inspiring. The special effects used to bring this conflict to life were stunning_ showing the destruction of architecture by the catapults and the loss of men and Orcs; as well as bringing to life Shelob, the giant spider. The scene of the Rohirrim cutting through the Orcs on their horses is possibly the most spectacular. Oliphaunts and Nazguls join the fight.\r My previous apathy for Eowyn is cured after watching the extended version, in which she develops significantly. In fact, she is the only female character in Middle Earth who is of some worth, and I like where her story took us, climaxing in a very satisfactory way in the middle of a battle, pitted against only the most important antagonists.\r The main trio_ Aragorn, Legolas and Gimli, are absent from much of the fighting, as the other two accompany the former on his journey of self-discovery. I was earnestly hoping for them to join the fight, which they did (Legolas displaying some very impressive killer moves), but it was so ridiculously short. Four minutes. Believe me, I counted. In this regard The Two Towers was much better, as well as having more memorable scenes with the Gollum.\r Frodo's inevitable clash with Gollum goes full circle. Sam displays unprecedented strength of character and resolve, and the Hobbits thrive without much help from men. Men ride once more to aid Frodo in his quest to rid them of the ring, and a final battle sequence follows, after which it is destroyed. In epilogue, we learn about the fates of the Hobbits, Aragorn and Gandalf.\r The extended edition had some interesting scenes which enriched the characters and the story, but also some which betrayed some ineptitude at editing. One scene had a character utter the exact same dialogue to persuade someone in the span of a single conversation. Surely a rewording would have been more effective. I scoffed at a particular attempt to blossom an affair between two secondary characters. Such things should have been hinted at in the epilogue. No one is interested in that stuff when the stakes involve the end of the world.\r Finally, a discussion about the extraordinary tally at the Oscars. Eleven well-deserved wins out of as many nominations, in fields as diverse as art direction, costume design, make-up, sound, original score, original song, editing, visual effects, adapted screenplay, directing, and Best Picture.\r In the end I would observe that the extended editions of the first and second instalments, three hours twenty and three hours thirty-three minutes respectively, enhanced the tales while the third one, a crushing four hours, did not achieve anything of worth.",
      "review_date": "2013-12-04"
    },
    {
      "review_title": null,
      "content": "An epic movie with an epic end. Love this movie.",
      "review_date": "2013-01-17"
    },
    {
      "review_title": null,
      "content": "A Flawless job by Peter Jackson. this movie has everything! Action, Adventure, Romance..etc. and the digital effects are amazing!! i had no idea they had the kind of equipment to make such amazing effects! and i see a lot of peopleA Flawless job by Peter Jackson. this movie has everything! Action, Adventure, Romance..etc. and the digital effects are amazing!! i had no idea they had the kind of equipment to make such amazing effects! and i see a lot of people complaining about the length of the movie. And i must agree the length of the movie is kinda long..running over 3 hours long. but its better than making 5-6 lotr..right? i think 3 lotr movies is the perfect sequel and this movie will be known for awhile..",
      "review_date": "2012-12-11"
    },
    {
      "review_title": null,
      "content": "After watching the movie I was 100% sure this one is the best movie out of them all. Nothing here could be done better, everything was perfect. The story, the music, the scenery, everything was done as if god sent Tolkien and Jackson and toldAfter watching the movie I was 100% sure this one is the best movie out of them all. Nothing here could be done better, everything was perfect. The story, the music, the scenery, everything was done as if god sent Tolkien and Jackson and told them to do their job. I didn't read the books, it's a shame, I know, but only because I'm a lazy person (I love reading books) and when I wanted to start, I noticed my dog ate the first 200 pages. But even when I know it's a movie and I didn't read the books, I can see what Tolkien did there, what he made, created, when he did it (In the 30's, 40's and 50's making something that advanced and fantastic, could be called genius, because for something like this you need inspiration and where did Tolkien get it?) and how. If not for Tolkien and Jackson the world of books and movies would be much different.",
      "review_date": "2012-12-14"
    },
    {
      "review_title": null,
      "content": "Wow, it is an amazing film. It's not boring. I loved it. It has all the things a perfect movie needs, conclusion: it is epic, see it it is worth your time!",
      "review_date": "2012-12-18"
    },
    {
      "review_title": null,
      "content": "A truly epic and beautiful end to one of the most incredible stories made ​​in the history of mankind.\rChapter of interpretations, the best over the trilogy is Viggo Mortensen as Aragorn, and Ian McKellen in the role of Gandalf. A hithertoA truly epic and beautiful end to one of the most incredible stories made ​​in the history of mankind.\rChapter of interpretations, the best over the trilogy is Viggo Mortensen as Aragorn, and Ian McKellen in the role of Gandalf. A hitherto unknown actress who does very well is Miranda Otto, who plays Eowyn. Transmits tenderness, nobility and courage in equal measure, as a new Krimilda. The sequence in which defends the King Théoden Witch King of Angmar is superb, especially when you cut the head to evil beast. The Nazgul are beautifully created, it must be said. That has been one of the best performances of Jackson.\rUltimately, the greatest achievement is that Peter Jackson has managed to recreate the atmosphere right hand novels in both locations (New Zealand was a fortunate choice) and the characterization of the beings who inhabit Middle Earth. I'm sure Tolkien would be proud to see how it has adapted its unfading work.\rOne of the best films of the decade 2000.",
      "review_date": "2013-03-23"
    },
    {
      "review_title": null,
      "content": "Everything about this movie is perfect and that is why it is my all time favorite film. It is epic in every sense of the word and is truly a great ending to one of, if not the best film series ever.",
      "review_date": "2013-02-08"
    },
    {
      "review_title": null,
      "content": "An immensely fantastic piece of cinema and art. Peter Jackson's brilliant final film in the brilliant Rings trilogy. One of (if not the) best trilogies of all time and this is personally my favourite movie of all time. Literally everything isAn immensely fantastic piece of cinema and art. Peter Jackson's brilliant final film in the brilliant Rings trilogy. One of (if not the) best trilogies of all time and this is personally my favourite movie of all time. Literally everything is top notch, from the voice acting, to the special effects, to the action, to the beautiful scenery. Mesmerizing to the very end and remember, this movie released back in 2003 and it is leaps and bounds better than half of the junk that comes out now! Once again, the negative reviews and scores are from moronic fools that have the attention spans of a soggy loaf of bread. Even though it has tons of insane actions sequences, war scenes, etc, some of these people STILL got bored. Obviously they wanted it to be non stop action with explosions every second. Sorry, this isn't a Michael Bay movie.",
      "review_date": "2013-12-01"
    },
    {
      "review_title": null,
      "content": "Very well done.  Great acting, great writing, great directing, great effects.  This is the rare movie that I have no real complaints about.  I understand it may be a bit long for some, but it's easily one of the best movies I've seen.",
      "review_date": "2013-09-21"
    },
    {
      "review_title": null,
      "content": "This Film was absolutely amazing! Everything was spectacular in it. With superb acting from Sir Ian Mckellen, Viggo Mortensen, Bernard Hill and Andy Serkis, along with amazing special effects, pitch-perfect story telling and so much emotionalThis Film was absolutely amazing! Everything was spectacular in it. With superb acting from Sir Ian Mckellen, Viggo Mortensen, Bernard Hill and Andy Serkis, along with amazing special effects, pitch-perfect story telling and so much emotional scenes,  you have got one of the best films of all time. It was so precious. Tolkien was possibly a master of books, but Peter Jackson is a cinema GOD. ",
      "review_date": "2013-05-25"
    },
    {
      "review_title": null,
      "content": "The third chapter of the trilogy is much better than the first two and of course the action is much much better. It's epic and awesome. Congratulations to Peter Jackson!",
      "review_date": "2013-08-31"
    },
    {
      "review_title": null,
      "content": "Every part of this movie was amazing, I watch this all the time, and I love it every time I watch it. I love how through this movie series you are with all the characters journey the whole time.",
      "review_date": "2013-10-19"
    },
    {
      "review_title": null,
      "content": "This is one of the best movies I've ever seen, epic. Even if you're not a fan of fantasy films, you're definitely going to love this one! It lasts for more than 3 hours, but you'll enjoy every minute of it.",
      "review_date": "2013-08-27"
    },
    {
      "review_title": null,
      "content": "This is one of my favorite movies of all time. It serves as a greatly satisfying ending to the trilogy with a lot of great moments. Also, people need to shut up about the long ending.",
      "review_date": "2013-08-30"
    },
    {
      "review_title": null,
      "content": "Man, this was the best movie based from a book, ever. Although it is really long, it still has its acting, story, and battle scenes that make this one as one of the best ever made.",
      "review_date": "2013-11-25"
    },
    {
      "review_title": null,
      "content": "My favorite film and film series of all time. I first saw this movie when I was 8 years old, and though I couldn't completely follow the plot, I really loved the action scenes and all the other things 8-year-old boys love about movies. As IMy favorite film and film series of all time. I first saw this movie when I was 8 years old, and though I couldn't completely follow the plot, I really loved the action scenes and all the other things 8-year-old boys love about movies. As I grew older and watched it more times, my love for Return of the King only grew as I began to understand it. Now, I own the extended trilogy on blu-ray, and I watch the series every Christmas: a tradition I plan to keep through the years. Thank you, Lord of the Rings, for many great memories.",
      "review_date": "2013-11-22"
    },
    {
      "review_title": null,
      "content": "A “King” that earns its crown, Peter Jackson’s final installment in his monumental “The Lord of the Rings” represents that filmmaking rarity — a third part of a trilogy that is decisively the best of the lot. With epic conflict, staggeringA “King” that earns its crown, Peter Jackson’s final installment in his monumental “The Lord of the Rings” represents that filmmaking rarity — a third part of a trilogy that is decisively the best of the lot. With epic conflict, staggering battles, striking landscapes and effects, and resolved character arcs all leading to a dramatic conclusion to more than nine hours of masterful storytelling, “The Return of the King” is an urgently paced 200-minute film without an ounce of fat — until unfortunate multiple endings that go on and on, as if Jackson couldn’t bear to let go.\r In the rarefied world of large-scaled cinematic triptychs, three in the modern era quickly come to mind that, initially at least, combined striking cinematic prowess with enormous public enthusiasm: “The Godfather,” “Star Wars” and “The Matrix.” In the first two instances, the second film was by general consensus the best and most adventurous, while the third was by far the weakest across the boards.\r What Jackson and New Line so boldly did right was to shoot all three in one continuous stretch rather than start from scratch each time.\r Of all the wonders associated with this trio of films — the literate, generally well structured overall script, the perfection of the New Zealand locations, the visionary scenic designs, the exceptional visual effects, the costumes, hair and armor, and the excellent cast — perhaps the most impressive feat of all has been Jackson’s ability to keep it all in his head through the years and deliver a cohesive work with a proper sense of balance and proportion.\r Unlike his predecessors in the trilogy business, of course, Jackson had a ready-made three-part text to work from, one constructed to pay off in the climactic installment. And pay off it does, in ways guaranteed to satisfy the multitudes around the world who embraced the first two films, and even to impress non-card-carrying members of the massive Tolkien-Jackson cult.\r Still, anyone who hasn’t seen the first two pics won’t have a clue what’s going on at the outset of “The Return of the King.” With much struggle behind him but the worst yet to come, Frodo (Elijah Wood) is increasingly feeling the weight of being the Ringbearer as he and his faithful friend Sam (Sean Astin) make their way toward Mount Doom, the place where the Ring was made and the only place it can be destroyed, thus thwarting Sauron’s attempt to destroy humankind.\r In a way new to the trilogy, the emotional momentum surges along with the physical action. After early ambivalence over his responsibility for the Ring, Frodo grows into the job; after long dodging his royal inheritance, Aragorn finally rises to the occasion; Sam, especially, emerges as a three-dimensional character of intense devotion to Frodo even after he has been tricked by the Iago-like Gollum and exiled by his closest friend; and the ineffectual Hobbits Pippin and Merry take on some size, figuratively if not literally.\r The building sense of dread is palpable. With the belching Mount Doom and its all-powerful hovering Eye in the distance, humankind and Orcs alike traverse an already stark landscape that will shortly become scorched. Dreadful giant screeching dragons, called Fell Beasts, flap down out the sky to pluck hapless soldiers off their feet and horses. And the Orcs are assisted by yet more monsters, including Hulk-like Trolls and towering, long-tusked mastodons known as Mumakil, that strike terror and make resistance seem futile.\r With these forces massing to decide the fate of civilization, Gandalf tries to buy time for Frodo to plunge the Ring into the lava at Mount Doom. To greater effect than he has at any point in the three films, Jackson cuts among different sets of activity, the most spectacular being the battle and the most emotionally intense being Frodo’s painful, inch-by-inch journey.\r The siege of Minas Tirith may well be the mother of all cinematic battles; certainly no pre-CGI war film ever featured a scene involving upwards of 200,000 soldiers. But that’s how many Orcs maraud the city, and the details are extraordinary: the huge stones catapulted at the fortifications from mobile towers; the fire-breathing dragon battering ram that crashes through the main gates; the earth-shaking Mumakil that raze all before them with scythe-like tusks and carry dozens of men; the gradual movement of the battle from the ground to the upper levels of the exquisitely designed citadel. All of “The Lord of the Rings” has been building to this, and it delivers entirely.\r All the outstanding technical and craft achievements that have been duly honored in the previous installments are at least equaled and sometimes trumped here, especially in regard to how involved the creatures are this time. There has been no let-up in creativity, only intensification.\r So Jackson has done it. After seven years of work, Jackson has pulled off one of the most ambitious and phenomenally successful dream projects of all!",
      "review_date": "2016-04-17"
    },
    {
      "review_title": null,
      "content": "All those trashing the lord of the rings and saying such things as \"predictable!\" then first of all learn how to read and then pick up Tolkien's wonderful book and start reading. Many of you have trashed it so becasue your intellegenceAll those trashing the lord of the rings and saying such things as \"predictable!\" then first of all learn how to read and then pick up Tolkien's wonderful book and start reading. Many of you have trashed it so becasue your intellegence is below our standard level, and if this is an American site then it's probably normal so don't worry about it.",
      "review_date": "2004-01-28"
    },
    {
      "review_title": null,
      "content": "A Fitting ending to the greatest trilogy of all time!",
      "review_date": "2004-01-04"
    },
    {
      "review_title": null,
      "content": "A Fitting ending to the greatest trilogy of all time!",
      "review_date": "2004-01-04"
    },
    {
      "review_title": null,
      "content": "I couldn't help at some points to become teary eyed. Jackson does a great job of tying everything together perfectly so no questions are raised in after thought. Was a bit long but it was worth it in the end. I left the theater content I couldn't help at some points to become teary eyed. Jackson does a great job of tying everything together perfectly so no questions are raised in after thought. Was a bit long but it was worth it in the end. I left the theater content and this film went above my expectations. This trilogy will be the new Star Wars for the younger generation.",
      "review_date": "2004-01-08"
    },
    {
      "review_title": null,
      "content": "Great!!!",
      "review_date": "2004-01-09"
    },
    {
      "review_title": null,
      "content": "ok for all you who gave it lower then 8 wtf. \rif you had the money, the tools, the actors, everything Jackson had to work with, do u actually think u could of came fukin close to creating as marvelous as a masterpiece as he did. \rHe set aok for all you who gave it lower then 8 wtf. \rif you had the money, the tools, the actors, everything Jackson had to work with, do u actually think u could of came fukin close to creating as marvelous as a masterpiece as he did. \rHe set a legacy, thats with as few as The Godfather and Shindlers List. K so stfu you virgins cause this is the best fantasy you'll every lay your eyes on. mmmk? Im not much for the books, font is too damn small, im sure they're good though. The movie left tolkien no shame. Jacksons sendin her home happy. Runnin for prez next elec. Vote for Me!",
      "review_date": "2006-03-10"
    },
    {
      "review_title": null,
      "content": "If you are a fan of fantasy and Tolkien, this movie is probably the best you'll ever see. If you are a fan of fantasy and haven't read Tolkien, this movie may inspire you to pick the books. If you are just not of the imaginative If you are a fan of fantasy and Tolkien, this movie is probably the best you'll ever see. If you are a fan of fantasy and haven't read Tolkien, this movie may inspire you to pick the books. If you are just not of the imaginative type (i.e. you can't get into a fantasy world because it is 'unreal'), this movie may seem boring. This is a sci-fi movie. And your brain needs to be stimulated to accept the details of a new world. So the ones who complain about it being long shouldn't just see it in the first place. They aren't the type suited for it. For people who do care about depth and thought provoking ideas in a fantasy, the extra long nature of the movie is just what they had been in dire need for. Also, if we didn't have such a long run, the first tag to be thrown on the movie would be 'mindless action'. Incredible story and direction make this the finest on-screen moment I've ever seen. There are those who would complain about The Army of Dead being too unreal. But if you look closely, the whole trilogy including The One Ring bit is unreal. The way that you connect part of imaginary world to your own is the real thing. And the story clearly expresses the desperation in which Aragorn used the Army of Dead in the battle for Gondor. Whereas he did comprehend the fact that the army can be used only for a single time and this certainly wasn't his last battle before Sauron's downfall. This is one of the main aspects that I love about the trilogy, i.e. the relationship between hope and actions based on it. The story is a dark one which holds many paths and choices for the main characters. And though they don't have any hope, they still go for the best they could have hoped for. And through the complex plot line, we're explained many bits of sayings we interpreted only as 'quotes'. Such as \"even the smallest one can change the course of history\" or \"don't be too eager to deal out death and life, for even the wise cannot see all the ends\". To summarize it all, this movie is as much for eyes as it is for brains. Lord of the Rings did change many aspects of my thinking. And as the movie trilogy was my introduction to the phenomenon, I give it a 10/10.",
      "review_date": "2006-04-03"
    },
    {
      "review_title": null,
      "content": "Ok first up please let me establish that I am both a fan of the books and movie. I think Jackson did a damn good job of interpreting the 1110 page book (it's something like that I'm not getting technical). Also for those who say Ok first up please let me establish that I am both a fan of the books and movie. I think Jackson did a damn good job of interpreting the 1110 page book (it's something like that I'm not getting technical). Also for those who say it's to long, I can stay up all night and watch all three extended additions. Yay for Tolkien and PJ.",
      "review_date": "2007-01-11"
    },
    {
      "review_title": null,
      "content": "The best movie trilogy ever. The extended editions are even better. Hours of extra movie material really adds to the story. 10 out of 10.",
      "review_date": "2007-01-08"
    },
    {
      "review_title": null,
      "content": "Best movie ever! incredible acting and non-stop action.",
      "review_date": "2008-02-11"
    },
    {
      "review_title": null,
      "content": "Best movie of the last 50 years, enough said. It was long, but the ending was amazing. Some parts were boring if you haven't read the books, but the action moments more than made up for them.",
      "review_date": "2008-04-08"
    },
    {
      "review_title": null,
      "content": "A beautiful finish to the greatest Trilogy of all time. Peter Jackson was able to capture every possible emotion to its full. An Epic story filled with struggle, pain and evil but overcome with with perserveriance, friendship and love. The A beautiful finish to the greatest Trilogy of all time. Peter Jackson was able to capture every possible emotion to its full. An Epic story filled with struggle, pain and evil but overcome with with perserveriance, friendship and love. The best story of good and evil ever written, from the brilliant mind of professor J.R.R. Tolkein. Jackson was able to completly capture and bring the book to life. Every actor seemed to just magicaly fill the role perfectly. I colud go on and on untill the end of time writing about this movie but I'm going to leave you with this FACT. The Lord of the Rings is the best movie ever made and there will probably never be a movie like it.",
      "review_date": "2008-06-13"
    },
    {
      "review_title": null,
      "content": "I don't remember when I watched the return of the king for the first time, but I know this. Watching it now, I can only say that this movie imparts a feeling which I cannot express it in words. The lord of the rings trilogy is and will I don't remember when I watched the return of the king for the first time, but I know this. Watching it now, I can only say that this movie imparts a feeling which I cannot express it in words. The lord of the rings trilogy is and will always remain my favorite! Story... If you haven't watched the first two then it's gonna be difficult for you to keep up with the story but if you get the plot then it's a story that's gonna captivate you even after the end of the movie. Kudos to J.R.R.Tolkien for creating such a world and Peter Jackson for filling this world with life. Acting... Every character is special and all the credit goes to the actors. Each and every actor, has carried out his/her roles with dedication and devotion. No complaints. Direction... I'd only say that no other person in this universe could have made lord of the rings other than Peter Jackson. Visuals... I don't think any movie will ever be able to come up to the level of return of the king in terms of visuals. It's not easy for a 3 hour movie to keep you entertained for long but this movie makes you beg for more! Such movies are made once in a decade and to not see them is the biggest mistake of your life. THE LORD OF THE RINGS IS A JOURNEY OF EPIC PROPORTIONS!!!!!!!!!!!",
      "review_date": "2008-07-19"
    },
    {
      "review_title": null,
      "content": "I used to believe no movie could match the strength of Tolkien's literature but Jackson's passion with the material is so overwhelming that produces a cinematic troumph!There's no bad acting,only faith and obedience to I used to believe no movie could match the strength of Tolkien's literature but Jackson's passion with the material is so overwhelming that produces a cinematic troumph!There's no bad acting,only faith and obedience to Tolkien's work,presented here in breathtaking landscapes,epic battle scenes and fantastic art direction!",
      "review_date": "2009-03-18"
    },
    {
      "review_title": null,
      "content": "The best of the trilogy.",
      "review_date": "2010-04-03"
    },
    {
      "review_title": null,
      "content": "Best movie ever.",
      "review_date": "2003-12-11"
    },
    {
      "review_title": null,
      "content": "One of the most breath-taking films ever produced with brilliant acting and dialogue. An adequate adaptation of the books, which some of you seem to forget. How can you say the ending is too predictable? Did you expect them to change the One of the most breath-taking films ever produced with brilliant acting and dialogue. An adequate adaptation of the books, which some of you seem to forget. How can you say the ending is too predictable? Did you expect them to change the ending from what had been written 50 years ago? Idiots. Look beyond the glitter and big fancy setwork and you will see at the heart of this story the relationship between hopeless hobbits and the definition of the heroic in identity in Aragorn, something our culture has lost. This movie is one of the best I have ever seen and should be at least viewed by all.",
      "review_date": "2004-01-05"
    },
    {
      "review_title": null,
      "content": "One of the most breath-taking films ever produced with brilliant acting and dialogue. An adequate adaptation of the books, which some of you seem to forget. How can you say the ending is too predictable? Did you expect them to change the One of the most breath-taking films ever produced with brilliant acting and dialogue. An adequate adaptation of the books, which some of you seem to forget. How can you say the ending is too predictable? Did you expect them to change the ending from what had been written 50 years ago? Idiots. Look beyond the glitter and big fancy setwork and you will see at the heart of this story the relationship between hopeless hobbits and the definition of the heroic in identity in Aragorn, something our culture has lost. This movie is one of the best I have ever seen and should be at least viewed by all.",
      "review_date": "2004-01-05"
    },
    {
      "review_title": null,
      "content": "I really enjoyed this film. It has great acting, great special effects, and a great musical score. I HIGHLY recommend this movie.",
      "review_date": "2006-10-08"
    },
    {
      "review_title": null,
      "content": "It astonishes me how many believed the ending to be far too long. But I feel it was a necessary choice to lengthen it as they did. This film attempted to its best to tie all the loose ends, and to conclude an epic adventure that spanned a It astonishes me how many believed the ending to be far too long. But I feel it was a necessary choice to lengthen it as they did. This film attempted to its best to tie all the loose ends, and to conclude an epic adventure that spanned a total of ten hours of film. In order to do the master works of fiction any justice, every character must say their good byes, every action must be taken to blow the audience away. I found, then, that I wasn't only plastered to my seat, my eyes welling to the brim with tears, but that I wanted to remain with each character long after the story had ended. And for producing that profound want alone, the film deserves the rating I gave it, as well as for it being quite simply one of the great master works of cinema. These are the essential images magic is made of.",
      "review_date": "2006-02-26"
    },
    {
      "review_title": null,
      "content": "Simply awesome! Words fail me to describe what I felt when I was watching this movie. Certainly, one of the finest achievements in the history of cinema & certainly the most stupendous achievement in 21st century cinema so far.",
      "review_date": "2006-03-03"
    },
    {
      "review_title": null,
      "content": "Tolkien unravels an amazing book. Jackson resulted an amazing movie.",
      "review_date": "2006-05-17"
    },
    {
      "review_title": null,
      "content": "The last thing I want to do is jump on the bandwagon, and join the millions of people out there gushing and babbling about how amazingly fantastic this movie was. Unfortunately, I have little choice in the matter. It really is an an The last thing I want to do is jump on the bandwagon, and join the millions of people out there gushing and babbling about how amazingly fantastic this movie was. Unfortunately, I have little choice in the matter. It really is an an awe-inspiring conclusion to what is arguably one of the greatest trilogies ever conceived - fantasy or otherwise. I wasn't there when the original star wars trilogy opened for the first time at the movies. I always felt that I missed out on something - the buzz and excitment that inevitably accompanies the opening nights of truely great films. I'm just glad that I was lucky enough to see the full Lord of the Rings trilogy on the big screen - knowing full well that this will go down in history as one of the greats, and may never been shown on the big screen again.",
      "review_date": "2006-05-18"
    },
    {
      "review_title": null,
      "content": "Every time I come onto this website I am blown away by the stupidity of people. If you've read the books and enjoyed them, how could you not enjoy the movies? People who haven't read the books loved the movies, people who have read Every time I come onto this website I am blown away by the stupidity of people. If you've read the books and enjoyed them, how could you not enjoy the movies? People who haven't read the books loved the movies, people who have read the books loved the movies. There always has to be special needs people out there who have to be different from everyone else. if only natural selection were still working as effectively on human beings, because none of you would be alive right now.",
      "review_date": "2006-07-13"
    },
    {
      "review_title": null,
      "content": "Awesome.",
      "review_date": "2008-05-29"
    },
    {
      "review_title": null,
      "content": "This movie ROCKS!!! Intense action, amazing action and good story line I loved the books and the movie livies up to standerd this is a must see movie.",
      "review_date": "2008-07-08"
    },
    {
      "review_title": null,
      "content": "Great!!!",
      "review_date": "2003-12-16"
    },
    {
      "review_title": null,
      "content": "Someone gave this a zero, I noticed. Who would do such a thing? This movie made me so incredibly happy. My friends and I saw it last night and we all agree that it was perfect. It completely overshot our expectations. Anyone who cannot enjoy Someone gave this a zero, I noticed. Who would do such a thing? This movie made me so incredibly happy. My friends and I saw it last night and we all agree that it was perfect. It completely overshot our expectations. Anyone who cannot enjoy something that is so much fun probably enjoys absolutely nothing.",
      "review_date": "2003-12-17"
    },
    {
      "review_title": null,
      "content": "Awesome.",
      "review_date": "2005-02-24"
    },
    {
      "review_title": null,
      "content": "The best movie of all time.",
      "review_date": "2005-09-14"
    },
    {
      "review_title": null,
      "content": "The greatest movie of all time. No other movie compares to its scope of production and detail as well as its level of entertainment.",
      "review_date": "2006-11-16"
    },
    {
      "review_title": null,
      "content": "After twice reading The Hobbit and The Lord of the RIngs, I would not have thought it possible to bring the books to the big screen. Having seen the films I can say that Peter Jackson did a masterful job and the films are excellent.",
      "review_date": "2006-12-23"
    },
    {
      "review_title": null,
      "content": "I totally echo Chris H's sentiments about the detractors. As to the film, I am proud to say that it is my favorite film of my lifetime (1985-) and certainly one of the best of all time. Excellent performances by all and a job well done I totally echo Chris H's sentiments about the detractors. As to the film, I am proud to say that it is my favorite film of my lifetime (1985-) and certainly one of the best of all time. Excellent performances by all and a job well done for Peter Jackson, Fran Walsh, Phillipa Boyens, and the crew. My one tiny quibble: no Saruman. I understand the reasoning for leaving him out, but I and others who have seen it felt that it left that part of the story unfinished. Yet, that decision made the extended edition that much better.",
      "review_date": "2006-09-24"
    },
    {
      "review_title": null,
      "content": "I see some of you hated this movie. but that's silly because a LOT of movies are long and boring nowadays (and I was being sarcastic). LOTR was at least a good trilogy. in some of the boring bits, I tried to stay awake for the exciting I see some of you hated this movie. but that's silly because a LOT of movies are long and boring nowadays (and I was being sarcastic). LOTR was at least a good trilogy. in some of the boring bits, I tried to stay awake for the exciting parts, and yes it was a good movie.",
      "review_date": "2007-12-14"
    },
    {
      "review_title": null,
      "content": "The trilogy was one of the only ones that I've seen that actually matched the books.",
      "review_date": "2007-04-23"
    },
    {
      "review_title": null,
      "content": "A classic in every sense. These movies were essentially one 14-hour epic broken into three installments (just as the original is really one long novel broken into three books). Completely amazing, groundbreaking, and full of heart. It's A classic in every sense. These movies were essentially one 14-hour epic broken into three installments (just as the original is really one long novel broken into three books). Completely amazing, groundbreaking, and full of heart. It's set the bar by which all future epics will be judged.",
      "review_date": "2008-06-22"
    }
  ],
  "num_reviews": 139
}