{
    "rating": 8.4,
    "release_date": "2022-01-28",
    "num_reviews": 332,
    "genres": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "summary": null,
    "reviews": [
        {
            "review_title": "Amazing experience if you know what you are getting into.",
            "content": "First, I think it should be a fair warning that this show is for mature audience. It has lots of violence and swearing. If you are uncertain, watch the 1st episode and see if that's your cup of tea.I found the show very entertaining on multiple levels. It has great story, humor, live and strong characters and excellent voice acting. Maybe that's because the main actors are actually voicing their own characters that they played on the 1st season of Critical Role. They created the characters so they know them inside out.I found the story to be progressing too fast. Maybe I am used to the Critical Role show and watching them trying to decide what to do for hours. In the show, all happens within minutes.The story and atmosphere are also both very dark so far. A lot darker than I had anticipated. I was expecting some parts of the show to be like that but I also expected to see some of the beautiful places of Tal'Dorei. So far, no dice (pun intended). I am hoping they will balance things out in the future.Nonetheless, can't wait for the next episodes.",
            "review_date": "2022-02-04"
        },
        {
            "review_title": "Finally a good D&D adaptation",
            "content": "I've always felt D&D would make great watching but until now haven't seen anything that captures the magic of role play. This show is the best version of that availabile and it's definitely less dungeoning and dragoning it captures the complexity of storytelling and character well. I actually think the episodes are too short.",
            "review_date": "2022-02-07"
        },
        {
            "review_title": "Nice Fantasy show",
            "content": "I don't know what Critical Role is and I never heard of Vox Machina before finding this on Amazon but it was really excellent, funny, and intriguing. Fans of fantasy will be happy.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Binged 9 episodes in one go...",
            "content": ".. and that's because only 9 were available at the time.IThis show is fun, grim, epic and very worth watching if you like fantasy / dark fantasy, a true blast!",
            "review_date": "2022-02-16"
        },
        {
            "review_title": "Review from a Non D&D fan",
            "content": "First I have to appreciate the awesome voice acting, back and forth between characters and beautiful animation. Guess thats why the hype was so great around this show. For non D&D fans like me I would say this show is good for binge watching it you are very much into high fantasy. Some negatives in my opinion rushed lore and relentless adult humor which became a annoyance after some time.",
            "review_date": "2022-02-12"
        },
        {
            "review_title": "Better than expected, for adults only though",
            "content": "I had expected an anime style production but it is rather better.Very much adult orientated in both depiction and course language and it would also appeal to younger audiences if they produced a version suitable for them.",
            "review_date": "2022-02-10"
        },
        {
            "review_title": "Absolutely love this series....",
            "content": "This plus Arcane are 2 of the best shows out there. Great writing, the animation fits perfectly and just enough humor to be present but not forced. Takes me back to my days of staying up till 3am drinking mountain dew and throwing dice.",
            "review_date": "2022-02-11"
        },
        {
            "review_title": "Wow, great show!",
            "content": "Definitely recommended. Funny, well written and voice acted. Great show for any fans of D&D or fantasy adventure!My wife hates anything that's \"fantasy land bullstuff\", but she thought this show was pretty good and wants to watch it with me.I hope they keep making them!",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Addictive",
            "content": "Wow. What fun! Great writing, looks awesome, sounds amazing (the voices, sound effects, music, everything) and the story is fantastic. I won't spoil the end of ep 6, but what a perfect springboard for next season. I just can't say how much I like this and now the only problem will be waiting for another season. I hope it will have more than six episodes. Well done!",
            "review_date": "2022-02-07"
        },
        {
            "review_title": "Vox Machina is a dirty, vulgar, raunchy, violent, bloody MASTERPIECE!",
            "content": "As a fan of Fantasy media AND D&D, I live for content revolving 'round either column and Critical Role's content is no exception to this. At the moment, I'm only on Episode 3 of the first campaign but the reason I'm not in deeper is because...well, the series is hours long and I can't be at my computer all that time.Regardless, I am happy that I don't have to be 100% familiar with the series' lore to know what's what. At least I know who the main good guys are, who the cast is and when the fun begins. I am so happy that the fans helped make this possible through the Kickstarter all those years ago.I only hope we'll get more from this than just the two seasons Amazon ordered.(Side Note: I also wish for the day Fantasy High from Dimension20 and CollegeHumor might be able to follow in CR's footsteps and get their own animated show, even if it is just online)",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Awesome adult fantasy",
            "content": "I was kind of surprised you can make adult fantasy series. Like aren't these for kids. Now that I see it this seems more rela than kiddish fantasy shows. Has good storyline. Has character building. The animation is awesome. The theme song is really nice. Got elements of humour in it. There are obviously elements to relate to here and there despite being fantasy. You really tear up on few scenes since they are so powerful. You can connect to the characters. This is one of the best series I have ever watched. This never feels kiddish at all. Well, one due to swearing, seems natural. It is exactly how adults would react if such situations arise and they have such powers.They won't just go and sacrifice their lives.If you are thinking I am fake praising just watch few episodes. You will get what I am saying.",
            "review_date": "2023-01-28"
        },
        {
            "review_title": "Everything Wow!",
            "content": "I have been watching anime and cartoons for over 20 years. This is everything it should be. Great story, animation, funny antics, brilliant writing, and perfect voice actors to go along with it. Cannot say any more than what a brilliant series and also not to mention critical role is also spot-on. Old school DND and anime fan. Glad to see this is finally taking over.",
            "review_date": "2022-02-11"
        },
        {
            "review_title": "Watch This!",
            "content": "Even if you're not a fan of Critical Role, you can absolutely still enjoy this show. It's fun, bawdy, wonderful, and right up your alley. Sit back and enjoy the fantastic characters of Vox Machina!",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "It's extremely good, wanted more Invincible, I got it.",
            "content": "Another great show by Amazon that has instantly filled my interest in watching more stuff like Invincible. I got the impression that it was like it, and it beautifully meets my expectations, and exceeds them.The dialogue is super funny, even though it may get too overly crude, but the legendary voice actors such Liam O'Brian of Gaara and Vincent Law, Gwen Tennyson's Ashley Johnson, and others including Khary Payton (Cyborg, Ezekiel, Aqualad) are making these characters sooo sassy and fun!I am loving it Soo far, and I hope for Vax and Keyleth romance!",
            "review_date": "2022-02-26"
        },
        {
            "review_title": "Awesome fantasy action with great characters! :-)",
            "content": "Nice clean modern anime-style animation that looks great, especially in action! :-) Quirky, irreverent humor with an interesting cast of fantasy characters that are very different from each other, but still have a strong team bond! :-) A little like The Last Airbender / Korra dynamic, just way more adult! :-)",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Rough start, great finish",
            "content": "The first half of the show felt so rushed. The pacing was awful, the development was iffy, and I was a little sad. But the second half was incredible. I'm not just saying that as a fan of Critical Role. I'm saying that as a fan of fantasy and animation. The last half was amazing television. The fights were amazing, the animation top tier, the story perfect. Can't wait to see more.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "Not terrible, but disappointing",
            "content": "I guess I was expecting more, given the good reviews.The animation is fantastic and the voice acting is good, but those are the only major positives I can think of.The story is just \"okay\". It's a bit rushed and force and we don't get much time to care about any of the characters or process what's going on.Character development is bad for almost all the characters. Vax and Keyleth go from never talking to one another to instantly being in love. It comes out of nowhere and has no time to grow at all. The only character who has half decent development is Percy. Everyone else is a bore. Pike is another one who comes out of left field. Her development happens way too quickly and we never get a chance to know her first.The humor is mostly terrible. I don't mind potty jokes or cussing at all. I LOVE South Park, and that's a show that does crude humor right. But it seems like Vox Machina's creators think that saying the F word randomly = funny, and that *any* sexual reference = funny. 90% of the time the jokes are just forced and lame. Cussing for the sake of cussing isn't funny, it's just bad writing.Overall I finished this, so it wasn't awful, but I was never pulled into it at any point.",
            "review_date": "2022-08-28"
        },
        {
            "review_title": "WE MADE IT FOLKS!!!!!!",
            "content": "Hello, i'm a critter.... just wanna get that out of the way hahawe did it, we did it, we did it, WE DID IT!!!!The first thing i wanna go over is how accurate this show already is to the arc's they are doing in the show! The first two episodes are a pre-stream arc that we've only heard about, and now we finally get to see it. This arc gives Vax and the other members their first lesson which is... no matter who you are, ALWAYS do the right thing. It saves livesthe ending of the second episode introduces one of, if not, my favorite arc of campaign 1 in introducing the Briarwoods. Here, i love that matt is voicing Sylas, it was the only way to do it!Overall i think the voice acting is fantastic, and there is nothing to complain about because nobody knows these characters as well as the voice actors. They played them for years before creating this show!WARNING: this show is more than rated R and has soooooooooo many adult themes and actions as in language (F words mostly), violence and gore, and nudity (as of right now, a short oral sex scene in the first episode that lasts about 15 seconds. Boobs, buttocks, and a slight glimpse at a man's testicles is seen)...this is exactly what i wanted (minus the sex and nudity)",
            "review_date": "2022-01-30"
        },
        {
            "review_title": "eh",
            "content": "Certainly falls victim of the usual adult animation shows. Where characters are constantly being loud and obnoxious. Constantly swearing to a point where it becomes unnatrual. Apart from that, it does have it's charms. Although this premise has been done before, and has been done better. All in all, not bad, but also not much to write home about.6/10: ok but meh.",
            "review_date": "2022-03-10"
        },
        {
            "review_title": "Satisfying yet too fast at times",
            "content": "Great characters, decent storyline, but the dialogues are to Basic at times and everything seems a bit rushed and easy, mostly relationships.The plot moved forward at nice pacez but every character building is neglected in favor of unnecessary action.",
            "review_date": "2022-04-21"
        },
        {
            "review_title": "We are in the golden era of fantasy animation",
            "content": "This show to me is the pure distillation of what good fantasy is supposed to be. Sexy, rowdy, and evoking genuine investment in the characters through their onscreen cameraderie, banter and slowly unfolding respective backstories. Absolutely gorgeously animated, easily the top tier of current Western fare, stunningly choreographed and unsurprisingly voiced to absolute pergection, this show represents the true joy of imagination and escapism while roleplaying. It might be the one small hurdle to a mainstream public as some beats might not always feel the most natural, but it doubles the enjoyment for those of us who are familiar with these voices and how the game works with the layer of meta in which it blankets the show.I can't imagine how the immense crowd of backers must feel, watching their dream come to life and seeing that every single cent was well-spent. I hope this opens the door for more grassroots animation projects.Right now I have the difficult balancing act of ravenously waiting for the next batch of episodes while also not wanting the show to ever get closer to an endpoint. Here's hoping its success will ensure many more seasons to come.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "I'm being Critical, that's my Role",
            "content": "Fun D&D cartoon for adults. I'm a casual viewer of CR so I know the characters and Voice actors but it doesn't really matter if you don't. It's loud and brash with lots of swearing and some sex stuff...(Pearl clutchers beware lol)\nIt is let down by cheap, 'Saturday morning cartoon' animation tbh which can be rather clunky but it's fun and silly so it's not the end of the world. It's certainly not a 10, they are just CR Stan scores. A solid 7 is fare I think.",
            "review_date": "2022-01-30"
        },
        {
            "review_title": "Good & Bloody",
            "content": "This is a good gory adult comedy. Good to just kick back, relax and watch. I highly recommend it! I hope there will be another season!These characters are hilarious but down to earth. The gore is beautifully done. The character's could use a little more lines to make it seem more than just good one liners but that's just my opinion. I'm not one for continual seasons to a descent show but I think this has potential to be some good relaxing fun.",
            "review_date": "2022-03-25"
        },
        {
            "review_title": "Divisive Humour",
            "content": "This show will likely be one of those that people will either love or hate. There will be very few reviews in between. It has that baseline crude humour which has made Rick and Morty a hit and given it a cult following.The Legend of Vox Machina ('Vox Machina') provides more of that same crude humour. There aren't any high brow, think about it for a minute before it becomes funny, jokes in here. They smack you in the face like a full diaper, pick it back up and hit you again with it.The storey of Vox Machina centres around a band of misfit adventurers that have very little going for them, who are drafted to kill a monster destroying the kingdom/realm. Are they up to the task? Probably not! However, they give it their best, and... Yeah, I'm not going to spoil it for you.You're going to have to watch the show for that. Sorry.I quite liked the animation of Vox Machina, which isn't as over the top when compared to most Japanese Anime, and isn't crude like a lot of animation done in the past 10-15 years. It's high quality, well coloured and varied.The voice acting is very good. I don't know many of the actors here, but you can tell they're getting into their characters, trying to make you believe in the story, the world and their animated lives.On a final note, Amazon have only dropped 3 episodes so far. Hopefully the show retains the current level of humour, animation and voice quality and the story progresses nicely. I'm looking forward to more.If you're one of those people who is a little high strung, is easily offended and gets annoyed when someone farts in your general direction. Don't watch this. You're not going to enjoy it. If you like Rick and Morty, The Boys or Invincible, then this is likely to be something you'll enjoy as well.",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "DND content needed this!",
            "content": "First: I am an huge critter from Germany! Normally i dont watch animated series, but with Arcane and OF COURSE The Legend of Vox Machina i am making some exceptions!IF there would be no Arcane, i would give this show an 10/10, but even as a fan i have to be realistic and an 9/10 is still STELLAR!The voiceacting is of course the best in the business, the animations are great and i know most of the story, so i know HOW AWESOME it will be.Especially the character arcs will be one of many reasons to love this show for fantasy and animated series fans.This show is what DND needed, forget these Boll movies or something like that, this is the new milestone for fantasy series with an classical DND setting. Violence, blood, dirty jokes, swear words and not holding back with \"adult stuff\"! This is not for kids and that is exactly what i wanted!I hope a lot of people outside this bubble give it a shot, it is really an really good series and the idea behind all of this are people that dont have profit in their mind, they really CARE and LOVE DND and the story/characters they have created over the years! Enjoy it!",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Tries too hard to be funny",
            "content": "Tries too hard to be funny, but the jokes are written by a 15-year-old high school boy. The characters are all eh. If you're really a fan of fantasy, you might endure it just to see the plot happen though.",
            "review_date": "2022-03-27"
        },
        {
            "review_title": "Just a fun watch",
            "content": "Plenty of Debbie downers in the user reviews still, but like many others I completey disagree that this isn't a good show. Especially with what's been available lately.",
            "review_date": "2022-02-04"
        },
        {
            "review_title": "Good dnd cartoon",
            "content": "Really good series but it didn't seem as shocking to me as it was presented to me. It is a great mix of sad, funny, epic and irreverent scenes. It is not so strange when you think that this series was born from a game of DnD. Too bad for some monsters made with bad CGI.",
            "review_date": "2022-02-06"
        },
        {
            "review_title": "Good! Not great...",
            "content": "I find IMDb so strange now days. It's often either 10/10 or 2/10 reviews, very little in between - hence why I felt I had to leave a review!I know nothing about the source material, but overall this a fun, magical, animated journey that definitely doesn't take itself too seriously.The plot is ok, the animation is good with some really satisfying gore filled moments (although occasionally let's itself down particularly some of the dragon scenes) the script constantly filled with very crude jokes, which I like! All of the characters are actually pretty great, potentially even the strongest aspect of the show.Ultimately, it's Definitely worth a watch, but it's not going to blow you away.",
            "review_date": "2023-02-03"
        },
        {
            "review_title": "Very much on brand",
            "content": "The first few episodes are a bit slow and uneven but the series really gets going once the Briarwoods arc begins. It gets progressively better with each episode.Love all the Easter eggs. The series definitely delivers on the fan service.",
            "review_date": "2022-02-05"
        },
        {
            "review_title": "Initial Impression: Somehow Already Way Over-rated",
            "content": "Come on this show is average quality plot and dialogue. If audiences didnt know who was behind making it, it wouldn't be successful at all. This is a prime example of reception based on \"what it is\" and not on \"how good it is\". The show has good animation and a great concept but the plot, characters, and dialogue are all really lacking. I was super excited for this show and have been dissappointed. So much missed potential. The show is average. In reality its not doing anything more than the average anime or animated action/comedy. People are giving the show top tier ratings because it comes from a source they really like. So much source bias in movies and tv shows.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Amazing Series",
            "content": "It's really fantastic writing, good animation and everything else is also amazing. Ofcourse this show deserves 10 stars!! I'm so excited for the next new episode :)",
            "review_date": "2022-02-02"
        },
        {
            "review_title": "Exactly what I had hoped for",
            "content": "With a cast of perfect voice actors, all characters act and behave exactly like I expected from the show.Animation is great (though I admit, not on par with Arcane)The humor is great, and the story is interesting.Spoilers:\nThe story is pretty rushed. We are talking about 20 hours on game sessions compressed into 1½ hour for the first 3 episodes. But it doesn't waste any of the time it does have.The fight scenes are great, but when Grog says: \"I...would like...to RAGE!!!\" it actually brought a tear to my eye. The end fight in episode 2 actually feels appropriately epic.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Exactly how we wanted them to do this.",
            "content": "Ok, get past episode 1.Its a somewhat rocky start but once episode 2 hits its great, and episode 3 is fantastic. I can only feel that it's going to get better and better because of the potential of this story.Great writing utilizing its source material in an exciting way while it's still condensing hours of story.The voice acting, of course, is top notch. The collected cast, including (almost) all of the original performers, and an incredible brought in supportive cast.The Animation's good, I love the renderings of these characters.But all in all, they're nailing the original chaotic energy, and the deep drama that the initial game had.Fantastic stuff.",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "Just wow",
            "content": "Last time I had such vibe from cartoon when saw Castlevania .It's pretty well written show , which has unique characters ,astonishing plot and R-rated content.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "I have not watched campaign 1",
            "content": "I deliberately avoided Vox Machina content for the pupose of being able to watch the animated series with fresh unbiased eyes, and I am enjoying EVERYTHING so far!You can tell that the voiceactors knows their characters intimately and put their heart and soul into their performance. If you have played Dungeons & Dragons (like me) you will have tons of fun recognizing spells, actions, monsters, and how unhinged the collective stotytelling can get, as well as how dramatic and emotional it suddenly can turn. The characters are flawed but compelling, which makes me look forward to how they are going to evolve together. They have distinct personalities that mesh well with each other and cause for fun interactions, which is only emphasized by the cast being close friends in real life.It has definitely earned it's R-rating (so be mindful if that is a turn-off for you!) but for me it's delightfully vulgar because it really capture the spirit of roleplaying at a table with close friends in a high fantasy setting. This is by the word's fullest meaning a LABOUR OF LOVE, and I'm so happy to watch it all come to life. I will absolutely follow this story to the end.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "A good show with an admittedly rough start",
            "content": "The idea of a \"Dungeons and Dragons\" series sounded interesting, but I was skeptical after seeing the more raunchy tone this show had adopted. At first this show had little appeal, relying heavily on the adult humor to entertain and containing little depth. However, after the first few episodes, the show improves greatly and is able to become more serious without overly relying on bad jokes. It's not a perfect show by any means, but with some character work and an excellent finale, \"The Legend of Vox Machina\" proves itself to be worthwhile show, despite some of its rough patches. A good watch if it's what you are into.",
            "review_date": "2022-03-02"
        },
        {
            "review_title": "Get past episode one.",
            "content": "The first episode isn't exactly GREAT, but episodes 2 and 3 have been solid gold and this is from somebody who has never watched Critical Role. It's a great show and I can't wait for more.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Great Fun",
            "content": "Anyone looking for a well written and brilliantly voice acted animation are in for a fun ride. This captures the fun of friends at the table playing D&D with the joy of watching an adult animation that is not worried about coloring in the lines of the cultural norm. Sit back, poor a bourbon and enjoy the show it is worth it.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Season 2 is a big improvement. S1(7.8) S2(8.9)",
            "content": "As someone who read the manga (pushes glasses up nose), I was a little disappointed with how the characters (mostly Scanlan) were portrayed in the first season. They weren't bad (except Scanlan), but they didn't feel like real characters. The source material feels like a podcast (it is) with real people who talk and have conversation. I thought the 7 main characters were were more caricatures of the people they were based on.Season 2 fixes that and is great. The plot slows down and has arcs for all of them to shine. The action is just as good (with better CGI) and there's more of it. I thought they were going to squeeze this part of the story into one season but it appears to be taking up at least half of the next season. I thought they were going to cut an arc that Scanlan went through but they executed on it well added depth to him.Anyway Season 2 is like Season 1 with deeper characters.",
            "review_date": "2023-02-12"
        },
        {
            "review_title": "Great animated show!",
            "content": "I have only watched a little of critical role, but have played a lot of d&d throughout the years.Didn't know what to expect of this show, but after watching 2 episodes, I am quite pleasently suprised! Great characters and interaction between them, the voice acting is really on point, the animations are good (not great, but good!), the story is captivating, and also a healthy mix of humor and gore.Very much looking forward to the progression of the series! Well done!",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "If you are/were ever a roleplayer, you get it. If not, YMMV",
            "content": "Within the ranks of TTRPGers there are two camps, usually. Those, like me and I suspect the majority of the playerbase, who want to have fun and not take things too seriously. Then there are those who seek to turn every session into The Lord of the Rings.Some of the best times I ever had as a TTRPGer were when my friends and I just goofed around and had fun in game. Vox Machina screams of people doing just that, much as the Critical Role campaign it comes from.Most of the negative comments seem to be from what I'll politely refer to as \"The Puritanical Brigade\" outraged by the language and humour and the notion that there might be sex in an animated show.It was never marketed as anything other than an adult-oriented show. The trailers did not shy away from showing either language, humour or gore. Yet it seems to come as a complete surprise to some people that these things are present throughout each episode.Now, in the past I have decried crass humour and the like. But that was in shows that were never meant to contain them in the first place, like the awful Shannara Chronicles for example. Vox Machina, by contrast, never offered the \"Lord of the Rings\" as the model to judge it on. It is, and always was, a bunch of friends having fun playing a role-playing game, along with all the banter, interactions and humour that come with that territory.As for the show as a show? Well the animation feels a little rough in places, but it has a style that reminds of the 80's quite strongly. It is perfectly fine, though I'd be happier if they added a few more frames here and there when the action heats up.It is impossible to fault the voice acting either, since the original voice actors from Critical Role are reprising their roles here. If they don't know how their own characters should be, then who would?Story-wise it's a familiarly simple TTRPG, session-based affair with no real surprises as to who is good and who is evil. It's not anything ground-breaking, but it is serviceable and let's be honest... you're watching more for the characters than the plot.Overall, I'm finding it fun and entertaining, much like those TTRPG sessions of old. Now all I need to do is get a T-shirt with \"I played D&D before it was cool\" on it and I'll be set!SUMMARY: Harmless roleplaying fun aimed at grown-ass adults, not ones who use the term \"potty-mouth\" to talk about language. Gamers will get more mileage out of it, especially if they, like me, have fond memories of their own gaming exploits around a table.",
            "review_date": "2022-02-06"
        },
        {
            "review_title": "Has so much potential, very excited",
            "content": "Personally I feel that the first two episodes felt a bit rushed in terms of story progression and at times the dialogue felt a bit strange. Now the negatives are over, the animation is fantastic, the story is compelling and episode 3!!! Wow episode 3 was amazing, Silas Briarwood felt menacing and was set up amazingly, Delilah was also great and am looking forward to seeing more about their story and how it ties in with the Whispering One. I am really looking forward to the rest of this series and I think it's going to be amazing.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Bumpy start but promising",
            "content": "(Episodes 1-12) Perhaps in an attempt to brace us for the show's more easy-going but graphic style, Vox Machina is initially laden with immature depictions of random violence and humor. This persists throughout much of the show, especially anytime Scanlan is in scene. But past that we are given glimpses of real backstory with potential for compelling narrative, notably where Pike and Percy are concerned, and action scenes that shape up to be quite nice during serious moments. In addition, the animations on backgrounds and the opening are worthy of attention for their beauty. For those of us who have no knowledge of Critical Role especially, It's still unlikely to become a \"masterpiece\" but, at the very least, it offers a fun and entertaining ride.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "So much potential",
            "content": "This could have been a great tv series.Unfortunately, I think it is quite uncertain about the targeted audience.There's clearly gory and bloody stuff that makes it not for kids, but at the same time, the plots and dialogs seem to have been written by a 10 years old game master....\nAlso, the comedy bites are predictable, and absolutely awful (as a 10 yo joke...) and they should definitely improve it or else, get rid of any funny stuff for a more mature and darker ambiance.All, in all, as a former Tabletop rpg player and game master, I was expecting so much from it... Eventually, this comes up as an average show that is still enjoyable but quite frustating at the same time.Lodoss war was better at its time.",
            "review_date": "2022-02-04"
        },
        {
            "review_title": "Gets better with time",
            "content": "I play RPGs and have watched some Critical Role videos before watching this.I really didn't like what I saw in the first few episodes. But I think with time they've started to learn what the sweet spot is when transforming what happened at the table to the screen.The first few episodes I would probably rate as 6/10. The pacing was bad, and scenes of unnecessary gore, nudity and bad jokes were too frequent and because of that more annoying than meaningful.It's just an entirely different thing if someone comes up with a bad joke at the table once per 3-hour session, then it is when the time is compressed for the show, and you get 5 of them per 20-minute episode.If the future seasons of the show will be more like the second half of the first season, I will be very happy.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "It's rough, but not bad.. Unless you start thinking about it.",
            "content": "Overall i enjoyed the fantasy world, adult-themed jokes, blood and all the stuff you'd rather avoid showing to kids. It felt fresh.. and gory. This review gonna have spoilers.Introduction to the world was pretty good. Tbh I got baited by the shows first scene aka Suicide Squad, where we follow 'wrong' team only to see their demise. Then we meet our \"correct\" team. Gotta say in the bar scene i did chuckle more than once, which is quite amazing achievement for a show.In all honesty I have hard time coming up with saying the good stuff. There are plenty of things there that i liked, but.. Lemme just focus on key aspects that didn't work all that much for me.Show tries to tell us that Dragons are capital B - BIG problem. It's the stuff you need an army to beat. Okay. Makes sense. In D'n'D fighting a Dragon is the finale of an adventure. In Vox machina... Killing a Dragon, Apex Predator, The Magical being with a status \"legendary badass, do not touch\" is used as an introduction to our teams teamwork. I liked how they killed the dragon.. But you simply DO NOT do that. It really wrecks with power levels. It's like Harry Potter beating Voldemort in the first book, or Luke killing his Vader and Imperator right at the start of his jedi adventure. Again, I liked HOW they killed the big winged lizard, but it's poor choice for the story.My second problem is kind of continuation of the first: Power levels. The magic powers in this world are really wonky so to speak. The biggest offenders here are Pike and Keyleth. Key' is the inexperienced adventurer/successor to elf throne (or something). And her power is inconsistent as hell. Sometimes her spells hardly do anything, while other times she's literally a walking nuke of a mage fueled by the shounen power of \"because i really want to\". It's difficult to invest in story when few spells do nothing, only to the final one making up for it by 10000x cause 'reasons'. Pike on the other hand is a paladin of sorts. Her powers also resemble drunked seismograph. They work.. Untill show decides she has faith issues... Then she's out of the team for a while only to return as a demigod spewing enough power as if she's some kind of magical dynamo of invinite power. She teleports as astral projection to different country, then she can fly, mass-enchant, mass heal, shoot lazor beams, throw light-weapons left, right and middle. And even with all that power she's only usefull untill director says \"okay, you can stop now\" and her power tap is turned off. And it's not that she loses her power. Her power simply stop being a threat. What a stellar script... If it was written by a highschooler. If you think this is cool and totally good writing, then you are the type of person that gets amazed by toothpaste advertisments and you shouldn't grade anything, cause it's beyond your mental capacity.Another thing is the world itself. It's a high fantasy world. You've got loads of races. Alot of magic and magical beings and.. Both the king and the \"army\" is as mundane as my socks. If you don't see the problem.. Imagine Fort Knoxx (a big safe full of gold in Kentucky) having its locks made out of.. lets be generous and say: paper. Oh \"but what about thieves\" you say? See, you know that thieves exist and therefore you know you need proper defenses and mechanisms to keep the gold safe. In the world of Vox Machina king has zero protections whatsoever. The guy was literally enchanted/hypnotized on a banquet WHILE EVERYONE WAS WATCHING. There should be at least 50 alarms, or 10 mage-guards turbo-vibrating getting ready to fight. But there's nothing. The army in this world is also a prop. Only to show if something is scary by showing how quickly it minces the \"army\" in gory scenes. They hold zero value on their own. Hack writing.Overall: kingdowm is a joke. Army is a joke. Sovereign isn't even a quest-giver but a teritary side-mention of least importance AKA he's pure incompetence in a form of a joke. The world is simply fake. And................ I understand why. It's all about Vox Machina adventures.. But if that's the case director should have simply removed the uneccessary bits. Remove all the unimportant things like: kingdom, king, army, royal council (which is also a bad joke). We don't need to see that. Use it only if you have a goal in mind. If it doesn't add half a sh to the world, then don't bother, cause you'll constrict yourself later. Just fcus on the team and adventure. Well.. It's too late for that now.My final of the \"this world makes no bloody sense\" problem is how nonsensical the main plot is. Long story short: one of VM members is Percy. His whole family of high-nobles has been slaughtered. Stuff like that doesn't get hushed up. Especially not when those nobles were ruling a pretty big city. Director did try to cover it with some excuse, but that was so god awful I can;t even put it into words. If we were to go by real world example: imagine country.. Lets go with USA.. where first thing you, as a prisident, learn that whole council and mayor of... New York kinda got bored and quit their job, gave it away to some random hobo. You don't get any info beyond that. Soon after the whole city closes its borders and you no longer receive any informations from it. As a president, you'd send whole damn ARMY to check what the f is going on... But out incompetent director using the power of a script made an excuse that it's fine cause we tried to send few scouts and it failed tee-hee.This whole plot would have shattered in thousand pieces if on the banquet Percy said out loud who he is and what has happend to his family and by whom, which should have caused a cascade of reactions and actions. But that is.. if the world was actually well written.Ok, so this ends up my list of \"BIG BADs\". The \"small bads\".. I'd say I have only 1. The character of Grog. I don't have anything against Drax ripoffs. But this one was just.. His dialogue and \"i am very simple barbarian\" way of talking was mishandled. Not to mention the voice actor just doesn't fit the person in my opinion. But VA voice is the smallest problem here. Overall Grogs way of talking was fake as hell and it felt like someone scraping a knife on the plate whenever there was some banter.On the \"so good I need to mention it\" list we have Voice Actors of Vex and Vax. Amazing job. They are pros. And whatever they get paid I can say one thing: it definitely was not enough. Then we have whole character of Scanlan. Also quite interesting. Rest kinda existed and thats the best i can say about them. Sorry.---Should you watch it? It's a decent show. I liked it and i dont regret spending around 3 hours on it. If you can tune out logic it gets alot better. Although saying \"after lobotomy this show gets really good!\" is a very low crap-bar. Director is a newbie at his job and it shows. And if he's not a newbie, but a veteran... Then I don't think he should be anywhere near directors seat.If you like gore, adult jokes (of varying heights.. and lows) with decent'ish-at-best western animation.. Go ahead and watch it :)",
            "review_date": "2022-02-28"
        },
        {
            "review_title": "Story has potential, dialogue holds it back.",
            "content": "I am not someone who is familar with Crtical Role but have taken apart of D&D campaigns at times and watched D&D shows/podcasts.Legend of Vox Machina opens with 3 episodes that right away can help you decide if the show is for you or not. The animation and fantasy story are pretty well done but the dialogue between characters is quite poor. I can see in a live environment the lewd jokes being made so often landing well, but in a show envirornment it misses a lot more than it hits and almost caused me go turn it off a few times.The show isn't a top quality project, but it isn't trying to be. Its a passable time killer.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "The few that are complaining please sit down",
            "content": "The people complaining about swearing and violence are either kidding themselves, have never watched anything r rated, never watched Invincible, or just want to seem cool and special compared to everyone else. For all of you that think any of the above, please sit down, this show isn't for you. If however, you want great animation, stellar voice acting, a really intriguing story that both adheres to and subverts standard fantasy tropes then welcom new critter and enjoy the fun, dark, irreverent ride.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Brilliant animation",
            "content": "I love traditional hand drawn animation (as opposed to CGI, which in general I hate). This show has some of the most beautiful, dynamic animation I've seen. It's amazing. Okay, its not on a par with Ghost In The Shell 1 and 2 or Studio Ghibli, but what is. It's still incredible. The opening credits sequence is great, and it really sets the tone. If you like very raunchy humour, which I do, there are some laughs in this show. If not, it might not be for you. The story is varied and interesting, and there are some great and memorable villains in here. I think this would make an excellent video game, preferably 2D action, or even a 2D side scrolling beat em up, where you get to choose from, or switch between the seven heroes. The cast of villains would make for great end of level bosses. While on the subject of the heroes, they are varied, and every one is memorable. The episodes are about 25 minutes long, which is a perfect length in my opinion, and there are 10 of them, so not too much to get through. If you like animation and raunchy adult humour, coupled with an adventure, check it out. It's quite a lot better than the massively overrated Castlevania, and as an added bonus, it's not woke, at all. Highly recommended, for the right audience.",
            "review_date": "2022-03-04"
        },
        {
            "review_title": "Bring on season 3 please!",
            "content": "This is animation done right. Excellent character design and development with just enough backstory given to each of the main protagonists. Gorgeous backgrounds and color schematics used throughout the show, high level of detail and that matches the world building perfectly wherever the scenes head. Absolutely masterfully crafted. Hilarious dialogue that keeps things light but can turn on the drama when needed. It was hard to imagine the second season being better than the first but I was thrilled to see it was indeed better. The only problem I have with this show is that each season is to damn short! Really hope we get a season 3 to wrap up the nail biter ending from season 2!",
            "review_date": "2023-02-17"
        },
        {
            "review_title": "A lot of Fun",
            "content": "Season 2 was more enjoyable - I really want to see season 3. Well done to the creators.This was done last year:\nI realised that I hadn't reviewed this until now, when you compare it to anime, its quite lame but when compared to animation(by the way a big difference from anime) its great fun and love the development between the characters, but if you are looking for a deep storyline and meaningful interaction it is shallow. Don't get me wrong they do try.But if you want a night of vegetating and nothing too serious. This is it.The accents can be annoying. But honestly I had to give it a 8 as I do hope to see more of it. Just because of the short guy who is hilarious and probably the best thing in it.",
            "review_date": "2022-09-16"
        },
        {
            "review_title": "Ignore the haters",
            "content": "A lot of these fools who keep giving it a low rating have no idea how much work and time it took to make, not only the show, but also the source material. Countless hours upon hours of people making these grand stories and characters. To see it come to life in animation is glorious!I swear, most of the people giving low reviews would look at the Mona Lisa and say \"so what? What's the big deal? If it wasnt made by a famous guy then no one would like it.\" Without any idea of the effort that went into such a task.Please ignore them. Try the show. If it's not your cup of tea, then luckily there's lots of other stuff to watch.Thank you for reading.",
            "review_date": "2022-02-05"
        },
        {
            "review_title": "Questionable writing",
            "content": "So it's inspired by D&D, I never played but I know enough from nerd culture to understand the concept and amazing job on the artwork and character design.I'm finding it difficult to find reasons to like these characters, from the get-go you gave us this illusion of strong characters, from the way that they're designed and the way they behaved. But the more I watch, there's no substance. Some characters are extremely stereotypical, others are so boring you start to wonder why are they main characters.A lot of the writing makes me think there is something that I'm missing or that I don't understand. Even when they were attacked where some of them seemed like they died, I did not care, I was not rooting for them or against them, just watching in boredom and indifference, so I blame the writing more than anything.What kind of writing is this! Two slit throats one after the other, two spitting one after the other, and so many moments like that, where it loses its effect because of repetition of the same concept in the same episode or even sometimes in the next episodeAnd it's not that the characters are not likable, they are \"Misfits\". I love the concept of Misfits, but these are boring one dimensional misfits.",
            "review_date": "2022-03-28"
        },
        {
            "review_title": "Avatar and Pulp Fiction had a Baby",
            "content": "Complaints of childish humor and filthy language are spot on. Nudity is done in whatever the opposite of tasteful is.I play D&D occasionally.I've never heard of the pod cast before this.The show is brilliant entertainment in the same mode as Archer. It goes out of its way to be offensive.If you want to laugh out loud for 20 minutes and walk away having forgotten the real world for a bit. It's worth a watch.",
            "review_date": "2022-02-02"
        },
        {
            "review_title": "Vox is for your pre-teens",
            "content": "\"The Legend of Vox Machina\" (S01, 12 eps, 1/2hr, Amazon) is a slickly produced animated series that reminds one of \"Castlevania\", however, though the show centers on teen characters I think the story is really kiddie-oriented, it's a real letdown. It's full of stereotypes, clichés, and it's predictable - just the right mix of elements for your pre-teen. I really wanted to like this, especially since Covid has brought us so much stinking messes of films and series, but this didn't break through for me, just more of the same type of wasted effort as so many others.",
            "review_date": "2022-03-24"
        },
        {
            "review_title": "The heroes of Vox Machina... and a walking dick joke.",
            "content": "I REALLY want to like this show, and a lot of it is really good, but after 9 episodes I absolutely cannot stand Scanlan and think the character drags down the entire production.In the original streamed Campaign he has his share of sex jokes, innuendo and low brow humor, but ultimately the character is much more nuanced than that and there's actual depth and humanity to him.In this adaptation he's a walking dick joke with a sprinkle of toilet humor and that's literally it. It's a shame because other characters, particularly Pike, Percy and Keyleth so far, have really been given depth and development that adds to what they were in the OG campaign and there's some really moving scenes. Pike's development and story has been absolutely masterful and could not be more antithetical to the completely one dimensional Scanlan of this series.The animation itself is incredible, as are the rest of the cast, full time members and guests. Certainly there is plenty of crude humor in the live streams, but in the scope of the entire campaigns so far, it's not the unending steam that the animated series has chosen to embrace so fully., and some of it is funny and it has its place, but too much feels forced here.The OG characters are all incredible as are the folks voicing them and they are all ridiculously talented and capable of creating tension, drama, tender moments and laughs without having to go for the low hanging fruit/base humor for every single laugh.I hope Scanlan evolves into more in future seasons, but honestly this just really makes me want a Mighty Nein adaptation so much more instead.",
            "review_date": "2022-02-11"
        },
        {
            "review_title": "Adequate fantasy show",
            "content": "I will preface this review by saying I do not watch any of critical role's podcasts but still managed to finish and enjoy this series. However, there is no way this show deserves a 9 or 10, maybe if you are a long time cr fan and you've already watched this adventure in their podcast form, you were able to get more nuances as to the characters relationships and find little easter eggs in the show that made you go \"YAY! There's the thing that i know from the podcast!\" But, for everyone else, there are certain dialogues and scenes that are unnecessary and thrown in there purely for fan service.However, all that being said the journey that the heroes take was very entertaining and kept me watching for all 12 episodes, but again gets ruined by the absolutely unsatisfying ending! I was really disappointed by how the villains were built up for like 9 episodes and then for them to have little or no impact at the end. Maybe season 2 will change all that, however, the way the villains died were so lame; and then immediately we were thrust into another conflict right at the end, it was so absurdly abrupt. This probably worked very well in the podcasts but it does not work here.Now, the show wasn't all terrible, i really enjoyed the middle part of the story, especially episodes 6-10, there were some great and tense moments there. And going into the final 2 episodes i had the show at a 7 or 7.5 even! So even though the ending was unsatisfying, i still would recommend this show to anyone who enjoys fantasy.My rating system is based on the scale where 5/10 is considered an average show, it's a show that's fine but doesn't do anything unique but is still enjoyable, so a 6/10 is above average for me, and that's what this show is to me, it is slightly above average.",
            "review_date": "2022-02-20"
        },
        {
            "review_title": "You know what?",
            "content": "For Last times told you how much say bad language such as.even kept saw a lot of Killed, Which has also characters. Well That is so pretty good and I hope we enjoy the new series!",
            "review_date": "2022-01-31"
        },
        {
            "review_title": "Lived up to the hype!",
            "content": "Really a fantastic show. A perfect representation of the tabletop rpg experience. It very much kept the \"feeling\" of the Livestream the show is based on. Only the first three episodes are out now, but reviewers who were able to see the first six say it only gets better from here! Can't wait.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "I can't recommend it highly enough - just breathtaking!",
            "content": "The terror was real -the stakes were made very clear within the first 5 minutes and only got scarier as time when on. The world is expansive, rich in detailed lore, and so wonderfully animated that the dragons inspire actual awe - as all beautiful and terrifying things do. The voicing acting is breathtaking - Groon will lull you to sleep while Thordak will scare you back out of bed. It's grim and funny and heart-wrenching in rapid succession. The characters' stories begin to unfold as their determination and desperation grow to new heights. I highly recommend to any adult who likes high fantasy with a little kink.",
            "review_date": "2023-01-21"
        },
        {
            "review_title": "Best D&D show since Dungeons and Dragons cartoon from the 80's!",
            "content": "I am really enjoying watching this show! Hope it keeps up the entertainment. I wasn't too sure at first since there have been so many failed movie attempts but they really pulled off a good show. I suppose because they are actually D&D players too.",
            "review_date": "2022-02-05"
        },
        {
            "review_title": "Incredible!",
            "content": "Not only is this show fun and entertaining to watch, but the writing is also fantastic! The story has so much depth to it, something that doesn't seem like it was overlooked because it's animated. You can tell this show was a labor of love and tremendous amounts of thought went into the creation. The show recommends 16+, but I would say that's a stretch. 18+ is more realistic. Highly recommend!",
            "review_date": "2022-02-15"
        },
        {
            "review_title": "MORE!",
            "content": "It's everything I wanted! I just want more. MORE! Please people at Amazon or whatever, throw money at this so we get even more seasons and maybe even another show for Campaign 2! THANK YOU CR!! <3.",
            "review_date": "2022-02-05"
        },
        {
            "review_title": "Immature Adult Humour hurts the show",
            "content": "Overall not bad. Give it a 6 out of 10. Enough here to make me check out the next 3 episodes.Worst part of the show is the Humour. It seems to me as Adult Humour written by a 13 year old. I find it a bit cringy and of putting at times. Where the show works is when they have to get together to and do something. Looking out for each other as a team to help fight the enemy is where this show is strongest.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Critical Role without the pretense",
            "content": "Do you like the TTRPG vibe and storytelling method? The distinctive way the protagonists are introduced and their backstories intertwine with the plot? The tropes and stereotypes of DnD, as well as this unshakable feeling characters have an OOC train of thought?Hate how Critical Role is bloated with the pretend rolling, too much TT and not enough RP?This is the show for you. No people sitting around a table, only their fantasy.Well animated, too.",
            "review_date": "2022-02-20"
        },
        {
            "review_title": "A fun romp that doesn't take itself too serious",
            "content": "There are so many films and shows in this genre that take themselves way to seriously. This isn't one. From ball-tag to the back-and-forth quips that remind me of my brother and I, it keeps you entertained. That said, there is a rather serious quest involved and decent story telling. It hits the rocks a couple times and that halfling is a touch much from time to time, but the characters are well formed and consistent, the musical score adds to the story and ambiance (unlike Willow) and the balance between serious story telling and inane humor is well struck. I honestly can't wait for Season 2.",
            "review_date": "2023-01-11"
        },
        {
            "review_title": "Good stuff",
            "content": "I love it!Intriguing plot with great characters that does not take themselves seriously at all, R rated humor and tons of fun.Fantasy world at its best.",
            "review_date": "2022-02-11"
        },
        {
            "review_title": "A must watch!",
            "content": "The legend of vox machina is a truly amazing show and a must watch for anyone remotely interested in fantasy or even if you're not I recommend it! Great storytelling, great dialogue, wonderful characters and villains, great animation and action. What more could you want? There's depth to their heroes and villains. There's growth. There's comradery and conflict. Humor and darkness and violence and more! You get to know and like these characters and understand who they are. This show is an adaption of a D and D campaign by the very voice actors themselves but you dont need to have watched it or even play D and D to understand it or keep up or anything. It's an engaging show start to finish and you won't be disappointed!",
            "review_date": "2023-01-17"
        },
        {
            "review_title": "Excellent Show!",
            "content": "I am currently re-watching the first season and I like it more the second time. Please don't change a thing. Keep the writers they are doing a wonderful job. I say that as there have been other good shows and they swap a writer and it goes south quick. It refreshing to watch a show that isn't WOKE. Unlike some of the other animated shows this one you can really get into. By that I mean you get into the story and before you realize it the episode it over, where as others (Dragon Prince) I am looking at the clock waiting for it to be done. Or the aweful Dragon Age Absolution which has a list of issues. Amazon you have a hit here, don't screw it up.",
            "review_date": "2023-01-26"
        },
        {
            "review_title": "Just amazing. Enough said",
            "content": "It has character, storyline, originality, light-heartedness, epic battles and climactic endings. This is just an amazing show.Another plus is that it's very rewatchable because of how intricate the storyline gets, and each character really has standalone qualities. Scandling (spelling?) could have his own spinoff series hands down. 👏",
            "review_date": "2022-02-21"
        },
        {
            "review_title": "I was a casual watcher of Critical Role, so far, so good.",
            "content": "My son started me watching CR. I wouldn't normally have watched a bunch of guys playing D&D, but I recognized so many of the voice actors that I had to watch. I don't think I watched closely enough to know the story as well as my son does, so the story is fresh for me and I still get to enjoy Laura, Travis and Liam doing what they love. Lots of fun!",
            "review_date": "2022-01-30"
        },
        {
            "review_title": "Something different!",
            "content": "The story is nice, I like the adult profile that to my criteria give some realism to the fantasy. The parody in the very intro of the show is funny and screams: this is not yet another LOTR tale, and also warn you about the graphic nature of the story.By the way the story is at the end something you expect in a fantasy show, I mean is not bad is something you expect and likes in this kind of shows.The drawings and scenarios are outstanding and beautiful, the characters also looks so cool and some has original powers, however as I'm very used to anime, I found the animation little rude or rigid. Some action scenes are just impressive but some simple scenes like people walking remind me old bad cartoons from my youth.I general I like it but I was expecting better relationships between the characters.",
            "review_date": "2022-02-24"
        },
        {
            "review_title": "Fantastic",
            "content": "The cast and crew of Critical Role poured there love into this series and while it is animation, its done well and passionately enough that long time fans as well as new comers to the genre can enjoy it alike.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "So So",
            "content": "It seems a Suicide Squad in a fantasy world. I couldn't really get interested in the characters, least of all Scalan, an annoying and arrogant brat who thinks everything is about sex.",
            "review_date": "2022-02-28"
        },
        {
            "review_title": "Totally Unexpected",
            "content": "I passed this over on Prime for months thinking it was just another crappy low budget DnD cash grab. Those never really work well outside of games. Wow was I wrong.Now mind you I am not saying this is a masterpiece. Not really. There is still a lot of tongue in cheek moments and shameless homage (aka copying) going on here. There is really nothing new in terms of character design, story or what have you but it was, simply put, very well made. Sometimes you dont need to invent something new. Sometime you just need to put it together well and thats what they did here.They glued DnD together, as varied and disjoint as it can be, and made it work. The major RPG classes were presented in a funny, campy way that made it more enjoyable than I thought it would be. Dialog was fun at times, action was good, we had dark humor here and there and though there were boring parts and constipated characters (clerics... lol), it just worked. Quick warning, this is not a show for kids. Im not going to be showing this to my 7 year old.Im looking forward to season 2.",
            "review_date": "2022-05-30"
        },
        {
            "review_title": "Amazon was at it's prime wen dey cooked up this idea, from om 1 legend to another",
            "content": "Every moment was worth every episode of the show, words can't seem to find a fitting description for this cause it blew me off the planet, talk about character role playing voice and every element this was on a whole new level of entertainment.AMAZON you have my thoughts, you really did it.",
            "review_date": "2022-02-20"
        },
        {
            "review_title": "Overrated but fun.",
            "content": "Everyone marking 10 stars is blinded by the excitement of this series existing at all. Yes, it's a fun series with great dialog and well done animation. Yes, it's a unique series that will have an amazing place among other cartoons and possibly pave the way for more D&D content. But it's not perfect. Like all works made for a specific audience, it focuses on gaining views through fanservice rather than solid quality.Why does Vex seek information about dragons from a magic items dealer when she herself said she's an expert on them? To introduce Gilmore for no reason other than to make a cameo appearance, of course.Why does Uriel hire Vox Machina as the exclusive protectors of Emon after a single task they were lucky to complete? To set up the series without all the adventures in the original story to back it up.Why does Grog yell \"I would like to rage\" out loud? Because that was his player's catch phrase in the game of Critical Role. Think about how absurd of a battle cry that would be for an actual fighter in a fantasy universe to say in character. It's like Keyleth yelling \"I would like to cast call lightning on the dragon!\"I'm sure this show will be enjoyable for critters all the way through, myself included, but objectively people have to realize it's not a 10-star show. It's contrived for the fans who backed the Kickstarter and not for general audiences, and I guess we'll see if that's enough to keep it alive.",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "Amazing",
            "content": "I've listened to critical role in the podcast format for years and was excited for this show. The first season was good, not mind blowing but a solid show and very enjoyable, but maybe a little forgettable and generic. Now maybe I feel that way because I already know what's going to happen and am familiar with the story. However season 2 is absolutely outstanding. Even though I already knew most of what was going to happen the way the material was presented and the beautiful way they animated each scene actually surprised me. Normally when something is left up to my imagination the actual final visualization pales in comparison, not this time. If your thinking about watching I highly recommend you stick around until season 2, I think you'll find it worth it.",
            "review_date": "2023-01-31"
        },
        {
            "review_title": "Blows away my expectations!!!",
            "content": "I'll admit, it starts a little slow with the first episode, but by the third, DAMN!!! Sylas and Delilah Briarwood are cunning and beautifully designed, and I love them so far as villains!!! I also loved seeing a bit of Percival's backstory at the beginning of episode 3. It's truly amazing seeing all the love put into this show.Even with the 20 minute episodes, they manage to cram a good amount of plot, dialogue, and action into each episode. This show is stunning visually, and ofc with an amazing cast! I'm very exited to see what they have in store for this show!!!",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Gee dang!",
            "content": "So far this has been great. I love the show and the podcast. I may be a little bias because I know how much heart and soul has been put in this series. Can't wait for more!",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Definitley a good one",
            "content": "I have never ever heard of Vox Machina or Critical Role. The only that drew me here is that I love animation especially aimed at mature crowd age. And I am far from disappointed I really liked it ! First invincible now this.The only small bit is that the story is a bit less mature, seems to be written by an in between teenager and an adult. But barring that aside great show.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "Un-freaking-believable",
            "content": "This is sheer perfection. The world has been changed today, in the best way possible. Adaptations are often hit or miss. This sunk my battleship. This should never, ever, ever be canceled.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Above Average",
            "content": "Second season just finished and my review hasn't changed much. A lot of fetch quests and strange storytelling for a series until you remember is all based on D&D campaigns, so the weird pacing somewhat makes sense. A new adult animated series on Amazon Prime created by Matt Mercer and his group Critical Role. I've followed Critical Role through Twitch for a good while now and I hadn't actually realized this series was based on those old D&D campaigns until recently, so of course I immediately decided to give it a watch. For those that don't know, Critical Role is a group of very fantastic voice actors in the film/tv/video game industries who all play D&D (and other games) live streamed on Twitch.tv. Matt Mercer stars as the dungeon master and uses his incredible story telling talents (and voice acting) to bring massive worlds to life. This new series, The Legend of Vox Machina, is an animated series following the first D&D campaign of that group as they team up to take down evil wizards, fight dragons, and save the city. Being created and starring the group that it does the voice acting is of course superb, and the humour brings over the same banter and quick wittedness the group has always offered; lots of f-bombs, farting, and chopping off heads. For anyone who at this point is at all interested in what I've said so far, I would say check this out, its only a single season so far so is fairly short, and was very entertaining the whole way through. It's sort of an Invincible but for a D&D based fantasy world. All that said, the general plotlines and backstories (which they are sure to rush through a bit for every character) aren't told incredibly deeply and often fit some pretty basic tropes of everyones first D&D campaign. That being said throughout the series you can almost imagine the real world group of players above the table, something that can either bring its own charm to the series or the opposite leave a bit of a narrative distaste when things fall a bit flat. In terms of \"ragtag group of adventurers going off to save the world\" series I've watched recently I'd have to say Andor > Willow > The Legend of Vox Machina > Dragon Age: Absolution > Witcher: Blood Origin, if that helps see about where it sits. It has its moments and was fun, almost as good as the 1983 Dungeons & Dragons animated series. Long live Venger!",
            "review_date": "2022-06-07"
        },
        {
            "review_title": "You get exactly what you expect",
            "content": "If you are a CR fan you get exactly what you expect. Nothing more nothing less. I do think the show suffers from the fast pacing though and if you are not familiar with the characters from CR you do not really have time to get to know them. It is a love letter to the fans but not as great as Arcane was. Still great though.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "The characters make the show, so it's good that it's all about them.",
            "content": "First off, I know about critical role and I've watched a good chunk of their 2nd campaign; so I have an idea of how this works. It's a DnD campaign, but select parts of it since animating the whole thing would have required 100+ episodes. This show is literally a dream come true for any DnD group. But since I have no prior knowledge of the 1st campaign this series is based on, I'm also not too blinded by expectations.The show is basically about an unlikely party of adventures doing DnD stuff. As this show doesn't cover any sort of back story of how they met, we're left to either speculate or watch the streams of the campaign. But even though we don't get any of that, the group is extremely fun and charming to watch. The show's humor is extremely ranchy and juvenile, and I love it. This is exactly how DnD games are: everyone just having fun with their characters and making the occasional dick joke then actually doing the objective if they have the time.The chemistry between characters also feels very natural, despite me not knowing much about their relationships besides the two siblings Vex and Vax. You can see the different levels of intimacy between different members. From the budding love between Keyleth and Vax, the close friendship between Grog and Pike, and a bunch of other more subtle dynamics. It's all very well rounded.The other characters aren't anything special, unfortunately. Other than the main villians of the Briarwoods, all the other characters are little more than props, comic relief, or flashy roadblocks. What I mean is, none of them are very interesting. Just their interactions with the party bring about interest.As for the plot, it's serviceable. The world building feels slightly phoned in, though. With the whole thing just feeling like a generic fantasy setting. Lots of the details on the Kingdom don't make sense if you think about it, too.Luckily, most of the plot involves a main character's backstory so it kept me engaged since this party was the only thing I really cared about in the show. It had many clichés, but I didn't find myself hating it since the whole adventure was still a joy to watch. The best parts were when the party needed to solve some sort of immediate problem and seeing how they did it was always hilarious and fun.The show probably isn't for everyone. I've seen many reviews bemoan the humor and the ranchiness, and I can see some people not being into it. All I know is that it, combined with the charm of the main cast, were the highlights. Even though the side characters and world building were pretty bad, it didn't matter to me since most of the show revolved around its best parts, Vox Machina.",
            "review_date": "2022-03-02"
        },
        {
            "review_title": "One of the best shows ever made!",
            "content": "It's just amazing!Great humor, great voice acting, the animations and story is on point AF!Just can't think of ways to improve it ..so it's a 10/10 for me!",
            "review_date": "2022-07-21"
        },
        {
            "review_title": "Perfect",
            "content": "Episode 1 and 2 were a great set up and the 3rd showed what the season would look like. Compelling dialogue, amazing animation and perfect voice acting.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Must watch",
            "content": "If you like animated series for adults, I recommend you to watch this tv show. A lot of violence and funny moments that make it a very good tv show. A lot of fantasy in a very violent environment.",
            "review_date": "2022-03-02"
        },
        {
            "review_title": "This makes me sooooo HAPPY!",
            "content": "This has the feeling of a really great Saturday morning cartoon that you used to watch, brought through time, and made for adults. I loved this. Its corny and rude and i loved every second of it!",
            "review_date": "2022-05-27"
        },
        {
            "review_title": "A Promising Beginning and a Decent Show",
            "content": "The Legend of the Vox Machina is (as of the first three episodes) an authentic Critical Role series distilled into a half-hour of animation. It is crass, it is raunchy, it is violent, and it is grim. The trailers truly do not prepare you for the level of adult content in this series, and it does this well.I will admit, it will not be everyone's cup of tea. You will know if you want to continue by the end of the third episode, but I do implore that you watch it to the third episode. The first episode is very crass and raunchy. The second episode is very violent. Episode three, however, shows the true heart of the series once all the characters are introduced.Critical Role, and The Legend of the Vox Machina, are very character focused stories. Yes, there are grand plots surrounding them, but it is the characters that are the focus. And the characters are fun, charming, and engaging. Of course they are. The original 'script' was 'written' by a bunch of trained actors enjoying It is a bunch of actors who are also friends doing improve for four or so hours. So, when it came time to actually perform as these characters outside of the sessions, they had already played these characters for literal days' worth of time. 450 or so hours.Now, yes. There are issues. Episode one is a bit heavy on the crassness and the raunchy. Some of the writing is heavy handed in episode two. Despite this, it feels less like a consistent part of the series and more early installment weirdness or growing pains.It is a good series, and if it sounds like something you might enjoy, I do recommend it. The animation is beautiful, the character design incredible. The fight scenes are the complete opposite of half-done, and it is just a fun ride.For those Critters out there wondering how the series handles the source material, I will say that there are a lot of changes. How we meet the Vox Machina in the original streams verses when we meet them in the series. A lot had to be streamlined and a lot of fat cut, and I feel that these decisions were justified and best for the show.There was so much to the pre-streams that we missed. So much story, so much character, that starting in medias res would be confusion, and the audience would have to play catch up just to understand the history. Not only that, but the actual plot of the season starts 24 episodes into the original stream. Simplifying things makes it easier to consume and easier for new people to engage with the characters and story.Don't go into this expecting a perfect recreation of the episodes. It's simply not possible, not realistic, and utterly unfair to the hard work and passion poured into this show. Go into it with an open mind and enjoy the ride.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "You'd think D&D fans would demand more",
            "content": "Yes, it is crude and purile. BUT animation can be crude AND still be funny, if there is some intelligence to the writing. (Archer being a prime example.) Vox, however, is just... stupid. After three episodes, there is nothing remotely smart, clever or compelling. At best, there are brief glimpses of promise or the momentary alure of mystery that only heightens the inevitable disappointment. This seems like a (poorly-crafted) insult to the D&D community. A swing and a huge miss so far. (And on no planet does this pile of mediocrity warrant a 9 on IMDB.)",
            "review_date": "2022-01-31"
        },
        {
            "review_title": "Hilarious",
            "content": "I laughed through every episode of season one. Vox Machina is a riff on every fantasy series from LOTR to GoT; yet, it creates a fairly grounded world that is fresh and new. The animation serves the humor well, so if you like adult animation series this will be right up your alley. This a a perfect show for binging on weekend as there are not that many episodes. I am looking forward to season two.",
            "review_date": "2022-06-23"
        },
        {
            "review_title": "It's not big or clever",
            "content": "I like swearing . But this program swears like a 10 year old that's just discovered swearing . Theres no nuance ,it's not clever . It's just spray the word F+ck into every sentence . It makes every character come across as as one dimensional idiots that defining characteristic is that they swear a lot . The rest of the plot is drowned by it .You don't have to swear In every sentence to entertain adults or to prove you are for adult viewers . In fact much like the 12 year old that things swearing makes them sound grown up it has the opposite effect.",
            "review_date": "2022-02-08"
        },
        {
            "review_title": "Got better",
            "content": "I'm not a big fan of violence/cursing/potty humor/unnecessary crude behavior, and I was very unsure for the first half of the first episode, but things got better from there! Yes, some of the childish behaviour stays, but that's how the cast played it originally, so I can live with that. And the story really gets going in episode 3.until then, it's a liytle world and character buildingy, but considering the episodes are so short, it's not a problem.Looking forward to more!",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Reminds me of University AD&D club",
            "content": "Endless evenings as a student in the 90s playing AD&D with my friends fueled by beer, tobacco and wotnot with a brilliant DM and a group of hilarious players. This show takes me right back and is all the better for being aimed at adults. Gone are tedious child friendly clichés and instead snappy writing, jokes, classic AD&D characters, monsters, villains & stories with little nods and winks to keep you smiling.More please.Vox Machina is strictly for adults and if you are one and this show still upsets you then other, tamer, shows are available. Try Peppa Pig.",
            "review_date": "2022-02-04"
        },
        {
            "review_title": "Exactly what I was hoping for!",
            "content": "After watching campaign 1 and getting to know these characters for so long, this show is bang on! Probably too much to hope for, but I would love to see the show run the full plot of campaign 1.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Seems like they try to hard.",
            "content": "Everything tries so gosh darn hard to be cool, edgy and funny. That nothing is actually cool, edgy or funny.Seems like a cartoon that doesn't know what to be, 6 episodes in and it's quite boring. Mediocre animation but the voicework is good.Seems a lot of fanboys are giving 10's........imagine giving a 10 after a few episodes in.......fanboys ruin things.But it's all kind of mediocre right now, hope it will get better.",
            "review_date": "2022-02-06"
        },
        {
            "review_title": "A satisfying fantasy adventure adaptation",
            "content": "I'm a big fan of Critical Role. Everyone in the cast and crew, and guests, have a history of putting together a terrifically entertaining show, and churning out excellent fantasy storytelling. On a personal level, CR helped to get me through a dark period in my life, as has been true for many others. All the same, I think I have enough distance from the fandom to maintain a broader perspective on the company and everything they produce - and that also means 'The legend of Vox Machina,' perhaps their most ambitious endeavor since Critical Role's humble beginnings in 2015. What I see (in the first season) is a satisfying rendition of one of the most beloved story arcs of CR's first campaign, and of an additional story that took place before the stream began. I won't say that it's perfect - it's not - but I deeply admire the strong effort, and I think it's sufficiently well made that established fans, and viewers unfamiliar with the source material, can all enjoy the animated version.The extensive cast of LOVM is a treasure. Everyone that reprises their roles from the live stream show is a joy, of course - all professional voice actors, and it shows as they bring gratifying spirit and weight and to their performances as the adventuring party. Meanwhile, the list of people attached to fill supporting parts is flat-out impressive. It's a bit sad that not all are given the opportunity to truly illustrate their talents with the dialogue they are given, but all nonetheless turn in (thusly limited) portrayals that bring the characters to life and give a hint of their greater skill set. Among that supporting cast, Grey Griffin stands out above the others for an exceptional contribution: Delilah is as complex as she is villainous, and the venomous fire and gravity that Griffin brings to the part outshines everyone else who spent time in the (any) booth. Practiced as all are, hats off to veteran voice actor and director Mary Elizabeth McGlynn, herself a guest on CR many times over, for her guidance in realizing a story she knows so well.The animation is truly top-notch, as audiences have come to expect of Titmouse. The production here plainly recalls the fluid, natural, action-oriented style of the studio's most dynamic work, yet perhaps with a refined edge that shows not just the extraordinary budget that the whole operation had to work with, but the development of skills over many years - and, of course, the approach best suiting an epic fantasy story. The visualization of characters and settings previously seen only in our imagination, or in fan art or cosplay, are given beautiful, vivid form befitting the grandiosity of the tale imparted through Critical Role, but also of the genre at large. And when it comes to rapid movement, spellcasting, combat, blood and gore, and so on - I admit I don't tend to watch many cartoons, but I have a hard time believing that what we see here isn't representative of some of the very best to be found in 2022. This is a marvelous feast for the eyes, and with a core focus on horror violence for much of the first season, the visions before us are very satisfying for how unsettling they are.I think it's worth noting, though - as wonderful as the casting, voice work, and animation are, frankly the high quality was a foregone conclusion. There was no chance these aspects wouldn't dazzle, especially with the people involved. Of greater interest to me generally, and I think more important to assess here specifically, is the writing. How is the story? How is the adaptation of the saga fans know in such detail? Is this a series that can appeal to newcomers while still sating the hordes of \"critters\" that enthusiastically devour all the lore and content that CR, their collaborators, and fellow fans can serve up?Everyone in the writers' room had an immense task before them. Each episode of Critical Role, as a stream of a Dungeons & Dragons campaign, is anywhere from 3-5 hours long on average; a single combat encounter, seconds or minutes long in-game, may well last 1-2 hours in real time, or more. The Briarwood arc that constitutes 10 of the 12 half-hour episodes in the first season of 'The legend of Vox Machina' played out in about a dozen episodes on the stream. Shrinking that ponderous volume of story into a handful of hours of animation, adapting it for critters and uninitiated viewers alike, and doing so while keeping the heart of the narrative intact, was honestly an unenviable, daunting undertaking.Much more so than not, I think the writing team very well succeed in conjuring a satisfying rendition of these tales. Though I repeat myself, it's \"critical\" to remember that this is an adaptation: some beats and characters are effectively unchanged, while others are expanded or diminished in their significance or personality. Some facets and story beats are truncated, while others are omitted outright, or altered in favor of a new twist that better serves the format of a 30-minute cartoon. Some of the changes are less stimulating than the original presentation on the D&D live stream - while others are if not better, then at least just as delightfully electrifying. Without betraying spoilers, I think in particular of an encounter that the party has at their home before setting out to settle business with the Briarwoods. What we got on the game's stream was great - and though LOVM's take is different, in its own way it's equally awe-inspiring in the least, and certainly more viscerally horrifying.By and large, I think 'The legend of Vox Machina' is a tremendous endeavor that has paid off handsomely. Yet it's not without shortcomings. One does one's best to put aside the above-game shenanigans that have lent considerably to Critical Role's skyrocketing popularity from its very inception, and even the smaller moments to play out in-game apart from the core story arc. And still there is so much content we got in the streaming campaign that is sorely missed in this adaptation. I don't even mean specific proper nouns of the story - but rather, perhaps more substantially: the full emotional weight, the impact; the thrills, the dark dread, the utmost horror, the uncertainty, the tragedy, the love, the triumph, the pride. What shades of these notions LOVM delivers are mostly just that - shades, mere slivers of not just what we got in the live stream, but of what storytelling as an art form should convey. Furthermore, with rare exception, the cutting complexity of the characters has been reduced to a decidedly simplified interpretation that struggles to spark the imagination. Some character traits, character development, interactions between characters (the principles in particular), and some story beats have been both condensed and amplified to an extent that is unmistakably artificial and forced (e.g. Keyleth's growth; Vex's haughtiness; a budding relationship). And while as a fan of Critical Role it's hard not to smile at small references to other moments that canonically took place elsewhere in the story of Vox Machina, or in the story of The Mighty Nein in the stream's second campaign - I'm just not sure that these are always woven in organically, or convincingly.I think my criticism boils down to two points. Firstly, in trying to adapt and open the saga to the widest possible audience, the writing scales down every aspect of the storytelling, yet in so doing tips its hand too far and trims away some of those very elements of what makes the tale of these ragtag adventurers so endearing and rewarding in the first place. And secondly, to some measure, LOVM feels purely like fan service. I believe LOVM would be entertaining and worthwhile for a CR neophyte, but the necessary abridgement of the narrative extends to the characters that are a part of it, and the feelings that it should stir in us. However much 'The legend of Vox Machina' may be enjoyed by someone who has never watched so much as a fan-made highlight video of an episode of Critical Role - it also comes across as a passion project to retell the same story in a new medium for fans who already have the context to most appreciate the reimagining, and all its flourishes, regardless of whether any given moment has been reshaped with all due meaningfulness.In fairness: as events escalate in the latter half of the season, the writing broadens to allow every charged emotion to feel more momentous, nearer to what it should. Moreover, the final three episodes feel like the best possible animated realization of these crucial, cataclysmic story beats. Still - maybe the critiques I offer are harsh, yet they come from a place of love. I love Critical Role, the stories they tell, and that 'The legend of Vox Machina' was able to exist at all. Everyone involved should be proud of what they've accomplished; every person with a hand in the creation - the chief CR cast most of all - obviously poured tremendous energy into the production. I think it's a roundly entertaining, deserving venture, one that I'e no qualms about recommending to anyone receptive to fantasy, and animation, that alternates between varying moods, levels of violence, and types of humor.I like the series and recognize what it does well - I just also see where it falters. I think that general audiences would find this a good time, yet also understand that my overall favorable opinion still carries bias that could amount to rose-tinted glasses. Meanwhile, my foreknowledge of Vox Machina canon also arguably limits my enjoyment compared to those watching with fresh eyes. There's no one correct response here - after all, storytelling is an art, and art is subjective. All I can say is that while my expectations for (the first season of) LOVM were perhaps met incompletely, far and away I consider this to be an admirable, landmark endeavor, and I look forward to seeing what comes next.A job well done, everyone. Now - is it Thursday yet?",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "An absolute cracker",
            "content": "I am absolutely in love with this show. The witty dialogues, enjoyable twists, relentless action, formidable villains, loveable protagonists, affectionate siblings, loyal friends, lovestruck duos, comic relief, beautiful animation, lovely settings - this show is a complete package! The masterful writing and execution have made this show one of a kind. I would love to see more episodes. Keep them coming, Amazon Prime!",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "Amazing Animated Adult Comedy Drama",
            "content": "First season was great, but there were a few times it felt a bit too cliche or kind of underwhelming. The voice acting and animation are unmatched and the characters are amazing, but some of the plot and story feels underwhelming in comparison. Still, it has some great moments in the story that are far from average. If you like invincible, I don't see how you could ever not like this as it has a similar vibe in terms of tone and animation, just in a fantasy world. I cannot wait for season 3 and I love that the new storyline is overarching with some season specific elements. Season 1 was an 8.5/10 and season 2 was a 9.5/10.",
            "review_date": "2023-02-11"
        },
        {
            "review_title": "Great potential, a few tweaks for season 2 and this could be magnificent!",
            "content": "I really enjoyed this show and it almost lived up to my expectations. As a fan of the original youtube dungeons and dragons series with Critical Role, I was not disappointed by the return of these characters and their portrayals.A few things I think are the weakest aspects that need to be worked on. The writing, first of all, is the weakest part of the show. They have great characters and the dynamics between them are brilliant, naturally, it's just like the dnd show. But the writing is underwhelming, some of the dialogue is just meh and the plot was also meh and not as interesting as it could have been. I've seen weird reviews on here from uptight people over the crudeness of the jokes and behaviors of characters, the characters are like that originally. They need to improve on the writing massively for season 2, a better fleshed out plot that is split up into episodes in a better way, more realistic and interesting dialogue, and more of a focus on each main character. Please stop making Keyleth save the day every damn time, same with Pike, each character has amazing potential and there was many times another character could have done something to save the gang but you keep defaulting to Keyleth and Pike, they need to work on that predictability for the next season.The next thing they need to work on is the music, while the credits music is the same rhythm as the original theme song, it all needs to be more epic and less underwhelming, I'm looking for some iconic music and a consistent and memorable overarching tone, at the moment the music is very underwhelming and there is no specific character music or Scanlan songs, which were one of the most beloved aspects of the original series Scanlan's songs.Lastly, there needs to be a way for them to make the show stand on its own two feet, while my mother and I who watched it are fans of DnD, the show needs to pay homage and respect to the original series and their characters while also adapting it to newer audiences, it's a hard balance to achieve, but seeing feedback from season 1 should be helpful in achieving that.Overall, it has great potential and I will be watching season 2, hopefully they take what I spoke of into account and make this what it should be, iconic and wonderful. The animation is straight-up incredible, some of the best I've seen, it's flashy and beautiful but not distracting. The voice acting is on point as expected. The character dynamics while not 100% what they should have been, were still incredible. I'd still recommend people watch the show! This review is from a fan that can still enjoy a show and highlight the problems, I'm optimistic for season 2.",
            "review_date": "2022-02-20"
        },
        {
            "review_title": "Like animated shows? Like DnD? This is for you!",
            "content": "This show is simply awesome in so many ways. Based on the Critical Role show which has been streaming on Twitch every Thursday for a couple of years. This show covers their first campaign featuring the infamous band of adventurers known as Vox Machina.Whether you are a long time fan of the show streaming on Twitch or completely new to this you will find that you are easily captured and drawn into this story and the show. There is much to explore for new fans, and a treasure trove of easter eggs and references for old fans.The show full of action, quips, hilarious situations and a great story arc with characters that all have their unique (and sometimes awkward!) personalities. Anyone who has played DnD before will quickly recognize many familiar situations which could probably have happened in your very own DnD sessions.The animation style is beautiful, the creative world that Matthew Mercer designed from his own mind comes into vivid and colorful display in the show.Truly something impressive and fun to watch, and created from the heart by the entire cast.",
            "review_date": "2022-02-02"
        },
        {
            "review_title": "Don't believe the low ratings",
            "content": "Ok first i will admit i was turned of by the cursing, and i ask myself why. This anime did not need that at all.Yes its violent no its not for kids, but the characters are fun, and the story is quit good.If you can get pass the cursing and some bad jokes its worth a look.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "A very decent show",
            "content": "I like it, but six episodes in, I so wanted to love it. Let's start with the positives, of which there are many!-The plot is compelling.-The diversity and inclusion is seemlessly done, a welcome change in the fantasy genre. Not at all surprising given Critical Role's commitment to being good advocates and allies.-The animation is decent.-The humour is perfectly immature and vile and brilliant.-The voice acting is on point, as you'd expect.-The D&D in-jokes and subtle Critical Role easter eggs are hilarious.The not so good, for me anyway;I haven't been able to get into Campaign One despite trying a few times, and hoped this show would make me finally enjoy it. But if anything, it's made me give up on it for good, and that's frustrating. There's just no getting away from it, the Campaign One characters are almost all stereotypes. I know they're very much loved by fans of C1, but I just find them to be too unoriginal. I only really care about them because I love the cast. They're so stereotypical, they're not the best advert for present day Critical Role which now puts out much more compelling characters.Still, however, a great effort, and I am enjoying it. I'm excited to see each new episode, and hope it gets to run for many seasons. I'm hoping at some point it will find its rhythm and I'll be able to love it.",
            "review_date": "2022-02-06"
        },
        {
            "review_title": "Great show! Would love to see more of this show and this whole genre!",
            "content": "I know there will be more of this show but I truly hope it sparks a new interest in this genre as a whole. The world needs more adult rated anime style cartoons. So tired of the western cartoons being based around whatever a couple cartoonist are doing. There is so much more creativity and differences in the anime of Japan, and I know a lot of people argue 'well just watch japanese anime then' but for me the dubbing or subtitles definitely detract from it's enjoyability. When these types of shows are made for the English audience they are so much better, so please studios of the world please start doing more of this. I also like how they are a storyline rather than western cartoons generally being tune in to whatever episode and be able to follow along. They are made to be watched from beginning to end and develop characters and relationships between them. I also loved the whole bi-sexual dwarf aspect. Super unique and well inserted. Complete contrast from the random black lesbian inserted into the Peacemaker show (although very different shows)",
            "review_date": "2022-03-05"
        },
        {
            "review_title": "Poor writing",
            "content": "Mystified by the high rating here. Maybe this show only works for committed D&D fans. Certainly it feels like it was written by teenage boys. The language makes it inappropriate for youngsters and the puerile humour and lack of coherent story makes it difficult to watch as an adult. Its well animated, but after 7 episodes I'm done. What a waste of time. By the way I love rick and Morty, archer etc, a lot of animation is well written and genuinely funny. This, on the other hand is garbage.",
            "review_date": "2022-02-26"
        },
        {
            "review_title": "Too Many Episodes",
            "content": "This show would have been much better if there were only 8 episodes. I enjoyed it until I got to episode 9 and then I just wanted it to be over. I had a hard time staying awake. I had to force myself to finish. Thank goodness the episodes were only 25 mins.I wasn't a fan of the crude overused \"adult\" jokes either. Yuk! They added nothing to the story and dumbed-down the entire concept.",
            "review_date": "2022-02-24"
        },
        {
            "review_title": "I'm not into D&D and this was outstanding",
            "content": "I had barely heard of critical role before this. It's not something I would watch but this was made by the same people and I decided to give it a chance. This is one of the best animations I have ever seen. It has comedy action Gore in a perfect balance that just works. The animation and voice acting are both did well and Once they start getting to the main plot of the season the story gets real good also. Me and my wife both are looking forward to season 2.",
            "review_date": "2022-03-03"
        },
        {
            "review_title": "Great show overall",
            "content": "While I am a long time fan of Critical Role I also loved this from just a viewing standpoint. 10/10 on all accounts. Definitely for mature audiences but man is it excellent, and I will tell anyone I can to watch.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Don't believe the high praise",
            "content": "Any time that vast majority of reviews are 10/10s you should be suspicious. This is one of those times.This was rough to get through. I am a decent fan of Critical Role. Didn't watch all of the original, but did watch all of campaign 2. The humor and language in this show is unintelligent, vulgar, and juvenile. Exactly, like what a 13 year old boy trying to be edgy would act like, dropping f-bombs every other minute and telling cringe jokes. Its the most immediately annoying aspect, but sadly isn't even the worst offender.While the acting is quite good, the dialogue is quite stiff and predictable. The main characters are cliché and 1-dimensional. For a d&d livestream where you also have the player's real personalities shine through its not a problem. For a show, its a serious problem.The tone is all over the place. It tries to take itself seriously and make us care about the world, only to then crack a silly meta joke and break immersion. The plot is incredibly predictable, and not nearly as intelligent as the rabid Critical Role cultists would make you believe.On a side note, if you do decide to get into watching the Critical Role stream, ignore the fanbase; both the positive and negative. A large portion of the CR fanbase has a seriously unhealthy obsession. They're willing to spend thousands of dollars on the franchise and take the franchise way WAY too seriously. They will quite literally lose their minds if you have any critiques what's so ever, like a cult, hence why I call them cultists (ironic considering in d&d you tend to fight cultists).Is this show the worst thing every made? No. Is it the best thing ever that'll revolutionize the fantasy genre? Hell no. 5/10, and honestly, that's me being nice.",
            "review_date": "2022-02-04"
        },
        {
            "review_title": "A riotous roleplay campaign reimagined, with much to like and a lot to improve",
            "content": "An animated adaptation of Critical Role's Dungeons & Dragons tabletop campaign, The Legend of Vox Machina features the heroic adventures and world-saving exploits of a ragtag band of misfits.Based on what I hear from passionate Critters, the show is to be commended for its faithfulness to the source material. The plot, while not groundbreaking, is well-crafted and includes a diverse set of characters. The animation is excellent and provides the numerous action scenes with the desired vibrancy. Finally, the voice acting is phenomenal and imbues each scene with added pizzazz.However, adapting DnD gameplay does not come without its share of challenges. The reliance on dice limits the logical consistency in storytelling - Vax's lockpicking skill varies wildly, Keyleth's magical abilities are capricious, and Grog goes from taking on everyone at once to being knocked out by a single adversary. An ability to heal even the most potent of injuries and stave off death lowers the stakes severely. The absence of players also needs to be accommodated for by strange constructs ... as in the case of Pike's astral projection. And tropes such as the horny bard and the slow-witted brute abound, typically to the detriment of the narrative.The writing in general is rather underwhelming. Barring Percy, no character gets significant character growth with little time spent on their individual backstories and motivations. The romantic subplot between Vax and Keyleth appears out of the blue and the resolution to Pike's introspection of her faith feels lacking. Another of my gripes is with the dialogue which contains an excess of edgy one-liners and sexual humour, especially in the early episodes.In my opinion, The Legend of Vox Machina is perfect for an audience that is familiar with Critical Role and enjoys DnD. But even someone who generally adores animated fantasy will find the show entertaining. Despite my criticisms, I too shall look forward to watching future seasons ... especially since I am told in no uncertain terms that the best is yet to come!",
            "review_date": "2022-12-08"
        },
        {
            "review_title": "Scooby doo has better writing",
            "content": "If there was ever a show that would tell you what was going to happen before it happen this is that show. Just like the title says scooby doo has better writing. This show is such a nightmare there isnt a word to describe how this is bottom of the barrel.So stereotypical this show is. Lets hav a black person have a african accent, and a person with red hair and beard have a irish accent. Wow really bring something innovating.My question is how is it in this would they even have those accents. And why does it have to be those type characters that have those specific accents.In a world where there are animal people, elves, the undead, and so many more they decided to bring that crap into this nightmare of a show.Characters are poorly written.You have this character one min can charm woman, and convince a king to let him and his party help so the kingdom. Seeming like a person who can manipulate and convince people, and the next is a complete idiot who spits out stupid stuff and makes no sense.Not to mention the rest of the squad. One not sure if hes gay or straight\none A religious freak, one who has no self confidence \" wow never seen that before \" a mother hen who does her best to keep it all together, and another who seeks revenge. The only one who makes sense is the brute of the group he stays consistent. He just wants drink and kill things.",
            "review_date": "2022-02-06"
        },
        {
            "review_title": "A brilliantly original, fun, thoughtful D&D experience",
            "content": "Truly feels like a bunch of idiots sitting around playing D&D while creating a wonderful experience.The voice acting is absolutely incredible while all of the characters feel really different and original.It uses tropes really cleverly, building on them and showing why they exist.I've never watched critical role but I'm definitely going to check them out now.If I could ask for one improvement it would be better animation in some places, this might improve in be second season I haven't got there yet.All in all a charming show that sets out to achieve magic and hits every note perfectly.",
            "review_date": "2023-02-15"
        },
        {
            "review_title": "Easy to Watch",
            "content": "If you like fantasy settings, especially DnD, especially Critical Role, you won't be disappointed with this. The animation is good, the voice acting is phenomenal and the characters are generally well-written and relatable.The story moves too fast and is a bit all over the place, in my opinion. To me, it seems more like a party of heroes going on side quests instead of a coherent well-structured story. It's still fun and easy to watch though, if you don't obsess over details.My main problem with the show is that while it advertises itself as an adult show, with so much gore, violence and swearing involved, it does not treat its audience as adults. For example, the \"NPCs\" are dying left and right, while the plot armor for the main cast is just too thick. There are just too many times when them surviving an encounter doesn't make much sense. And if the writers don't have the guts to kill off a character and end up bringing them back, why kill them in the first place? It has happened 3-4 times already. There's no tension if death means so little and the main characters can cheat it rather easily.TL;DR: It's not among the best shows I've watched, but it doesn't do anything particularly wrong to stop you from enjoying it.",
            "review_date": "2023-01-28"
        },
        {
            "review_title": "Slow but picking up and looking promising",
            "content": "The first two episodes were a bit of a slow start for me.I haven't watched a lot of critical role maybe 20 episodes and only season 1 so this is a new story for me.In the 3rd episode it escalated like crazy.I really hope there will be some political intrigue and a bit less fun as it is sometimes a bit too much but otherwise really enjoying this.Amazingly done CR!",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Unsatisfying",
            "content": "The animation looks good, but that's about all this show has going for it. It's not a D&D show so much as a parody of D&D. The humor is very crass, the characters 2-dimensional, and the plot underdeveloped. The dialogue is a lot of f-bombs - like, more than normal people would think to use even if they were trying - punctuated by an occasional melodramatic soliloquy. Maybe it's the DM in me, but I found myself really wanting these characters to die. But again, the animation is good.",
            "review_date": "2022-02-03"
        },
        {
            "review_title": "Loving it!",
            "content": "I have followed the original stream for 5years, and this serie is reaching all expectations. Worth the wait. All my friends are as hyped as me.It's all about this group of misfits, all with their own baggage, trying to make it in the world. Love that this can be enjoyed by people who has never seen the stream.",
            "review_date": "2022-02-04"
        },
        {
            "review_title": "Cliche, cringe and cheap writing.",
            "content": "My first complaint is going to be about characters, in the first episode they say they only care about money even though they see all the destruction then they meet a family who they interact with less than a minute then after they fight the dragon they change their mind all of a sudden and decide that it's way too dangerous, and while they're going back they see that family dead and they change their minds again. What the hell is this? I get that these are bad people starting to do good but all that happening in a single episode is ridiculous.And oh my god the writing. It's so messy and all over the place, all lines are either cringe jokes or cringier thoughts of the characters which they say out loud because the writers were too lazy to make us understand their thoughts. They tried calling to make unique characters but failed terribly, there is nothing interesting about the characters. They made bunch of different characters, didn't bother to show us how they meet, and didn't bother to show us what they had in common. One thing i can think of that they have in common is all of them being non complicated and cartoon level stupid.Honestly it's not the most terrible thing but it makes me so mad that they could have made it so much better, i want to be fair so I'll give it a 5.",
            "review_date": "2023-02-05"
        },
        {
            "review_title": "Perfect portrayal",
            "content": "Critical Role has been able to portray their characters' styles perfectly in this amazing series so far. Anyone who is looking for a fantasy/DnD based series will have a great time watching this show. Keep in mind it is R+18 rated though.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Ruined potential with cringe humour",
            "content": "I don't understand why they come up with a good story and great art only to ruin it with 10 year old humour.Some moments were very cringe and annoying. Ruined the beautiful artwork for me.",
            "review_date": "2022-02-07"
        },
        {
            "review_title": "Its ok considering",
            "content": "I know nothing of its source material\nI do not like anime any of it, at all.But this was ok\nsome of the humor was cringe and the story was generic fantasy stuff\nThere was enough fun to keep me through the first 3 episodes which surprised me\nIm afraid it will get to deep into lore and intricacy's of D&D and they will lose their casual audience including me, and that will be that.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "A New Hope for Fantasy Entertainment",
            "content": "One thing I have to give this show credit for above anything else, is the clear love with which it was made. Every frame is dripping with the passion of not only the original creators, but the animators, designers, composers, background artists, etc. Now passion alone does not make a good show, but combine it with people who are very good at what they do and you can make something truly special. This show will not be for everyone, and that's okay, it isn't meant to be. But for those who enjoy fantasy, D&D, animation, comedy, or those who just want an entertaining romp not bogged down by big studio expectations or the need to fill a content quota, I am confident you will fall in love with these characters and this world as so many have before.And if you don't? That's alright. But for me, a show that isn't for everyone but was made solely because people wanted to make it will always top a show made for everyone that no one asked for.",
            "review_date": "2022-02-05"
        },
        {
            "review_title": "Great animated series.",
            "content": "Before writing mine i read couple other reviews, and yes there is too much swearing but besides that everything is great. Animation is great, the visuals are top of the shelf and give you proper feel of the scene / show. Story is coherent the characters are part of it, getting along, you feel them fighting the obstacles, at some points it is a little bit too abrupt to the point where you get disconnected, but i noticed that in a lot of high quality shows released after 2010, that sometimes they feel like fantasy b class movie, like we need to get to other side of galaxy: 5 minutes later: done.Overall: Great Show to Watch! Standing up to the well established merchandises / lores that were renewed recently and the storie was created for characters.",
            "review_date": "2023-01-25"
        },
        {
            "review_title": "Overhyped, but I'm Still Watching",
            "content": "I appreciate how incredible it is for Critical Role to have this show made in the first place and streamed as a legitimate offering on Amazon Prime. The animation quality is top notch. What CGI they use isn't distracting (*cough* season 2 of AoT *cough*), and all of the designs are really good. The music (score) isn't anything special, but it works. Where the show falls completely flat is the writing. There are so many cliches and cheesy-dumb moments that make it hard to believe in the \"awesomeness\" of Vox Machina. We're supposed to accept that they're the best despite what we see on-screen. They survive and succeed because the plot needs them to, not because of their actions. Why they're better than the first group that got fried in the opening minutes isn't apparent. Blaming plot armor is an argument you can leverage against a ton of shows, but all of the swagger and winking here highlights it even more. The worst offender in the writing is the adult content -- it's completely amateur. The mere seconds of nudity peppered throughout episodes and the barrage of R-rated language is so juvenile. Even the gore. It's all adult just for the sake of being adult. There's no cleverness to any of it. And that one shot of the turd coming out of that one dude? Seriously? Did they survey a middle school for script ideas? It all feels so unnecessary and amateur, and that's a shame because, without it, Vox Machina could have easily been a show to watch with the family. I know that's not the target audience, but it's not like the adult material is handled with finesse. Another issue is the pacing. I understand that it's hard to adapt 6-years-worth of material into 12 episodes, but it's not necessarily the content itself. Everything is *fine*, but the show obviously wants us to feel something. You can't force us to care about characters we barely know in an arc that just started. That's where the fandom comes into play. They've known the characters for years, so it's different for them. For those of us who are new, it's not as effective. Wrapping up, I just have to point out, Scanlan surviving the fight in S1, ep. 7... he acts like he outwitted the bad guy when he should have been chopped to pieces so many times. And Percival, really? The character is all buildup and no payoff. \"If you harm her, I will end you,\" is so hollow and cheesy, but that kind of represents the show as a whole: all hype, little delivery. It has me interested enough to see where it goes for now, so I'll continue to watch.",
            "review_date": "2022-02-13"
        },
        {
            "review_title": "It's Alright, Had Potential",
            "content": "Had potential. Was good enough to watch through. But filled with plot armour, cliches, childish adult humor and too much unnecessary swearing. The characters felt one dimensional. Each one of them reminded me of an uncool teenage boy trying to sound cool.",
            "review_date": "2022-04-13"
        },
        {
            "review_title": "Critical Fail",
            "content": "I love D&D, I DM a campaign session almost every week. I haven't watched too much of the Critical Role gameplay because there are only so many hours in a day, but from what I've seen Matt Mercer is an outstanding DM and the players range from amiable to charming. What they've done for the hobby is great.So it pains me to say that the animated show sucks. Look, I'm not ordinarily put off by R-rated stuff. Swearing, violence, sexual content is fine in the right doses. But this was a cringy runaway train of non-stop F-bombs, boobs, butts and splatters written by the creepiest 14 year old from your junior high school days. They over-used that stuff like a crutch, suggesting little confidence in the characters or story by themselves. I know we're not aiming for an Emmy here but it seems like this should have been a lot better.",
            "review_date": "2022-01-30"
        },
        {
            "review_title": "People who play dnd deserve a better show",
            "content": "I've experienced plenty of fantasy in just about ever medium it shows up in, so please don't write off my review as someone who doesn't get it. This show is way too putrid to look appetizing with d&d nostalgia glasses on.The writing is pretentious, characters are flat, the sex jokes all miss. The animation is okay, but minus points for the cgi use. The part I hated the most was the predictability of the plot.The sexual depictions and graphic violence are tasteless. Western fantasy (outside of got) is usually surrounded with an aura of grace, and twisting this into something more grotesque is fun to see. But the idea itself isn't ever enough. Without the effort, everything would turn out like vox.I don't understand how people can give something like this high ratings when amazon prime has invincible.",
            "review_date": "2022-02-20"
        },
        {
            "review_title": "D&D does not translate well to other media (very mild spoilers)",
            "content": "I'll start with what I liked about he show:\nthe animation is pretty good (it isn't out-of-this-world or anything like that, but it is as good as it needs to be, maybe a little bit better even).the acting is greatthe main characters are fun, and have lots of great momentsthere are quite a lot of funny quipsNow, for the things I didn't like:\nall of the secondary characters are as flat as a sheet of paper. They exist solely to move the plot forward for the main characters (which is to be expected from an adaptation of a D&D campaign)all of the main characters are too... \"interesting\"? I don't know how to put this, but all of them have a LOT going on in their past. Their party has TWO distinct \"mercenaries destined to rule their people\", just to give an idea of what I'm talking about. Half of them are built like they are the sole main character of an adventure story. Again, I think this is because they are adapted from a D&D campaignthe villains are clearly built as pure villains and nothing more. They have no redeeming qualities whatsoever, they are there just to be vanquished. They are caricatures of evil, made to be hated universally. Because of this, they end up being not interesting at all, you just end up thinking \"shut up and die\" every time they show up. Not to repeat myself, but as I see it, this is another consequence of this show being an adaptation of a D&D campaign, where the evil being vanquished is not even the main point of the game, it is just a justification for the adventure to happen for the players.Don't get me wrong, I've watched quite a lot of D&D campaign podcasts and such, and I thin they are very entertaining. They tend to be unpredictable (because of the dice rolls and such) and spontaneous (because of the unpredictability and the ability of the players to just act through all of the events), and that makes them very fun to watch/listen. You end up feeling like you are there, playing D&D with them.When you adapt this kind of media to a TV series, you end up having to throw out these thing I just pointed out, which are (IMO) the things that make this kind of media interesting. The characters, the worldbuilding, the villains, they are all secondary to the spontaneous interactions between the players and/or the GM, and to the dice rolls and the on-the-spot decision making.What you end up with is an average show, with bad-to-average worldbuilding, flat secondary characters and uninteresting villains. I still liked some of the moments, as the main characters have very interesting interactions between themselves, but that was it.",
            "review_date": "2022-02-26"
        },
        {
            "review_title": "Generic, boring, stupid",
            "content": "Can't even think of anything else to write about it - it's just stupid and boring. Writing was most likely done by a 12y.o. Dumb kid, and all the jokes were stolen from his even dumber slightly older brother. All of that was forcefully inserted up the rectum of a generic fantasy plot, and then dressed in a colorful generic anime suit.",
            "review_date": "2022-03-23"
        },
        {
            "review_title": "written by a 15 year old",
            "content": "It's good but there are better out there that have been made over the last couple of years.Invincible, dragon prince, kipo, even Hilda was better written.",
            "review_date": "2022-03-29"
        },
        {
            "review_title": "Surprisingly interesting!",
            "content": "Light, but surprisingly interesting serie.Nice and stylish art.Well constructed caracters. Pike and Scanlan are my prefered one.Cliffhagning story.Funny part.Hope they continue the serie for couple of years.",
            "review_date": "2022-04-25"
        },
        {
            "review_title": "If lord of the rings was written by a 14 year old boy",
            "content": "First 10 mins of this show mostly consists of the f bomb, burping, throwing up, gore and sex jokes... feels like I've stared into the mind of an infantile 14 year old boy with an unhealthy obsession with D&D. Not remotely enjoyable, funny or clever.The only people who seem to like this show are those who are well acquainted with the d&d campaign (die hard fans) or are into immature, crude adult humour. If you don't sit in either category, avoid and save yourself time.",
            "review_date": "2022-02-15"
        },
        {
            "review_title": "Visually stunning",
            "content": "I rarely post about animations generally, and animations bordering on medieval fantasy in particular. However, this Amazon Original animated series is the best animated series I've streamed in a very long while...after the stunningly incomparable Castlevania (seasons 1 through 4).The characters are, as described, a band of misfits. The humor is dry, brittle, but punchy. The plotline is straightforward but hair-raising. The action scenes and knife and blood play is fast, deadly and gruesome, and that makes it all the more effective. With elements of otherworldly magic thrown in through the characters and the situations and unnamable vampiric evil they faced, it makes a viewer reminisce all the more of the wildly successful, bloody Castlevania.If you've got time, and you enjoy animations, and fantasy/gothic/horror animations in particular, give this a spin. You WON'T be disappointed.Rating: 10/10.",
            "review_date": "2022-03-12"
        },
        {
            "review_title": "What's the point?",
            "content": "Why make something for a more mature audience by throwing in gore, a tiny bit of nudity, and lots of language, when the story itself isn't much more than an episode of Scooby Doo? The voice acting is good, the animation isn't bad (it isn't great either), but really the writing is pretty lame. I love adult themed animations, and would like more of it, but this isn't worth the effort to watch.",
            "review_date": "2022-01-30"
        },
        {
            "review_title": "Sadly, swing and a miss",
            "content": "Ok, let me say why it's a 4,Its not the podcast and I get that, but that's just it, it's NOT the podcast at all. The feel just isn't there. The connection between the characters is so lacking, it's actually unwatchable.And what is up with the getting their butts beat down so much, like they hit the guy once and that's it? It the podcast it was a really good fight, this was just sad. And not having the one guy come out of the closet to help VM was actually a nail in the coffin for me. Pixe was supposed to cast restoration on him and blah blah, none of that.The show feels rushed in the story, I know, a round is 6 seconds in the game and a battle takes only 2-3 full minutes to fight, but it is just, not there.And biggest pi$$ off is Matt isn't doing Gilmore's voice and isn't at all how he should have been drawn.I guess it's my fault, I built up the release so much and it didn't live upto my expectations at all.I really hope the next episodes will change my mind but I highly doubt it.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "boring!",
            "content": "How the hell does this show have a 9/10 rating on imdb? Am I watching it different or what! Come on, this show is crap, don't you dare compare it to castlevania... there's no iota of world building in it, the dialogues are just annoying, the humour is so bland and forced, this looks nothing like the trailer! Avoid this nonsense! Meaningless violence all over the place.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Average until you realize it's D&D",
            "content": "This is an average show with low budget and bad animation and average storytelling until you realize there's a meta scene behind the show with Critical Role and everything being a D&D reference then it's actually kinda cool.",
            "review_date": "2022-02-11"
        },
        {
            "review_title": "Test screening is a thing",
            "content": "I've listened to literally every Critical Role podcast and truly want these people to do well with this project, however, the direction they're going seems to be deviating from actual people that are going to be watching the show. There is terrible pacing, no set up to give the audience some sort of heads up on why these characters are the way that they are. Like, you can't just have Vax say that he's not magic and then have him throw his belt on the ground and have it become a snake for what appears to be no apparent reason. There's a whole vibe that this is a D&D show, but it's not communicated to the audience at all. Watching this I'm on the same page with Keyleth when she says \"Why are we even together?\" Seriously, why? There's literally no back story, just bust in 'Here's Guardian's of the Galaxy in the third act, enjoy!' Matt is definitely better than this.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "How do you wanna do this!",
            "content": "As a fan of Dungeons and Dragons, Critical Role and Fantasy in general I gotta say this has met all my expectations, the crew has really captured the energy of the stream brilliantly.My one bit of criticism is that first 3 episodes have moved at a break neck pace and I can understand why its really got to hit the ground running but I imagine as the show develops it'll take its time when it needs too.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "I've been converted!",
            "content": "As an avid player of D&D for many years, I was recommended Critical Role numerous times, I tried a few times but could never get into it and would usually lose interest after few episodes. In this format though, the show shines brightly. The characters are great, the voice acting is perfect and the story is engaging. I know that a few people will disapprove of the cursing and adult themes but I actually find it funny (as I believe it's intended to be). Overall great show, hopefully it's picked up for a 2nd season.",
            "review_date": "2022-02-24"
        },
        {
            "review_title": "Quick Enough for Fans, Accessible Enough for Newcomers",
            "content": "The Legend of Vox Machina is a great concept with a great story to tell. Though it may oftentimes lean too much on the irreverence and low-brow humor which permeates its predecessor live show (sometimes, to its detriment), the portrayal of the lovable group of voice actors is certainly true to form in all the ways that count. The individualized characterizations are made clear early on, and the quick pacing and frequent, over-the-top spectacles are more than enough to rope in newcomers to either Critical Role or the D&D fantasy genre as a whole. The animation is crisp during both high intensity combat sequences and slow moments of thoughtfulness. One of the great strengths of the live show was the ability of the cast to freely and expertly play with narrative tension, oscillating between somber moments of dark character exploration and vulnerability, and moments of tenderness and levity. In these first episodes, this show has seemingly found that balance and I hope, as the series progresses, the writers and producers find more ways to more effectively execute on those moments.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Seriously bad writing",
            "content": "Don't waste your time. It's cheesy and predictable in the worst way. The story has so many holes you can drive a truck through them. I couldn't get past ep 4 it insulted my intelligence so bad. Critical Roll is really a leader in the industry? Sad. Really really sad.",
            "review_date": "2022-03-07"
        },
        {
            "review_title": "Brilliant",
            "content": "From the gorgeous animation, stellar voice acting (obviously), fantastic characters to the gripping fantasy story, Vox Machina is everything we hoped for!Fans of Critical Role will love it, newcomers will enjoy it as well!Bidet!",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Horrible! Who are you people that gave it 10s?",
            "content": "Are you cowed by some profanity? There's literally nothing to this! Ugh! Why God? Whyyy. And David Tenant? Dude, bro! Pal! Get out now. Don't watch it.",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "Adult Fantasy",
            "content": "This is the show to start the new year, the writing and world building are amazing and the stories each character bring is Phenomenal. Adult Fantasy shows are some what lacking as there are very few of them around but with Critical Role that could change things for the better allowing many more Adult Fantasy shows to be made.The humor is funny and while some jokes don't land others can cause a roar of laughter, the action is something not to miss as each fight scene is well choreographed and the chemistry of the characters feel natural and like they have known each other for years. A sure not to miss if you enjoy the fantasy genre.",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "Decent but flawed",
            "content": "This one is quite hard to review. I like fantasy and D&D so this should be easy, but it's not. There are many issues.The group of heroes. Are they supposed to be good, bad, drunks or fakes? Are they skilled or amateurs? It just doesn't work, there's no explanation no history no nothing. Just random nobodies in a bar fight and then it's of to save the world.Pretty fast we run into the real problem. The story. What happens is we get totally overpowered supermonsters that kill armies with ease. Nothing can hurt them at all. Until suddenly they are easily beaten for no apparent reason. And this is all there is. That is the whole story. First invincible and suddenly easily beaten by a group of randoms who don't know what they are doing.Then we get to the originality. It's great that they wrote this great story and created a cool universe. Or did they? For me it just seems to be bits and pieces stolen from all over the place. The whole universe seems ripped off. They stole stuff from Game of thrones, Witcher, Dragonlance and even from bloody Disenchantment just to mention a few. I know it's hard to be original, but they ain't even trying.",
            "review_date": "2022-05-15"
        },
        {
            "review_title": "What crap!",
            "content": "I'm guessing by all the high ratings that some are giving that this is supposed to be a thing. Or was a thing before it got animated. I don't know what that thing was, but I hope it was better in concept than it is in execution, because what I watched was garbage. The juvenile humor is just cringeworthy and the puns and barbs are just not funny. The characters just humiliate themselves whenever they open their mouths and the lovable misfit schtick has been done way better by way more talented creators. But I guess Amazon is desperate to fill streaming time so they will greenlight anything.",
            "review_date": "2022-02-24"
        },
        {
            "review_title": "Amazing",
            "content": "Waited so long for this and I am so happy it's finally here. The first 2 episodes were good, but I think we'll see the importance of them in season 2. The 3rd episode was perfection and I can't wait for the 3 next episodes. Is it friday yet ?",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Good, bit could be better.",
            "content": "The story as of episode 3 so far is good, the animation is average though i understand the budget is the issue with the animation. The story is set before they started streaming so we are getting the backstory from the home game.It is pretty faithful to the original with the original cast/creators behind the animation.It is more adult themed which is a good thing.I say give it a watch and maybe season 2 is going to be better and we get more seasons.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Unexpected and fun",
            "content": "It was an unknown show to me but i am happy i found it. Compelling story and good graphics. Most of the actions made sense does have some plot holes but its fresh in its take and is a good watch.Even the plot holes would be like them attacking the minions rather than the summoner and stuff like that does not really take you out of the experience. Overall was a fun and good experience and them not holding out on the gore was refreshing as well. The gore is not gory for the sake of gory but just gives rise to realism and feels justified. Would rate higher but its not a masterpiece. Good show...",
            "review_date": "2023-02-02"
        },
        {
            "review_title": "Brilliant",
            "content": "I started watching Critical Role with the second campaign so I'm not fully in the know with the first campaign.I thoroughly enjoyed the first three episodes of this series and it was a really good move making it R rated.This is what can be achieved when a group of friends create a passion project together and a lot can be learned from it. I hope it continues and I'm happy that they can live their dream.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Exactly what I hoped for!",
            "content": "9 episodes in, loving it. Note i have seen all of campaign 1, so may be a bit biased.I'd say it's a hate it or love it. If funding is needed for future seasons sign me up! Acting is amazing, love the style and animation. Nothing out there quite like it!",
            "review_date": "2022-02-11"
        },
        {
            "review_title": "Well done animation with a DnD feel",
            "content": "This show has a little of everything. Wit, gore, adventure, drama. It's bloody, has adult dialogue (not over the top though), and an interesting storyline. Most animated TV shows fail to hold my attention but I'm 3 episodes in and I've enjoyed them all.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "Twisted & Brilliant - S01 Review",
            "content": "Credible, entertaining, and perfectly paced, \"The Legend of Vox Machina\" on Amazon Prime Video brought with it a small world of creative character-driven storytelling that I've seen abundantly in PC games. Crisp animation, great editing, and superb writing rendered this show a worthy animated series deserving of its own franchise.Remarkable directing by a team of sharp minds - Sung Jin Ahn, Alicia Chan, Young Heller, Stanley Von Medvey, and Yu-Won Pang. Praiseworthy screenplay by Brandon Auman, Marc Bernardin, Ashly Burch, Kevin Burke, Mae Catt, Jennifer Muro, Sam Riegel, Eugene Son, Travis Willingham, and Chris Wyatt.Neal Acree's musical scoring brought a deep sense of immediacy and fun to the show. Todd Raleigh's editing saved it in more ways than one. Superheroic work on art, animation, and VFX.Voice acting was instrumental in conveying the manifold magical splendours of \"The Legend of Vox Machina\" on Amazon Prime Video.Taliesin Jaffe (as Percy de Rolo) was quite good. Laura Bailey (as Vex'ahlia) was great. Liam O'Brien (as Vax'ildan) was noteworthy. Ashley Johnson (as Pike Trickfoot) was amazing. Marisha Ray (as Keyleth) was superb. Sam Riegel (as Scanlan Shorthalt) was outstanding. Travis Willingham (as Grog Strongjaw) was memorable. It was hard to choose a favourite when each character felt so distinct.All other voice-artists did notable work for various characters in Season 1 of \"The Legend of Vox Machina\". The villains Silas and Delilah Briarwood (voiced by Matthew Mercer and Grey Griffin) were great. Lesser baddies like Duke Vedmire (voiced by Rory McCann), Professor Anders (voiced by Stephen Root), Kerrion Stonefell (voiced by Darin De Paul), and General Krieg (voiced by David Tennant) were great. Sovereign council member Lady Allura Vysoren (voiced by Indira Varma) was memorable. Archibald Desnay (voiced by Dominic Monaghan) was remarkable.The first season was off to a promising start. Plenty of humour and action, with enough gore and explicit content to keep adult viewers entertained. I loved some of the Steampunk inspirations as well. The characters were well-crafted and their interactions, wholly convincing. The show also contained 'real life' moments - modern swearing, nudity, and more.Despite being an animated series, every episode felt real because of such elements. Some nice \"Final Fantasy\", \"Game Of Thrones\", \"Lord of the Rings\", \"The Witcher\", and \"Dungeons & Dragons\" vibes as well. I can't forget to mention the many funny moments that prevailed in this show, imparting perfect humorous balance to an otherwise dark and bloody tale.In the \"The Legend of Vox Machina\", you'll find an unemployed and disreputable gang of mercenaries faced with the prospect of saving the kingdom of Exandria. Misfits in every way, their quest held great symbolic significance. Not all heroes wear capes, indeed.Critical Role did excellent work creating this masterpiece. The show's almost cinematic fight choreography, outstanding musical scoring, and witty as well as humourous writing more than made it worthy of multiple seasons. That jaw-dropping cliffhanger of a finale included.",
            "review_date": "2022-04-15"
        },
        {
            "review_title": "Great show that borders on excellent at times",
            "content": "I found the show when looking for highly rated animated shows on IMDB and don't really know any of the lore around it. The show is really good, especially the first few episodes that set the stage for the season. I am all about adult animation shows that are not afraid to curse, have violence, and are also LGBTQIA+ inclusive!Vox Machina does struggle from some stale tropes at times. The characters are all pretty typical (the comedian, the stoic, the big dumb nice ogre character, etc.) and many parts of the story could have used some fleshing out. Not enough background is given for some of the characters and, while this has 12 episodes of about 300 minutes total season one length, the show struggles with pacing at times.I believe that the show is well worth a watch and am happy it was picked up for a second season.",
            "review_date": "2022-09-06"
        },
        {
            "review_title": "Not bad , but not very good either",
            "content": "Ok series , but not as good as the current rating suggests in my view .The animation is not impressive .The group of characters is somewhat large , too large for all the characters to really work .A couple are remarkable , but most are somewhat generic .",
            "review_date": "2022-03-07"
        },
        {
            "review_title": "It's good, not great",
            "content": "This show was entertaining to turn on and pass the night, but definitely not my first pick if I had other options. I think the pacing was kind of weird at some points of the show, but I did space out on one or two episodes. I enjoyed the visuals so I bumped my initial rating by a star for that reason, but I wish the story felt less choppy.",
            "review_date": "2022-03-14"
        },
        {
            "review_title": "It has it all",
            "content": "Action, drama humour and a lot of gratuitous sex and violence. It does not get better than this.A roller coaster of a show with enough humour and humanity to keep it from taking itself too seriously and yet somehow never compromises the dramatic integrity.Also David Tennant is a *dragon*! 😍",
            "review_date": "2022-02-21"
        },
        {
            "review_title": "Why does this feel like it's made for kids?",
            "content": "They might be cussing and chopping peoples heads off, but everything else feels like it is straight out of a little kids cartoon. Immature characters, silly plot devices and there are even sad musical numbers, wth? I can't get over all of the high ratings from all demographics. I suggest watching an anime like Log Horizon, Re:Zero or even a classic like Inuyasha for comparison, they are on a totally different level of intelligence and well, everything. I am on episode 5 and I think it has been getting a little better, but I doubt that I will force myself to watch the rest? I can recommend it for a sleep aid. I have been watching it at night before I go to bed and it has taken about a week to get through 4 episodes! :)",
            "review_date": "2023-01-24"
        },
        {
            "review_title": "About as mediocre as a story or party of characters can get.",
            "content": "While I appreciate the attempt to modernize fantasy, as well as the inclusion of adult subject matter, the series is just neither intelligently written nor innovative. It truly does come across as a representation of some untalented dungeon master's mediocre fantasy rpg campaign, which I supposed you can at least say is authentic in that way. I wanted to like the series, but honestly, I have more fun rewatching the campy old Advanced Dungeons & Dragons cartoon series, because I found that group of characters more wholesome. The only thing they're missing to make me hate Vox Machina more is a dragonborn character, honestly (I absolutely despise 5th edition due to this inclusion as a core race).",
            "review_date": "2022-07-08"
        },
        {
            "review_title": "Everything I wanted and more",
            "content": "Perfection and I want to see 10 seasons worth of this content! Love the twists and turns, animation is perfect too! And of course the VOA is on point! I laughed, I cried, I stood up and cheered and it's only the first 3 episodes!!",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Amazing",
            "content": "New the world of critical role started watching over cr2 over the pandemic fell in love with the story telling and the actors. This show gave me goosebumps just know how important it is for them and the community. I'd like to rage!!!! Omg prefect can't wait for more.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "First two episodes are from the home game and they are so much fun!!!",
            "content": "I love this campaign from the start but there were stories untold on Twitch, now we are seeing one of these archs with this first 2 episodes. I Love it!I was one of those who supported this Kickstarter and couldn't be more delighted. I love the animation and the music as well as all the amazing voice actors who are a part of this!This is worth watching even if you have never seen critical role.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Adult show with comedy/jokes aimed at little kids.",
            "content": "The animation is fine, the adult content doesn't bother me but the character dialog and interactions leave a lot to be desired. I feel like this was made for adults (with the swearing and violence) but for little kids with the jokes, characters being obnoxious (while explaining something important), and sheer stupidity of all the characters. I'm rolling my eyes several times an episode. I've made it halfway through episode six and I may not finish the show because it's kind of painful to watch. I was giving it a shot hoping that the characters would grow up as the show progressed but it doesn't seem that way. Currently I have no attachment to any of the characters because they aren't very likable. I started watching because of the good reviews but I question their authenticity now. It's not a terrible show but it's not very good either. It definitely doesn't deserve a rating as high as it it.*Edit* I tried to finish episode six but couldn't. I stopped watching it after too many lame jokes. If you stop watching halfway through the first episode to come read some reviews (like I did). Fair warning, it doesn't get better like I thought!",
            "review_date": "2022-05-09"
        },
        {
            "review_title": "Awesome adaptation",
            "content": "TLOVM is an awesome adaptation of the original show.The fight scenes are great (especially the one in episode 2), the music is gorgeous and the characters are lovable and quircky.The first two epsiodes are a bit fast paced to my liking, but they are a good introduction to the characters and they set up some pretty important things further down the line.It's in episode 3 that the show really takes off though.The characters really get a chance to get into their own and we see how they all thrive and grow togheter.I can honestly say I was upset when episode six ended and I realised I had to wait another week to see the next 3 epsiodes.",
            "review_date": "2022-02-04"
        },
        {
            "review_title": "Unbearable.",
            "content": "I couldn't stand more than five minutes. These longest five minutes ever left me wondering - how the hell can anybody give it 8 stars (or even more)?? Biggest pile of garbage I've seen in ages.",
            "review_date": "2022-07-25"
        },
        {
            "review_title": "love having these characters come to life",
            "content": "I am a huge fan of the critical role campaigns and have watched the first 2 completely, so seeing these characters come to life and be at their beginning again is so lovely to see and especially the Briarwoods look fantastic. The characters look great, the pacing is different, but that is to be expected when going from 4 hour episodes to 25 minute ones, and the side characters are all voiced so wonderfuly.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Great, but the swears are unnecessary!",
            "content": "The swearing in this show is too much. It doesnt add anything. I am not agains swears, they add to the fun, but not every every every sentence needs an f word.",
            "review_date": "2022-02-14"
        },
        {
            "review_title": "Perfect for fans but lacking for new viewers",
            "content": "This has everything a critical role fan would love. It heightens the relationships between the characters, is somehow even more likeable (if that could be possible). However, a new viewer may feel the story is rushing past important opportunities missed for character introductions. Until we get past episode three, we can't know for sure how lack of build up for each of the characters will affect the new viewers connection to the characters. One big thing missing is more views of Percy's past which fans have been waiting for. With all of the hype, still, this show gets an A plus from me! It has everything fans are craving for, tons of inside jokes and more to love! Can't wait. They outdid themselves!",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Not impressed",
            "content": "Trying to hard to be \"cool\". I think i would have liked this when i was 12 because of the swearing and fighting but it's stupid for an adult and i guess it's probably rated for people older than 12yo.-",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Starting to get really good!",
            "content": "Okay, there is a big difference between a roll playing campaign and a good story. And the first couple of episodes demonstrate this in spades. On top of which they really want to ram the woke crap down your throat. But stick with it. The writing gets a lot better. The woke crap is there, but not quite so bad. A distasteful aside rather than the main course. In fact you can edit it out and suffer disruption to the story at all.",
            "review_date": "2022-02-12"
        },
        {
            "review_title": "Ruined Vox Machina for me.",
            "content": "Tapping out at episode 6Gross out humor, shallow cliff notes of beloved characters, bewildering levels of exploding gore, some cartoon balls and breasts, a brief moment of tentacle porn and a little animal death for bonus shock value...not much else is offered.Not only genuinely unwatchable on its own merit, but the lack of any narrative substance in favor of a long string of clunky attempts at shock actually ruined my enjoyment of the source material. I'm only partway through Campaign One and this Amazon mistake quenched my interest in the characters themselves. Should have avoided it since I was really enjoying Critical Role until now.",
            "review_date": "2022-02-05"
        },
        {
            "review_title": "pedantic and childish",
            "content": "Its really bad terrible crude humor similar to Andrew dice clay the later years. The jokes are recycled from every other tween comedy. The stories are shallow rip offs of other much better done fantasy shows. Artwork and voice acting is really good.",
            "review_date": "2022-06-22"
        },
        {
            "review_title": "Cringey and Childish",
            "content": "The tone for this show is all over the place. It tries to ground itself in its lore, only to immediately break any attempt at immersion for a cheap reference. The show relies on a working knowledge of Dungeons and Dragons, all without bothering with any of the licensing. The dialog is middling at best, relying heavily on juvenile humor that seems meant for a 12 year old. It's not awful, but it's certainly not the \"masterpiece\" other reviews are calling it.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "A fun animated ride for adults",
            "content": "I've never done DND so I can't comment from that side of things, but this was a fun show.Season one consists of 12 25 minute episodes which tell one of the origin stories of vox machina.The script could be better there's a lot of adult themes so not recommend for small children that aside I'd seen worse when I was a kid.",
            "review_date": "2022-03-20"
        },
        {
            "review_title": "Ridiculous, Inconsistent, Shallow",
            "content": "(Context: I enjoy Sci-Fi, anime, action and adventure, but have little experience with D&D. I watched 4 episodes)The entire plot lacks depth as if someone were making it up on the spot. It's just a linear sequence of (often very random) happenings. There's no build up. Context is introduced suddenly in an attempt to make random scenes make sense, to keep the plot going.Everyone is stupid. The main characters are stupid, reckless and incompetent but survive, whereas the expendables are the same but die. The bad guys are overpowered but never finish off the good guys.It's full of writer's convenience. The action scenes are full of unbelievable \"close-shaves\", physics-defying stunts and incomprehensible monsters and abilities. The effectiveness of the bad-guy attacks fluctuate conveniently to spare the main characters and the overpowered resilience of the bad-guys reduces conveniently to allow the good guys to defeat them.",
            "review_date": "2022-02-07"
        },
        {
            "review_title": "This is only fun if you're an impressionable teenager",
            "content": "This show is written by amateurs. Luckily for critical role, their fans have poor taste and constantly wear rose-tinted glasses.I went into this show with open arms, I thought I was going to enjoy some DnD fun at last! But what I get is the creeping realization that this title isn't what I hoped for. None of the jokes make me laugh. None of the characters make me root for anyone. It is the animated show of my teenage DnD days, with all the tropes and all the cliches a teenager might fancy. I will be so arrogant to wager that I may have made my characters at least more interesting than these cookie-cutter personalities.With a score of 8.4, as of writing, somebody may mistake this schewed scoring as an indicator of quality. It's not.I know this because they tried making more of the formula with dragon age absolution and it's not working. People notice the bad writing, the inoriginality, when the hype isn't there to cover up the bad things.Hopefully people will wake up and see this for what it is, so that this animation company can go on to do better things because I love their work. Critical Role may be a fun and creative lot, but they can't pull together to do a good story and narrative outside their usual table-top enviroment.Hopefully with season 2 the writers will improve, but considering that the fans set the bar so low I doubt they will.",
            "review_date": "2023-01-11"
        },
        {
            "review_title": "Meh",
            "content": "It's just okay. Started pretty good with the cool dragon storyline but then became very predictable and boring half way through. I liked the voice acting and animation but the dialogue and writing really bring the show down. The high scores are from the D&D dorks but to everyone else this is nothing new or special. Easily skipped or forgotten.When is invincible season 2 coming out???",
            "review_date": "2022-02-25"
        },
        {
            "review_title": "I'm sorry, it's just bad. Really Dissappointing.",
            "content": "First things first - how the hell does this have a 9.0 rating?Honestly, I found out about this series few months ago and I was really excited by idea so I added it in my watchlist and since then waited patiently.And now as it came out I can assure you I didn't see that amount of cringe in series, even in 1 episode for a while.The plot - it does not entertain you. It really feels like a high school improvisational act play - \"long long ago there was a great world with magic and abilities and giants etc. And everyone lived peacefully BUT THEN EVIL CAME AND THAT CHANGED EVERYTHING\" This is literally almost a quote from the series and it does not hook me at all. Then there's presentation of random team of heroes which eventually getting vanished in 30 seconds by SOME EVIL EVIL. And then there's a jump to some meeting with king (of what?) and his dudes which are discussing how their best heroes sucked and now they need new and better ones. I'm not interested in retelling every second of it so I just tell that right after statement that we need better heroes we are getting teleported to some kind of tavern when we are being intoduced to our main protagonists (Spoiler - their characters are made of a cardboard). Our heroes are took up to a fight, being kicked, thats the most stereotypical bearded trans bull/man/woman/creaturx (of course comes with a f**king undercut) and kicks out heroes. Then they realize they can't cope with each other and ask themselves a question - why are they even together? And then surprisingly one of the characters comes back with a paper with king's announcement and THEN our heroes realize that the only thing that bonds them together is money. Wow. What a great introduction. Literally no words. It was literally 10 mins in and I went through all of this stream of information, and the only info that is truly useful is character's names. Hillarious.Humor - Bad, bad try. Believe me, my sense of humor is broken af and it really made me chuckle a few times, but the rest of my \"chuckles\" were from serious scenes that supposed to be, you know, serious. Waist majority of jokes is not funny at all, at least for me, because excuse me, I can't handle everlasting flow of penis/vomit/sex/ball jokes, and unfortunately, most of them are like this. Also, huge amount of cursed words only in one episode is just mindblowing, it really feels like I'm watching Dota 2 anime.Characters - as I said before, they are made out of cardboard. You'll barely remember their names at the end of episode, but the thing you WILL remember is their stupid and stereotypical characters - Goofy giant, cynic twins, pervert midget with charisma, some steampunk-ass smart guy with glasses, self-aware druid redhead (which is also the only character with reasonable decisions). That's it. Now, really. We didn't get even king's name. Eventually, we feel nothing for this characters, and when some of them die in the end of episode, AND you see OUR CHARACTERS getting sad about it, it just feels so confusing and out of sense, you just can't get rid of cringe in moments like this.Conclusion - sorry, this story is just not for me at all. I'm sure, someone in the age of 14 or even less might like it, but not me. Story - stupid, characters - stupid, plot - even stupider, motivations - out of words. Knowing how much money did authors raise, they really could have made a better job, at least hire better writers.One episode was enough for me, which is quite rare, for example I watched 3 episodes of new hee man just to give this show a chance, but I will not do that in this time. I am just dissappointed by it, and I'm sorry that it came out like this.",
            "review_date": "2022-01-31"
        },
        {
            "review_title": "D&D animation has been resurrected and is better than ever!",
            "content": "I was excited to hear that this series was coming out. Every dungeon master has thought about having their game become an animated series just like this. The show has completely delivered on what it promised in it's epic kickstarter debut. All the naysayers just want to hate, if you read the 1 star reviews they say give up in the first episode, that's a cop out. You need time to lay out a good story and if you're open minded, it's worthy of your time.The voice acting is great, the animation is adequate, and the story telling is what happens when a group of friends sit around a table and collaborate on something that they all love. Non-D&D players might find it a bit confusing at first, which is understandable. After a few episodes, hopefully, it will inspire you to get out there and join in your first game. Just don't expect every game to be as epic as this one.Show the series some love and it will bring more adventures like these to life. There is so many great stories being told around the table top and The Legends of Vox Machina will open the doors for the rest. <3.",
            "review_date": "2022-02-03"
        },
        {
            "review_title": "ignore the score, this is GOD AWFUL",
            "content": "This has to be the worst animated anything i have ever watched. Please please please save your self the trouble of watching this. I never thought amazon would out netflix, netflix anime. I dont know who they paid to fake these rankings but juist watch the first episode, that will be enough.",
            "review_date": "2022-02-05"
        },
        {
            "review_title": "i love it, i need moree of this!",
            "content": "I love it, it's everything you could ask for from a fantasy series, finally something worth seeing after so much forced inclusive fiazco like the rings of power and the witcher the origin of blood.He has everything you could ask for:\ngore\ncomedy\ndungeons and dragons influence\neach character has the moment of it and it is not only set to check inclusion boxes\nthere is a little bit of sex too\nWhat more could you want?As I was saying, I am very glad to have found this series after so many disappointments this year, I have nothing to criticize, the truth is that I am already writing to reach 600 characters xD.",
            "review_date": "2022-12-29"
        },
        {
            "review_title": "A true reflection of roleplay",
            "content": "The genre fantasy has grown exceptionally fast, producing countless masterpieces over the last three decades. Since the first massively multiplayer online role-playing was created, the consept of classes and races, mythological creatures and magic has spawned a new subgenre. This type of series has before been produced in anime, however not as detailed as Vox Machina.Vox Machina truly reflects the numerous ways of experiencing Dungeons & Dragons. From being the silent, and most strategic character to the most impulsive and least to say blaring counterpart.The series gives a humerous yet dramatic and actionfilled display that easily would captivate even the lowest of fantasy-fan.Vox Machina is a series i could recommend to others in fantasy, just as much as i would recommend Full Metal Alchemist Brotherhood in anime.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "Fantastic series",
            "content": "If you are bored and need some time this is the series for you .Interesting plots and good character development.magic and quest adventuring with how its should be.",
            "review_date": "2022-02-05"
        },
        {
            "review_title": "Polished but missed a few good bits",
            "content": "Obviously can't expect everything from critical roll to be packed into it but it did include, it included it well enough.All said and done it was a good show. Bravo! Glad they didn't tame down the foul language and humor. It was after all funded by the fans on kickstarter, not the casual viewer.It didn't disappoint from the source material.Docked 1 point as some of the dialogue didn't feel as natural as on critical roll leading to bits of disconnect between characters but maybe that's just me being too judgmental after fondly remembering the original show and another point docked because the animation, while good where it counts, seems to take a nose dive on the more slow scenes. Would've been nice to keep the quality up there the entire time and I think that has more to do with lazy animator shortcuts than a lack of budget.",
            "review_date": "2022-02-04"
        },
        {
            "review_title": "season 1 good, season 2 PERFECT",
            "content": "This is a great show that has so much soul.It really makes a difference if a show/movie is made by decicions of a big movie studio or actually by people who love and care for the story, the background and of course the character.The first season was good, it introduced all the characters and had interesting villains... but the second season was just outstanding.Personally i loved everything about it, especially the Grog and Vax stuff, and i can't wait for season 3!The only bad thing is, that the episodes are so short... or the seasons have not enough episodes. I personally hope it gets 5 season, i just don't want to say goodbye to those characters.",
            "review_date": "2023-02-23"
        },
        {
            "review_title": "Zero Risk, By The Books Good vs Evil Borefest Woth Horrendous Writing - Please Read Before Wasting Your Time With This Children's Show",
            "content": "As you can tell by any fan service loving D&D reviewer, if you're the kind of person who likes anything with fan service then you'll probably like this.If you have any appreciation for character development, plot twists, slick dialogue, basically anything that makes the IMDB Top 100 what it is, then avoid like the plague.I really wanted this to work, I didn't even know what Critical Role was, I just saw an 18 rated fantasy animation and thought after The Boys and Invincible that we'd have another Prime gem on our hands. And I forced myself to watch 12 episodes despite wanting to give in within a few.Instead you get a show that repeats itself every episode. Here's the formula; the little purple gnome guy says sex jokes because tee hee sex isn't sex naughty, the garden girl plays the awkward shy character that all geek girls are meant to relate to and just randomly every episode \"discovers\" a new power that handles the episodes present danger when all else is lost, she then flirts aimlessly with the brother of the twins without it going anywhere because tee hee aren't girls cute, the sister of the twin just sighs and barks order all episode, the guy with the gun is moody all the time and is literally the only character with development, the holy girl I almost forgot she existed, she just personifies goody goody. Then there's the warrior, dear lord, the WORST voice acting and dialogue writing I've encountered in any show, Guardians of the Galaxy literally gave a free template on how to write the funny powerful oath and somehow they just failed in every way imaginable. Every ep he gets angry, swings, gets beat and says something like \"ouch that hurty\".ZERO risks taken with writing, I was so hyped when Percy's sister randomly gets murdered, I was like here we go, plot development, nope, literally chicken out of her death in 5 minutes, she's back alive because magic lol. Then after the massive battle the garden girl sacrifices herself, FINALLY a main character is killed off for plot development? Nope, literally goes from unsavable to SUDDELNY ALIVE OUT OF NOWEHERE in 5 minutes.Pathetic writing honestly, no character will ever die but a bad person, do not waste your time, it's by the books good vs. Evil, good always wins trash, it might as well be a 12 rated show, there's not even 18 rated content but swearing and tee hee virgin sex. Absolute wasted opportunity writer have no backbone at all, can't even commit to their own plot twists.I literally made an IMDB account to counter these fan service addicts and hopefully save someone's time. Gave it a 2 because the animation is incredible, the animators deserve a 10.",
            "review_date": "2022-02-22"
        },
        {
            "review_title": "Fun Start with slow decline",
            "content": "I love the fast-paced, action-filled start. It was very enjoyable to see the teamwork, but sadly the show became way slower. It would be nicer to have fewer episodes. The story is nice, but not great. Overall a fine watch.",
            "review_date": "2022-04-09"
        },
        {
            "review_title": "A DM gives the show two thumbs up.",
            "content": "The main voice acting is voiced by voice actors who have hundreds upon hundreds of emotionally invested voicing hours into thier own specific characters, created and lovingly played by the actors prior to the making of this show. This ensures an absolutely breath taking aural experience by the viewer, which is amplified further if the view has thier own previous listening investment into the Critical Role live play series.Furthering on this, the visual aspects are amazing as well, not to mention the sound track.My only criticism would be the episodes are too short! I would like another 10-20 minutes per episode, but that may just be me being greedy for more and not wanting to stop watching, or maybe I've been broken by listening to the 4 hour episodes of the podcast!",
            "review_date": "2022-02-09"
        },
        {
            "review_title": "Mediocre at best, cringeworthy at worst",
            "content": "I would skip this tbh weak humour that relies too much on \"haha look at the fantasy elf swear fantasy elves shouldnt do that hahah\" and other lazy jokes that just rely on balls or dick\nAnimation is fine and the voice acting is good but its fairly meh.",
            "review_date": "2022-02-07"
        },
        {
            "review_title": "Fantastical fantasy!",
            "content": "From the first glance, LoVM basically follows the formula whereby an underappreciated group of protagonists rise up to prominence against all odds. This series however, is certainly more than that.The voice casting was amazing. It felt so passionate and realistic. The comedy was spot on as it was very smart and well thought. The plot arc was straightforward and simple, yet so engaging. This is a dark and mature series thus, viewer's discretion is advised. I love how each character feel like actual individuals rather than stock character archetypes. This is great even if you're not into fantasy. The animation on the other hand is superb.",
            "review_date": "2022-10-12"
        },
        {
            "review_title": "Incredibly entertaining.",
            "content": "It's pretty freaking simple, this is just a fun way to kill some time. You will not regret going on the journey! This is top tier story telling. And off the wall fun!",
            "review_date": "2022-02-13"
        },
        {
            "review_title": "Not the Best but Fun to Watch",
            "content": "First 3 episodes of the series has just been released. Lots of hype and very interesting legacy to keep up. Although animation looks a little bit more frame-y for modern equivelents and story is a little bit cheesy, the VOA quality and sincerity and the joy of Critical Role cast would make the fans (and most D&D players) smile time to time. Character Grog and actor Travis Willingham is a typical silly brute, yet funny enough to watch. Scanlan Shorthalt however is a interesting and original, VOA Sam Riegel gives a great performance in the aired episodes. Lots of little easter eggs are hidden for fans of the series. Tl;dr Not the best animation series, but fun to watch.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Unbelievable!",
            "content": "I cannot believe these crazy nerdy voice actors managed to turn a home game into a animated series and it's actually amazing?!Acting is on point. The episodes should have been 45 minutes each. The animation is crazy the action is great! This went beyond any expectations I had for the show. Can't wait for future seasons!",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "General Plot",
            "content": "The main storyline is basically illogical. The main storyline is driven by the mistakes of the protagonists. The character creation is even more difficult to describe. The tavern was obviously portrayed as a group of hidden masters who have experienced many accidents but feel drunk, but later One is more temperamental than the other, and it doesn't look like the kind of bitterness and hatred in their background that they have been for a long time to see through the world.",
            "review_date": "2022-04-15"
        },
        {
            "review_title": "BAD, so bad....",
            "content": "Terrible! I couldn't even get through half the 1st episode. Shows like this will kill the fantasy-action-adventure genre. Too much swearing....clearly the SCRIPTWRITERS HAVE VERY LIMITED VOCABULARY and command of the English language. Wasn't even funny. Wasn't engaging. Only the animation gives it the 4 stars. Japanese Anime, Flight of Dragons, Dungeons and Dragons (TV), and even Gummi Bears, that came out decades ago have much more to offer than this garbage. BLEH!",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Don't Trust the Reviews Here, The Show Is Mediocre At Best.",
            "content": "Vox Machina is a show based off of an extremely boring web series called \"Critical Role\". Where popular voice actors/actresses play Dungeons and Dragons, yet none of them seem to know what theyre doing.This show is filled with cliche after cliche after cliche, the humor is horribly cringe, and the plot seemed to have been written by a 65 year old with no writing experience that has mostly watched Disney movies their entire lives.The first few episodes are incredibly boring and predictable asf; Ragtag group of 7 mercenaries with only one interesting character. Fight dragon terrorizing city, kill dragon, get reward. Make cringe jokes, insert unfunny one-liners. Fight this and that, kill this and that, blah blah blah.It starts to pick up a little bit after, but it's nothing too special.Only reason this show got me interested in all episodes is because of it's main character, Percy. A knock off Harry Potter with a gun. His backstory is actually worth listening to and he's easily the coolest member of the group.All of this, plus the excessive use of cursing so it makes it seem like: \"Hey! We're for adults only! If you're a kid, get out!\"The animation however, is incredible! Impressively detailed, wonderfully put together movements, colors and emotions. The animation is practically carrying the entire show, in fact I mostly watched Vox Machina just because of it.Overrall, a 6/105.5 points for the wonderful animation..5 for the awful story.",
            "review_date": "2022-08-21"
        },
        {
            "review_title": "Ehh... Not good.",
            "content": "It's only fun if you play D&D and like Critical Role. Taken on it's own merits, it's awful.The world in inconsistent. The characters have no struggle. Every plan they make seems to be \"act dumb and hope the baddy will kill themself.\"All the important things: plot, character arcs, attention to detail, things actually working recognizably like they do in real life, they all have been tossed out the window to make room for jokes about various bodily fluids.So why didn't I rate this lower? Well, I did laugh at one of the jokes, and the animation is pretty good.",
            "review_date": "2022-02-02"
        },
        {
            "review_title": "Newbie!",
            "content": "New fan here, but I can't wait to get more into CR after seeing only the first three episodes of TLOVM!! The animation is great and the characters are so much fun! And the voice acting from the cast is quality ✨👌 now if you excuse me I'm gonna go rewatch, this time with the Japanese dubs, cause it's too long of a wait for next Friday!!",
            "review_date": "2022-01-31"
        },
        {
            "review_title": "it was worse than I expected...",
            "content": "My boyfriend is a huge fan of Critical Role. He forced me to watch it and said \"It'S wAy BetTer tHaN ATLA\". He was so wrong.Animation wasn't good, unnecessary cursing, generic plot, violence, bad jokes, nudity. Everything was wrong with it imo.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "D&D tropes at their finest",
            "content": "This animation series is aimed at adults: it's gory, they swear A LOT, it has nudity and excessive alcohol consumption...(if you have a problem with any of these, the show ain't for you)Well, a classic D&D game I would say xDIgnore the bad reviews, most of them complain exactly about what I just wrote, and that it is \"too generic\". Keep in mind, these ratings have been written after 3 episodes (of 24 total). I know where the story will be roughly going, there is still a lot to come!Does TLoVM invent the fantasy genre \"new\"? Nah it doesn't. But it's a wonderful adaption of a classic D&D adventure.The Animation is more than beautiful, the voice actors are the icying on the cake.And you don't need to know what Critical Role is, or who the characters are, to enjoy this show. Give it a shot, and judge after seeing more than just 2-3 episodes.",
            "review_date": "2022-02-03"
        },
        {
            "review_title": "Major Disappointment",
            "content": "Let me begin by saying I am a huge Critical Role and Vox Machina is my favorite of the three streams they've made so far. The streams are filled with great characters, good humor, and excellent storytelling.The show, however, has none of those things.This was a major letdown for me. Everyone who is giving this more than a 3 star review is either delusional or not familiar with the streams.Let's start with the worst part of it all!First: the jokes.9 out of 10 of them don't land and. They. Are. Constant. I don't believe there's a moment of silence in the show that lasts longer than two seconds. There's never just a moment to breathe or enjoy a quiet interaction between characters before it's interrupted by terrible joke. Now here's the thing, I love crude humor. I find it hilarious. But this feels like the jokes were written by a 13 yr old who just found out what sex and the f word was. Which I find so strange because the jokes on the stream were never like this. They were well-timed, genuinely funny, and the most important part, spread out. Hearing Scanlan say a handful of dirty jokes over the course of 3-4 hrs is nothing. But hearing 20 dirty jokes in the span of 20 minutes? It just feels childish and like it's trying way too hard to be for Adults. I genuinely hate the character Scanlan in this show when I actually liked him in the stream. But they've made him unbearable in the tv adaption and I'm not sure why. But it's bad.Second: the animation.The animation is stiff as heck. Like REALLY stiff. It honestly looks like a fan animation. Reminds me of that person who animated like the first 10 books of a kids book series all by themself. But that was impression because one person did it. This? A billionaire company and thousands of fundings from fans to produce.. this? It's actually astounding how bad it is. I've seen cartoons that were 80+ years old that move more fluidly. Animation is supposed to get better with time (and money), and yet this just looks like a dumpster fire. Not to mention all but 2 characters designs are ugly as sin and look nothing like the original art used in the stream.Third: the pacing.The pacing in this show is godawful. It moves at a breakneck speed. Within the first few minutes they've killed a dragon and became members of a royal council. Like huh? Let's slow down here for sec! I think we've missed a few major steps here. There's so many scenes that have been cut for time when a lot of them are integral. For example, Percy crafts Vex an explosive arrow in the stream. They have a conversation about it and he basically says he'd do anything to please her. This scene gives us some insight into how Percival feels about Vex. In the show however, the arrow is bought in a rushed shopping scene and it's over within a minute. I understand that they are having to cut a lot out to make it fit into a 20-30 min episode and I would be able to forgive them for this if they didn't cut out scenes, only to add some in that NEVER happen in the stream. Like Scanlan singing about his \"beads of love\" during the middle of an emotional fight scene. But I digress. The point being, the show moves way too fast and it's genuinely hard to keep up if you don't already know what's going on.Fourth: the voice acting.I'm genuinely surprised at how Bad a lot of the voice work is. Scanlan sounds like he's from a badly dubbed anime. Grog sounds like dumb child, constantly mispronouncing words like \"dat\", \"widdle\", \"pwease\". He's supposed to be cockney, not 5. And Keyleth's voice is extremely whiny and her dialogue lasts too long because it's full of excessive stuttering. These are all professional voice actors who did amazing jobs while on stream. But in the studio? Apparently, they aren't very good I'm finding out. It's appalling.There's many more things wrong with this show but this is all I can think of for now.I know this was a passion project for CR and all that and they really wanted it to work. But it just goes to show you, just because someone has been in a lot of tv shows, doesn't automatically mean they can make one. I see now why they are voice actors and not directors. I shudder to think what season 2 will be like.",
            "review_date": "2022-02-11"
        },
        {
            "review_title": "A beautiful and refreshing animated dark comedy",
            "content": "The series talk about the adventures and misadventures of the group Vox Machina, a hilarious comedy with a new component in each episode that's make you want to see all episode in one round.",
            "review_date": "2022-02-25"
        },
        {
            "review_title": "Exactly what I expected",
            "content": "Had high hopes for this show. It met them. Felt good. Also lots of male genetalia jokes. Can't wait for the whole show to be released. Also season 2. 10/10.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Glorious!",
            "content": "I had high hopes for the the legend of vox machina and it has surpassed everything I wanted it to be, being both hilarious and gloriously violent at the same time. The upcoming Whitestone story arc is somewhat of a darker tale and it will be very interesting to see how the series handles this, very well if the first three episodes are benchmark I believe that it will be even better.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "A quirky show to watch on the side, but overhyped",
            "content": "I have currently watched 9 episodes, as the last three haven't been released yet, so my review will obviously only take into account what has been released so far.I will also try to not put in spoilers and talk about this as generally as possible.So first of all, I am not a fan of Critical Role and I have not watched the original campaigns. I do however have many friends that are huge fans of the series, so I was roughly aware of the premise.From what I gathered, the general consensus of the fanbase has been very positive, and I am very happy for them! I will however look at this from the perspective of someone with no real ties to the source material and just talk about my opinions on this as an animated series first and foremost.The premise of the adventure is pretty generic, with a mostly stereotypical cast of characters. You have an awkward druid, a horny halfling (?) bard, a (trying to be) suave half elf and his greedy sister, a serious dude with a gun, a dumb big guy with a heart of gold and another halfling cleric who seems to struggle with her god.THE GOOD:The art: The characters in the show look pretty. The backgrounds are gorgeous. The animation is not mind blowing and cannot compare with things like Legend of Korra or Castlevania, but it is decent enough! Knowing this was funded by kickstarter money, I am impressed because this looks polished and like something I could see on television. Some of the 3D looks outdated (especially in episode 1), but that is fine considering the budget they probably had.The intro: The intro is gorgeous. The animation of the show is not as good as the intro, like in many animes, but I actually found myself searching for it on youtube just because I wanted to see it again.Staying faithful to the original: As far as I understand from my friends, nothing has been changed too much in this adaptation lore-wise, and I can respect that! Nice!Voice acting: The voice acting is pretty decent. Some of the main cast are AMAZING and sound very genuine (Scanlan, Pike, Vex, Percy), but there are others that sound a bit too.. Over the top. A bit too much like a generic anime dub, and that breaks my immersion a bit (Vax, Grog and Keyleth at times). Some of the character interactions are genuinely funny though, and I like that the conversations between the heroes do sound organic, with the constant banter back and forth.The music: The music is decent. The main theme is memorable enough.THE OK:\nThe story: The story is very generic in my opinion and the character arcs as well. It's not bad per se, but it's not something that instantly hooked me either. I was mostly just hooked by the premise of \"DnD show made into a cartoon by kickstarter money\". It doesn't really stand out yet. The first three episodes suffer from the shaky legs syndrome, where the pacing feels a bit all over the place. The first one is filled with cringey things during the introduction, but I assume it is there to introduce the audience to the general \"yes this isn't censored, we actually put this in\" vibe.For better or worse, very dependant on what you want to see from this show. After those first 3 episodes it does pick up though.THE BAD AND UGLY - Direction, Length of the Episode and the Adult Content:Ok. I have a lot of problems with the show. It's not the worst show I've seen, but also not the best. It's... Ok.My biggest gripe with the entire series is that it tries to stand out because it's an \"adult show\".Now, here's the thing: The show has A LOT of cringey and yucky scenes and does not shy away from crude jokes, hinting at genitalia, sex and gore, but it does not make it feel adult. In fact, somehow despite all of this, it feels incredibly childish BECAUSE of that. This is the kind of humor pubescent teenagers like, period. And that's okay, but hyping it up as an \"adult show\" with these themes does not cut it. It is simply a very vulgar show.There are hints of adult themes in this that felt serious at first, but then the direction of the episodes usually fell really flat.The biggest problem of this series IS the Direction. I am going to try and explain it:\nThe way a show treats its audience, indicates heavily if it's for adults or not. Cartoons for kids for example will usually try to chew things out for you, show very obvious scenes and metaphorically push your nose into the plot. Shows for adults on the other hand do things much more discreetly. They will hint at things here and there, and give you the opportunity to read between the lines, and maybe even theorize yourself. \"Show - Don't Tell\" is where a good adult show shines.The Legend of Vox Machina does not really do this (well). It is directed like a kids show, to put it simply. Flashbacks are shown too early, a character's distress will be shown directly in relation to a completely new element that is introduced, and you get to the narrative conclusion in your head about 3 minutes into the episode. As a viewer, you don't really get the chance to be shocked or surprised, because the plot points play out in such an obvious way. The audience is basically treated like dummies.As an example: Avatar was a show for kids with none of the sexual innuendos TLoVM had, and it felt miles and miles more mature than this.If I had to guess, a big reason for this silly direction is probably the length of the episodes. 20 minutes seem enough at first glace, with how long the episodes *feel*, but that is because it's trying to rush through most of the plot in a more superficial way without appealing to emotional storytelling beats. It is in my opinion nowhere near enough to establish all of these plot points in an actual satisfying way though. This really dampened my enjoyment unfortunately.In conclusion, I think it's ok. It's nothing special (except the fact it was made with kickstarter funding and is based on a dnd show) and it does not come near other western animation like Netflix Castlevania or Arcane, both in animation or narratively. Story and pacing wise, there is still a lot to improve. It's good enough to kill time with, or maybe use it as a teaser to get into the actual DnD show, which is much more compelling and complex as I understand. A good way to imrpove it imo would be less episodes, but make them about 40 minutes each. Don't try to imitate anime or a specific media, just try to make a good film/show.I don't really understand the high rating and I assume it must be the excited fanbase, but perhaps I am simply too critical. This is after all, just my subjective opinion.Tl;dr: This is a fun, quirky, light hearted show with cringe humor but pleasant art. It's good for popcorn cinema, but don't expect a masterpiece of storytelling from this.",
            "review_date": "2022-02-13"
        },
        {
            "review_title": "Awesome show",
            "content": "Very good adaptation from the D&D campaign to animation. Good character development and story already at the start and fantastic action scenes. Fulfilled all my expectations and incorporated D&D mechanics and campaign moments wonderfully. Needless to say, the voice acting is phenomenon. Overall an absolute joy to watch and re-watch.",
            "review_date": "2022-02-03"
        },
        {
            "review_title": "Booooooring......",
            "content": "Cheap animation, bland graphic style, silly sex jokes, ultra generic characters and intrigues.... What else? I watched the first 3 episodes and i surely won't watch the others coming...\nthe only positive thing comint out of this show is that i miss the original dongeon&dragon animated serie.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "8.9 Are you kidding? Well, based on the idiotic humor it has, you probably are",
            "content": "I like fantasy. I like light hearted fun. I like good humor. I like adventure flicks.However, the humor in this series is sooo bad, immature, lame, childish, forced that it ruins the whole experience.I give it 5 point because I'm curious about the whole world and the lore, and maybe the characters too but the humor is so freaking bad I watch it cringing almost all the time (yes, that much humor they use).",
            "review_date": "2022-02-03"
        },
        {
            "review_title": "The Legend of Vox Machina season 1 (2022, Amazon Prime/Critical Role) Great adult fantasy animation entertainment",
            "content": "'Vox Machina' is a 12 episode animated fantasy series that debuted on the Amazon Prime Video streaming service in January of 2022. One of the more fascinating things about this production has nothing to do with what you see on screen. Instead how the production came to be is at least as interesting as the rollicking fantasy adventure. There is a group of D&D players called Critical Role who turned a D&D campaign into a very successful, if somewhat niche, podcast. Those folks then launched a Kickstarter to produce an animated special and it was so wildly successful that the special became a legit show with the streaming rights acquired by Amazon.The show features a band of 7 adventurers in the land of Tal'Dorei seeking fame, gold, wine, women and song; all of the things classic adventure groups crave. It is a prototypical group featuring such character archetypes as druid, warrior, ranger, cleric and the like although it does dawn on me with some astonishment that there group does not possess a traditional mage. The bulk of the show has to do with the intrepid group investigating the mysterious Lord and Lady Briarwood who have taken over the city/land of Whitestone. One of their group, Percy, was a lord in Whitestone as a child before the Briarwood's came along with their contingent and slaughtered his family so now he and the rest of his Vox Machina crew are looking for answers and vengeance. There are various side quests and plots, but all of those serve this primary narrative. All of the dominoes steadily fall with some twists and turns as Vox Machina close in on the Briarwoods and find out the nature of their secrets as well as some dark secrets of their own.This show is a heck of a lot of fun. It is cool as a kid to be enamored with the old Dungeons & Dragons cartoon and now flash forward to adult hood and there is a much grittier adult style take on that cartoon. 'Vox Machina' doesn't bare much resemblance to that old cartoon, but the D&D link connects them in my mind. 'Vox Machina' is much more adult animation and doesn't shy away from swearing, violence, dark thematic material or nudity. Another great aspect to the show is its humor. While I wouldn't strictly lump it into the comedy genre this does have a lot of funny, comedic elements to counterbalance the darker violence and adventure tones as well. Only one season into its run 'The Legend of Vox Machina' has already been renewed for two more seasons. If you have any interest in adult fantasy then this is not a show to miss.Eric's Grade: A-",
            "review_date": "2022-10-20"
        },
        {
            "review_title": "Passable at best",
            "content": "The show is in desperate need of better writing. The dialogue is generic and the scenarios felt bland. Maybe I would enjoy this more if I was a D&D player, but I feel a good story should be able to stand on it's own.",
            "review_date": "2022-02-14"
        },
        {
            "review_title": "I. Would Like. To Binge.",
            "content": "I'm coming at this review from a specific viewpoint. As a person who already loves CR and happens to think Campaign 1 is the best of the three.The animation is very nice. As a person who doesn't watch a lot of animated stuff however, my knowledge is limited. I have enjoyed Final Space, Arcane, and Invincible however, and found the style to be of the same quality. (Not on the level of Arcane, but what is?)The plot is a tricky one, as I already know it. It moves a lot quicker than the live stream, but of course it has to. They don't have 400 hours like before. I do find it very compelling, the characters are fantastic and it's such a good feeling to finally see these people that I love come to life in this way.As is to be expected, the voice acting is superb. Not just the main cast, but everyone does a fantastic job. If you have watched CR before there will be Easter eggs for you to find and some funny DnD references to look out for.The Briarwood arc was something very, very special in campaign one (even though Percy is my least favourite member). And the talent these guys have assembled, and the love they have poured into this show is evident in every frame.Yes it has blood and swearing, and no. It isn't suitable at all for children. But is it childish? No.It's like real life, most of the time we are trying to keep things fun and positive. We laugh when we can. But there is some heart in this too, and knowing where it goes, it's going to get very emotional.Absolutely love this show so far, I'll be rewatching it a few times no doubt. If you dig fantasy, or DnD, or swords and sorcery. Like I do, give it a go. You'll probably be very pleasantly surprised.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Cliche cringe and woke nonsense",
            "content": "Where to start?Bad writing, cliche stories, tired old tropes, the people behind the laughable campaign malign every good Dungeon Master out there.For one thing, this should have been set in Greyhawk or Faerun. Homebrew is a terrible way to try to show Dungeons & Dragons(D&D).Voice acting was awful, overly filled with people trying to out do each others next line.Pacing and story board structure was full of bad tempo.As someone who grew up with and played D&D with the inventor Gary Gygax himself, he is spinning in his grave over this treatment of his beloved game.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Brilliant start",
            "content": "Characters a spot on and love the feel. Bit too much swearing sorta takes you out of a fantasy world a bit but other than that perfect.love the animation so spot on for what I expected and I expected alot from This and it been waiting so long looking forward to this.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Fans of Critical Role - You know what to expect and it delivers",
            "content": "I stumbled across CR and die laughing. When this first came out I had no idea what it was and didn't give it a shot until I found out that it was CR made to an animated series.Those guys are just all around awesome and insanely funny people. These episodes are taken from the CR series. If you were/are a fan of them, you'll enjoy this without fail.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "Tale of cool characters",
            "content": "Season one is a slightly above average story that doesn't really shine anywhere but is still good enough see the potential of a good show. The characters get better as the show goes on and you start knowing them but the character development is very slow. I have mixed feelings on the characters, Percy and Pike are great and have nice backstory. Keyleth and the twins are likeable and cool but they're not really developed. The humor is either Grog being dumb or Scanlan cursing, they're not great. The story is nothing special as it's just a group of warrior doing quest, it's not bad but there isn't much substance for the first half. Not much is explained, you're thrown in the show and expected to care, I've learned later why but I've not seen Critical Role so it wasn't great for me. The animation is pretty standard but the action is pretty good, it's probably the highlight of the season.Season two is an improvement on pretty much every level, apart from the animation who's still pretty standard. The characters were likeable by the end of the season and now they're great for the whole season, apart from Scanlan who's still pretty annoying. Grog is the most improved elements of the show, he has a good backstory in the season and becomes more than a comedic relief. The twins also got a backstory which was pretty interesting and Keyleth was used more as a character, the rest of the characters were as good as before. On a story level it's much better, there's not a lot of boring moments and every episodes have something to offer.Season 1: 6.5/10\nSeason 2: 7.5/10.",
            "review_date": "2023-02-22"
        },
        {
            "review_title": "Made out of a passion",
            "content": "You can see this was made with a sense of passion for D&D, by people who love what they do. It's fun and well made. A great mix of quirky, diverse and interesting characters, simple but intriguing stories. One for us D&D nerds but open for almost anyone... not kid friendly though.",
            "review_date": "2022-02-20"
        },
        {
            "review_title": "A Brilliant Adaptation So Far",
            "content": "Only the first three episodes have been released so far, but that's plenty of time for the cast and crew to show off their chops. As a fan of the original critical role campaign, I was confident this show would be good, but I wasn't sure how much of the original story would have to be sacrificed to get everything down to a reasonable length for TV.I need not have worried. I should've known that no one knows or cares more about the story of Vox Machina than the players who created them. Not only is the show 100% loyal to the personalities of the characters and the energy of the show, it also manages to preserve the most impactful moments from the campaign with practically perfect fidelity.I can't recommend this show enough.",
            "review_date": "2022-01-31"
        },
        {
            "review_title": "Just not good",
            "content": "I'm a big fan of Critical Role, I watched every seasons so far, but I really find this animated serie horrible. It's like they are trying too much. It feels really forced. The voices are not natural, they sounds very caricatural, like If every sentences had to make a big impression, it feels like I'm at the theatre. The constant juvenile jokes are also really heavy and annoying, it's like I'm watching an improved version of Looney Tunes. Even the story is very simple. I just don't have the good vibes that I have with critical role. I know it's not the same format but I was hoping to find the same pleasure watching it.",
            "review_date": "2022-02-02"
        },
        {
            "review_title": "I don't watch cartoons",
            "content": "This has popped up enough on Amazon suggestions and I always discard it. Saw a list on here of Shows of D&D and the next time I saw it, I selected it.I watched about 5 episodes the first time playing it (they are all short) and found myself enjoying it much to my surprise. I really expected to drop it like I do midway through a latest installment of Jackazz.The story themes are a lot like a session of D&D, not a bad thing. The banter is a lot like you find with a group of friends while playing DDO. The actors seemed to know each other quite well. Reading a bit more about it, they have been doing this together for years. It shows in a good way. There is a lot of creativity in the world of D&D so they won't lack for material. I expect this to be very good for a long time.The bad: The quantity of \"adult humor\" is overboard. It comes of as \"We're not a kid show, really!\" Throw a bit in once in a while and it would be effective without desperation.Mixed bag: The writing is good almost always but does rely on.worn tropes, which I was expecting so wasn't a problem. It just seems like it came from their sessions. The \"bad guy\" in the first couple episodes did trick me even if it seemed obvious after.Overall it is a fun watch with quick episodes that keep you interested. I gave it a 6 when I first started writing this but bumped it to a 7 before clicking submit. As they refine things in future seasons it could become an 8 and a 7 for cartoons is high praise from me. I am on episode 2 of season 2.",
            "review_date": "2023-03-14"
        },
        {
            "review_title": "Wow..",
            "content": "I love CR. I laugh, cry, rage and cheer of joy with the live streams. This however did not feel right to me at all. The animation style, given the money they had from fans and Amazon, was not as good as it should have been. The storytelling was off, the pacing just felt wrong aswell. I wish i could be more positive about it, but i can't.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "It's fantastic - well worth the wait",
            "content": "I've been waiting for this series for 3 years now and I've been a fan of the webseries well before that. It's funny, touching, violent and sincere - everything I was hoping for.",
            "review_date": "2022-02-04"
        },
        {
            "review_title": "Quite easily the worst thing I've ever seen.",
            "content": "Juvenile and disgusting humor, jarring shifts in tone from goofy (and immature) to serious (and unconvincing), combined with shallow and unlikeable characters. The Legend of Vox Machina is a show for people who pretend to like tabletop roleplaying games but have not ever played anything beyond Hasbro's hijacking of the hobby.Actual roleplayers will be confronted with a show that is clearly just the presentation of one particularly bad group's personal roleplaying game story, presented in offensive and in-your-face cartoonish style to really drive home how childish this inappropriately offputting show actually is.",
            "review_date": "2022-09-04"
        },
        {
            "review_title": "AMAZING",
            "content": "This show is funny, creative, and just overall amazing. I had no other context to this show about it being tied to something with DnD but think it was fantastic non the less. Can't wait for more episodes!!!",
            "review_date": "2022-02-07"
        },
        {
            "review_title": "Really bad adaptation of a good twitch/youtube show",
            "content": "I had some expectations for this but what makes the original show good is lost in translation in the animated series. Having professional actors in a dnd settings and watching them roleplay, improv and play off each others in different situations is what made critical role something worth watching. Once You remove all those good things you end up with a subpar story for a subpar animated series. I really didnt feel like watching an adult show if it wasnt for the unnecessary gore and swear words..",
            "review_date": "2022-02-03"
        },
        {
            "review_title": "A slog fest",
            "content": "I'm trying to like Vox Machina but it's just not clicking. I find the animation lackluster and attempts at humor somewhat forced. I do like the gore. Idk, guess I've been removed from D&D longer than i thought. I still watching, so I gave it a 5.",
            "review_date": "2022-02-11"
        },
        {
            "review_title": "A jolly good time",
            "content": "Nice with some adult entertainment literally speaking. Really captured the spirit of Vox Machina and went all in: Gory, nasty jokes, nudity, did I mention gory! Vox Machina is such a lovelly bunch of misfits but with a tad of heart. Story starts with a bang and then keeps going, jokes are sharp and childish and the action brutally delightful. Having a blast so far!",
            "review_date": "2022-02-02"
        },
        {
            "review_title": "A heartfelt, beautiful, well-made animated series",
            "content": "This is a wonderful show. Many of the negative reviews seem to focus on the profanity and explicitly violent and sexual nature of the show, including one that gave 1 star simply for not being appropriate for kids. It is true. The show has nudity, violence, and profanity, but the promotional material does not attempt to conceal this. If non child appropriate media isn't your jam, don't watch it. But also don't drag a show for being exactly what it promised and not adherent to your personal values.This show is hilarious, emotionally charged, and full of BEAUTIFUL animation. The voice acting is superb and the script is tight.",
            "review_date": "2022-02-03"
        },
        {
            "review_title": "Decent Animation and great voice acting but that is pretty much it.",
            "content": "The animation is decent, the bgm and voice acting is great. The plot, character development and script is terrible. Just including profanity, gore and some nudity does make an adult show. The character themselves have no depth, they are as stereotypical as possible. The comedy is completely in the line of toilet humor. The biggest problem of all is how cringe the dialogues are and how terrible the interactions are, i would imagine this is what a teenager believes adult speak like.If they spent sometime developing the characters and asked some moral questions while making fun of their situation, it would make for a better show with more adult themes. With the way the first three episodes are, I have pretty low expectation for the rest of it.",
            "review_date": "2022-02-02"
        },
        {
            "review_title": "Pretty good but what was that start",
            "content": "Start = bad. It just does. Way too rushed but whatever.16.6% of the show is 10/10\n33.3% of the show is 9/10\n25% of the show is 8/108.3% of the show is 6/10\n8.3% of the show is 5/10\n8.3% of the show is 1/10The briarwood arc is brilliant. The humour, especially in the first ghastly episode, is very immature and childish but there are moments when it is quite good, i.e. See the scene spent on the door. When the show is more subtle with the humour, the better it is.First 3 episodes are incredibly rushed and Grieg's fight has no weight to it since we don't know who this guy is nor do we care about him or the rest of the cast.This show is made for the fans obviously and it's meant to be a testament to how brilliant this group of DND players are, but for anyone new watching, they should really just skip over the first few episodes and just watch the Briarwood arc. Sure you might be missing some context for initial character relationships but you'll get that anyway in later episodes. And by god, missing the gratuitous caricature of what could be called a pilot episode is worth it to get to the marvelous writing that is the Briarwood arc.",
            "review_date": "2022-05-01"
        },
        {
            "review_title": "Brilliant and absolute fun",
            "content": "The absolute best adaptation of a Dungeons and Dragons campaign yet. It's brilliant, fun, fast-paced, violent, and just hilarious. Packed with easter eggs for hard-core Critters out there, while for new fans the story is engaging, characters are anything but bland and have room to grow. Simply a very fun show.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Better than I ever imagined",
            "content": "As a fan of Critical Role but also objectively as an interested animation viewer I love the vibe of the series. Dark and horrifying when it needs to be interlaced with comic relief. Personal development of the characters, cliffhangers and good adult entertainment and incredible attention to detail merging western animation with anime.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "Absolutely Hilarious",
            "content": "Now THIS is worth your time. If you're an adult and you like D&D, or any RPG/Fantasy at all really, check this out. Absolutely hilarious animated series. Stop reading and just give it a go!",
            "review_date": "2022-05-16"
        },
        {
            "review_title": "Enjoyable and worth a watch for fantasy fans",
            "content": "Great for new people unfamiliar with the story and the characters if you don't mind the vulgarity and also amazing for long time fans. The characters feel fleshed out and everyone gets their chance to shine. The animation isn't anything new (classic Phil Bourassa design) but with added character. The soundtrack is honestly amazing and deserves a listen on its own, really elevates the series. The story may feel rushed and roughly paced at the beginning but it really amps up after episode 2.",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "How to take 10 hour and make it a 30 minute show",
            "content": "To ever one saying this is to catering to the fan of critical role look at you funded it we the fan this is how shows should be made. They made a show that struck by the original material the same kind of jokes andthe same kind of pacing and relationship building that it's all based off of. So how can you leave a Low review because something follows the material The show was not made for the masses it was made for the people that tune in every week made for every fan of DND it was made to bring forth more interest this shows the essence of DNd being in a room with your friends making bad jokes building a world together.",
            "review_date": "2022-02-21"
        },
        {
            "review_title": "A very obviously biased review",
            "content": "After reading some of the reviews I've seen many mentions of the \"inappropriate\" language and a perceived rushed aspect of the show, the aforementioned I find very silly in contrast to the violence and the latter I agree with to some extent.Vox Machina was funded by its creators and then got picked up by Amazon as a basically finished product, so they condensed a compelling story arc to fit within the budget that they had. If it gets picked up for another (preferably longer) season then we will get to know the characters beyond their façade.What's interesting with a series based on a campaign spanning years is that first-off there's so much material to draw from and secondly that the \"writer\" of this show did not create his main protagonists. In D&D every character has their own writer and therefore they all inhabit their own style. This makes for a natural motley crue that feels truly alive.If you wish to see something truly amazing take its first steps then I recommend you watch Vox Machina.",
            "review_date": "2022-04-13"
        },
        {
            "review_title": "If I could vote 0 stars I could...",
            "content": "This show is terrible. I couldnt even get through the first 10 minutes because every 10 seconds there was an f bomb, or other unnecesary language. Also, full on cartoon nudity? Wtf?! I shut it off when the green gnome creature was eating out the green elf lady. Absolutely disgusting. How this has 9 stars overall is a mystery to me! Stay away, especially if you want a wholesome fantasy show.",
            "review_date": "2022-02-02"
        },
        {
            "review_title": "Love it!",
            "content": "Half of these reviews are garbage reviews made by garbage people.The people who have reviewed the series without any knowledge of source material- trash. The people offended by swearing-trash. The people who just don't know how to sit back and enjoy something-trash. This show is fun and stays true to the source materials, at the time of this only 6 episodes had been released and you have clowns writing off the season without knowing what happens next.",
            "review_date": "2022-02-05"
        },
        {
            "review_title": "I wanted to like it, but just can't.",
            "content": "This show is essentially sheer ego stroking.After years of having hundreds of thousands of people sit around while they filmed hundreds of 4+ hour episodes where you got the privilege of watching trained voice actors play DnD around a table, and making bazillions on their Kickstarter, clearly the fame got to their head. Now it's more about them than the characters, the plot or the setting.So, if you want to watch anime style animation that doesn't jive with a bunch of Millennial and Gen Z slang that could have dropped right out of any modern, hip, sitcom or web series, so none of their dialogue fits at all ... be my guest.If you want sarcastic, snide Millennial and Gen Z insults and humour to pepper the whole thing, so it's like you're sitting on a bus, surrounded by university students making fun of each other ... be my guest.If you want to marvel at the clumsily introduced EDI inserts that are so literally scripted and dropped in that you cannot but think that they were literally working to a checklist ... be my guest. I especially loved the bearded magic shop owner in gaudy, Romani style make up, the pansexual gnome that can't keep it in his pants for more than 30 seconds, or - the piece de resistance - the 'master hunter' in a wheel chair. I mean, seriously, how do you get to be a master hunter when you can't even go into the forest? Onto a mountain? Do four of them carry him in the wilderness so that he can feel like he fits in? When you feel you need to insert this nonsense into a fantasy story where it clearly sticks out like a 21st century identity politics it is, you're missing the point of being a storyteller.Above and beyond that, the pacing is just ridiculous. You drop right in the middle of the first campaign and you're literally in the middle of the celebration of their victory when the attack that drives the second campaign hits. Sure, it's based on some actual DnD campaigns, but come on, let them get a beer. Give the audience a bit of a denouement.So, I made it about half way into the second season and then called it quits. I know all kinds of people who watched the original Critical Role series and loved it, and they also love Vox Machina, but they are all 20 years my junior and they couldn't give a fig about character, plot or setting. Just be sarcastic and charming and entertaining and they will worship the ground you walk on, to the tune of 12M buckaroos. You don't need to be good at telling a story or playing a role, you just have to be audacious. Apparently.No thanks. Even my own DnD campaign has more maturity than this lot.",
            "review_date": "2023-02-19"
        },
        {
            "review_title": "Luckily not a natural 1, unfortunately not a natural 20 either",
            "content": "While most certainly biased, this review aims to be as objective as possible.The show may very well be characterized as fan service, for better or worse.A lot of the jokes simply won't hit the same without knowing the source material or other geek subculture factoids.A good chunk of those jokes won't hit at all, but rather fly over the heads of people who ended up watching it randomly or by proxy.Personally, I do not think this makes the show worse or better. It is the way they chose to go and the reception to that has been mixed by fans and newcomers alike.The voice acting is the best component of the show. All of these people have been in the business for decades and it is evident.If you like video games and animated shows but know nothing of the cast, you might very well have moments where you listen to the character voices, certain you have\nheard them before, but unable to pinpoint from where.Or in case of characters voiced be Mercer... your reaction would be more along the lines of \"HOW IS THAT THE SAME PERSON?!\"The pacing is off. This is something everyone, including the cast, seems to agree on. The first two episodes are the worst of the bunch in that regard.This is most likely the result of the cast expecting the project to be much smaller in scope when the kickstarter happened, and the result of cramming dozens of hours of\nDnD sessions into a 30ish minute animated episode. It is not nearly as bad later on in the season. Probably because the remaining episodes of the season focus\non a different arc, resulting in more time to tell the story.On the subject of story, adamantly wanting to avoid spoilers, I will only say that it is great. This is a matter of personal preference, however.You will have to look elsewhere for further insight into it.The writing however, is again, hit and miss. A good chunk is not only lifted directly from the sessions, but improved upon due to hindsight and retrospect.It is much weaker in some episodes. (again, the first two) and feels very much like it picks up the slack in episodes written later on.(Sam Riegel, Travis Willingham, Ashley Burch and Marc Bernardin did awesome work)The animation is very mixed too. The worst of it comes from the mixture of 3D and 2D animation done at the same time resulting in such a terrible clash on screen.It is almost disappointing and may very well pull you out of it, especially the first few times it happens. Luckily, the 2D animation by itself ranges from\naverage to absolutely impressive.One thing I will admit and have discussed with other critters is how much more brutal the show was than we expected. While the nudity and sex related content\n(which are always done as a joke or simply a funny scene) are a factor in classifying it as an adult show. It pales in comparison to the blood and gore visuals,\nwhich are done without the tongue-in-cheek factor the former thrives on.All things considered, I find recommending the show depends very much on your taste, interests, and how repulsive you find the visuals.I've been looking forward to it since it was announced, and it actually pains me to give it a 7. I chose to do so because there is much room for improvement.Hopefully it is a matter of the team settling in into the format and it is only uphill from here.",
            "review_date": "2022-02-26"
        },
        {
            "review_title": "Azula's voice actor on the show",
            "content": "I'm enjoying watching this show because the actor who play Delilah Briarwood is same actor who is play Azula from Avatar The Last Airbender. The show is extremely awesome. I hope can see more seasons of this awesome show.",
            "review_date": "2022-08-19"
        },
        {
            "review_title": "Finally a work of fantasy fiction for table top RPG fans!",
            "content": "A wonderful show that anyone with actual table top role playing game experience can relate to. Filled with an all star cast of some of the most talented voice actors in the industry. I need more seasons!",
            "review_date": "2022-06-28"
        },
        {
            "review_title": "Different.",
            "content": "If I hadn't seen the campaign before the animation I would've liked this series far more. Unfortunately they changed the story so much it had little to do anymore with what I watched before, apart from the characters and the Briarwood storyline, more or less. I'm certain there are many people who have no problem with that, but I'm not one of them.Combine that with the use of certain tropes I've already gotten quite tired of seeing has led to this rating.So if you have no problem with watching the Briarwood campaign but quite different, go watch this. But if you're more like me, don't.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "Finally",
            "content": "Finally great animated fantasy series for adults what is in every aspect good if not great! Funny! Good characters witch showing growth apart of some but I guess you can't make one season about every main character! Good storyline! Action in every episode but it's not forced! Gore, foul language and sex witch show that real life is no fairy tale for kids but also didn't over did it! Everything you think of when you looking for great fantasy cinematography experience this series have! I have watched through that in one sitting and I wish to see more series well done like this one. Definitely wort to watch and I'm inpatient for next season.",
            "review_date": "2022-09-01"
        },
        {
            "review_title": "Best D&D show ever",
            "content": "It definitely is for a mature audience but what a show.It is funny, full of adventure. The team behind the show are well aware of what a D&D adventure should look like.Can't wait for the second season.",
            "review_date": "2022-07-24"
        },
        {
            "review_title": "Fantastic",
            "content": "Good writing and amazing voice acting ofcourse. Never seen the Vox Macina campaign but this series gives you a great peak at their group dynamic.Cant wait for season 2.",
            "review_date": "2022-02-12"
        },
        {
            "review_title": "Proud of the critical role team, but the show falls flat",
            "content": "I've been a fan of CR for 2 years and watched much of camaign 2 and 3 as well as EXU.While Im so glad to see the CR team produce a show and all the kindness thrown their way, this does not meet the standards of your typical show.As someone who watches quite a lot of anime and general TV, this show lacks what is needed to craft a well established show.The pacing is very fast, the characters do not spend time to get developed, and the emotional gravity fluctuated quickly. Voice acting is amazing as you'd expect, but as a stand alone, this show feels more like an ode to CR and their achievements than a digestible fantasy show for the mass market.If you are a fan of CR, I highly recommend this show to enjoy their vision and support them, but if you see a score of 9 on IMDB and think wow this is going to be the next big thing, I think you will be sorely disappointed.Its got good voice acting, some hit or miss comedy, ok action and gore, and a off the rails pace. If you compare this to the likes of Arcane, or fantasy shows like Re:Zero, this show feels lacking.",
            "review_date": "2022-01-31"
        },
        {
            "review_title": "Not the D&D R rated cartoon I expeted",
            "content": "First I have never listened to any Critical Role. The Animation is great, story is decently written and acting is pretty damn good. My problem is they spent two episodes fighting a Dragon and the rest of the series is a Vampire Psychodrama. They blew their load on the first two and it was downhill from there for me. It did feel as if there where dice rolls dictating the events. Love Laura Bailey but I was not expecting an English Accent, was hoping she would be using her Keiko voice. Worth a watch.",
            "review_date": "2022-02-25"
        },
        {
            "review_title": "Check the rating Before letting your 13 year old Daughter watch it.",
            "content": "My daughter put this on While eating breakfast. I walked in the door as a Gnome Bard seduces and goes down on an Elf Bar maid. My daughter shot milk out her nose. Beautiful art style and voice acting.",
            "review_date": "2022-02-07"
        },
        {
            "review_title": "I laughed, I cried, and I want MORE!!!",
            "content": "It's just like listening or watching them play on the tabletop, Only now we can see what the characters would look like in the world Exandria. The cast, crew, producers and everyone involved put that crowd funding to good use and we are blessed to have an amazing product at the end, which hopefully is not only loved by fans, but also by newcomers as well, as there's so much to love and there's always the original content they have from the table top as well. If there's one negative thing, it's that there will always be a want for more and having to wait for another episode is just like having to wait another week for critical role to have another session. Is it Sunday yet.",
            "review_date": "2022-02-12"
        },
        {
            "review_title": "A promising IP with a lot of room to grow.",
            "content": "Given the nature of fandom I will say up front I am a Critical Role fan. In that regard the series already satisfies what many of us fantasied about since the inception of the actual play. However for a review from a more objective stand point continue reading.Only three episodes have been released so far, so if I can edit my review after the release of the entire season I will. Also know upfront, this isn't a show for kids or the prudish.Episode 1 introduces to us the characters at a time when they are down on their luck, most of the episode is given to developing the characters and does an ok job. The first couple episodes suffer from pretty severe tonal whiplash at times. It also sets up an overly humorous atmosphere which I don't think translates as well in a purely narrative endeavor compared to the kind of table humour an actual play series can sustain. That said the third episode really got the balance right in my opinion and I expect sets the standard for what we'll see going forward given what I know about the events to come.In between all of that though were some really heartfelt emotional and inspirational moments pretty typical of the fantasy genre. The show certainly leans into its tabletop roots with the story telling and action pieces which I'm sure will delight many and probably put off a few at the same time.The first mini arc contained within episodes 1 and 2 really feels a little rushed and I do wonder how well those episodes will hook in viewers who aren't already acquainted with the characters. The story itself is quite generic for the genre, though this is typical of many introductory stories where you're trying to set up the meaty \"main quest\" as quickly as possible.In fact I would go as far as to say you could comfortably start at episode 3 if you are not already a CR fan. The episode is well paced and does a good job at setting up the right amount of intrigue. The Briarwoods, set up as the villains for the series, were the highlight of the episode, especially Silas, voiced by Mercer who in my opinion steals the whole episode with his performance. Though a couple of narrative decisions could have been executed better as I could see them being a little confusing to those without the context of the original material.I can't comment on the quality of the animation because it's just not something I really pay attention to whilst watching a show.Overall though the show was very fun to watch. The voice acting was top notch, unsurprisingly. If the show continues with the quality shown in episode 3 this will develop into a solid series that anyone who is into fantasy and adventure will enjoy.",
            "review_date": "2022-01-31"
        },
        {
            "review_title": "Loved it",
            "content": "Played dungeons and dragons online for years and this is like the game brought to life just more raunchy. Really good and cant wait for more. Kids have seen worse these days so prob 12 and up is fine.",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "Could've been better",
            "content": "It's quite underwhelming to be honest. Pacing was bad and the story wasn't that captivating. Hopefully things will pick up as the season progresses otherwise it'd be a waste of such a stellar voice cast.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Nostalgic Adventure",
            "content": "In a time of wokeness and political correctness, this show dares to return to a time of integrated plots, character development, and story telling. Everything presented in this first story is truly integrated and doesn't feel forced which gives true immersion into the world filled with characters with interconnected backgrounds and interpersonal relationships already established. The background reveals of Percy throughout this and the political ties of multi realms is believable through the lens of both fantasy and realism as you take this walk with such a wonderful voice acting cast and deeply developed world.I can't describe the nostalgic feeling I felt, almost like a 39 year old man transported back to his teenager years rolling dice in the living room of friends, laughing at the jokes, anticipating that 20 and feeling despair at that 1. Through the ups and downs you felt it all and this is the first D&D adventure that I watched that gave me those childhood memories back in vivid clear photoesque remembrance as the character development progressed surrounded by drama, comedy, loss, and true story driven content, no matter the skin color, sexual orientation, gender, etc... This is how story telling is meant to be. Wonderfully done.",
            "review_date": "2022-03-10"
        },
        {
            "review_title": "It's not to bad",
            "content": "Do I like the show and will I try to keep up with it? Yes. Do I think it's incredible? No. The animation is barely passable at times, some of the humor gets a little overboard to the point it leaves me almost rolling my eyes, and the plot is generally pretty generic. On the flip side, a lot of the character interactions are nice. Not all the jokes are awful, the art direction for the most part was really fun. It felt like a more adult version of avatar or the dragon prince in terms of characters and show feeling. Also, for a show funded by a kickstarter campaign, really not bad! (Political portion ahead) I also really like how the characters that are coded to be non binary and gay were played very tastefully. I could see anyone as them, and they felt natural to the setting. It really felt good to have something like that done well and feel normal.",
            "review_date": "2022-02-02"
        },
        {
            "review_title": "A good fantasy cartoon that attracts the mature audience",
            "content": "I had my doubts at the start, but the series gave me joy watching it.They bring great animation, voice acting and writing to the series.Would recommend it to anyone who would like to start a new binge.",
            "review_date": "2022-03-01"
        },
        {
            "review_title": "Bringing life to the characters!",
            "content": "I've seen every episode of every campaign, and Campaign 1 was always the hardest for me to connect with. This show offers perspectives body language, bringing warmth and depth to these characters! I'm so excited about the next episode!",
            "review_date": "2022-02-13"
        },
        {
            "review_title": "Gets better with time",
            "content": "I wasn't excepting Season 2 will be that good. Honestly, they stepped up their game in season 2. The episodes are HOT from the beginning. I can't wait for more.The transformation of characters and the backstory is just amazing. Grog is my favorite character of course.The graphics is so good. I just wished for some characters not to be in 3D (won't spoil which ones).The music is good. Could be better though.The last three episodes took me by surprise. The battles were awesome.Season 1 was just an introduction. There is more to come I am sure.Definitely not for young kids !Good job Amazon.",
            "review_date": "2023-02-17"
        },
        {
            "review_title": "Juvenile and Annoying",
            "content": "Bogged down by dick & fart jokes. Watched the first episode for 15 minutes and I could not get past the immature humor. 3 stars because for what it is, it's done well. I'm just not amused by the concept of D&D meets Wayne's World.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Decent production.. falls off elsewhere..",
            "content": "Don't get me wrong.. I love satire.. I love things like Rick and Morty aka adult cartoons... but something about this felt off. It felt like it was written by a kid who had just touched his first breast a week prior. It felt very contrived and unorthodox.It just felt like people were saying things for the sake of shock / vulgarity alone. It's just not funny. Loud isn't funny. Vulgar isn't funny. Loud/Vulgar/INTELLIGENT is what they needed. This JUST loud/vulgar with a lack of intelligence.When I watch a show I expect more depth than just shoddy one liners meant to make virgins squirm with laughter.",
            "review_date": "2023-01-14"
        },
        {
            "review_title": "Fantastic adaption",
            "content": "An excellent adaptation of the critical roll stream and a game of dungeons & dragons in generalA must watch for fans of fantasy, adult animation or roll playing games.",
            "review_date": "2022-02-12"
        },
        {
            "review_title": "Big letdown",
            "content": "I'm a big fan of the table top series and was looking forward to the animated version. Sad to say this does not live up to the hype. The animation is poor, no depth or connection to any of the characters and it just seems like it's trying too hard to be an adult series with overuse of swear words and silly sex jokes. The only positives I had were the artwork and great voice acting (which was to be expected)",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Near perfect animated series stunted by too much swearing",
            "content": "Like a lot of people enjoying the new wave of raunchy adult animation, I too have enjoyed shows like Big Mouth and Rick & Morty. Maybe it's just a growing pain of the show, but the dialogue is just one step too far into vulgarity and feels like the writers are trying too hard to make the show \"adult\". Most of the main characters can't seem to go 5 words without dropping a cringe inducing f-bomb or similar, and it cheapens what could have been an impactful moment between chracters or dumbing down a funny joke. The actors' deliveries of these lines also have this \"wink\" to the audience each time like \"hey look I'm naughty I cussed. Look how cool I am!\" Nobody talks like that and if they did in real life people would think they were idiots...All this to say the show is really well done, animation is great, but tone down the awkward swearing and save it for moments that can deliver real impact to a line of dialogue, and you'll have a masterpiece. Hoping Season 2 can deliver on the adult and not the high school/college crowd it seems to aimed at currently.",
            "review_date": "2022-01-31"
        },
        {
            "review_title": "Amazing",
            "content": "The series so far is fantastic and very true to the original series! If you are a fan of anime/dnd or anything of the like you should certainly give it a go!",
            "review_date": "2022-01-31"
        },
        {
            "review_title": "Brings Modern Fling to Fantasy of Old",
            "content": "Such an amazing series making its rounds in our sphere and the title says it all. The pacing kicks in after your character introductions but doesn't shy away from telling previous tidbits of story with the confidence that you can follow along - no one likes hand holding and they are experts at giving you what you NEED to know and fluffing the rest. The story itself is a familiar brand of fantasy that brings back the joy of nerding out with your friends over a game of D&D! I cannot recommend this any higher for fans of the genre! 10/10.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "Tons of fun",
            "content": "I loved the show, it was hilarious, and it was great right from the beginning. I can't wait for Season 2! It made me wanna go watch all the other content this team has put out (I think they go by Critical Role). My friend told me he's been watching them on Twitch for years and he was so excited for this.",
            "review_date": "2022-02-20"
        },
        {
            "review_title": "Watch and Show",
            "content": "An incredibly well done series. The drawings are from Spectacular Spider-Man, by Phil Bourassa, who has signed in productions such as Batman Hush and Young Justice, very successful. The voice cast consists of Matthew Mercer, Taliesin Jaffe, Ashley Johnson, Liam O'Brien, Marisha Rey, Sam Riegel, Travis Willingham and Laura Bailey, which is already the main campaign cast of Critical Role. If we talk about the game version, it started on March 12, 2015 and lasted for 2 years, starting with the Pathfinder system and continuing with the Dungeons and Dragons 5E system (he even contributed greatly to the popularization of the DnD 5E system with this campaign), written by Matthew Mercer in the world Exandria. A passing story. The story is that a group of mercenaries named Vox Machina find themselves in the middle of big issues while initially looking for a job where they can only get money and beer the easy way, and this is how things develop. Their music is a masterpiece, carefully studied. It is a production that even those who do not know the game side can watch comfortably, it is truly a masterpiece, you should definitely watch it.",
            "review_date": "2022-09-02"
        },
        {
            "review_title": "OH MY GOD WE SAID THE F WORD!!!!!! SO FUNNY XDDD!!!!!",
            "content": "Jesus christ, are the standards really this low? I'm genuinely blown away that anybody can watch this and come out thinking \"wow, that was one of the greatest pieces of media i've ever seen.\" I'm not some prude with a stick up my ass about what is \"offensive\" like some of the reviews are strawmanning the detractors out to be, because the only thing I get offended by is bad writing. Pure shock value with no substance. The most uninteresting and bland fantasy setting I've ever seen. Even the animation is low-tier on the \"anime-inspired\" end of the spectrum. Plot and characters lacking any and all depth to them, clearly put on the backburner in order to focus more on how many times they could shoehorn swearing in the script. Really earning that 9.2/10 average, guys. The only reason I can think to why it gets that is because of the pre-existing fanbase to this.This is the opposite of adult animation. This is animation purely for 13 year olds or people with the mental capacity of one. Shows The Legend of Vox Machina actively degrade the medium. Redirect your attention to Arcane, or Invincible, or Primal, or The Midnight Gospel, or Smiling Friends, or Tear Along the Dotted Line. Please.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "This was the greatest story I've ever witnessed. 10/10",
            "content": "The music, the dialogue, the comedy, the ACTIONOh my god this show had everything. I never expected to love animation so much. These actors are amazing, and this is a MUST WATCH. On Episode 3 I was hooked. This is quality content that has been missing from modern television. The creators are genius. This show must go down in history as revolutionary. A group of nerdy a** voice actors rolling dice and telling stories.Not a show for kids with the language and some sexual themes, but the plot is incredible for everyone.",
            "review_date": "2022-02-18"
        },
        {
            "review_title": "What a refreshing show",
            "content": "Long time ago i started watching anime with the simpson, then Pokemon. After a long break, i came back with OPM, then Demon Slayers, and a few others. They all have their originality, personality. But let me tell you that The legend of Vox Machina is refreshing. So different of what we are use to see. The show grow in me. Very good. A lot of humor, a little bit of swearing. You can see a little bit of character development in good measure. Only thing i wish i would have seen before the end of second season, it's how the hell did they meet each other. We learn a little bit of each others, but not how they came to be a group. We probably learn that in a season or 2. Any how, great show! Watch it!",
            "review_date": "2023-02-20"
        },
        {
            "review_title": "Amazing adaptation that's also fun for newcomers",
            "content": "Clean animation and a great soundtrack really add to the colorful cast of characters that so many people have come to love. There's a nice balance between humor and drama as well. The set pieces also hold many details that are interesting enough to make you want to rewatch scenes for the foreshadowing and just to enjoy the art itself. All in all, I'm very happy with this series and I hope they continue to not tone down anything in the future.",
            "review_date": "2022-01-30"
        },
        {
            "review_title": "Has a huge amount of promise.",
            "content": "Review from someone who hasn't watched any other 'critical role' content:It's a fun lighthearted show, that has some adult humor, good banter and many a middle finger. Which overall suffers from lack of stakes, very trope heavy writing and some pacing issues.I don't write reviews; but I hate this show for how much potential it had. I wish it was just simply bad.The animation is gorgeous (I can't overstate this), the voice acting is world class, and same with the editing and direction.The place in which this show originated from (a specific dnd game a group played?) hurts it at every stage of its story.The cast is too large with the thickest of plot armor. The settings and tropes are tired and toothless, all of which have been done better countless times before. No matter how grand the visual or build up of suspense, it falls flat when there is no stakes. The themes within are also soft; the cliché of characters growing a moral conviction moments before ending the main villains life had me turning off the last episode early.It generally sucks to see a show that has had so much love and time poured into it fall completely on its face because of poor writing. Plot holes and inconsistencies that could be fixed in an short afternoon of rewrites; I will never understand how shows such as these come out with such fundamental mistakes.I see they are going to make a season two. I hope they don't pull their punches with the jokes and themes next time.",
            "review_date": "2022-07-04"
        },
        {
            "review_title": "Fantastic och nice made! Great actors and the start of a thrilling story!",
            "content": "Nice anime that looks extraordinary! The characters are great and I cannot wait to follow this story and the adventure that lies ahead these different characters in vox machina!",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "Great script",
            "content": "Current and fun. Really entertaining to see. Just seen 3 Chapters but it is promising. I started without expectations but it has a great developing. Good choice made by amazon.",
            "review_date": "2022-02-02"
        },
        {
            "review_title": "1 for the fans.",
            "content": "If you are unfamiliar with Critical Role and their adventures, then move along.It is rude, crude, and gorrie. Filled with obscene language and gutter filth humor.It is not a \"cartoon\" to share with your family.That said, it is a perfect Vox Machina show.I am not an avid watcher of the feed, but our DnD group is and as such I have heard most of the story lines. The cartoon has all the the hallmarks of good friends playing DnD. If this isn't your cuppa, try tugging on the beads.......",
            "review_date": "2022-02-06"
        },
        {
            "review_title": "The BEST representation of D&D/Action Fantasy ever",
            "content": "I'm loving this show. It's gritty, filthy, action packed and funny. I hope this show never ends. The tone is spot on. I'm so glad that Critical Role stuck to their vision and found a home for this excellent show that doesn't compromise their vision. More Vox Machina!",
            "review_date": "2022-02-13"
        },
        {
            "review_title": "Trying to hard to be \"adult\" or edgy",
            "content": "I've watched most of the campaigns on youtube and enjoy their storytelling and some of their voice acting, but this ruined what could've been a great animated version.I'm probably a minority here, but there's just too much random nudity and sex scenes that it breaks away from the immersion and seems more of an attention grab for the viewers or.just plain shock value. Adult animation doesn't just equal sex and fan service is cheap.Also everything seems rushed as if they're on a deadline to fit as much of the campaign in one season as possible.",
            "review_date": "2022-06-16"
        },
        {
            "review_title": "Giving up some hope, again.",
            "content": "I'm not a D&D or Critical Role fan.The first season wasn't great or extraordinary, but it was promising potential. The next season started great. The first chapters did almost everything right, until the event about Grog. Then, everything collapsed hopelessly. Lazy and cliche writing, predictable scripts, clueless action, Deus ex's everywhere... They were like \"let's just start it and fill the gaps on the road.\" but couldn't do that either.Now, when I look back at it whole, I can't help but think that the only thing that keep the series from being another children's fantasy show is the stupid 'duck' jokes which are not even funny anymore.Hopefully they will think before typing another series of mess but honestly, I wouldn't count on it.",
            "review_date": "2023-02-11"
        },
        {
            "review_title": "action is filled with the thickest plot armor",
            "content": "Story is really shallow, action scene is not great, and story pace is all over the places .{ and this is random words to fill character space.A peasant girl, who can be detached.SECONDARY CHARACTER\nA pickpocket, who is overly polite.PLOT\nIt's a comic fantasy story about the downfall of an empire. It kicks off in a quaint abode with a prophecy.}",
            "review_date": "2022-07-26"
        },
        {
            "review_title": "I hope this isn't a one season series!",
            "content": "I became a critter at the start of campaign two, so I haven't seen all of campaign one, but let me say how amazing it is to see all the little nuances that were put into this that reference many other sessions from the other campaigns. You don't have to know all about D&D to love this series, but it's really neat the way they worked in subtle game references from the gaming table and random d20's to tusk love. Love this and hope that there is more coming after!",
            "review_date": "2022-02-17"
        },
        {
            "review_title": "This critter is happy! I laughed, I cried...!",
            "content": "I became a critter because of my husband and now my whole family plays D&D together. We loved watching this so much together. It's pretty much what I expected and the cast are so talented!",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "Solid, if you did not watch the campaign.",
            "content": "I am relatively new to Critical Role and have not watched their first campaign (which is what this show is based on). It is fast paced, maybe a little too fast. If you are not already familiar with the characters, it may be hard to keep up. Even more so if you are not familiar with TTRPGs like D&D or Pathfinder.It is still a fun experience, and worth the watch. Be advised, there is adult language and sexual situations involved, so this is NOT A SHOW FOR CHILDREN!",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Vox machina at it's finest",
            "content": "If you love the webseries, you will love it. All the characters shine through in their best ways. Grog and scanlan continue to provide the laughter we need. Pike and keyleth provide the goodness and innocence we need. Vex and vax continue to be the most badass twins we know. And No Mercy Percy, is my favorite character of all the campaigns.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "A satisfying throwback for a Critter",
            "content": "I have been bingeing their Youtube DND series for a while and I am honestly glad that my second favorite arc of the series finally got animated with amazing animation and scriptwriting. The plot is overall dark, yet there are characters that lighten the mood without feeling awkward at all. I also felt immersed especially by its climax where I just totally speechless with everything that was going on by that part. Of course, the voice actors are also great at bringing into life the characters they play during their tabletop sessions.Looking forward for a next season, but in it, I do hope that the development of other characters would be greatly emphasized as I feel like the others have a long way to go in terms of growth which were not concluded in the first season. But even though, I am absolutely loving it!",
            "review_date": "2022-06-19"
        },
        {
            "review_title": "8/10...but I hate the Scanlan character.",
            "content": "Good writing, fast paced, interesting characters. I'd give it an 8/10 if the Scanlan character would die off. He's a completely forced character. But since he's alive...7/10.",
            "review_date": "2022-03-17"
        },
        {
            "review_title": "Keeps getting better and better",
            "content": "Awesome season 1 debut. While some of the humor felt a little too modern (and raunchy) for this fantasy/medieval world, the story and character development was gripping enough to keep me excited for what more they have to offer. The action scenes were fairly well done and engaging, and I appreciate the R-rated violence. As with all these series, what I enjoyed the most was being able to spend time with these characters, learning how they adapt and develop deeper bonds, and discovering more about each individuals unique background and power set. Looking forward to season 2!7/10\n...\nSeason 2 takes everything that was great about season 1 and adds even more to it! More humor, and especially, more heart. The found family of Vox Machina is just so much fun to watch. The will they-wont they romances are thrilling. I can't wait to continue watching this show. Upgrading my 7/10 rating from season 1 to 9/10 for this show.",
            "review_date": "2023-03-13"
        },
        {
            "review_title": "A great visualization from the game!",
            "content": "I see a lot of reviews where people say \"the script is horrible\" or \"falls flat\", but what these people dont understand is that \"the script\" is not a traditional style script. This show is based off and actual game of D&D that friends played, that people loved, and ultimately thought fitting enough to donate their hard earned money for.This wasn't some huge Hollywood backed and written show, but instead a labor of passion from the actors who actually built a story with nothing more than some dice, some improvisation, and the imagination. And with that simple basis built a story over years that brought joy and amusement to thousands of fans.This show has some amazing voice actors, good animation, and adult situations. Some viewers may not care for the adult humor mixed with basic childish humor sprinkled in, but this is only the first 3 episodes of a very long character development story.With only 30 minutes per episode, people need to remember that only so much can be crammed into that time frame without seeming lost or unstructured.This first glimpse into what any of the true fans know of as a amazing story, is just the beginning of what turns out to be an amazing adventure. Given time, this will make new fans, and be an amazing visualization of a story that has already amassed a giant fan base.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "A nightmare story that just doesn't make sense",
            "content": "This story is all over the place, with weak backgrounds and unnecessary tangents. It's as though they've tried to do something like castlevania, however, the writers are 14 years old. I gave it 5* as I enjoyed the style of animation, if it wasn't for this it would be 3* for me, and people who give it 10* are deluded.",
            "review_date": "2022-02-27"
        },
        {
            "review_title": "Perfect Fantasy Comedy",
            "content": "It's pretty much perfect execution for fantasy/comedy D&D. The story, voice acting, animation/visuals are all amazing.Every show like this has to strike a balance between being familiar and being unique and Vox Machine nails it. I loved D&D growing up so it's especially good for me but I think it would be entertaining for anyone who likes the genre.From epic battle scenes that pull you forward in your seat to comedy that makes you laugh loudly - it's a great fun adventure.It's just as good as Arcane or Avatar the Last Air Bender, (in a different way of course.)The only thing I would add to prospective viewers is to be aware that it is 100% ***not*** a kids show. Lots of adult language and situations. It's all a good fit for the show itself, but be aware that it's there.",
            "review_date": "2023-02-11"
        },
        {
            "review_title": "Exactly How I Imagined It!",
            "content": "I loved every second of this series, I followed the campaign when they played it and the series lived up to and surpassed my expectations. The writing, jokes, and not shying away from the dark humor was perfect. Scanlan and Grog are top tier comic relief and Percy's dark past make the first season unforgettable.",
            "review_date": "2022-03-17"
        },
        {
            "review_title": "Love D&D / AD&D",
            "content": "Fan of Forgotten Realms since I was a kid and remember the heroic/lunatic attempt to attack a non-metallic dragon to earn XP....that usually didn't go well...😉🤣🤣\nExcellent and fun to watch this series!!",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "Critical Role nailed it.",
            "content": "Watch it! Already watched it twice in 24 hours. It has everything you could want and hope for in a D&D show. So happy is finally here. So many Easter eggs in the show too. I hope it gets renewed and we get a campaign 2.",
            "review_date": "2022-01-29"
        },
        {
            "review_title": "I really tried to like this...",
            "content": "I really wanted to like this... and power through end the first season.But some of these characters are so annoying and poorly produced.The druid.. Every episode, every action, every time another character ask her to do something it's this self loathing \"uh, so don't know if I can do this\", \"oh, on no guys, I don't know\". Then some music kicks up and every time it's this \"BAM I DID it, Omg I did it!!\" And que heroic music. If she truly is that unsure, is the story that they are the chosen ones to save kingdoms and the world even believable?The brooding brother... once again. Every time, every conversation. Same with Persey.The Gnomes are well written, then Barbarian (except having the scream, \"time to rage\", every time he rages. I mean it's not an airport you do not have to announce everything.Throw in the rip offs (not homage) to LoTR, Last air bender, and every other fantasy movie made... it's like a lack of its own creativity. And the characters are not a strong collective on their own to over look the bad writing.I wanted to like this. But half way through the second season and I just could not get through all the flaws, poor writing, annoying characters, and constant virtue signaling...",
            "review_date": "2023-01-28"
        },
        {
            "review_title": "Definition of Netflix adaptation meme",
            "content": "Season two cuts so many corners. They split up the group in order to cover more story in a shorter amount of time And absolutely botched the Fey Wild arc.Grogs confrontation with his uncle is one of the highlights of campaign one, where Travis has a few improvised speeches that are actually incredibly but it doesn't seem like we will be getting any of that.It's mind boggling how you can take such rich source material and absolutely strip it of all soul and personality to fit into formulaic twenty four minute episodes that just want to move through the story as soon as possible to get to the next season.When they said they were making changes to the story I wasn't expecting it to just be cutting everything that made the story special. Seems like financial gain has the highest priority rather than telling their story right.3D animation(dragons and beasts) bad as usual but not as horrible as season 1.",
            "review_date": "2023-02-05"
        },
        {
            "review_title": "ABSOLUTE BLAST!",
            "content": "How fantasy needs to be done. Great animation, and clever writing with respect to original streaming show. You can see the care and craft, because this was built buy fans of animation and fantasty storytelling for fans of animation and fantasy storytelling.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "Good Story, Excessive Swearing and Sex",
            "content": "Would be a great series except for the swearing and sex. They are totally unnecessary and don't contribute to the comedy or story. If anything, they detract from a good story and likable characters. I don't know why people feel that swearing and sex and necessary to make entertainment \"good.\"",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "A fantastic show, artstyle, story and character development is on point",
            "content": "This show is proof that Amazon can give us a great fantasy story, when they focus on the journey of the characters, and not political agendas and current social trends.The Story 10/10\nThe Characters 10/10\nCharacter Development 10/10Only negative it the waiting until the next season. That said, each of the first to seasons manage to keep a good pace, and does not feel too slow or rushed.This show manages to target adult viewers, while still keeping some of the silliness this artstyle allows. They manage to make each character unique and contribute in their own way.Can't wait until I once more get to dive in to another adventure with Vox Machina.",
            "review_date": "2023-02-11"
        },
        {
            "review_title": "Great Story and Animation",
            "content": "I have listened/watched some of the Critical Role/ Vox Machina DnD you tube shows and really enjoyed them.Seeing the stories come to life with the voice actors voicing their characters was a real treat. The stories have been wonderful I only wish the seasons were longer.Fans of DnD and Fantasy will really love this series.I had hoped for a live action series but as it turns out the Animation was even better than I could have hoped for.Being Animated made the use of magic much simpler with no CGI work needed.The Animation is beautiful the use of colors bright and dark is done really well.",
            "review_date": "2023-03-09"
        },
        {
            "review_title": "Brilliant, fun, poignant.",
            "content": "Don't miss this outstanding animated series. The cast of Critical Roll have captured their magic once again by bringing the prequel story of the season 1 characters to life. However you don't need to see critical roll to enjoy this amazing animated series.",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "Wonderful, past the first episode.",
            "content": "Starts a bit slow in ep. 1 and then turns into a torrent of awesomeness. Great story and of course excellent voice acting by the CR team. Well done folks, truly. I look forward to more from the world of Exandria. The animation team did a wonderful job bringing the vox machina team to life. Also, Scanlan is impossible to get enough of. The twins were great too. Lastly, anyone who says there is too much cursing doesn't deserve the excellent filth and vulgarity that streams through every character like a sweet wine. Okay, it might be a bit too sweet at times but I drank it anyway and you can't stop me.",
            "review_date": "2022-11-07"
        },
        {
            "review_title": "Not a show that I call overrated.",
            "content": "I may not be a fan of role-playing games like Dungeons & Dragons, but after watching seasons one and two of The Legend of Vox Machina, I must express the main points that I found were under par!The first thing to note has to be the pacing! Some scenes could have been more timely in places like the lore, which prevented me from learning about the deeper meaning behind the characters and their world. If I had changed the show's structure to meet the viewers' expectations, I would've made each episode forty minutes long.Secondly is the gang, Vox Machina themselves, who never interested me whatsoever. Although they're a bunch of misfits whose job is to save the realm of Exandria from powerful evil forces, none of them, I believed, packed a punch.Furthermore, the main cast portraying each of the members of Vox Machina tried their hardest to make me care about them emotionally, but I could see their Achilles Heel easily. What I mean is they could've voiced their roles naturally, like they're in a real life conversation!I had to skip through some of the main characters' dialogue simply because I found them boring. The secondary characters' roles tend to help out Vox Machina in different situations, whoever they stumble upon during their travels.Thirdly has to be the writing! Honestly, I found it not engaging as I hoped it would! To put it this way, the characters' different styles of humour, whether Vox Machina or the supporting ones, didn't make me laugh or cry at all! The writers could've done more effort at adding raw emotion, rather than putting in stale dialogue for me to listen to in some episodes.The amount of swearing done by the characters would've been a good idea for the creators to enjoy doing while recording their lines in the studio, but not for me! I understand that swearing is the norm on adult-friendly TV shows, but it would've been better if there weren't any on this show I'm reviewing.Finally, the battles between Vox Machina and the evil forces at play didn't suit my style! The animation may have been smooth nonetheless, but I've seen better!Overall, The Legend of Vox Machina isn't the legendary show I thought it was.",
            "review_date": "2023-02-10"
        },
        {
            "review_title": "A fresh take on fantasy",
            "content": "The series opens without a long exposition, but immediately with an interesting subplot. With the help of which it is clear how the characters live in this world and what problems they face. We are very quickly introduced to the bright main characters. Since one of the characters is a cheerful and vulgar bard, there will be a lot of humor, music and songs. But first impressions can be deceiving. Real characters begin to reveal themselves through events that put pressure on the characters. Funny scenes where the protagonists find themselves in an awkward position, as well as in battles that are superbly staged and do not leave any of the team members in the shadows. Picked up a great moment for a dramatic inciting incident that forces the characters to make moral choices. What touches the soul of the viewer and brings them closer to Vox Machina.The antagonists are diverse, not stereotyped and imposing. They throw very difficult challenges to the heroes, surpass them in various aspects, which makes their conflict even more interesting. In several episodes there are detective elements, you can think about who the villain is and what his motives are. Which leads to unexpected plot twists, not even counting the twists in the battles, and they will also be. In one series, the authors managed to weaken my vigilance several times and surprise me. When this happened, I remembered that there were clues and I could have guessed before. For this, special praise to the authors. Not every detective work manages to do this so skillfully.At some points, it felt like the characters were balancing on the verge of breaking the fourth wall. The feeling from the fact that this is a fantasy hero is changing to the fact that this is a group of friends from our world who got there and have fun. This is suitable for the film adaptation of a tabletop role-playing game. It is surprising why there are so few works of this type. I hope this will change and in the future we will have many adventures of Vox Machina and other interesting companies of heroes in their worlds.You are waiting for charismatic heroes and villains, plot twists, original and exciting battles, vulgar and sophisticated humor, cool music and songs. Recommended for viewing for fans of not only role-playing games, but also art in any of its manifestations.10 of 10.",
            "review_date": "2023-02-23"
        },
        {
            "review_title": "Amazing",
            "content": "The pace of the story, drama, humor, and corny humor are nothing short of genius. Great story, animation, and director work. Not a joke, this pacing should be studied in schools.Just a big fan!",
            "review_date": "2022-06-18"
        },
        {
            "review_title": "I like what I see.... so far.",
            "content": "I saw the ad for this show on break at work on my phone, thought to myself \"hmmm this might be worth checking out.\" Now that being said, I have checked out all the episodes and I like what I have seen, been far more engaging than a lot of other shows out there lately and I'm a hardcore sci fi geek/nerd from the 70s/80s, I've been involved in RPGs in some fashion since 1986 when the TMNT RPG come out and shortly thereafter started playing the 2nd edition DND followed by the 3rd edition DND and currently the 5th edition DND (3.5 and 4th editions we won't discuss here, just suffice to say a disappointment on an epic scale).Most of the DND games reflect the real world in terms of language, subtle and mature, the fact I did not know about the Critical Role group itself until recently thanks to a friend of mine and fellow RP/DM (Role Player / Dungeon Master for the uneducated) showing me some of their videos and I myself am starting to watch their videos from their beginning campaign and I swear it is like they have a satellite truck parked outside observing our games or something from over the years LOL.Now yes admittedly because of the pandemic, work schedules and personal lives, the lot of us had not been doing a lot of in person gaming, we only got together again about 6 months ago via the program Discord and started a real, true old fashioned campaign again and seeing this show gives me hope that all us nerds everywhere have a beacon to cheer and see ourselves reflected in each character of the show. It is beautifully done on what I see and I would like to see more.... a lot more.",
            "review_date": "2022-02-13"
        },
        {
            "review_title": "just wow",
            "content": "I really really enjoy this series..what an amazing surprise..i recommend it to everyone especially more mature ages.the action , the lines , the animation were amazing.",
            "review_date": "2022-03-27"
        },
        {
            "review_title": "Too damn fun!",
            "content": "Effortless group dynamic with a good mix of heart, laughs and epic fantasy adventure battles. They've somehow managed to capture the feeling of playing D&D around the table with friends. Hooked after the first 3 episode and can't wait for the rest.",
            "review_date": "2022-01-31"
        },
        {
            "review_title": "Genial 😎",
            "content": "Eine der besten Anime Serien 👍 cool, genial, witzig, unterhaltsam, blutig und absolut toll gemacht 😎 klare Empfehlung. Bitte weiter so 👍..........................................",
            "review_date": "2022-03-10"
        },
        {
            "review_title": "Absolutely Amazing",
            "content": "The storyline is great and the jokes don't fail to make me laugh.The first episodes seem a bit slow for the amount of time but it really develops in the briarwood arc.",
            "review_date": "2022-02-23"
        },
        {
            "review_title": "Good show",
            "content": "A good show with excellent voice acting and animations, the writing and plot is very well thought out.It's funny, dark, deep, wholesome and relatable on many levels.Would recommend 100% for D&D fans.",
            "review_date": "2022-04-05"
        },
        {
            "review_title": "Common guys, really?",
            "content": "At the time of writing this review this show has a 8.7 average. I predict that has to do with it getting good reviews from D&D fans or something. The plot is okay, the characters are written in a certain way I guess. But the dialoque is easily worth a 2 or less. The characters literrally converse with not even half a second pauses in between and the intonation doesn't sound right at all when a character reacts to someone/something. I predict that when this show hits the masses the score will drop significantly. And for the people that grade this show high i recommend some proper fantasy anime or for example Arcane on \"the other streaming service\" to go watch that and compare.",
            "review_date": "2022-02-20"
        },
        {
            "review_title": "Amazing",
            "content": "Absolutely amazing. This show has been a roller-coaster full of emotions. I'm not gonna spoil this amazing master piece, but if you're looking for an adult fantasy series full of action, sex, comedy fighting then this is the show for you! I loved every part of this story! The characters are gold. I hope to see more of this in the future!!",
            "review_date": "2022-03-19"
        },
        {
            "review_title": "Incredibly fun and well written story we need more of",
            "content": "The Legend of Vox Machina is an incredibly well written story with a clear plot, defined arcs, character development, like-able characters that you want to know more about, and fun and entertaining interactions amongst them.It has something for everyone; driven-story, action, adventure, comedy, adult humor, horror, interactions between characters, dnd jokes and Easter eggs, lots of lore and mythology. Empowered female characters, healthy relationships and friendships, and lots of heroism.Honestly the show is great in every way, I'd say it's not a show for young children because of a couple scenes of adult imagery and innuendoes. However it does what it does best tell an amazing action fantasy story with fun and comedy at healthy doses.I wholeheartedly hope they do MANY MORE seasons they can easily do 4 or 5 more with all the plot and storylines from critical role's campaign.",
            "review_date": "2022-04-06"
        },
        {
            "review_title": "Adapting to animation the right way",
            "content": "Hopefully this will finally show Hollywood that the fantasy genre is definitely worth it if don't the right way. Let the content creators run it and don't get in the way. I hope that this pages the way for great fantasy adaptations.",
            "review_date": "2022-02-01"
        },
        {
            "review_title": "Very fun from start to finish",
            "content": "As the subject says, very fun.For the quick.This felt like an animated dnd game. Well done fight scenes, cheeesy one liners, and most importantly, Loot.Can't wait for season 2.For the less quick, from Scanlon using his bard spells to Grog's barbarian rage I could almost hear the dice rolls hitting the table. The paladin wasn't too much and the little romance will they/won't they didn't become tired. I was invested until the end.Now the elephant in the room, Percy.I liked his story, I liked how it concluded. I'm glad it ended the way it did and I'm glad they ended they did.\"well goddamn\" - Percy.",
            "review_date": "2022-10-16"
        },
        {
            "review_title": "Elite show",
            "content": "Amazing story, incredible voice acting, top tier animation. It is probably my favourite animated series of all time, due to the high quality across the noardA wonderful adaptation of the Critical Role Campaign 1 Briarwood arc. It seems to balance the urgency needed to carry a twenty minutes per episode animated series in terms of storytelling with the details fans of the Dungeons and Dragons stream wanted to see.I watched it as a Critter (CR fan), my wife watched it as a newcomer to the world and we both love it. On our 3rd watch through and can't wait for season 2 and beyond.Cannot rate it highly enough, great job!",
            "review_date": "2022-10-31"
        },
        {
            "review_title": "Wonderful Series",
            "content": "This is one of the best original programs Amazon has released. Fantastic. Like most series, it takes a few episodes to hit is stride, but the end is fantastic. Highly recommended!",
            "review_date": "2022-02-20"
        },
        {
            "review_title": "\"You'll probably know at a glance whether this'll be your thing or not.\"",
            "content": "This is an Amazon show adapted from Critical Role: Campaign I, probably the touchstone of this recent wave of Twitch and YouTube D&D shows, emblematic of the game's resurgence in the late 2010s.It's crazy how much the liveness and hard-line game aspects of the original show made that experience. That sense that the story could go anywhere and that it's even happening is a miracle of improv talent. The spontaneous banter and creator personality that would leak into the project. Shows don't usually have their own cast members gasping at plot twists as they happen, and that's something special.Not knocking that original story by any means, even if I always thought that the cast was better than the material (LA by Night is an example of better storytelling done in the same format by partially the same crew). This simplifies, rushes and takes all subtlety out of most of the quieter characterisation essential to investment in the action and freeing the cast from just being two-dimensional archetypes. Mercer's voice as a worldbuilder quite literally gets lost. The bulk of this adapts easily his worst arc back when Vox Machina was at their most unlikeable.Scanlan goes from the best to the worst character in the group, even if Riegel (especially early gross-out humour Riegel) antics were never going to translate well to animated television. The adaptation's biggest problem is that sometimes it doesn't want to be for children, and sometimes it doesn't want to be for adults, and sometimes in the same beat.But it's still fun and obviously a fanservice-y but very professionally made passion project with solid pacing and character design. Legitimately monumental that it even came together. Has very comparable production value to Invincible's first season. It's hard to complain, and it's refreshing to watch a Critical Role plot I can actually follow after Exandria Unlimited & Campaign III. You'll probably know at a glance whether this'll be your thing or not.If this very niche property or the game of D&D interests you at all, start with Campaign II or one of the one-shots. I'll always owe it for getting me started on the only thing I love more than film.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Fantastic",
            "content": "An example of excellent animation and story telling. The voice over acting has a quality of actors truly engaged in the content of the story.Highly recommend for anyone that likes great animation and fantasy.",
            "review_date": "2022-05-12"
        },
        {
            "review_title": "The Fact This Show Exists",
            "content": "An amazing journey for Critical Role from being a home game a little over 6 years ago no to being their own company, creating their own comics and merch based around their original home characters to raising over 11million dollars on Kickstarter when their goal was only 800 000. Insane, truly insane and amazing that something like this exists.The acting and writing are phenomenal. I see some reviews saying that some of the humor is cringe, I can see where they are coming from but that is sort of the essence of critical role in a nutshell. Hilarious? Yes. Cringe moments? Yes. Moments of heartbreak and darkness? Yes.Its essentially a home DnD campaign adapted to animation and there will be all the hilariousness, raunchiness, awkwardness and fowl language that would be in a real Campaign. I, personally think they captured it beautifully.Its not perfect though. I can why someone who does not know DnD, or Critical Role for that matter may find it a bit unapproachable.There is this inside joke they do in the show that Critical Role cast cannot deal with doors in any DnD scenario and there are a couple of animated scenes that have that as a focus. From an outside perspective you many think this is strange or \"cringe\" which is fair. I also saw in a couple reviews that the world building is rushed and I'd have to agree with that as well. The world is beautiful but it may be confusing just dropping someone who does not know these characters or world right into the action with little explanation, may make the buy in a little more difficult for you.That being said though I hope this show goes on for a long time and many people watch it because it really is an amazing show with amazing characters and I hope they are able to keep the new comers watching because we could always use more Critters!! Happy watching everyone!",
            "review_date": "2022-02-15"
        },
        {
            "review_title": "Story moves in all the right places.",
            "content": "The best original storyline in animated adult epic by far!!!! Every episode ft like a cliff hanger. The acting was also compelling. We need season 2 ASAP. Great job for giving us this content Amazon studios!!!!",
            "review_date": "2022-02-20"
        },
        {
            "review_title": "New Western Standart",
            "content": "Prepare for a lot of barfing, pissjokes, burping and inappropriate sex jokes because this is just another Western Cartoon that is allowed to portray mature rated stuff in animation and hence goas overboard with swearing in order to create a show nobody really wants to like.I gave em stars because they are ripping of the Korra Artstyle.",
            "review_date": "2022-01-28"
        },
        {
            "review_title": "Fun but gory",
            "content": "Vox Machina is a very enjoyable fantasy for the most part; plenty of diverse characters, plenty of Dungeons and Dragons, plenty of magic. The musical numbers are a bit out of place although the voices aren't bad. Despite the overuse of foul language, the dialogue is a quite juvenile. I think Travis Willingham has the worst English accent I've ever heard. He sounds like maybe a Texan trying to do an English accent. Why on earth would you have him do an accent he obviously can't do when the character doesn't need to have any accent at all? He must have used Dick Van Dyke's Bert the chimney sweep as his model.",
            "review_date": "2023-02-11"
        },
        {
            "review_title": "I made an account for this.",
            "content": "I'm a fan of Critical Role. Not a die hard balls-to-wall-critter-obsessive but I've seen pretty much all of the campaigns over the years and I like the cast and crew.Beware this contains show spoilers.....Seriously though... SPOILERS....I think even without that prior fan knowledge, this show is good... Good, but not amazing. It definitely has its miss-steps, it's weaker characteristics and weaker episodes.Character wise I really like what they've done with Vex'ahlia, Percy, and even Pike by filling in her time away from the table.Vax'ildan doesn't have a personality or characterisation, and Keyleths only characterisation is only 'I can't do magic very well until every screams at me, and then I end the fight' which is super two-dimensional.And Grog and Scanlan are bad. They are two of my favourite characters piloted by two of my favourite players, but they leaned super hard into them as comic relief which has made them into caricatures of the characters in the live play campaign. They still have some good moments, but both are a let down imo.I feel like story was finding it's feet throughout the run though, the first two episodes were bad, the pacing was all over the place, as was the narrative, the stakes and well... Everything, it was a breakneck pace to wrap up krieg and position them as protectors if the realm that didn't stop to actually tell it's story.But from episode 3 it gets pretty much better and better. Still a few teething problems and missteps along the way, but the Briarwood arc was badass. The wraiths in episode 4 were a particular highlight, as well as the sheer brutality of the undead giants, and the silver tongue fight... And our first glimpse of No-Mercy Percy gunning down Stonefell.I don't think it's a 10/10 that knocked it out if the park like many reviews. And to be fair I understand the people who've given it a 1/10 because they don't like gross-out humour sex-jokes and swearing. That's a personal taste that's going to offend some people.But overall I think it's a solid opening season, and that if they can improve upon it moving into the Chroma Conclave arc, then it has all the trappings of a great series waiting to grow into itself.",
            "review_date": "2022-02-19"
        },
        {
            "review_title": "Its like Friends",
            "content": "Its like Friends. But with more fantasy. And nudity. And swearing.In conclusion: its just awesome!Also, when the show is done. You can follow all the same characters in their RP sessions.And Gina Torres is also in it!",
            "review_date": "2022-05-02"
        }
    ]
}