{
    "rating": 9.0,
    "release_date": "1942-01-28",
    "num_reviews": 604,
    "genres": [
        "English"
    ],
    "summary": "Successful movie director John L. Sullivan (Joel McCrea), convinced he won't be able to film his ambitious masterpiece until he has suffered, dons a hobo disguise and sets off on a journey, aiming to \"know trouble\" first-hand. When all he finds is a train ride back to Hollywood and a beautiful blonde companion (Veronica Lake), he redoubles his efforts, managing to land himself in more trouble than he bargained for when he loses his memory and ends up a prisoner on a chain gang.",
    "reviews": [
        {
            "content": "Watching \"Sullivan's Travels\" 82 years after it was made surprised me. A film in the comedy genre with a dialectical theme of society and cinema, which was presented in this film at that time, shows the correct and deep understanding of the director of the film \"Preston Sturges\". This film portrays social violence and how the artist suffers from this social violence and how strange the society treats him. A director who no longer wants to make a comedy and plans to make a social drama called \"travels deep \"O Brother, Where Art Thou?\" travels deep into the society and finally comes to the conclusion that people need comedy.",
            "review_date": "2023-02-13",
            "source": "rt"
        },
        {
            "content": "The humor is a bit dated, but I enjoyed it.  A movie director learns that he should make films that audiences want to see rather than virtue signal, a lesson that modern Hollywood needs to relearn.  Veronica Lake wasn't just another pretty face.  She was also a pretty good actor, a lot better than Joel McCrea anyway.",
            "review_date": "2022-04-03",
            "source": "rt"
        },
        {
            "content": "A rich and highly successful producer of escapist entertainment movies gets tired of doing so and wants to go out and explore the world of the poor and downtrodden. He tries several times to do so, but farcically ends up back in his rich surroundings. Not that his life is all good...the woman he married strictly to save on taxes has cost him far more money than he saved, and she is having an affair with his manager.\n\nFinally Sullivan does manage to escape his wealthy home, meeting a lovely down-and-out actress in the process. Then he truly learns about how the other half lives...and why there is a market for escapist entertainment.\n\nNot only does the movie succeed in farce, but it also doesn't glamorize the poor. It mentions there are thugs and scumbags as well as simply unfortunate among the poor. As someone who has known poor people myself, I felt that the movie is right on target in that respect.",
            "review_date": "2021-12-04",
            "source": "rt"
        },
        {
            "content": "Absurd slapstick, clever wit, and playful romance all in one!\n\nPreston Sturges' romantic comedy-drama Sullivan's Travels (1941) is a whirlwind of emotions and laughter. Sturges' direction is fascinating and engaging as he opens Sullivan's Travels with a rooftop train fight, into witty banter, then proceeds into serious poverty drama, and all manner of other scenarios. Stuart Gilmore's editing keeps Sullivan's Travels down a sleek 91 minutes of all laughs and tears with quick cuts around all the action straight to the humor. Preston Sturges' writing is quite clever and sincere as he openly mocks how Hollywood wants to be seen as artistic and trying to change society, while allowing for the reality of audiences preferring the simple pleasure brought by comedies and laughing collectively.\n\n Sturges concludes that the catharsis of viewers laughing together during comedies is greater in the immediate nature of moviegoing compared to pretentious and depressing dramas for the simple fact that people like to see comedies more. The comedic relief from comedies is an escapist fantasy to deliver viewers from their low wages, poor jobs, and scarce lifestyles. But, Sullivan's Travels proves that getting the viewer to laugh is as significant as a drama making the audience cry in despair.\n\nJohn F. Seitz' cinematography looks great for all the different wide shots needed to capture a blistering car chase to homeless people standing in line at the food banks in order to survive. Seitz captures it all. Charles Bradshaw and Leo Shuken's score is perky for all the silly comedy, ravishing for the romance, and heartfelt during the serious moments of reflection. Wally Westmore's make-up delivers one ethereal beauty for Veronica Lake's face to gritty mud on Joel McCrea's hobo look. Edith Head's costumes for Veronica Lake are dazzling with diamonds and flowing robes. Head's style is immaculate and makes the already gorgeous Lake all the more dreamy and memorable.\n\nVeronica Lake is stunning from the first moment she appears on screen. Lake steals the entire film with her fearless line delivery, sultry personality, mysterious persona, playful flirting, fun actions, and hilarious sense of humor. Veronica Lake could not possibly have been a bore as she lights up the screen with more than her iconic peek-a-boo haircut, but also her bubbly whimsy and endearing wit. I adored Veronica Lake in Sullivan's Travels.\n\nLook, Joel McCrea is funny, charming, and lively in Sullivan's Travels as he goes from absurd slapstick, ridiculous banter about the importance of movies, to tender romance with Lake, then to heartfelt empathy for the poor. However, see Sullivan's Travels for Veronica Lake's daring forwardness, unforgettable charisma, classic beauty, and sweet charm.",
            "review_date": "2021-03-12",
            "source": "rt"
        },
        {
            "content": "One part sophisticated comedy, one part action adventure, one part Marx Brothers..Kind of all over the place.",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "This movie was easy to watch and enjoyable. Veronica Lake plays a damsdrel in distress, hard on her-luck actress trying to make a way for hersels,\nMeets Joel in a cafe in which he is trying out being a hobo for a new film, she buys him\nBreakfast and tags along for the ride.\n\nA very believable story, friendship turned romance (if the movie continues). I'd imagine he would have placed her in some\nMovies. \n\nScenery is all over the place; train yards, production room, cafe, car rides, airplane, hotels, etc \n\nEasy to watch and heartwarming, I'd recommend",
            "review_date": "2021-01-23",
            "source": "rt"
        },
        {
            "content": "Easy to like early on, Sullivan's Travels loses steam in much of its second half, moving from lighthearted, charming comedy to a somewhat wandering and strange melodramatic twist (including a hobo who happened to have stolen Sullivan's shoes earlier in the film before independently running across him much later), before gradually righting itself with a surprising thematic depth that was not previously hinted at; the film not only displays an informed and progressive treatment of African Americans for 1941, but reveals a sophisticated understanding of comedy as a means of sincere storytelling. I can't say that the two halves are particularly well reconciled even if they are meant to explicitly contrast (they feel like two different films), but each has its own merits. Despite explicitly poking fun at Capra a bit, the film has some real power in its naive early charm and storyline that somewhat echoes the beloved director. I'm convinced that much of the film's reputation is based on its contemporary depiction of Hollywood, and later generations of critics and producers that love to recognize Sullivan's combination of self-loathing and creative genius in themselves. (3.5/5)",
            "review_date": "2021-01-21",
            "source": "rt"
        },
        {
            "content": "One of the great oldies. So much to enjoy about this early portrayal of Shia Leboeuf's year slumming it. For all that the plot rips along at a great pace, there's no doubting the star is Veronica Lake who is a classic old skool beauty of the silver screen. I basically want to marry her, not like now, cos she's dead but you know, the old living version of her. Absolute wowzers of a woman. Lead actor does a grand job too, whatever his name is.",
            "review_date": "2020-11-09",
            "source": "rt"
        },
        {
            "content": "Sullivan's Travels is a hidden gem of a movie. People don't talk about it much anymore, but it's one I think more people should watch. It features witty dialogue and a clever story that skillfully shifts between comedic farce and compelling drama. Plus, it's entertaining to watch Joel McCrea and Veronica Lake play off each other. Yes, it's a little dated and kind of cheesy, but I'd recommend Sullivan's Travels to anyone who enjoys the experience of going to the movies.",
            "review_date": "2020-09-13",
            "source": "rt"
        },
        {
            "content": "For the majority of its runtime, Sullivan's Travels is an exceedingly well done screwball comedy with some elements of slapstick. Preston Sturges' dialogue is sharp and funny and it is perfectly delivered by a charismatic Joel McCrea and an endearing Veronica Lake. Lake is unfortunately underused, her character arrives kind of late and then is left behind when McCrea's Sullivan, a film director and champion of the poor, is mugged and soon after imprisoned. The story then significantly shifts in tone, which provides for fewer laughs (on the part of the audience at least, not the convicts watching Mickey Mouse) but enables Sullivan to fulfill his goal of seeing what it's like to be destitute, without the comfort of money and privilege of fame. The film confirms its true purpose as a satire of the film industry, Sturges achieving just what Sullivan wants to by having us watch his character try to do it.",
            "review_date": "2020-06-07",
            "source": "rt"
        },
        {
            "content": "A good story but hardly a classic because it exposes the harshness of homelessness in the 1930's and early 40's  in America (watch any other movie about hardship of the 30's).",
            "review_date": "2020-04-21",
            "source": "rt"
        },
        {
            "content": "For a film about abject poverty, this actually has everything: Nuanced social commentary on issues of class antagonism, inequity, the justice system, race; rapid-fire and timeless wit; Veronica Lake; a silent short-film in its middle; metatextual satire; Veronica Lake's peekaboo hairstyle. Ironically, a lesser filmmaker with poorer gifts would have spread the wealth.",
            "review_date": "2020-04-18",
            "source": "rt"
        },
        {
            "content": "The all-time Preston Sturges classic!",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "Another wonderful, almost perfect project from Preston Sturges.  ",
            "review_date": "2019-08-22",
            "source": "rt"
        },
        {
            "content": "A Journey pf Discovery . Very entertaining, should not be missed\nThis is a tenderhearted yet still brutal film about a film director's study of the \"Human condition\". His quest for knowledge about how the \"other side\" lives takes him on a journey that he will not soon forget. His search to understand how to \"reach\" his movie audience takes him through some very bizzare twists and turns in the events which unfold. He is finally enlightened to the realization that the way to truly \"touch\" people is a way he previously had disdained, as he simply did not understand it, yet sometimes the things that make life worth living are frequently the most simple things in life. A touching blend of drama tinged with comedic misadventures. Very entertaining, should not be missed.",
            "review_date": "2019-08-21",
            "source": "rt"
        },
        {
            "content": "terrific.  great Preston Sturges, McCrae and Veronica Lake - her best.  very clever script",
            "review_date": "2018-08-19",
            "source": "rt"
        },
        {
            "content": "This highly-regarded, classic film of a movie executive wanting to make a film showing the gritty, realism of Depression-era America needs to be watched in the context of the year it was released and compared against anything at the time. Otherwise, it's importance and the respect it deserves is easily overlooked. Upon the screen of a 2012 audience, the movie may seem average and so dated as to be misunderstood. However, it is a dark comedy, one of the first of its kind, and should be noted for how gritty and honest it truly is, especially for 1941. Since I've been watching a lot of classic films lately, it was easy to notice how the \"language\" and \"attitude\" of this film is definitely cutting-edge compared to its contemporaries. John Sullivan applies the \"method\" manner of film development by taking on the persona of a homeless, every-day man in order to obtain the feel of how his audiences were dealing with r",
            "review_date": "2018-06-18",
            "source": "rt"
        },
        {
            "content": "Funnier, subversive and smarter than anything made today. ",
            "review_date": "2018-03-17",
            "source": "rt"
        },
        {
            "content": "Just loved this film. Veronica Lake was gorgeous in it.",
            "review_date": "2017-12-31",
            "source": "rt"
        },
        {
            "content": "Brilliant Preston Sturgess anti-Hollywood road movie. Veronica Lake steals every scene. The ending is a trifle too neatly packaged, but still entertaining throughout.",
            "review_date": "2017-12-22",
            "source": "rt"
        },
        {
            "content": "Sullivans Travels is a charming movie about a film director who thinks he will be able to make a more powerful dramatic film if he experiences the hardships of life lived by the poor. Things dont go exactly as planned, which makes for a comedy of errors. I found myself laughing a lot at the many attempts to leave Hollywood that just kept leading him back, but the funnier part was the snappy banter between all the characters. Veronica Lake joins Joel McCrea for a good portion of the film, and their back-and-forth dialogue is a huge highlight for me.\n\nI suspect that Sullivans Travels was self-referential in many places, it seemed Preston Sturges (the director of this movie) was speaking through the story. The script asks a big question about what the world needs in difficult times. Do we long for the dark truth of our situation to be shown in film, or do we want the release of a hearty laugh? This is a timeless question that would be relevant in a film from any era. And frankly, I think this movie decides the answer to that big question is exactly the answer I would give, but I wont spoil that for you here.\n\nThere was very little that wasnt a huge success for me in Sullivans Travels. I found the acting from all the cast to be spot on, the script was funny and touching, and the look of the movie was good. If I were to start nitpicking details I might call out some of the montages as being a little too long, and the more serious tone of the third act was a little off from the tone of the rest of the film. However, I dont really want to look at the negatives in this movie. I had so much fun with Sullivans Travels, and Im willing to bet it will become a favorite when I watch it more in the future (and I will be watching this one again, without question.)",
            "review_date": "2017-09-13",
            "source": "rt"
        },
        {
            "content": "A Classic worth a re-watch.",
            "review_date": "2017-07-14",
            "source": "rt"
        },
        {
            "content": "Veronica Lake lovely, but the acting and script doesn't hold up well at all",
            "review_date": "2017-06-14",
            "source": "rt"
        },
        {
            "content": "Great fun amazing movie",
            "review_date": "2017-05-02",
            "source": "rt"
        },
        {
            "content": "I think I've fallen in love with Veronica Lake. Not a care in the world she has, I like that. Smart, funny, witty, and not to mention, beautiful.\n\nVery fun and entertaining to watch. The movie took some unexpected turns but they ended up teaching us something important.\n\nGreat movie with great messages and a funny cast.",
            "review_date": "2017-04-24",
            "source": "rt"
        },
        {
            "content": "Get peoples attention with eccentric movie people and plots.",
            "review_date": "2017-03-12",
            "source": "rt"
        },
        {
            "content": "Comedy and satire about the human condition",
            "review_date": "2016-12-30",
            "source": "rt"
        },
        {
            "content": "Sullivan's Travels strikes many poses and excels whether operating as a fast paced comedy or tender, buddy-road flick.",
            "review_date": "2016-06-03",
            "source": "rt"
        },
        {
            "content": "Not as laugh-out-loud funny as some of Preston Sturges' other films of the forties (The Palm Beach Story, The Miracle of Morgan Creek) but possessed of one of those rare \"high concepts\" that hits the spot.  In this case, Joel McCrea plays movie director John L. Sullivan who wants to make a picture about the down-and-out and their plight (to be called \"O Brother Where Art Thou?\") but he realizes that he hasn't actually known poverty and trouble himself.  So, he decides (in bad taste) to go undercover as a tramp to see what the life is really like and when he runs into broke but aspiring actress Veronica Lake, she joins him. It takes a while for the studio to let him go and a large detachment of personnel - errr, character actors -- are sent in pursuit if and when trouble does descend. But getting there is basically all the fun in this film and when McCrea and Lake actually do meet the destitute, the film gets a bit gloomy.  But Sturges pulls us out of it okay, with his usual ridiculously unbelievable plot mechanics and a grand wink about how no one really wants message films -- they just want to laugh to forget their troubles.  Amen, brother.",
            "review_date": "2016-04-10",
            "source": "rt"
        },
        {
            "content": "Brilliant movie with literally every genre in it with extremely gorgeous Veronica Lake and beautiful direction. A classic for all time.",
            "review_date": "2016-02-24",
            "source": "rt"
        },
        {
            "content": "Mocking the ignorance of the upper class and their fetishization of poverty, Sullivan's Travels is a masterful, meta mashup of various genres of filmmaking, containing elements of the screwball comedy and self-aware satire of Hollywood \"cause\" pictures. It ultimate advocates for the acknowledgement of oppressed peoples and the systemic nature of their socio-economic standing while saluting the healing nature of comedy, a message especially relevant today in an environment where films just like the ones Sullivan's Travels parodies continue to be disproportionately recognized by the beltway awards system.",
            "review_date": "2015-09-25",
            "source": "rt"
        },
        {
            "content": "From the golden age of Hollywood - tells a story in 88 minutes that a modern studio would struggle go do in 3 hours. Slapstick to tragedy and back again. Docked just half a mark for the schmaltz ending.",
            "review_date": "2015-08-22",
            "source": "rt"
        },
        {
            "content": "Well written, directed, and acted this movie is quite modern, however if it was redone today would need some heavy tailoring to be plausible.  Veronica Lake... what a gal.",
            "review_date": "2015-07-15",
            "source": "rt"
        },
        {
            "content": "it is ok. I do not understand the ratings on this.",
            "review_date": "2015-07-06",
            "source": "rt"
        },
        {
            "content": "\"I certainly had a lot of nerve wanting to make a picture about human suffering.\"",
            "review_date": "2015-06-07",
            "source": "rt"
        },
        {
            "content": "An exceptionally well done film with lots of comedy, drama, and sincerity, exploring the guilt of making comedies while the rest of the world is suffering. Through all his travails, Sullivan realizes that comedy is more important and uplifting to the human spirit than he had once thought. A truly remarkable introspection proving the power of uplifting film.",
            "review_date": "2015-05-06",
            "source": "rt"
        },
        {
            "content": "A wonderful classic film about the power of comedy.",
            "review_date": "2015-04-20",
            "source": "rt"
        },
        {
            "content": "An enjoyable comedy set in the forefront of the depression era in America. The film does tackle and raise social and political questions which still stand up today, however making a film revolving around a wealthy Hollywood producer meeting a down-on-her luck actress turned tramp is sort of hampered by the fact that she is played by a very well-known Hollywood actress and does not physically look poor at all. Unfortunately some aspects (like certain portrayals and acting) have not aged particularly well in this film.",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "This is considered a cinema classic so I checked it out, frankly I don't see why it is considered so great, it could have been I felt, the potential was there, it makes some good remarks about Hollywood and actors, but instead of being a smart comedy it resorts to all these dumb physical humor bits which seem very out of place, Lake starts out as a strong independent woman, an equal companion to McCrea, but she resorts to just being eye candy and just a romantic interest for him, also the whole bit with him going to jail is so contrived, i know they wanted to show him suffering for real, but it's so implausible how he gets there, plus his decision to not make dramatic films is based off one screening of prisoners laughing at a cartoon (unrealistically loud at that) so what is it bad then to make dramatic films showing the plight of the poor? cant both types of films coexist? Call me a hater then whatevs",
            "review_date": "2015-01-22",
            "source": "rt"
        },
        {
            "content": "oh Veronica you're delicious, great film!",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "because Veronica Lake is extremely beautiful",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "Thanks to a perfect, very authentic mix of rapid-fire dialogue, brisk pace and emotional, realistic, silent filmmaking, Sullivan's Travels is both funny and dramatic while also being quite romantic with Veronica Lake offering such a wonderful presence. Joel McCrea gave his career-best performance in such an endearing role whereas Preston Sturges' direction is highly impressive. It's a progressive, modern and still unfortunately very relevant look into Hollywood being out of touch with the real world and being ignorantly dismissive of the comedy genre. That cinema sequence is one of the most beautiful film scenes ever created and a perfect tribute to the comedy genre. Consequently, it's one of the greatest films of all time.",
            "review_date": "2014-12-03",
            "source": "rt"
        },
        {
            "content": "Not what I thought it would...I thought it was going to be about the book where the man falls asleep for 20 years and it's back in like the middle age...I think I confused it with Gulliver's Travels. Anyways it had a great message about movies I think in general and it had a little bit of everything with humor, excitement, drama, love etc...Some great shots from the cinematographer. It knew how to poke fun at itself, but at the same time there were some scary and terrible parts that would sober you up for sure if only for a short while. It moved quickly and is a easy film that holds ur interest and has an interesting premise, even if a little bit far-fetched.",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "Though it starts off slow, has a couple of bumps, preachy and Sturges' antics hasn't aged well, the setting plays exceedingly well into a self-critique on the value of entertainment without stretching credulity. Still vibrant and fresh to this day.",
            "review_date": "2014-10-21",
            "source": "rt"
        },
        {
            "content": "Yet another film-about-films. An interesting gallimaufrey of cinematic pastiches; sentimental in places but mostly brings you with it. Veronica Lake kicks ass, despite not even getting a character name.",
            "review_date": "2014-10-19",
            "source": "rt"
        },
        {
            "content": "This highly-regarded, classic film of a movie executive wanting to make a film showing the gritty, realism of Depression-era America needs to be watched in the context of the year it was released and compared against anything at the time.  Otherwise, it's importance and the respect it deserves is easily overlooked.  Upon the screen of a 2012 audience, the movie may seem average and so dated as to be misunderstood.  However, it is a dark comedy, one of the first of its kind, and should be noted for how gritty and honest it truly is, especially for 1941.  Since I've been watching a lot of classic films lately, it was easy to notice how the \"language\" and \"attitude\" of this film is definitely cutting-edge compared to its contemporaries.  John Sullivan applies the \"method\" manner of film development by taking on the persona of a homeless, every-day man in order to obtain the feel of how his audiences were dealing with real life.  Comedy and drama ensue, but eventually, he learns more than he bargained for.",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "This comedy from 1941 offers some clever Hollywood satire and starts out strong, but soon becomes somewhat unfocused in its message.",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "They don't make'em like this anymore.Fun little adventure comedy with a social message that could still play out today.",
            "review_date": "2014-08-21",
            "source": "rt"
        },
        {
            "content": "This clichéd American comedy written and directed by Preston Sturges is trying to be too many things at once. It is classified as a comedy, has few elements of a drama and adventure, but mainly wants to be a satire about a movie director, played by Joel McCrea, who longs to make a socially relevant drama! The title is supposed to be a reference to Gulliver's Travels, the famous novel by Jonathan Swift about another satirical journey of self-discovery. I am not as impressed as most of the people who saw this movie, but it must be significant when it was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\"\r\n\r\nThe story of John L. Sullivan (Joel McCrea), a popular young Hollywood director fresh from a string of very profitable, but shallow comedies, tells his studio boss, Mr. Lebrand (Robert Warwick), that he is dissatisfied and wants his next project to be a serious exploration of the plight of the downtrodden, to be based on the socially-conscious novel O Brother, Where Art Thou? by Sinclair Beckstein. Of course, Lebrand prefers that he directs lucrative comedy instead. Idealistic Sullivan refuses to give in, and decides to go out in the world to \"know trouble\" first-hand as a tramp so he can return and make a film that truly depicts the sorrows of humanity. People close to him openly question the wisdom of his plan. With only 10 cents in his pocket, Sullivan dresses as a hobo and takes to the road. However, no matter how hard he tries, somehow he always ends up back in Hollywood. Luckily, in time of trouble, he meets a young failed actress (Veronica Lake, credited only as \"The Girl\") who had enough of Hollywood is contemplating quitting the business...\r\n\r\nI understand why Sullivan's Travels was not as immediately successful at the box office as earlier Sturges films such as The Great McGinty and The Lady Eve, and also received a mixed critical reception - it is clearly divided into separate parts which I call the Yo-yo story (which helps the character to feel like a yo-yo, going back to the riches and then back to the street). At the time the reputation of the movie wasn't great and my biggest complaint even now is that lacks down to earth quality and sincerity which made the director's other three pictures a really enjoyable experience. But, it is good for relaxation and entertainment without too much thinking!",
            "review_date": "2014-07-12",
            "source": "rt"
        },
        {
            "content": "We heard lots about 'Gulliver's Travels', so what is this 'Sullivan's Travels'? Well a similar kind theme that sets in the modern world (when the movie was made) where a wealthy man, Sullivan willingly takes an adventure to study about the lives on the streets as a homeless. Yes, both the titles are about the journey of self discovery. A well made movie with a fine pair of characters in the lead.\n\nJohn Sullivan, a film director who opposes his producers' idea of making his next feature as a comedy. Instead, he wanted to adapt the famous novel 'O Brother, Where Art Thou?' which determines the realistic social issues. So the question arises that how much he's experienced to take the challenging project in the hand. Now he has to discover himself everything before coming to any conclusion. So then the life changing adventure begins till he gets all the answer he wanted with a little twist at the end.\n\nIt was good to know that the movie with a concept like this was made almost 70 years ago and still looks fresh and original. As expected the adventure I was taking about was not completed in one long ran instead it split into many pieces. That is the thing that irked me the most in few parts of the movie. Otherwise, it would have been a masterpiece according to the my taste in film viewing.\n\nI would have liked it better if the story was flavoured with little sentiments in those adventure parts. Although it is a comedy movie which entertains well. But still the last 20 minutes or so were the excellent which also partially reminded the 86th Academy Award winner that based on the true story. In other word the last quarter of the movie was the best part you will find in all over the storytelling. As per my conclusion about the movie, it is not a must see movie, though if you wish to watch, you won't regret in seeing it.",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "A brilliantly hilarious film about realist film-making. From examples like Luchino Visconti and Luis Buñuel, I believe an aristocratic is capable of making a film reflecting the true world.",
            "review_date": "2014-05-19",
            "source": "rt"
        },
        {
            "content": "Preston Sturges does it again with this heartfelt comedy about hardships, relationships, and social status.",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "This film is really silly it isn't even worth watching.",
            "review_date": "2014-04-08",
            "source": "rt"
        },
        {
            "content": "Sullivan's Travels is a treasure, a virtually deadpan comedy that flourishes with juicily sharp dialogue, odd characters, and outstanding acting all around.",
            "review_date": "2014-02-25",
            "source": "rt"
        },
        {
            "content": "Its an interesting argument for comedy as the best form of escapism, especially since the film is anything but escapist. That finale is quite touching.",
            "review_date": "2014-01-07",
            "source": "rt"
        },
        {
            "content": "A successful but frustrated Hollywood comedy director during the Great Depression, decides to set off across America dressed as a hobo and with only ten cents in his pockets to research the hard life of the poor for his next feature which is to be a heavy themed drama. One of the best Preston Sturges comedies and one of the most influential cinematic comedies off all time. Its brash contrast between the dream like reality of Hollywood and the harsh reality of the streets is striking and is tastefully conveyed by the witty and intelligent script, but the film works even better when taken as a tribute to the concept of comedy features as a way of indispensable escapism. Charming, delightful and a times grippingly suspenseful, it's easy to see why this film has so many strong supporters.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "\"Sullivan's Travels\" is an interesting commentary on Hollywood and the Great Depression. Nice to see 1941 Kansas City in the background of one scene (although it was probably a matte painting). The final act is like a condensed version of \"12 Years a Slave,\" except the main character is white, he's a prisoner rather than a slave, and actually has a character arc.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "A comedy director who decides to make a drama about the current social situation, but the studio won't back him. So, he decides to live amongst the struggling poor to gain experience and show the studio he is serious. The stunt goes public, but things don't go as plan as certain random events puts Sullivan experiencing how it is really like to be poor in America. Veronica Lake plays a struggling actress in which Sullivan meets during his odyssey. She is beautiful and cute and steals the show. This is a great satire on the movie industry and the current status of America at that time. It's ironic that Sullivan thinks a drama is what moviegoers want to see, only to learn that in times like these, comedy is always the best medicine. \n\nGrade: A-",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "Really enjoyed this one. Dated, obviously, but a fun watch. Interesting plot and good acting.",
            "review_date": "2013-09-24",
            "source": "rt"
        },
        {
            "content": "If nailing tragedy onscreen is tough, then comedy is rock-hard. Yet Preston Sturges could handle the seismic shifts between the lightweight comedic and the unbearably tragic like few others. He's also one of the first writer-directors in an era in which the two - like singing and songwriting - were exclusively different vocations.\n   \"Sullivan's Travels\" may be his greatest movie (vying with the immaculate likes of \"The Lady Eve\"  and \"The Great McGinty\") and showcases his panoptic talents for screwball comedy, socially conscious sincerity, and lightning-paced repartee.\n   Star Joel McCrea is John L. Sullivan, a movie director with itchy feet who - like Swift's Gulliver - is off on a voyage, both in literal terms, and in the terms of self-discovery.  McCrea was one of the most prolific of Hollywood's stalwarts (appearing in over 90 films in 50 years), yet even he turned down the chance to work with his \"Sullivan's Travels\" leading lady again.\n   To wit: \"Life is too short to make two movies with Veronica Lake.\"",
            "review_date": "2013-09-19",
            "source": "rt"
        },
        {
            "content": "I enjoyed enough of the whippy dialogue to help me stomach some of the Old Hollywood problems that Sullivan's Travels perpetuates, even despite its general good-natured self-awareness. Primarily I mean the absurd characterization given to Veronica Lake's The Girl - she just can't get enough of Sullivan's constant cold shoulders and rude rebukes, can she? And yes, she is simply \"The Girl\". Ain't pointing this out to \"blame\" Sturges or his studio or accuse them of abject misogyny or anything, but it's interesting to see such regressive values in full view, despite the movie's otherwise good intentions. Also I find the central thesis of the movie a biiiiiit problematic - it takes the argument of art-as-charity, intended to pacify, rather than incite or inform, the marginalized and oppressed. Not that I don't think escapism has its place, but again, it's just interesting to such a self-aware movie kinda lack awareness on a deeper level.",
            "review_date": "2013-09-17",
            "source": "rt"
        },
        {
            "content": "One of my favorite, if not my #1 favorite film about Hollywood.",
            "review_date": "2013-08-26",
            "source": "rt"
        },
        {
            "content": "Two men grappling on the top of a scudding train and both wind up falling into a choppy river, after that rolls out \"THE END\", which is the beginning of this film, directed and written by Preston Sturges, our protagonist is a booming young director Sullivan (McCrea), the said clip he shows is his latest film which intends to dig into the bleak reality instead of make another fluff. So unsurprisingly, the investors and producers will not buy it, then Sullivan decides to experience all the \"troubles\" which unfortunately elude him since clearly his life is too pricey to provide him with the adversity of the huddled mass.\n\nHere is the compromising plan, he puts on an act as a poor guy with only 10 cents in the pocket, and the film studio sends an 8-men crew to (not so stealthily) follow him and records his adventure, which will be compiled as a front-page story for the media and publicity, a great mutual benefit trickery only it sounds a tad highfalutin, paraphrasing a sentence from the film \"People always like what they don't know anything about it\", Sullivan is a lucky bastard born with a golden spoon in his mouth! Anyway, there he goes, it starts as a slapstick comedy, when he meets the girl (a 19-year-old Lake), who fails to have a crack into Hollywood, the film morphs into a romantic screwball, Lake is a fabulous stunner, and much to my surprise, her diminutive figure does stand for a little boy in her tramp outfit alongside a husky McCrea, and together they showcase some heavy scored silent montages of their improvised life with tramps, an apparent tribute to Chaplin. \n\nThen the film veers its trail with a mood-changing malevolence, the do-gooder has to learn a lesson for his own naivety towards the lower stratum's spite, after the courtroom hubbub with a hazy and distorted images, Sullivan has to undergo a diabolic spell in a prison camp where he will finally find what people really want to see and it is sardonically at a black people's church. \n\nDuring the viewing, there was an impulse pushing me to want to love this film more, but eventually it failed, the story is an oversimplified product of one's wacky imagination, the overall tone never cease to patronize the poor mass, the ending is too gratuitous to feel the empathy, a 7/10 is out of my respect to Sturges' cachet, anyway it is an taxing tale to spin, even for Sturges.",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "Sullivan's Travels is a delightful movie by Preston Sturges with a satire of Hollywood lifestyle and the importance of comedy in the life of people, a relief for a couple of minutes for those that do not have other sort of entertainment.  \n\nJoel McCrea is very funny in the role of a naive director trying to find how the poor people live.  Joel McCrae stars as a comedy film producer who is tired of making silly comedies and musicals for his studio. He wants to make films of social significance with a message about the troubles in today's world so he disguises himself and travels as a hobo to gather material for his next picture, a social statement about poverty.  This is one of Veronica Lake's more appealing roles in her first feature role, although her character has no name other than \"The Girl\", as McCrae's traveling companion.  Together, the two possessed excellent chemistry together.\n\nThe supporting cast includes Robert Warwick, William Demarest, Franklin Pangborn, Porter Hall, Byron Foulger, Margaret Hayes, Robert Greig and Eric Blore were great as Sullivan's hangers on who repeatedly try to rein him to Hollywood, if for no other reason than their own selfish interests. \n\nAfter a lighthearted combination of drama and humor through much of the film, the film gets surprisingly dark in the last 20 minutes as McCrea goes through some very, very tough times. \n\nSullivan's Travels is a very funny film with the appeal of Lake, witty comedy, while not being one of Hollywood's ham fisted attempts at making a movie with a message. A movie which can be watched by all - essential for those lovers of classic cinema.  Overall, this Preston Sturges-directed movie is good stuff and a classic film that deservedly still has a solid reputation.",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "My Favorite Comedy Film Is 1933's Duck Soup.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "After enjoying The Palm Beach Story, I was interested in seeing Preston Sturges' other films. Sullivan's Travels, which is probably his most famous film, leaves a lot of impact, the biggest being The Coen Brothers making O Brother Where Art Thou because of this movie.\n\nTired of making comedies such as \"Ants in Your Pants of 1939\" during Great Depression-America, Hollywood director John L. Sullivan (Joel McCrea, who also teamed up with Sturges in The Palm Beach Story), intends to make a film about human suffrage, called \"O Brother Where Art Thou\" (recognize the title?). Since Sullivan hasn't been poor in all his life, he leaves the rich life of Hollywood and lives out as a hobo to understand what being poor is all about.  When he meets a fallen actress (Veronica Lake), Sullivan gets more than he bargained for.\n\nSullivan's Travels is full of comedy. Sullivan gets knocked down into his pool, gets involved in a crazy car chase with a bus full of news reporters, who are on to his story, and gets allergic to hay while hitching a ride on a train. But, Sullivan's Travels is more than just a comedy.  There's also heavy dramatic material in the film. There's a lengthy sequence involving Sullivan and Veronica's experience with other hobos and a tragic scene where Sullivan is put to work in a chain gang after a case of mistaken identity. While drama can sometimes ruin a piece of comedy film, such as Groundhog Day, in Sullivan's Travels, the drama really works. Sullivan wanted to make a film about human suffrage, and we needed to see the trials he had to face in order to have the experience of human suffrage.\n\nAs far as casting goes, Joel McCrea is fantastic as Sullivan, and was more moving here than he was in The Palm Beach Story. Veronica Lake, meanwhile, is not only attractive, but also manages to have excellent chemistry with McCrea. Robert Greig and Eric Blore play Sullivan's butler and valet, and they did nothing but annoy the pants off of me. All they did was say stupid stuff and attempt to steal the spotlight. Eric Blore as the valet was worse, cause he already annoyed me as the butler in Top Hat, but I have to admit, he was a whole lot worse in Top Hat.\n\nSullivan's Travels is an excellent dramady from Preston Sturges, filled with  spectacular performances from Joel McCrea and Veronica Lake, loads of great comedy and drama, and has lots of heart. With my experience with this film, I enjoy O Brother Where Art Thou even more.",
            "review_date": "2013-08-01",
            "source": "rt"
        },
        {
            "content": "Not Sturges' best but Joel McCrea and Veronica Lake have a cool and laconic chemistry",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "Wednesday, July 24, 2013\r\n\r\n(1941) Sullivan's Travels\r\nDRAMA\r\n\r\n Considered as a great film back then since it was made during WWII centering on wealthy film maker deciding to walk the streets within the impoverish just because he was looking for a new idea for a film but end up helping them instead.  One word to describe this is outdated.\r\n\r\n2.5 out of 4",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "Kind of an interesting story.",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "\"There's a lot to be said for making people laugh... It isn't much, but it's better than nothing in this cockeyed caravan.\"  \n\nWhat a classic!  Preston Sturges' masterpiece delights and insights.  Equal parts humor and meloncholy, it's almost Shakespearean in scope.  The screenplay is as good as it gets, and Joel McCrea is terrific.  Veronica Lake ain't no slouch either.  One of my new favorites!",
            "review_date": "2013-07-18",
            "source": "rt"
        },
        {
            "content": "I watched this ten days ago and I hardly remember anything about it. That's not a good sign. I do remember not finding it funny or that interesting.",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "Sullivan's Travels is a film about a big Hollywood comedy director who wants to make a more substantive work about the hardships of the common man. The only problem? He doesn't know anything about them. There were one or two scenes of real power here; it's a bit broad in places and could be funnier/punchier but it's worth seeing.",
            "review_date": "2013-05-12",
            "source": "rt"
        },
        {
            "content": "Laughter, A Precious Commodity In This Cockeyed Caravan--Fails bitterly at both comedy and tragedy!!",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "A wealthy hollywood director gets more than he bargained for when he goes out looking for \"trouble\" so as to better identify with the common man (and make a better film dramatizing their plight).  The director's name is Sullivan (Joel McCrea), and he is more known for goofy slapstick than dramatic human interest.  He believes himself to be a noble pursuer of truth and justice, but as his butler Burrows points out, dressing up as a bum and hoboing around is something \"only the morbid rich would find glamorous\".  At first, the studio is intent on following him around (in a giant bus, no less) to document this adventure, but he quickly loses them after making a deal to meet up with them later.  Not long after, he's taken in by a girl (Veronica Lake) who buys him a ham-and-egg breakfast as she's on her way east, back home.  Sullivan is attracted to her and wants to make a movie with her, only he's still trying to maintain his incognito status, so as a compromise, he goes home and steals his own car so as to give her a ride to whereever she wants to go (\"Chicago\", she says).  After she discovers his ruse, the girl decides to go along with him on his adventure (\"How can I be alone if you're with me?\" he asks, but to no avail), and the two delve right into the seedy underbelly of America's misfortunes.  Riding the rails, sleeping in flophouses, looking for handouts, as if some great and noble purpose could be distilled from abject misery.  But as with other martyrs, that nobility is never pure, as they could escape their condition at anytime they so choose, he's never really down and out, he still has his millions waiting for him at home, and so the deception is never fully realized as he knows who he is.  Ah, but after he goes back to being Sullivan, and he's clunked over the head and robbed by a hobo and then thrown onto a freight train, well only then does he come to realize the nature of being lowly and without friends.  Sullivan comes to realize the irony of socially conscious films is that they do nothing for the people they purport to defend, that watching a film doesn't change anyone's plight.  The best a film can hope to do for the lowest rungs of our society is take away the burden of life for a little while, take a person somewhere they've never been before, let them laugh and enjoy themselves, even if it's just for a little while.  Throwing their poverty back up in their faces doesn't help them, not even a little bit.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "Be careful what you wish for...",
            "review_date": "2013-03-12",
            "source": "rt"
        },
        {
            "content": "Hilarious and charming. Everyone who has ever loved movies owes it to themselves to watch this. It's a rollicking, side splitting and passionate gem.",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "Was very good for the first hour (with a memorable chase scene and ridiculous lines of dialogue) but then for the last half hour took a turn from being a comedy to a serious drama and wasn't enjoyable to see that turn.",
            "review_date": "2013-02-21",
            "source": "rt"
        },
        {
            "content": "Why can't they make movies like they used to!? Sullivan's Travels is an absolute gem of a movie and given the year it was made it still holds up. Absolutely hilarious, the scene where the bus starts chasing the car my God it felt like my sides were gonna split! And great commentary on the movie business from within the movie business. Definitely one to watch!",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Starring Joel McCrea and Veronica Lake, with director Preston Sturges, Sullivan's Travels is about a highly successful film director (McCrea) who wants to make a movie about the common man and suffering. However, he usually writes comedies and so he decides to go on the road as a hobo to try and understand the lifestyle. During his adventures he meets a young failed actress (Lake) who is about to leave Hollywood. Wanting to help her, Sully tells the girl what he is doing and they go off together masquerading as tramps. After taking a short respite, he goes on the road again, this time alone. Through a series of events he finds himself in a chain gang while his friends assume he is dead. Eventually he is freed but not before learning a valuable lesson. If he wants to relate with the poor he should give them laughter instead of hardship. I found this movie to be an enjoyable  light comedy (even though I had never heard of it beforehand).",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "love the main idea of this movie, and surprised finding out that Veronica Lake was actually 7-8 month pregnant during filming this movie, yet she 's able to hide it and delivered a good performance :)",
            "review_date": "2013-01-15",
            "source": "rt"
        },
        {
            "content": "Watched for the ongoing Movie Shame Monday project, and I have to say that so far Veronica Lake has been very good to me.  She was a real stunner, and appeared in a lot of interesting movies.  This time around she appears opposite Joel McCrea, who is a film producer who wants to get in touch with the real America, so he takes a road trip riding the rails, where he meets the hotness that is Veronica Lake.  \n\nThe film takes a strangely uncomfortable dark turn in the middle that I wasn't expecting, which sort of ham-strings my rating a bit, but it's still well worth a look.\n\nGive it a rental.",
            "review_date": "2013-01-14",
            "source": "rt"
        },
        {
            "content": "4-6-2017\n\nOriginal rating: 12-21-2012 (9/10)",
            "review_date": "2012-12-21",
            "source": "rt"
        },
        {
            "content": "A feel good comedy reminding us what's important in the day to day grind. 1001 movies to see before you die.",
            "review_date": "2012-12-03",
            "source": "rt"
        },
        {
            "content": "Wierd, wacky and sometimes sombre sturgess comedy has a great cast but a strange sense of humor",
            "review_date": "2012-11-27",
            "source": "rt"
        },
        {
            "content": "A brutally important film for anyone who wants to go into making movies.",
            "review_date": "2012-11-15",
            "source": "rt"
        },
        {
            "content": "Finally got to see this classic film. It was a wonderful take on the Hollywood film industry in the early 40s! And I can certainly see how Veronica Lake was the inspiration for Jessica Rabbit in Who Framed Roger Rabbit! Definitely worth seeing if you haven't already!",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "A movie about an A-list director doing research for a movie; It's a comedy, then a drama, then a comedy, with satire all over. Writer/director Preston Sturges tears off the hand that feeds, attacking an empty-headed and -hearted Hollywood with devastating satirical savagery, poking fun at their lame attempts to hide their disconnection from reality by releasing films about the less fortunate. Get the irony yet? Self-referential irony may have become less hip in the aftermath of countless pretenders, but the tongue-in-cheek dialogue, Veronica Lake and Joel McCrea more then holding their own as the charismatic leads, and the awkward anti-racist humor remain a genuine genre high point. It may lay on the message a little thick, and I feel like I'm being manipulated by the design cleverness, but I'm taken by this movie, despite my best cynical intentions.",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "Discovering Preston Sturges is a great achievement and an honor !!",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "Cinema /movies started as a mode of entertainment then transformed in education later on.Well I guess this was the phase when all of this was going on .this movie is a b'ful example of this .it's funny , emotional , it has drama , Henceforth a complete entertainer. Classic",
            "review_date": "2012-10-18",
            "source": "rt"
        },
        {
            "content": "What doesn't work at times doesn't really matter, because what works is incredibly brilliant and overall makes the film touching. Sullivan's a rich director who's always had money, but he's tired of making comedies. It's time to make a film about the poor. He needs to make something real, something worthwhile. The studio heads tell him that's impossible for him because he's never had to live as a poor man, so Sullivan decides to go on the streets dressed in old, torn up clothes and only ten cents. The first day he's followed by people from the studio because they want to make sure they don't lose their investment. He jumps in a crazy 13-year-old's car and they fly around, which causes everyone in the bus following him to have a rough time. After they're done he finally gets them to agree to stop following him. That day he works for a woman in her yard then goes out with her at night. He escapes in the middle of the night and jumps onto a truck, only to find himself back in Hollywood again. Sucks to be you, Sullivan. Poor guy can't even get away from his city. While back he meets the girl played by the stunning Veronica Lake. She has the perfect noir sense about her. She could have played every femme fatale and I would have been okay with it. Okay, that might be pushing it, but still you get my point. Anyway, she buys him food and he discovers she wants to be an actress, so in order to repay her he tells her who he truly is after they go to prison because the police think he stole his car. The story goes along, she becomes interested in him, doesn't want to just try to get into pictures, so she follows him on his adventures of being poor. They make up the girl to look like a boy just in case some guy gets any funny ideas. One night Sullivan gets his shoes stolen, which we know is a big deal because the soles of his shoes have his identification card in them. When Sullivan goes out to give poor people money at night he gets mugged and thrown in a train. The mugger gets ran over by a train while trying to pick up all the money he dropped. This turns out to be the guy who also stole his shoes. Since Sullivan's knocked out in a boxcar people believe that the dead body is his since the face is unidentifiable. Here's where the plot gets a little sloppy. Sullivan hits a railroad attendant for badgering him after he gets off the train and winds up in court. Here he doesn't remember his name or what happened. The blow on the head has left him with a bit of amnesia. Because of this he gets a shorter 6 year sentence to a workers camp. This is why even though it seems sloppily put together, it works. He finally gets to see what it's like to be poor and unfortunate. If he acts better he can get more privileges, but no matter what you're always seen as a lesser human being. That's why it's so heartfelt when they go to the black church and watch a movie there with everyone laughing. Sullivan learns what he was supposed to from the start: if he's going to make a movie about poor people he has to know how to do so. They don't want to see a sad film about poor people. They go to films to escape. And only the rich will watch movies about the poor to make themselves feel better. But here's the brilliance: Preston Sturges just made a movie sympathizing with poor people, showing their condition and unveiling some truths not a lot of people want to hear or see. In the end you get Sullivan finding out how to get out of the camp (telling people he's the one who killed Sullivan which gets his picture in the paper) and he finds out his wife is remarried and now he can be with the girl. Most importantly he understands that comedy pictures are worth more than he ever realized. The last shot of Sullivan and the girl mixed with the people laughing in the church almost brought a tear to my eye. Sullivan's Travels is a mostly overlooked film even though it's one of those scripts that overall so brilliant every filmmaker should be trying to learn from it, whether if it's for the message, dialogue, or comedy. This film just works so well.",
            "review_date": "2012-09-17",
            "source": "rt"
        },
        {
            "content": "Sullivan es un director de comedias que quiere experimentar la pobreza y la miseria antes de hacer un giro en su carrera y dirigir con mayor compromiso social. Así que vacía sus bolsillos y se encamina hacia la calle. Pero siempre fracasa y termina de vuelta en su mansión de Hollywood, y para colmo rodeado de reporteros fotografiándolo que convierten su odisea en una pose mediática. Y esta película en sí es una comedia (bastante graciosa por cierto) que, como Sullivan, no parece lograr escapar de su género. Hasta que un giro muy bien armado descarrilla todo y le da a Sullivan su (ya no tan) deseado descenso al inframundo, y la realidad le pega un par de buenas piñas, como para que se acuerde. Pero no les parece que esa moral del final -que la comedia es finalmente lo más noble que se puede hacer por el público- es complaciente, chata y le termina dando la razón a la industria? Bueno, quizá no tanto si se tiene en cuenta que ese género estaba un tanto subestimado en su época. Yo le saco el final y me quedo con todo lo demás, que va de lo simpático a lo genial.",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "From the brilliant mind of Preston Sturges, Sullivan's Travels resonates on many levels: as screwball comedy, Hollywood satire and Depression era drama. Plus, Veronica Lake has such a hypnotic screen presence.",
            "review_date": "2012-08-23",
            "source": "rt"
        },
        {
            "content": "Good movie with a great message .",
            "review_date": "2012-08-14",
            "source": "rt"
        },
        {
            "content": "Dry wit sums it up, but it's definitely movie that wants to make you think as well as make a statement about both the world and Hollywood in general.",
            "review_date": "2012-07-27",
            "source": "rt"
        },
        {
            "content": "A good example of Preston Sturges' trademark comedic wit and social commentary, but Veronica Lake's wannabe actress character, and her burgeoning relationship with McCrea's Sullivan, is kind of half-baked. You almost buy it, but it needs more than a scene of them pushing one another into a swimming pool to click.",
            "review_date": "2012-07-11",
            "source": "rt"
        },
        {
            "content": "brilliant and quite a journey",
            "review_date": "2012-07-10",
            "source": "rt"
        },
        {
            "content": "How have I not seen this before today on TMC? :)",
            "review_date": "2012-06-30",
            "source": "rt"
        },
        {
            "content": "Preston Sturges uses an excellent and fresh cast in this amusing comedy classic, and I loved how he found a way to use a Disney short in the film (Playful Pluto). The movie does come off as being a bit pretentious though. (First and only viewing - 2/2/2014)",
            "review_date": "2012-06-30",
            "source": "rt"
        },
        {
            "content": "A wonderful film about showing one of the most precious gifts that any person can obtain for free which is laughter. However, the icing on the cake for this film are the performances of Joel McCrea and Veronica Lake, the hilarious comedy in the film, and the heart and soul it possesses in Sullivan's Travels.",
            "review_date": "2012-06-29",
            "source": "rt"
        },
        {
            "content": "This highly-regarded, classic film of a movie executive wanting to make a film showing the gritty, realism of Depression-era America needs to be watched in the context of the year it was released and compared against anything at the time.  Otherwise, it's importance and the respect it deserves is easily overlooked.  Upon the screen of a 2012 audience, the movie may seem average and so dated as to be misunderstood.  However, it is a dark comedy, one of the first of its kind, and should be noted for how gritty and honest it truly is, especially for 1941.  Since I've been watching a lot of classic films lately, it was easy to notice how the \"language\" and \"attitude\" of this film is definitely cutting-edge compared to its contemporaries.  John Sullivan applies the \"method\" manner of film development by taking on the persona of a homeless, every-day man in order to obtain the feel of how his audiences were dealing with real life.  Comedy and drama ensue, but eventually, he learns more than he bargained for.",
            "review_date": "2012-06-09",
            "source": "rt"
        },
        {
            "content": "A pretty enjoyable comedy about class that might be a little heavy on the montage at some points. Veronica Lake is great and the cast of memorable character actors is fun.",
            "review_date": "2012-05-19",
            "source": "rt"
        },
        {
            "content": "It rushes by so fast that it's hard to enjoy.",
            "review_date": "2012-05-18",
            "source": "rt"
        },
        {
            "content": "A classic in every sense of the word. It today's economic climate, this movie doesn't feel dated at all. It's funny, sweet and just an all around great movie.",
            "review_date": "2012-05-09",
            "source": "rt"
        },
        {
            "content": "\"sullivan's travels\" has more than a few laugh out loud bits, but the film is often too stupid instead of funny. especially toward the end, some bits really drag and i found my self glancing over at the time every now and again, wondering how much longer it would go on, which is pretty bad especially considering the movie's running time is merely an hour and a half.",
            "review_date": "2012-05-06",
            "source": "rt"
        },
        {
            "content": "This movie was probably a trend-setter at the time...and maybe all of the lazy jokes, over-used slapstick and stereotypical characters were breakthrough when first introduced, but man did this seem like a bad movie. How it rates #61 on the AFI chart is beyond me. On the plus, some interesting social commentary and a few themes that I've seen referenced in other shows/movies.",
            "review_date": "2012-04-30",
            "source": "rt"
        },
        {
            "content": "A movie director goes out into the real world to ivestigate the real world for his films, and ends up on a chain gang and presumably dead.",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "one of those perfect films and great introduction to veronica lake.",
            "review_date": "2012-03-25",
            "source": "rt"
        },
        {
            "content": "Sullivan's Travels is a comedic and at times surprisingly heartfelt tale of poverty and social justice.",
            "review_date": "2012-03-01",
            "source": "rt"
        },
        {
            "content": "Who could ever get too much Veronica Lake?",
            "review_date": "2012-02-14",
            "source": "rt"
        },
        {
            "content": "Flawed yet funny, Sullivan's Travels is a great movie, but it falls short of classic status.",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "An amazing film that highlights the importance of comedy as a genre. For all critics who inappropriately label comedies as unimportant and low rent this film acts as the perfect counterpoint. It shows how to some people a laugh is the only thing they have going for them.",
            "review_date": "2012-01-05",
            "source": "rt"
        },
        {
            "content": "Veronica Lake is adorable in this Social Satire/Comedy.  An interesting and enjoyable journey.  Recommended.",
            "review_date": "2011-12-10",
            "source": "rt"
        },
        {
            "content": "If you have ever seen the 1941 Preston Sturges classic, Sullivan's Travels, you know that there is a large paradoxical element in the film's overall narrative theme which states: It is enough to make a film which allows for an audiences simplistic enjoyment of the entertainment without any heavy-handed social message which often accompanies pictures which are deemed 'important' or concerning 'the human condition.' However, in making his picture, Sturges gives us both a wonderfully farcical comedy, a biting satire, and a socially conscious message film all in one. \n\nHow than, would you say, does such a large order fill itself over the course of a 90 minute farce about a Hollywood director who wants to make a picture about suffering? Very well, in my humble opinion.",
            "review_date": "2011-12-01",
            "source": "rt"
        },
        {
            "content": "Really great comedy that has influenced many directors from Scorsese to the Coen Brothers.  I highly recommend checking this one out!",
            "review_date": "2011-11-13",
            "source": "rt"
        },
        {
            "content": "Starring Joel McCrea and Veronica Lake, with director Preston Sturges, Sullivan's Travels is about a highly successful film director (McCrea) who wants to make a movie about the common man and suffering. However, he usually writes comedies and so he decides to go on the road as a hobo to try and understand the lifestyle. During his adventures he meets a young failed actress (Lake) who is about to leave Hollywood. Wanting to help her, Sully tells the girl what he is doing and they go off together masquerading as tramps. After taking a short respite, he goes on the road again, this time alone. Through a series of events he finds himself in a chain gang while his friends assume he is dead. Eventually he is freed but not before learning a valuable lesson. If he wants to relate with the poor he should give them laughter instead of hardship. I found this movie to be an enjoyable  light comedy (even though I had never heard of it beforehand).",
            "review_date": "2011-11-01",
            "source": "rt"
        },
        {
            "content": "\"Les voyages de Sullivan\"",
            "review_date": "2011-10-15",
            "source": "rt"
        },
        {
            "content": "Veronica Lake's best, and one of Preston Sturges' standouts.",
            "review_date": "2011-10-13",
            "source": "rt"
        },
        {
            "content": "I wasn't blown away so much that I'm absolutely convinced of its essential addition to the AFI Top 100, but I was always engaged and never bored with the characters.  I can appreciate the satire, but films like this are difficult for someone of my generation to grasp entirely without the proper context.  I never felt emotionally invested and considering that \"Citizen Kane\" (which I loved) has topped the list twice, did we really need another entry on the list from 1941?",
            "review_date": "2011-10-10",
            "source": "rt"
        },
        {
            "content": "From writer-director Preston Sturges, Sullivan's Travels is the story of filmmaker John 'Sully' Sullivan disguising himself as a tramp in order to research his next picture. It's smart and funny in the way the best movies of the 1940s are, combining elements of slapstick physicality with wry witticisms and quick-fire quips. Similarly there is no dead weight being dragged along in the supporting cast, and Joel McCrea's excellent lead performance is only outshined by the radiance of a stunning Veronica Lake in her breakthrough role - even if she is more convincing dressed as a young boy than Ginger Rogers was as a young girl in The Major and the Minor. \n\nSturges is probably best known for The Lady Eve, another brilliant comedy released the same year, but Sullivan's Travels may just surpass it in almost every way. The one thing that prevents the film from being perfect is the final act's dramatic turn, which isn't entirely successful. Taking itself more seriously and taking away the jokes and the girl, it risks losing those who were expecting both right to the end. Still, it's a great story, deftly told, never dull for a second, and it's up there with the best. A tribute to the importance of laughter that succeeds on every level.",
            "review_date": "2011-10-09",
            "source": "rt"
        },
        {
            "content": "so...........boring......... and the comedy is okay, but it's not very funny. The only thing that I find that makes this movie good/interesting: Veronica Lake.",
            "review_date": "2011-09-30",
            "source": "rt"
        },
        {
            "content": "499TH REVIEW: Preston Sturges' SULLIVAN'S TRAVELS [1941]\r\n\r\nSullivan: I want this picture to be a commentary on modern conditions, stark realism, the problems that confront the average man.\r\n\r\nLebrand: But with a little sex.\r\n\r\nSullivan: A little, but I don't want to stress it. I want this picture to be a document. I want to hold a mirror up to life. I want this to be a picture of dignity- a true canvas of the suffering of humanity.\r\n\r\nLebrand: But with a little sex.\r\n\r\nSullivan: (reluctantly).....But...... with a little sex in it.\r\n\r\nHadrian: How about a nice musical?\r\n\r\nSullivan: How can you talk about musicals at a time like this? With the world committing suicide, with corpses pilling up in the street, with grim death gargling at you from every corner, with people slaughtered like sheep!\r\n\r\nHadrian: Maybe they'd like to forget that.\r\n\r\nSullivan: Then why do they hold this one over for a fifth week over at the music hall? For the Ushers? \r\n\r\nHadrian: It died in Pittsburgh.\r\n\r\nLebrand: Like a dog.\r\n\r\nSullivan: What do they know in Pittsburgh?\r\n\r\nLebrand: They know what they like. \r\n\r\nSullivan: If they knew what they like they wouldn't live in Pittsburgh. That's no argument.\r\n\r\nSeventy Years Ago in the year 1941 the world was going through utter hell. The Second World War by now had consumed most of Europe, Russia, Africa,  Asia  & The Pacific and was in its full second year of running while in the largely unaffected U.S.A had just gotten over the Great Depression. The U.S.A was yet to suffer firsthand the horrors of the last global conflict which would come towards the end of 1941 on that fateful day in Hawaii on December 7th 1941. Until then the U.S was still in peacetime when Hollywood produced three of the finest movies of all time. These were of course were Orson Welles' CITIZEN KANE, John Huston's THE MALTESE FALCON & Preston Sturges' SULLIVAN'S TRAVELS.\r\n \r\nREVIEW # 499: SULLIVAN'S ODYSSEY, A LOOK AT A GREAT HOLLYWOOD FILM.\r\n\r\nMuch like Charlie Chaplin's iconic Tramp and his many comical Odysseys, SULLIVAN'S TRAVELS sees an important Hollywood director of dumb Hollywood comedies called John. L. Sullivan played by Joel McCrea (RIDE IN THE HIGH COUNTRY) who wants to adapt the Novel \"O Brother Were Art Thou?\" a story about poverty and Human suffering to the big screen. After learning from his studio bosses that he knows nothing about trouble, poverty and Human suffering Sullivan hits the road disguised as a Tramp. Sullivan learns an important message about not human suffering but the value of humour, comedy, escapism, and above all the value of laughter. Something that today and over 70 years ago was ever so important in a time of hardship. \r\n\r\n SULLIVAN'S TRAVELS for a comedy from comedic legend Preston Sturges wrote & directed exactly 70 years ago in such a turbulent time is a film of two half's as most people have written about the film. The first half of the film is a light hearted slapstick swipe at the Hollywood system and the second half is a stirring melodrama about poverty, the class divided and something not seen in a Hollywood film of its time depicted African-Americans in a positive light. After seeing this film and reaching the milestones of my 499th, 500th & 501st reviews on this site, I decided it was important to me that one these three reviews would be about a film that had long fascinated me after learning about this 1941 masterpiece. In this special feature length essay-review I'm going to review and explain why SULLIVAN'S TRAVELS is a true masterpiece of comedy.\r\n\r\n\r\nTHE PLOTLINE\r\n\r\nAfter failing to impress studio Bosses Hadrian & Lebrand with his new movie, director John Sullivan has his heart set on making a film about suffering called 'O BROTHER WERE ART THOU?\". However the studio bosses are reluctant to back the idea, and remind Sullivan how he has never known about suffering over his safe upbringing and cushy life style complete with a wife who serves no better purpose than for a tax break. Sullivan determined to understand what it means to be without name and without a check book decides to dress up like a tramp with no more than 10c in his pocket and hit the road. However everyone including Sullivan's Butlers & the studio are not impressed by the idea. The studio has Sullivan watched by a Caravan filled with doctors, reporters, studio personal and even a cook to make sure no real harm falls upon him. After trying desperately to ditch the caravan Sullivan soon comes to the agreement with the crew that if they let him experience trouble first hand by himself then he will meet back up with them in Las Vegas in a few weeks time. In the meantime Sullivan begins an odyssey, which goes wrong after falling into the clutches of a needy widow and her friend. Sullivan quickly escapes from the Widow's farm and hitches a ride on the back of a truck. Upon the truck stopping in downtown L.A, Sullivan is disheartened that he has ended back in Hollywood.\r\n\r\n\r\nAfter getting some breakfast in a rundown diner Sullivan comes across a failed young actress (played brilliantly by Veronica Lake) who complains to Sullivan about how hard it is to make a break in the movie industry. Sullivan becomes friendly with the girl and decides to borrow his own car and drive her home, however the pair end up in jail when Sullivan's butlers realises who the tramp is. The Actress is less than impress that Sullivan isn't the failed filmmaker and tramp he proclaimed to be, but after he explains why he was dress as a tramp the young actress wants to join him on his journey. Despite his reluctant attitude, Sullivan and the girl soon hit the road together and together Sullivan and the girl learn what it is like to be in poverty. In a silent montage Sullivan & The Girl grow closer while travelling across The U.S.A amongst the poor and hungry, upon nearly eating out of the trash Sullivan and The Girl return to the studio crew and a well off lifestyle.\r\n \r\nBut not before Sullivan decides to hand out a pile of cash in disguises as the tramp for one last time to the tramps for what they had shown him. One greedy Tramp assaults Sullivan steals his money, shoes with his I.D cards in the soles and leaves him for dead on a train. The Greedy tramp is soon killed on the rail tracks with the I.D card shoes. After not coming back to the Girl and the studio crew, a search begins for Sullivan which ends up with the wrong conclusion in the city morgue with the dead bum. Sullivan arrives on the train in  a rail-yard somewhere in the deep South of the country were disoriented Sullivan hits a railway yard worker which sees Sullivan being imprisoned for six years on a Southern Chain-Gang.  Sullivan desperately wants to get back to L.A and tries anything to get out of the gang especially after in a Gospel Church amidst a crowd of laughing people, Sullivan learns the value of comedy.  Sullivan decides to claim that he was the killer of the dead Hollywood director John Sullivan in the hope he would get media attention and be freed from the Chain gang.\r\n\r\n\r\nTHE ACTING, SCRIPTING AND DIRECTION.\r\n\r\nThis film has many great performances in this film, from what I have found out about writer-director Preston Sturges is that he is considered the father of screwball comedy. One aspect of Sturges auteur style was that he would give the punch-lines to not always the main characters but rather to the secondary characters. The dialogue such as the excerpt at the start of the review is just amazing and how it's delivered to start with such speed it comes so quick and fast is also amazing. Later in the film Sturges comedic style fades away for a grim social melodrama like the scenes of Sullivan & the girl experiencing the hardships of life on the road, The chain gang sequence and of course the moving church sequence which are all done in a masterful way. \r\n  \r\nThe two performances that I will talk about are of course Joel McCrea & Veronica Lake. McCrea I have seen in another great film and poetic by Sam Peckinpah called RIDE IN THE COUNTRY made in 1962, were McCrea plays an ill fated aging lawman who longs to enter his house justified. McCrea much like in that film is brilliant in this film as John Sullivan. Alongside Veronica Lake who also is just brilliant as 'The Girl\" (because no name is given for her character), both McCrea & Lake are great together.\r\n\r\n\r\nTHE CHURCH SEQUENCE AND ITS HISTORICAL IMPORTANCE \r\n \r\n One of the most celebrated moments in this film occurs deep within the film when the chain gang and Sullivan are escorted into a Black Church to see a movie. After seeing the Minister ask his parishioners that they are going to have a bit of entertainment with people less fortunate than themselves and asking them not to judge them because they are all equal in the eyes of God. The doors open to the chain gang while they shuffle in the parishioners sing GO DOWN MOSES   to them. When the projector starts to screen a Pluto cartoon, everyone in the church is seen laughing together. 70 years after this film was made a scene like this is viewed as a normal thing, however in 1941 for African-Americans to be shown in a respectful light in a Hollywood film was almost alien. For a black people to be shown than anything other than inferiors was common place in most Hollywood films of the time.\r\n\r\n The church sequence in SULLIVAN'S TRAVELS attracted positive feedback from most liberal whites and African- American's.  Preston Sturges received a letter from NAACP secretary Walter White congratulating him for the scene, \"I want to congratulate and thank you for the church sequence in Sullivan's Travels. This is one of the most moving scenes I have seen in a moving picture for a long time. But I am particularly grateful to you, as are a number of my friends, both white and colored, for the dignified and decent treatment of Negroes in this scene. I was in Hollywood recently and am to return there soon for conferences with production heads, writers, directors, and actors and actresses in an effort to induce broader and more decent picturization of the Negro instead of limiting him to menial or comic roles. The sequence in Sullivan's Travels is a step in that direction and I want you to know how grateful we are\".  In a way SULLIVAN'S TRAVELS was one of the first Hollywood films to portray African-Americans in an equal and dignified light, sadly it would take another 15 to 25 years before Hollywood changed for the better. \r\n\r\nOVERALL THOUGHTS  \r\n\r\nSULLIVAN'S TRAVELS as I have mention is one truly great film; in fact its ground breaking portrayal of African Americans, satire of the Hollywood system, and a stirring reminder of the value of laughter makes this film a truly great movie. The only thing this film has denied is a wider audience, which is what it really needs. Personally along with a few other classic films from the 1940's, this film is without a doubt one of my all time favourite movies. My rating is a solid 100% for this great movie.",
            "review_date": "2011-09-19",
            "source": "rt"
        },
        {
            "content": "I think the film Sullivan should've made after the end is the Coen Brothers version of O Brother, Where Art Thou?",
            "review_date": "2011-09-19",
            "source": "rt"
        },
        {
            "content": "This is an absolutely brilliant film that has a lot more messages than meets the eye. I was more so expecting this to be a straight screwball comedy, but it had much more under the surface and more tragic and thought provoking sequences.  The characters, cast, and especially the writing are all perfection. Even the slightest minor characters have deep thoughts and striking personalities. I'm still honestly not getting the completely random hanging legs at around the 55 minute mark when McCrea and Lake are walking near the water.",
            "review_date": "2011-09-05",
            "source": "rt"
        },
        {
            "content": "Beyond meta-film and beyond screwball comedy, Sullivan's Travels is a breathtaking adventure ahead of its time. The process of filmmaking inspiration had never met such an unusual turn, but Sturges was the man for the job. This may be the first masterpiece to celebrate the movie industry with predominant passion (and some inside spoofs and jokes). Veronica Lake is a stunning fox in here!\r\n\r\n99/100",
            "review_date": "2011-08-26",
            "source": "rt"
        },
        {
            "content": "Perhaps the most iconic role of chic blonde bombshell Veronica Lake ever had, \"Sullivan's Travels\" is yet another excellent Preston Sturges comedy that stings more than it makes you laugh, which isn't necessarily a bad thing when it comes to a satirical piece like this one.  It may not be as hilarious as Sturges' \"other\" 1941 film, \"The Lady Eve,\" but \"Sullivan's Travels\" is a bit more thoughtful, and by the time everything's wrapped up, it raises lots of questions that one wouldn't ordinarily think of.\n\tJoel McCrea, a Sturges favorite, portrays John L. Sullivan, a somewhat successful director that has made a profitable career out of making frothy comedies.  But after a screening of his upcoming film, Sullivan decides to put his career on halt and discover the true nature of human tragedy by living it himself.  After all, the next film he's planning to direct is \"O Brother, Where Art Thou?\"\n\tSo he picks up some roughed-up clothes, dirties himself, and hits the road, with his staff tailing him in a luxurious van (much to his dislike).  He picks up a bitter actress (Lake) who's fed up with the phoniness of the movie industrey, and the attractive twosome go on a penniless journey together; they quickly lean that the \"tramp\" lifestyle isn't so bad, as long as you're able to get by.  \n\tMcCrea and Lake are such a smart couple on the screen that it's surprising that behind the screen they loathed each other greatly.\n\tA slinky combination of dry comedy and depression era-esque drama, \"Sullivan's Travels\" keeps the basic Hollywood formula of \"comedy\" in mind and, instead of putting up the good-old usual, it almost examines it.  And it isn't at all subtle, considering the main character of the film is sick of comedies, and wants to see what the darker sides of life can offer.\n\t\"Sullivan's Travels\" instantly makes you think of the majority of films during wartime, most of them being cute, escapist comedies or Technicolor-laden musical spectacles, with just a few that come to mind about real human tragedy.  But at a time where the nation as a whole NEEDED to escape from all of the hardships of real life, it isn't at all a surprise.  Who would want to see a sad melodrama during a difficult time? In the end, \"Sullivan's Travels\" is almost a journey discovering why a simple, fluffy laugh is much more enticing than a tear-jerker.\n\tThis is discovered later in the film, when Sullivan is sent to a labor camp.  The work is largely difficult: the \"employees\" have to work in the hot sun all-day, hardly with any breaks.  Everyone there is miserable, put frankly.  There's a scene, set around this labor camp, in a church, where all of the workers get the chance to go to \"the picture show,\" as one character puts it.  Along with the churchgoers, the workers get to see a Mickey Mouse cartoon.  The cartoon takes them away from their hellish life, gives them a good time, and a warm dose of happiness.\n\tIt is such a beautiful scene-- Sturges brilliantly focuses the camera on individual workers' expressions.  Many of their faces are covered in mud and sweat, but their smiles are huge, and their laughs hide their misery.  In that moment, Sullivan discovers why tragedy films aren't attractive to anyone, and just a few minutes, the film ends.  And it couldn't be better.\n\tSturges' writing and directing is 100% perfect.  This film is so fresh, funny, lovely, touching, and biting that it almost seems surprising that something so feel-good can also be razor sharp.  \"Sullivan's Travels\" is brilliant.",
            "review_date": "2011-08-18",
            "source": "rt"
        },
        {
            "content": "Great screwball comedy and social commentary from Sturgis",
            "review_date": "2011-08-16",
            "source": "rt"
        },
        {
            "content": "#61 on AFI's Top 100 Movie's List.  Better than expected (good twist ending that gets the message that making people laugh is more important than portraying serious messages in movies), but not really sure why it is considered a top movie of all time.",
            "review_date": "2011-08-07",
            "source": "rt"
        },
        {
            "content": "Pretty awesome movie about the power of laughter during the rough parts of life. The first scene between Veronica Lake and Joel McCrea is absolute perfect screenwriting. Not a dull moment in the whole moment.",
            "review_date": "2011-07-28",
            "source": "rt"
        },
        {
            "content": "A much beloved movie about a movie movie that's at times pretty wonky and silly and at others actually quite dark and serious, while striking a pretty good balance between both. The big draw of this movie is obviously the often worshiped Veronica Lake, but frequent Struges collaborator Joel McCrea is great too. I definitely liked the last half better than the first, but this is an entertaining, fun little romp overall.",
            "review_date": "2011-07-23",
            "source": "rt"
        },
        {
            "content": "The slapstick comedy bits fall flat at times and there are a few questionable plot conveniences, but for the most part it's pretty funny and intelligent, and the concept is great.",
            "review_date": "2011-07-16",
            "source": "rt"
        },
        {
            "content": "I am a fan of Veronica Lake, and this movie is gorgeous... beautiful cinematography for the time.",
            "review_date": "2011-07-15",
            "source": "rt"
        },
        {
            "content": "The films approach feels terribly sophisticated considering when it was made, with some elements even coming across as post-modern. It is also incredibly good natured, in a manner that isn't patronising. \r\n\r\nIf I'm being honest, I wonder if it was made today would I have such a high opinion of it. But at the same time, if it hadn't been made who knows what wartime shite might have taken its place as the yardstick for clever comedy. \r\n\r\nIf the vision of today's standard comedy fare is just as erudite and sharp, its only because they are standing on the shoulders of the gently satirical giants that paved the way. This film is one of those giants.\r\n\r\noh, and Veronica Lake is a stone cold fox.",
            "review_date": "2011-07-15",
            "source": "rt"
        },
        {
            "content": "This film has it all, slapstick comedy, wisecracking one liners, attempted murder, Veronica Lake dressing up as a very convincing boy....everything.\n\nPreston Sturges seems to have a lot of fun getting his Depression-era message across and even manages to perfectly validate the films attempt to franticly (and jokily) cover all bases to cater to the widest audience. Clever bloke.\n\nThe writing is bang on and direction is playful. The church scene is a real golden moment in a film full of wonderful moments.",
            "review_date": "2011-06-29",
            "source": "rt"
        },
        {
            "content": "love me some Veronica Lake in a comedic societal critique. Go Preston!",
            "review_date": "2011-06-26",
            "source": "rt"
        },
        {
            "content": "A well-done comedy, that takes a dark turn late in the film, but ends with Sullivan recognizing that his journey to understand the tramps of the world has led him to realize that, for some, comedy is all they have to make the day go down easy. The first half of the film I found particularly hilarious, especially the bus-chasing scene which had me in stitches. McCrea and Lake were a fine pairing, and I enjoyed watching them learn more about living town-to-town. The film does feel a bit long, particularly after Sullivan was \"killed\" (excepting for the picture show scene). Regardless, a very good film about a man's journey to learn about another part of society.",
            "review_date": "2011-05-31",
            "source": "rt"
        },
        {
            "content": "Seriously silly Sturges.",
            "review_date": "2011-05-29",
            "source": "rt"
        },
        {
            "content": "Brilliant, witty screenplay and a story that takes a thoughtful look at the impact of the Great Depression on the common man and woman.",
            "review_date": "2011-04-24",
            "source": "rt"
        },
        {
            "content": "One of only 13 films written & directed by Preston Sturges, and one of his few failures at the time. Critically panned and not a big commercial success either, it eventually came to be seen as his most accomplished work by future cinemaniacs. \n\nI understand contemporary reviewers' opinion that Sturges doesn't follow his own message: films should be funny, not drown in messages that most people don't understand or care about. The conundrum of course is that making a film with that specific message becomes automatically self-defeating. I admit freely to having had a lot more fun watching that other Sturges film \"The Lady Eve\". But if you don't get hung up in the 'message controversy'\", Sullivan offers a couple of good laughs, a lot of (very fake, as it turned out) chemistry between McCrea & Lake, and some cinematic grand-standing in long sweeping camera shots. \n\nMade in Veronica Lake's heyday, just before she began succumbing to mental illness that saw her become one of Hollywood's more tragic stories, and worthy of a film in its own right (I would actually really like to see that film, provided it's well done and they get a good actress, like Amy Addams perhaps). Lake was 6 to 8 months pregnant over the course of filming, a fact she had not advised Sturges about until her contract was signed, which caused him to nearly assault her. Costume designers did a remarkable job hiding it, since nowhere does she look preggers. When aware of the fact, there's a couple of scenes towards the end of the film, when her characters runs (and falls, not scripted, hearts must have stopped when that happened), in which you can see HOW they hid her belly, but if you wouldn't know that, you'd barely notice. \n\nOther than  her advanced state, McCrea loathed Lake so violently that he refused to star in \"I married a witch\", stating that life is too short to make two films with Veronica. Eventual co-star in \"I married a witch\" apparently agreed, though he found one film too much in hindsight. Lake's talent is often derided, but here I found her compelling, convincing & charming, and since the mutual loathing between the stars, she sure acts her infatuation very well.",
            "review_date": "2011-04-23",
            "source": "rt"
        },
        {
            "content": "#61 - AFI top 100 Movies, 2007 ed.",
            "review_date": "2011-03-27",
            "source": "rt"
        },
        {
            "content": "Very entertaining Preston Sturges movie.",
            "review_date": "2011-02-21",
            "source": "rt"
        },
        {
            "content": "Very clever.  Very funny.\n\nVeronica Lake is absolutely gorgeous.",
            "review_date": "2011-02-21",
            "source": "rt"
        },
        {
            "content": "Sturges' masterpiece, \"Sullivan's Travels\" boasts a pitch-perfect balance of humor and heart.",
            "review_date": "2011-02-20",
            "source": "rt"
        },
        {
            "content": "a brilliant comedy about the importance of brilliant comedies",
            "review_date": "2011-02-06",
            "source": "rt"
        },
        {
            "content": "A very gentle social commentary film that is very enjoyable. It's got a easy light sense of humour and while none of its observations on the world and class are earth shattering, they are none the less relevant. The overall tone of the film is a tad naive and it's quite glossy, even when depicting the homeless. The ending is a bit ridiculous, but so is the overall plot of the film. It walks that line very well, never crossing it into absurdity.",
            "review_date": "2011-01-29",
            "source": "rt"
        },
        {
            "content": "It may not be as good as Sturges' \"The Lady Eve,\" but \"Sullivan's Travels\" is an absolutely lovely, very likable film from the early 1940's. The film follows the life of director, played Joel McCrea, who wants to make a movie on tramps (today it would translated as bums or hobos). The way he does this is lives like a bum and along the way (in Hollywood of all places) he finds Veronica Lake (\"The Girl\" as she is credited) and its history from there. The film has some fine lines (\"You don't know anything about anything\") and sharp comedy, as well as some beautiful tenderness, exposing the love between McCrea and Lakes' characters plus the emphasis of the hobos' lifestyle. The only critiscm I have towards this film is the first ten minutes, which seem a bit slow and bereaved of laughs, that's all. It is a lovely film to watch and a good comedy from the 1940's.\r\n\r\nNot I ask all RT users, what happened to the website? It is a utmost nightmare to navigate through. Ugly as sin to look at, unappealing, stupid, inconsistent, and even more problematic than before. Who designed this? Some more the planet of Jupiter? This is a terrible, TERRIBLE layout. Ugh!",
            "review_date": "2011-01-25",
            "source": "rt"
        },
        {
            "content": "A motion picture director embarks a journey with only 10 cents on his pocket to study poverty..A serious blend of comedy and melodrama. Nothing like it.",
            "review_date": "2011-01-21",
            "source": "rt"
        },
        {
            "content": "So letâ(TM)s pretend for a second that youâ(TM)re going to set out to make a movie about the ravaged economy and what it is like to be a hobo, riding the rails and stealing shoes in the night for your own feet.  You might think you need a better idea to base your movie on and you might be right but for the Sullivan of our film here, he decides research is not enough to get to the heart of this matter.  He opts to travel the country as a bum, along with the first-class bum entourage sweeping the nation (actually, he insists his Hollywood staff remain behind but they insist on tagging along and itâ(TM)s a good thing, too â\" they actually make for some of the most bluntly honest stuff Sturges ever wrote).  Shortly into the trip, he falls in love with a down-on-her-luck gal hoping to hit it big and before you can say âGee, I wonder how this is going to end up,â sheâ(TM)s hopping trains, sleeping on streets and learning the ways of the bum, albeit it in disguise (I guess there is no such thing as female bums in this universe?).  Everyone learns a valuable lesson but then it dawns on your that thereâ(TM)s still another 20 minutes to play out and you wonder where this can possibly go.  Turns out thereâ(TM)s another lesson or seven to learn, from Disneyâ(TM)s Pluto of all things, and this is where the film stumbles a bit.  Look, Sturges knows what he is doing and his writing elevates already solid performances from everyone in this (youâ(TM)d be hard pressed to find someone not holding up their end of the acting agreement) but for whatever reason, the final few scenes left a horrid taste in my mouth.  And yeah, thatâ(TM)s probably a cheap reason to dock a movie in its score but really now: you watch the end of this and tell me if it had the intended effect on youâ¦ and if it did, well, then clearly you and I havenâ(TM)t hung out enough.",
            "review_date": "2011-01-10",
            "source": "rt"
        },
        {
            "content": "Very good. Not anywhere near as nasty as most Hollywood satires, but then it doesn't wholly fit into that subgenre. Joel McCrea and Veronica Lake aren't the greatest performers around, but I like them just fine, and they've got the appropriate chemistry. I disliked the third-act device of amnesia, and the rather forced and obvious ending, but no matter. An entertaining piece of work all the same.",
            "review_date": "2010-12-29",
            "source": "rt"
        },
        {
            "content": "An original picture of it's time, at the it's borrow from the silence slapstick era. It's funny, it's a movie for all time, for all. So just relacs and enjoy.",
            "review_date": "2010-12-20",
            "source": "rt"
        },
        {
            "content": "Veronica Lake has Jessica Rabbit's hair. I have mixed feelings about this",
            "review_date": "2010-12-06",
            "source": "rt"
        },
        {
            "content": "This movie is hilarious! There's so many one-liners. The third act takes a bizarre tone-shift, but the film remains interesting. I just wish they'd have kept it going a-laugh-a-minute like the first part of the film. It kind of echoed (or, rather, served as a precursor to) \"Adaptation\", in that sense.",
            "review_date": "2010-12-04",
            "source": "rt"
        },
        {
            "content": "C'est plutÃ´t drÃ´le, certainement assez novateur, mais aujourd'hui terriblement convenu. Chose amusante : le film tape sur la \"bien-pensance\" qui prend de tous les cÃ´tÃ (C)s de nos jours. D'ailleurs, le titre des Coen \"O Brother Where Are Throu ?\" est une rÃ (C)fÃ (C)rence Ã  Sullivan's Travel.\n\nEn bref, un film de l'Ã¢ge d'or certes, et bien agrÃ (C)able, mais pas un chef-d'oeuvre intemporel.",
            "review_date": "2010-11-15",
            "source": "rt"
        },
        {
            "content": "http://cinetarium.blogspot.com/2010/09/sullivans-travels-or-how-to-stop.html",
            "review_date": "2010-09-29",
            "source": "rt"
        },
        {
            "content": "A movie all movie lovers should see.",
            "review_date": "2010-09-19",
            "source": "rt"
        },
        {
            "content": "Good comedy, with some little flaws in the plot, but the rest is excellent. Great ending.",
            "review_date": "2010-09-18",
            "source": "rt"
        },
        {
            "content": "Why we love the movies.",
            "review_date": "2010-09-15",
            "source": "rt"
        },
        {
            "content": "Cushy Hollywood director John L. Sullivan wants to direct a tragedy, but his producers point out that he has never really undergone hardship. He sets out with a raggedy suit of clothes and 10 cents in order to be a tramp, and along the way he meets a bunch of people and gets in a lot of trouble.\n\nAt a short 90 minutes, it still manages to convey a good story. A rich director with no knowledge of the Depression simply plays the tramp for most of the film until the half way point where he really does become a tramp. Sullivan discovers that people with nothing still want entertainment, which leads him to complete a small but satisfying character arc.\n\nVeronica Lake is also very impressive as The Girl. An attractive buy sassy young woman who buys John breakfast becomes his sidekick and love interest which also adds another dimension the script.\n\nIts truly the moments without dialogue that have some of the most emphasis. There are multiple montage scenes all around which convey what needs to be done, without the amount of cliche scenes that would normally entail.\n\nAll together a well plotted and well scripted little comedy. The chemistry between Joel McCrea and Veronica Lake is genuine, and it ends up being one of the best movies about movies ever made.",
            "review_date": "2010-09-07",
            "source": "rt"
        },
        {
            "content": "Oh, this movie was hilarious!  Some scenes may get a little too silly, but overall it works.  I highly recommend this great screwball comedy.",
            "review_date": "2010-09-05",
            "source": "rt"
        },
        {
            "content": "mr. Sturges was very intelligen fella...and brave - for the 40's. great.",
            "review_date": "2010-08-31",
            "source": "rt"
        },
        {
            "content": "Some great, witty, quick dialogue scenes, and the montage scenes are quite good.",
            "review_date": "2010-08-31",
            "source": "rt"
        },
        {
            "content": "And now I finally understand where \"O, Brother Where Art Thou?\" comes from. Nice. Oh... and I never realized how absolutely lovely Veronica Lake was. Wow!!",
            "review_date": "2010-07-04",
            "source": "rt"
        },
        {
            "content": "One of the best scripts that ever came out of Hollywood, Sullivan's Travels proves Preston Sturges was one of a kind.A perfect mix of comedy, drama and social commentary, this film is a must-see for anyone who really loves movies!",
            "review_date": "2010-06-23",
            "source": "rt"
        },
        {
            "content": "Burrows: You see, sir, rich people and theorists - who are usually rich people - think of poverty in the negative, as the lack of riches - as disease might be called the lack of health. But it isn't, sir. Poverty is not the lack of anything, but a positive plague, virulent in itself, contagious as cholera, with filth, criminality, vice and despair as only a few of its symptoms. It is to be stayed away from, even for purposes of study. It is to be shunned.",
            "review_date": "2010-06-18",
            "source": "rt"
        },
        {
            "content": "Great film!  This movie had really good shots that conveyed good acting, although over the top with dry wit and humor.  Since I think that was the goal of this film, it did a pretty good job of it and I recommend this for anyone who is interested in older classics.  I really did like the chemistry between the main characters and that seems hard to create in most films.",
            "review_date": "2010-06-16",
            "source": "rt"
        },
        {
            "content": "Really great comedy that has influenced many directors from Scorsese to the Coen Brothers.  I highly recommend checking this one out!",
            "review_date": "2010-04-24",
            "source": "rt"
        },
        {
            "content": "This is a film I'd never heard of, until Resentley. I kept hearing about Veronica lake but had not seen her in anything. And the same goes for the director Preston Sturges. What a great film it is, Lake does not disappoint she has this presence on screen you take your eyes off her. Joel McCrea is fantastic as well. It balances humour and drama very well. This is a film I recommend to any fan off old movies. Fantastic",
            "review_date": "2010-04-04",
            "source": "rt"
        },
        {
            "content": "Such a terrific film!!! It has been a long time since I have seen a film that blended comedy and a relevant specific message of the time as well as this film did. It flowed like magic, completely entertaining as much as it was insightful. Both leads Joel McCrea & Veronica Lake where fantastic and had a wonderful chemistry.\r\n\r\nRarely a dull moment, when the film wasn't making you think you'd be laughing and vica versa. To me this a perfect example of classic film that is truly timeless, Preston Sturges truly created something rather special....",
            "review_date": "2010-03-31",
            "source": "rt"
        },
        {
            "content": "The poster/DVD cover of this means absolutely nothing.  Sullivan's Travels is about a guy pretending to be a hobo because he's tired of making comedies and wants to make something that'll hit the people RIGHT where they live.  This is funny, and in the end sums up my favorite genre.",
            "review_date": "2010-03-16",
            "source": "rt"
        },
        {
            "content": "Great movie!!  Highly underrated even today.",
            "review_date": "2010-02-28",
            "source": "rt"
        },
        {
            "content": "The sweetest, most generous-hearted satire of the Hollywood film industry the town has ever produced, Sullivan?s Travels was the fourth of the eight films Preston Sturges made during his astonishingly prolific streak between 1940 and 1944",
            "review_date": "2010-02-20",
            "source": "rt"
        },
        {
            "content": "Starts to make a point, then gets lost in silliness, then makes the point again. At least the elitist liberal douche learned the true meaning of life...laughing your ass off.",
            "review_date": "2010-02-18",
            "source": "rt"
        },
        {
            "content": "Â¿Arte para entretenimiento? Â¿Entretenimiento hecho arte? Â¿Ventana de la realidad o evasiÃ³n con olor a palomitas? Excelente bocanada de aire fresco de un pasado... mÃ¡s o menos lejano.",
            "review_date": "2010-01-31",
            "source": "rt"
        },
        {
            "content": "Timeless satire on the importance of comedies in film. Veronica Lake is too sweet & unforgettably charming  as \"The Girl,\" & Joel McCrea is great as the popular, young, successful Hollywood director, in search of making a more meaningful film.",
            "review_date": "2010-01-28",
            "source": "rt"
        },
        {
            "content": "The brief clip at the beginning from \"O Brother, Where Art Thou?\", the film within the film, is so stirring that one wonders what would have happened had Sturges directed a similar bleak project. \"Sullivan's Travels\" is a skillful tightrope walk over real human suffering, with one misstep threatening to send the whole thing crashing down into the realms of bad taste. World War II broke out shortly before this movie was released and there were suddenly much bigger problems to deal with, much more dire concerns on the public's mind.  \n\nUnfortunate, since this film should have been a huge hit. \"Sullivan's Travels\" became a reflection of a naive pre-war mindset, and its honest attempts to deal with social reform fell on blind eyes. It's a very tight, very funny film with a perfect mix of slapstick and wit.",
            "review_date": "2010-01-21",
            "source": "rt"
        },
        {
            "content": "Wonderful screenplay, I really like the way the film is cynical with itself and the industry, one of the best inside industry movies. Joel MacCrea and Veronica Lake are great.-",
            "review_date": "2010-01-03",
            "source": "rt"
        },
        {
            "content": "Still pertinent (sometimes drawn-out) Hollywood satire, filled with brilliant dialogue. First & final thirds are great. Seems more relevant than ever to today's Australian film industry.",
            "review_date": "2010-01-01",
            "source": "rt"
        },
        {
            "content": "This is about the best Black & White Movie I have seen in sometime. Veronica Lake was nothing short of great and beautiful, her acting couldn't be touched by any other actress in this film. She was a beautiful lady.  This movie starts out and one wonders if they are in for a slow boring film, but within 15 minutes it picks up and what we have is a wonderful story for the 1941 time frame. Joel McCrea plays a big time movie producer who is going to put out a movie about hard times, but what does he know about hard times, so he goes on the road as a hobo, meets Veronica Lake and she joins him on his quest. All in all it makes for a pretty good movie, worth the rental, if your a Pre 1960 film collector this one needs to be in it, no big name stars but an excellent movie overall. 4 Stars",
            "review_date": "2009-12-25",
            "source": "rt"
        },
        {
            "content": "Kinda made me think alot when Sullivan said that laughter is all that many people have to make them happy.",
            "review_date": "2009-12-25",
            "source": "rt"
        },
        {
            "content": "I'll admit it--I'd be a sucker for Veronica Lake.  She could wrap me around her finger with no effort.  This is my favorite of her films, and of Joel McCrea's films, and of brilliant director Preston Sturges.  Way ahead of its time, \"Sullivan's Travels\" starts out as a slapstick comedy in the unreal world of Hollywood.  But as McCrea and Lake head out into the real world, the laughs get more and more reality-based and then drama takes over as the truth of life in Depression-era America falls on our hapless hero like a ton of bricks.  Alternating laughs with keen social comedy, Sturges gives us a film that reminds us to accept ourselves and our place in the world.",
            "review_date": "2009-12-22",
            "source": "rt"
        },
        {
            "content": "Great movie. Rarely seen on TV. Sums up my outlook on life. Be thankful for what you have because there are others who wish they had what you have. Life sucks without laughter.",
            "review_date": "2009-12-19",
            "source": "rt"
        },
        {
            "content": "oh Veronica you're delicious, great film!",
            "review_date": "2009-12-17",
            "source": "rt"
        },
        {
            "content": "A film director wants to make a movie called 'O Brother Where Art Thou' and decides the best way to do research on this serious picture about the poor is to dress up like a hobo and try to live off the ten cents in his pocket.\nLots of great bits of banter and while I wasn't fussy for the main character, everybody who surrounds him is a joy.  The scene where Veronica Lake buys him the ham and eggs is the best scene in the movie and she's a pleasure to watch in this one.",
            "review_date": "2009-12-08",
            "source": "rt"
        },
        {
            "content": "Sullivan's Travels is a very important, life changing film. And you won't know it till the last scene.",
            "review_date": "2009-12-01",
            "source": "rt"
        },
        {
            "content": "I have two goals for this project this weekend. One is to get my total of AFI movies watched to at least ten. The second is to have enough cash left over in this pay period to place a half.com order for a few of the ones that are expensive at Best Buy and not available to rent on Amazon. Here's hoping.\r\n\r\nThe order Im picking to watch movies is pretty random. Since I've seen about 1/4 of them before, Im trying to keep those repeats spread out to every 4th movie. Also trying to balance the online vs offline movies. Right now the strategy for picking online movies is to first go for the ones that would be most expensive to otherwise get at Best Buy. Sullivan's Travels would have actually been the most expensive purchase, according to bestbuy.com So its priority was upped and I watched it just now. Wow that paragraph was boring. Sorry, peeps.\r\n\r\nMixed feelings about this one. There were points when I thought it was one of the greatest comedies Ive ever seen, and points when I found it kinda dull. Mostly the good outweighs the bad. The dialogue (which you'll learn is prolly the most important thing in a movie for me) was smart and snappy, especially in some of the opening scenes, which I absolutely loved. But the slapstick that was sprinkled into that was a bit too much for my taste. I think thats because I tend to find visual humor very predictable, whereas quick dialogue is more likely to surprise me. That's also why I like offensive humor, but thats not applicable to this film.\r\n\r\nMy big complaint, however, is that while watching the film, it felt kinda disjointed. The main plot line wrapped up earlier than I expected, and then the story took a weird twist kinda late on. By then I was kinda ready to file this movie away, not start on some new train of thought. It all got wrapped up very nicely, but it wasnt until those final moments that it all made sense. Until then that last half hour was just awkward.\r\n\r\nAnother thing Im on the fence about is that there were a lot of sequences without any dialogue. Some of them were beautiful, others boring. Ultimately, I do think it was a nice touch, I guess I just didnt have the attention span.\r\n\r\nWhat I am completely sold on in this movie, was Veronica Lake's performance. I just loved her. She has that 1940's glam but she was also one tough cookie. This may actually be the first time that I see a character from such a far back time period who I wish I was. Sadly a quick IMDB check shows that I wont be encountering Ms Lake in any other AFI films, but she did make a zombie movie in the 70's. May hafta scope that one out later.\r\n\r\nIm just not enough in the writing flow right now to come up with any more comments on this one. I very much enjoyed the first hour, but the rest of the 90 minutes just lost me.\r\n\r\n\r\nhttp://expletivedleted.livejournal.com/\r\nhttp://twitter.com/ExpletiveDleted",
            "review_date": "2009-11-29",
            "source": "rt"
        },
        {
            "content": "Good comedy, with some little flaws in the plot, but the rest is excellent. Great ending.",
            "review_date": "2009-11-24",
            "source": "rt"
        },
        {
            "content": "From director Preston Sturges, a former Broadway writer who had gone to Hollywood and made moderately successful films like The Great McGinty and The Lady Eve, comes this off-the-wall comedy with a down to earth quality. Although not a big success upon it's original release, it's now considered to be one of the best films ever made, like Citizen Kane really, but this has stood the test of time. It has John L. Sullivan (Joel McCrea), a young director working in Hollywood who has hit it big, although the films he makes are successful, he's unsatisfied with them, and he wants to make a film about the plight of the less fortunate, to be titled O Brother, Where Art Thou? He decides to try and live his life as a hobo, but the studio head Mr. Lebrand (Robert Warwick) is keeping tabs on him by following him around, Sullivan gets help from a down-on-her-luck aspiring actress known as The Girl (Veronica Lake), but his plans go slightly awry. It is a genuinely funny film with some brilliant dialogue within. It comes from the golden ages of the screwball comedies that came out of Hollywood at that time. McCrea was a brilliant leading man back then, and he sparks wonderfully of everyone he comes into contact with. Sturges' dialogue is brilliant, and has influenced many. The Coen's were heavily inspired by this for one of their films, can you guess which one??",
            "review_date": "2009-11-19",
            "source": "rt"
        },
        {
            "content": "They don't make them like this anymore! Well, some of them do, I suppose. But not Preston Sturges, because he's dead.",
            "review_date": "2009-11-10",
            "source": "rt"
        },
        {
            "content": "The best movie about movies in my opinion, next to Sunset Blvd. You can't really go wrong with this one. Good story, good message, good acting, good direction. Oh, and Veronica Lake.",
            "review_date": "2009-10-26",
            "source": "rt"
        },
        {
            "content": "A superior film, not very funny but neither the less a very good film.",
            "review_date": "2009-10-22",
            "source": "rt"
        },
        {
            "content": "One of the great American comedies. A solid classic and close to flawless from beginning to end, super-intelligent and very funny, it's easy to see why the Coens dig it so much. Nicely satirizes its target (self-important Hollywood types who are on a mission to save the world) in a way that is never mean-spirited. The careful balance between comedy and drama is so skillfully handled you never find yourself thinking \"Is this a comedy, or a drama?\"  And the concluding \"moral\" of the story might seem like a bathetic one, but it is meaningful and true...maybe comedies can't save the world but they can make it laugh. And that's not such a bad thing, if that happens to be your job",
            "review_date": "2009-10-20",
            "source": "rt"
        },
        {
            "content": "The church sequence alone could warrant this getting 5 stars; Preston Sturges absolutely achieves all of the goals and intentions set out, and most impressively explores them through the character of John SUllivan which makes them impact more subtle and more successful.",
            "review_date": "2009-10-14",
            "source": "rt"
        },
        {
            "content": "Very entertaining (if somewhat overrated) comedy, with some good insights. I really hate amnesia as a plot device, though, and Sullivan's little speech at the end is over the top and unnecessary.",
            "review_date": "2009-09-24",
            "source": "rt"
        },
        {
            "content": "I think I missed something... where's the comedy? If the pool scene is the comedy, I think I should rate this lower... it's a good movie about movies but the message it pushes is a little in-your-face... a smoother delivery would have held up better over time",
            "review_date": "2009-09-23",
            "source": "rt"
        },
        {
            "content": "Laugh out loud funny even today, a sweet love story, and subversive, biting social commentary long before the 60s made it fashionable to do so.  This movie really has it all.",
            "review_date": "2009-09-22",
            "source": "rt"
        },
        {
            "content": "The seven minute silent sequence through the dregs of society is one of my favorite moments in cinema ever. I might even claim the same about the scene in the church.",
            "review_date": "2009-09-20",
            "source": "rt"
        },
        {
            "content": "Old blonde sassy Hollywood starlets = awesome.",
            "review_date": "2009-09-16",
            "source": "rt"
        },
        {
            "content": "Sublime comedy/drama.  It gets a bit heavy handed with its moral message at times, but it's so jam packed with hilarity that such preaching is easy to forgive.",
            "review_date": "2009-09-16",
            "source": "rt"
        },
        {
            "content": "A hilarious social commentary film about a film basically.  Satire and humor run high in this and the film is a fun hour and a half.  Definitely worth watching!",
            "review_date": "2009-09-09",
            "source": "rt"
        },
        {
            "content": "Wonderful, under the radar classic and one of the best black-and-white comedies out there. It's only 1.5 hours long but all those 90 minutes are worth watching and it's not just because of Veronica Lake, who I thought was very pretty. The story is original and it is about the lead actor who is a director and he is set out to research the meaning of poverty and suffering for his new movie, so he dressed like a hobo and started off with 10 cents and the movie starts off from there.",
            "review_date": "2009-09-09",
            "source": "rt"
        },
        {
            "content": "good & funny... what an adventure... Joel McCrea was fantastic...",
            "review_date": "2009-09-04",
            "source": "rt"
        },
        {
            "content": "good & funny... what an adventure... Joel McCrea was fantastic...",
            "review_date": "2009-09-04",
            "source": "rt"
        },
        {
            "content": "Terrifically funny and moving. And Veronica Lake is stunning.",
            "review_date": "2009-08-23",
            "source": "rt"
        },
        {
            "content": "all the wit in one place at once",
            "review_date": "2009-08-11",
            "source": "rt"
        },
        {
            "content": "It was solid. not outstanding to me, but solid nonetheless",
            "review_date": "2009-08-09",
            "source": "rt"
        },
        {
            "content": "veronica lake, what dish and can she dish it out with the best of them. did i mention veronica lake?",
            "review_date": "2009-07-29",
            "source": "rt"
        },
        {
            "content": "It is with a sharp satirical edge and self-referential humour that writer/director Preston Sturges charts the misadventures of a film director who takes a penniless expedition in search for inspiration. With just the right doses of slapstick comedy, crackerjack dialogue, and pointed one-liners (\"If people in Pittsburgh knew what they liked they wouldn't live in Pittsburgh\"), \"Sullivanâs Travels\" is a movie about human suffering made fun. Joel McCrea is great as the titular director, and Veronica Lake's flirty acting style fits the material nicely. The plot takes an interesting turn about halfway through which makes things quite a bit less funny, but makes the transformation of McCrea's character more complete, and ties together the point of the story: \"There's something to be said for making people laugh. It's all some people have. It's not much, but it counts for something in this cockeyed caravan.\"",
            "review_date": "2009-07-04",
            "source": "rt"
        },
        {
            "content": "It's a classic and one I recommend to all my young trainhopping friends. Interesting trivia: Preston Sturges' mother was one of Aleister Crowley's lovers, and for a few years, he was raised by the two of them. Doesn't surprise me that both had terrible things to say about each other!",
            "review_date": "2009-07-04",
            "source": "rt"
        },
        {
            "content": "Veronica Lake is gorgeous in this powerful film on the escapist quality of films.  See this movie to see why we need movies like Transformers 2 or the Hangover.",
            "review_date": "2009-06-30",
            "source": "rt"
        },
        {
            "content": "Wisecracking yet profound. (Veronica Lake...hubba hubba)",
            "review_date": "2009-06-29",
            "source": "rt"
        },
        {
            "content": "From screwball slapstick comedy to stark social commentary, this really isn't just one film, but a blending of several, all done quite well. Veronica Lake is particularly charming and Joel McCrea is enjoyable in the lead roles with lots of hilarious jokes and memorable cinematic moments. A very influential film",
            "review_date": "2009-06-17",
            "source": "rt"
        },
        {
            "content": "Now on my list of favorite movies.  It's a perfect combination of two genres that shouldn't really work together, wacky screwball comedy and social issue movie, into a third genre, the movie about moviemaking, and it's perfect at all three. It is also indeed a smidgen retroactively funnier because of the title of the serious movie Sullivan wants to make.  I wonder if Joel McCrea was this good in any other movies.",
            "review_date": "2009-06-16",
            "source": "rt"
        },
        {
            "content": "Almost perfect. I don't think it quiiiiiiiiiiiiiiiiiite hits the mark it was aiming for but it was and is a dazzling near miss.",
            "review_date": "2009-06-14",
            "source": "rt"
        },
        {
            "content": "I would watch this over and over and over again.",
            "review_date": "2009-06-13",
            "source": "rt"
        },
        {
            "content": "Acteurs et dialogues excellents, morale douteuse, du moins bizarre.",
            "review_date": "2009-06-11",
            "source": "rt"
        },
        {
            "content": "Really you think anyone would beleive Veronica Lake to be a hobo, one look at her throughout the movie and anyone would smell a rat, an awful clean rat. While this has all the good Sturges trimmings it tries to be too much liek a Capra movie that it is more of a parody than its own thing.",
            "review_date": "2009-06-09",
            "source": "rt"
        },
        {
            "content": "Sullivan's Travels is a little dated in terms of its humor, but for the most part, it's still a wonderful satire on Hollywood, comedies in general, and the relationship between the rich and poor. Joel McCrea plays John Sullivan, a famous Hollywood director notorious for making throwaway comedies. When he decides to make a serious and meaningful drama about the poor, titled \"O Brother Where Art Thou?\" the studio heads accuse Sullivan of knowing nothing about the poor, and they think that no audience member would want to see a movie so serious. So Sullivan makes a plan to live as a hobo until he is able to feel the poor man's plight. His life as a hobo is quite funny because every time he runs into a tough situation, he returns to his normal life full of wealth and power to fix it. Along the way, he meets an aspiring actress played beautifully by Veronica Lake. They quickly hit it off and slowly start to fall in love. Oh, but Sullivan is already married to another woman. He married her because it would save him tens of thousands of dollars on his taxes. What's a guy to do? The whole storyline of this is played to great comedic effect. Lake and McCrea sizzle on-screen together, and Sullivan's butlers provide a lot of comedic relief. It kind of reminded me of a French farce where the butlers know all! It was also cool to see that the Coen Brothers referenced this movie in their films. There's a scene where a picture of the \"man of the house\" keeps changing expressions, similar to the Coens' \"The Ladykillers\" and the title of \"O Brother Where Art Thou?\" is used in their 2000 film starring George Clooney. The movie also changes tone to great effect towards the end where Sullivan is actually forced to work as a poor man. We definitely see his change in attitude when he no longer has his \"rich man safety net\". It's a great contrast to the rest of the film, and definitely helps hit the satirical elements home.\r\n\r\nWhile this movie plays up its cheesiness a bit in a satirical way, there are some instances where I felt it was just cheesy 40s comedy without the satirical overtones. There's an instance where all of the characters in the scene throw each other into the pool (its a little much), and some of Sullivan's lines just come across as pure cheese. It's kind of a forgivable flaw considering this was made 68 years ago, back when comedy was a lot different, but it was just kind of a shame to see that not all of the scenes aged as well as others.\r\n\r\nOther than that, this is a wonderful satire that you should definitely check out. I haven't seen Veronica Lake in any other movie so far, but this is supposed to be one of her best roles, and she is just so sexy in this film. Her line delivery is full of sarcasm, and it's just a fun character for her to play. See this film!",
            "review_date": "2009-06-05",
            "source": "rt"
        },
        {
            "content": "Very enjoyable light hearted movie. With a quality message about the power of laughter. The last 30 minutes seemed quite rushed though and took something away from the movie as a whole.",
            "review_date": "2009-06-05",
            "source": "rt"
        },
        {
            "content": "A quality comedy about film in general.",
            "review_date": "2009-05-24",
            "source": "rt"
        },
        {
            "content": "The story is fine.  But just let go and enter a different time.",
            "review_date": "2009-05-18",
            "source": "rt"
        },
        {
            "content": "Terrific Sturges comedy......Veronica Lake is adorable in this.  Strongly recommended.",
            "review_date": "2009-05-11",
            "source": "rt"
        },
        {
            "content": "If you can get past the overt sentimentality of its message, this is first-class entertainment. Sullivan's character arc is splendid and completely unpredictable. Lana Turner is to die for and the comedy is perfectly balanced with the drama. Sturges' masterpiece sums up his world view almost to a fault. It's also been referenced in other films a dozen times since.",
            "review_date": "2009-04-05",
            "source": "rt"
        },
        {
            "content": "Sullivan's Travels is a remarkable film that completely opened my eyes to 'older' movies. Prior to seeing Sullivan's Travels, I hesitated to see most movies made prior to the mid 60's as I feel the acting in many of them to be wooden and the characters hard to relate to. Sullivan's Travels (and the films of Preston Sturges in general) have changed this for me (and Sullivan's Travels is my favorite Sturges film I've seen so far). This is an all out hilarious, touching and even stylish film that's all the better with the criterion supplements that point out all the subtle ways in which Sturges was pushing the envelope that one might not notice if they weren't alive in the 1940's. This is a truly superb film that excels on every level. But you could also just see it for Veronica Lake.",
            "review_date": "2009-03-26",
            "source": "rt"
        },
        {
            "content": "Grande Screwball Comedy! Uma obra-prima da velha Hollywood. Um dos meus favoritos da década de 40. Tem de tudo aqui: Veronica Lake perfeita, ação, preocupações sociais, comédia pastelão, e até musical. Aquele diálogo rápido pra caralho e sem cortes nos 5 minutos iniciais é incrível, acho que é o diálogo mais rápido que já vi.\n\nE é obviamente um dos filmes que mais influenciam os irmãos coen. Isso fica bem visível em Barton Fink, e claro, no próprio \"O Brother, Where Art Thou?\" em que eles tiraram o título do filme daqui de Sullivan's Travels.",
            "review_date": "2009-03-20",
            "source": "rt"
        },
        {
            "content": "It is hard not to laugh. Sturges satrie of scociety and wealth and 60 years and more later,  there are young directors still making films with the same message.",
            "review_date": "2009-03-18",
            "source": "rt"
        },
        {
            "content": "Not only one of old Hollywood's great entertainments, but one of the best movies about entertainment itself.",
            "review_date": "2009-03-13",
            "source": "rt"
        },
        {
            "content": "Films were never so good as this charming film about a Hollywood director who disguises himself as a hobo to experience real hardships in preparation for a serious dramatic film. What an awesome film that every person should see!",
            "review_date": "2009-03-11",
            "source": "rt"
        },
        {
            "content": "Screwball comedy classic from writer-director Preston Sturges is as smart, lively, and original as ever. Fast-paced with great characters and snappy dialogue, and some surprisingly effective dark visuals and an authentic atmosphere of Depression Era America - as well as a number of classic comedy moments. Clearly an influence - on several levels - on the films of the Coen Brothers.",
            "review_date": "2009-03-06",
            "source": "rt"
        },
        {
            "content": "This is truly not only one of the best comedies I have ever seen, but, for me, one of the greatest movies I have seen.  A fantastic cast together with an amazing script and wonderful direction makes a movie that keeps you intensely watching for its entirety.  The second part is a jarring dose of reality, but the comedy does continue...eventually.  As well as the superb leads, I loved the butler [Robert Greig]; and the chasing-Sullivan-in-a-RV scene is one of the most hilarious and wonderfully filmed scenes ever.  A great movie that as well as being hilarious makes an interesting point about the movie business and human nature as well.",
            "review_date": "2009-03-05",
            "source": "rt"
        },
        {
            "content": "Preston Sturges has such a unique ability at creating a comedic witty film that has strong dramatic tones.  Its just so entertaining and the dialogue is great.  Just another exceptional film by Preston Sturges.",
            "review_date": "2009-03-04",
            "source": "rt"
        },
        {
            "content": "a film that is all over the place, but hits the right notes in all the songs.",
            "review_date": "2009-02-26",
            "source": "rt"
        },
        {
            "content": "The fast-paced, witty dialogue in this was incredibly funny, and something I wasn't expecting from a film as old as this (which goes to show how much I know about film). And I loved the premise, the director leaving it all behind to suffer as a tramp in order to justify his making a film about the societal woes of the day, only to be sucked back into Hollywood anyway, not to mention his conclusion after his long and peculiar journey, which is all the more meaningful considering that \"Sullivan's Travels\" is in fact a comedy itself, and still moving. Great movie.",
            "review_date": "2009-02-25",
            "source": "rt"
        },
        {
            "content": "Anyone interested in movies needs to see this.  It comments on all movies that preceded it, and many later directors were influenced by it (Woody Allen and the Coen brothers come instantly to mind).  And it's hilarious.  And it's got Veronica Lake in it.  What more do you want?",
            "review_date": "2009-02-21",
            "source": "rt"
        },
        {
            "content": "a MUST own kinda movie. watch it at least once or twice a year. grand film, joel mcrae is a hottie",
            "review_date": "2009-02-20",
            "source": "rt"
        },
        {
            "content": "I canât think of too many films that are as willing to lampoon how disconnected from real life Hollywood truly is.  The premise of the story, about a Hollywood filmmaker who decides to live among the impoverished in order to make a powerful drama about their plight, is a really different kind of idea from many of the films at the time, and this film is also one of the best examinations of the film industry as well, and it even goes so far as to reference actual films and filmmakers, adding to its grounded setting among many of the screwball antics.  And the filmâs overall message of how comedy and laughter enables the down-trodden to have a brief reprieve from their troubles and fears, is a beautiful one.",
            "review_date": "2009-02-13",
            "source": "rt"
        },
        {
            "content": "this is a film that starts off as a pretty good idea, with nice rhythm and good performances... but gets more and more serious as the plot thickens, jumping smoothly from twist to twist until wisecracking humour and cinematic grandeur come together with incredible results. this is a must see for every movie fan!",
            "review_date": "2009-02-11",
            "source": "rt"
        },
        {
            "content": "Woah.\nEasily, instantly one of my favorite films ever.\nFunny and quick and so, SO goddamn smart.  Untouchable.  \nWant to see one of the best films ever made, hyperbole aside?\nSee this now.",
            "review_date": "2009-02-01",
            "source": "rt"
        },
        {
            "content": "So that's how O Brother Where art Thou got made. super Lake\nall people got now",
            "review_date": "2009-01-26",
            "source": "rt"
        },
        {
            "content": "Sturges' comic masterpiece deconstructs Hollywood to demonstrate the importance and \"importance\" of comedy. Dialog is quick and clever, acting is near flawless due to excellent direction, and Sturges' stock company of character actors are always fun to watch. Criterion's release shows why they used to call it the silver screen.",
            "review_date": "2009-01-23",
            "source": "rt"
        },
        {
            "content": "This is the first Preston Sturges film I ever saw and it is, without much doubt, one of his finest. Sullivan's Travel's is a briiliantly scripted, directed and performed movie satirising the movie buisness. What makes it more special is that Sturges was one of the first truly auteur Hollywood directors working within the constraints of the studio system and the production code. It is a shame that Veronica Lake's career never really reached the heights that it should have done as she's fantastic as the sultry blonde. Funny and heartwarming, this is one of the best films ever made.",
            "review_date": "2009-01-12",
            "source": "rt"
        },
        {
            "content": "Just watched this on DVD and wish I had done so years ago. Wonderful.",
            "review_date": "2009-01-02",
            "source": "rt"
        },
        {
            "content": "an eclectic mix of screwball comedy and dialogical profundity that varies in its effectiveness. there are big holes in the plot and some very dated and/or cliche scenes, many of them self-referential (this is one of the first overtly self-referential hollywood movies), but on the whole the film's message is timeless and applies today.",
            "review_date": "2008-12-30",
            "source": "rt"
        },
        {
            "content": "A masterpiece of the genre, by the great Preston Sturgess. It starts as another screwball comedy and then it has a deep change where we get to see the best and the worst of the human kind. Many layers of depth in this work of a genious director, who was one of the first to write and direct his own work. Veronica Lake shines, Joel McCrea also plays the character well, especially in the second act. A movie critic once said he doesn't know how was possible that Preston Sturgess convinced the executives of the time to finance this film, for its acid critic of society and movies of the time. I agree, it is a movie wasy ahead of its time that deserves appreciation and recognition.",
            "review_date": "2008-12-26",
            "source": "rt"
        },
        {
            "content": "This Hollywood classic was very well done.  I'd have given 5 stars but with it being in black and white, I had a hard time paying attention.  It's a very entertaining film though and highly recommended.",
            "review_date": "2008-12-19",
            "source": "rt"
        },
        {
            "content": "This, \"The Player\" (1992) and now \"Tropic Thunder\" (2008) - will Hollywood ever change?",
            "review_date": "2008-12-17",
            "source": "rt"
        },
        {
            "content": "As one of American cinema's earliest auteurs and cutting a distinctly modern figure (his mother's best friend was Isadora Duncan; he spent his youth criss-crossing the Atlantic; a \"kiss-proof\" lipstick and ticker-tape machine were among his patented inventions), Preston Sturges was responsible for an explosion of now-classic films in the 1940's. These films are known for their sophisticated verbal wit, uproarious physical comedy, and their affectionate portrayal of eccentric, scene-stealing supporting characters. But Sturges's work is also consistent in its exploration of the possibilities and prospects of upward - and occasionally downward - mobility. In what may be his finest, most complex film, Sullivan's Travels(1942), Sturges brilliantly mixes broad humor with sharp-edged cultural commentary, once again - as in The Great McGinty(1940), Christmas in July(1940), and The Lady Eve(1941) - revealing social identity to be a highly unstable proposition, capable of hyperbolic transformation through such prosaic means as disguise, confusion, and self-deception.\r\nJohn L. Sullivan (Joel McCrea) is a can't-miss Hollywood director who specializes in lightweight entertainment, exemplified by broad comedies such as the 1939 film Ants in Your Pants. Naive and sheltered by a solicitous staff who have no interest in seeing their meal ticket change genres or become overly ambitious in his cinematic pursuits, Sully nonetheless sets his sights on directing an epic social commentary picture about tough times in depression-era America, to be entitled O Brother, Where Art Thou? (a fictional title eventually used by the Coen Brothers for their own 2000 film, in a clever tribute to Sturges). To research his topic, which involves such unpleasantries as suffering, deprivation, and racial inequality Sully insists on disguising himself as a hobo and making his way across the country to experience \"real life\" firsthand.\r\nOnce on the road, assorted adventures, meetings (notably with Veronica Lake's down-on-her-luck ingenue), and mishaps - some hilarious, others surprisingly poignant - transpire before Sully eventually comes to terms with his true calling as a lowbrow moviemaker with a gift for making people laugh. The lesson here is that strained seriousness and forced profundity have far less benefit for the masses than good old-fashioned humor, with its power to help people forget their troubles, if only for a while.\r\nThat Sullivan's Travels possesses an autobiographical dimension is impossible to deny, with Sturges affirming the value of what he himself did best - making smart comedies with the power to lift viewers' spirits - while ripping the pretentiousness of Hollywood's more sober and \"socially committed\" filmmakers. Personal statements aside, however, the tour de force script brings together a remarkable range of genres, including slapstick, action, melodrama, social documentary, romance, musical, and prison movie. Though it failed to garner a single Oscar nomination, Sullivan's Travels is the most remarkable film in the career of one America's greatest filmmakers.",
            "review_date": "2008-12-13",
            "source": "rt"
        },
        {
            "content": "Best great depression movie. Funny and informative. The best mix...",
            "review_date": "2008-12-08",
            "source": "rt"
        },
        {
            "content": "Solid classic social commentary movie",
            "review_date": "2008-11-20",
            "source": "rt"
        },
        {
            "content": "sturges was billy wilder's american counterpart.  though both men gave you the happy ending you needed to go on, they gave you some dark and sometimes troubling thoughts to ruminate over regarding our wonderful country and society.  this film starts off easily enough with the plight of a studio director who wants to experience life on the road so he can make a film about it goes through some eye-opening experiences when he is temporarily lost a limbo of freighter cars and work camps.",
            "review_date": "2008-11-07",
            "source": "rt"
        },
        {
            "content": "This was quite entertaining, and a bit more substantial than I expected.  It was occasionally heavy-handed, but not to nearly the extent I feared.  And the goofy physical comedy was a lot of fun.",
            "review_date": "2008-11-07",
            "source": "rt"
        },
        {
            "content": "A new favourite of mine, I've watched it twice in the past few weeks, and imagine my appreciation of this film will only continue to grow to with time!  Probably the greatest movie nobody has ever heard of.",
            "review_date": "2008-11-04",
            "source": "rt"
        },
        {
            "content": "\"And I'll tell you something else. There's a lot to be said for making people laugh. Did you know that's all some people have? It isn't much, but it's better than nothing in this cockeyed caravan. Boy!\" \n\nSometimes you don't realize how wonderful and blessed you truly are until it's all taken away. This film is a moral tragicomedy, and who better to have shone this simple truth than Preston Sturges? This is beautiful little film.",
            "review_date": "2008-11-01",
            "source": "rt"
        },
        {
            "content": "Great satire, Veronica Lake is beautiful.",
            "review_date": "2008-10-27",
            "source": "rt"
        },
        {
            "content": "Not the funniest Preston Sturges, but pretty darn good. It's no Hail, The Conquering Hero. Veronica Lake is very beautiful in it.",
            "review_date": "2008-10-18",
            "source": "rt"
        },
        {
            "content": "An interesting concoction, the film begins as a witty satire on the questionable authenticity of Hollywood productions with rapid-fire wordplay and colourful supporting characters. But in its second act, abruptly changes pace, becoming more of a wrenching drama as the protagonist is submitted to misfortune after misfortune, which, giving his earlier self-righteous quest to \"find real trouble\", feel strangely fitting though hard to watch. Finally, the film's ending abruptly flips to an ending celebrating the importance of film comedy, which feels simultaneously heartwarming and a smarmy joke at once. It is difficult for the most part to decipher exactly what Sturges' motivation for approaching his subject matter from such unconventional angles is, but the power of his work cannot be argued, and the flipping from comedy to drama feels far more functional than imbalanced, strangely enough. An oddity worth seeing, but better to approach not expecting it to be a comedy.",
            "review_date": "2008-10-16",
            "source": "rt"
        },
        {
            "content": "The humor, plot twists, and message still hold up. Great film.",
            "review_date": "2008-10-15",
            "source": "rt"
        },
        {
            "content": "Sturges justifies the comedy movie, neatly tying together slapstick and melodrama.",
            "review_date": "2008-10-15",
            "source": "rt"
        },
        {
            "content": "I didn't really like the way the plot unfolded in the third act, but the rest of the movie is very good.  Veronica Lake in particular shines in any scene she is in -- the scene where she buys Sullivan ham and eggs and the scene by the pool in particular stand out.  I felt that there was a little too much shouting in the first 10 minutes or so but it settles down into a really strong picture.",
            "review_date": "2008-10-04",
            "source": "rt"
        },
        {
            "content": "An excellent double feature with another, much darker, Preston Sturges masterpiece examining the role of the artist: Unfaithfully Yours.",
            "review_date": "2008-09-29",
            "source": "rt"
        },
        {
            "content": "Watching this is an experience, whatever the concept, the story or even the morals lying behind, there was a remarkable director though making memorable scenes with perfect faces and cuts.",
            "review_date": "2008-09-29",
            "source": "rt"
        },
        {
            "content": "La mejor pelicula del genial Preston Sturges que sirve como metafora del cine y como metafora de la vida.  Esta cinta es permanentemente homenajeada a traves de toda la carrera de los hermanos Coen.",
            "review_date": "2008-09-23",
            "source": "rt"
        },
        {
            "content": "It was an odd mix of screwball comedy and The Grapes of Wrath.",
            "review_date": "2008-09-22",
            "source": "rt"
        },
        {
            "content": "A brilliant film on so many levels--as a genius comedy with instantly quotable quips, a Hollywood satire, and a layered social document that is probably universally relevant. It's amazing to think that this film, 'Kane', and 'Casablanca' came out in the same year. I loved this movie so, so much. There's so much going on at every moment. It's pure genius.",
            "review_date": "2008-09-17",
            "source": "rt"
        },
        {
            "content": "it's like a love letter to slapstick, and it's hilarious.",
            "review_date": "2008-09-09",
            "source": "rt"
        },
        {
            "content": "turns out it's pretty good",
            "review_date": "2008-09-08",
            "source": "rt"
        },
        {
            "content": "Brilliant, totally enjoyable, hate, hate, hate that mean guy who locked Sullivan in the sweat tank or whatever it was called, he was such an arse, love McCrea & Lake in this.",
            "review_date": "2008-09-07",
            "source": "rt"
        },
        {
            "content": "Very compelling film.",
            "review_date": "2008-08-29",
            "source": "rt"
        },
        {
            "content": "A must watch *before* you watch Oh Brother where Art Thou.",
            "review_date": "2008-08-29",
            "source": "rt"
        },
        {
            "content": "Highly enjoyable film by Preston Sturges. There's witty dialogue and a great performance from McCrea, not so great a performance from Lake, but she still steals every scene with that beauty of hers.",
            "review_date": "2008-08-29",
            "source": "rt"
        },
        {
            "content": "still trying to work out the relationship between the film and the film-within-the-film.  With a little sex. Fabulous.",
            "review_date": "2008-08-28",
            "source": "rt"
        },
        {
            "content": "I really wanted to like this movie.  But unfortunately its just not funny.  All of the comedy in the first half of the film are rehashes of Charlie Chaplin bits, which just made me wish I was watching a CC movie. \n\nThe second half almost redeems the disappointing first half, but not because it becomes funny. Ironically enough, the plot narrative that leads to the endorsement of comedies is the only part of the film that works. \n\nSo when Sullivan's Travels tries to be a comedy, it fails; but when it tries to be a drama that honors comedies, it succeeds.\n\nOne more item: Veronica Lake is wonderful here. She deserves special mention for helping me endure to the second half when the film finally finds its legs.",
            "review_date": "2008-08-26",
            "source": "rt"
        },
        {
            "content": "Preston Sturges is an unsung comedy king, and this is his greatest, about a famous director of comedies aching to make a legit drama, from a director of comedies who was aching to make a drama. Get it? No matter, it's a damn good time.",
            "review_date": "2008-08-14",
            "source": "rt"
        },
        {
            "content": "Another one of those great films about the making of films. It is aware of itself but not too much, just enough to make its point: Films can be made to talk about social issues, but a lot of times it just needs to make people laugh. I loved it as soon as the dialogue started and even more so when the great Veronica Lake appeared onscreen. Watch and enjoy this gem of a film.",
            "review_date": "2008-08-08",
            "source": "rt"
        },
        {
            "content": "Finally got around to seeing this one. Definitely one of the best of the era - so cynical and frank in its messages, very much in the same vein as Sunset Boulevard/Singin' in the Rain/Ace in the Hole (I guess one should say the latter are much in the same vein as this because of that horrible thing called chronology...but whatever). Regardless, great film that blends comedy with social commentary... dey don't make 'em like dey useta, dey shore don'....",
            "review_date": "2008-08-08",
            "source": "rt"
        },
        {
            "content": "I finally understand the title for the Coen brothers' movie \"O' Brother Where Art Thou?\".",
            "review_date": "2008-08-07",
            "source": "rt"
        },
        {
            "content": "Una pelÃ­cula estupenda para ver la vida con un poco mÃ¡s de felicidad. Veronica Lake, impecable.",
            "review_date": "2008-08-02",
            "source": "rt"
        },
        {
            "content": "Enjoyable and touching. On the fringe of must-see. This movie isn't very complicated, but in such utterly compelling fashion evaluates the role of cinema in society. (But don't worry, its very artfully worked into the story). Sometimes simple is better.",
            "review_date": "2008-08-02",
            "source": "rt"
        },
        {
            "content": "A great film about making a film is first class entertainment.",
            "review_date": "2008-08-02",
            "source": "rt"
        },
        {
            "content": "This movie is rated high in the AFA's greatest films of all time and I now know why. It explored one of the biggest social issues of its day with both depth and comedy, all without making light of it. I loved it and would recommend it to anyone!",
            "review_date": "2008-08-01",
            "source": "rt"
        },
        {
            "content": "One of the best American films of the 40's, Preston Sturges masterpiece imo.",
            "review_date": "2008-07-31",
            "source": "rt"
        },
        {
            "content": "yikes, this movie was good, i sort of knew it would be considering that criterion had released a version of it, but still, it was pretty good.",
            "review_date": "2008-07-30",
            "source": "rt"
        },
        {
            "content": "Decent enough, but a little overrated as far as the script goes. Veronica Lake is quite nice to watch...it's a shame she so ofen was jipped on good sreenplays, resulting in her all too short lived film career.",
            "review_date": "2008-07-29",
            "source": "rt"
        },
        {
            "content": "For the most part Sullivanâs Travels performs like an average mediocre comedy. Though it does have some memorable lines at the beginning, and a good enough premise carry a film, and Veronica Lake,  for the most part this movie really just seems to phoning it in. It isnât until the last 15 minutes it reaches something bigger then itself.",
            "review_date": "2008-07-28",
            "source": "rt"
        },
        {
            "content": "The first and final acts are beautifully done, but the rest was just too self-consciously witty.",
            "review_date": "2008-07-22",
            "source": "rt"
        },
        {
            "content": "This really surprised me. Just when it seems like everything is settled, a 4th act is conjured up and turns a decent comedy into something really unique.",
            "review_date": "2008-07-14",
            "source": "rt"
        },
        {
            "content": "Very revealing and somewhat bold movie about poverty (and Hollywood)",
            "review_date": "2008-07-13",
            "source": "rt"
        },
        {
            "content": "Satirical Preston Sturges gem with real time consequences. Great rom-com too. Love it and Joel McCrea and Veronica Lake (see her in I Married A Witch too).",
            "review_date": "2008-07-08",
            "source": "rt"
        },
        {
            "content": "One of the best romantic comedies ever.  Veronica Lake is adorable and Joel McCrea believeably earnest as a director of comedies who wants to make a great art film.  (Which he would call \"Oh Brother Where Art Thou?\").  Classic Preston Sturges.",
            "review_date": "2008-07-07",
            "source": "rt"
        },
        {
            "content": "nothing short of brilliant. tack-sharp comedy, rich satire, thought-provoking social commentary, effortless drama, intriguing plot twists, all carried out beautifully by the dry-witted McCrea, the adorably beautiful Lake, and the host of supporting cast.  a truly rock-solid film.",
            "review_date": "2008-07-01",
            "source": "rt"
        },
        {
            "content": "nothing short of brilliant. tack-sharp comedy, rich satire, thought-provoking social commentary, effortless drama, intriguing plot twists, all carried out beautifully by the dry-witted McCrea, the adorably beautiful Lake, and the host of supporting cast.  a truly rock-solid film.",
            "review_date": "2008-07-01",
            "source": "rt"
        },
        {
            "content": "The perfect picture business comedy. \"There's a lot to be said for making people laugh. Did you know that that's all some people have? It isn't much, but it's better than nothing in this cockeyed caravan.\" Genius.",
            "review_date": "2008-06-27",
            "source": "rt"
        },
        {
            "content": "And then he fell through a hole and sneezed at a horse!",
            "review_date": "2008-06-19",
            "source": "rt"
        },
        {
            "content": "I could barely sit through this. I wasn't interested in any of the characters or the plot. There were moments in the script that were really great but it was too boring to call it all great. It had some decent directing but overall I really didn't not like this.",
            "review_date": "2008-06-18",
            "source": "rt"
        },
        {
            "content": "Amazing. Challenging. YOU must watch this.",
            "review_date": "2008-06-16",
            "source": "rt"
        },
        {
            "content": "It always reminds me of how important comedy, and maybe, all entertainment is in life. A truly touching classic!",
            "review_date": "2008-06-16",
            "source": "rt"
        },
        {
            "content": "Scratch anything I've said before, Veronica Lake is THE poster girl for adorability. Preston Sturges sure knows how to pick his leading ladies. Very, very good satire with a solid message and well-timed transitions. I love films that show versatility.",
            "review_date": "2008-06-14",
            "source": "rt"
        },
        {
            "content": "Interesting at times funny movie about Hollywood's lack of authenticity...promotes a kind of hokey comedy as some sort of social salve",
            "review_date": "2008-06-11",
            "source": "rt"
        },
        {
            "content": "Pretty close to perfect.",
            "review_date": "2008-06-09",
            "source": "rt"
        },
        {
            "content": "Brilliant and funny in its own right, it's also a smart consideration of art and artists and audiences.",
            "review_date": "2008-06-05",
            "source": "rt"
        },
        {
            "content": "Makes me cray. Makes me fall in love. Makes me so proud to be a comedian. One of the greatest films of all time.",
            "review_date": "2008-06-04",
            "source": "rt"
        },
        {
            "content": "I watched this recently not knowing what to expect, and thoroughly enjoyed, although I;m not quite sure it's as good as some believe it is. A near great film about making movies, this is a great watch if your are feeling a bit down and need a good laugh.",
            "review_date": "2008-06-03",
            "source": "rt"
        },
        {
            "content": "Manages to be both moving and funny. One of a kind movie from the one of a kind Preston Sturgess.  Superb all the way around.",
            "review_date": "2008-05-31",
            "source": "rt"
        },
        {
            "content": "Extremely funny with some social commentary. Great.",
            "review_date": "2008-05-20",
            "source": "rt"
        },
        {
            "content": "Well, drown my kittens; this is quite a film.",
            "review_date": "2008-05-04",
            "source": "rt"
        },
        {
            "content": "The staggeringly simplistic moralizing at the end almost ruins the perfect mix of both zaniness and sophisticated wordplay that precedes it. I loved that I had no idea where this movie was going even by the beginning of the third act.",
            "review_date": "2008-04-30",
            "source": "rt"
        },
        {
            "content": "Greatest movie about a movie ever?  Maybe.",
            "review_date": "2008-04-29",
            "source": "rt"
        },
        {
            "content": "I've seriously neglected older films in my RT journal so I'm trying to watch (or in many cases rewatch) a bunch of classics in a feeble attempt at a well-rounded journal!  Somehow I never managed to see a Preston Sturges film....until now.  \n \n[b]Sullivan's Travels (1941) - 8.3/10[/b]\nDirector - Preston Sturges\nStarring - Joel McCrea, Veronica Lake, William Demarest, Robert Warwick, Eric Blore, Robert Greig, Porter Hall.\n \n[i]Sullivan's Travels[/i], set in the Depression era, stars Joel McCrea as Hollywood director John L. Sullivan.  Sullivan has made his mark in Hollywood directing profitable, yet lightweight comedies.  Fed up with an \"out-of-touch\" Hollywood, Sullivan decides he wants to make a socially conscience film entitled \"O Brother, Where Art Thou\" about poverty and human suffering.  His producers balk at this idea, but that only fuels Sullivan's desires more.  Since Sullivan has never experienced the human suffering he wishes to write about he decides to pose as a hobo and live among the \"real\" people of America.  His studio, realizing they can't talk him out of it decides to turn his journey into a publicity stunt, following him around everywhere he goes.  Sullivan tries to shake them and ends up at a cafe where he meets a struggling actress (Veronica Lake) who thinks he is a bum, not a Hollywood director.  She buys him lunch and decides to join him on his journey soon discovering his real identity.  The pair experiences life among the poor and then it's time to return to Hollywood.  Sullivan decides to make one last visit, this time to pass out hundreds of $5 dollar bills to the tramps he encountered.  Unfortunately he is mugged and left unconscious in a railyard.  The thief also steals Sullivan's identity and is run over by a train leading everyone to believe he is dead.  Meanwhile Sullivan, unable to prove his identity, is arrested for assault and sentenced to a chain gang.\n \nMy first experience with Sturges was definitely positive.  [i]Sullivan's Travels [/i]is easily one of the best comedies of it's era.  Sturges liberally uses elements of screwball, slapstick and drama, but at it's core it's a biting satire.  Nobody is immune, but his ultimate target isn't the tramps and hobos, it's Hollywood's elite and Sullivan himself.  What really elevates this above other comedies of it's era is the writing.  The dialogue is clever, witty and often quite insightful.  The early scene where Sullivan tries to convince his producers to fund \"Oh Brother, Where Art Thou\" is a classic example of Sturges' fine writing.   Just when you think it's headed for typical screwball territory, Sturges changes gears.  He pauses just long enough to show real human suffering, for example the scene where McCrea and Lake are stepping over bodies searching for a place to sleep, which adds a needed dramatic element to a film that mocks almost everything.  The result is a hilarious comedy with a social conscience and one of the finest satires of Hollywood ever made.  It's influence is apparent from the Coen Brothers to Robert Altman's \"The Player\".  A must see.",
            "review_date": "2008-04-27",
            "source": "rt"
        },
        {
            "content": "The first hour consists of a poorly constructed inciting incident with mediocre banter and terrible slapstick comedy. The protagonist, who is not so well acted by Joel McCrea, is an absolute douchebag, and I didn't give a damn what happened to him. Surely that was the intention of the film, but Sturges can't expect to hold my attention that way. Veronica Lake was the only saving grace for the majority of the film. She's beautiful, charming, and loveable. The major flaw of the film is that the message Sturges is trying to communicate doesn't come into focus until the third act. The movie just lolls around in pretentious yuppie land until the beautifully cinematic ending. Things take a turn for the dark as the protagonist unwillingly reaches the dismal low point he'd been trying to discover all along. It's a powerful, dramatic climax that delivers the final thrust into poignancy. There are some rather incredible shots and great supporting characters. A decent film with a wonderful message.",
            "review_date": "2008-04-27",
            "source": "rt"
        },
        {
            "content": "Really great film. The running commentary on some of the absurdity of Hollywood is great.",
            "review_date": "2008-04-26",
            "source": "rt"
        },
        {
            "content": "Sturges' masterpiece.  Moves effortlessly from madcap comedy to near tragedy without missing a beat.",
            "review_date": "2008-04-20",
            "source": "rt"
        },
        {
            "content": "With the presence now of movies that are all about 'making a difference' about a problem, this really is a classic that should be seen more. It does a great job, I think, of looking at how for large scale problems, making a movie about it doesn't help most of the people going through those problems, but that comedy, light and unserious as it is, still has the power to uplift people and at least give them a break from what they have to deal with. It also does a good job of mocking how people who've never faced any trouble are inept at trying to understand what trouble really is.",
            "review_date": "2008-04-08",
            "source": "rt"
        },
        {
            "content": "Not the best example of Sturges's genius witty dialogue, but probably his most meaningful film and one of the best reflections on Hollywood I've ever seen: There's always a girl in the picture.",
            "review_date": "2008-04-03",
            "source": "rt"
        },
        {
            "content": "Nothing you would usually see.  A good watch",
            "review_date": "2008-04-02",
            "source": "rt"
        },
        {
            "content": "Just a really good fun movie that still holds up.",
            "review_date": "2008-03-31",
            "source": "rt"
        },
        {
            "content": "There are a number of supposed \"classics\" that I cannot get into. This is not one of them. This is a truly great film.",
            "review_date": "2008-03-25",
            "source": "rt"
        },
        {
            "content": "Excellent film -- witty, smart, deep. Much more introspective than most movies of the '40s.",
            "review_date": "2008-03-24",
            "source": "rt"
        },
        {
            "content": "Funny, touching and Veronica Lake!  A Preston Sturges classic!",
            "review_date": "2008-03-22",
            "source": "rt"
        },
        {
            "content": "very interesting for its time...a film director looking for a challenge in his life and wanting to make the perfect film for the depression...very well done",
            "review_date": "2008-03-12",
            "source": "rt"
        },
        {
            "content": "I really liked this one. It rings so true with so many people I know.\nSullivan is a well know moving picture maker in LA and is wanting to make a movie- O' Brother Where Art Thou as a gritty realism picture of the pain of poor America.\nSo he convinces his studio to let him go undercover as a poor man as research. In the midst he is fed a meal by Veronica Lake whom he falls for (though he's in a marriage of convenience). He breaks his cover for her and they are off again trying to look poor.\nThey hit bump after bump and are always finding themselves back in posh LA (when the going gets rough).\nOn his last expedition a bum fight  leaves people thinking he's dead. When he gets in the tussle he has a head injury leading to short term amnesia and a fist-a-cuff with a rail manager. This gets him in working prison.\nThis is where he realizes the power of comedic movies for the poor, and no longer wants to make O' Brother Where Art Thou, but comedies.\n(Later, the studios grump because he has so much press for his exploits)\nHe finally declares he's the murderer of himself and gets off free. His wife is already re-married allowing him to get with Veronica Lake.\n\ngreat!",
            "review_date": "2008-03-08",
            "source": "rt"
        },
        {
            "content": "A comedy filled with puns, slapstick, irony and plain stupidity.  There's also a social commentary hidden in there somewhere, but you'd be too enticed in its story to notice.  Veronica Lake is beautiful, but why are women always so annoying in black and white films?",
            "review_date": "2008-03-06",
            "source": "rt"
        },
        {
            "content": "Well made & a little funny!",
            "review_date": "2008-02-29",
            "source": "rt"
        },
        {
            "content": "Like Wilder's \"Ace in the Hole\", Preston Sturges' career masterpiece mimics and reflects an important cultural issue so that it can be seen in all of its truth while still radiating enormous amounts of entertainment. A cast with lesser-known stars keeps things honest and modest, and a chilling finale in a church ties everything up perfectly. \"With a little sex.\"",
            "review_date": "2008-02-29",
            "source": "rt"
        },
        {
            "content": "That such a deep and powerful commentary could be made under the guise of light and playful dialogue is intriguing. Director Preston Sturges deftly includes several different themes, all the while mainting a singular tone. One of the best and most seriously played romantic, screwball comedies ever made.",
            "review_date": "2008-02-26",
            "source": "rt"
        },
        {
            "content": "[b][color=Navy][size=2][font=Comic Sans MS][img]http://www.filmreference.com/images/sjff_01_img0476.jpg[/img]\n\nCast:[color=Green] Joel McCrea, Veronica Lake[/color]\nDirector:[color=Green] Preston Sturges[/color]\nRunning time:[color=Green] 90 mins.[/color]\nLanguage:[color=Green] English\n\nSULLIVAN'S TRAVELS is a pretty fun movie. Made in 1941, it is very impressive for its time. I think it has a good mix of over the top action sequences that end in comedy as well as quick, witty humor. I really liked this film. It has made it to AFI's list of the best 100 American films of all time which is worth noting. I laughed a considerable amount for a movie made so long ago. It goes to show that the film definately withstands the test of time easily.\n\nThere is nothing spectacular along the lines of effects although some of the stunt work is pretty nice for a film made in the 40's. I think the performances by McCrea and Lake were key. They share such a touching chemistry that we can't hel but feel sorry for their misadventures. The writing was brilliant. The story of a director setting out on a trip to experience hardship in order to be able to make a good film that deals with hard times makes for a very funny scenario. In the end, SULLIVAN'S TRAVELS are definately something you don't want to miss out on! It is a lot of fun and I garauntee that you will laugh more than once throughout this comedy.\n[/color][/font][/size][/color][/b]",
            "review_date": "2008-02-26",
            "source": "rt"
        },
        {
            "content": "this movie makes me want to make out with veronica lake.",
            "review_date": "2008-02-26",
            "source": "rt"
        },
        {
            "content": "\"There's a lot to be said about making people laugh.\"",
            "review_date": "2008-02-26",
            "source": "rt"
        },
        {
            "content": "Veronica Lake takes a shower.",
            "review_date": "2008-02-25",
            "source": "rt"
        },
        {
            "content": "A soulful slap in the face to Hollywood and its brutish approach to any sensitive issue.  In this case, poverty.  A fine balance of powerful commentary, slapstick, and dialogue delivered with gunpowder flair.  Sturges pairs up Joel McRea and Vernonica Lake as Hollywood expatriates in search of something more.  For McRea's character, Sullivan, his journey takes him into a 'living hell' that is shocking when compared to the first half of the film's tone.  \nAlmost approaches a southern gothic horror tone in the church sequence - until Mickey Mouse appears.  A sweet and salty film, and one of Sturges' finest moments.",
            "review_date": "2008-02-21",
            "source": "rt"
        },
        {
            "content": "A couple of years ago, I discovered Preston Sturges movies and this gem from 1942.  What a great story and very funny.",
            "review_date": "2008-02-18",
            "source": "rt"
        },
        {
            "content": "Have YOU enjoyed a Preston Sturges gem lately? An underappreciated film that has a barrel of fun thinking through class in America (and Hollywood). Leave it to Sturges to ensure that the framing of the film is self-aware, textured, and just too damn smart.",
            "review_date": "2008-02-12",
            "source": "rt"
        },
        {
            "content": "Sturges, you've done it again.",
            "review_date": "2008-02-10",
            "source": "rt"
        },
        {
            "content": "Sturgus self-reflexive film about a director who wants to make a \"serious\" film.  While it has its funny moments it has a much darker tone than Sturges first few films.  And it has Veronika Lake!  Wowza!  See this movie as it is one of the most important American films ever made.",
            "review_date": "2008-02-07",
            "source": "rt"
        },
        {
            "content": "simplistic feel good, sturges justifying himself.",
            "review_date": "2008-02-07",
            "source": "rt"
        },
        {
            "content": "Really funny. Again I think it's written a lot like a play, but a really good one so who cares!",
            "review_date": "2008-02-06",
            "source": "rt"
        },
        {
            "content": "Excelente critica al sistema cinematografico",
            "review_date": "2008-02-06",
            "source": "rt"
        },
        {
            "content": "A completely perfect comedy that ends with such resonance by factoring in wholly unexpected tragedy.  Veronica Lake is unfathomably beautiful.  Sturges adds another one to the greatest of all American films.",
            "review_date": "2008-02-05",
            "source": "rt"
        },
        {
            "content": "Une drole de concoction. A la fois comique et dramatique, avec plusieures ruptures de ton. C'est aussi un film qui commente sur lui-meme. Les dialogues sont fabuleux,la direction photo est extraordinaire et Joel McCRea est tres bon. Un must.",
            "review_date": "2008-01-28",
            "source": "rt"
        },
        {
            "content": "Sympathique comedie (un peu naive) bourree de passages formidables, d'une Veronica Lake splendide et d'une histoire riche en rebondissements. Pas etonnant que les freres Coen se soient inspires de ce film pour titrer 'O Brother'.",
            "review_date": "2008-01-27",
            "source": "rt"
        },
        {
            "content": "Funny like The Thin Man though not as smarmy.  Laughter is all some people have got.",
            "review_date": "2008-01-27",
            "source": "rt"
        },
        {
            "content": "Mielenkiintoista ettÃ¤ Hollywoodissa on osattu kritisoida Hollywoodia jo nÃ¤inkin aikaisin. Hienoa ettÃ¤ nÃ¤in vanha kritiikki osuu vielÃ¤ nykymaailmaankin.",
            "review_date": "2008-01-27",
            "source": "rt"
        },
        {
            "content": "Preston Sturges writes and directs a Powerful-Comedy about the American underclass in a now-vanished America. Complex, charming, and witty, it's a tribute to Lubitsch  that manages to play at the level of Lubitsch -- and creates a portrait of rural blacks worthy of Faulkner's pen. This is genuinely intelligent (and authentically compassionate) American cinema that -- buoyed by the presence of Veronica Lake, a bona fide star -- makes almost everything else coming out of Hollywood in the last 25 years look like complete and utter trash.",
            "review_date": "2008-01-26",
            "source": "rt"
        },
        {
            "content": "O Brother, Where Art Thou?",
            "review_date": "2008-01-23",
            "source": "rt"
        },
        {
            "content": "The dated elements only add charm to this surprising and thoughtful comedy.  Thoroughly enjoyable.",
            "review_date": "2008-01-21",
            "source": "rt"
        },
        {
            "content": "Underrated screwball comedy is one of the screen's more 'significant' films. To some, it remains hugely influential to this day.",
            "review_date": "2008-01-21",
            "source": "rt"
        },
        {
            "content": "A great Hollywood film for people who get the message before the message even ends upon the screen. Veronica Lake is of course perfection as the almost-failed actress with more sense than anyone.",
            "review_date": "2008-01-20",
            "source": "rt"
        },
        {
            "content": "It has my philosophy...keep them laughing... to bear the dark side of life...",
            "review_date": "2008-01-19",
            "source": "rt"
        },
        {
            "content": "A treatise on laughter and the privilege to evoke it.",
            "review_date": "2008-01-19",
            "source": "rt"
        },
        {
            "content": "My favourite movie. A gem from Preston Sturges who I feel has not had the recognition he derserves. The message of this film is timeless. Joel McCrea and Veronica Lake are perfect.",
            "review_date": "2008-01-08",
            "source": "rt"
        },
        {
            "content": "Only one of the greatest screwball comedies ever made - and cuts deeper than most. McCrea and Lake make for an incredibly charming pair. It's a real treat.",
            "review_date": "2008-01-07",
            "source": "rt"
        },
        {
            "content": "One of my all-time favourites not least because it stars the gorgeous Veronica Lake and always underated Joel McCrea. Sturges can easily be compared to Capra for wry and often charming looks at the America.",
            "review_date": "2008-01-07",
            "source": "rt"
        },
        {
            "content": "While I appreciate the message on the value of humor, this film otherwise is pretty empty.  Sullivan continually tries to step into the shoes of an impoverished man until he accidentally gets it right.  It has a few rare moments of humor and some good commentary, but not much.  I harbor a lot of doubt as to whether the film's message still holds true today as we have essentially entertained ourselves to death.  Is this one of the 100 greatest American films?  Not by a long, long way.",
            "review_date": "2008-01-06",
            "source": "rt"
        },
        {
            "content": "Preston Sturges is genius.",
            "review_date": "2008-01-05",
            "source": "rt"
        },
        {
            "content": "The fake crazy laughter drives me insane, but it is quite the clever film....and probably really resonated when it was made.....now....not so much.",
            "review_date": "2008-01-04",
            "source": "rt"
        },
        {
            "content": "fast paced, clever, comic sass and a half",
            "review_date": "2008-01-04",
            "source": "rt"
        },
        {
            "content": "The genius of Preston Sturges makes a film that is both hilarious and better than anything Capra ever did.",
            "review_date": "2008-01-02",
            "source": "rt"
        },
        {
            "content": "Probably the finest of all Preston Sturges films with a wonderful lead performance by the often underrated Joel McCrea. This is his best work, which should have brought him an Oscar-nomination. Not just funny but deeply moving too.",
            "review_date": "2008-01-01",
            "source": "rt"
        },
        {
            "content": "The best movie about the value of humor and the experience of life that I've ever seen. Veronica Lake and Joel McCrea were wonderful in their depictions of two people trying to discover what it's like to be 'average'. A perfect mix of comedy and drama. Sturges delivers his message, but entertains from the beginning to the end.",
            "review_date": "2007-12-29",
            "source": "rt"
        },
        {
            "content": "John L. Sullivan: I want this picture to be a commentary on modern conditions. Stark realism. The problems that confront the average man!\nLeBrand: But with a little sex in it.\nJohn L. Sullivan: A little, but I don't want to stress it. I want this picture to be a document. I want to hold a mirror up to life. I want this to be a picture of dignity! A true canvas of the suffering of humanity!\nLeBrand: But with a little sex in it.",
            "review_date": "2007-12-29",
            "source": "rt"
        },
        {
            "content": "Another look at what's really important to humanity - turns out it's people again! Great film and Joel Macrae is gorgeous!",
            "review_date": "2007-12-29",
            "source": "rt"
        },
        {
            "content": "If there's a better movie about the value of comedy then I've yet to see it.  What a joy.  A movie that satirises 'message' pictures and yet manages to deliver its own social message very effectively.  Fast, funny and ultimately moving, Sturges script fairly crackles, while stars Joel McCrea and Veronica Lake light up the screen.  Perfect.",
            "review_date": "2007-12-29",
            "source": "rt"
        },
        {
            "content": "Amazing screwball comedy.  It works better than it should have any right to.",
            "review_date": "2007-12-26",
            "source": "rt"
        },
        {
            "content": "One of the best all time classic comedies . As a writer/actor, I relate to the struggle to be meaningful and important. Sometimes to be meaningful and important is to be entertaining. I adore films that address the importance of popular entertainment in our culture.",
            "review_date": "2007-12-24",
            "source": "rt"
        },
        {
            "content": "A brilliant Preston Sturges feature about Joel McCrea trying to find the \"real\" America.  His partner in this endeavor is Veronica Lake and though they weren't fond of one another in real life, their chemistry onscreen crackles.",
            "review_date": "2007-12-24",
            "source": "rt"
        },
        {
            "content": "A great film, when it was over I just wanted to watch it again.",
            "review_date": "2007-12-22",
            "source": "rt"
        },
        {
            "content": "A wonderfully humorous movie skillfully illustrating that perspective comes from one's own life experiences. Joel McCrea and Veronica Lake are fantastic.",
            "review_date": "2007-12-20",
            "source": "rt"
        },
        {
            "content": "Preston Sturges is considered one of the greatest Hollywood screenwriters. This movie had a unique social gospel message for its post-Great Depression audience.",
            "review_date": "2007-12-17",
            "source": "rt"
        },
        {
            "content": "The way \"Sullivan's Travels\" shifts effortlessly back and forth in tone, from light to dark and back again, is hugely impressive. The Coen brothers borrowed more than just the title of the project Joel McCrea's film director is desperate to make, \"O, Brother, Where Art Thou\"; the figure of the artist, struggling against the Hollywood studio system to make a universally important statement, is clearly echoed in \"Barton Fink\". It's not my favourite Sturges movie but it's still delightful. Veronica Lake is adorable in this.",
            "review_date": "2007-12-17",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant and one of my favorite comedies ever. Probably the best comedy script ever in film. No other film has mixed drama, story, and comedy is such cohesiveness.",
            "review_date": "2007-12-16",
            "source": "rt"
        },
        {
            "content": "Sharp and sardonic, a great film about illusions. A humanist film in the guise of something else entirely. They don't make 'em like this anymore...",
            "review_date": "2007-12-16",
            "source": "rt"
        },
        {
            "content": "A terrific comedy from Preston Sturges, this sees Joel McCrea as a film director bored with his bawdy comedies and setting out on a hobo's life to discover real human misery.  His new film, O Brother Where Art Thou, needs plenty of it and that requires research as McCrea has had a life of comfort.\n\nHis travels are somehow less adventurous and more circular than he had hoped, and the film is pleasant enough through these early scenes but it's when Veronica Lake appears the film hits its stride.  She gives a fantastic performance, full of warmth, wit, innocence and cynicism, and the sex appeal you'd expect from one of the inspirations for Jessica Rabbit.\n\nThe message is two-fold but not contradictory: that ours is a difficult world and its problems and people shouldn't be ignored, but also that there is value in comedy and frivolity in a world that has few things of its own worth laughing at.  What a charming film.\n\n(Also, I intend to build a time machine and marry Veronica Lake.)",
            "review_date": "2007-12-12",
            "source": "rt"
        },
        {
            "content": "wierd and wonderful - genuinely funny.",
            "review_date": "2007-12-09",
            "source": "rt"
        },
        {
            "content": "Wonderful movie about making movies that is really light and clever with some witty, clever dialogue sprinkled throughout. Veronica Lake was stunning in her breakthrough role!",
            "review_date": "2007-12-09",
            "source": "rt"
        },
        {
            "content": "funny, good plot and pairing",
            "review_date": "2007-12-08",
            "source": "rt"
        },
        {
            "content": "Wow. What an amazing film! I switched on the TV while I was eating my lunch and ended up being gripped to the end. Highly recommended!",
            "review_date": "2007-12-08",
            "source": "rt"
        },
        {
            "content": "Haven't seen it  butt look's  kool",
            "review_date": "2007-12-07",
            "source": "rt"
        },
        {
            "content": "Witty..and worthwhile. Number 61 on the AFI.",
            "review_date": "2007-12-05",
            "source": "rt"
        },
        {
            "content": "O, brother, where art thou?",
            "review_date": "2007-12-01",
            "source": "rt"
        },
        {
            "content": "I like it. A worthy successor to Ants In Your Plants of 1939.",
            "review_date": "2007-11-30",
            "source": "rt"
        },
        {
            "content": "Veronica Lake...you're all too young.",
            "review_date": "2007-11-29",
            "source": "rt"
        },
        {
            "content": "La mejor pelicula del genial Preston Sturges que sirve como metafora del cine y como metafora de la vida.  Esta cinta es permanentemente homenajeada a traves de toda la carrera de los hermanos Coen.",
            "review_date": "2007-11-28",
            "source": "rt"
        },
        {
            "content": "Preston Sturges at his peak.  Great story.  Veronica Lake is gorgeous.",
            "review_date": "2007-11-27",
            "source": "rt"
        },
        {
            "content": "I'd have named my son either Kurt or Preston, but the alliteration is dreadful. It's all about the cockeyed caravan.",
            "review_date": "2007-11-27",
            "source": "rt"
        },
        {
            "content": "People must watch this film if not for the comedy, then on the social plight of the poor.",
            "review_date": "2007-11-27",
            "source": "rt"
        },
        {
            "content": "I liked the back and forth of the dialogue in this movie. It's really, really quick. Also, I'm a sucker for social commentary and this is a commentary on social commentary, with jokes! It's a little rough around the edges sometimes and I think Sturges' talent definitely outshines everyone else's - but it's a great movie.",
            "review_date": "2007-11-25",
            "source": "rt"
        },
        {
            "content": "This is my first Preston Sturges film and it will not be my last. An emotional rollercoaster ride that's well written, perfectly directed and edited. And Veronica Lake...",
            "review_date": "2007-11-25",
            "source": "rt"
        },
        {
            "content": "This rating will probably increase once I watch it again, seeing as I was not paying full attention when I watched it.",
            "review_date": "2007-11-25",
            "source": "rt"
        },
        {
            "content": "Unbelievable! I can see why it's considered one of the greatest American films of all time.",
            "review_date": "2007-11-25",
            "source": "rt"
        },
        {
            "content": "A fantastic film with elements from everywhere.",
            "review_date": "2007-11-24",
            "source": "rt"
        },
        {
            "content": "Preston Sturges might be my favorite   filmmaker that no one remembers.  His scripts were perfect, and his actors always gave their best.  Prior to this, I can't remember if I had ever seen a film with Veronica Lake in it.  Well, I fell in love with her from the first time she opened her mouth.  Great film.",
            "review_date": "2007-11-23",
            "source": "rt"
        },
        {
            "content": "A lesson for us all.",
            "review_date": "2007-11-21",
            "source": "rt"
        },
        {
            "content": "Great, but not my thing.",
            "review_date": "2007-11-21",
            "source": "rt"
        },
        {
            "content": "You'll laugh. You'll cry. You'll laugh some more and feel kind of exhilarated, and then the real crying will begin, followed by some laughs.",
            "review_date": "2007-11-20",
            "source": "rt"
        },
        {
            "content": "Veronica Lake is adorable in this Social Satire/Comedy.  An interesting and enjoyable journey.  Recommended.",
            "review_date": "2007-11-19",
            "source": "rt"
        },
        {
            "content": "Feels like the king of comedies much like \"Unforgiven\" for westerns.",
            "review_date": "2007-11-18",
            "source": "rt"
        },
        {
            "content": "Brilliant sturges comedy. My first veronica lake movie and my did she impress.",
            "review_date": "2007-11-17",
            "source": "rt"
        },
        {
            "content": "A salty ham. Maybe Preston Sturges is so hardwired into modern cinema that it's impossible to judge his movies objectively. But I don't think this one belongs on any kind of hundred-best list. Maybe the poster does.",
            "review_date": "2007-11-14",
            "source": "rt"
        },
        {
            "content": "Preston Sturges is awesome - and has a great name - and Veronica Lake is a dish. One of few movies that balances sincerity with humor.",
            "review_date": "2007-11-13",
            "source": "rt"
        },
        {
            "content": "Extremely good, but there is sthg missing that could make it great. Well worth watching, though...",
            "review_date": "2007-11-10",
            "source": "rt"
        },
        {
            "content": "Love this movie. Great story.",
            "review_date": "2007-11-09",
            "source": "rt"
        },
        {
            "content": "Very good, albeit didactic.",
            "review_date": "2007-11-09",
            "source": "rt"
        },
        {
            "content": "It's almost hard to belive that Preston Sturges made this film in 1942.  Sullivanâs Travels tells the story of a Hollywood director who decides to âslum itâ to learn what it is to suffer and be poor before he directs his magnum opus social commentary about and in honor of indigent America.  The film is a comedy that pokes fun at the Hollywood aristocracy and is itself a comic social commentary of Hollywood itself.  It is beautifully written from start to finish, never hesitating to point out the ridiculousness of the protagonistâs venture or his backing studio.  Of course, as the film itself points out, âthereâs always a girl.â  This time the girl is played by the ravishing Veronica Lake.  While the film does have its obligate love story it doesnât detract from the central story.  While there are many classic comedies from this era and before there are few, if any, that are also so intelligently written.",
            "review_date": "2007-11-08",
            "source": "rt"
        },
        {
            "content": "Preston Sturge's masterpiece. See it to believe it.",
            "review_date": "2007-11-07",
            "source": "rt"
        },
        {
            "content": "I adore this film.  Period.",
            "review_date": "2007-11-06",
            "source": "rt"
        },
        {
            "content": "This film was wonderful....if you have not seen it, watch it, and quick.",
            "review_date": "2007-11-06",
            "source": "rt"
        },
        {
            "content": "Preston Sturges made it like no one else during the classical period. This is maybe the best piece of metacinema ever made.",
            "review_date": "2007-11-05",
            "source": "rt"
        },
        {
            "content": "Sure, it's one of those uplifting types of movies that I hate so much, but this one wasn't so bad at all.",
            "review_date": "2007-11-02",
            "source": "rt"
        },
        {
            "content": "Good classic filmmaking.  Funny and poignant.  The acting realism is a step above a lot of older movies as well.",
            "review_date": "2007-10-31",
            "source": "rt"
        },
        {
            "content": "Preston Struges is amazing. The church scene never ceases to get to me. \"There's a lot to be said for making people laugh. Did you know that that's all some people have? It isn't much, but it's better than nothing in this cockeyed caravan.\"",
            "review_date": "2007-10-31",
            "source": "rt"
        },
        {
            "content": "The movie that inspired \"Oh Brother Where Art Thou\" -- and it's much better.  Joel McCrea is excellent (as usual|).  Preston Sturgess's best, IMHO.",
            "review_date": "2007-10-30",
            "source": "rt"
        },
        {
            "content": "I love Preston Sturges...",
            "review_date": "2007-10-30",
            "source": "rt"
        },
        {
            "content": "The inspiration for the Coens of course. First PS film I ever saw so a special favourite.",
            "review_date": "2007-10-30",
            "source": "rt"
        },
        {
            "content": "Preston Sturges was a man truly ahead of his time. He'd be comfortable and certainly more appreciated if here were out there making films today. Then again, maybe we wouldn't have folks like the Coen Brothers if not for Sturges blazing the path.",
            "review_date": "2007-10-27",
            "source": "rt"
        },
        {
            "content": "A unique film for its time since it can't really be categorized into any single genre. Definitely a fun and entertaining film, but it shows its age. Also, this is the movie that inspired \"O Brother, Where Art Thou?\"",
            "review_date": "2007-10-23",
            "source": "rt"
        },
        {
            "content": "A marvelous;y intelligent commentary on the fatuousness and self-aggrandizement of Hollywood.",
            "review_date": "2007-10-23",
            "source": "rt"
        },
        {
            "content": "En klassiker - Preston Sturges regisserar Veronica Lake. Lite mycket snubbel och trilla i poolen fÃ¶r att helt falla i min smak - men hjÃ¤rtat Ã¤r pÃ¥ rÃ¤tta stÃ¤llet. FÃ¶r att vara en romantisk komedi hÃ¥ller dialogen hÃ¶g klass Ã¤nnu idag.",
            "review_date": "2007-10-23",
            "source": "rt"
        },
        {
            "content": "In this Preston Sturges romantic comedy, Joel McCrea stars as John L. Sullivan, the famous Hollywood director of lighthearted comedies who wants to make some serious movies.  Like most Sturges films, this one covers a lot of groundâliterallyâbut this one, especially, is about a journey.  \r\n\r\nSullivan meets âThe Girlâ (Veronica Lake) and goes on his travels as a hobo to learn what itâs like to have troubles so he can make his serious movie.  Thus, the first three-quarters of the movie is classic Sturges: good dialogue, fantastic editing and directing.  Then it sort of slows down a little bit and shows some real hard dramaâhard to swallow stuff.  \r\n\r\nSturges still skips the right things and ends wonderfully.  However, I thought the ending was slightly padded.  It left an awesome feeling, a glorious feeling, but I think the same thing could have been achieved by cutting to the chase.  Basically, I would have established earlier that Sullivanâs wife was now married to the business partner and she would have to divorce Sullivan.  Then, rework some of that dialogue in the end on the plane, maybe even chop it all out.  End on âThe Girlâ running into Sullivanâs arms and a kiss.  You would still have the same emotional impact, even better.\r\n\r\nOr, you could just leave it as is and add a kiss after those laughs.  I donât know.  It just seems like it needs a little more closure, and a kiss might do it.\r\n\r\nIn this movie, Sturges mutes the sound and dubs in music for a couple sequences, making something of a silent sceneâwhich are all very effective.  \r\n\r\nThatâs really the only thing that I would change.  \r\n\r\nThe message is a profound one.  Sturges does seem to get a little preachy towards the end, but it is necessary and the message is great.  Boil it all down and you get something like this: âYou may be best where you are.â  Or, âIf God has called you to make funny movies, then donât try to make serious ones.â  (Replace âfunny moviesâ and âserious onesâ with anything else youâd like.)\r\n\r\nNote that this was made during the middle of WWII and the director, Sullivan, slightly parodied Capra and his movement from romantic comedies to preachy social movies.  Sullivanâs Travels is much better than Mr. Smith Goes to Washington.\r\n\r\nI donât know.  At first I felt like, oh boy, this ending was a little abrupt and needed some closure, like I said, a kiss.  Donât get me wrong, I still agree with that.",
            "review_date": "2007-10-22",
            "source": "rt"
        },
        {
            "content": "I discovered Veronica Lake with this movie, and have to say that I was favorably impressed.  There's a real intelligence that shines through in her performance.",
            "review_date": "2007-10-22",
            "source": "rt"
        },
        {
            "content": "What I found this movie to do for me was show how important a comedy can be to the people of the world. It shows that laughter is something that can't be taken away from someone's soul. The beginning of this movie was alright but in the last half-hour I found it to be quite moving. Showing the unfortunate living the only way they can. This was a heart-warming and eye-opening film. Must-see!",
            "review_date": "2007-10-20",
            "source": "rt"
        },
        {
            "content": "Funny lighthearted film that has a great message that could come across as hipocritical but is dealt with exetremly well. Veronica Lake performs fantastically as does the rest of the cast.",
            "review_date": "2007-10-20",
            "source": "rt"
        },
        {
            "content": "Acteurs d'un autre temps, beautÃ©s d'un autre temps(Veronica lake!), rafraÃ®chissant",
            "review_date": "2007-10-19",
            "source": "rt"
        },
        {
            "content": "I think this might be my favorite movie of all time.",
            "review_date": "2007-10-18",
            "source": "rt"
        },
        {
            "content": "Some really good performances, not a big fan of \"wacky\" sound effects that pervade some older movies.",
            "review_date": "2007-10-16",
            "source": "rt"
        },
        {
            "content": "If you want to have fun and maybe cry a tear or two, you should definitely watch Sullivan's Travels. Veronica Lake is wonderful, but the real power is in Joel MaCrea's marvelous performance. This is one great movie!",
            "review_date": "2007-10-15",
            "source": "rt"
        },
        {
            "content": "Love the production design of this film, ending is total cheese, but who cares when the rest is so good?",
            "review_date": "2007-10-15",
            "source": "rt"
        },
        {
            "content": "Interesting and oftentimes hilarious social commentary and a love letter to comedy and the importance of laughter in all human life.",
            "review_date": "2007-10-15",
            "source": "rt"
        },
        {
            "content": "I've heard of method actors before, but method directors?  An amusing comedy with a huge ironic twist about 2/3 of the way through the film.",
            "review_date": "2007-10-06",
            "source": "rt"
        },
        {
            "content": "im gonna go ahead and say this movie was awesome",
            "review_date": "2007-10-05",
            "source": "rt"
        },
        {
            "content": "A semi-fun, slapstick filled classic journey from the top to the bottom and back to the top. Tries to be moderately anti-racism, yet still comes off as racist and sexist, to a bit of a disconcerting level. The performances are fairly typical, and the ending is lukewarm. A fairly mediocre movie all around, but still enjoyable.",
            "review_date": "2007-10-05",
            "source": "rt"
        },
        {
            "content": "my favorite movie when i was a kid, it shaped my vision of the world, society, and blondes.",
            "review_date": "2007-10-04",
            "source": "rt"
        },
        {
            "content": "Preston Sturges' masterpiece (not an overstatement) carries a message that is at least as relevant today as it was in '42.",
            "review_date": "2007-10-01",
            "source": "rt"
        },
        {
            "content": "It's probably Joel McCrea's best role--it's definitely the one he'll be remembered for, and the same definitely goes for Veronica Lake. It's fun and at times endearing--Sturges at his best.",
            "review_date": "2007-09-30",
            "source": "rt"
        },
        {
            "content": "Had some good moments, but it was all a bit of a mess.  The second half really dragged on too. Lady Eve was excellent, but this was mediocre at best.",
            "review_date": "2007-09-29",
            "source": "rt"
        },
        {
            "content": "Sturges goes slightly serious in this still very funny and poignant film.",
            "review_date": "2007-09-27",
            "source": "rt"
        },
        {
            "content": "Part wild slapstick, part hollywood farce, part class-struggle meditation. Structure is sometimes a weak point for Sturges, but it's particularly strong here, and his writing and direction are at their peak. An essential American comedy.",
            "review_date": "2007-09-25",
            "source": "rt"
        },
        {
            "content": "A smart comedy with serious turns. My favourite Preston Sturges film. Highly recommended; should be more widely known.",
            "review_date": "2007-09-25",
            "source": "rt"
        },
        {
            "content": "If it's Preston Sturges, watch it.",
            "review_date": "2007-09-23",
            "source": "rt"
        },
        {
            "content": "Not a bad movie, as old movies go. The moral I disagree with, but it's presented fairly persuasively...",
            "review_date": "2007-09-22",
            "source": "rt"
        },
        {
            "content": "A comedy with a moral that freaked me out the first time I saw it",
            "review_date": "2007-09-21",
            "source": "rt"
        },
        {
            "content": "Fast, fun and thoughtful.",
            "review_date": "2007-09-21",
            "source": "rt"
        },
        {
            "content": "A depression era comedy with social commentary of the upper and lower classes.  An American masterpiece.",
            "review_date": "2007-09-19",
            "source": "rt"
        },
        {
            "content": "A quick, intelligent Sturges comedy. If only Hollywood had this kind of dialogue and pace these days. The movie pokes fun at Hollywood and naive liberals, and it also has some interesting moments concerning race, sexuality, and American poverty.",
            "review_date": "2007-09-18",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies: \"it's better to make 'em laugh than cry.\" And also the demystification of the working man. But still . . . maybe it's all reverse propaganda. Eh. I'm too paranoid.",
            "review_date": "2007-09-18",
            "source": "rt"
        },
        {
            "content": "A totally disarming, sweet and wonderful story that balances humour, pathos and social commentary. And Veronica Lake is absolutely stunning!",
            "review_date": "2007-09-16",
            "source": "rt"
        },
        {
            "content": "Sturges' apologetic social commentary on the value of a good laugh.",
            "review_date": "2007-09-15",
            "source": "rt"
        },
        {
            "content": "Everyone should see this movie.",
            "review_date": "2007-09-15",
            "source": "rt"
        },
        {
            "content": "A director lifes life as a hobo in order to get the right feel for his next directorial effort, and learns more about them then he ever anticipates.  This is a feel-good movie that you will make you feel like a better person after watching it.",
            "review_date": "2007-09-15",
            "source": "rt"
        },
        {
            "content": "One of the best films of its kind. Preston Sturges is tops.",
            "review_date": "2007-09-15",
            "source": "rt"
        },
        {
            "content": "sturges masterpiece, with a little sex in it",
            "review_date": "2007-09-15",
            "source": "rt"
        },
        {
            "content": "a kind of reverse 'my man godfrey,' in which a rich director plays poor for awhile in order to empathize enough before making a movie of 'o brother where art thou.' the twists and turns along the way are quite funny, and it's fascinating to watch veronica lake with her trademark eye-covering hair wave. joel mccrea is perfect in the lead role. the script is smart, though at the finish, a bit smarmy and condescending, but i enjoyed it as one of the first films 'about' movies - the fakeout opening, and the following scene where the good intentioned director defends his art to money-hungry producers must have come straight from sturges' experience. sets the stage for 'the player,' \"sunset boulevard,' 'singin in the rain,' and other meta-movies.",
            "review_date": "2007-09-14",
            "source": "rt"
        },
        {
            "content": "Classic meta-Hollywood.  A tale of class tourism and a premonition of pop culture to come.  Church, comedy, Hollywood, Disney, imprisonment - you can't just build cinematic scenes like this.  Filmic poetry.",
            "review_date": "2007-09-13",
            "source": "rt"
        },
        {
            "content": "A great drama, a great comedy, and a great road movie all rolled into one.",
            "review_date": "2007-09-13",
            "source": "rt"
        },
        {
            "content": "\"It died in Pittsburgh.\" \"What do they know in Pittsburgh?\" \"They know what they like!\" \"If they knew what they liked, they wouldn't live in Pittsburgh.\"",
            "review_date": "2007-09-12",
            "source": "rt"
        },
        {
            "content": "this movie is why I make movies",
            "review_date": "2007-09-12",
            "source": "rt"
        },
        {
            "content": "Savvy and heartwarming. Fiery idealism can always be supplemented by comedy. That is one hell of a great motif that can help us all work well for change and be human while doing it.",
            "review_date": "2007-09-12",
            "source": "rt"
        },
        {
            "content": "For my money, diologoue doesn't get any better than this!",
            "review_date": "2007-09-12",
            "source": "rt"
        },
        {
            "content": "This was probably hilarious in 1942.  Too bad it's not 1942",
            "review_date": "2007-09-11",
            "source": "rt"
        },
        {
            "content": "Great poster, terrible movie. This from the same man who made The Lady Eve!",
            "review_date": "2007-09-11",
            "source": "rt"
        },
        {
            "content": "\"Where are we?\"\n\"I don't know. Hollywood, I s'pose.\"",
            "review_date": "2007-09-11",
            "source": "rt"
        },
        {
            "content": "Good movie, but a little overrated. I liked the basic idea of the film-how making people laugh is sometimes the best thing you can do for them. However, the movie has uncomfortable racial overtones and features too many stereotypical characters-the struggling actress, the clueless working man, the rich naive political idealist. I thought the Great McGinty was better.",
            "review_date": "2007-09-06",
            "source": "rt"
        },
        {
            "content": "A semi-fun, slapstick filled classic journey from the top to the bottom and back to the top. Tries to be moderately anti-racism, yet still comes off as racist and sexist, to a bit of a disconcerting level. The performances are fairly typical, and the ending is lukewarm. A fairly mediocre movie all around, but still enjoyable.",
            "review_date": "2007-09-06",
            "source": "rt"
        },
        {
            "content": "how hard it is to love the world and love a single person",
            "review_date": "2007-09-05",
            "source": "rt"
        },
        {
            "content": "Great dialog, but in general perhaps a little too sincere and non-ironic for modern viewers.",
            "review_date": "2007-09-03",
            "source": "rt"
        },
        {
            "content": "This is the first Sturges movie I've seen, and I'm sure after this one I'll see many more.  The story is great, and Joel McCrea and Veronica Lake both give good performances (although Veronica Lake seems a little miscast for a poor, down-and-out failed actress).  The movie is pretty funny even today, and it's so hard to make an ageless comedy that I give this movie a lot of credit.  Very enjoyable, but deep also.",
            "review_date": "2007-09-03",
            "source": "rt"
        },
        {
            "content": "It was an enjoyable movie about the human spirit. Very smart, very funny, and very poignant. Just a little flat at some parts.",
            "review_date": "2007-08-31",
            "source": "rt"
        },
        {
            "content": "Unique. Sublime script. Poignant filming - some very special moments",
            "review_date": "2007-08-29",
            "source": "rt"
        },
        {
            "content": "\"Get me ham and eggs before I bite you.\" Veronica Lake is my favorite actress of the studio era, and this is her best film by a mile. Plus, the hair!",
            "review_date": "2007-08-23",
            "source": "rt"
        },
        {
            "content": "Four stars (Don't miss it): Very fine comedy about a director tired of making sentimental movies attempting to see what it's like to live in poverty.  Starts out as somewhat of a farce, and moves beautifully into full-blown social commentary.  A finely tuned attack on liberal elitism in the face of poverty.",
            "review_date": "2007-08-21",
            "source": "rt"
        },
        {
            "content": "Pretty good, but then again, not that great.",
            "review_date": "2007-08-17",
            "source": "rt"
        },
        {
            "content": "Brilliant! Hilarious! Scathing! Humbling!  So much fun.  One of the best Hollywood movies ever.  Still so fresh.",
            "review_date": "2007-08-17",
            "source": "rt"
        },
        {
            "content": "Preston Sturges knows that every joke has a victim and decidedly makes him go through the hardships of poverty and anonymity for our own amusement. \nThe chemistry between Joel McCrea and Veronica Lake is the heart of this hilarious and life affirming meta-cinematic exercise.",
            "review_date": "2007-08-15",
            "source": "rt"
        },
        {
            "content": "Why can't they make movies like they used to!? Sullivan's Travels is an absolute gem of a movie and given the year it was made it still holds up. Absolutely hilarious, the scene where the bus starts chasing the car my God it felt like my sides were gonna split! And great commentary on the movie business from within the movie business. Definitely one to watch!",
            "review_date": "2007-08-14",
            "source": "rt"
        },
        {
            "content": "This is Preston Sturges ultimate classic! I consider the majority of his films classics, however, this is the crown Jewel of Preston Sturges's films. Go watch it NOW!",
            "review_date": "2007-08-13",
            "source": "rt"
        },
        {
            "content": "#61 on AFI's top 100 movies. Good movie. It starts out as a comedy but becomes more and more dramatic as it goes on. Makes a good point about the power of comedy. And Veronica Lake is still hot seeing the movie 60+ years later.",
            "review_date": "2007-08-12",
            "source": "rt"
        },
        {
            "content": "This movie is at its best when Veronica Lake is in it and a bit lacking when she?s not.  It tries for the ?comedy with a real message? thing.  That message being that comedic movies are important b/c they give people joy and distraction from their lives.  It in part does this by showing a group of people eliciting hard forced laughter at a cartoon that is entertaining but really not the kind of thing people would laugh at in that way.  The whole thing just comes off as strange and the movie losses a little at the end because of it.",
            "review_date": "2007-08-12",
            "source": "rt"
        },
        {
            "content": "Bravo Preston Sturges! Joel McCrea turns in the performance of a lifetime.",
            "review_date": "2007-08-10",
            "source": "rt"
        },
        {
            "content": "The most under-rated film in the world, it's up there with all the greats",
            "review_date": "2007-08-09",
            "source": "rt"
        },
        {
            "content": "Oh, boy.  So far, I've missed all the \"Big Broadcast\" style of movie, though I've no doubt I'll get to 'em someday.  I do, however, have enough awareness of them to know what John L. Sullivan's [i]Ants in Your Pants of 1939[/i] must have been like.\r\n\r\nVeronica Lake gets dubbed \"the girl\" in this movie.  She never actually gets a name.  Also, she was 4'11.5\", which I didn't know.  A tiny little thing.  Beautiful, of course; the movie's almost worth watching just for the acting talent of its stars and Veronica Lake's beauty.  But Joel McCrea was very nearly a foot and a half taller than she.\r\n\r\nOur hero, John L. Sullivan, is a boy-genius film director a la Orson Welles.  He's trying to make the great, dramatic feature of the familiar title, [i]O Brother, Where Art Thou?[/i]  However, it's pointed out to him that what he knows of suffering could pretty much fit in a paper cup.  So he dresses himself as a tramp and goes wandering, almost immediately accompanied by Veronica Lake for no good reason.\r\n\r\nAfter shaking Veronica Lake, he evenutally finds out that what the world needs is comedy, not drama, and that--despite some two weeks on a chain gang--he still doesn't know much of anything about suffering.  So instead, he'll make [i]Ants in Your Pants of 1941[/i], because what the world needs is stupid comedies.\r\n\r\nI saw this movie years ago, so I was one of those rare people who caught the joke of [i]O Brother[/i].  The Coen Brothers are compared to Preston Sturges quite a lot, after all, and rightly so.  \r\n\r\nSturges has gotten compliments for this movie's portrayal of its black cast members--from the NAACP, no less.  Despite the slapstick nature of the scenes in the \"land yacht,\" the black characters are shown with as much dignity--and having more generosity, I think--as the white ones.  Then again, this movie is screwball enough so that dignity seems a bit out of place.  And did anyone else notice that the projector at the black church must be [i]really[/i] old to show the cartoon without sound?",
            "review_date": "2007-08-08",
            "source": "rt"
        },
        {
            "content": "Sturges may have been at his finest with \"The Lady Eve,\" but there's something about the combination of humor and social commentary in this that gets me every time.",
            "review_date": "2007-08-06",
            "source": "rt"
        },
        {
            "content": "Sturges has come to a realization.  And it's one hell of a journey.",
            "review_date": "2007-08-06",
            "source": "rt"
        },
        {
            "content": "Veronica Lake is hardly the world's most versatile actress, but she is very well used here, in this somewhat cynical, misanthropic, satirical screwball romantic comedy.  Fans of the Coen Brothers' \"O Brother Where Art Thou\" may find this insightful viewing.  A good primer for anyone interested in sampling the flavour and intelligence of Hollywood filmmaking during the troubled times of WW2.",
            "review_date": "2007-08-05",
            "source": "rt"
        },
        {
            "content": "A fantastic film. Witty, cynical, smart and all about why we love going to the movies.",
            "review_date": "2007-08-04",
            "source": "rt"
        },
        {
            "content": "'A brilliant fantasy in two keys - slapstick farce and the tragedy of human misery.' - James Agee",
            "review_date": "2007-08-02",
            "source": "rt"
        },
        {
            "content": "At first I was not liking this movie, it was a little slow in developing and the main character didn't really have much to play against. Then Veronica Lake's character was introduced, and the whole movie changed. From that point on the banter back and forth between the two carried the movie easily, and although I was not sure where the story was going in the last quarter, it ended well enough and made me want to see it again.",
            "review_date": "2007-07-31",
            "source": "rt"
        },
        {
            "content": "One of Veronica Lake's best performances, and she's great fun to watch.  The film does have its genuinely funny moments.  However, I found myself a bit off-put by the \"message\" of the film.  Certainly it's valuable to make people laugh, but the film's attitude toward poverty is pretty awful, in my opinion.  We can see what it's like, maybe give people a hand now and then when we feel like it, but ultimately we're going to make no effort to change the social situation as a whole.  We're just going to distract people for a while.",
            "review_date": "2007-07-30",
            "source": "rt"
        },
        {
            "content": "Joel McCrea is great in this great road trip movie",
            "review_date": "2007-07-29",
            "source": "rt"
        },
        {
            "content": "Good classic comedy. Shows the importance of laughter.  Sturges produced a great movie.",
            "review_date": "2007-07-28",
            "source": "rt"
        },
        {
            "content": "\"There's a lot to be said for making people laugh\"...one of my favorite favorite movies.",
            "review_date": "2007-07-28",
            "source": "rt"
        },
        {
            "content": "A movie director goes out into the real world to ivestigate the real world for his films, and ends up on a chain gang and presumably dead.",
            "review_date": "2007-07-25",
            "source": "rt"
        },
        {
            "content": "Snappy dialogue, charismatic leads and an interesting message make this a (still) amusing and relevant prewar film.",
            "review_date": "2007-07-24",
            "source": "rt"
        },
        {
            "content": "I find Preston Sturges' films to be a fit artificial but I still manage to love them anyway. Joel McCrea is someone bland and one-dimensional but Veronica Lake completely steals the show.",
            "review_date": "2007-07-24",
            "source": "rt"
        },
        {
            "content": "Part fish-out-of-water comedy, part social commentary. Star is a director who wants to make a serious drama about hardship and so pretends he's a hobo to learn about the rough life, and ends up learning a lot of something else instead.",
            "review_date": "2007-07-23",
            "source": "rt"
        },
        {
            "content": "A classic Hollywood comedy that manages to pack a political punch. Memorable lines, great chemistry between the leads, and a unique, labor-oriented storyline. I developed a huge crush on Veronica Lake after seeing this movie.",
            "review_date": "2007-07-21",
            "source": "rt"
        },
        {
            "content": "Preston Sturges at his absolute best. A regular reference point for the Coen Brothers.",
            "review_date": "2007-07-20",
            "source": "rt"
        },
        {
            "content": "Why isn't the whole world obsessed with Preston Sturges? He's so great. Unlike many older comedies, it actually made me laugh out loud several times instead of merely appreciating the humour from a decades-long distance.",
            "review_date": "2007-07-20",
            "source": "rt"
        },
        {
            "content": "Veronica Lake's on the take!  Lake steals every scene in this movie and Joel McCrea as a film director who wants to see a dangerous life he cannot seem to be successful to get into makes this film a brilliant masterpiece.",
            "review_date": "2007-07-19",
            "source": "rt"
        },
        {
            "content": "Not my favorite Veronica Lake film, in fact, her character isn't even given a name.",
            "review_date": "2007-07-19",
            "source": "rt"
        },
        {
            "content": "A timeless classic. The scene when John Sullivan confesses to his own murder is priceless and the movie as whole has so much heart and soul to it as gay as that sounds. Really a great one though.",
            "review_date": "2007-07-18",
            "source": "rt"
        },
        {
            "content": "The moral of the film is pretty poor, and it's not a gutbustingly funny film, but it is consistently enjoyable and unlike other screwy comedies by Hawks or Mankewicz.",
            "review_date": "2007-07-16",
            "source": "rt"
        },
        {
            "content": "Fantastic. One of Sturges' more overtly moralistic comedies, but still great.",
            "review_date": "2007-07-16",
            "source": "rt"
        },
        {
            "content": "A sophisticated, smart comedy way ahead of its time.",
            "review_date": "2007-07-15",
            "source": "rt"
        },
        {
            "content": "Classic laugh then make you cry movie",
            "review_date": "2007-07-15",
            "source": "rt"
        },
        {
            "content": "Fans of the Coen Brothers will watch SULLIVAN'S TRAVELS and let out a nice \"Oooooooh\" while enjoying this perfect, incredibly underrated comedy from Preston Sturges.  One can see themes and ideas from this film in movies that the Coens have done, bits of this movie almost make BARTON FINK look like an extremely dark retelling of the theme.  The movie is about a Hollywood director named Sullivan (Joel McCrea) who is tired of churning out lighthearted musicals and fluffy screwball comedies.  Convinced that nobody wants to laugh when war and poverty plague the nation, Sullivan wants to make O BROTHER, WHERE ART THOU?, a movie about the common man that will speak to everyday people.  However Sullivan wants to tell a story he knows nothing about, as he realizes he knows nothing about being poor and living day-to-day, so he sets out on the road to leave L.A. and live the life of a depression-era hobo, and what he will find will no doubt surprise him.  Hilarity (and sometimes horror) ensues.  \n\nWhat Sturges has cooked up here is a satire of Hollywood's condescending brand of liberalism.  Ever since film production began, studio producers and directors have been putting their idea of what it is like to be poor on screen, often unintentionally glamorizing the experience.  It also shows that Hollywood often doesn't get what people want to see when they go to the movies.  Like the titular character in BARTON FINK, Sullivan is earnest in his desire to make a movie that speaks to everyday folk, but in doing so he unintentionally offends those who are or have been in that situation.  However Sturges respects his main character, and seems to love all the buffoons he depicts in his screenplays.  The movie is never mean-spirited, it has moments that are unrelentingly hilarious, and bits of ecstasy when character arcs come to fruition.  I've only seen a handful of Sturges' films, but this is certainly one of the best, if you haven't seen any of his movies, this is a great place to start, especially if you like the Coen Brothers.",
            "review_date": "2007-07-15",
            "source": "rt"
        },
        {
            "content": "A nice classic with some quick wit that you have to pay attention to. Some of the plot was predictable yet still worth the watch.",
            "review_date": "2007-07-15",
            "source": "rt"
        },
        {
            "content": "A great social statement by Preston Sturges, with his flair for frantic comedy. Slapstick with purpose.",
            "review_date": "2007-07-15",
            "source": "rt"
        },
        {
            "content": "One of the very best movies ever made. Flawless in every way.",
            "review_date": "2007-07-15",
            "source": "rt"
        },
        {
            "content": "Sturges' insight about the relevance of humor in a dog-eat-dog world never gets old, mainly because his insight into humanity itself is spot on.  And all his mainstays are here: crisp dialogue, vivid and far-reaching portrayals, a wide cross section of society, Hollywood w/o being too Hollywood, and Veronica Lake, too! Interestingly book-ended by two portrayals of American blacks, one comic, the other deeply respectful = cool, especially considering the year of production. And still ahead of it's time.",
            "review_date": "2007-07-14",
            "source": "rt"
        },
        {
            "content": "hilarious premise but takes a while to really get going, and doesn't really get anywhere surprising in the end either",
            "review_date": "2007-07-13",
            "source": "rt"
        },
        {
            "content": "This was the inspiration for 'O Brother Where Art Thou'. It's hard to explain the heart warming scene where the prisoners take simple pleasure in watching a Mickey Mouse film in an African American church in the deep South.",
            "review_date": "2007-07-09",
            "source": "rt"
        },
        {
            "content": "John Sullivan: \"There's a lot to be said for making people laugh. Did you know that's all some people have? It isn't much, but it's better than nothing in this cockeyed caravan. Boy!\"",
            "review_date": "2007-07-08",
            "source": "rt"
        },
        {
            "content": "Wow, talk about a movie with a soul. Intensely funny yet very compelling and emotionally-gripping toward the end. It's a shame this movie's so obscure, everybody should watch it.",
            "review_date": "2007-07-08",
            "source": "rt"
        },
        {
            "content": "Hilarious and moving film.\n Only movie I've seen Veronica Lake in and she's great, even if the hair's a tad overrated.",
            "review_date": "2007-07-07",
            "source": "rt"
        },
        {
            "content": "I could see this was incredibly well made, but I didn't really understand it when I first saw it.  I really should see it again.",
            "review_date": "2007-07-05",
            "source": "rt"
        },
        {
            "content": "Preston Sturges. That is all.",
            "review_date": "2007-07-05",
            "source": "rt"
        },
        {
            "content": "Brilliant, Sturgess is just a wonderful writer/director.",
            "review_date": "2007-07-02",
            "source": "rt"
        },
        {
            "content": "They don't make em like they use to... the women that is.",
            "review_date": "2007-07-01",
            "source": "rt"
        },
        {
            "content": "Up there with Sunset Boulevard and Adaptation, its one of the best movies about making movies, without, the story being a \"making of\" featurette.",
            "review_date": "2007-07-01",
            "source": "rt"
        },
        {
            "content": "more light comedy from sturges. i didnt like it as much as unfaithfully yours but it was still fun. and for a comedy of this style it deals with some larger issues which is rare. joel mccrea is a little flat on his acting at some moments in the film but generally does a passable job. veronica lake is pretty good too. the comedy is pretty good overall and hits some really high notes.",
            "review_date": "2007-06-30",
            "source": "rt"
        },
        {
            "content": "A sweet comedy with great performances, and very funny. Oh, and it's got Veronica Lake.",
            "review_date": "2007-06-28",
            "source": "rt"
        },
        {
            "content": "Veronica Lake is the real star of this show. Not as funny as some of the other Sturges stuff, but wonderfully heartfelt. Ahahaha...I just really wanted to use the term \"heartfelt\". Ahaha. It's seriously just a great movie.",
            "review_date": "2007-06-26",
            "source": "rt"
        },
        {
            "content": "[center][font=Times New Roman][size=4][color=white][img]http://upload.wikimedia.org/wikipedia/en/2/23/Sullivanstravelsposter.jpg[/img][/color][/size][/font][/center]\n \n[font=Times New Roman][size=4][color=white]Summary (from IMDB): Director John L. Sullivan wants to make a social-problems film called 'O Brother, Where Art Thou?' When his producers point out that he knows nothing about trouble or poverty, he goes on the road as a hobo. Joined by a down-on-her-luck aspiring actress, the results are hardly the kind of trouble he had in mind. But when the 'experiment' seems to be over, Sullivan falls into more trouble than he ever dreamed of.[/color][/size][/font]\n \n[font=Times New Roman][size=4][color=white]Sullivan's Travels was definitely not as good as I expected it to be. While I still enjoyed it and understand it's high regard, I didn't agree with it. Basically, the movie was kind of pushing an agenda saying that film is supposed to fun and light-hearted above all else. I couldn't disagree more. While fun movies are definitely necessary, I don't think a someone who has always been involved in the comedy industry should be limited to that kind of role. Look at Jim Carey in Eternal Sunshine and Adam Sandler in Punch Drunk Love.[/color][/size][/font]\n \n[center][font=Times New Roman][size=4][img]http://www.beckerfilms.com/SullivansTravels.gif[/img][/size][/font][/center]\n \n[font=Times New Roman][size=4][color=white]Regardless of the 'message', the film was fun and enjoyable, which is what it set out to do. Joel McCrea is good and convincing in his part. I haven't seen much Sturgess so I don't really have anything to compare this to. If all of his films try to push this 'movies should only be fun' agenda, I could see myself turning away from his work pretty quickly. As for now, I'll give him more chances.[/color][/size][/font]",
            "review_date": "2007-06-25",
            "source": "rt"
        },
        {
            "content": "Really uneven, but Preston Sturges still pulls it off. I didn't know where it was going one minute to the next, but that is just fine for this film.",
            "review_date": "2007-06-23",
            "source": "rt"
        },
        {
            "content": "It's astounding to me that amid all the hoopla about \"O Brother, Where Art Thou?\" almost nobody commented on the fact that the Coen Brothers' movie was based on the notion for a movie that Joel McCrea's character kept talking about throughout \"Sullivan's Travels.\" No woman as sultry as Veronica Lake should be doubly blessed with that much of a comedic flair. And at the risk of repeating myself, William Demarest is god.",
            "review_date": "2007-06-23",
            "source": "rt"
        },
        {
            "content": "Pretty much give ANY Preston Sturges movie 4-stars.",
            "review_date": "2007-06-22",
            "source": "rt"
        },
        {
            "content": "This is the Citizen Kane of comedy. And Veronica Lake is hotter than the surface of the sun.",
            "review_date": "2007-06-21",
            "source": "rt"
        },
        {
            "content": "Wonderful film in every respect. Veronica Lake is so charming and alluring.\n\nThere's a great moment when Sullivan (played by the brilliant Joel McGrea) is standing in tattered clothes and a policeman asks, 'What are you doing in those clothes?'\n\nThe fantastically delivered response is, 'I've just paid my income tax.'",
            "review_date": "2007-06-21",
            "source": "rt"
        },
        {
            "content": "Sturges was a master. Funny, smart, and even touching.",
            "review_date": "2007-06-20",
            "source": "rt"
        },
        {
            "content": "LOVE Veronica Lake! Not one of my favorites of hers but a good movie nonetheless.",
            "review_date": "2007-06-18",
            "source": "rt"
        },
        {
            "content": "This film is really brilliant. One of my favourite Sturges films, it shows a comedic tale in a time where they needed to really keep up the morale of those involved in the war. Its about keeping a sense of humour in Hollywood. Later, the Coen brothers would make an ode to this film too.",
            "review_date": "2007-06-17",
            "source": "rt"
        },
        {
            "content": "Humor and sorrow mixed perfectly. Veronica Lake radiates star quality and talent, what a sad waste.",
            "review_date": "2007-06-16",
            "source": "rt"
        },
        {
            "content": "Well, socialist to the extreme, but whoever said that made a picture bad.  Entertaining, funny, meaningful and VERONICA LAKE.",
            "review_date": "2007-06-16",
            "source": "rt"
        },
        {
            "content": "Pro Commedia, pro vulgare. Alto e basso.",
            "review_date": "2007-06-15",
            "source": "rt"
        },
        {
            "content": "Preston Sturges directs one of my favorite slapstick films.  It demonstrates through it's storyline, the importance of comedy in film and the innate ability to make audiences laugh.  If you haven't seen this one SEE IT immediately.",
            "review_date": "2007-06-15",
            "source": "rt"
        },
        {
            "content": "One of the funniest films ever.",
            "review_date": "2007-06-15",
            "source": "rt"
        },
        {
            "content": "this movie is totally a good movie.",
            "review_date": "2007-06-13",
            "source": "rt"
        },
        {
            "content": "I was turned on to this film by a good friend.  The dialogue is brilliant and should be embraced more in modern film.  And this may be me, but I don't think there is a single actress on the silver screen that is as remarkably seductive and sultry as Veronica Lake was when this film was made.",
            "review_date": "2007-06-12",
            "source": "rt"
        },
        {
            "content": "One of my favourite movies. Madcap comedy, social commentary, brilliant dialogue and a story that criticises and responds to government and hollywood perceptions at the time of the great depression.",
            "review_date": "2007-06-12",
            "source": "rt"
        },
        {
            "content": "One of the great American films. Preston Sturges was a true original.",
            "review_date": "2007-06-11",
            "source": "rt"
        },
        {
            "content": "Watch this and O Brother Where Art Thou in the same night.  A superb double feature.",
            "review_date": "2007-06-11",
            "source": "rt"
        },
        {
            "content": "It's just something I love to watch over and over again!",
            "review_date": "2007-06-11",
            "source": "rt"
        },
        {
            "content": "One of Sturges' best--a full and beautiful ode to the American spirit and to life and love and experience and wisdom and cartoons.",
            "review_date": "2007-06-10",
            "source": "rt"
        },
        {
            "content": "Sturges best film with some of the wittiest dialogue ever spoken.",
            "review_date": "2007-06-10",
            "source": "rt"
        },
        {
            "content": "Please watch this if you haven't.",
            "review_date": "2007-06-08",
            "source": "rt"
        },
        {
            "content": "This film has a sweet message in it. It is hard to believe that Veronica Lake was pregnant when she made this.",
            "review_date": "2007-06-08",
            "source": "rt"
        },
        {
            "content": "It has its moments, and a great message. However...the film has surprisingly glaring errors in its screenplay regarding momentum and conflict. Could've been a lot better.",
            "review_date": "2007-06-08",
            "source": "rt"
        },
        {
            "content": "Sturges' finest film. Veronica Lake IS on the take in this brilliant film with a stellar performance by Joel McCrea. Should be mandatorily watched by every person ever born.",
            "review_date": "2007-06-07",
            "source": "rt"
        },
        {
            "content": "Veronica Lake is gorgeous. Funny and touching.",
            "review_date": "2007-06-07",
            "source": "rt"
        },
        {
            "content": "I just love it. its so funny and every line has something to learn from.",
            "review_date": "2007-06-07",
            "source": "rt"
        },
        {
            "content": "I'm not sure there has ever been a funnier director than Preston Sturges, and this is his best movie. I may always have a soft spot for The LAdy Eve, but its impossible to deny just how wonderful Sully is. Absolutely everything in this movie works perfectly,",
            "review_date": "2007-06-06",
            "source": "rt"
        },
        {
            "content": "A great film for any writer who thinks he needs to right the next great \"American Tragedy.\"",
            "review_date": "2007-06-06",
            "source": "rt"
        },
        {
            "content": "Preston Sturges' best film veers from farcial comedy to moving drama and back again, all within a seriously clever and satirical screenplay. One of the best ever films about filmmaking.",
            "review_date": "2007-06-06",
            "source": "rt"
        },
        {
            "content": "Maybe the best picture ever made. If not it's a stone's throw away from the title. Veronica Lake, one of the most enduringly fascinating (and mercilessly beautiful) personalities of the screen, Joel McCrea who is likewise no slouch, and one of the most focused and sympathetic leading men of all time, head it, and then there's the stock company as always, comlete with Demarest and Pangborn, not to mention a story that covers all the highs and lows of life, praises comedy, becomes unabshedly sentimental and feels like the most sense the world has got to offer. A picture, a tribute, a portrait of understanding of human idiocy and sentiment, one hell of a piece of work. Thank god for it.",
            "review_date": "2007-06-05",
            "source": "rt"
        },
        {
            "content": "Seemed kind of draggy and toothless up until the scene in the church.  Yeah, it's kind of a simple, didactic scene - maybe even a little insulting to minorities! (ah, Hollywood in the 40s...) But I don't know, that scene is really moving if you can divorce the simplistic message from the way it's presented.",
            "review_date": "2007-06-05",
            "source": "rt"
        },
        {
            "content": "I just love it. its so funny and every line has something to learn from.",
            "review_date": "2007-06-04",
            "source": "rt"
        },
        {
            "content": "Completely undisciplined in its pace but the first \"But with a little sex\" scene was the gold nugget of the whole thing. The rest was a little pedantic.",
            "review_date": "2007-06-03",
            "source": "rt"
        },
        {
            "content": "Such a wonderful and entertaining movie, when it started and the action sequence on the train was going on, I knew I was gonna love this. Some really funny moments, I especially loved the scene when Sullivan made his proposition and the moment immediately after he left the room. Luckily I didn't know much about this, so there were times when I didn't know what was gonna happen next. The ending was excellent. I don't know if this is the message everyone got out of the film, but for me it helps explain why I love movies. No matter what's happening in my life, if something's wrong or if I'm in a bad mood, I know I can watch a movie and feel a little bit better.",
            "review_date": "2007-05-31",
            "source": "rt"
        },
        {
            "content": "My favourite Sturges. Social commentary in the same vein as My Man Godfrey, disguised as comedy.",
            "review_date": "2007-05-29",
            "source": "rt"
        },
        {
            "content": "COMPLETELY brilliant... no opportunity is lost, no moment is wasted.  The performances are fantastic, too.",
            "review_date": "2007-05-23",
            "source": "rt"
        },
        {
            "content": "Preston Sturges is my hero.",
            "review_date": "2007-04-22",
            "source": "rt"
        },
        {
            "content": "Mmmmm.  Veronica Lake.",
            "review_date": "2007-04-21",
            "source": "rt"
        },
        {
            "content": "the reason why films are so GREAT!",
            "review_date": "2007-04-10",
            "source": "rt"
        },
        {
            "content": "Adam Sandler needs to watch this. Veronica Lake is hott stuff.",
            "review_date": "2007-04-08",
            "source": "rt"
        },
        {
            "content": "Now well known as the source of the title of the Coen Brothers title O Brother Where Art Thou this story of a comedy director who wants to make a tragedy but feels he has to do some research and ends up doing rather more than he bargained for is a delight. Preston Sturges screenplay and direction are fast, funny and original (Though it's a shame he has to include a black character so insultingly stereotyped as the cook who crops up from time to time) Joel McCrea underplays all the way, getting lots of funny lines and moments but never playing for the joke. It's a terrific performance. Veronica Lake isn't, on this evidence, a great actress but she's radiant in the role of The unnamed Girl who accompanies McCrea on his travels and gets plenty of laughs, notably in her first scene, the best in the film. A clever, early, satire on Hollywood Sullivan's Travels is recommended viewing for any film fan.",
            "review_date": "2007-03-19",
            "source": "rt"
        },
        {
            "content": "This is a comedy and not those things with adam sandler",
            "review_date": "2007-03-06",
            "source": "rt"
        },
        {
            "content": "Arguably one of my favorite films of the 1930s. Everybody should see this film",
            "review_date": "2007-03-02",
            "source": "rt"
        },
        {
            "content": "comedic satire about living a sheltered life and the world of film - huge yet entertaining insights into humanity and social classes",
            "review_date": "2007-02-28",
            "source": "rt"
        },
        {
            "content": "I don't know much about the Coen Brothers to know if they claim Preston Sturges as a major influence on their work, but there seems to be a connection.  They seem to be continuing the tradition of Hollywood outsiders making movies their own way, freely mixing comedy, drama, dark twisted moments, and a little romance.  After all they made Oh Brother, Where Art Thou?, the movie that never gets made in this film.\n\nI think I've only seen one other Sturges film, The Great McGinty, and I noticed social issues seem to be a favorite theme.  He pokes fun at the Hollywood machine.  There is lots of great dialog, some of which I didn't appreciate till I saw the clips again in a special feature doc.  There are quite a few laughs, but it turns at times to thoughtful drama and a touch of romance.  Then it also deals with the darker side of society, the danger of giving charity to the poor too freely, the treatment of chain gang prisoners, and a particularly grisly death for the time when this movie was made.  The movie cautions against taking the art and social power of moving pictures too seriously.",
            "review_date": "2007-02-21",
            "source": "rt"
        },
        {
            "content": "The original OH BROTHER WHERE ART THOU!",
            "review_date": "2007-01-21",
            "source": "rt"
        },
        {
            "content": "i keep liking it more and more. it gets really differenta t the end. veronica lake is a good job here im glad she was in this movie. and its good.",
            "review_date": "2007-01-15",
            "source": "rt"
        },
        {
            "content": "ALRIGHT FILM...WORTH WATHCHING.",
            "review_date": "2007-01-10",
            "source": "rt"
        },
        {
            "content": "I love Veronica Lake, i am always mesmerized from her performances.",
            "review_date": "2007-01-07",
            "source": "rt"
        },
        {
            "content": "This movie is really charming. I love it! It seems strange at first, but it's actually quite funny. It's about a film director named Sullivan who wants to make a picture about \"real life\" and real situations, not some old comedy, like all the other directors. So he sets off, disguised as a hobo, in order to see what it's like to live as a vagrant. However, Sullivan soon discovers that it's going to be harder than he thought to get the experience because the producers and film crew are following him around every step of the way! Soon he meets an aspiring actress, played by Veronica Lake, who ends up joining him as he tries to become acquainted with \"the hard life.\" Eventually, however, Sullivan gets into real trouble, and then he realizes that in hard times like the 1930s, a nice laugh is the best medicine a person can have. \r\nIt's funny and serious ( a good mix) and Veronica Lake's character is really lovable. I don't know what it is exactly that makes it so good, but I just know I love it.",
            "review_date": "2006-12-30",
            "source": "rt"
        },
        {
            "content": "Joel Mccrea was good, as was the humour with a poinant message.",
            "review_date": "2006-12-21",
            "source": "rt"
        },
        {
            "content": "Apocalypto\r\n\r\nOKay I saw [I]Apocalypto[/I] on opening day and I was just totally blown away.  It is an incredible film that just grabs a hold of you and will not let go for its entire duration.  Apocalypto is brutal, relentless and mesmerizing.  Watching this in the theaters is the definition of a true visually astounding cinematic experience.  Everybody seems to want to talk about the violence.  There is much violence but it is not distracting, rather completely essential to the film.  This is a primal story set in an alien cultur.  The violence is a facet of their lifestyle that has become commonplace.  \r\nI love how the film doesnt dwell on the culture of the Mayan civilization but takes a minimalist approach in telling the story of a young village dwelling man and his attempt to save his family.  We get a peek at the great towers and pyramids but we don't get to see it for any longer than Jaguar Paw does.  Further we, like Jaguar Paw, are distracted by the constant sacrafices and beheadings of the prisoners.  Apocalypto barely gives you a moment to breathe, and it certainly doesnt spend time superfluously dazzling you with glorified architecture and practices of an ancient civilization.  I admit that before seeing the movie I expected, or at least desired, an extensive look into civilization and daily life of city dwelling Mayans.  After being treated to this more human story I feel it could not have been done any other way.  The minimalizing of civilization did so much to add to the realism.  The film treats the viewer as one already aware and familiar with the city who would be much more interested in the intense physical and emotional journey of a single man.  Imagine if a film explored modern day New York City with an atitude of wide eyed awe, as though it were the work of some foreign and mysterious empire?  Instead we get countless films that just take the city for granted and focus on the story of individuals.  I love how it is evident that Mel Gibson did not simply want to make a movie about Mayan Civilization; sensationalizing its ancient culture for a modern audience was not his intent.  He had a story to tell and that was the ultimate priority.  Apocalypto is the work of a brilliant storyteller and is an enormous triumph.\r\n\r\n(9/10)\r\n\r\nmini:\r\n[I]Sullivan's Travels[/I]\r\nIn the year of Kane came this delightful and insightful comedy from Preston Sturges about a silver spooned director who wants to taste first hand the reality of American poverty to get material for his first socially responsible picture. It co-stars the electricifying Veronica Lake.\r\nPS The Coen Bros. picked up the name of their film \"O Brother Where Art Thou?\" from ST, it being the title of Sullivan's proposed conscientious film.\r\n(8/10)",
            "review_date": "2006-12-12",
            "source": "rt"
        },
        {
            "content": "Not a very good movie. I wouldnt ever watch this movie again.",
            "review_date": "2006-12-10",
            "source": "rt"
        },
        {
            "content": "I absolutely loved this.",
            "review_date": "2006-11-17",
            "source": "rt"
        },
        {
            "content": "Good, but not a great classic movie like it could have been.",
            "review_date": "2006-11-08",
            "source": "rt"
        },
        {
            "content": "A great, great film. It starts off silly and light-hearted then eventually switches gears and gets genuinely ugly. And if you can take your eyes off Veronica Lake you've got serious problems...",
            "review_date": "2006-11-05",
            "source": "rt"
        },
        {
            "content": "[font=Trebuchet MS]Full review to come.[/font]",
            "review_date": "2006-11-05",
            "source": "rt"
        },
        {
            "content": "\"Everybody needs a good laugh\" pretty much sums up the American way of life, and the point this movie makes about entertainment in general I find to be pretty much dead on.  Those who need, like, and appreciate \"lowbrow\" entertainment are those who are really living life on the front lines; those who protest the conditions of those who suffer, and think that life is too serious for us to laugh at it tend to be those who are living it up.  No other film in my memory so perfectly captures the American entertainment industry as this one.",
            "review_date": "2006-10-26",
            "source": "rt"
        },
        {
            "content": "\"Everybody needs a good laugh\" pretty much sums up the American way of life, and the point this movie makes about entertainment in general I find to be pretty much dead on.  Those who need, like, and appreciate \"lowbrow\" entertainment are those who are really living life on the front lines; those who protest the conditions of those who suffer, and think that life is too serious for us to laugh at it tend to be those who are living it up.  No other film in my memory so perfectly captures the American entertainment industry as this one.",
            "review_date": "2006-10-26",
            "source": "rt"
        },
        {
            "content": "Veronica Lake: yow-zah!",
            "review_date": "2006-10-18",
            "source": "rt"
        },
        {
            "content": "Veronica Lake\r\nGets thrown in a swimming pool?\r\nCha-ching! Sign me up.",
            "review_date": "2006-10-02",
            "source": "rt"
        },
        {
            "content": "To be honest, I was hoping for something slightly snappier. I'd heard that Sturges was a wonderful writer of dialogue and hoped that even where I wasn't enjoying the story, that the dialogue would carry me along. This was the case much less often than I was hoping for. Still, it's an interesting movie, and quite entertaining for watching one time through. There are too many moments where the momentum sort of stops for me to have really loved it, though. It liked to swing from zany comedy to fairly dull drama. Meh.",
            "review_date": "2006-10-02",
            "source": "rt"
        },
        {
            "content": "love the premise! mccrea is like fabulous almost. and lake, well damn, she can look like the ugliest dyke the world ever seen, then turn into a complete babe.. wow.",
            "review_date": "2006-09-25",
            "source": "rt"
        },
        {
            "content": "Hilarious and inspirational. A movie about a hotshot movie producer who sees his movies aren't going over so well the public, so he decides to go on a journey to find out what it's like to a common US citizen. He has an enlightening experience and tons of laughs along the way.",
            "review_date": "2006-09-23",
            "source": "rt"
        },
        {
            "content": "This was my first Veronica Lake film. It's a great one. Very hilarious at times.",
            "review_date": "2006-09-08",
            "source": "rt"
        },
        {
            "content": "This is a classic Preston Surges film. A must see by any fan of poignant comedy.",
            "review_date": "2006-09-06",
            "source": "rt"
        },
        {
            "content": "When I first saw it, I thought the ending was kind of false, not a big bang like Sturges usually is.  I still kind of think that, but with time I've grown to love this more and more.",
            "review_date": "2006-08-28",
            "source": "rt"
        },
        {
            "content": "Possibly one of the best written scripts in all of Hollywood's history.",
            "review_date": "2006-07-21",
            "source": "rt"
        },
        {
            "content": "One of the most well written movies ever and I have always loved Veronica Lake.",
            "review_date": "2006-07-17",
            "source": "rt"
        },
        {
            "content": "love Preston Sturges. lots of fun",
            "review_date": "2006-07-05",
            "source": "rt"
        },
        {
            "content": "Home recordings this summer.",
            "review_date": "2006-06-20",
            "source": "rt"
        },
        {
            "content": "This movie is the reason why I'm in love with Veronica Lake.",
            "review_date": "2006-06-12",
            "source": "rt"
        },
        {
            "content": "A film after my own love for comedies, Sullivan's Travels is an excellent satire.",
            "review_date": "2006-05-29",
            "source": "rt"
        },
        {
            "content": "While a great movie-this does not have the witty dialogue of his other films. But it is one of the influences for  \"O Brother, Where Art Thou?\" so I have to give it credit for that.",
            "review_date": "2006-04-11",
            "source": "rt"
        },
        {
            "content": "[size=6]for full review, click [color=Navy][url=\"http://movierevival.blogspot.com/2006/01/sullivans-travels-sturges-1941.html\"]here[/url][/color][/size]",
            "review_date": "2006-01-07",
            "source": "rt"
        },
        {
            "content": "[i]Los viajes de Sullivan[/i] es una de esas películas sobre cine que tanto nos gustan a los cinéfilos. Preston Sturges, que ya tenía un enorme prestigio como realizador de comedias, se descolgó en su cuarta película como director con este monumento al entretenimiento, a su vez una película entretenidísima, pero que no obstante contiene momentos sobrecogedores. La historia es en principio burlesca: un director de comedias ligeras quiere hacer una película social, y para ello, para aprender lo que son las dificultades, se disfraza de vagabundo y se lanza a las carreteras de unos EE UU más parecidos a los de la Depresión que a los de la Segunda Guerra Mundial. En el camino se encuentra con una inconmensurable Veronica Lake, y acaba aprendiendo un par de cosas sobre su propio papel en la vida.\n \nLADO BUENO: Los actores (la ya mencionada Veronica Lake, un estupendo Joel McCrea, una panoplia de secundarios de primera división...), los giros de trama y diálogos, los homenajes al cine mudo, la ternura y la dureza del mejor Frank Capra (influencia reconocida abiertamente), la reivindicación del entretenimiento, y, sobre todo, momentos como el de la proyección de dibujos animados para un público de presos acogidos por la congregación negra de una iglesia junto a un pantano. Es decir: todo.\n \nLADO MALO: Hombre, como pasa con Capra, hay cierta ambigüedad en cuanto al valor sociopolítico de películas como esta. Si lo que hay que hacer son comedias para que la gente se entretenga y no piense en sus problemas, se menosprecia la labor de cineastas comprometidos. Eso en teoría. Pero, por otro lado, [i]Los viajes de Sullivan[/i] no es sólo entretenimiento. Y si no, que baje Lubitsch y lo vea.\n \nEN TRES (3) PALABRAS: Una completa delicia.",
            "review_date": "2005-11-21",
            "source": "rt"
        },
        {
            "content": "[img]http://www.brightlightsfilm.com/38/38_images/sullivanstrav2.jpg[/img]\n \n[b]SULLIVAN'S TRAVELS[/b]\n[b]Directed by [/b]Preston Sturges\n[b]Stars [/b]Joel McCrea, Veronica Lake, Robert Warwick, William Demarest\n[b]Not Rated[/b]\n \nSly comic drama about a comedy film director who decides to go undercover as a homeless man in order to make a great, important film about poverty in America.  A funny, touching film about the power of laughter.",
            "review_date": "2005-11-13",
            "source": "rt"
        },
        {
            "content": "[i][b]Le Cercle Rouge[/b][/i]\n      This movie was absolutely amazing, it has easily become one of my favorite French films. If you haven't seen this, then seriously, go out and watch it. The acting is very good, the story is excellent and the overall feel is perfect.\n \n Rating: 100/100\n \n [i][b]La Strada[/b][/i]\n     This is my 2nd Fellini film, and once again it has amazed me. The character of Gelsomnia is really memorable. I can't wait too see more and more Fellini films, I'm really getting into him.\n \n Rating: 100/100\n [i][b]    \n    Spellbound[/b][/i]\n    Spellbound is yet another very good and entertaining Alfred Hitchcock film. Ingrid Bergman and Gregory Peck do a very good job, and the story line is very enjoyable. This isn't as good as say, Vertigo or North by Northwest, but it is definetly worthwhile to watch.\n \n Rating: 90/100\n [b]   \n   [i]Sullivan's Travels[/i][/b]\n   This is definetly one of the great comedies of the 40's. The performances are memorable and the story is even more so. I really loved this film, it's easily one of my favorites. I'll probably be rewatching this one over and over again.\n \n Rating: 96/100\n [b]  \n  [i]Eyes Without a Face[/i][/b]\n  This movie is simply amazing. I knew next to nothing about it, but when I was done with the movie I was shocked at how good it really was. This is easily another one of my favorite movies, and will probably recieve multiple viewings.\n \n Rating: 100/100",
            "review_date": "2005-07-20",
            "source": "rt"
        },
        {
            "content": "==Ocean's Twelve==\n Ah ah! George Clooney and friends come back to the screen to remind the viewer that unless you're a celebrity, your life is not worth living. Okay, I'm exaggerating. But Ocean's Twelve is still filled with hollywood circle-jerking and apart from the cast, nothing ever really works in it.\n   \n   ==Evil Dead Trap==\n A dumb japanese reporter is sent a snuff tape with directions on how to get where the killing took place. She decides to go there with a crew of 3 other women and a nerdy dude. Various gory deaths ensue. And two sex scene. And a flying fetus. There's some good gore 'n boobs in there but until the very end, everything is a bit cliche and the characters are too stupid to be believed. But... it has a flying fetus.\n   \n   ==Sullivan's Travels==\n Some director who makes funny movies wants to make a sad, profound and pretentious movie about poverty. But since he doesn't really know what poverty is, he decides to pretend to be a bum for a while. Then he meets Veronica Lake. Up until that point, the movie was hilarious. After that, I couldn't concentrate hard enough to understand the jokes. Veronica Lake... hot.\n   \n Anyway, the movie turns around at some point and the director must suffer real pain for a while. There's a nice twist of atmosphere in the movie from that point on.\n   \n   ==The Life Aquatic With Steve Zissou==\n Hit & Miss experiment on Anderson's part. The hit part is that the basic idea of the movie works, the part where it misses is with the characters, who are never as funny or entertaining as the ones in his previous movies.\n   \n   ==Alone in the Dark==\n Ah, Uwe, you crazy fool. Following House of the Dead is no small feat and while Alone in the Dark has its fair share of incompetence, overall, it's still clearly a better movie. Better special effects, better plot (and basic) continuity, less idiotic dialogues and better acting might make this a disappointment for those expecting another Uwe masterpiece. Note that there are still massive plot holes, an action scene almost worth to be compared with HOTD's iconic center-piece, the worst sex scene I've seen in a long time and plain Uwe goodness.\n   \n The commentary track with the man himself doesn't disappoint though. The man lashes out on the movie industry, Tara Reid, chinese people, every horror movie that has been released in the past two years, dumb audiences, his own movie, IMDB users, Keanu Reeves (he calls him static and flacid (or flat, not sure) and parts of his own crew. The part where he complains that you don't see Tara Reid's boobies is nothing short of awesome too.\n   \n The best part is that, most of the time, the man is completely right. He is spot-on when he says that the movie industry's way of doing things is rotten to the core. He is 100% right when he says that the audience have been going to see the same movie over and over again for the last couple of years. When he's analyzing his own ending, an open-ended one which he preferred to a big, dumb fight against a some super-monster, which the dumb audience might've prefered, he's right again.\n   \n He also compares his own work to David Lynch's, german expressionism (The Cabinet of Dr. Caligari, no less) and Equilibrium. Yup.",
            "review_date": "2005-05-12",
            "source": "rt"
        },
        {
            "content": "[b]THE STRAIGHT STORY\n \n [/b]I still haven't decided whether this is the best David Lynch film or not.  I fell in love with [i]Mulholland Dr.[/i] the first time I saw it, and it's gotten better the second and third time.  It would be hard for a film to surpass it, but if any film can it's this one.  This is better than [i]Umberto D.[/i] and [i]Wild Strawberries[/i], two films that deal with aging and death, and only a step behind [i]Ikiru[/i].  It's that good.\n \n [b]PHANTOM OF THE OPERA (1925)[/b]\n \n I initially had a hard time adjusting to this film because I'm such a junky for the musical.  I've seen it three times live in Toronto, so as this film was progressing, I found myself missing the music and songs I had grown so accustomed to.  That said, this is a phenomenal silent film, and Chaney deserves all the credit he receives.  This also has one of the most memorable scenes from any silent film I've seen yet, and that's the scene on the rooftop when Christine tells Raoul about the Phantom with him perched on the roof above.  It's just brilliant.\n \n [b]KEY LARGO[/b]\n \n This film should be used as an example for great atmosphere.  The hotel during the hurricane is a great setting and served as another character of the film, one that helped generate nearly all of the suspense.  This was a solid film that was bogged down by some bad melodrama and a very slow start.  Even so, it's well worth seeing and Bogart and Bacall are great as always.  The scene stealer, however, is Robinson, who plays the banished gangster perfectly.\n \n [b]HE LOVES ME... HE LOVES ME NOT\n \n [/b]Sure it's a gimmick film, and not only one gimmick but two.  The first was using Tautou in such a dark role, and the second was the two part story.  It played on those two gimmicks, as well as some pretty big and unbelievable coincidences, but it was still pretty damn entertaining.  It should have ended five minutes before it did, as I didn't care for the final \"twist\", and thought it would have been perfect to end during the musical montage a bit earlier.\n [b]\n SULLIVAN'S TRAVELS[/b]\n \n This Preston Sturges film suffered from a drastic and awkward tonal shift.  I was loving this film, almost solely because of the relationship and chemistry between Veronica Lake and Joel McCrea.  They were great together, and when the film abandoned them and put McCrea in his unfortunate position, the film fell flat.  Really flat.  It's a shame, because this could have been up there with [i]The Lady Eve[/i].",
            "review_date": "2005-04-16",
            "source": "rt"
        },
        {
            "content": "Every few years...\r\n\r\nIt seems rare that I discover one of what I would call the \"Great Movies\", but as stated, every few years, one pops up along the road. \r\n\r\nThis time around, it seems that a film I've wanted to see for many years now, and finally rented and watched tonight, has made the cut. This film served as my introduction to Preston Sturges, whom I'm told is one of the truly great comedic directors. \"I wanna make a comedy, Make people laugh. Did you know that's all that some people have? Boy...\" states John Sullivan as his plane carries himself, \"The Girl\" (Lake) and a multitude of doctors, maids, chefs and business advisors from the American south back to Los Angeles. \r\n\r\nSullivan's Travels is a film that doesn't just touch on humanity, it drives it into the ground with a sledge hammer. The underlying motive states that one cannot run away from himself, no matter how hard he tries. Of course, like everything else about the film, by about 70 minutes in (its only 90 minutes long) we are even questioning that- the one thing which is solid in Sully's desired mayhem-filled reality.\r\n\r\nThe real thing about Sullivan's Travels that gets me, hooks me, and seems to keep me locked in is just that basic idea. The dialogue doesn't hurt either, of course. Sturges' one-liners have such classics among them as \"How can I be alone if you go with me?\" and \"Don't keep saying no or I'll poke you in the nose.\" The brilliance of it all really can be described by how much your stomach churns as the second act begins to unfold. The entire first act is spent much like the story of J. Thaddeus Toad (aka MISTER Toad), as Sully takes the audience with him on a wild wanderlust tour of adventure. Nothing seems to be able to quench his thirst for that adventure, until finally he is granted (in a strange way) his wish- to become a part of the story which he desperately wishes to tell. The world he becomes a part of is shocking enough both to him and us, but how he gets there, after the dark side of humanity has all but vanished from the picture's horizon, is the truly shocking moment. Of course, this moment comes at the end of a long montage, which in and of itself is perhaps the truest that cinema has ever witnessed. \r\n\r\nSo much story is revealed simply via music (which also serves as the real informant of Miss Lake's character and her backstory) and image (see: a sign in a shelter reads: \"Have you written home to mother lately\", telling us simultaneously that Sully is headed for even worse trouble and reminding us of Lake's central role in the film, as a comforting mother-type figure for Sully). \r\n\r\nSo, a few thoughts there...This film is seriously one of my new all time favorites. It maintains a sort of screwball, off the wall effect throughout, all the while examining the human condition which Sully so desperately desires to make a film about. Of course, the movie's (and Sturges') best joke is on us: The very film that Sully wishes to make in Sullivan's Travels (suspiciously titled O Brother, Where Art Thou?, begging the answer \"Right Here, in front of you!\") is the film WE are WATCHING, not the one HE is MAKING. Perhaps that really is the funniest gag in the film: and the audience gets that they/we are being duped around the time the horrific incident with the bum occurs (including a nice model shot, a POV from the train...I can just see the PA running alongside the camera with a flashlight to give the effect of the train's headlight on the tracks as it tears toward a \"helpless\" bum; Being that we have just seen him \"kill\" the hero, or atleast derail his dream, and now we are rooting for him, you know you are watching the work of a great filmmaker)\r\n\r\nWow, that got way off track...... Damn train metaphors! I can't help it! It isn't even on purpose!!\r\n\r\nAS I WAS SAYING...! \r\n\r\nWe understand that the film Sully wants to make IS the film we are watching around the time the second act goes full steam ahead...On that note, the reason this is one of the truly great movies is that it manages to keep us totally enthralled. Around 75 minutes in, you can look back at 70 minutes in and say \"wow, I never had any idea I'd be HERE in 5 minutes!\"...And thus you can laugh at all the people who haven't gone through the loop yet, not knowing where they will come out on the other side...And that right there is also the very reason that Sully is doing what he is doing. This film is often called the best film about filmmaking ever made, but it isn't even a film about filmmaking. \r\n\r\nIt's a film about humanity. In the sense that Sully DOESN'T know where he is going to end up, and that is precisely the way he wants it. Stating that you cannot run away from your dreams, because the universe will track you down and place you right back where you belong, all the while not allowing us (along with the main character) to see where that place may be, Sullivan's Travels is one of my new favorites!!\r\n\r\nQuote: \"Waring Hudsucker never did anything the easy way. Every step he took in life was a step up...Except of course his last one.\"---\r\n\r\nMussburger: A Man falls...35 floors. \r\nBoard Member: 34!\r\nBoard Member: Not counting the mezzanine!\r\n\r\n---------THE HUDSUCKER PROXY------------\r\n\r\nLyric: \"Accentuate the positive, El-im-minate the negative, and latch on...to the affirmative. Don't mess with Mr. Inbetween\"- Johnny Mercer. \r\n-------------------------------------------ADIOS ALL",
            "review_date": "2005-02-13",
            "source": "rt"
        },
        {
            "content": "...with these three classic movies!! \n \n \n[img]http://images.amazon.com/images/P/B00006FMDV.01.LZZZZZZZ.jpg[/img]\n \nSpellbound- This is probably the most romantic Hitchcock movie I've seen-- and I love it!! An intriguing psychoanalytic movie with a mesmerizing dream sequence courtesy of Salvador Dali and a memorable score, while Gregory Peck and Ingrid Bergman make an attractive couple!!\n \n \n[img]http://images.amazon.com/images/P/B00005JH9C.01.LZZZZZZZ.jpg[/img]\n \nSullivan's Travels- My second Preston Sturges movie in two weeks!! While I enjoyed [i]The Lady Eve[/i] much more than this romantic comedy, it has some good laughs as well and great to finally see a movie starring Veronica Lake!!\n \n \n[img]http://images.amazon.com/images/P/B00005O3V8.01.LZZZZZZZ.jpg[/img]\n \nThe Ruling Class- Alas, Peter O'Toole has yet to win an Oscar for Best Actor and this was definitely one of his best performances (but so was Marlon Brando's performance as [i]The Godfather [/i]who won Best Actor that year, and so were Michael Caine and Laurence Olivier in [i]Sleuth [/i]who were the other nominees). A hilarious and demented comedy about a man who thought he was Jesus Christ and even has his own cross(!), this seemingly long (at 2 1/2 hours) yet wonderfully paced movie breaks into song and dance and boasts an outstanding ensemble-- definitely a pleaser!!",
            "review_date": "2004-10-18",
            "source": "rt"
        },
        {
            "content": "[b]Shattered Glass (Ray, 2003) - ***1/2[/b]\nThe true story of cheat cheat never beat reporter Stephen Glass. He made up poo and now he must pay! Hayden Christensen and Peter Sarsgaard give stellar performances in this wonderfully written & directed story pertaining to the yeppers that is the notion of journlism ethics. I love this movie. Woooo!!! (This [i]is [/i]the worst mini-review ever)\n \nand...\n \n[b]Sullivan's Travels (Sturges, 1941) - ****[/b]\nPretty much the original Hollywood satire, except for the fact that it isn't really making fun of the movies. It actually states that the main purpose for cinema is escapism. In the film, a young director aims to learn true human suffering, so he can make a film entitled [i]O Brother, Where Art Thou[/i]. Amazingly enough, as an inside joke, the Coen Brothers made this movie that the director aimed to make. Because in the end, he decides that comedy (and people's laughter) is all that some people have. Other Hollywood satires to watch are [i]The Player, Adaptation, Mulholland Drive, [/i]and [i]Cecil B. Demented[/i].",
            "review_date": "2004-03-25",
            "source": "rt"
        },
        {
            "content": "[IMG]http://criterionco.com/content/images/full_boxshot/118_box_348x490.jpg[/IMG]\r\n\r\nAs she was, if I remember correctly, in This Gun For Hire.  However unlike Sullivan's Travels, This Gun For Hire was a tight, hard-hitting story of love existing in the midst of great trials.  Sullivan's Travels is a slight comedy that becomes insulting in the way it tries to handle social commentary.  It betrays the initial idea: that this filmmaker, Sullivan, ought not to make a film about hard trouble because he has never been in hard trouble, and then the film turns into a movie about trouble, and one can see in the mechanics of the plot and such that its creators obviously know nothing about real hard trouble.\r\n\r\nThis is because it contains one of the stupidest, shallowest and fully lame depictions of the chain gang in film.  Sullivan goes through what feels like a cursory amount of pain, just enough to let the picture slide on that account.  Not only that, but even here there still gets to be comic relief.  The scene where they all go to the picture show starts out well, but ends hamfistedly, and quite obviously as a set-up for some hokey revelation that Sullivan will have at the end.  And his revelation?  Oh, we can't really do anything about suffering, but we can make them laugh!  So let's make comedies for those poor shmucks in the chain-gang.  \r\n\r\nApparently, no-one told the crew over at \"I Am A Fugitive From A Chain Gang!\" - because they made a film so powerful in its construction, so moving in its characterization (and a movie that is, frankly, funnier than Sullivan's travels, at times) that not only did it free one man from the chain-gang, but it helped set in motion the wheels of progress to abolish the system altogether.\r\n\r\nSullivan's Travels is a satire of silver-spooned filmmakers with entirely too much sympathy for silver-spooned filmmakers, and obviously made by silver-spooned filmmakers, from the top down.  The stars are babealicious, the humor is slight and innoffensive and the outcome comfortably conservative.  The only reason this film gets as many points as four is because of the charming central romance and a few inspired, beautiful scenes.",
            "review_date": "2004-02-25",
            "source": "rt"
        }
    ]
}