{
    "rating": 9.0,
    "release_date": "1983-02-18",
    "num_reviews": 350,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "Rupert Pupkin (Robert De Niro) is a failure in life but a celebrity in his own mind, hosting an imaginary talk show in his mother's basement. When he meets actual talk show host Jerry Langford (Jerry Lewis), he's convinced it will provide his big break, but Langford isn't interested in the would-be comedian. Undaunted, Pupkin effectively stalks Langford -- and when that doesn't work, he kidnaps him, offering his release in exchange for a guest spot on Langford's show.",
    "reviews": [
        {
            "content": "I didn't dislike it, but also didn't particularly enjoy it. Very strange movie. Uncomfortable at times. Darkly funny and more than a little sad.",
            "review_date": "2023-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty simple story of a psycho a fanatic, and a television star.  Jerry Lewis stars as a Johnny Carson figure, there's an Ed McMahon, and a Doc Severson, the main figures in that era's Tonight Show.  It's amusing, but not great comedy.",
            "review_date": "2023-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Better to be king for a night than schmuck for a lifetime\"\n\nThe King of Comedy is a more relevant film than ever in our current age. I have heard countless times that this film is a \"better Joker\", and while I don't like to compare films in centered reviews I think this is everything Joker tried to be (in some sense.) The dangers of celebrity worship and idealistic values are prevalent all throughout history, and in another Scorsese masterpiece, these themes are explored. Rupert Pupkin is selfish, egotistical, disturbed, and everything else you'd expect out of his character. Robert De Niro gives one of his finest performances playing this disturbed individual, he is consistently on point and fully believable. Sandra Bernhard is also incredible here, as she plays another crazed fan in Masha. Rupert constantly believes he is above her when it comes to his character and his position, but in reality, they are two sides of the same coin. Jerry Lewis has less to do has the comedian Jerry Langford, but he does enough to make you feel sorry and sympathetic for him. From a technical perspective, this film is on point, there are a few strange editing cuts but I was never taken out or taken aback by truly anything in this film. It'd be remiss of me not to talk about the ending, as it is one of the most impactful endings I've seen in any film, Scorsese or not. Whatever your interpretations are of sed ending, it is disturbing and equally bleak. The King of Comedy manages to stay relevant all of these years later, it holds up as a flawless masterpiece that exhibits themes that are as equally disturbing as they are compelling.",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tremendously underrated film.",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scorsese's work style has always been fluid and ephemeral; he entered the apex of his career with Taxi Driver, a film with a strong experimental bent, and with Raging Bull, he developed a distinctively frigid picture style. This period's King of Comedy, however, is a mature work of appropriate discipline, a dark drama of incisive societal satire. \n\nSince the mid-1970s, in response to the social and cultural instability in the United States, Scorsese's creative trend has been social, that is, he uses pictures to convey societal critique. While \"Taxi Driver\" and \"Raging Bull\" were deeply gloomy antiheroics, \"The King of Comedy\" was a humorous take on TV culture's propensity to coddle. Parkin desired to become a TV chat show star when his idol ignored him, his admirers abducted his idol, and he lost the chance to perform on stage in exchange for fame. Parkin is a very neurotic man, and the film employs a great deal of bizarre speech to convey this. Parkin is full of self-righteousness and drunk by his particular fantasy from the outset. This scenario is an abstraction of typical American achievement, and after resting his expectations on his idol Langford, Parkin finally dashed his aspirations. The following insanity of Parkin is representative of the post-Vietnam mentality of the United States, in which the individual's battle against society becomes an extreme and foolish measure. Scorsese's film is on the impact of a monotonous television culture as well as the desperation of individual inhabitants. Scorsese's approach is measured and controlled, and his depiction is amusing without being kitsch. Initially, the characters' conduct is exaggerated, so enriching and exaggerating the social reality. In addition, all the performances are genuine and represent the characters' self-catharsis in this type of atmosphere and character. Parkin sharing the stage with superstars in his vision and receiving the acclaim of the crowd, or Langford confronting the loud inquiry of the daily program and audience abuse, are thus the director's personal portrayal of the actual society. And employs the style in which reality and fiction alternately emerge, so enhancing the comedic meaning with a sort of confused dislocation and the satirical potency. The ultimate conclusion is also a form of comparative irony, in that it is difficult to determine the veracity of this dream, the offered optimism becomes a form of helplessness, and the seemingly mundane reunion is actually concealed. \n\nThe King of Comedy is an extremely somber film in terms of its cinematography. Scorsese utilized the conventional American cinema technique, as he himself stated, with no close-ups and no documentation-type pronouncements. Therefore, the entire film has a fairly consistent, objective point of view. The filming style that Scorsese devised during this era is closely tied to his social subject matter, with Raging Bull focused on the visual setting while The King of Comedy is much more prosthetic. The majority of the presented mirror pictures originate from the creator's own perspective, which not only shows what they have observed, such as following photos on the street, easy switching, and scene browsing, but also pays closer attention to observers' eyes. Mr. De Niro and Mr. Scorsese, fresh off the tough ride of \"Raging Bull,\" especially from the weariness of his tremendous weight gain, continue to perform admirably, and he is as adept at the pompous comedy, even if he overacts in several parts. Jerry Lewis provides a flawless performance, cracks hilarious jokes, and delivers wonderful impromptu statements. The film replicated the television production process of the era in an attempt to make the fictitious show appear as realistic as feasible. \n\nThis film represents the culmination of Scorsese's creative process. Personal motivation and accomplishment will eventually confront roadblocks and bottlenecks when reaching the summit. A somewhat tranquil and mature work might serve as a moderator, therefore defining the style, which is to ponder with personal pictures and critique society.",
            "review_date": "2022-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Martin Scorsese's The King of Comedy was a different movie for the director in terms of subject matter and tone. While the ending is simply brilliant and quite emotionally effective, the rest of the film was tonally indecisive and it only really found its footing in that third act. The performances are strong and the movie is well written in dialogue and script, but it needed a more sympathetic protagonist and a better balanced tone.",
            "review_date": "2022-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot oscillates intermittently and ostensibly between dark \"Scorcese vibes\" and vapid, hollow clownery, but it probably goes with the general ambiance of the movie. There's no need to repeat that the direction is definitely great, but it is worth mentioning that the performances were.",
            "review_date": "2022-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What the King of Comedy lacks in comedy, it makes up for in great performances and even better writing & direction.",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Martin Scorsese's The King of Comedy is one of the most awkward, odd, staggering films I have ever seen yet I enjoyed it. The film tells the story of a mentally ill loner yet sympathetic character (played by Robert De Niro) who just wants to be a famous comedian. The film has some amazing acting from Robert De Niro, Jerry Lewis, and Sandra Bernhard. Speaking of amazing, the cinematography by Fred Schuler was not only amazing but was very nuanced at times. Despite the film being a dark comedy satire showing how destructive groupie culture can bring horrendous consequences within our society, it had some funny moments even for a Martin Scorsese who previously did Raging Bull and Taxi Driver. What should also deserve some praise was the subtle costume designs. The King of Comedy is more than just a film. It's a philosophical debate that involves our own critical thinking. Is it ideal or real? Is it in my mind? Do the ends justify the means? Martin Scorsese did a wonderful job creating this underrated film.",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of the top films in the stalker genre and for good reason. It manages to be endearing and funny without detracting from the seriousness and depravity of its subject matter. In many ways this is the movie that Taxi Driver wanted to be, being much clearer about its characters' motivations and more coherent overall. \n\nClosest comparison: It's like Joker (2019) by way of Taxi Driver.\n\nSetting: Corporate Drama\nPlot: Stalker Thriller\nTone: Awkward Dramedy",
            "review_date": "2022-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With Rupert Pupkin (Robert De Niro), Martin Scorsese profiles yet another social outcast, a man living in a world where he is unable to differentiate between reality and fantasy in his quest for fame and fortune.  While not as violently intense as many of his films, Scorsese's The King of Comedy continually ratchets up the tension as Pupkin relentlessly pursues talk show host Jerry Langford (Jerry Lewis) in an effort to get scheduled on his late-night show.  Thanks to a tight script and solid acting from De Niro, Lewis, and Sandra Bernhard, who gives a creepily manic performance as Pupkin's accomplice, The King of Comedy, while not up there is Scorsese's best films, is a solid and thematically challenging offering.",
            "review_date": "2022-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Niro excels at making you cringe the whole way through. The movie provides interesting insight into the pitfalls of fame (Stalkers), and the different lifestyles of the haves and have nots.",
            "review_date": "2022-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think that Scorsese was too far away with this psycho-crazy comedy. A experience rather disturbing. 1/10",
            "review_date": "2022-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may be the unrecognized gem in the Martin Scorsese - Robert De Niro catalog of collaborations",
            "review_date": "2021-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Deniro's acting is a special gift as always to be appreciated. His relentlessness in this film gets under your skin but you still can't help but like the guy in a way! This movie is a very easy and quick watch and I would recommend it for those who liked Taxi Driver as well! Now I see where else Joker got some of its material from!",
            "review_date": "2021-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the single most significant film to demonstrate the range of both De Niro as an actor and Scorsese as a director, so distinct is The King of Comedy from rest of the output of both, particularly in their early careers. \n\nPeople remark about how spot-on Paul D. Zimmerman's script was in predicting the lure of media and the forgiveness that recognizability alone inspires, but to me there is one particular aspect of the film and television industry that this film taps into - the insertion of themselves as a 'friend' to the viewer. TV wanted to make themselves hard to shake, so they reached out into the living rooms of their audience and sat themselves down at the dinner table. The King of Comedy feels so unnerving (and works so well; it should be called 'Secondhand Embarassment: The Movie) because it focuses on an individual who has taken that affection and returns it with confidence and gusto. There's a fine line between stick-to-it-iveness and a disturbing inability to understand social cues, a breaking of unspoken moral codes that people don't anticipate and are severely put off by, that makes the film effective.\n\nGreat performances (from De Niro and particularly Bernhard), a sense of delicious, darkly comic irony, and a prescient social understanding make The King of Comedy an unexpectedly brilliant piece of work, particularly in light of the stark differences to other projects that the big names had been attached to. (4/5)",
            "review_date": "2021-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absurd cringe comedy from dramatic star Robert De Niro and crime auteur Martin Scorsese!\n\nDirector Martin Scorsese's black comedy The King of Comedy (1982) is a thoroughly misunderstood gem of biting satire and psychological breakdown of celebrity stalkers and desperate entertainers. Scorsese laughs at the cruelty and insanity of the chaotic entertainment industry from ultra fans frothing at the mouth of average late night hosts to the stalkers who have no boundaries or respect for their idol's privacy, time, or opinion. \n\nAll Robert De Niro's  Rupert Pupkin wants is validation from his pathetic, worthless existence and Scorsese clearly understands that this character is all cringe, horror, deception, and potential for violence. The King of Comedy is quite funny in how absurd every scene is, to the point of Scorsese directing vividly ridiculous surrealist dream sequences with Rupert's wish fulfillment, as the joke is always on De Niro's Rupert Pupkin. Scorsese ensures The King of Comedy is entertaining and stylish with a directorial knowledge Todd Phillips' Joker only wishes he could inspire such originality and slickness.\n\nWriter Paul D. Zimmerman's script lambasts Hollywood, late night television programs, obsessive celebrity stalkers, failed stand-up comedians, and rabid fans whose celebrity worship borders on mental illness and personal delusions. Breaking it big in show business requires years of hard work in smaller venues to establish yourself, being born rich, or having connections who can pull strings to streamline your path to stardom. The King of Comedy hilariously provides an alternative path wherein you can kidnap and blackmail your way to fame with godspeed if you're psychotic and persistent enough. \n\nI love how Zimmerman's writing shows how pathetic, desperate, lonely, impoverished, forceful, and obnoxious Robert De Niro's funnily named Rupert Pupkin is at all times. You never think this guy will be genuinely funny in De Niro's neat impression of Rodney Dangerfield in The King of Comedy's finale comedy stand-up routine for 10 minutes. De Niro blasts his way through conversations with incessant talking and pushing his awful comedy towards anyone who will listen one way or the other. It's a neat parallel to Travis Bickle's social awkwardness in Taxi Driver with Jake LaMotta's brute bullying capabilities in Raging Bull. Robert De Niro truly can act in any role, even inspiring Joaquin Phoenix' Joker in combination with Heath Ledger's Joker.\n\nEditor Thelma Schoonmaker clearly has had a profound impact on Martin Scorsese's already fearsome directorial prowess. She even produced The King of Comedy! Her startling apt cuts keep The King of Comedy progressing steadily for 109 minutes into Rupert's descent into ruthless cunning and a hilarious crime spree. I love how she splices Scorsese's dream sequences with Rupert's daytime delusions seamlessly, so that you don't even realize what you're watching at first.\n\nRupert's socially awkward conversations with Jerry Lewis' deadpan and visibly frustrated late night host Jerry Langford are so funny as Thelma rarely cuts the cringe dialogue and creepy interactions Rupert has with everyone. Jerry Lewis is excellent as you can see him take each moment seriously with this unsurprised nonchalance and clear fury at how Jerry Langford's fans never let him rest in peace.\n\nSandra Bernhard steals the show as the relentless stalker Masha, who has deluded herself into falling in love with Jerry Lewis. Bernhard's blaring yelling at Rupert's repulsive ineffectiveness in properly getting Jerry's attention is a delight to watch. Her every line is killer and only she could have pulled off that cringe kidnapping seduction dinner scene so funnily. I always thought she was hilarious in Hudson Hawk too as the villainess alongside Richard E. Grant. Diahnne Abbott is believable as the tired bartender sick of Rupert's cringe advances and horrified by his intrusive behavior. I liked Martin Scorsese's cameo as one of Jerry's crew with his off the cuff manner.\n\nFred Schuler's striking cinematography uses wide shots to show just how few people really find Rupert Pupkin funny and how isolated he is in his life and mind. All of Schuler's centered framed shots are so beautiful. The King of Comedy has visually held up wonderfully. From these on foot chase sequences that are shot down real New York streets as the camera flies by characters to the quiet little moments in Jerry's office with his secretaries, The King of Comedy lets you in on the joke at all times.\n\nBoris Leven's production designs play around with Rupert's colorful home show set to Jerry's dark blue late night set with a strange aesthetic that makes The King of Comedy all the stranger and more fun. Edward Pisoni and Lawrence Miller's art direction matches seas of audiences laughing at and along with Rupert to all these imaginative scenarios of delusions from Rupert. George DeTitta Sr. and Daniel Robert's set decoration looks like real homes and sets, while the office is curiously cold and distant like the world of Hollywood was never in Rupert's grasp to begin with really.\n\nComposer Robbie Robertson's score is quite playful and silly, which fits perfectly for the chaotic and insane nature of The King of Comedy. Dick Vorisek, Frank E. Warner, and Tom Fleischman's sound design is quite creative as audience voices will echo with laughter as disembodied voices from beyond the camera to in the room audiences bursting with hysterical chuckles at Rupert's jokes. Richard Bruno and William Loger's costumes are hideous and unflattering on every single person and that's the joke. Philip Goldblat's make-up is quite realistic as each person looks normal and sweaty.\n\nIn short, The King of Comedy is worth a watch only if you can stomach super cringe-inducing comedy and have a bit of a dark sense of humor.",
            "review_date": "2021-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I'm being honest, I thought it was just ok. I suppose it was one of the more adult appropriate PG films I have seen in a while, but I just didn't feel very much of anything while I was watching it. Bernhard was truly repugnant, and De Niro was pathetic, but I honestly wanted to see him crash and burn, so I found the ending very unsatisfying, and unrealistic to say the least. I wouldn't be giving this film such a hard time, but I have very high expectations. It is considered by many to be some of Scorsese strongest work, but I didn't really even feel his influence. It wasn't bad, but I won't be recommending it.",
            "review_date": "2021-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another De Niro-Scorsese project but this time they offer a biting satirical black comedy that builds tension and pokes at celebrity worship.",
            "review_date": "2021-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film does everything in a good way, but there's nothing fabulous, except a couple of moments in the story.",
            "review_date": "2021-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very dark satire that hits straight to home, although it's a hard and quite uncomfortable ride; De Niro can be seen at his best, and Jerry Lewis surprises by playing himself - and he's not a nice guy!",
            "review_date": "2021-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why is every Scorscese film either a gangster film or Deniro being a weirdo. All of these movies are dated…",
            "review_date": "2021-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Niro and Jerry Lewis were good, but it suffered from a paper thin plot and went nowhere. It's by far my least favorite Scorsese film.",
            "review_date": "2021-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh my this movie us just BRILLIANT \n\nI expected it to be more comedic but it had this very grim side to it, like I was cringing but not from laughing, but from feeling like someone was gonna pull a Misery here and just flat out commit a kidnapping (lol). I love this sooo much like go watch it Robert De Niro is just so good here! Actually everyone is so good here!!",
            "review_date": "2021-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that bombed on release but gained more value in an age where the talentless feel entitled to their 15 minutes.",
            "review_date": "2021-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A witting ending and a great performance from De Niro makes Scorsese's slow burn thriller a classic.",
            "review_date": "2021-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A marvellous dive into an obsessed character mind depicting his day-to-day motivations and longings. The picture is stylishly produced and brilliantly performed by De Niro and Lewis.\nDe Niro's character resembles his character from Taxi Driver, though it is more a development or a look from another angle.\nThe fans of Joker (by Todd Phillips) would also make the film curious cause it has obviously influenced the former one.",
            "review_date": "2021-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really underrated, in my opinion. De Niro is at his best and Scorsese does what Scorsese does. Even though the film is almost forty years old, there is still so much in it that connects directly to today's society, and specifically celebrity culture. Special mentions to Sandra Bernhard and Jerry Lewis for buying in well and adding to the unsettling, bizarre nature of the entire film. I think that, despite the title, the film only produces comic elements in a focussed backdrop of very real, intentional unpleasantness. Maybe it isn't immensely quotable and no one particular scene will stay with you forever, but the film works so well as a unit and is an absolute must-see. A true classic.",
            "review_date": "2021-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's unique, funny, and entertaining, but it could have been clearer what was being dreamed and what was real in one or two places. The story was creative and covered the topic of celebrity stalking well. The characters were believable, and the acting was solid. The pacing slowed a bit at times, but it was a suitable length. Finally, the cinematography, visual effects, and soundtrack were decent. Fair play to Scorsese.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a unique story but it takes forever to get to the only mildly interesting part. The ending was unexpected. But I don't think this one has aged very well. I think it's overrated by so many people because it has Scorsese's name on it.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful fun filled film with great ending.",
            "review_date": "2020-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the film is complex and interesting with one of the best twists in cinema, in addition another interesting point is the flexbacks that occurred in the film, which makes us question whether it is imagination or reality after pupkin's arrest.",
            "review_date": "2020-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movies SEEMS like it's going to be boring. But it's not!! There is kidnapping and scheming and Robert De Niro.  He holds a talk show hostage so he can tell terrible jokes on air. But you feel bad for him!!! And his mom tbh. In some ways it made me think of other more intense movies like the Truman Show or Requiem for a Dream. But it wasn't really like those movies at all. Five stars for being interesting & weirdly relevant now!!!",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those brilliant forgotten movies in cinema. King of Comedy walked so Joker (2019) could run.",
            "review_date": "2020-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The King Of Comedy is an alright movie. I know that Joker took a lot of inspirational from this but I honestly prefer Joker over this.",
            "review_date": "2020-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most underrated Scorsese's movies. I don't think De Niro should've won, but at least he deserved a nomination. Jerry Lewis is great too. Rupert Pumpkin is one of the best characters De Niro played. A masterpiece.",
            "review_date": "2020-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliantly clever movie which I found hard going at times. Jerry Lewis was an excellent clown in his partnership with Dino. But, as a serious actor, he lacks charisma. de Niro perfect as always.",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is absurd and unnerving. I'm not sure if it's more of a time-capsule or a prophecy with the way it deals with its subject matter of celebrity, crime, media, and madness. There's a lot to think about here and while some of it is funny a lot of it is uncomfortable to watch. A lot of talent went into this movie and it shows.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An often Misunderstood gem that is among  its director's best.",
            "review_date": "2020-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Scorsese movie about a wannabe comedian on the fringes of society",
            "review_date": "2020-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now I know where did Joker gained influence from. Anyway, The King of Comedy is a good film that has good performances from Jerry Lewis and Robert De Niro, amazing direction from Martin Scorsese and the unique screenplay. Despite gaining a box office flop, the movie did well by movie critics. As for me, this movie really show the issues with celebrity worship and mental illness. Overall, The King of Comedy shows us that Comedy is King.",
            "review_date": "2020-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining, very nicely made film about a man desperate for fame.",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, it's not joker; but it's funny and freaky in all the right places, which isn't something I say often about Scorsese. 3.75/5",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whatever you say Pupper...",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crime does pay kids. Thoroughly entertaining and some brilliant acting from De Niro who has rarely been better and an outstanding turn from Sandra Bernhard. Great idea for a film and excellently pulled off.",
            "review_date": "2020-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a GREAT Movie that often gets overlooked!  What a performance by DeNiro as a crazy stalker.  I had never seen this movie until today and I'm very glad that I watched it.  Joker definitely borrowed a lot of this story.  A very underrated Martin Scorsese film that isn't about gangsters.  If you've never seen this film...watch it!",
            "review_date": "2020-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Underrated Scorsese flick. Unnerving inspiration for Joker (2019). 7.75/10.",
            "review_date": "2020-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thrilling, funny and inspiring. This classic is not just an exceptional character study but a revealer for the hard truth about life.",
            "review_date": "2020-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting by Robert De Niro but the second half is more electrical. Martin Scorsese in his quest  to show the deranged mental status of the lead players prolonged the first half a bit too long.",
            "review_date": "2020-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. This is, to me, Robert De Niro's most underrated performance of his career.",
            "review_date": "2020-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances around but Jerry Lewis stole the show.",
            "review_date": "2020-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall, I really enjoyed The King Of Comedy for many reasons, but mostly for its outstanding performance from Robert De Niro who plays a man with a dangerous obsession. Despite the title of the film, it's a film that doesn't deliver the laughs, instead delivering a deeper and darker level of emotion and entertainment. The film also still holds up really well. If you've never seen The King Of Comedy, please do so- it will be a memorable and an unforgettable experience.  9.7/10 - Walkden Entertainment",
            "review_date": "2020-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a pretty little gem. Scorsese tells gorgeously the story of a man (played by a hilarious De Niro) trying to get into the show-business at any cost. The viewers are quickly tempted to dismiss this character as a delusional loser, obsessed with his idols, but there is a difference between him and the other members of the quirky stalker community: his ultimate goal is not famous people, but fame itself. The line between reality and imagination becomes more and more blurred as we delve into the mind of our hero, to the point that the ending scene is most likely his fantasy. But what's the difference? His dreams so far all came true, and that last one is very likely to follow the same fate.",
            "review_date": "2020-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While The King of Comedy saves its personal characterisation of Rupert Pupkin till the very end, Robert De Niro gives one of (if not, arguably his greatest) performance in the lead role.",
            "review_date": "2020-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This might be my favourite Scorsese-De Niro collaboration. Top tier stuff - brilliant from start to finish.",
            "review_date": "2020-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its good i reallt recomend",
            "review_date": "2020-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Abit unsettling in a way. But it address an important part of our pop culture. It's not Scorsese's best film. I preferred Taxi Driver, myself. But this is worth a watch. Especially if you liked Joker (2019)",
            "review_date": "2020-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a bit darker and stranger than the typical Scorsese flick. Still good",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Scorsese story, Robert De Niro came again succes playing another role that i never thought he can play",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite films ever.",
            "review_date": "2019-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This world is created by crazy people. \nBtw, the joker is similar to this movie，the murmuring mom and the fantasy poor guy",
            "review_date": "2019-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, but not a pleasant one and I won't be watching it multiple times in the future.",
            "review_date": "2019-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You won't find many crazed fan films of this caliber. Scorsese tried something different here, a risky venture if you will that stands out of his usually grittier projects, and he nailed it. This is a fascinating character study about the epitome of a psychotic fanboy.",
            "review_date": "2019-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tonight,\nRobert Deniro is King of the movie as a deeply disturbed yet interesting narcissist. \nA movie makes an interesting point about celebrity culture. \nAnd Scorsese makes another well-directed and interesting movie, that is somewhat bland throughout its run time, but manages to pick up in the final act.",
            "review_date": "2019-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another Scorsese masterpiece and absolute must see. Robert De Niro still has this incredible presence. Though more subdued than in taxi Driver there are clear parallels between Rupert Pupkin and Travis Bickle, both men longing for fame, recognition and respect in a world that seems to ignore them. Both have similar delusions of grandeur and think the world doesn't recognize them enough.\nAnd aside from De Niro, Sandra Bernhard is absolutely brilliant as the id driven fanatic of Jerry Langford. Her dinner scene monologue with Jerry Lewis is absolutely jaw-dropping. \nI cannot recommend this movie enough.",
            "review_date": "2019-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely great movie!Shows a bit of the ideia that many of us while wanting so much our dream's we start to imagine a lot of scenarios and when we meet our idol we sometimes go over the top and start over talking. We all imagine ourselves sometimes getting acknowledgement from everyone from our past and present that we want their respect and love from.Of course in this movie sometimes those imaginary scenarios pass on to real life but that is the Hollywood part of this movie.For people seeing this movie in this new generation it may seem \"normal\" the obsession over the celebrity but back in those days it was starting to show this love over celebrities.",
            "review_date": "2019-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Niro plays gamesomely in a movie who\nTakes itself too seriously despite being  actually totally empty and devoid of any emotions",
            "review_date": "2019-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super well made, might be Scorsese's most underrated film",
            "review_date": "2019-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film to rewatch. In a movie where what you see may not be the whole truth, Robert De Niro plays the role of Rupert Pukin a comedian who tries to make it big in peculiar ways. The show takes the audience on a journey and doesn't disappoint. The king of comedy is a classic and has aged fairly well with time, unlike other movies.",
            "review_date": "2019-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a classic, loved it! VERY underrated!",
            "review_date": "2019-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My personal favorite Scorsese movie. De Niro's spot on performance is eerily funny and you sometimes don't know whether to root for his character or not. Ahead of its time in terms of obsessive fans, in this day in age it's easier than ever to use social media and technology to stalk an idol. ",
            "review_date": "2019-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not the best Scorsese film,but it sure as hell is one.If you like Scorsese and black comedy, chances are you'll find at least a little bit of enjoyment in this film.",
            "review_date": "2019-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic and fantastic twist. Love this classic Scorsese movie. ",
            "review_date": "2019-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Criminally underrated when it comes to Scorsese´s films, De Niro brings alive yet another isolated, complex and captivating character really reminiscent to his Taxi Driver´s one. ",
            "review_date": "2019-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decided to watch this movie to prepare for the upcoming \"Joker\" movie since I heard director Todd Phillips said there's a lot of inspiration from it in the film.  I did not regret my choice, this movie was great! ",
            "review_date": "2019-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just saw the most recent Joker trailer with a cutaway to Deniro onscreen in an almost veiled homage to this fabulous, disturbing movie that makes it almost too easy to have compassion for Rupert Pupkin and disdain for Lewis' Jerry Langford.",
            "review_date": "2019-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I should be worried, all I do, all day, is picture myself being interviewed by Conan and pampered by the audience.\n\nThe King Of Comedy\n\nScorsese has once again got hold of a people pleasing concept. The film endorses itself, comically tragic and famously opinionated, in the sense that the film speaks the inner voice of the common man. And it is a timeless classic. Perhaps this is why, even decades later when Todd Phillips commands the very subject in Joker, the topic feels fresh and is trending like any other hip and happening theme in this post social media era. But what's to note here, is that the fame has always been this cryptic mythical entity that everyone wishes to crack in a night. The hangover is too heavy to be shaken off by someone or something from the outside.\n\nAnd this is what the first half of the director Martin Scorsese's ambitious and controversial project runs on. And it is a very slow and steady procedure that he wants us to go through, almost like a therapy. Even the dream like sequences where Rupert Pupkin played by Robert De Niro assumes only the ideal situation. In those scenarios too, that are actually installed to speak more about the characters and its ideologies, De Niro is repetitively whipped by the dose of reality to see the line differentiating right and wrong.\n\nAnd his entire character is based on that blurred factor that he is incapable of recognizing. Even in his stand up bits, the one-liners and the stories he mocks is just showcasing the sadistic outward look that he has towards his own life. And that is why we feel empathetic towards The King Of Comedy. For he is self obsessed. He doesn't account other's life and hence also doesn't have a sadistic approach towards their priorities or importance. This thrown penny that is seen in De Niro's panache is hungrily grabbed by us, it represents that tiny part of our life that we all dream of.",
            "review_date": "2019-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Martin Scorsese and Robert De Niro come again with a more lighter, and thought-provoking tale, making The King of Comedy worth the watch",
            "review_date": "2019-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie, and for years, I put it off because it was treated like Scorsese/Dinero's red headed step child. Really enjoyed on early 90s New York this movie is. Plus, seeing Dinero play essentially an early 90s Michael Scott was actually interesting. Very interesting film. Good concept, good execution. ",
            "review_date": "2019-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that focusses on themes such as celebrity worship or media culture within the United States. DeNiro gives a superb performance as a delusion nobody who idolises celebrities to an unhealthily obsessive point. His biggest idol, comedian Jerry Langford, inspires him to become the new \"King of Comedy\" and a series of ultimately sad and bizarre begin to unfold after their initial meeting. Fantastic film. Worth your time. ",
            "review_date": "2019-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can say with confidence that this is the best satire that I have ever seen. Now, Starship Troopers (1997) and American Beauty (1999), unfortunately tainted by Kevin Spacey, would also rank highly on my hypothetical ranking of satirical films but I think that The King of Comedy nails the entertainment industry and people's relationship to celebrity in a way that few other films do. After having seen Raging Bull (1980) I thought that there was no way that De Niro could top that performance but here he is even more hopeless and desperate and yet in some ways the perfect embodiment of the American dream, he is very different but equally good in this role and the lack of attention that this film receives is criminal.\n\nRupert Pupkin, Robert De Niro, is an aspiring stand-up comedian obsessed with talk show host Jerry Langford, Jerry Lewis, whom he is able to meet one night after a taping of the show. His obsession only grows worse and he continuously pursues Langford in the hopes of appearing on his television show despite the star's obvious lack of interest. Helping him in his pursuit is his wealthy but equally mentally unstable friend Masha, Sandra Bernhard, who harbors romantic feelings for Langford. He is unfettered in his pursuit and continues chasing his dreams through a series of increasingly more terrifying attempts but his horrible acts appear to have only positive outcomes, at least from what we see which may or may not be his delusions.\n\nThe reason that it worked so well for me is that it was able to make you feel intensely uncomfortable but also to see how little people care about the person behind the celebrity and how willing people are to commit horrible acts just to get a piece of it. Unlike The Player (1992) which left me utterly cold I was horrified throughout the running time of this film as we see an innocent man get tortured so that a maniac can have one night of stardom. The scenes in which De Niro is fantasizing about serving as a talk show host alongside Langford are particularly terrifying as the dialogue resembles the tone of a late night talk show and the various gags that Pupkin imagines feel as though they could be ripped right out of the Late Late Show. His final comedy routine is also perfectly tailored to the style of a late night comic on a family friendly TV show, his jokes aren't particularly funny but they are referential and they sound like something that Jimmy Fallon, ugh, would spew. The audience eats up this routine however, in the way that middle Americans appear to love Fallon, and Pupkin is a strange success a fiction that doesn't feel so far from the truth. This â~believability' allowed me to cringe throughout but also to understand what the film was trying to say about the shallowness of the entertainment industry.\n\nAll of the performances are just wonderful and as I have already mentioned how great De Niro I will now expound on why Bernhard and Lewis are just terrific. Bernhard plays a completely mad woman and she makes you believe it, when she is discussing her mental illness with Langford we get the sense that this is a woman with many, many mental issues and that Langford is just a person she can take her issues out on. Her rambling style of speech, slurred words and ability to jump from being in a fevered frenzy to being eerily calm lend her character a fearsome unpredictability and make her a worthy sidekick to De Niro. Lewis is great as a pragmatic, scared but successful comic and you feel sick for him as a crazed individual chooses him as a victim. He is particularly good when being tortured by Bernhard and De Niro as his bespectacled eyes betray his fear. Diahnne Abbott, De Niro's wife at the time of filming, is also good as De Niro's girlfriend who is terribly humiliated when she is brought to Langford's holiday home under the pretense of a vacation then informed that her boyfriend is not wanted and her shock at his success later in the film mirrors the audience reaction. It is again a travesty that De Niro and Bernhard received almost no attention for their brilliant work in this film.\n\nI would certainly recommend this film, not because it is fun but because it really comments on the nature of fame and the fickleness of the industry and the public at large. Pupkin's last line in his stand-up routine \"Tomorrow you'll know I wasn't kidding and you'll all think I'm crazy. But I figure it this way: better to be king for a night, than a schmuck for a lifetime\" is a criticism of the dangerous ideology of the entertainment industry itself. This is his fourth greatest film because it analyses existential, social and political issues whilst being terrifyingly deadpan.",
            "review_date": "2019-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was great.",
            "review_date": "2018-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic DeNiro and Scorsese collaboration",
            "review_date": "2018-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best film Scorsese has made so far",
            "review_date": "2018-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unsettling, underrated and for a very long time misunderstood Scorsese film that benefits from excellent performances by De Niro, Lewis and Bernhard, and it is its cynical ending that elevates it to the level of brilliant satire about the power of sensationalism in our times.",
            "review_date": "2018-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great film with a nice performance by Robert De Niro. This is a dark comedy though and not an all out comedy. Scorsese inputs his styles and let De Niro do his job as the bumbling simpleton. Out of Scorsese's filmography many tend to oversee his mid 80s work like After Hours and this film. These are examples of the skills of a great filmmaker. His partnership with the lead actor was at its height here.(An underrated Martin Scorsese film).",
            "review_date": "2018-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scorsese took some risks to turn a familiar concept that is actually impossible to work on screen, or at least that what I thought.\nA lot of familiarity has been revealed at the first half of the third act of the movie along with some clichéd dialogue. Also, the pacing slowed down a bit at the very beginning of the third act. That being said, these flaws didn't bother me so much as the rest of the third act was brilliant!\n\nThat's by no means what I expected. I thought it's kinda light comedy, but it turned out to be a very subtle dark comedy. Still consider it a more light-hearted version of Taxi Driver! Very under-appreciated, though. \n\n(8/10)",
            "review_date": "2018-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First half funny, second half creepy. Scorcese worst film I've seen.",
            "review_date": "2018-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst Scorsese film is worth the time. If it doesn't congeal into a satisfying whole, and this one doesn't, there are  the performances, the camera work, the sound editing that knocks you out of your seat. Then there's the street scenes, loads of NYC candid 'You are there\" shots just for fun. Oh and performances, De Niro of course and yep, Jerry Lewis. The most engrossing scenes are the fantasies, where Rupert Popkin, Pupkin, Pumpkin, Popknick, a running and funny gag where receptionists keep getting his name wrong, in these fantasy scenes Lewis shines, shows us some acting chops hitherto un-mined. Like I said worth the trip even though the outcome is puzzling.",
            "review_date": "2018-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Verguenza ajena\": this is a beautiful spanish term that everyone felt in his / her life, but there is no literal english translation unfortunately. It's when you feel ashamed for something you are witnessing, and not doing. This is the fuel that makes \"The King of Comedy\" run for the first part. Don't worry, it evolves too but I won't tell you how, just watch it because it is a really good movie! \"Dog Day Afternoon\" meets \"Taxy Driver\". Might not be as good as them, but it comes pretty close!",
            "review_date": "2018-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The King of Comedy is strange, but I guess that's what happens when you have Martin Scorsese directing a film with a more humorous tone. Robert De Niro is absolutely irritating as the persistent Rupert Pupkin, and yet it's his performance that drives the film forward. And who knew that Jerry Lewis could play the straight man in a comedic movie?",
            "review_date": "2018-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Coming to the conclusion I don't like the early Scorcese/De Niro stuff... All a bit predictable, if prescient, and the acting outside of the leads was awful!  Think it may be some time before I build up the courage for Taxi Driver.",
            "review_date": "2017-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the cannon of Martin Scorsese films, this one stands apart. The film does feature Robert De Niro in the lead, is set in NYC, and includes many of Scorsese's regular behind the camera crew members, but in terms of visuals and drawing attention not the camera, \"The King of Comedy\" represents Scorsese at his most subdued. In this film, Robert De Niro creates one of his most fascinating characters with Rupert Pupkin,  a obsessive fan of late night talkshow host Jerry Langford, a wickedly good Jerry Lewis. Pupkin stalks Langford after shows, sets up his own talkshow set in him parents' basement, and is self deluded enough to believe he has a real personal relationship with Langford. The story is a serviceable one for a comedy, but where Scorsese and the cast shine is in the darkness they bring to the comedy. Taken on it's own, the script is not necessarily that dark and in lesser hands might have been a light breezy comedy. De Niro makes Pupkin a likable character, even if it does appear that he must be mentally ill, and never plays him for broad or overt comedy, yet delivers what is at times a hilarious performance. Jerry Lewis gives what has to be the best performance of his career as Langford, a character that I'm certain allowed him to tap into his personal experience with obsessive fans, balancing his need to be kind to his public while also protecting his own privacy. It would be easy to write Langford off as the villain of the piece, the guy who continually shuns Puplkin and won't give him his big break, but Lewis brings a reality to the part where you feel bad for him and almost understand why he's a bit of a jerk when having to deal with crazed fans. The scene were Langford walks down a busy NYC street and politely greets fans, says canned witty retorts he's said a million times before, and in the end really just wants to get where he's going is pure cinematic magic. When the one woman at a phone booth begs him to speak to her nephew Morris and Langford politely says he's running late, how quickly she turns on him saying, \"You should only get cancer! I hope you get cancer!\" is hilarious and at the same time extremely sad for Langford, who has likely experienced this many times before. While Scorsese makes his visual presence not as pronounced in \"The King of Comedy,\" his sensibilities still pervade this a dark comic classic.",
            "review_date": "2017-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In King of Comedy we see how much someone can become obsessed over a celebrity, either you want to have them or be them, in this amazing movie we see how much further a person is willing to go to see his dreams come true even if that involves kidnapping the person you admire so much. A great performance by De Niro in one of Scorsese\u0092s most underrated films.",
            "review_date": "2017-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant , insightful \" black comedy \" with Jerry Lewis as the late nite tv icon and Robert deniro as the delusional would-be successor to the throne .\nAll great performances ...excellent screenplay . Here was Jerry's chance to win an oscar. But ....no.",
            "review_date": "2017-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It seems hard to find the satire without a laugh track; many of the quirks of these characters hit close to home. Though many will never admit it.",
            "review_date": "2017-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GOOD, OLD-FASHIONED, ALL-AMERICAN FUN - My Review of THE KING OF COMEDY (5 Stars) \n\nSince Jerry Lewis died on August 20, it seemed only fitting to rewatch the 35th Anniversary screening of THE KING OF COMEDY on Labor Day.  Having been raised watching him on the Muscular Dystrophy Telethons every year on that holiday, I thought it fitting to honor him by revisiting what I feel is his greatest acting achievement.\n\nInitially a box office bomb and largely ignored by critics, this prescient film directed by Martin Scorsese and written by the late Paul D. Zimmerman, a former NEWSWEEK film critic, is right up there with NETWORK and A FACE IN THE CROWD in predicting the onslaught of crazy or untalented people achieving fame and power. Sound familiar in this age of social media stars and Presidents?  I also think it's Scorsese's best film and Robert DeNiro's greatest performance to date.  It also brought us a blazing, unforgettable performance by Sandra Bernhard in her debut.  Did I also mention it's one of my favorite, squirm-inducing, funcomfortable, funny/sad anti-comedy comedies of all time?  Since I wasn't in the game of writing movie reviews when it was first released, I thought it appropriate to take a stab at it now.\n\nDeNiro plays Rupert Pupkin, an aspiring standup comic who lives with his mother and makes money as a messenger in NYC.  He idolizes Jerry Langford (Lewis), a Johnny Carson-esque late night talk show host, and dreams of a slot on his show as a ticket to instant stardom.  God forbid Rupert should pay his dues and go to every open mic night available.  Instead, he practices his appearances on the show in his basement, complete with cardboard cutouts of Langford and guest Liza Minnelli.  Every now and then, his daydreams get interrupted by the voice of his mother (a hilarious cameo by Scorsese's own mother), instantly reminding us of Rupert's place in the world.  We don't know yet if Rupert is talented or not, in fact we won't know until a scene near the end, but his corner-cutting entitlement predated so many Hiltons, Kardashians and Trumps.  \n\nWhen we first meet Rupert, he's outside Langford's studio along with a throng of autograph hounds.  When Jerry enters his limo, a crazed fan jumps in after him.  That would be Masha (Bernhard).  Langford, adept at clocking a stalker when he sees one, immediately gets out and comes face to face with Rupert.  From inside the limo, the frame freezes on Masha's hands pressing against the window, aching to make contact with Jerry.  Ray Charles' \"Come Rain Or Come Shine\" plays on the soundtrack:  \"I'm gonna love you, like nobody's loved you/\nCome rain or come shine\" - so eery in this context.  It's such an indelible image of obsession and one in which I knew we were in for a masterful filmgoing experience.  \n\nSeizing the moment, Rupert parts the crowd, shepherds Jerry to safety and then climbs into the limo himself.  He uses him time just long enough to convince Jerry to listen to a tape of his material.  Never mind that he hasn't recorded it yet, Rupert takes Jerry's condescending brush-off and uses it as invitation to much more subversive actions.  \n\nScene after scene shows Rupert trying to infiltrate Jerry's offices, but he comes across the expert deflection of a knowing receptionist or Cathy Long (Shelley Hack in a cunning, astute performance), Jerry's Development Rep.  Masha also schemes to get a love letter to Jerry, but also gets the cold shoulder.  In one amazing sequence, Masha chases Jerry down the street, but gets turned away at his revolving office door.  Eventually, Rupert and Masha team up to kidnap Jerry, allowing Rupert to appear on his show and for Masha to have some personal time with her prey.  \n\nWhat works so well in this fairly straightforward, simple story is the tone.  It's meant to keep you in a constant state of queasiness.  Scorsese, with his cinematographer Fred Schuler, locks the camera down most of the time so that we're forced to sit still with our main characters...the better to make you squirm.  Things only get zippy when we're out in the New York streets.  Lewis himself directed one of those scenes in which we watch Jerry walk to work.  With calls out from construction workers and cab drivers, Jerry has a little spring in his step.  A woman at a phone booth stops him to praise him.  Jerry thanks her but demures when she asks him to talk to her nephew on the other end of the line.  Turning on him instantly, she yells, \"You should only get cancer! I hope you get cancer!\"  And that, in a nutshell, is the brilliance of this film.  The journey from top to bottom, and vice versa, can be very short.  \n\nAt one point, Rupert reunites with his high school crush Rita (Diahnne Abbott).  She sees him for what he is, but can't resist an offer to go to Jerry's with him for the weekend.  Unbeknownst to her, they weren't invited.  Jerry's dead-inside reaction to this home invasion speaks volumes.  In scene after scene, Lewis plays against type.  Gone is the wacky clown, replaced by years of knowledge of the exact toll celebrity can have on a person.  It's an astonishing, scary, unforgettable performance.  A prisoner of his own fame, Jerry can do nothing but be numb to the atrocities on display.  \n\nRupert is a delusional, entitled, lazy dreamer.  He was decades ahead of social media stars who made fortunes by posting a picture of their breakfasts.  DeNiro has never given a performance that's anything like this.  He's constantly gesticulating and unwilling to take no for an answer.  He's dangerous.  Who would have imagined that 35 years later, a Rupert would become the leader of the free world?  \n\nWhen we finally get to see Rupert's act, done in one incredible single take, it's mediocre at best.  Sometimes mediocrity is celebrated.  Oh what the hell am I saying?  This country has a history of putting mediocrity on a pedestal.  It explains Twenty One Pilots.  \n\nI look at THE KING OF COMEDY as TAXI DRIVER's funnier but just-as-ugly little brother.  Two delusional men find fame by committing crimes.  They both go after ideal but disinterested women.  One does it to save an innocent soul while the other is completely self-serving.  On second thought, which one is the darker film?\n\nThere's too much to unpack, but I want to point out some details that get me every time:\n\n-Rupert eyes the ceiling of Jerry's waiting room.  It makes the weary receptionist look up. He notices and then asks her, \"Is that cork?\"  Probably the best use of insipid small talk in a film since NASHVILLE.\n-Masha's entire head shaking wildly when she goes on one of her tirades\n-Rupert standing in front of a giant audience photo as he fantasizes about his big debut\n-The guy imitating Rupert behind his back, sending a signal to Rita that she's having dinner with a schmuck.\n-The never-ending mispronunciation of Rupert's last name (Pipkin, Pumpkin, Pupnik)\n-Members of The Clash in the scene where Masha yells at everyone, calling them \"street trash\"\n-Masha's reprise of \"Come Rain Or Come Shine\".  Funny how Bernhard's career after this film always included a little comedy and a little singing.\n-Masha casually tossing the wine glass away.\n-Masha clearing the candlelit table as everything comes crashing down.  They threw in cat noises just to make it even funnier.\n-Masha's one-sided conversation with Jerry, telling him, \"I want to be black\" and then doing an adorable yet frightening Tina Turner imitation.\n-Rupert asking Cathy, \"Are you speaking for Jerry?\"  Makes my skin crawl.\n-Editor Thelma Schoonmaker, a legend, smash cutting to the Jerry Langford show logo right after Masha strips down to her underwear and says that she and Jerry are gonna have \"Good old-fashioned, all-American fun!\"\n-Masha hauntingly blowing a kiss to Jerry.  She's crazy scary.  \n-Rita proves she's just as susceptible to the glow of fame when she steals a little box from Jerry's house.  She's supposed to be the saint of the story, yet even she can be bought.\n-The announcer cheerily chimes, \"Rupert Pupkin, everybody!  Rupert Pupkin!\"\n-The line:  \"Better to be king for a night than schmuck for a lifetime.\"  \n\nI kept thinking about NETWORK and A FACE IN THE CROWD when watching THE KING OF COMEDY this time.  How ahead of their time these films were, and what would a prescient film made today look like?  Would we be predicting the end of fame?  The end of mediocrity?  A return to hard work and talent?  If only.",
            "review_date": "2017-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An utterly unique and remarkably prescient exploration of our culture's obsession with celebrity. Particularly striking is the film's biting disclosure of a certain kind of ideation: The way many of us fantasize about the fruits of success but never the necessary labor. Pupkin-a name like a dog, like a child, like an addled dreamer-imagines all the congratulations that will come should he just get his big break, but we never see him imagining or even enjoying the work itself. Said otherwise, he doesn't want to be a comedian; he just wants to be a king.",
            "review_date": "2017-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film attacks an unique subject matter especially for its time and it was executed in an even more brilliant way. Attacking fame and celebrities with a sort of awkward and slightly dark sense of humor. It is the only Scorsese film that doesn't feel like a Scorsese film and arguably one of DeNiro's best performances although it was overlooked at its time. Jerry Lewis was perfectly casted and gives the movie some seasoning to top it off as another Scorsese masterpiece.",
            "review_date": "2017-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The jumping chronology is a bit jarring; I didn't need to know how things turn out at the beginning, it robs it of tension and dread.  It's an interesting look into the rise of a delusional ladder climber, who wants to get to the top, by any means.",
            "review_date": "2017-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you ever wondered how can you screw up a movie with Robert De Niro, Jerry Lewis and Martin Scorsese, this is your answer.",
            "review_date": "2017-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly recommended film. RIP, Jerry Lewis.",
            "review_date": "2017-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's such a painful movie to watch, but I couldn't take my eyes off it. Robert DeNiro and Martin Scorsese are geniuses, I don't think anybody would argue against that. And while this isn't my favorite film they've collaborated on, I think this is where they perfectly demonstrated just how versatile they can both be.\n\nAnd when I say versatile I really mean it. DeNiro is playing the farthest departure from a gangster imaginable, and Scorsese has managed to make a film with nearly no action feel incredibly frantic and exciting.\n\nThe character of Rupert Pupkin is what every writer should strive for when attempting to create a sympathetic psychopath. I know how awful these things he's doing are, and by that I mean both his comedy material and his criminal activity, but I still really (and kind of sadistically) wanted him to succeed.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We have a movie that is very relaxed, is very light despite being opposed with an appealingly heavy idea, it has a very good script and great rhythm besides dialogues and scenes that remember the Scorsese style well, although it is a whole construction of A comedy movie, in moments he looks like a mafia movie. We have a script that tells the story of Rupert Pumpkin, a man who dreams of being a comedy idol, he kidnaps one of today's greatest comedians, and forces him to take part in his show. It is a constructive script, has an excellent character construction, is a growing and extremely linear script, although it splits into scenes of Rupert's imagination with reality, this may confuse a bit because Scorsese does not change the picture or any aspect that shows Being an imagination, this is good because it privileges the viewer who is more inside the film. The moral of the film is to talk a bit more about the obsession of fame, we run the risk of arrest for a successful night, it also criticizes people who idolize artists by putting them on pedestals common people. We have a dark photograph, with that gray film, it even recalls a mafia movie - not Scorsese's - but we have a touch of humor and irony, we do not have that typical Scorsese rhythm, on the contrary, a good edition, but nothing surprising . Robert De Niro does a very cool acting, he is very fluent, and he does a very good acting but very funny, he is the only one, because the secondary characters are weak. Finally, we have a good comedy movie, with jokes that do not work nowadays, but it's a very clever comedy, and it just proves that Scorsese has a gigantic scope, ranging from comedy to horror.",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grade - B+\nOne of Scorsese's more overlooked movies, 'The King of Comedy' boasts an incredibly engaging and bizarre concept that supports a captivating performance by Robert De Niro as an unconventional aspiring comic.",
            "review_date": "2017-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very interesting look at a very deranged and psycho guy. You got to hand it to him though, he was a seriously determined and ambitious son of a bitch and in the end, he got what he wanted. This is a very peculiar movie but a very interesting one at that. That being said, I don't think I'll be watching this movie again.\n\nOverall, it was an interesting film with a great creepy performance by DeNiro.",
            "review_date": "2017-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourites. Has an effective streak of pitch black humour running through it but is still a marvellous study of a deeply disturbed character.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm probably in the minority, but as of right now, this is my favorite Scorsese film. It's a look into the life of a celebrity stalker, and it paints an interesting picture of how someone like this might delude himself into believing his attention is desired by the person he idolizes. I loved how the obsession and delusion became more aggressive as time passed.\n\nThe fantasy/dream sequences were a superb idea. When the first one hit I didn't know if it was real or imagined, and this works perfectly in the plot. This added element makes it so each time we see another sequence we have to question whether it was really happening. In fact, I still don't know for sure if the epilogue was intended as an actual glimpse into the future or not. \n\nRobert De Niro is great as Rupert Pupkin. He plays him as a sympathetic character, so you feel sorry for him instead of being annoyed or disgusted by him. Sandra Bernhard is a good counterpoint to show what he could be if his obsession is taken to the extreme. But I think the best acting in The King of Comedy came from Jerry Lewis. He is everything you'd expect from a popular TV talk show host, and delivers some of the most subtle and funny jokes in the movie. \n\nThe humor was something I never expected. I don't know why but, despite the title, I thought Scorsese was taking this down a more serious path. But the film is darkly comedic throughout and I was chuckling a lot. Scorsese makes a few choices that I don't understand, but most of the time I think it's a very good movie. I was even impressed by the costuming because Rupert's suits looked exactly like someone trying to dress up as his favorite talk show host. Maybe not one of my favorite films of all time, but definitely a treat, and proof that Scorsese has more range than I thought.",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never heard of this film until today. Scorsese shows us that he is an amazing director and I had no idea DeNiro could play a psychopath that you feel sorry for.. What an amazing movie and I highly recommend you watch this movie.",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though watch but worth it. De Niro is absolutely brilliant.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Has not the force of Taxi Driver, Raging bull- the best jobs of combo De Niro & Scorsese- but the effort of making a tasty black comedy are not a waste. Good choice for a weekend.",
            "review_date": "2017-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the most underrated movies of all time. This is another Scorsese masterpiece and for some reason you don't ever hear anyone talk about it? De Niro and Jerry Lewis are both incredible and play their parts perfectly. Scorsese somehow knew that in the future we would live in a celebrity culture and captures that perfectly in this film. A great dark comedy. De Niro's performance of Rupert Pupkin is a truly terrifying one! A must see movie!",
            "review_date": "2017-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Second-hand embarrassment personified.",
            "review_date": "2017-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The King of Comedy (1983) C-109m. ??? 1/2 D: Martin Scorsese. Robert De Niro, Jerry Lewis, Diahnne Abbott, Sandra Bernhard. Fascinating black comedy narrative of social misfit who gets a chance to meet famed comedian Jerry Langford (Jerry Lewis)--or does he? However he DOES kidnap the stand-up and force him to let him join his television program. Nightmarish, unpleasant beyond belief, but extremely well acted. Very good script by Paul D. Zimmerman; Bobby and Jerry are perfect.",
            "review_date": "2016-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film with super performances, about a guy who wants to be a star. Very funny and moving.  Well done.",
            "review_date": "2016-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Full review on WordsonFilms.com\n\n\"...Even when it's unpleasant to watch, The King of Comedy has something to say. It throws a shadow over all it touches-including show business, personal isolation, television, celebrity, and fame-and if viewers find themselves unable to enjoy the song \"Come Rain or Come Shine\" afterward, then they have Scorsese to thank.\n\nIn an early scene, Rupert says to Rita, \"A guy can get anything he wants as long as he pays the price. What's so funny about that?\" The film's answer: nothing at all....\"",
            "review_date": "2016-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I went into this film 'blind', basing only on merits of Scorsese and DeNiro, and came out very satisfied.",
            "review_date": "2016-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a hard movie to watch, but one that gets inside our heads for all the right reasons.",
            "review_date": "2016-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man, I never want to see this film ever again. This is not a fun movie, in fact, it is an unpleasant and emotionally grueling experience. Rupert Pupkin is one of the most unsympathetic characters I've ever seen in a film, and Robert De Niro is absolutely terrific as the psychopath who does everything to be on a television show. This is very frustrating to watch and it should be. That's exactly what Scorsese was going for while making it and he succeeded. \"The King of Comedy\" is a smart, disturbing, and damn effective black comedy.",
            "review_date": "2016-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "F\n\n8.2\n\n[Martin Scorsese]",
            "review_date": "2016-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart, funny and very realistic, Scorsese's comedy debut applies his sharp humour and expertise to deliver a compelling character study that is highly elevated by Robert DeNiro's bravura performance.",
            "review_date": "2016-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly funny and witty satire absolutely underappreciated at the moment of its release. A little gem in the Scorcese's treasury.",
            "review_date": "2016-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "92%\nWatched this on 17/5/16\nPerhaps an unsung masterpiece. I can't decide whether this or Casino is the best film of Scorsese-De Niro duo. The King of Comedy is at times disturbing satirical black comedy with a fantastic performance from De Niro, not one that you would usually expect from him. The film is really funny, especially towards the end and supporting actors Jerry Lewis and Sandra Bernhard do real good.",
            "review_date": "2016-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The King of Comedy is an overlooked Scorsese film and I can see why, it's a very good film though and does deserve more attention.",
            "review_date": "2016-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How DeNiro and Scorsese could be involved in this garbage is a true mystery!",
            "review_date": "2016-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a movie. One of the best I've ever seen, no question. Eerie, hilarious, some absolutely perfect blackly comic scenes. DeNiro is exceptional. The direction, the tone, the writing, the editing, all spot on. Quite a trip. Absolute filmmaking gold.",
            "review_date": "2015-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was funny but I don't think that it was the funniest movie ever made. A funny premise populated by less funny scenes with even less funny lines in them. As the movie is scrutinized under a more and more powerful lens, the humor shrinks proportionately.",
            "review_date": "2015-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the most underrated Scorsese movie, ahead of its time. De Niro gave great performance, his Rupert Pumpkin is both funny and creepy.",
            "review_date": "2015-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Good old fashioned, all American fun\".\n\nIt's always interesting to see a film ahead of it's time. Whether it takes a couple of years or in this case more than 30. Predicting the obsessive nature of celebrity culture 'The King Of Comedy' is a dark comedic tale. One that's eerily real, one part hilarious the other disturbing.\n\nThree years after 'Raging Bull' 'Scorsese' took on the black comedy (and later again with 'After Hours). 'The King of Comedy' is a largely forgotten film in his bibliography. But may be one of the most important.  One that is only more relevant the years go by. 'Rupert Pupkin' (Robert De Niro) a huge fan of comedian and talk show host 'Jerry Langford (Jerry Lewis) and after a 'meeting' with him is convinced they are now best friends. It's not abundantly clear that 'Rupert' is a little off, his first encounter with 'Jerry' is that of an over-eager up and coming comedian. It's only when we see him back at his house talking to cardboard 'Jerry' and 'Liza Minnelli' that it's clear.\n\nEven then there's something remarkably like-able about 'Rupert' even in the third act when some realisation hits home (well in a way). Eventually it becomes particularly clear that this man is obsessed with his hero 'Jerry Lewis' as his 'friend' 'Marsh' (Sandra Bernhard). Living in his own world their are some fantastically 'real' yet 'fake' scenes where we get to see inside the man's head. Going all out in his own head on how it would or will play out when 'Jerry' realises his talent. Initially trying to tell himself how humble he would be but quickly descends into self-indulgence. It's funny yet tragically sad - I was always pulling for him despite his ridiculous beliefs. \n\nIt consistently delivers the same tone throughout with neither the dark or comedic aspect fully taking over. Particularly with Pupkin's final and ultimately effective attempt at getting on his idols show in the form of a 10 minutes slot. Despite it being a stand-up routine it slowly descends into 'Pupkins' view on his  bad upbringing. Is any of it true? who knows. \n\n\"Better to be a king for a night than a schmuck for a lifetime\". He reaches his goal and is willing to live with the consequences. And there's some parity with Taxi Driver' - whether or not the 'end' (or as his act starts on TV) is real or a day-dream. I'm more incline (for both films) with the dream, an idealisation of what happens. The books, the early release and his own show. Living forever in his delusion, at least he's happy though.\n\n'The King of Comedy' is part of the forgotten films of 'Scorsese' but isn't any less brilliant. A deft look at celebrity culture and the (sometimes) negative impact it can have on peoples view of their idols. And of all the films he's made this one has the most relevancy. This is something waiting to happen although it won't be as endearing or as funny.",
            "review_date": "2015-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really need to stop assuming what movies will be about based on their titles. The title \"The King of Comedy\" had me thinking the Scorsese film would be a biopic of some talk show host I had never heard of. Instead, the film is an off-beat character study which kept making me feel embarrassed for Robert De Niro's character, Rupert Pupkin, but in a good way.\n\nI'm sure we all have fantasies of meeting our one true hero, and we imagine a conversation with him/her will go really well. Rupert Pupkin has this fantasy about his hero, Jerry Langford, a famous comedian played by Jerry Lewis, but this fantasy takes a quick turn to more of an expectation for Pupkin. After one encounter with Langford, Pupkin, who still lives with his mother while he is in his 30s I believe, constantly harasses the people who work for Langford because he believes Langford has become his friend and has agreed to let Pupkin appear on the show, which couldn't be further from the truth.\n\nDuring the course of the movie I found myself feeling embarrassed/awkward for Pupkin since he does so many things which made me internally say \"come on, man, don't do THAT.\" In this sense the film reminded me of feelings I constantly have when I watch \"The Office;\" well, at least feelings I have when Steve Carell plays Michael Scott and makes things super awkward for the people around him. De Niro's performance as Pupkin was so on-the-spot for this quirky and awkward character, proving he has a great range in his acting ability since he often plays \"tough guys\" like Jake La Motta, Al Capone, and the younger Vito Corleone in \"The Godfather Part II.\"\n\nI feel that one mentally ill character was enough for this film, though in hindsight I guess De Niro's counterpart lady friend was essential to the film. There are scenes with her towards the end of the film, however, that make her appear to be abnormal \"just because,\" whereas De Niro's character is abnormal out of a strong passion for his image as a comedian and out of a need of approval from Jerry Langford and his love interest, Rita.\n\nCertainly not one of Scorsese's best films, but then again Scorsese has so many movies that I don't believe I've even seen a third of his filmography yet. I'd still recommend this film because it is a nice change of pace from the typical dark drama which Scorsese often directs.",
            "review_date": "2015-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe I let this one pass me by. One of Scorsese's best and most underrated films with perhaps DeNiro's best and most interesting performance.",
            "review_date": "2015-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I get frustrated when people say they cant like a movie if the central character isn't their taste or kind of person. Well, that might be because it is the meaning to be that way, an intend of the director and writer. Maybe films should be challenging instead of easy to feel and understand, or at least some films. This is an film that triggers frustration and irritation and have characters that you may not like or aprove of. DeNiros character Rupert pupkin reminds me of Jake Gyllenhaals character from Nightcrawler, psychopathic, excentic and egoistic. He is a 30-something year old nerd who lives in his mothers basement with cutboards of Jerry Langford that he talks to. All the dream sequenses are well done and innovative because the most of them is filmed with a TV-camera which gives it a different effect than from other dream sequenses. It is written with irony within showbusiness and fanboyism and straight up obsession over fame and famous people. All because of the TV. Extremely well directed and acted, perfectly written and very realistic. It is not a comedy and more of a drama and psychological film filled with dark and tragically true reality.",
            "review_date": "2015-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The King of Comedy\" is a black comedy film that tells of Rupert Pupkin, an aspiring comic who is obsessed with star comic Jerry Langford. He dreams and fantasizes conversations with Jerry and actually believes these things are happening. Just when things couldn't get any stranger with Pupkin, they do.\n\nThis is one of director Martin Scorsese's different kind of films. He dives into Rupert's crazy obsessions and holds nothing back, and I really enjoyed that. This film had wonderful performances and a terrific script and I truly was surprised at how good I thought this movie was. It definitely is on the strange side, but the character studies is what this movie's all about.\n\nIf you're a fan of Scorsese and haven't seen \"The King of Comedy,\" I would highly recommend giving it a shot. 7.2/10",
            "review_date": "2015-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not one of Scorsese and DeNiro's finest collaborations as an overall film but yet it may well be up there with the actors finest performances. Falling somewhere in tone between Travis Bickle and Gil Renard of 'The Fan' DeNiro is as intense and on edge as only he at top form could muster.",
            "review_date": "2015-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The King of Comedy is a classic Scorsese ode to New York City and also features one of Robert DeNiro's more heartwarming, funny and kind performances with his long time director partner. Throughout, Rubert Pupkin is likable in a strange way and also subliminally sad in his want for success and a need to escape from his uncontrolled life which he wishes to take control of. The ending is heartwarming and features an unexpected and genuinely funny monologue from Pupkin/DeNiro which uplifts and gives hope to what seemed like a fruitless venture.",
            "review_date": "2015-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie came straight outta left field really, after two mean thrillers and hard hitting biographical, a black comedy felt like an odd turn. Scorsese was still kinda finding his feet at this point, almost at a fork in his career in what to do, his following two movies after this ('After Hours' and 'The Colour of Money') confirms this. From very raw emotional adult films, then branching out into a comedy, even with De Niro, seemed brave. Scorsese could of easily slipped into the mainstream realms at this time. 'After Hours' was another quirky black comedy, but the type of comedy that you could easily see Tom Hanks leading, whilst 'The Colour of Money' was most definitely a mainstream movie with the man of the moment Tom Cruise.\n\nLuckily this didn't happen and we have a string of adult targeted movies to enjoy...mainly mobster movies. Nevertheless looking back its cool to see these more unique Scorsese projects, how he handled them and how or if his now infamous trademarks and style are still visible. First up, its a Scorsese movie, De Niro? check, New York setting? check, plot about a wacko loner? check...annnnd we're done.\n\nThe film feels like an extension of Scorsese's 1976 film 'Taxi Driver' to be honest, naturally this is down to the simple fact that De Niro plays another lonely weirdo who inadvertently becomes a hero of sorts by the end. You could almost call this a remake really, just a more light-hearted version. We follow the celebrity worshipping Rupert Pupkin (great name) as he tries his utmost to get on Jerry Langford's (Jerry Lewis) talk show with his stand-up act. This takes up pretty much the entire film until an encounter with Langford at his home shows Pupkin he has no chance of getting on the show. The ever resourceful Rupert doesn't let this fade him though as he hatches a plan to kidnap Langford in order to demand his act be shown on the talk show. At the same time Pupkin has the help of another fellow celebrity worshipper/stalker in Masha (Sandra Bernhard).\n\nI can't help but think De Niro is gonna explode in a tidal wave of blood soaked violence when I watch this movie. Its probably down to his previous performances and roles (and the era when this was made), but its like you're just waiting for his character to pop and kick someones head in. Its really quite unnerving at times, that's how good De Niro is, the man is a twitching time bomb ready to blow. I love watching De Niro in this movie, its almost hypnotising with his little quirks, his little nuances, everything we now know about the man but ramped up to ten. \n\nI could probably go on record saying this is one of De Niro's best performances. Not only is he uncomfortable to watch with his sleazy used car salesman-esque appearance complete with a little annoying tash, but he's both funny and kinda lovable at the same time. His character is always very polite and well mannered to everyone he meets, he's smart, gracious, keen and accepting of criticism to a degree. I adore how he oozes around the top brass in the networks main building in NY, still very polite and pleasant but also such a slippery, slimy, creep, trying his best to talk his way into a meeting with the mighty Langford. Its amusing because you know this guy probably doesn't really have much talent but he clearly thinks he does. He's clearly overly ambitious and overly confident in himself which is funny but at the same time not exactly a bad thing, that's why you kinda love the guy for persevering, he's got balls but no sense of tact.\n\nThe little moments where we see Pupkin pretending to be on the show with Langford, in conversation with him either professionally or in private and setting up his own overblown introductions for the show etc...are priceless. The funniest thing is he's doing this at his home with his mother in the next room type of thing, a typical middle aged man still living at home with him mum scenario. These brief scenes also show us how crazy Pupkin is, his room (or basement) is decorated like a real talk show studio with a big picture of an audience on one wall, mock-ups of Langford he can talk to etc...This shows us his potential scary side and makes you wonder if he will go hyper nuts at some point.\n\nThe other cast members are all very good in their roles too. Jerry Lewis really nails that old fashioned 70's (I'm guessing) talk show host look with the big rimmed glasses, dapper suits, slick hair and smoking whilst on the air. He really does look like one of your old relations in a family photo from back in the late 70's early 80's perhaps. Not only that but you really feel his frustration and anger as he puts up with the constant unwanted attention and pestering from fans and nutjobs. The scene where he confronts Pupkin at his private home is probably his strongest. I was also really impressed with Bernhard who gives us an excellently crazy yet sexy stalker. I don't much about Bernhard outside of the TV show 'Roseanne' and her role in the Bruce Willis turd 'Hudson Hawk', but towards the end of this film she really gives it her all. The sequence with her character having a romantic dinner with the kidnapped Langford (duct taped to a chair) is amusing, sexy and obviously disturbing. All three being perfect traits of Bernhard.\n\nOf course the twist in the film is that Pupkin's stand-up routine is successful, he doesn't end up killing anyone or himself in a blaze of glory and he actually manages to achieve what he always wanted. On one hand that might seem anti-climatic but on the other hand the more predictable ending of him getting killed along with his idol would be errmm...predictable. For me this ending is just right, it could of easily been a subdued finale but I think Pupkin was too likable, as was Masha, neither of them really do anything unlikable throughout. In the end I was really happy Pupkin manages to succeed with his dream, sure he's a bit twisted and unhinged in a strangely calm way (he did kidnap someone after all), but he's still a really nice guy at the end of the day.\n\nI like this film very much, I think its a cute yet slightly off-kilter story which shows both a gutsy win for the little guy and the heartache a famous personality may have to deal with. But at no point is it ever deadly serious to the point of being a thriller, the crime committed is serious but its all done in a very tame almost apologetic way. Its a breath of fresh air to see an early performance by De Niro where he isn't a psychopath for the mob or just out of his mind. This movie was a bomb on release and has been largely forgotten about ever since, but I wholeheartedly recommend it.",
            "review_date": "2015-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With Robert DeNiro's larger than life performance and familiar themes of redemption, it's a Martin Scorsese classic.",
            "review_date": "2015-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very disturbing film about some desperate people.",
            "review_date": "2015-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A weird but funny dark comedy with one of the most entertaining Robert De Niro performances I have ever seen. He chews every piece of scenery on site and Sandra Bernhard does great supporting work as does Jerry Lewis. It's one of Scorsese's best as well and probably most underrated as I don't hear many talk about it nowadays.",
            "review_date": "2015-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dark comedy that's just flat....not dark enough nor funny enough for the genre.",
            "review_date": "2015-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This very well might be the final truly exceptional film Martin Scorsese ever makes. Brilliant and it has only improved with age.",
            "review_date": "2015-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is common knowledge that Robert De Niro is one of the greatest actors of all time but for some reason people seem to associate De Niro only with the crime genre and forget that he has a lot of acting range. This movie is what Taxi Driver would have been if it was on drugs. Another good movie from Martin Scorsese and I feel that few people even know that this movie exits.",
            "review_date": "2015-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Niro and Scorsese are at their absolute peak in this fascinating dark comedy about stardom and insanity.",
            "review_date": "2015-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure I've ever felt so many conflicting feels about one character at the same time.",
            "review_date": "2015-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With uncomfortably dark humor and compelling themes on obsession, The King of Comedy is one of Martin Scorsese's most underrated movies in his directing filmography that has a fantastic performance by Robert De Niro that may be one of his best and also a pretty good supporting performance by Jerry Lewis.",
            "review_date": "2015-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deniro really delivers in one of his most unique roles.",
            "review_date": "2015-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a wonder full film it really is amazing, but I was enjoying it from the beginning it had a wonderful flow to it but then it lost it around hour and nineteen minutes in, it loses\nFor a while but gets right back up but my biggest complain was the girl(I don't even care to know her name) she was free king annoying and very man like. I think her character was stupid and so was she. I Swear to god I fast forwarded every one of her scene towards the end.",
            "review_date": "2015-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "better to be king for a night than a schmuck for a lifetime",
            "review_date": "2015-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Better to be a king for a night then a schmuck for a lifetime.\" \n\nMartin Scorsese's The King of Comedy is another fine film from the masterful director along with his duo De Niro. While on the outside, and largely why the film is misinterpreted, this appears to be a comedy, the film is actually a dark and eerie look at showbiz. De Niro's Pupkin is great, Scorsese's direction is artistic and tasteful, and the script is darkly comedic. Another incredible piece of work.",
            "review_date": "2015-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good Scorsese flick. Robert Deniro gives a very well performance as Rupert Pumpkin, a wannabe comedian who stalks a Johnny Carson like character named Jerry Langford played by Jerry Lewis. Watching DeNiro in this movie just makes me realize why DeNiro will always be my favorite actor. I love Nicholson, Walken, Hoffman, Pacino, Tommy Lee Jones, they will always be my favorites as well, but there's just something about DeNiro that just makes me love the guy. This was Scorsese and DeNiro's 5th collaboration together making it a total of 8 films they have done together. \"Casino\" was their last collaboration together, but I would like to see them do at least one more movie together before there time in Hollywood is over as I truly believe they are the best actor and director team that has ever lived.",
            "review_date": "2015-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scorsese's most underrated movie and one of DeNiro's most underrated performances.",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very peculiar film with a distinctive Scorsese feel to it, The King Of Comedy is all about an aspiring comedian thats as crazy as he is persistant, and even though half of the tale might be a bit too slow and dramatic for some, the outcome is undeniably satistactory, making this not only a very entretaining film with some very bizzarre and crerative characters, but also one that teaches its audience a few life lessons and some clever apointings regarding entretainment and fame.",
            "review_date": "2014-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute masterpiece an amazingly acted wonderfully directed and an amazing screenplay this was a truly memorable entertaining movie viewing experience I've had in quite some time a piece of cinematic brilliance \nGrade A+",
            "review_date": "2014-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darkly funny and tenderly acted with characteristically great direction from Scorsese and a demented yet likable De Niro performance makes for an engaging story of an unlikely comedy giant's rise to fame.",
            "review_date": "2014-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the one of most underrated films of all time. This film is a classic. Brilliant from beginning to end. De Niros performance is so wonderful and mesmerising that it takes over the whole film.",
            "review_date": "2014-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pumpking finally got what he deserved!",
            "review_date": "2014-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dark comedy that deserves more attention.",
            "review_date": "2014-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Felonious Fifteen Minutes of Fame... A dark, funny, enthralling character study--Scorsese's Black Sheep... Fantastic...Lunatic Fringe!!",
            "review_date": "2014-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen Robert De Niro mainly in dramatic roles.  Here he's very good as a dorky character who's kidnaps the Jerry Lewis character in order to get on TV in this dark comedy from Martin Scorsese.\nIt's the first Jerry Lewis movie I've seen since I was a kid.  I was a big fan of Lewis back in the day.",
            "review_date": "2014-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found the main character so annoying, it was hard to care about the story.",
            "review_date": "2014-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even Scorsese and De Niro far from their best is still pretty good.",
            "review_date": "2014-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a breath of fresh air it must have been to Robert De Niro playing this totally different kind of role, obviously now he's all over the place but back then this must have been quite a shock. This is a really good film which I suppose you have to call a comedy although the jokes are fairly subtle. De Niro makes the film but Sandra Bernhard also impressed me for the first time ever.",
            "review_date": "2014-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite funny, very compelling and extremely uncomfortable at points. Why did I like this crazy man so much? Because of De Niro's brilliant criminally over-looked performance and Scorsese's delicate direction",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Criminally overlooked and forgotten. Another Scorsese smash hit!",
            "review_date": "2014-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Creepy rather than funny. Great performance by De Niro as an obsessed talentless wannabee.",
            "review_date": "2014-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an entertaining & enlightening thinkpiece about a desperate comic kidnapping a talk show host to advance his career. Jerry Lewis finally playing himself & DeNiro totally playing against type really makes this film pop.",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the hardest films to write a review on. The reason for this is because of how twisted this film is. It is the darkest I have ever seen Scorsese go, but the strange thing is that through out this incredibly twisted film, I just couldn't stop laughing. One of the strangest(yet oddly compelling) films I have ever seen.",
            "review_date": "2014-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolutely enthralling experience. Full review soon.",
            "review_date": "2014-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty sad when you can relate to the king, not that i can *cough*",
            "review_date": "2014-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, who knew De Niro could play such a convincing loser. A very funny and especially poignant film about fame and...sheer madness resulting from social alienation? A big statement about the entertainment industry, at least! (And still remarkably relevant today).\nThis is an unjustly disregarded entry in Scorsese's illustrious repertoire, and truly worthwhile watch.",
            "review_date": "2014-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Criminally underrated, The King of Comedy is a disturbing film that takes a look inside the mind of a crazed psychopath who is bent upon becoming famous. De Niro gives a creepy, but heartfelt performance, and we're allowed to see how willing to please, yet unwilling to accept defeat the main character is. Through his eyes, we see a nation obsessed with fame and with meeting famous people we consider to be our \"idols.\" If you've ever been obsessed with anyone in pop culture, then you've had a little bit of Robert Pupkin inside you. It's a step in a bizarrely different direction for Scorsese, but his experimentation pays off. The King of Comedy is a great film.",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Martin Scorsese's The King of Comedy is a highly entertaining drama that has enough comedic moments to make this film entertaining and memorable. The film's choice of actors is great as well, and Robert De Niro and Sandra Bernhard have great chemistry together, and overall the film is a highly memorable picture that is entertaining due to the fact that it possesses a winning formula that is brought to life by Scorsese's great direction. The King of Comedy is an engaging picture that boasts memorable performances, a great story, and brilliant direction to really make the film standout. I really enjoyed the movie, and felt it was another standout feature from Martin Scorsese, who is one of cinema's finest directors. With this film, being a slight change of pace, as Scorsese would be more at ease with the crime, and gangster genres, it's great to see him movie in the comedy genre, and he is able to pull it off because he is a phenomenal filmmaker and storyteller. The way Scorsese crafts a film is unmatched by any other director, he is able to get the simplest ideas and make them into a terrific, well layered picture that delivers some truly engaging entertainment. Scorsese is one of my favorite directors, and I've seen a lot of his movies, The King of Comedy would rank among his best films, a film that is funny, dramatic, thrilling from start to finish and is sure to appeal to fans of the director. With that being said, Whenever Robert De Niro and Martin Scorsese would make cinematic gold. If you enjoy Martin Scorsese's work, then you're surely going to love this film. The King of Comedy successfully mixes comedic elements with drama, and in turn, it delivers one of the most memorable films of Martin Scorsese's career.",
            "review_date": "2014-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Niro's mania is breathtaking and haunting (particularly when he stands in front of a panorama of a B/W audience). Only the female character could have used a bit more oomph.",
            "review_date": "2014-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This character study is pure gold. At par with anything Dostoevsky, or even more.",
            "review_date": "2014-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This character is always smiling always happy, but still in his happy moments you can feel the loneliness of this man, that kind of complex acting is very hard to pull of and I think that this is one of Robert De Niro's greatest performance. I saw this film is a satire on Taxi Driver, it made fun of some of the elements, but still kept that dark and dramatic edge. My only problem with the movie is the character of Marsha, she was an annoying yelling bitch, though she was performed good as a maniac, she still had her annoying moments.",
            "review_date": "2014-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grade:Low 8/10\n\nThe King of Comedy is a film directed by a visionary and played out by\nan actor who only seemed to get better as this film went along. It is\ndone well and mixes drama and comedy to make a film that is hugely\nenjoyable but also has a very unpredictable plot which shows us how\nmuch people can go to get near there celebrity idols. In the end I felt\nthis film was safely very good, and here below is why so.\n\nThe story is well timed and for the length that it is, it plays out\nvery well as a plot. In the end you come out thinking \"was that a\ncomedy, or a drama\" well in a sense it is both but because it contains\nso much of both, you may be think it just one of the genres. It takes\nmaybe a little while to truly get stuck into the plot but it is worth\nit by the end as the ending is very unpredictable and will leave you\nwith a sense of what is going on here.\n\nRobert De Niro in the main role as Rupert Pupkin is very good and shows\nall his class that we don't always see in a comedy role, this is\nperhaps his most diverse performance ever in film. Jerry Lewis as the\nchat show host is calm and comfortable in the role and to say he is a\ncomedian in real life, he lets others take the funny bits as if to say\nJerry isn't allowed to be the funny on there, he has to take it by\nothers. The rest of the cast do well but no one stands out as much as\nDe Niro really and no wonder Scorsese and him work together so well.\n\nNow on to Martin Scorsese he directs this well and really brings the\nscript alive with his commanding role that in my opinion, is the reason\nDe Niro is such a good actor here. He seemed to bring the best out of\neveryone but also with the solid script he had to work with, it is no\nwonder it works so well to listen to and to watch. It has some good\nbits of humour, not chocked full but could pleasantly entertain some\nfans of Drama comedies.\n\nThere isn't much wrong with this film but what I will say is that it\ncould lack enough humour to be funny, and that maybe the story isn't\nthe smartest Scorsese has ever done, maybe the most fun but not smarter\nthan most he does. I think the comedy also changes too much and bits\nare funny then it goes away for long spells only to randomly come back\nwith it's more humorous ramblings, funny bits are funny though. \n\nAny Scorsese fan should love this, as I say maybe won't have you struck\nby the power of it, but will still thoroughly entertain you and you\nknow it is by him it done so well. Most people should enjoy this as it\ncontains all the elements a comedy drama must have and some very if not\nweirdly likable characters in it. Some may dislike this as it can be\nvery quiet at times and slow compared to the beginning pace, but most\nshould have positive thoughts after watching this.\n\nOverall I give this a low 8/10, it is a Safely Good Movie, not near to being\nGreat in my opinion like so many others think, but I still felt it was\nvery good like I say and that makes it very very fun. With this you\nhave to marvel at the acting skills involved and may even serve as a\ncult film to some as we really get to explore the mind of Pupkin and\nwhy is he so obsessed with Stand up on the Jerry Langford show, and\nJerry Langford himself.",
            "review_date": "2014-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film with the pedigree and quality of Taxi Driver, without (for whatever reason) the cult status. Deniro radiates the same desperate, obsessive insanity and delusion as Travis Bickle himself, though one might argue he plays a psychotic here and a psychopath as Bickle. That's to say nothing of his truly excellent, exquisitely broken female counterpart, and Jerry Lewis as an affable, put-upon Johnny Carson type.",
            "review_date": "2014-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A disturbing, but highly professional movie. De Niro at his finest.",
            "review_date": "2014-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Dark comedy sort, The King of Comedy is a one man's show, Ruper Pupkin aka Robert De Niro. Fame and Stardom is the major theme, followed by a length of grit and passion to become someone important. De Niro bolsters an image of a struggling yet compassionate comedian and a Star wannabe. Sandra Bernhard steps in with her flawless act of aggressive liking for her favorite TV star. A Scorsese classic, The King of Comedy it is, Ladies & Gentlemen. *Applause*",
            "review_date": "2014-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Martin Scorsese fashions a thrilling, chilling satire of the hubris and narcissism of our celebrity-obsessed showbiz culture. Samuel Clemens himself might be proud.",
            "review_date": "2014-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to admit that I never watched this American black comedy before. So many friends suggested it as a compulsory viewing that I cracked under the pressure and sat down to see that piece of art they all admire.  Starring Robert De Niro and (my least favourite comedian) Jerry Lewis I didn't expect too much. At the end I have to say that it was a good movie with solid performances (even from Jerry Lewis) and very secure directing by Martin Scorsese. I really liked the subject of the movie - the celebrity worshiping and the American media culture, and what they create!\r\n\r\nI had a chance to follow a real psychopath Rupert Pupkin (De Niro), a stage-door autograph hound, who happens to be an aspiring stand-up comedian whose ambition far exceeds his talent. After meeting Jerry Langford (Lewis), a successful comedian and talk show host, Rupert believes his \"big break\" has finally come. He attempts to get a place on the show but is continually rebuffed by Langford's staff and, finally, by Langford himself. Well, along the way, Rupert indulges in elaborate and obsessive fantasies where he and Langford are colleagues and friends... and failing to differentiate between his fantasies and reality, he even takes a date, Rita, to Langford's home...\r\n\r\nAfter Raging Bull was completed, Scorsese was keen to do a pet project of his, The Last Temptation of Christ, and wanted De Niro to play Jesus Christ. De Niro was not interested and preferred their next collaboration to be a comedy. \r\n\r\nScorsese's first choice for talk show host Jerry Langford was Johnny Carson. Carson refused the role, and the entire Rat Pack was also considered-specifically Frank Sinatra and Dean Martin-before a decision was made to select Martin's old partner, Jerry Lewis! \r\n\r\nI will repeat, it was a good movie but for me was neither funny enough to be a black comedy nor scary enough to capitalise on its thriller elements... the best part was the satirical one.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The King of comedy is an overlooked black comedy masterpiece akin to Network(1976) in showing the obsession of the celebrity following. Robert de Niro puts on a slimy performance as Rupert Pupkin who wants nothing other than to be a comedian even at the cost of kidnapping his idol. Jerry lewis provides the perfect straight man to the insanity of the story. Between the hallucinatory scenes and black comedy genius, the scorsese masterpiece is as disturbing as raging bull and taxi driver.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "''Better to be king for a night than schmuck for a lifetime.'' \n\nMartin Scorsese and Robert De Niro successfully teamed up once again in what probably was their most different and unique collaboration together. It is a wonderful and unsettling film with a great performance from Robert De Niro. I feel sorry for younger audiences who have only seen his recent work, because they are missing out on one of the best actors during the 80's and 90's. Here, De Niro plays a mentally unstable  character who is obsessed with becoming famous. I don't know if our culture was so obsessed with celebrity and fame during the 80's as they are now, but The King of Comedy is very much prescient today and that is one of the reasons why it still speaks to its audience more than 30 years after its release. It isn't an easy watch, especially if you are expecting a Scorsese film like Goodfellas, but it is equally effective. The King of Comedy plays out as an edgy cultural satire and despite feeling unsettled by some of the characters motivations I still was engaged with the story. This is a unique dark comedy because it is much more restrained than others, and it isn't a comedy that will have you laughing throughout the movie, but it works in a creepy and unsettling way thanks to Scorsese's direction and De Niro's inspired performance.\n\nThis satire of our celebrity obsessed society was written by Paul D. Zimmerman and it stars Robert De Niro as an aspiring comedian who is obsessed with becoming famous. We first see Rupert Pupkin hanging around a crowd of fans outside a local TV studio where Jerry Langford's (Jerry Lewis) comedy show is taped. Jerry is greeted by his fans as he exits the show and heads for his limo, but an obsessed stalker named Masha (Sandra Bernhard) awaits for him hidden in his car. In the midst of all the turmoil, Rupert separates Jerry from Masha and the rest of the crowd. He then seizes his opportunity and ends up alone with Jerry in his limo distancing himself from the rest of the crowd who in his opinion are simply autograph hounds. Rupert then introduces himself and tells Jerry that he is an aspiring comedian and wants him to invite him to his show because he believes he has potential. In order to get rid of him Jerry politely gives him some advice and tells Rupert to send a tape of his jokes to his assistant, Cathy Long (Shelley Hack), but he recommends he start at the bottom and begin performing in small local shows. Rupert is so fixated with himself and his desire to become famous that he has a difficult time trying to separate what is real and what is fantasy. Back home he begins fantasizing about his conversation with Jerry, and now that he has gotten this far he won't stop until he gets his shot at fame.\n\nRupert isn't an easy character to root for considering he only cares about himself and can't take no for an answer. His presence unsettles everyone around him just like it does with us as we watch him invite himself to Jerry's country home or as he insists on meeting with him in his studio. Scorsese does a great job with this film creating this unsettling and disturbing atmosphere. Jerry Lewis gives a much more restrained performance and it is very different from the quirky roles we've seen him play before. In a way he's just playing himself and that is why he is so believable in his Johnny Carson like role. Sandra Bernhard's performance divided critics as some considered it to be over the top, but I thought she was great considering this is a satire of our culture's obsession with celebrities and fame. I thought the ending of this film was also perfect and very poignant. There are two ways you can read into the ending (since Rupert fantasizes so much it is hard to separate that from reality) but if it really played out the way it's presented at the end I thought it was a powerful critique of how we as a culture value success and fame over morality. It was a very satisfying ending and I really enjoyed this film.",
            "review_date": "2014-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "''Better to be king for a night than schmuck for a lifetime.'' \n\nMartin Scorsese and Robert De Niro successfully teamed up once again in what probably was their most different and unique collaboration together. It is a wonderful and unsettling film with a great performance from Robert De Niro. I feel sorry for younger audiences who have only seen his recent work, because they are missing out on one of the best actors during the 80's and 90's. Here, De Niro plays a mentally unstable  character who is obsessed with becoming famous. I don't know if our culture was so obsessed with celebrity and fame during the 80's as they are now, but The King of Comedy is very much prescient today and that is one of the reasons why it still speaks to its audience more than 30 years after its release. It isn't an easy watch, especially if you are expecting a Scorsese film like Goodfellas, but it is equally effective. The King of Comedy plays out as an edgy cultural satire and despite feeling unsettled by some of the characters motivations I still was engaged with the story. This is a unique dark comedy because it is much more restrained than others, and it isn't a comedy that will have you laughing throughout the movie, but it works in a creepy and unsettling way thanks to Scorsese's direction and De Niro's inspired performance.\n\nThis satire of our celebrity obsessed society was written by Paul D. Zimmerman and it stars Robert De Niro as an aspiring comedian who is obsessed with becoming famous. We first see Rupert Pupkin hanging around a crowd of fans outside a local TV studio where Jerry Langford's (Jerry Lewis) comedy show is taped. Jerry is greeted by his fans as he exits the show and heads for his limo, but an obsessed stalker named Masha (Sandra Bernhard) awaits for him hidden in his car. In the midst of all the turmoil, Rupert separates Jerry from Masha and the rest of the crowd. He then seizes his opportunity and ends up alone with Jerry in his limo distancing himself from the rest of the crowd who in his opinion are simply autograph hounds. Rupert then introduces himself and tells Jerry that he is an aspiring comedian and wants him to invite him to his show because he believes he has potential. In order to get rid of him Jerry politely gives him some advice and tells Rupert to send a tape of his jokes to his assistant, Cathy Long (Shelley Hack), but he recommends he start at the bottom and begin performing in small local shows. Rupert is so fixated with himself and his desire to become famous that he has a difficult time trying to separate what is real and what is fantasy. Back home he begins fantasizing about his conversation with Jerry, and now that he has gotten this far he won't stop until he gets his shot at fame.\n\nRupert isn't an easy character to root for considering he only cares about himself and can't take no for an answer. His presence unsettles everyone around him just like it does with us as we watch him invite himself to Jerry's country home or as he insists on meeting with him in his studio. Scorsese does a great job with this film creating this unsettling and disturbing atmosphere. Jerry Lewis gives a much more restrained performance and it is very different from the quirky roles we've seen him play before. In a way he's just playing himself and that is why he is so believable in his Johnny Carson like role. Sandra Bernhard's performance divided critics as some considered it to be over the top, but I thought she was great considering this is a satire of our culture's obsession with celebrities and fame. I thought the ending of this film was also perfect and very poignant. There are two ways you can read into the ending (since Rupert fantasizes so much it is hard to separate that from reality) but if it really played out the way it's presented at the end I thought it was a powerful critique of how we as a culture value success and fame over morality. It was a very satisfying ending and I really enjoyed this film.",
            "review_date": "2014-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directed by Martin Scorsese, Robert de Niro plays a different kind of loon in this dark comedy!",
            "review_date": "2014-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I appreciate a ton of Scorsese's work there are a handful of his films that I truly dislike, King of Comedy joins the rank of Gangs of New York as my least favorite. With a De Palma like style the film was more annoying than entertaining, especially Rupert's Dancer in the Dark like dreaming. With a title that has comedy in it I expected more laughs, while all I got was a few good one liners and a couple nice gags. Despite the frustration of watching the ending is quite effective, and leaves the movie with a charming note.",
            "review_date": "2014-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why is this not a more celebrated Scorsese film?",
            "review_date": "2014-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely an overlooked underrated masterpiece.  De Niro gives one of his best performances (Scorsese even said that this was his best) of his career.  It's sad, dark, but stays on your mind.  A top 5 Scorsese movie and a classic.",
            "review_date": "2014-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My new favorite Martin Scorsese movie",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances from Robert De Niro and Sandra Bernhard. They were both quite hilarious. Really enjoyed the originality of this film.",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When Martin Scorsese says that he thinks that this is De Niro's best performance under his direction, there is no question about it, you need see this movie as soon as possible. And what a performance it is! Robert De Niro is amazing! This is seriously one of the best things he has ever done. The King of Comedy is not an easy film to watch mostly due to the annoyingly persistent nature of Rupert Pupkin and because of how he treats people but strangely I wanted to keep watching because of Pupkin, I really quite liked him, in a very odd way. Probably because I've never really seen a character like this. It's a very painful and annoying film to watch but for the right reasons. And I don't know if I was supposed to, but I found Pupkins jokes quite funny and the ending is incredible. I loved it and cannot wait to see it again.",
            "review_date": "2014-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a hard to watch film, because De Niro plays it well as a delusional stalker not facing reality, but still a good film.",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent movie about the trappings of celebrity & the foretelling of celebrity idolisation & just what it takes to make it in this insular, but very human, world.",
            "review_date": "2014-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that sends out a message as well maneges to entertain, Robert de Nero also brings a great performance - 9/10",
            "review_date": "2014-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still uncomfortable to watch after multiple viewings.  Yet it's the boldest material of the Scorsese/De Niro collaborations.  Rightfully deserves the reevaluation it's received since it originally flopped 30 years ago with audiences and critics.  .",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Niro showcases some of his best acting, on par with Raging Bull. From the insane and relentless mind of Rupert Pupkin to his unbelievably mediocre stand-up routine, to the fantasy-or-reality ending, this film is genius. Was it Pupkin's fantasy again, because wouldn't the modern media love Rupert?",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "oh my god\n\nsomebody rewrote Taxi Driver and made it into a comedy\n\nno, seriously - the film deals with many of the same issues Taxi Driver tackles, including but not limited to social isolation, being out of step with the world, the lengths a man will go just to get love requited, and the morally ambiguous ways a man will break into showbusiness\n\nwe've all done what Rupert's done - we've daydreamed about movie stars and what it'd be like if we were famous - but what the movie does that we don't want to acknowledge is that famous people do run the risk of being usurped by people who can't tell the difference between fantasy and reality, especially those on Rupert's wavelength\n\nwho's the right one - the FBI for making Rupert so comically infamous that he has achieved his pipe dreams; Jerry, who uses his fame in order to shun others and gives rising talent the brush-off only to ensure his constant safety; or Rupert, who already has an unhealthy obsession with the art of comedy and will do ANYTHING just to achieve his goals\n\noh my god I think I've found my new favorite DARK comedy",
            "review_date": "2014-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Took me a long time to get around to this, but I'm glad I did.",
            "review_date": "2014-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Scorsese's lesser-known gem's; The King of Comedy features powerhouse performances from Robert De Niro and Jerry Lewis, while also remaining though-provoking.",
            "review_date": "2014-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An overlooked Scorsese film which seems more vital now than ever in today's celebrity, fame and status obsessed culture, Robert De Niro is fantastic as the pitiful and very sad Rupert Pupkin, a deluded and pretty much insane man who luxuriates in his own fantasy, and believes himself to be the next big stand up comedian, he wants fame so bad that he kidnaps his idol Jerry Langford (played by Jerry Lewis) and as a ransom gets himself put on national television for his big shot. It canb sometimes be a frustrating film, whats demented fantasy and whats actually happening becomes ever more blurred to the point of distraction, you sometimes dont quite know what to invest in, because your not sure weather much is in Pupkins head, this is of course deliberate ambiguity that would improve on repeat views. Overall a brilliantly dark, tragic sort of comedy, and a true original.",
            "review_date": "2014-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie and a martin Scorsese classic.",
            "review_date": "2014-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Martin Scorsese's most unheralded masterpieces. This time he takes a poke at fame, the desire for fame, the media machine that creates it, and the collateral damage that it can cause. Putting stalker culture under the microscope before \"stalker\" even entered the our common vocabulary, this film was oddly prescient about the kind of danger that fame can put it's figureheads in. An oddly offbeat role for Deniro to take on, but he delivers. If you're a fan of Scorsese, but this one flew under your radar, I highly recommend it.",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a creepy and very strange story that will leave you squirming while at the same time mesmerized",
            "review_date": "2014-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is a really good film and certainly one of Martin Scorsese's least Scorsese films, though still a great one from him and it certainly is a great example of his skill as a director. This is also a great showcase for Robert De Niro. This one may be a comedy, but it is classic De Niro as he plays this weird, troubled character brilliantly and really elevates this one up a level without question. The script is also riotously funny and poignant at the same time, in particular the ending, which undoubtedly rings true. The more thrilling and dramatic elements are also very good and this film can be very \"edge of your seat\" at times. Overall, The King of Comedy is a very good, very funny, very entertaining, film from Scorsese and De Niro that really shows how great the two are together.",
            "review_date": "2013-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How is it that we almost never discuss this work of art when we speak of Martin Scorses films? I, for one, had never even heard of The King of Comedy until I received it in the mail through Netflix.  What I got was a priceless gem, one of the greatest satires of the tv industry that could be possibly captured on film. Rupert Pupkin (what a name!) is so annoying yet genuinely determined that one almost pretty much roots for him to succeed while cringing at his methods.  Jerry Lewis is great as the Carson-esque Jerry Langford.  Cold, callous, and burnt out in the industry, his demeanor seems so genuinely and fridigly real.  All around masterpiece.",
            "review_date": "2013-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert Deniro's greatest performance in a Scorsese picture as well as being one of Marty's best movies. And remember:\" Better to be king for a night than schmuck for a lifetime.\"",
            "review_date": "2013-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though Martin Scorsese took a break between \"Taxi Driver\" (1976) and \"Raging Bull\" (1980) to make the jazz-influenced \"New York, New York\" (1977) and the Band concert documentary \"The Last Waltz\" (1978), 1982's \"The King of Comedy\" feels like the perfect bookend to his aforementioned \"Taxi\"/\"Bull\" Kazan-esque morality plays. And even, give or take a few pounds, Jerry Langford (Jerry Lewis) -- a zealous talk show host in the hangdog vein of a leather-skinned Johnny Carson ripoff -- could pragmatically come off as the very same stand-up lounge lizard for whom we left Jake LaMotta at the end of \"Raging Bull\".\n\nBut Scorsese, now 71 years old in 2013, has fashioned a rich career out of never settling, always trying to one-up himself. \"The King of Comedy\" is a blistering, fairly depressing look at the near-impossibility of making it in show business, yet the film comes off as effortlessly edgy, hilarious and subtle, when ultimately its message is something bleak and disheartening. \"King\" is the work of a filmmaker with genuine passion for what he's skewering, and it's one of the greatest Hollywood satires ever made while the story itself is set in NYC. It just goes to show how well Scorsese and the late screenwriter Paul D. Zimmerman understand the worrisome silver lining to America's all-consuming intoxication with celebrity and media culture: better to be king for a night, than a schmuck for a lifetime. (100/100)",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a flat out great movie, After watching this I have noticed I tend to like Scorsese's lesser known films. Ex. Shutter Island.",
            "review_date": "2013-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie about a lonely, delusional man.",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My Favorite Comedy Film Is 1933's Duck Soup.",
            "review_date": "2013-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Martin Scorsese is master crafting more masterpieces than I imagine anyone else making. This movie just brings you back to the times when De Niro starred in great movies and totally placing himself in the position of the character he's playing and making sure we realize that he is not just playing himself each movie. This movie he gets absolutely scary. It has a comedic undertone and sort of a sympathetic one, even if this guy is absolutely insane and doesn't even know it. With this exceptional performance, he makes the movie totally unnerving.\r\n\r\nOur main character, Rupert Pupkin, happens to meet Jerry Langford, who's a popular talk show host who feels losing a bit, on the way out after the show. They share a limo together and Pupkin soon thinks he and Jerry are friends and he continually tries to get himself on his show through all sorts of ways.\r\n\r\nThis movie has plenty of funny gags and all, but it's all about the character of Rupert Pupkin. Without him and Jerry Lewis, the movie would completely fall apart. The funniest part has to be when Pupkin gets confronted by the police, because he actually thinks he won't go will jail and he will do his stand-up routine if he tells them where he captured Jerry Lewis. Awkwardly, Scorsese makes this the one of the most unnerving parts. He's such a sympathetic character for being such a psychopath and Scorsese does this all funny scenes in the movie. It's done so brilliantly that I can't put it into words. The final part of the movie almost had me looking away from my computer screen. It was so hard to watch in the best way possible. \r\n\r\nI haven't talked about a lot of the casting yet. There's only three main characters, those being Pupkin, Rangford and an obsessed woman who wants to love Rangford. Scorsese has almost always casted every guy character in his movie correctly. I've always thought he's had a problem selecting his female leads. While Cybill Shepherd was great in Taxi Driver, Cameron Diaz was horrible in Gangs of New York along such lines as Leo DiCaprio and Daniel Day-Lewis. The main female lead here didn't have a lot here except some satire of celebrity obsessed people. Jerry Lewis plays his role really good here. His facial expressions are amazingly funny and what he has to put up with this movie just makes his down to Earth portrayal just that much better.\r\n\r\nThis is without a doubt one of the most underrated gems of all time and I am very reluctant to give it a 10/10.",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think De Niro is my new favorite actor. This movie astounded me by how good it is.",
            "review_date": "2013-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As with After Hours and The Last Temptation of Christ, King of Comedy is one that tends to be forgotten amidst Scorsese's more widely known and oft-hailed classics such as Taxi Driver, Raging Bull, Goodfellas etc. It's a shame that this savage satire on celebrity culture is so overlooked, as it is arguably one of his best, and undoubtedly one of his funniest movies. Likewise, it's probably DeNiro's most underrated performance. He is truly remarkable as the deranged would-be comedian extraordinaire Rupert Pupkin. \r\n\r\nThe story centers around Rupert Pupkin(Robert DeNiro), a slightly troubled(to put it mildly), fame-hungry man who fancies himself the next big player in the world of stand-up comedy. In his desperation to fulfill this dream Rupert decides to kidnap his ''friend'' and idol Jerry Langford(Jerry Lewis), in the hope of ensuring a spot on television to finally perform his stand-up in front of a live audience and convincing the world at large of his self-proclaimed talents.  \r\n\r\nOne of the things that struck me while watching the movie was the close similarity with Scorsese's less comedic yet equally unnerving Taxi Driver. Like Travis Bickle, the iconic hero of that movie, Rupert is a deeply troubled character, at once deluded and narcissistic. De Niro channels Bickle in Pupkins obsessive nature, confrontational attitude and eerie charm. Both movies explore existential themes of alienation, loneliness and obsession. Despite his outward, pompous charisma Rupert is a lonely man who spends most of his time in his own manic head, conversing with life-sized cardboard cut-outs of the celebrities he so desperately wishes to be his peers. Unlike with poor Travis Bickle, Scorsese was kind enough to give Rupert a solitary companion, the equally bonkers and fame-obsessed Masha(a brilliantly demented performance by Sandra Bernhard). Pupkins is a more amiable and goofier character than Bickle, but in all honesty he is no less menacing. From the very first scene you can sense a dangerous person bubbling beneath his chummy exterior. To harp on about the similarities with Taxi Driver, there is also that strange ambiguity, particularly at the ending, where the apparent reality of the movie seems to have meshed with our hero's obsessive fantasies.\r\n\r\nArguably the movies greatest scene is where Pupkins finally gets the opportunity to perform his stand-up in front of a live audience. Wisely, it seems the writers elected that Pupkins comedic material should not completely stink. It's just mediocre, miserably mediocre; just good enough for someone like Pupkins to believe it's truly exceptional.  \r\nIt's a strangely unsettling scene- watching someone as emotionally damaged as Pupkins recite wacky jokes about his difficult childhood. Scorsese seems to recognize something sad and wounded in the art of stand-up comedy. I was reminded of the scene in the final act of Raging Bull, where Jake La Motta performs a dire piece of comedy at his club, and how the strained laughter of his audience seemed to sum up the characters piteous downfall. Here, again, the stand-up scene is more depressing than humorous; Ironically it  may be the least funny scene in the movie. One might feel uneasy laughing at such misery and degradation, if certain scenes weren't so absurd and at times clearly played for laughs. One particular scene springs to mind, where our hero attempts to force his way through Langford's TV studio. The situation is painfully awkward, yet somehow transforms into a slapstick cat-and-mouse chase scene. Misery and comedy are never too far apart in this movie.\r\n\r\nOn the whole, this is quite a dark movie, much darker than I expected it to be. It's also quite cringeworthy and sad but undoubtedly very funny. Rupert might be a lame comedian, but he makes for an immensely funny character. There's much more to discuss about this movie so I may have to edit this review in time. Like the best work of Scorsese and De Niro, it is a dense and subtle piece that demands a re-watch. But for now, I am happy to declare that this is a marvellous, funny and thought-provoking movie. An underrated gem. 10/10.",
            "review_date": "2013-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "more people need to see this movie",
            "review_date": "2013-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert De Niro gives an iconic performance, perhaps the greatest of his career, as a mentally deranged wanna be entertainer/comic who is jealous and resentful of Johnny Carson like Jerry Langford (played very well by Jerry Lewis). De Niro ultimately makes an insane bid for fame aided by a deranged friend of his played brilliantly by Sandra Bernhard. Often disturbing but also part funny , part thrilling, and always entertaining, Scorsese's film is one of his very best. Scorsese also used members of his family in the film, including hilariously, his own mom, who is heard but never seen.",
            "review_date": "2013-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Niro acting was amazing, a really painful to watch film with a really bizarre and yet sympathetic main character.",
            "review_date": "2013-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible complicated and hard characters; tuff cinematography choses; and average-viewer not friendly plot. But Scorsese/De Niro/Lewis just pull it off and make a masterpiece ones more.",
            "review_date": "2013-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful film that was years ahead of its time!",
            "review_date": "2013-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit tedious and not very interesting",
            "review_date": "2013-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much like Rupert Pupkin steadily working his way into Jerry Langford's life, The King of Comedy is making its way up my personal Scorsese list. Like a \"funny\" Taxi Driver, it's study of loneliness, fantasy, and celebrity is so acute and palpable, with De Niro giving one of his best performances in a career full of best performances. As unsettling as it is hilarious, and that final comedy act...it's just everything.",
            "review_date": "2013-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An underrated product of Scorsese and De Niro's remarkable partnership, The King Of Comedy is a surreal character examination that finds De Niro in a wonderfully complex role as the dangerously obsessed Rupert Pupkin.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long live Rupert Pupkin!",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really thought this was pretty great, and I was surprised it wasn't even really considered for many awards.  Perhaps it was a head of time.   DeNiro gives a pretty amazing erratic performance.   It kind of predicts the future of how hungry for fame people have become and what lengths they will go to get it.",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What I love most about \"The King of Comedy\", other than the fact that it's a Scorsese gem that time has more or less forgotten, is that it's an uncomfortable ride, with one hell of an ending and an astoundingly prescient take on stardom in this age of reality TV and 15 seconds.  Jerry Lewis and Sandra Bernhard highlight an inspired cast headlined by Robert De Niro in top form.  It's easy to see why the film has been so misunderstood but I'd say it has even deeper meaning today than when it was released.  For Scorsese purists, this is amazing and relevant stuff.",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It might be the best film that Martin Scorsese ever made, a work that is as soul-crushing as anything by Sirk or Ray. Truly unbelievable.",
            "review_date": "2013-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In making a traditional black comedy, one might wish to balance the laughs with the dark elements and come out with a semi-feel-good movie that might also make you feel queasy about feeling good. Director Martin Scorsese underscores this with his film The King of Comedy (1983) about a struggling, unemployed comedian in the making (Robert De Niro) in which comedy seems to be his only interest; chiefly the popular comedian Jerry Langford (Jerry Lewis) who is a rather sad man. De Niro's character Rupert Pupkin attempts to set up numerous meeting with Langford, only to be spurned each time by his breezy secretary, leading him to resort to more and more drastic measures. Pupkin is a very unusual type of antihero, one who has absolute confidence in himself and whatever he does and is persistent in his efforts to achieve fame. He is his own unique kind of psychopath. While not grounded plot-wise, the film instead takes the anything could happen approach, where Pupkin is as clueless as the audience is about what his next move will be, but when he does act, it is not upon logic or reasoning but emotion. It was not very popular upon release, receiving limited theater coverage and mixed reviews, but became more recognized among critics later on as another great pairing between its star and director.",
            "review_date": "2013-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb DeNiro performance in quite a comic movie of a irritatingly persistent and almost psychotic personality. Hope not many we're inspired to do the same. As a movie , very entertaining.",
            "review_date": "2013-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a film that came as a stark warning in the early 80s. And now that it's grimmest predictions have come true, it is all the more stirring and remarkable. The King of Comedy is in a way a black comedy, and in a subtle way a little horror film; it is a rumination on the dangers of celebrity culture, celebrities, and the sensibility in our country to allow anyone to become famous for the entirely wrong reasons. Rupert Pupkin is a fellow who fashions himself quite the comedian. And boy does he idolize Jerry Langley. He thinks his idol will help him make the big time as easily as possible. Only Langley (played by an alarmingly sour Jerry Lewis) is a jaded man who detests being as famous as he is. And Pupkin is completely insane. The film grows in a quiet crescendo. It is only very slowly that you realize how demented Pupkin (played as eerily earnest as possible by Robert De Niro) is. He starts off as a somewhat obnoxious guy who can't take a hint. He becomes a stalker. You see that each day for him is a delusion in which he lives as more famous than Langley himself. And when Pupkin performed his comedy routine to a black and white cardboard crowd, who in his mind adore him, well, it's clear just how deranged he is. And yet he never has that big crazy moment. He is consistent throughout: collected, pleasant, earnest, assured of his own success. Despite seeing the hell that is Jerry's life, and being the partial cause of it, he wants nothing more than to be famous, at any cost. (Stop reading if weary of spoilers; analyzing end is essential to criticizing film). \nAnd the clincher is: Rupert Pupkin wins. He goes to monstrous lengths to get what he wants, and wins. He becomes more famous than anyone but himself would have dreamt. He is the Spencer and Heidi. He is the Octomom. He is TMZ. He is OJ writing the 'If I did it' book. He is everything wrong with American celebrity, and he becomes a veritable folk hero. This film was more on the nose than Scorsese would dare to believe, like the Truman Show. It is a quiet, simple story of obsession and glory, that, if you can deal with its slow pace, is a true masterpiece.",
            "review_date": "2013-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scorsese and De Niro's less appreciated opus, a box-office dead-on-arrival upon its release, after RAGING BULL (1980, 8/10), Scorsese decisively contemplated to change the lane from the bloodbath sport-drama fest, so it comes this black comedy, an unsung maniac-opportunist-comedian Rupert Pupkin (De Niro), disillusioned by his hankering friendship with the on-the-job talk show host Jerry Langford (Lewis), colludes with the radical Jerry fanatic Masha (Bernhard), they kidnap him and extort the show runner to allot ten minutes for Rupert to perform his monologue on TV, and unlike any other plans usually go awry in order to leave room for twists, Scorsese and writer Paul D. Zimmerman instrument an ambiguous comeuppance thanks to the film's shrewd amalgam of reality and hallucination.\n\nAs a pungent satire to the instant showbiz fame and the celebrity's overwrought mental condition with the autograph hounds and devout stalkers, the film is an eloquent body of work in manipulating its viewer's empathetic oscillation between Pupkin and Langford, for instance, on the one hand, I feel repellent towards Jerry's hubris and snootiness (his deadly oomph towards women is something I could never understand, what a great job for Bernhard to deliver the madness in front of such a distasteful sine qua non), on the other hand, when put myself in his shoes, the nettlesome Pupkin is a parasite-like cipher one instinctively despises. The same could be transposed with Pupkin, one moment you regard him as a deadbeat chatterbox by badgering Jerry, next scene you feel sorry for him because we know Jerry will shatter his dreams sooner or later, and when that dramatic moment eventually happens, the interplay among Pupkin, Jerry and Rita (Pupkin's love interest played by De Niro's then-wife Abbott) is spontaneous, awkwardly cringing and impeccably acted.\n\nDe Niro has unwaveringly forsaken his acting skill since his glorious years (70s to 80s), a committed incarnation of a stand-up comedian in his hard-earned live stint, but an overall, his comedian bent may be not as hyped as he claims, at least, not ground-breaking enough to be at a king's level, thus making the ending resound with a more cynically suspicious irony. De Niro's methodological strenuousness seems to be markedly discordant with Lewis' more naturalistic instinct-driven skill, which actually is an opportune win-win situation both for the comic vein and for the actors, they are ranking high in my respective categories. Also Bernhard is spectacular in her nut's sickly possessiveness despite of her less-limned backstory, maybe she is a much qualified comedian than her pal. \n\nAn unfeigned delight to watch this film and to revere more towards Mr. Scorsese, whose all-purpose greatness is an unerring beacon to guide his disciples and an insatiable lure to his ceaseless fan club recruits.",
            "review_date": "2013-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This spiritual sequel was hard to watch.  However,  your mileage may vary.",
            "review_date": "2013-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A psychopathic wannabe comic who idolises a talk-show host comes up with a plan to appear on his show. In favour of other more popular titles, this is an often underlooked Scorsese film. But it's hard to understand why, with De Niro in tip top shape portraying the obsessive loser lead character and Jerry Lewis who, after a lifetime of screwball comedies, is surprisingly good in his dramatic role. Furthermore, the film is gripping, alternating between tension and uncomfortable comedy that in the end is resolved and wrapped up in a very satisfactory way and adds social comment weight to the film in relation to mass media television and one side of the creepy and frightening world which it spans.",
            "review_date": "2013-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very underrated film to say the least. This film is pure genius and a true comic gem. The legend Scorsese takes us into black comedy and drama with this great film that truly excels from one of the best performances by Robert De Niro. \n\nDe Niro plays a psychotic aspiring comic, Rupert Pupkin who dreams of one day being \"the king of comedy\" with his talk show idol Jerry Langford, played in a memorable role by Jerry Lewis. De Niro often has these fantasies of performing live comedy with his \"mentor\" Jerry in front of audiences when it is all a figment of his imagination. De Niro however is a psychopath but strange enough a likeable one. One whom the audience can sympathize with and one we can understand. Pupkin saves Jerry from a mob of people but after various attempts to get his attention he decides to kidnap him this way he can finally get his chance to be \"king for the night.\" \n\nThe film is structured perfectly and Scorsese not for a minute leaves you bored. This film is a great accomplishment for himself and for Mr. De Niro who as always gives a powerhouse performance like no one else can. The film despite being very dramatic, and serious with its story is also very funny. De Niro's jokes, mannerisms, and actions are spot on I swear you would think you were watching a real comedian. Another excellent collaboration from Scorsese-DeNiro.",
            "review_date": "2013-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A vaguely creepy but very funny satire of our culture's obsession with fame and celebrities, The King of Comedy is an underrated and very ambitious movie in Martin Scorsese's filmography, and it boasts a typically perfect performance from Robert De Niro in the lead role. The movie follows Rupert Pupkin, a sociopathic man who balances his time between developing his comedy routine and stalking his idol, a talk-show host named Jerry Langford (played by Jerry Lewis) who greatly values his privacy. After he is able to have a brief conversation with Langford, Pupkin begins to obsessively pursue him in order to perform stand-up on his show, and Pupkin eventually resorts to drastic measures to achieve this goal. The movie is very uncomfortable very frequently because Pupkin repeatedly puts himself into painfully embarrassing situations, and De Niro plays him so well that it's hard not to cringe at the social ineptitude of his character. The movie is a black comedy, but it definitely has an eerie feel to it, partly because Pupkin is a complete sociopath and partly because the message of the movie is even more relevant now than it was thirty years ago. The King of Comedy is one of Scorsese's more overlooked movies but it's definitely one of his better ones, and it's just as likely to make you laugh as it is to make you squirm in your seat.",
            "review_date": "2013-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very underrated Scorsese movie. I don't think it's as good as Taxi Driver, but it is definitely worth a watch for Scorsese fans and movie fans alike. For those of you that liked The Cable Guy, you'll like this movie. If you didn't, I think you'll still like it. It's very similar: Robert De Niro plays an aspiring stand up comedian and obsessive fan named Rupert Pupkin. He's obsessed with a talk show host named Jerry Langford, who is played by Jerry Lewis. I don't want to waste a whole lot of time on story for those that haven't seen it, but you can kind of guess where it could go from there.\n\nRobert De Niro is great as Rupert Pupkin. Scorsese says that De Niro's best performance under his direction is as Rupert, and I can definitely see it. I love the idiot savant characteristics that De Niro plays; he's practically autistic. You laugh at his obsessiveness, but are creeped out by it at the same time. Jerry Lewis also deserves a lot of praise. I haven't really seen his comedy, but he did a very good job getting into this character. I did not like Sandra Bernhard. She was constantly yelling, and I guess it fit her character, but she went over the top too much and seemed as if she was playing two emotions: angry and seductive. Mainly, it's angry, and it's annoying. Diahnne Abbott, who plays Pupkin's \"girlfriend\" and was De Niro's wife in real life at the time, is not without mentioning. She didn't blow me away, but she did do a good job.\n\nThere's a lot of good things to say about this movie. This is one of the few films (and I can't think of any others at the moment) where I felt the dream sequences are appropriate. They really allow you to go into the mind of Rupert Pupkin, and they're very enjoyable to watch. I also love Scorsese's direction. He doesn't give a damn about continuity. There's a conversation between De Niro and Bernhard on the street. In one shot, they're walking. In another, they've stopped. I'm one for continuity, but in this scene and in many others, you're usually so absorbed in the performances and the scene that you don't care. I also love what he does in the sequence where De Niro and Abbott go out on a date, with the guy in the background imitating Pupkin. That was absolutely hilarious, and one of the funniest parts in the movie. Again, don't want to give away what happens, but you'll know what I'm talking about. Another little moment I loved was when Pupkin was going in an office, and he tries to open the door inward, but realizes he can only pull it outwards. It's a little moment, but we've all been there and it's great to see it in a movie. I also love the moment where the cops are chasing Pupkin back and forth and Scorsese just holds it on a long shot.\n\nThere are things that I didn't like about it. I definitely thought the first half of the movie was much stronger. Not that the second half wasn't good, but in my opinion it became much more of a plot, and I feel that kind of hurt it for me. Again, I did not like Bernhard's acting at all.\n\nAs for the end, I believe it was real and not a dream sequence. It was a bit of a stretch for me that a guy could still be famous after 2 years in prison, but I could buy it as being real. The media usually sensationalizes people who are infamous, so for Rupert Pupkin to be made a sensation like that doesn't surprise me. It kind of reminded me of Network in that way, albeit Network is more about that, and The King of Comedy not as much. For example, we remember the names of the Columbine kids but not the name of someone who spent their entire life fighting cancer. \n\nOverall, I really liked the movie and it is a Scorsese film that deserves to be watched and recognized.",
            "review_date": "2013-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A darkly funny and timely story featuring one of DeNiro's very best performances as the creepy but oddly endearing Rupert Pupkin. Sandra Bernhard didn't work for me at all (her character's inclusion primarily serves plot purposes only), but everything else is sharp. The script is extremely clever. One of Scorcese's overlooked gems.",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The same point of view for criticizing american tv (Warhol's sentence). Something we can rescue in this movie is De Niro's performance.",
            "review_date": "2013-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is frustrating to watch, unpleasant to remember, and, in its own way, quite effective.",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Niro's mustache is so funny hahahah his name is pumpkin",
            "review_date": "2013-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(78%)\nA superb central performance from DeNiro, and a great script that's even more relevant today  than it was then, make this one of the top comedies of all time. Some of the ideas are a real mix of horror and comedy as DeNiro has imaginary conversations with cardboard cut-outs of celebrities, and the parts where he tries to get a meeting with Jerry Lewis are fantastically well handled. Without a shadow of doubt well worth a watch.",
            "review_date": "2013-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sad commentary on the lengths to which a person will go to achieve his dream.  Not a comedy at all, this is DeNiro's strangest, weirdo character ever and that is saying a lot.  The movie was a box office bomb, losing 18 million dollars more than it cost to make.\n\nSEE the trailer here:\n\nwww.youtube.com/watch?v=0wVhCCo02P4\n\n[img]http://t1.gstatic.com/images?q=tbn:ANd9GcRkmr1qwgJ1yL5NLNQDS9Xjm9WXNUkEDiR8HLMpd2KVTlWaVJIg[/img]\n\n\nWhile DeNiro in a comic role is about as disturbing as Jerry Lewis in a heavy, angry dramatic role.  Both are out of their element and with the stories of Lewis I have heard show him to be every bit as mean and ugly as his role in the film.\n\nRupert (DeNiro) summates the situation and the whole point of the movie well.  He tells Lewis (with a fake gun pointed at Lewis) that all Lewis had to do was listen to his tape, listen to his comic routine and the whole kidnapping of Lewis would have been unnecessary.   Lewis gets the same treatment from HIS staff that Rupert gets trying to audition for a spot on the late night show ( it mimicks The Tonight Show btw).\n\n[img]http://t2.gstatic.com/images?q=tbn:ANd9GcTWHbtxoxFUvoAoLMB-37LmIS10ri8a9Zu_wszNLuV6AXpJ7zqvPQ[/img]\n\nThis film starts off so truely funny and until the kidnapping of Jerry Langdon (Jerry Lewis) it was funny.  Then it took a ugly turn to being a crime drama.  Most unpleasant was to see Jerry Lewis smack a near naked woman (his captor along with Rupert).  THAT need not have happened.\n\nI actually lost total respect for Jerry Lewis, the exalted comedian in this film.  Sure, its a movie, but Lewis seemed not acting at all as he grew increasingly hostile and unsympathetic to his kidnappers.\n\n[img]http://t0.gstatic.com/images?q=tbn:ANd9GcTegJVsgHOM5zAwdJK6ld4dKbRjCAxV963Bf8RXrTpTHkEJvlXs[/img]\n\n\n\nAt some point Lewis actually seems to want to feel something toward the struggling comics like Rupert (DeNiro), but instead he only becomes human at the point of a gun.\n\nEssentially for me this film was another Travis Bickle character, a deranged comic that behaves similarly as Woody Allen!   At one point in the film I actually thought Scorsese was trying to mimic a Woody Allen film!  The problem though is Martin Scorcese can no more make a comedy than Woody can make a serious drama.\n\n[img]http://t1.gstatic.com/images?q=tbn:ANd9GcTTeZ8jWrqtV8iOM4q-vq4_WQ_pahr2JJp1YZ_GHbbIakSWmoHF[/img]\n\nSee the film if you have not already.  It's great but it can make you uncomfortable and uneasy especially when Rupert doesn't take no for an answer and acts out his dillusional fantasies.\n\n\n\n\n\nREVIEWS:\n\n80% \nCertainly an interesting and thought-provoking one here. Very much the kind of performance that I like to see from DeNiro and Bernhard and Lewis didn'...\n\n70% \nAlthough it is scarce of any feeling and ultimately unrewarding, to watch it unfold is interesting and sometimes funny.\n\n\n\n---Roger Ebert says: \"Martin Scorsese's \"The King of Comedy\" is one of the most arid, painful, wounded movies I've ever seen. It's hard to believe Scorsese made it ... It is frustrating to watch, unpleasant to remember, and, in its own way, quite effective.\"\n\n--- Although the film was well received by critics, it bombed at the box office. De Niro said that the film \"...maybe wasn't so well received because it gave off an aura of something that people didn't want to look at or know.\"\n\n[img]http://t1.gstatic.com/images?q=tbn:ANd9GcRt3gKaSQD3faVjPSejQAByfH_NfBnVAmLYMak-y0VEEHPtCD4spA[/img]\n\n\n\nNOTES:\n\n1  Scorsese said he felt Lewis' performance in the film was vastly underrated and deserved more acclaim.\n\n2   He (Lewis) suggested an ending in which Rupert Pupkin kills Jerry, but was turned down. As a result, Lewis thought that the film, while good, did not have a \"finish.\"\n\n3   Scorsese's first choice for talk show host Jerry Langford was Johnny Carson.  The entire Rat Pack was also considered - specifically Frank Sinatra and Dean Martin - before a decision was made to select Martin's old partner, Jerry Lewis.\n\nScorsese has called De Niro's role as Rupert Pupkin his favorite of all their collaborations.\n\n4   The King of Comedy was the first film to open the 1983 Cannes Film Festival.\n\n5   Scorsese suggests that Rupert Pupkin's character fails to differentiate between his fantasies and reality. Scorsese sought to achieve the same with the film so that, in his words, the \"fantasy is more real than reality.\"\n\n\n[img]http://t0.gstatic.com/images?q=tbn:ANd9GcTy-P-jHOwC3AslVKEG29JNQF0AHqrTV8bCNUeQM9XwPKzsc3s3xA[/img]\n\n\n\nCritic's lists\n\n-Halliwells Top 1000 #180\n-1001 Movies You Must See Before you Die\n-Jonathan Rosenbaum: 1000 Essential Films\n-The New York Times Guide to the Best 1,000 Movies Ever Made--Total Film Presents The 100 Greatest Movies Of All Time #85\n-Empire's list of 500 greatest films (no. 87)\n\n\nCast\n\nRobert De Niro as Rupert Pupkin\nJerry Lewis as Jerry Langford\nDiahnne Abbott as Rita Keane\nSandra Bernhard as Masha\nShelley Hack as Cathy Long\nEd Herlihy as himself\n\n[img]http://t0.gstatic.com/images?q=tbn:ANd9GcRH7es9NOGr4jueemItV6xuwZPOJ_IIQc-0xmt2LeLrbskE361D[/img]\n\nDirected by Martin Scorsese \nProduced by Arnon Milchan \nWritten by Paul D. Zimmerman \n\nRelease date(s) February 18, 1983 \nRunning time 109 minutes \nCountry United States \nLanguage English \nBudget $19,000,000 \nBox office $2,536,242\n\n[img]http://upload.wikimedia.org/wikipedia/en/thumb/8/84/Kingofcomedy.jpg/220px-Kingofcomedy.jpg[/img]",
            "review_date": "2013-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A relatively unheard of Scorsese film, it is in fact one of his best. De Niro's performance as Rupert Pupkin is phenomenal, and this movie's themes about fame in America are as relevant today as ever.",
            "review_date": "2013-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I generally liked it. I thought it blended well the comedy and the creepy, with great performances from everyone.",
            "review_date": "2013-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very unique film featuring great performances by the whole cast",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it is scarce of any feeling and ultimately unrewarding, to watch it unfold is interesting and sometimes funny. As Rupert Pupkin, De Niro is twisted, despicable and intolerable. We feel disturbed throughout because of the sheer creepiness of the character. With him comes and unsettling atmosphere, we're watching an unstable performance go to extreme lengths to get his break. It's fascinating.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid, if a little paper thin, with moments of class evening out the far fetched cracks - especially in todays CCTV, security obsessed world. DeNiro is the stalker here, obsessed with gaining credability for his comedic ability. He goes to the depths of kidnapping his idol, a famed TV comedy celeb in the aim of getting on TV to gain fame and recognition. Its well played out by all the leads, especially Jerry Lewis, who surprises with a perfectly balanced performance. Perhaps unusually here, Scorcese suggests the threat of violence rather than carries it out, which probably hinders the film in a way watching it nowadays. Its relevancy though, is never in doubt. Today more than ever.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly an interesting and thought-provoking one here. Very much the kind of performance that I like to see from DeNiro and Bernhard and Lewis didn't disappoint either.  Certainly an ambitious project from Scorsese here as is often the case. I feel that it paid off and the result is an intriguing and line-blurring black comedy that shows the desperation in human nature from various angles, be it the psychopathic and somewhat terrifying Pupkin, the even more terrifying Marsha or the general public in the film who welcome Pupkin's insanity with open arms. What makes it more chilling is how convincing it's ending premise is- just look at Issei Sagawa for example- a cannibalistic murderer who went on to become a TV personality and even a food critic (apparently having a taste for human flesh means you have a good palate!?).  Despite all of it's benefits though, it's not hilarious and it simply doesn't go far enough to be as terrifying as it could be. This is understandable though, there's a lot of emphasis placed on Pupkin being a \"nice guy\" behind the sheer insanity and this makes for  a lot of uncomfortable viewing & so the moderate not-too-funny, not-too-scary tone fits well but it still makes for a frustrating watch, something that could probably have been avoided without damaging the integrity of the film.",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a thriller, a comedy, and ultimately, an incredibly biting satire and social critique.",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rupert Pupkin: Better to be king for a night than schmuck for a lifetime. \n\n\"It's no laughing matter.\" \n\nThe King of Comedy has to be one of Martin Scorsese's most underrated films and also one of De Niro's most underrated performances. This film, like many have said, has a style that is similar to Taxi Driver, and since it's again a Martin Scorsese-Robert De Niro film, it's easy to lose this one in the shuffle. Although being similar to Taxi Driver, The King of Comedy definitely has a life of its own. There's so much to like about this movie.\n\nRupert Pupkin weasels his way into talk show host Jerry Langford's limo after his show. He pleads with Jerry to let him go on the show and that he's a stand up comedian, but Jerry explains to him that he has to start at the bottom. Trying to get rid of him, he tells him to call his office and they'll set something up. Rupert thinks this is his shot at the big time, but when he calls the office, he is ignored. So he goes into the office, but slowly begins to realize that he's getting the brush off.\n\nThis is a great film about the worship of the celebrities and also the desire to become a celebrity. This is even more relevant today then it was when the film was made. Also, I loved how insightful the writing of Rupert's stand up comedy was to get a little background into his early childhood and see why he seeks the attention of the world. I believe this is something that is glanced over when I read other reviews that say there isn't enough character development of Rupert's character. His stand up comedy it tells it all, as he says early in movie, in one of his practice/fake meeting with Jerry scenes, that he takes all the screwed up stuff from his life and makes it comedy.\n\nThe King of Comedy is an excellent film from Martin Scorsese. Robert De Niro is outstanding as the delusional and tragic figure of Rupert Pupkin, and Jerry Lewis is a surprise as Jerry Langford. He's terrific in both the real life scenes and Rupert's delusional fantasies. This isn't a film to be missed. It may not be talked with Goodfellas, Taxi Driver, Raging Bull, or even Casino, but this is every bit a great Scorsese/De Niro collaboration.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite simply a wonderful film, with a superb performance by Robert De Niro.",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie! Def worth watching. The screenplay was terrific!!",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best of Scorsese.",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Scorsese's best and shamefully under appreciated films.  DeNiro give another unsettling and electrifying performance as Rupert Pupkin, an odd man who takes to kidnapping his late night comedy idol after he is shot down at getting a chance to show his talents.  The film is maddening, audacious, and full of fine performances.  A must see!!",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strange, quirky satire, one that gets in your head. There was a lot of controversy about releasing this movie, but I am very glad it was released. Extremely funny at times, with some amazing performances from De Niro, Sandra Berhnarde and a slick cameo from the great Scorcesse himself. This black comedy may be slightly underated and doesn't live up to its former brothers taxi driver and mean streets, but in itself a dark, sinister and twisted plot with some extremely interesting characters.",
            "review_date": "2013-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At times the film seems strangely restrained, never going for a payoff.  But, ultimately, that is it's brilliance.  De Niro plays another mentally ill character, but he plays him differently than he had ever in previous roles.  A greatly rewarding movie that only truly reveals itself on multiple viewings.  Most of Scorsese's previous work was deeply intimate and personal, but this one holds it audience at arm's length, but it does so intentionally, and ultimately proves that Martin Scorsese isn't just a director who makes a certain type of great movie, but simply a great director.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant, underrated black comedy from Scorsese.",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story, great dialogue, great acting, great direction, great movie.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing that hasn't been done a thousand times before.",
            "review_date": "2012-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Niro puts method acting to fine use. Creepy, awkward, but effective.",
            "review_date": "2012-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thanks to a hilariously sardonic script from Paul D. Zimmerman, a delightfully awkward turn from Robert DeNiro, and the always-memorable directorial techniques of Martin Scorsese, \"King Of Comedy\" definitely surpasses the tepid and rash responses it initially received in the 80s.",
            "review_date": "2012-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The King of Comedy\" is a true original that guts the glamour from showbiz and finds it cold and empty inside. Then there's the media, always ready to create another celebrity, even if he's an autograph hound and hack comic turned kidnapper who believes he's earned a shot in the spotlight. Cynical and melancholy, at times hilarious, it bombed when first released, but has been surprising video treasure hunters ever since.",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is disturbing how uncomfortable Robert De Niro can make you feel.",
            "review_date": "2012-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this film is more relevant today than ever. Great performances by Sandra Bernhardt and \"Scorcese standby\" DeNiro.",
            "review_date": "2012-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(rating change 3.5 - 4 because rupert pupkin's the man strange) its woolwarts apart from other scorsese de niro collabs. but i loved the performance by robert de niro rupert pupkin is odd but strangely likeable hes crazy in a nice way.",
            "review_date": "2012-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So underrated.  Great performance by RDN.",
            "review_date": "2012-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert De Niro is the King!",
            "review_date": "2012-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sandra is magnificent and that's a damn good thing because both Scorsese and DeNiro seem to have lost their way. Jerry Lewis isn't even any good and he's the reason the film exists!",
            "review_date": "2012-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The King of Comedy is a very intriguing film, it balances terror and humor perfectly.",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unsettling through its strange pacing, use of humor and De Niro's spot on portrayal of a struggling and disturbed comedian; \"The King of Comedy\" equally balances a goofy charm with a dark undertone resulting in a film that is undeniably entertaining.",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of it was boring, but never the less a good movie",
            "review_date": "2012-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a film I have wanted to see for a long time and it finally aired on TV this week. I am very happy to say that may anticipation wasnâ(TM)t misplaced, itâ(TM)s an excellent film! Great direction, writing and performances; all round it hits all the high notes for me and youâ(TM)re even left with a small mystery at the end. But more of that after this very brief summary.\n\nRupert Pupkin is obsessed with celebrity comic and TV host, Jerry Langford. He inhabits a fantasy world where he and Langford are close friends; as well as being extremely rich and famous (of course). Having conned his way into Langfordâ(TM)s car one evening after a show, with the help of another fan, Masha. Pupkin starts pestering Langford to give him a spot on his chat show. Not wishing to appear rude, Langford tells him to ring the office and theyâ(TM)ll arrage to look at his work. Of course Pupkin takes this much further than intended and eventually ends up in trouble with the buildingâ(TM)s security guards. But how much further will Pupkin take his obsession? I think Iâ(TM)ll leave it there or the Spoiler Police (Comedy Division) will be measuring me up for clown shoes (again).\n\nWith Scorsese in charge you know the film is going to be well made; and he doesnâ(TM)t let us down here. Itâ(TM)s an excellent production with some trule excellent performances. Talking of which; I have heard from several sources that this is considered the best; or certainly one of the best; performances from Robert De Niro. I must say his portrayal of Rupert Pupkin is quite stunning and Iâ(TM)m struggling to disagree with that assesment. I also thought Jerry Lewis did and excellent job as Jerry Langford; a more serious role for him and I thought he played it very well. Also worthy of note were; Diahnne Abbott as Rita Keane and Sandra Bernhard as Masha.\n\nI love the way Scorsese switches the action between reality and Pupkinâ(TM)s fantasies and back again. It really keeps the audience guessing just what is real and what is coming from inside Pupkinâ(TM)s head. This is where De Niro really shines; itâ(TM)s his perfromance that gives it creedance; Pupkinâ(TM)s dilusions become real because Ne Niro makes them appear so. Itâ(TM)s a masterful performance I must admit. As to the mystery; well, is the ending real or is it another of Pupkinâ(TM)s fantasies? Scorsese leaves us no clues which I think is pretty cool.\n \nSteelMonsterâ(TM)s verdict: HIGHLY RECOMMENDED\n\nMy score: 9.2/10",
            "review_date": "2012-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "is this not the creepiest, murky comedy ever?",
            "review_date": "2012-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly strange and offbeat film, with a central story that on paper looks like it may not work, but with geniuses like Scorses and De Niro on board it manages to become an extremely compelling and utterly engaging watch. De Niro gives one of his greatest ever performances, and is able to craft a character who you are compelled to watch, displaying both a level of fondness and a palpable sense of unease. At times comic, at others truly dark, yet always totally watchable and thought provoking. A real gem.",
            "review_date": "2012-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark look at desperation and celebrity, pure entertainment throughout.",
            "review_date": "2012-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dripping in satire, this comedy is one of Scorsese's finest work - but unfortunately also one of his least known.",
            "review_date": "2012-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps Scorsese's most underrated film and perhaps Jerry Lewis' best performance",
            "review_date": "2012-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert De Niro is mesmerising in this under-appreciated Scorsese classic. You will be amused, you will be terrified, but most of all enchanted by this work of art. Martin Scorsese I love you!",
            "review_date": "2012-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only someone with the phenomenal acting ability and on screen presence as Robert De Niro can evoke so many emotions in one performance: Rupert Pupkin will make you feel humour, sympathy and terror. Scorsese's fantastic, under-appreciated comedy drama satirises today's celebrity-fixated culture while providing the same level of thrilling entertainment as some of his biggest films.",
            "review_date": "2012-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert De Niro and Jerry Lewis give fantastic performances in this darkly funny, deeply unsettling, brilliant film.",
            "review_date": "2012-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "deniro's final monologue makes this movie worth watching",
            "review_date": "2012-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bizarre movie with a great performance by DeNiro. Definitely not a comedy, it is more of a psychological thriller dramedy. Very similar to Taxi Driver.",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantasic, so underrated. WHY!? It's brilliant! Classic Scorsese. Pupkin is a character that's even compared to Travis Bickle by Scorsese himself!",
            "review_date": "2012-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i'm a big fan of dark comedies, and \"the king of comedy\" is one of the great ones. martin scorsese directs one of my favorite performances from robert deniro and gets the only good thing i've ever seen out of jerry lewis, who i normally find obnoxious as hell. some of the scenes are painful or uncomfortable to watch, and that's scorsese's brilliant direction. i'm surprised this isn't one of his more populr films, as i think it's one of his best.",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Black Comedy\" may be pushing what is essentially a horror film. Martin Scorsese's terrifying film about celebrity worship, reality-bending ambition, and the obsession of fame is non-stop squirm-inducing, never allowing the viewer to breath for second. And nor should you. The film is dark, unsettling, and funny in the \"my stomach hurts I'm so uncomfortable, I think I need to laugh\" way, and speaks even louder volumes today than it ever did. De Niro is outstanding as the psychotic we sympathize to . . . well, on occasion - and Jerry Lewis plays the tired, worshiped idol of De Niro's Rupert Pupkin to perfection. As said by other critics, the film doesn't feel like it really has a center to balance on, and while that may hurt the film from being called a classic, it helps the film become something much more ambitious and much more memorable than if it had been any other way. And the worst part? It may be impossible to NOT see yourself in Pupkin . . . to a terrifying degree. Horrifying, but a triumph none the less.",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A black comedy, a strange ending.",
            "review_date": "2012-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Well I'm sorry. I made a mistake!\" \"So did Hitler.\" I can be quick with this one, it's easy: Scorsese, check. De Niro from the 1970s-mid 90s, check. Satirical black comedy about stand-up comics, celebrity worship, fame and fortune, check. See this movie, it's that simple. Ebert said \"it's hard to believe Scorsese made it.\" That's a load of bollocks. Scorsese has proven time and time again that he can make anythingâ¦and he can do it with phenomenal ease too :]",
            "review_date": "2012-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spellbinding. One of De Niro's most unique and captivating roles.",
            "review_date": "2012-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outrageously underrated movie only popular in the film buff circuit and played on indie movie stations.\r\n\r\nSoooo entertaining.   Soooo 1980's.   Soooo well acted.\r\n\r\nRiveting from start to finish.\r\n\r\nI can imagine this movie being very dry and slow to viewers who do not \"get\" the style.  \r\n\r\nI don't believe anyone born after 1990 could ever tolerate this film.\r\n\r\nIt's meant for a very specific North American audience who relates to 70s/80s primetime television and understands how to look down upon and smirk at a specific subclass of people with mental illness or social inadequacies.",
            "review_date": "2012-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rupert Pupkin is somebody everybody despises and finds obnoxious and annoying, but everybody can relate to his dreams and aspiration. The King of Comedy is a funny take on the extremes people would do for fame. One of my personal favorite movies.",
            "review_date": "2012-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best if not THE BEST acting movies Robert De Niro has done!\nClassic Movie! Waiting for the Blu-ray!",
            "review_date": "2012-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My second favorite Scorsese film, and I movie I have grown to appreciate more and more as time goes on. Many people dismiss this film and its really just a shame.",
            "review_date": "2012-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sooooooo good!!!! i'm sorry but De Niro is just a fucking ledge, this is a great film about the underdog trying to make it big and how he does it is so clever, its funny, crazy and one hell of a film",
            "review_date": "2012-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the quote I'd rather be king for a night than a schmuck for life",
            "review_date": "2012-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DeNiro at his absolute best.  Jerry Lewis is uncanny, and Sandra Bernhard is perfect!  This is perfection from the very beginning of the film.  If you haven't seen this yet, find a way to as soon as possible.",
            "review_date": "2012-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps, hands down, the most underrated film by Martin Scorsese. The King of Comedy is both hilarious and disturbing, shocking and sympathetic, and an interestingly psychological film that could be seen as a companion piece to Taxi Driver. At times this is a surreal film because we cannot always believe what we're seeing, literally, and because we have to tell ourselves this doesn't happen in real life. However, it echoes our own celebrity obsessed world and the status we put upon them, as well as the stress which comes with being a celebrity. Not to mention it touches upon the idea of the American Dream and how disturbing it very well may all be. An odd, off beat, complex film about fame and comedy, The King of Comedy goes down as both one of Scorsese's best, as well as one of the best Jerry Lewis performances with another director.",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of the Scorsese films I've seen, this is certainly the strangest.  Well, until Shutter Island (or S***ter Island as I call it) came along,\n\nDe Niro plays a struggling and truly delusional comedian named Rupert Pupkin who desperately wants to get on the biggest talk show on TV.  So much so that he'll hound his idol; the host of the show played marvelously by Jerry Lewis.  Pupkin and a fellow stalker named Masha actually kidnap the host in an attempt to ransom a guest appearance.\n\nThis is a bizarre film.  And it will DEFINITELY NOT appeal right away to fans of Goodfellas or Raging Bull.  It's a different film altogether.\n\nBut it's a great one.",
            "review_date": "2012-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A quirky, off-beat comedy of sorts from the legendary Martin Scorsese, staring the always brilliant Robert DeNiro in one of his most oddball roles ever. Not for everyone, but an enjoyable film nonetheless.",
            "review_date": "2012-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scorsese's dark comedy about a wannabe Comedian (DeNiro) who also happens to be a completely delusional madman who believes himself to be the next great King of Comedy and wants his hero, a Late Night TV host Jerry Langford (Lewis), to launch his career...even if that means holding a gun to his head.  This is a really entertaining movie, if you like a dark humor the way I do.  DeNiro's performance as Rupert Pupkin is fantastic.  You don't see him as a real loser too often.  Bernhard is also quite entertaining as Rupert's fellow Langford fanatic.  Really funny with a really dark streak, a fun one for anyone who enjoys this brand of humor.",
            "review_date": "2012-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How perfectly Scorsese tackles stand-up comedy with an underlying theme of mania. Its a bleak satire on the hoopla and hype for getting into popular media and show business. Its a fantastic dark comedy and De Niro in a role of an aspiring comedian gets his timing really perfect. De Niro stars as a maniac who can go to any length in order to get into his dream show business. De Niro's acting and performance as Rupert Pupkin is as good as and as unique as that of Jake La Motta or Travis Bickle. I've lost words now for De Niro's acting skills. \n\nThe film is significantly different from every other Scorsese movie but is still one of the most refreshing and unique stories told on screen! The movie's not a masterpiece or something but its really solid and enjoyable. The beauty of the movie is that throughout the movie one would think Rupert Pupkin would fail miserably... Flaw after flaw after pathetic flaws; but he doesn't fail... He comes out as a winner... He shines bright... The end as well as the movie is really classic... Some dialogues are really hilarious and some are really hard-hitting! Some scenes make you laugh out loud and some just manage to disturb you! Overall, a brilliant movie. Must watch for Scorsese and De Niro fans atleast!\n\n\"Rupert Pupkin: I'm gonna work 50 times harder, and I'm gonna be 50 times more famous than you.\"",
            "review_date": "2012-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious and clever.   Robert DeNiro gave an amazing performance.  This one might be getting added to my collection.",
            "review_date": "2012-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliantly awkward. So many times I cringed, but De Niro and Scorsese nail it.",
            "review_date": "2012-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DeNiro and Scorsese > Depp and Burton",
            "review_date": "2012-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Really Good. Deserves A Chance.",
            "review_date": "2012-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good soundtrack. Was a hit in its day; dated now, but worth seeing.",
            "review_date": "2012-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert De Niro plays a much different and peculiar role but does it well along wit some laughs.",
            "review_date": "2012-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe this Scorsese film isn't more well known than it is.  This is without a doubt the best performance I've ever seen De Niro give.",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "''Better to be king for a night than schmuck for a lifetime.'' - Rupert Pupkin.\n\nThis has to be Scorsese's most undervalued masterpiece. If you're a fan of the film maestro, then you owe it to yourself to see this movie. It's an excellent black comedy that satirizes our obsession with the celebrity lifestyle (whether it is wanting to be personally connected to them, like Sandra Bernhard's character, or the crazy things some people do in trying to become one, like De Niro's). It also has one of De Niro's finest performances too, he plays a more likable variation of the psychopath that was Travis Bickle (Scorsese named it as his favourite performance out of all their collaborations!) Supporting performances are all top-notch as well, especially the dramatic turn by Jerry Lewis, who pokes fun at his own image, and who I've noticed has taken a lot of stick for his slapstick works. An amazing OST, steady direction and great cinematography cap the lid on this gem of a movie. A must-not-miss, surely.",
            "review_date": "2012-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most underrated Scorsese movie. Robert De Niro gives one of his greatest performances.",
            "review_date": "2012-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most underrated movies of all-time",
            "review_date": "2012-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somewhere middle I found myself thinking \"I wonder what this movie would be like if Woody Allen had directed it?\"",
            "review_date": "2012-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scorsese establishes his sheer versatility in this hilariously off-beat black comedy.",
            "review_date": "2012-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you want to learn about the American Dream/Nightmare/Myth. Watch this fantastic film. Also touches on fame and celebrity culture in a fascinating way. Still relevant. De Niro gives his best performance. A totally over the top character, but it never feels forced. Brilliant.",
            "review_date": "2012-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scorsese surveys the obsessiveness of the celebrity culture, in this wonderful black comedy, with another masterclass from De Niro.",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Acting makes this movie",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As eery and surprisingly funny as one would expect from a take on comedy from Martin Scorsese, The king of Comedy offers some worthwhile performances and compelling satire, all the while set to fine storytelling and an original, in-depth plot.",
            "review_date": "2012-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest modern and underrated comedies from film legend, Martin Scorsese. Robert De Niro delivers one of his finest performances as Robert Plumpkin. This is a great film about one's obsession to make it in the entertainment industry at any cost.",
            "review_date": "2012-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The forgotten masterpiece from Scorsese, with a knockout performance from De Niro and dark humor to spare.",
            "review_date": "2012-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At the risk of attracting Scorcese-mad fanboys might I state that if The King of Comedy was made by a no-name director there is no way in hell anyone would be talking about it now, let alone labeling it Scorcese's underrated masterpiece.\r\n\r\nIn fact even De Niro thought there was room for improvement when he made basically the same film over a decade later in The Fan - which by the way is also boring and awful.\r\n\r\n()()()()()()()()()()()()()()()()()()()\r\n\r\nJerry Langford (Jerry Lewis) is less an 80s version of Jay Leno or Conan O'Brien than a variety show host version of Michael Jordan, Tiger Woods and Justin Bieber rolled into one. He is the best. Streets ahead of anyone else in the game and universally adored by one and all, unable to walk the street without constantly being delayed by admirers and autograph hounds, and after taping his show he must pass through a sweaty feverish throng of well-wishers and overzealous fans.\r\n\r\nIt is during this running of the gauntlet one evening that Langford meets Rupert Pupkin (Robert De Niro) - whether he wants to or not. Pupkin squirms his way into Langford's limo after a stroke of luck and against his better judgment - or perhaps to avoid further argument Jerry allows Pupkin to ride along for the short journey to his hotel.\r\n\r\nIt is during the trip that Pupkin informs Jerry that he of course admires him greatly, but that further to this he sees himself as someone that could suit the show as a guest. It turns out that Pupkin is immensely confident of his stand up abilities, so Jerry ultimately decides to agree to listen to his stuff and will consider him for the show as long as he can provide a tape of his work.\r\n\r\nAll good so far right. But as we learn quite rapidly Rupert Pupkin is not some talented no-name trying to fast track his way to the top, but a largely talent free never-will-be with incredible delusions of grandeur, delusions that manifest in the basement of the home he shares with his Mother where he runs his own variety show - complete with laugh track - and interviews the same cardboard cut-outs of real celebrities every night, while Mum continually yells at him to keep the noise down.\r\n\r\nThe following days see Rupert continuing to role play while he waits for news from Jerry and the production company staff. When this is not forthcoming Rupert visits the company offices. Frequently. Of course Jerry doesn't come out to meet with him personally, so to Rupert's surprise he is left dealing with what he views as 'underlings', he decides that this breakdown in communication will be best solved by going direct to Jerry himself.\r\n\r\nWhile Rupert's view of his own abilities and reality are poles apart, he still manages to talk a good game, so much so that he convinces a dubious barmaid to accompany him to a 'meeting' with Jerry one evening. A meeting that does not go well.\r\n\r\nFar from being daunted and calling it a day, Rupert and a similarly 'intense' fan of Jerry's named Masha (Sandra Bernhard) - all 6 foot two with a face of 'ewwww' -  concoct a more extreme plot, one that will guarantee they get attention...\r\n\r\nUp to this point I was less than overwhelmed by events as they unfolded. Rupert's bizarre self confidence even in the face of an obvious lack of true capability was more embarrassing than fascinating, which is why the awful acts on American Idol are the ones they replay 37 times per season. The train wrecks are always infinitely more memorable than the actual talents.\r\n\r\nBut does that  provide a lick of entertainment? Perhaps in another film but not here. Not The King of Comedy. I found the finale contrived and extremely unlikely. After all can you imagine how hard it would be to meet Michael Jordan or Tiger Woods, let alone have enough time to take things further... I mean unless you were a cocktail waitress or a cheap floosie that is. Bad example.\r\n\r\nWhile I yield the point that The King of Comedy is indeed a disturbing tale of what some ordinary citizens will do to share a moment in the spotlight, I can't say it is a great one. In fact I don't care how you spin it, who stars in it and who made it. The King of Comedy is the epitome of 'just a movie'.\r\n\r\nFinal Rating - 6 / 10. Now that I have the Scorcese-freaks riled up, might I add that I found De Niro's performance a little TOO over the top?\r\n\r\nIf you liked this review (or even if you didn't) check out oneguyrambling.com for over 800 reviews and plenty more good stuff...",
            "review_date": "2012-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considering within the previous ten years, Scorsese released powerhouse films such as \"Mean Streets,\" \"Taxi Driver,\" and especially, \"Raging Bull,\" one would not get substantial effect from this movie, also starring Robert de Niro. I was shocked! Rupert PUPkin (De Niro), not Pumpkin, is a man who wants to break into show business as a stand-up comedian and through the likes of a TV television personality Jerry Langford (Jerry Lewis). The viewer is tricked a variation of times through intercutting scenes, with the thoughts that \"yes, Pupkin is now a star\"; \"no, he is not yet a star\"; and \"perhaps, he will be a star.\" This eventually leads to Pupkin so desperate that he and deranged female sidekick (Sandra Berhnard) kidnap and hold Langford at gunpoint. The film is evil, vicious, annoying, hysterical, hilarious, and excruciating in ways that predecessor films of Scorsese were, but very different in comparison. De Niro demonstrates versatility within his career in an excellent performance, and Lewis also give a really one to accompany his. It is a sad character study, but it is a really funny film. Interesting how the swearing in this film is minimal in comparison to Scorsese's other major hits, both before and after. The scenes where De Niro is yelling at his un-seen mother may have inspired the scenes between Howard Wolowitz and his mother on the sitcom \"The Big Bang Theory.\" Here is, yet, another great film by the master director, starring one of the best actors of all time.",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a prodigious performances, plodding at a riveting rhythm, easing out the audience to sink into deepest sides of the protagonist's sympathetic psychic mind,also offering an evincing desire to blow up the wholesome show business and to reverberate the creative fragments of humor,  produced out of  the heinous tragedies occurred in the past, thus approaching near to the pristine comedy, invented by Charlie Chaplin... Martin Scorsese has liberated the ironies and satires in the demurest  forms... as his mind's eye brilliantly carried through Deniro's splendid actions..",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The King of Comedy was a cutting-edge slap in the face at the television celebrity mania in 1983 but may have been ahead of its time. Sadly, today it is more relevant than ever.",
            "review_date": "2012-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We are somewhat left unaware if the ending to Rupert Pupkin's story is an aspect of his fantasy's. The sad truth is that is most likely is. The accomplishment here is how I understand and sympathies that with the character. Leaving Scorsese's The King Of Comedy as a heart breaking tragedy.",
            "review_date": "2012-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrific mix of Scorsese/DeNiro/Lewis comedy and art.",
            "review_date": "2011-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Check off another masterpiece to Mr. Scorsese. I don't think the movie is a laugh riot but more of a haunting exercise in fanaticism. DeNiro is in rare form yet again. If his performance doesn't work the entire movie fails, he's just outstanding. When i saw Sandra Bernhard's name in the credits i cringed a bit but i was pleasantly surprised, she gives a great supporting performance. Also Jerry Lewis is fantastic. Scorsese's direction is subtle but once again great. The scene of Lewis alone in his apartment or how he doesn't use a reaction shot during DeNiro's monologue are just a few of the many brilliant scenes he crafts.",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Niro plays a wannabe comedian who desperately tries to become a star. Well acted and written, Scorsese shows the extreme lengths one man will go to achieve his goal.",
            "review_date": "2011-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A comeback for Jerry Lewis",
            "review_date": "2011-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, at last I can check off one of the movie I always wanted to see. Robert De Niro will always remain one of my favourite hero !! Do watch it if you didn't and you will be left with the bitter sweet truth of the indomitable desire of human being to be heard and to be recognised by this world and the cut throat competition that threatens this world now !! Maybe for many it is a comedy but Martin Scorsese does a brilliant portrait of human being's inner most desire and silent struggle to be heard, to be recognised and to be among the crowd.",
            "review_date": "2011-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Robert De Niro and Jerry Lewis star in Martin Scorsese's darkly comedic satire about media obsession, and the lenths people will go to in order to become famous. \n\nRupert Pumpkin (Robert De Niro) is an aspiring stand-up comedian with ambitions that outweigh his talent. He sees television talk show host Jerry Langford (Jerry Lewis) as his idol, and is willing to do anything, including kidnapping in order to get Langford to give him his big chance to become the star he's always seen him self as being. \n\nLewis and De Niro give some really good performances in their respective roles, and it is a joy to see them playing off one another. Lewis seems really grounded and downplays his schtick tremendously, but I think that is all for the best. De Niro is wonderful at playing these desperate, pathetic types who you feel bad for, even though you maybe shouldn't.  Sandra Bernhard is terrifically nuts as an obsessed Langford fan and stalker who agrees to help Rupert with his scheme. She's really unhinged and sometimes grating, but it is quite funny and a job well done. \n\nIn a lot of ways, this really felt like Taxi Driver, but, uh, with jokes, and not quite as dark and gritty. When I first heard about this film and its plot, I really was expecting it to be quite dark, gritty, and intense, especially with Scorsese at the helm. Surprisingly though, the film is only PG, but it still manages to get its point across without being too extreme. I believe there's probably some sort of word for being able to pull off a feat like this without things coming off as watered down, but I can't think of it right now. Maybe it's nuance, perhaps genius.\n\nThis is another one of Scorsese's films that is quite terrific and well made, yet unfortunately more overlooked and underappreciated than it deserves. It's not a brilliant masterpiece or anything, but it's definitely quite solid and enjoyable (though not for all tastes), and fits in perfectly with Marty's oeuvre. \n\nIf at this point, you like what I've had to say, then you should definitely go give it a watch.",
            "review_date": "2011-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A different road that I am used to for DeNiro and Scorsese, however, I was happy with it. That persistent creepy fuck Pupkin wouldn`t let up until he got what he wanted.  his stubborness to leave Langford's office cracked me up. Because this is an oddball, it is often not mentioned a whole lot in DeNiro's better filmography, but not only is it funny in a desperate and ridiculous way, its very engrossing in itself. Being a celebrity in a lot of ways would be....well....dangerous.",
            "review_date": "2011-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You'll be sad, you'll be laughing, you'll be disturbed, and you'll be confused- all at the same time.",
            "review_date": "2011-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably one of the most uncomfortable movies I have every seen. I can appreciate that it is well made, but feeling uncomfortable for the full running time of a movie is not my idea of fun. I don't regret watching it, but I most certainly won't recommend it.",
            "review_date": "2011-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This small masterpiece by Martin Scorsese features yet another great performance by Robert DeNiro.",
            "review_date": "2011-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot here seems a bit far-fetched, I know, but in a world that has turned so celebrity-obsessed (and, no, itâ(TM)s not just dumb little girls acting as if Justin Bieber is somehow the Beatles; most of us have actually been guilty of this, though usually at a much lower level), it seems (for the most part) absolutely plausible. Like Peter Weirâ(TM)s THE TRUMAN SHOW, the film is a comedic gem, medicated with the highest possible dose of political satire; ironically, any comedy mastermind would ruin it. Had Woody Allen done it, he would have delved into the charactersâ(TM) persona too far, quite possibly so much that we could see some unintended and unsubtle hypocrisy. Had Mel Brooks directed it, it would have become a nonsensical joke-fest with all too much emphasis on the stand-up comedy and not nearly enough on the underlying theme of mania. Martin Scorsese tackles it perfectly. You canâ(TM)t expect a film from him without some sort of violence (except last yearâ(TM)s family movie HUGO), even if itâ(TM)s a comedy. The first person to bring obsession to crime would certainly be him. I especially love the scene in which Langford is confined to a chair, held at gunpoint, a phone in front of him, and Pupkin is raising up cue cards (some of which are upside-down or blank) for Langford to read to tell someone in his office to make Pupkin the âKing of Comedyâ\u009d on the upcoming show.\n\nREAD MORE ABOUT THIS OVERLOOKED CLASSIC:\nhttp://themoviefreakblog.wordpress.com/2012/04/28/review-the-king-of-comedy/",
            "review_date": "2011-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may not be a 5 star Scorsese flick, but it is a very strong 4 star Scorsese flick, which is dark, satirical, comedic and very entertaining. Another amazing partnership between DeNiro and Scorsese. Jerry Lewis also delivers a knockout performance, as well as the rest of the supporting cast. Scorsese proves in this film he is able to work and adapt in any genre, as this film is a combination of so many genres, and touches on almost everything in Scorsese. His eye for talent, his wit and his ability to tell a story in a unique and captivating way. It ends with on a high note, in a very unpredictable way. A great addition to your Scorsese collection.",
            "review_date": "2011-10-16",
            "source": "rt",
            "lang": "en"
        }
    ]
}