{
    "rating": 7.5,
    "release_date": "1983-12-16",
    "num_reviews": 70,
    "genres": [
        "Comedy",
        "Lgbtq+"
    ],
    "summary": "Frederick Bronski (Mel Brooks) and his adulterous wife, Anna (Anne Bancroft), are a pair of hammy actors running a low-rent theater in Warsaw, Poland. When the Nazis invade, the Bronskis find their theater becoming a makeshift refuge for local Jews and a gateway to the Polish underground. Using their limited acting skills, the members of the theater troupe attempt to deceive the Nazis and lead an escape. Meanwhile, a Polish pilot (Tim Matheson) thinks he has found a spy in England.",
    "reviews": [
        {
            "content": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-02-25",
            "source": "rt"
        },
        {
            "content": "Probably prefer it to the Jack Benny version (I love Jack Benny but he was just too hammy). Brooks adds a little more gravitas (and that's saying something for  Mel Brooks!) but it's Anne Bancroft that steals the show - she's wonderful.",
            "review_date": "2022-12-19",
            "source": "rt"
        },
        {
            "content": "Mel Brooks and Anne Bancroft star in this comedy about a theatre group in Poland on the verge of being invaded by the Nazis and their madcap way of escaping Poland by using their acting chops to portray themselves as Germans. \nAmusing for the most part with fun turns from Charles Durning and Tim Matheson.",
            "review_date": "2021-04-23",
            "source": "rt"
        },
        {
            "content": "It seemed like they were trying too hard.  It didn't measure up to the original.",
            "review_date": "2021-01-22",
            "source": "rt"
        },
        {
            "content": "Brooks and Bancroft are irresistible in another Mel slapstick extravaganza !",
            "review_date": "2020-10-10",
            "source": "rt"
        },
        {
            "content": "Ok comedy stolen by Charles Durning",
            "review_date": "2020-07-14",
            "source": "rt"
        },
        {
            "content": "A Must See for every Mel Brooks fan!",
            "review_date": "2020-06-14",
            "source": "rt"
        },
        {
            "content": "Not one of Mel Brooks best films but it's a entertaining movie",
            "review_date": "2020-05-08",
            "source": "rt"
        },
        {
            "content": "I didn't know much about this Mel Brooks flick when I added it to my good old Netflix queue but low and behold I'm a little bit blown away by it. \nIt isn't necessarily a laugh until you cry situation but there are wonderful laughs scattered throughout and blended in perfectly with its captivating story of an unlikely underground war movement by a theater troupe.\nI was particularly moved by the fact that this is one of the few World War II films I've seen to fully acknowledge the plight of LGBT people in the Holocaust. Even though Brooks' character uses the derogatory term \"fags\" at one point I was struck by the notion that the character of Sasha even existed as openly as he was. In that regards this is film seemingly way ahead of its time and is worth watching for that reason alone, but I think you'll find it incredibly entertaining regardless.",
            "review_date": "2018-07-07",
            "source": "rt"
        },
        {
            "content": "A fun film. Like Casablanca only with Nazis.",
            "review_date": "2015-12-07",
            "source": "rt"
        },
        {
            "content": "Funny moments but not quite a hit",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "An enthralling and ebullient double bill of two versions of TO BE OR NOT TO BE, Lubitsch's Black & White masterpiece, also famous for being Carole Lombard's swan song before a plane crash brought her away from this world at the prime age of 33, and Mel Brooks' (almost) faithful color remade (although the director title falls on the head of his longtime collaborator Alan Johnson) starring him and his wife Ms. Bancroft. \n\nkeep reading my review on my blog: http://wp.me/p1eXom-1Uv",
            "review_date": "2015-06-01",
            "source": "rt"
        },
        {
            "content": "Was not expecting much from this one, but it was hilarious.  Wasn't the over the top spoof I was expecting. Charles Durning and a Christopher Lloyd were so funny in this.",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "As comical as it is serious, it's not Brooks' most memorable, but quite enduring.",
            "review_date": "2015-05-17",
            "source": "rt"
        },
        {
            "content": "I've always thought this was an underrated Brooks' classic.",
            "review_date": "2015-04-14",
            "source": "rt"
        },
        {
            "content": "So far since I started working my way through The Mel Brooks Collection, there have been two surprises.\n\nThe first was how much better The 12 Chairs looked than I remembered (the difference between VHS & Blu-Ray).\n\nThe second was this movie. \n\nIt's easy to belittle as an unnecessary vanity project.  The original is an acknowledged classic, and Brooks clearly made this film in part as an offering of love to his wife, the late Anne Bancroft. She's filmed as if through a stocking throughout, and Brooks has probably his most heartfelt moment onscreen ever when he tells her character's would-be lover: \"I don't blame you for falling in love with her.  It's easy.\"\n\nTrouble is it's too GOOD to belittle thus. I know it's easy to do because in the past, I've done it, saying \"It's as good as it could be, considering it didn't need to be made.\"\n\nI was wrong.  It's better.\n  \nAlthough \"officially\" not written or directed by Brooks, its inclusion in a collection of films he *did* write (usually with others) and direct speaks for itself.  \n\nSo I will speak of it as his film, but I feel he'd want me to say it was directed by former choreographer Alan Johnson and written by Ronny Graham and Thomas Meehan, none of whom were likely to need him hovering over them the whole film.  But a wink in a special Blu-Ray feature suggests he still had a hand in.\n\nBut chiefly, he's an actor here, and this is his best (one of his only) sustained performance.  \n\nDr Thorndyke in High Anxiety was a believable Hitchcockian leading man, but only as much as needed for the spoof.  He didn't have to, excuse the expression, engage the heartstrings.\n\nMaybe Bronski in this movie didn't *have* to either, the point is that he does, and the movie is better for it.\n\nAs the other half of the theatrical lead couple in World War II, it's also a genuine privilege to watch Bancroft act.  She knew how to think onscreen, and also how to raise her head with comedic timing.\n\nFrom top to bottom, the movie is filled with great character actors; the script gives them, and the movie allows them, moments to show why.\n\nCharles Durning was nominated for an Oscar but on this last viewing I thought the best among equals was James Haake as Bancroft's dresser.\n\nHis character is an effeminate homosexual.  (One way the film differs from the original is that it *can* show it wasn't just Jews menaced by the Germans.)  For most of it he's played for laughs, which is fine-there were and are such men, and this is a comedy.\n\nBut his moments come first when he explains to Bancroft about the pink triangle he must wear, and the film affords him his dignity to say \"I hate it,\" before he returns to joking, as some do.  And later when he attempts to hide from the Nazis by dressing in drag.  He is not successful, and the scene trips neatly from the ludicrous to the emotional.\n\nWhich isn't a bad way of describing the whole film, come to think of it. 30 years later, this stands by leaps and bounds as Brooks' best film of the '80s.\n\nPS: The songs ain't bad, either.",
            "review_date": "2015-01-27",
            "source": "rt"
        },
        {
            "content": "Pretty funny.  Normally I'm not a big fan of movies with Mel Brooks in them, although I am a fan of his writing.  I feel like his comedic acting is too obvious most of the time, like he doesn't think the audience understands subtlety.  Here however, he does a surprisingly good job.  As long as you can stand the really dark humor in this film, you'll find it's pretty funny.  Story-wise, it's pretty good too.",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "The rare remake that actually improves on the original version. Brooks and Bancroft are delightful.",
            "review_date": "2014-12-26",
            "source": "rt"
        },
        {
            "content": "It was great seeing Mel Brooks starring together with Anne Bancroft in this remake. I haven't seen the original yet, but I loved it. Just the right mixture of drama and comedy. The supporting cast was excellent and Alan Johnson did fine in his directorial debut.",
            "review_date": "2014-12-06",
            "source": "rt"
        },
        {
            "content": "I gave the greatest performance of my life... and nobody saw it.",
            "review_date": "2014-11-09",
            "source": "rt"
        },
        {
            "content": "WOW.....WOW....WOW....FANTASTIC.....BRILLIANT....AMAZING.....I HAVE JUST SEEN THIS MOVIE 4 THE 1ST TIME N THINK THAT THIS IS SUCH A GREAT MOVIE 2 WATCH......its got a good cast of actors/actresses throughout this movie.....I think that mel brooks, anne Bancroft (.R.I.P.), tim Matheson, Charles durning (.R.I.P.), jose ferrer (.R.I.P.), play good roles/parts throughout this movie.....I think that the director of this comedy/drama movie had done a great job of directing this movie because you never know what 2 expect throughout this movie.....\n\n\n\n\n\n\nThis remake was faithful to the 1942 film on which it was based, and in many cases dialogue was taken verbatim from the earlier film. The characters of Bronski and Joseph Tura are combined into a single character, however (played by Brooks). The character of the treacherous Professor Siletsky (here spelled Siletski) was made into more of a comic figure, and even into somewhat of a buffoon, whereas in the original he was the one completely serious character in the film.\n\n\n\n\n\n\nThe film was favorably reviewed by Vincent Canby in the New York Times, who called it \"smashingly funny.\"\n\nRoger Ebert's film review stated that in the film, Mel Brooks \"combines a backstage musical with a wartime romance and comes up with an eclectic comedy that races off into several directions, usually successfully.\"\n\nIt has a 63% rating on Rotten Tomatoes, indicating \"Fresh.\"\n\nHowever, the film was not a great commercial success, grossing only $13,030,214\n\n\n\n\n\nFor his humorous performance as Colonel Erhardt, Charles Durning was nominated for the Best Supporting Actor Academy Award.\n\n\n\n\nI think that this is such a really well written/acted/directed movie 2 watch, its got a great cast throughout this movie......I think that this is such a brilliant classics comedy movie 2 watch, it is such a really funny movie 2 watch, its got a great soundtrack throughout this movie.....I think that this is such a really fantastic comedy movie 2 watch, its got a great cast throughout this movie......man this is such an amazing movie 2 watch, with a great cast throughout this movie.....it is such a really funny movie 2 watch, it is such an enjoyable musical comedy movie 2 watch, with a great cast throughout this movie, it is so funny movie 2 watch, with a great cast throughout this movie.....",
            "review_date": "2014-10-11",
            "source": "rt"
        },
        {
            "content": "good remake but i prefer the original 1942 version",
            "review_date": "2014-09-11",
            "source": "rt"
        },
        {
            "content": "Fun with some good lines, but not one of Mel Brooks' best despite the comedy being similar to most of the other films associated with him.",
            "review_date": "2014-08-29",
            "source": "rt"
        },
        {
            "content": "Sold as a comedy (it has it's comedic moments). A little known Mel Brooks film. The serious undertone over shadows the comedic attempt. This film can be more suspense than comedy.",
            "review_date": "2014-08-08",
            "source": "rt"
        },
        {
            "content": "A farcical comedy, To Be or Not to Be is a fun and outlandish spoof of World War II.  Set amidst the backdrop of the Nazi occupation of Poland, a small theater company attempts to stop the Nazi High Command from getting a list of the Polish underground.  Starring Mel Brooks, Anne Bancroft, George Wyner, and Christopher Lloyd, the film has a hysterical cast that does well with this type of broad comedy.  Brooks is especially good; stealing nearly every scene he's in.  However, the storytelling's not that great and jumps around a little too much; not allowing enough time to establish the characters.  So while To Be or Not to Be delivers a lot of laughs, it's a bit messy.",
            "review_date": "2014-05-10",
            "source": "rt"
        },
        {
            "content": "A more lunatic version of To Be or Not to Be, with the Brooks-Bancroft duo performing remarkably well, and Charles Durning, Christopher Lloyd and Jose Ferrer stealing the show. It's well-acted, well-scripted, and has to be seen to be believed, and hopefully taken seriously as well.",
            "review_date": "2014-03-02",
            "source": "rt"
        },
        {
            "content": "This movie is just as entertaining as the Ernst Lubitsch original, but with the Mel Brooks touch - slapstick, puns, a more overt humor.   In the 1940's they were not ready for Mel Brooks.  In this day and age, even Mel Brooks seems a bit dated.  I got some smiles and some chuckles out of it, but not outright laughs.  I think in 1983 however I would have been doubled-over.",
            "review_date": "2014-01-10",
            "source": "rt"
        },
        {
            "content": "A Mel Brooks production with that unmistakable Brooks style despite the fact that it wasn't actually directed by him, To Be or Not To Be is also the remake of a great comedy classic by Ernest Lubitsch about two famous Polish actors who come up with a way to fight off Nazi occupation and help the resistance by using their skills and theatre comedy to pose as Nazis. The concept is great and the film is mildly entertaining though certainly understudied and lacking the kick of even the irreverence of its predecessor - this latter point in fact may just be the most disappointing factor of this particular film version. Costumes and sets are great and there is no doubt about the production values, yet a lot can be said about pace and some inconsistencies in the script, which in many ways makes this film seem more outdated that Lubitsch's one.",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "Because of Brooks' involvement, the humor is of a decidedly wackier nature than the original and while that isn't bad (there are a lot of great moments) it does mean that the serious elements of the story feel more out of place here.",
            "review_date": "2013-12-08",
            "source": "rt"
        },
        {
            "content": "I began watching this film thinking that is was made by Mel Brooks.  Sadly he just stars in it, so it does lack some of the quick wittedness and snappy pacing that comes with many Brooks films.  What it does have is the silliness of Brooks..  Unfortunately in this instance it might be a little too silly.  Yes, it certainly is a fine line to walk, and it is made even more difficult by the fact that this movie is about WWII Europe.  Unfortunately, despite some laughs, this movie steps over that line too many times.",
            "review_date": "2013-07-12",
            "source": "rt"
        },
        {
            "content": "Very funny remake of a zany original.  One of my favorite Mel Brooks films.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "Surprisingly funny and a good story, lots of fun.",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "To Be or Not To Be doesn't achieve the same spectacular comedic feat of many of Mel Brooks' other comedies, and has certainly suffered the burden of age, but the plot is cleverly funny and the actors are great.\n To Be or Not to Be has a consistently comedic premise and some ok jokes, but the laughs are considerably sub-quality by today's standards, and so the amount of laughs isn't sufficient to viewers from this generation.\nBut the plot is very cleverly comedic and good for a charming laugh, and the cast is great.\nMel Brooks makes a great lead, and his chemistry with the closely comedically talented wife of his Anne Bancroft is just too good.\nThe supporting characters are also talented thanks to the performances of Charles Durning and Lewis J. Stadlen. A young and funny Christopher Lloyd also makes an appearance.\n\nThe gentle way To Be or Not To Be handles the situations of WWII in a properly comedic fashion is a talented thing that director Mel Brooks has been able to achieve, and though the plot dynamics are humorous but lacking in significant jokes, it's still a decent film.\nSo to summarise, To Be or Not To be doesn't appear as funny as Mel Brooks' other films, but the plot has the best intentions the same way the cast does.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "Despite not being directed or written by Brooks, this remake of the 40s classic still boasts the same maverick, self-deprecating humour of his own works, complete with numerous jabs at the Nazis. Couple that with a cast of Brooks' regulars including his wife Anne Bancroft, as well as Christopher Lloyd as a Nazi officer, a nice variety of verbal and physical gags and some reference to the actual treatment of Jews by Germans and you have a film that manages to hold its own in the man's sizeable catalogue.",
            "review_date": "2013-03-14",
            "source": "rt"
        },
        {
            "content": "This movie was actually my introduction to Mel Brooks, and even though I remember thinking it was funny stuff at the time, watching it again it seemed very average.  It almost seemed like he kept this script around to make if he ever needed to cash in on his name.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "Mel Brooks delivers music laughs and his real life wife in the hard times of World War II when Germany invades Poland Mel Brooks fights back good thing he has a British agent to help him.",
            "review_date": "2012-12-23",
            "source": "rt"
        },
        {
            "content": "Delightful slapstick at its best--The Mel Brooks way!!",
            "review_date": "2012-08-28",
            "source": "rt"
        },
        {
            "content": "It's certainly not the Lubitsch film and Johnson's directorial effort seems minimal, but all in all, it actually works.",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "Just became one of my favorite Mel Brooks movies.",
            "review_date": "2012-03-28",
            "source": "rt"
        },
        {
            "content": "Besides 12 chairs this is my least favorite Mel Brooks movie. It just didn't have that Mel Brooks spunk in it. Yes it had some funny quotes, e.g. \"are they Jews or are they rabbits\". But there were many recycled jokes from old films. It was still an OK movie",
            "review_date": "2012-03-11",
            "source": "rt"
        },
        {
            "content": "Mel Brooks always makes me laugh!  I am catching up with his filmography.",
            "review_date": "2012-03-10",
            "source": "rt"
        },
        {
            "content": "Giving it 3/5 just because it had it's moments when it made me chuckle, but at times I found it unable to keep my attention. Overall though it was well acted and a good movie. For any Mel Brooks fan this is a must see.",
            "review_date": "2011-10-17",
            "source": "rt"
        },
        {
            "content": "The Nazis march into Poland and that spells big trouble for the greatest musical comedy star there (and his wife) --- the premise itself is a joke in this mostly-for-the-fun-of-it remake.  Its not the original, true, but its fun watching the cast have fun funning the idea of a master race, all who are portrayed as anything but that.  Sometimes the kraut accents sound as bad as your friends doing it and the sets look only a little better than that.",
            "review_date": "2011-09-02",
            "source": "rt"
        },
        {
            "content": "Am starting to understand Mel Brooks more and more with each movie I watch.  Sometimes I find his films amazing and other times not so much.  This one is a not so much.\r\n\r\nHaving recently watched the original it is easy to say it is superior to this one in almost all aspects.  Now this isn't a bad movie, it is a loving remake in the Brooks style and I am sure he was a fan of the original.  Yet as another review says Mel seems a little flat here, Bancroft nearly steals the show.  Some of the supporting characters were very good and seeing another minor role of Chris Llyod's was great.\r\n\r\nSo this movie does add some humour and change some elements but stays true enough to the original.\r\n\r\nOne thing I noticed which I found funny was the Polish escapees touching down in England.  In the original there is a line about \"First Hess and now him.\"  or something like that which to me was hilarious because if you know a little history... Rudolph Hess, one of Hitler's trusted and high ranking friends had mysteriously flew across the channel and crashed in England.  His story is worth reading about on Wikipedia but in the original the line would have got a laugh because the audience would have been familiar with the Hess story, it had been quite recent.  But by the 80's and the time Mel did this remake it had to be removed because most people wouldn't have got the joke.  Still in the Brooks version seeing the fake Hitler walk into the tavern was pretty good.\r\n\r\nSo this is for sure worth a watch, if your a Brooks fan, a fan of films with nazi's in them or WWII themes.  If your a fan of the first film though you will almost find this a pale rehash... which is worth the watch none the less.",
            "review_date": "2011-07-28",
            "source": "rt"
        },
        {
            "content": "Not Mel Brooks' funniest picture, but the \"highlights from Hamlet\" will keep you in stitches.",
            "review_date": "2011-07-03",
            "source": "rt"
        },
        {
            "content": "I really didn't know if I would like this for the first fifteen minutes or so. It trades quick, empty laughs for truly amusing situations, and it is so genuine that it ends up winning you over. I loved it!",
            "review_date": "2011-06-25",
            "source": "rt"
        },
        {
            "content": "A funny light-hearted Mel Brooks movie about a Polish theatre company trying to survive during WWII. Fredtick Bronski who is usualyl not that great of an actor must pull off being a variety of Nazi characters including Hitler to help save the day and make sure all the Jews hidden in his theatre's basement don't get killed.",
            "review_date": "2011-06-12",
            "source": "rt"
        },
        {
            "content": "One of my favorite Mel Brooks Films, the Hitler Spoof is Hysterical",
            "review_date": "2011-06-07",
            "source": "rt"
        },
        {
            "content": "A halarious comedy that has the tendency to turn serious when you least expect it. Mel Brooks was brave to attempt a remake, his risk paid off.",
            "review_date": "2011-06-05",
            "source": "rt"
        },
        {
            "content": "Oh look, a piano! With KEYS! And it WORKS!",
            "review_date": "2011-03-20",
            "source": "rt"
        },
        {
            "content": "A funny yet seroius movie. Mel brooks shows that in in the darkest of stories their can still be light. It was a good story and some funny humor but not a typical mel brooks comedy. I like the story and a good chemistry between mel brooks and ana brachet. B+",
            "review_date": "2011-03-08",
            "source": "rt"
        },
        {
            "content": "marvelous piece of work..............!!!!",
            "review_date": "2011-03-02",
            "source": "rt"
        },
        {
            "content": "The least funny of all Mel Brooks films. This didn't stand out to me and it seemed like it didn't really know if it wanted to be funny or serious or both. Durning was good in this.",
            "review_date": "2011-02-28",
            "source": "rt"
        },
        {
            "content": "Saw this on the Irish Continental Line (as it was then) ferry from Rosslare to Le Havre at the start of my school tour to Austria in June 1984. It was very funny; some of the scenes were moving and others were quite upsetting. It was only afterwards that I learned that some of the lines were direct quotes from \"The Merchant of Venice\".",
            "review_date": "2011-01-12",
            "source": "rt"
        },
        {
            "content": "Funny, but not as funny as I would have expected from this crowd!!",
            "review_date": "2011-01-09",
            "source": "rt"
        },
        {
            "content": "A failure, and a fairly miserable one at that. Whoever had the brilliant idea of building a film with Mel Brooks in the lead role is an idiot. I suspect it was Mel Brooks, actually. He's fine in those little supporting roles he gives himself in his own films, but as a leading man, he's just inadequate. It might be saved by the presence of Anne Bancroft, but she's given absolutely nothing to work with. The few gags that might have perhaps been funny are telegraphed long in advance, removing any of their power. And Charles Durning's Oscar nomination is a mystery of the highest order.",
            "review_date": "2010-12-31",
            "source": "rt"
        },
        {
            "content": "Mel Brooks & Anne Bancroft sing Sweet Georgia Brown in Polish LIVE! | \nFrom An Audience With Mel Brooks | \nLondon Weekend Television, 1983 | \nhttp://www.youtube.com/watch?v=yJbrgs8XdLY",
            "review_date": "2010-12-30",
            "source": "rt"
        },
        {
            "content": "I wish my movie-viewing habits were less random. That would help me see originals before remakes, no matter how old or new they were. Case in point: Mel Brooks' '83 remake of the 1942 film To Be Or Not To Be. I've had plenty of time to see either one, yet I still gravitated toward the remake. The lure of the new (or most recent) is a powerful thing and may be why we are seeing so many older movies dusted off and completely remade. This is definitely not one of Mel Brooks' greatest films, but it deserves to be seen regardless.There's no way a film like this could get made today at all and it's even harder to believe Mel Brooks is no longer making movies. Though he peaked early, his lesser films are funnier than most Hollywood comedies released these days.\r\n\r\nBrooks and his real-life wife, Anne Bancroft, play a pair of Polish stage performers, Frederick & Anna Bronski, who run their own theater and a nightly variety act with songs and comedy and Shakespeare thrown in for good measure. Their troupe of actors are a wacky bunch of hams and feature the likes of George Gaynes (Commandant Lassard from the Police Academy films) and Brooks vet George Wyner (Colonel Sanders in Spaceballs). Also in their midst is Bancroft's gay assistant Sasha, played by James Haake. Everything is going along fine, despite threats of invasion by the Nazis, with Frederick even doing a song and dance number mocking Hitler called \"Naughty Nazis.\" Frederick is a sucker for Shakespeare and one of the running gags in the movie is how much he sucks at playing Hamlet. Tim Matheson is along for the ride as a Polish flyboy working for the underground resistance who is smitten with the sultry Anna Bronski. I won't get too into the interplay between all of the characters, because it's more interesting to just watch it play out. Some of the gags are funny (like the Hamlet stuff) but a lot of it comes off like old-timey Vaudevile shtick that doesn't really hold up any more. Maybe that was the point and meant to be a tribute to those old days and the original movie, but nonetheless, it just wasn't all that funny.\r\n\r\nWhen the Nazis finally do arrive, they are led by Colonel Erhardt, played by the ridiculously hysterical Charles Durning. To say Durning is the best thing about this movie is an understatement. Without him, the movie would just be a forgettable and mediocre dud in the Brooks library. He should have won the Oscar and not just nominated, but that was also the year for Terms of Endearment, so he had no chance whatsoever. Christopher Lloyd shows up as Erhardt's aide Captain Schultz and is the second funniest person in the movie. His flustered spasms when confronted by Durning whenever something goes wrong (and it does over and over again) is worth watching the movie alone for and his response that gets him out of trouble every time is one of the best jokes in the movie.\r\n\r\nThe film also features Jose Ferrer as the duplicitous Professor Siletski. His character is actually the reason for the plot of the film itself and Frederick Bronski's antics posing as both Siletski and ultimately Hitler himself results in a few good laughs. And that's the problem, when the Nazis or Durning aren't on screen or being talked about, the movie isn't funny very much and strays away from being interesting. The subplot of Sasha being gay, having to wear a pink triangle and being persecuted just like the Jews tiptoes toward being interesting. However, instead of going for the throat with the comedy, they instead pull back and try for a dramatic moment which doesn't work at all given the context of the rest of the film. It seemed that after Blazing Saddles, Brooks strayed away from vicious humor and opted for more good-natured comedy, no matter how dirty it was covered up to be.\r\n\r\nAll in all, it's a very flawed film with a hilarious and Oscar-worthy performance by the great Charles Durning. Once again, it's not Mel Brooks' finest hour (and some of it feels like a rehash of The Producers) but it's easy to see it was a labor of love for Brooks. Everyone looks like they're having fun and it's great to see Brooks and Bancroft together on screen. It's just that it doesn't reach the crazy slapstick/situational comedy heights of his other classics. It is, however, better than \"Dracula: Dead and Loving It\". But then again, that's not hard to do.",
            "review_date": "2010-10-19",
            "source": "rt"
        },
        {
            "content": "3: The picture definitely works, but this isn't to say it's not lacking the \"Lubitsch touch\".  The remake is faithful enough and quality enough to make it worth watching, but part of the reason for this is that it reminds one of the original.  Bancroft is a worthy follow up to Lombard though and Brooks isn't a bad stand-in for Benny either.  I'm definitely very jealous of Brooks for landing a wife like her.  They aren't really what made the original so great though, it was more Lubitsch's deft touch.  One scene in which this touch is sorely missed is the \"Heil Myself\" sequence.  It's classic and hilarious in the original, but here it lands it with a thud.  I suppose I should watch the original again soon so I can better compare the two films, as I can't quite recall all the elements of the plot that are new and which were also in the original.  I have to say, if the film had to be remade, Brooks was probably the right guy to do it.  The story is ridiculous to suit him and the subject matter seems right up his alley.  He could probably make a decent version of The Great Dictator too.",
            "review_date": "2010-09-21",
            "source": "rt"
        },
        {
            "content": "Really funny Mel Brooks film.",
            "review_date": "2010-08-14",
            "source": "rt"
        },
        {
            "content": "awesome! I LOVE THIS THING!!!!!",
            "review_date": "2010-08-07",
            "source": "rt"
        },
        {
            "content": "It's like Inglourious Basterds without the violence, David Bowie and THE BEAR JEW!!!!! Or perhaps not....! I liked it though!",
            "review_date": "2010-04-24",
            "source": "rt"
        },
        {
            "content": "LOL...love the Natzi song!",
            "review_date": "2010-04-11",
            "source": "rt"
        },
        {
            "content": "Another completely unfunny Mel Brooks film.  He sort of became the king of these around this time (with the exception of 'Spaceballs').",
            "review_date": "2010-03-22",
            "source": "rt"
        },
        {
            "content": "Another funny old movie!",
            "review_date": "2010-03-04",
            "source": "rt"
        },
        {
            "content": "Mel Brooks technically didn't direct or write this film by the credits but according to the special features on the bluray he was definitely involved.  I love this movie, it's a perfect mix between suspense and comedy, and it made me realize that Mel Brooks could tackle another type of movie besides satire/parody.  The entire cast is amazing, the film is hilarious, and the plot has many twists and turns without ever becoming too over the top.",
            "review_date": "2010-02-01",
            "source": "rt"
        },
        {
            "content": "The only way to truly show how we feel about such horror as the Holocaust is through this kind of comedy. Once you here \"Heil myself\", one can never take a dictator seriously again...",
            "review_date": "2009-12-19",
            "source": "rt"
        },
        {
            "content": "Now, of Mel Brooks I am a fan.  I've been watching Spaceballs and Young Frankenstein on a monthly basis since I was about ten years old.  To Be Or Not To Be was a recent find for me, as it isn't part of the Mel trifecta (Blazing saddles, YF, and Men in Tights) that gets played to death on AMC.  I found it to be a lot different; the story (a remake, mind you) and the comedy was much more mature than his other work.  And though it retains the lightheartedness and slap-stick esque nature of his other comedies, To Be Or Not To Be is one of Brook's best effort ever.\r\n\r\nThe nature of the film is a little bit more serious than most of Brook's other films.  Set in Nazi-Occupied Poland, Fred Bronski (played by Brooks) uses his wit and skills as an actor to get his theatre company through the war.  It talks about the fear that the Jews and homosexuals of the time dealt with, but don't expect a serious examination of a country at war.  It's the comedic content that really brings in a sense of maturity.  There are no fart jokes, no derivative sex jokes, no low brow humor really.  The comedy comes from character and timing which only enhances the movie.\r\n\r\nThe casting is also great.  Playing Brooks' wife on stage is his real-life wife Anne Bancroft.  They have a good chemistry, playing off one another very well.  Tim Matheson, someone you don't see nearly enough in film, plays Bancroft's young admirer.  Chris Loyd and Charles Durning also make an appearance, both playing a different sort of nit-wit Nazi.  All and all, the cast is just good.\r\n\r\nI'd recommend this to any Brooks fan, or anybody, really.  It's a fun, amusing watch that never gets too serious or too silly.",
            "review_date": "2009-12-14",
            "source": "rt"
        },
        {
            "content": "Meh.   It was a cute movie. Not at all bad. It just was not up to the usual Mel Brooks standard of excellence.   I like how he was able to work with his wife, the lovely Ann Bancroft.",
            "review_date": "2009-12-04",
            "source": "rt"
        },
        {
            "content": "Really funny. Really amusing. \"I've always suspected zumzing wrong vit a man who does not drink or shmoke... You mean like our FUHRER? Yes... NO!\"",
            "review_date": "2009-11-30",
            "source": "rt"
        }
    ]
}