{
  "title": "Mulan",
  "rating": 8.4,
  "release_date": "1998-06-19",
  "genre": [
    "Adventure",
    "Drama",
    "Fantasy",
    "War",
    "Animation",
    "Family",
    "Musical"
  ],
  "summary": "Mulan chronicles the daring adventures of a young Chinese woman whose irrepressible spirit clashes with her tradition-bound society.  [Disney]",
  "critic_reviews": [
    "The payoff is a consistently rich piece with impressive visual vitality.",
    "It's the characterization of Mulan, both in voice and visuals, that makes the film a keeper.",
    "Gorgeously animated and stirringly told, Disney's Mulan is a timeless story that will delight kids and divert adults with its sweeping scope, emotional intimacy and screwball humor.",
    "Disney's latest animated feature hearkens back to its heyday fare, a sweet and captivating tale that pits gentle, enduring goodness against dark, malevolent forces.",
    "Mulan is an impressive achievement, with a story and treatment ranking with \"Beauty and the Beast\" and \"The Lion King.\"",
    "Mulan effortlessly blends serious, comic, and cute elements into a whole that should entertain the majority of movie-goers, regardless of race, gender, or age.",
    "The film shines at capturing the watercolor delicacy of China's past.",
    "It took long enough, but Disney has finally come up with an animated heroine who's a good role model and a funky, arresting personality at the same time.",
    "Mulan serves up the sort of classic entertainment the Magic Kingdom was built on: stunning animation, sharply defined characters, a smattering of catchy tunes all seamlessly woven into a simple, powerfully told yarn.",
    "The folks at Disney prove that clothes -- and little else -- make a man, and do so with extraordinary style.",
    "It seems as if all of the new animation competition has lit a fire under Disney's collective ass and they have something to prove again.",
    "The incredible special effects, which make lush cherry blossoms as vivid as the intense battle scenes, are balanced by Disney's tradition of care and painstaking detail in developing and animating its characters.",
    "This high-quality Disney animation combines strong pictorial appeal with amiable voice-performances.",
    "Mulan may be exotic, but it's hardly a risky enterprise, what with its sentimental show tunes, wholesome morals and plucky teen heroine.",
    "A rich dramatic tapestry lightly stained by some strained comedy, rigorous political correctness and perhaps more adherence to Disney formula than should have been the case in one of the studio's most adventurous and serious animated features.",
    "Disney's retelling of the popular Chinese folktale, may seem its gutsiest choice yet, but on closer examination it's obviously less a matter of guts than careful calculation.",
    "While the movie sticks to the familiar Disney formula, the cute sidekicks are less intrusive and the songs are not as overbearing as usual; for the most part, it sustains an enjoyable hum and a simple, delicate glow.",
    "Mulan is another competent effort, but it's a disappointment for anyone hoping the studio would raise the standard of the animated feature to a new level.",
    "Though Disney's animation department does deserve credit for shaking up its formula and delving into relatively mature drama, the movie is flawed in numerous aggravating ways.",
    "It's nothing more than pleasant matinee fodder with some jarring tones and clunky stretches.",
    "Mulan has its accomplishments, but unlike the best of Disney's output, it comes off as more manufactured than magical.",
    "Mulan, like all the characters in this movie, is a cookie-cutter American prototype, lazily ripped off from the Disney boilerplate that fashioned Pocahontas et al.",
    "It's hard not to keep thinking that this movie is basically \"Yentl\" with a nose job.",
    "A film that not only breaks the cross-dressing barrier but also ratchets up the violence level for children's animation."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Disney's \"Mulan\" simply represents two things; first, its one of the original Disney princess animations, and second, its a superb masterpiece in the world of cinema and animation alike.",
      "review_date": "2011-10-05"
    },
    {
      "review_title": null,
      "content": "Mulan is simply stunning. I love how the makers of this movie has decided to set this in China and lets viewers subtly experience some characteristics and cultures of the Chinese people. Other than that, it provides fantastic themes, likeMulan is simply stunning. I love how the makers of this movie has decided to set this in China and lets viewers subtly experience some characteristics and cultures of the Chinese people. Other than that, it provides fantastic themes, like family, self-sacrifice, bravery etc. Brilliant, always a great family classic.",
      "review_date": "2011-11-15"
    },
    {
      "review_title": null,
      "content": "Not a bad thing to say about it really. The story captures exactly what the Mulan story should be. The animation is beautiful. The characters are really interesting.",
      "review_date": "2012-05-03"
    },
    {
      "review_title": null,
      "content": "Disney Keeps On DeliveringMulan is an absolutely fantastic film with it’s beautiful animation, great writing, and epic action scenes.",
      "review_date": "2019-07-01"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI just saw this recently, and here's what I thought. While the movie starts off slowly, it isn't until the part when Mulan's father volunteers to fight in the army do things really get interesting. Now I can't stop myself from singing \"I'll Make a Man Out of You\" over and over again. I really loved that song!",
      "review_date": "2011-02-11"
    },
    {
      "review_title": null,
      "content": "My favorite childhood movie",
      "review_date": "2010-10-23"
    },
    {
      "review_title": null,
      "content": "Mulan is some of Disney's finest work from the late 1990s. Filled with extravagant music and an adventure unparalleled--an instant classic. Not to mention Disney's first non-Caucasian princess, can this be?",
      "review_date": "2014-09-04"
    },
    {
      "review_title": null,
      "content": "A visually wonderful animation made with gorgeous colors and a simple design in watercolor like the style of Chinese painting, and in addition to a great score it finds a most delicate balance between a refreshing humor and themes like war,A visually wonderful animation made with gorgeous colors and a simple design in watercolor like the style of Chinese painting, and in addition to a great score it finds a most delicate balance between a refreshing humor and themes like war, honor and the bravery of women.",
      "review_date": "2015-03-29"
    },
    {
      "review_title": null,
      "content": "Its great , Its really well put together. It shows women can do whatever men can and do it BETTER ;) Geat movie to watch in todays day and age with all the female disrespect going on.",
      "review_date": "2011-08-09"
    },
    {
      "review_title": null,
      "content": "A classic example of why disney movies used to be universally loved.  Mulan delivers on all fronts.  Very beautiful animation, well written, great voice acting.",
      "review_date": "2017-09-08"
    },
    {
      "review_title": null,
      "content": "A great, comedic, daring film with an amazing original song and original score make this film easily one of Disney's most original pieces of art. And boy is it very entertaining.  I give this film a 85% of a good movie.",
      "review_date": "2011-12-17"
    },
    {
      "review_title": null,
      "content": "\"Mulan\" is good in its own ways, but I was slightly disappointed by the fact that the studio did not raise the animation standards to another level. But the movie, just like all Disney movies, has a good moral at the end.",
      "review_date": "2013-11-03"
    },
    {
      "review_title": null,
      "content": "Sure the movie has a strong heroine, but it would have been a lost stronger if it weren't for the unmemorable songs, weak villain, tolerable supporting characters and the movie's version of Jar Jar Binks in Eddie Murphy's dragon sidekickSure the movie has a strong heroine, but it would have been a lost stronger if it weren't for the unmemorable songs, weak villain, tolerable supporting characters and the movie's version of Jar Jar Binks in Eddie Murphy's dragon sidekick Mushu. Although there are worst Disney animated features than this, this movies is one of the least enjoyable ones I've watched. Definitely a disappointment.",
      "review_date": "2012-11-24"
    },
    {
      "review_title": null,
      "content": "Nope.    .    .",
      "review_date": "2015-01-28"
    },
    {
      "review_title": null,
      "content": "Vengo después de ver miles de patadas de ahogados provenientes de los ardido cerrados de mente que están haciendo review bombing al live action porque no sale Mushu y porque Mulan es mas fuerte y poderosa que su versión animada, lo cual haceVengo después de ver miles de patadas de ahogados provenientes de los ardido cerrados de mente que están haciendo review bombing al live action porque no sale Mushu y porque Mulan es mas fuerte y poderosa que su versión animada, lo cual hace arder a la mayoría ",
      "review_date": "2020-09-13"
    },
    {
      "review_title": null,
      "content": "excelllent movie ! strongly advised 10+ . the movie is very superior to the other classics",
      "review_date": "2020-02-09"
    },
    {
      "review_title": null,
      "content": "Long live the CPC! Down with Yankee Imperialism! I hope the CPC beats US Capitalists/Imperialists just like Mulan beats the Huns!",
      "review_date": "2020-09-08"
    },
    {
      "review_title": null,
      "content": "Very entertaining Disney film, beautifully animated with a story that will please both adults and children. Good score, well written and an excellent pace. The humorous touches are great.",
      "review_date": "2009-07-05"
    },
    {
      "review_title": null,
      "content": "Mulan came out towards the end of Disney’s peak era of animated musicals, which began in 1989 with The Little Mermaid and ended in 1999 with Tarzan. The company released 9 major feature films of that genre in that period, and I rank Mulan isMulan came out towards the end of Disney’s peak era of animated musicals, which began in 1989 with The Little Mermaid and ended in 1999 with Tarzan. The company released 9 major feature films of that genre in that period, and I rank Mulan is somewhere about 5th or 6th in that pack: a quite entertaining, beautiful film, with very good musical numbers, which only lacks in a few story elements and a central heroine not quite as well-rounded as the likes of Ariel, Belle or Jasmine from past films. On balance the good stuff in this film far outweighs the minor issues I had. Mulan, even if it isn’t one of the better Disney musicals, is certainly one that should satisfy those of all ages looking for a rousing and inspirational tale. The strangest thing though is the first song in the closing credits: I'm not sure what they were thinking with that; doesn’t fit at all with the film.",
      "review_date": "2014-07-31"
    },
    {
      "review_title": null,
      "content": "Action-packed, funny, and featuring terrific voice-overs, 'Mulan' is one of Disney's finest films and is sure to keep young kids, and people who are older, satisfied and entertained.",
      "review_date": "2011-04-22"
    },
    {
      "review_title": null,
      "content": "Beautifully animated a poetic and idealized Chinese society; the movie profoundly reflected gender inequalities, beautifully incorporated Chinese aesthetics, and eulogized female heroism in a similar fashion comparable to the original poem itBeautifully animated a poetic and idealized Chinese society; the movie profoundly reflected gender inequalities, beautifully incorporated Chinese aesthetics, and eulogized female heroism in a similar fashion comparable to the original poem it was based upon. Pretty costumes, too.",
      "review_date": "2011-01-18"
    },
    {
      "review_title": null,
      "content": "I cannot really fault this movie. The animation, the story, the characters, the excitement and the feeling are just incredible............................",
      "review_date": "2012-05-24"
    },
    {
      "review_title": null,
      "content": "Great animation, voice acting and music but story just doesn't make any sense.",
      "review_date": "2019-04-07"
    },
    {
      "review_title": null,
      "content": "Mulan is a strong, well-rounded movie that does feature a few minor values but that doesn't cheapen the experience as a whole at all. It's a classic and I enjoyed watching it. It's far superior to that live-action trash they pushed on us.",
      "review_date": "2021-01-13"
    },
    {
      "review_title": null,
      "content": "feminist and chinese propaganda in my view. And even beside that the story, characters and drawings didnt impress me",
      "review_date": "2021-02-16"
    },
    {
      "review_title": null,
      "content": "With a grand tale and a fresh, strong princess, \"Mulan\" has moments to make it a wonderful addition to its strongest films. With \"Mulan\", you get the strong character \"Mulan\" who doesn't rely on a mighty prince to always help her out inWith a grand tale and a fresh, strong princess, \"Mulan\" has moments to make it a wonderful addition to its strongest films. With \"Mulan\", you get the strong character \"Mulan\" who doesn't rely on a mighty prince to always help her out in situations, and its great to see a warrior in the role of a female. While it may have that kid-quality within it, maybe it's best that it is, as its fun for the whole family.",
      "review_date": "2013-07-05"
    },
    {
      "review_title": null,
      "content": "A so-so movie, but it's oddly memorable. The animation is great, and the story is interesting. But the overall feel of the film and the movie itself aren't the best.",
      "review_date": "2014-02-16"
    },
    {
      "review_title": null,
      "content": "After watching the remake I appreciate this even more. It is a Disney classic and excellent movie. It is the Disney version of the ballad of Mulan. A Chinese legend where Mulan takes her fathers place in the army because he is too old toAfter watching the remake I appreciate this even more. It is a Disney classic and excellent movie. It is the Disney version of the ballad of Mulan. A Chinese legend where Mulan takes her fathers place in the army because he is too old to serve and her brother is too young. This was at a time were women were discriminated and thought to be inferior so she had to pose as man or other sources claim her comrades did not recognize it until the war ended. Disney took a lot of liberties and succeed. The story is excellent as Mulan faces the drill and brutality of war as an invading army threatens China. Mulans journey is one of self discovery as she must hide her gender and overcome the odds. She does this by hard work, willpower and determination. She earns the trust and respect of her comrades and superiors while being torn out by the fact that she is hiding and lying to them. The other characters are ranging from fitting to excellent. Be it Li Shang as her commander, her family, the emperor and the excellent intimidating villain Shan Yu (maybe a bit too cliche). Then there is Mushu the small dragon like family guardian. He is the comic relive and hidden star. He improves the movie and is voiced by comedians in nearly all versions (US: Eddie Murphy German: Otto Waalkes and French: Jose Garia). The story is well done and focus on character development and interactions. The animation look still good today and the soundtrack is really good but it is the kind that can be a hit or miss. Overall a classic Disney movie that is still excellent. I prefer it over the remake any day. I give 1 additional point because the remake made me appreciate the original even more. Extra knowledge: While women were suppressed in China it did not stop them. There are female empresses like Wu Zetian and Cixi (not official named empress but empress in everything but name), bad ass warriors like Lin Siniang, scientists like Wang Zhenyi or the pirate queens  Zheng Yisao (Yes she was represented in Pirates of the Caribbean) and Ching Shih.",
      "review_date": "2020-09-08"
    },
    {
      "review_title": null,
      "content": "im only giving it a five because I would be much cooler of a guy had I not watched this so many times i bet... Great to have a top quality movie with a female lead character....even though the singing about reflections is lame and the corsetim only giving it a five because I would be much cooler of a guy had I not watched this so many times i bet... Great to have a top quality movie with a female lead character....even though the singing about reflections is lame and the corset part is weird and the singing about the girls they want is kinda weird...this movie is great due to the avalanche scene....and the wall scene...the theme is fun great so a female lead character....in a disney film after all that micky mouse with minnie being all weird i bet.........",
      "review_date": "2015-03-16"
    },
    {
      "review_title": null,
      "content": "Disney's 'Mulan' is one of the best movies to come from the studio in the 1990s. The era that brought us fantastic films from 'Beauty and the Beast' (1991) to 'The Lion King' (1994), 'Mulan' does stand out as one of the best. It follows theDisney's 'Mulan' is one of the best movies to come from the studio in the 1990s. The era that brought us fantastic films from 'Beauty and the Beast' (1991) to 'The Lion King' (1994), 'Mulan' does stand out as one of the best. It follows the story of a young girl named Mulan, who is destined to get married, but something doesn't sit right with her. She feels that arranged marriage isn't in her future, and when she hears that there is an invasion that will take place in China, and that her father must go out to war, she begins to worry. Her father is older and weaker than most of the soldiers enlisting to fight and she fears that she may lose him. Mulan decides to take matters into her own hands and goes undercover as a man to fight in the war. She is not alone, however, Eddie Murphy voices a tiny dragon named Mushu, who decides to guide Mulan so that no harm should come to her. Upon entering the camp where every man is trained, Mulan finds it difficult at first, but quickly gains her way to becoming experienced. 'Mulan' is a solid Disney film with bold animation, catchy songs, a fantastic lead character and a good message for young audiences to learn in the end. It really is one of the best Disney films that the studio has had to offer.",
      "review_date": "2017-05-31"
    },
    {
      "review_title": null,
      "content": "An adventure where Mulan is a woman of ancient Chinese have courage and boldness to face all this other Disney classic . Great to see!, to addition, the Disney classics have a variety of princesses deb movies to such Disney princesses areAn adventure where Mulan is a woman of ancient Chinese have courage and boldness to face all this other Disney classic . Great to see!, to addition, the Disney classics have a variety of princesses deb movies to such Disney princesses are beautiful and has its own story , and you believed in fairy tale.",
      "review_date": "2015-12-05"
    },
    {
      "review_title": null,
      "content": "A Disney Classic. Eddie Murphy does a great vocal performance as Mushu the dragon, the film's best character. The movie is full of heart and humour with a great soundtrack too. I loved this when I was small and having rewatched it relativelyA Disney Classic. Eddie Murphy does a great vocal performance as Mushu the dragon, the film's best character. The movie is full of heart and humour with a great soundtrack too. I loved this when I was small and having rewatched it relatively recently, I'll say it's as good as I remember. The Disney Renaissance brought us many classics and this is one of them. And at least it's not on Disney's slate of unnecessary live action remakes-wait, they ARE remaking it? Oh, lord WHY!?!?!? They may as we'll rename it \"Moolah\".",
      "review_date": "2016-01-09"
    },
    {
      "review_title": null,
      "content": "A very good Disney classic for everyone to enjoy. It's just decently good that I don't have any more words to say but this limit's preventing me to enter without typing in a review that has less than 150 characters.",
      "review_date": "2016-01-20"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nLove the film and music was brilliant in it. Have watched many times and would watch again. A very good message that woman are just as capable as men are.",
      "review_date": "2016-04-12"
    },
    {
      "review_title": null,
      "content": "Awesome movie, just watched it. I know, I should have seen ages ago but damn I enjoyed it even today. It holds up as 20+ year old movie very well. And for me makes Mulan the best princess in the Princess lineup. Great story and shows Mulan'sAwesome movie, just watched it. I know, I should have seen ages ago but damn I enjoyed it even today. It holds up as 20+ year old movie very well. And for me makes Mulan the best princess in the Princess lineup. Great story and shows Mulan's femininity but also tomboyishness very well.",
      "review_date": "2019-04-16"
    },
    {
      "review_title": null,
      "content": "Wow this world is kind of bonkers fun with ghostly ancestors and sassy tiny dragons. Focusing on the human stuff it is really a heartwarming and endearing family tale. The love of a daughter for her father. The love of a father where theWow this world is kind of bonkers fun with ghostly ancestors and sassy tiny dragons. Focusing on the human stuff it is really a heartwarming and endearing family tale. The love of a daughter for her father. The love of a father where the highest honor bestowed are mere trinkets to be discarded compared to his love for his daughter, awh...",
      "review_date": "2022-08-18"
    },
    {
      "review_title": null,
      "content": "What a strong movie. For 1998 they show 100% how hard the wars were and values and roles these cultures had for lots of years. Mulan breaks that scheme with a treatment not only serious but also lively, graceful and synthetic so any child canWhat a strong movie. For 1998 they show 100% how hard the wars were and values and roles these cultures had for lots of years. Mulan breaks that scheme with a treatment not only serious but also lively, graceful and synthetic so any child can understand it. And as a boy this all seemed so natural!",
      "review_date": "2017-10-04"
    },
    {
      "review_title": null,
      "content": "10/10 excellent movieI first saw this movie as a little kid, but I still enjoy it now that i'm 22. I consider this to be one of the first GOOD movies to come out of that greedy capitalist hellhole called Disney in years. Some of the10/10 excellent movieI first saw this movie as a little kid, but I still enjoy it now that i'm 22. I consider this to be one of the first GOOD movies to come out of that greedy capitalist hellhole called Disney in years. Some of the arguments against it have been ridiculous.\"It's racist!\" Oh come on people, it's supposed to be and adventure/war movie, not a remake of Ghandi! The Huns are bad, the Chinese are good because that's how it was in the ancient legend. A movie like this is not supposed to put political correctness before entertainment.\"It's discriminating against men!\" Lighten up, please. I'm a guy and I wasn't offended by this. It's from Mulan's perspective, and I think it's safe to say she was somewhat prejudiced. Besides, Shang was cool. There was nothing wrong with him.\"It's too violent!\" I hate to break it to you, but war happens. Yes, there are fields of bodies. Yes, the bad guys kill people. Yes, it might scare little kids. But seriously, the evening news is way more violent. These things happen, and if your kids never know about it then they're going to be pretty freaked out when they first encounter the real world.In short, Mulan is a great movie for anybody who doesn't want they're kids to live in a bubble. It's got action, romance, friendship, the whole works, and would have been great even if it wasn't animated.",
      "review_date": "2020-10-22"
    },
    {
      "review_title": null,
      "content": "Es simplemente hermosa, la historia, la música, el mensaje, una gran maravilla, no es perfecta pero se disfruta muchísimo",
      "review_date": "2020-10-12"
    },
    {
      "review_title": null,
      "content": "Mulan es bastante perfecta dentro de lo que cabe. Todos los temas que toca la película, mas la ambientación realmente te atrapan. Un verdadero clásico sin duda alguna, sin embargo creo que debieron de haber explotado mas a los ancestros,Mulan es bastante perfecta dentro de lo que cabe. Todos los temas que toca la película, mas la ambientación realmente te atrapan. Un verdadero clásico sin duda alguna, sin embargo creo que debieron de haber explotado mas a los ancestros, contar un poco su pasado y demás cositas, lo mismo para Mushu que la razón por la que lo degradaron queda en una frase que tiran al aire, ademas, el villano no se me hizo tan memorable, siendo malo porque si y ya. Quitando eso, una gran película animada que recomiendo ver.",
      "review_date": "2021-01-22"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is hands-down my favorite Disney film because Mulan is a break from the traditional princess who always needs rescuing and ends up not only saving her \"prince\" Shang in the end, but the whole of China. She manages to bring greater honor to her family by breaking out of what society expects of her than by obeying and shows that you don't always have to follow the beaten path for success! It also has great animation and a wonderful soundtrack!",
      "review_date": "2019-05-25"
    },
    {
      "review_title": null,
      "content": "Un classico Disney di cui difficilmente mi stancherò.Certo, non è perfetto, il villain poteva essere più approfondito, ma il carisma c'è ed è uno dei pochi esempi legittimi di emancipazione femminile che consiglierei sinceramente.Un classico Disney di cui difficilmente mi stancherò.Certo, non è perfetto, il villain poteva essere più approfondito, ma il carisma c'è ed è uno dei pochi esempi legittimi di emancipazione femminile che consiglierei sinceramente.Consigliato? Yup, anche se sicuramente l'avrete già visto.Sapete benissimo che non avrei rivisto questo film senza una ragione. Just saying...",
      "review_date": "2021-12-05"
    },
    {
      "review_title": null,
      "content": "The Huns, who are led by the ruthless Shan Yu, invade Han China by breaching the Great Wall. The Chinese emperor orders a general mobilization, with conscription notices requiring one man from each family to join the Chinese army. When FaThe Huns, who are led by the ruthless Shan Yu, invade Han China by breaching the Great Wall. The Chinese emperor orders a general mobilization, with conscription notices requiring one man from each family to join the Chinese army. When Fa Mulan hears that her elderly father Fa Zhou, the only man in their family and an army veteran, is going to war once more, she becomes anxious and apprehensive due to his weakening health. Taking her father's old armor and cutting her long hair, she disguises herself as a man so that she can enlist instead of her parent. The family quickly learns of her departure, and Mulan's grandmother prays to the family ancestors for Mulan's safety. The ancestors order their \"great stone dragon\" to protect Mulan. They send the small dragon Mushu, a disgraced former guardian, to awaken the stone dragon, but he accidentally destroys it in the process. Mushu conceals this from the ancestors and resolves to protect Mulan himself.Reporting to the training camp, Mulan is able to pass as a man, although her military skills are initially lacking. Mushu provides clumsy guidance to Mulan on how to behave like a man based on his poor judgement and stereotypical views. Under the command of Captain Li Shang, she and her fellow recruits Yao, Ling, and Chien-Po gradually become trained warriors. Desiring to see Mulan succeed, Mushu creates a fake order from Shang's father, General Li, ordering Shang to follow the main imperial army into the mountains. The reinforcements set out, but arrive at a burnt-out encampment and discover that General Li and his troops have been massacred by the Huns.As the reinforcements solemnly leave the mountains, they are ambushed by the Huns, but Mulan cleverly uses a Huolongchushui cannon to cause an avalanche, which buries most of the invaders. An enraged Shan Yu slashes her in the chest, and her deception is revealed when the wound is bandaged. Instead of executing Mulan as the law requires, Shang spares her life, but nonetheless expels her from the army. Mulan is left to follow alone as the recruits depart for the imperial city to report the news of the Huns' destruction. However, it is discovered that several Hun warriors, including Shan Yu, have survived the avalanche, and Mulan catches sight of them as they make their way to the city, intent on capturing the emperor.At the imperial city, Mulan tries convincing Shang about Shan Yu's survival to no avail. The Huns capture the emperor and seize the palace. With Mulan's help, Yao, Ling, and Chien-Po pose as concubines, and are able to enter the palace. With the help of Shang, they defeat Shan Yu's men; as Shang prevents Shan Yu from assassinating the Emperor, Mulan lures the Hun leader onto the roof, where she engages him in single combat. Meanwhile, acting on Mulan's instructions and signal, Mushu fires a large skyrocket at Shan Yu. The rocket strikes and propels him into a fireworks launching tower, where he dies in the resulting explosion.Mulan is initially reprimanded by the Emperor for having destroyed the palace and shamed the army and her family, but is unexpectedly praised by himself and the assembled inhabitants of the city for having saved them, who bow to her in an unprecedented honor. While she accepts the crest of the Emperor and the sword of Shan Yu as gifts, she politely declines his offer to be his advisor, and asks to return to her family. Mulan returns home and presents these gifts to her father, who is overjoyed to have Mulan back safely. Having become enamored with Mulan, Shang soon arrives under the pretext of returning her helmet, but accepts the family's invitation to stay for dinner. Mushu is reinstated as a Fa family guardian by the ancestors amid a returning celebration.",
      "review_date": "2020-05-25"
    },
    {
      "review_title": null,
      "content": "Mulan is a beautifully animated movie, the cast are great especially Mushu (Eddie Murphy) he's got to be the star of the show throughout this movie. Also, the movie's got a decent plot and it's got some interestingly good sing along songsMulan is a beautifully animated movie, the cast are great especially Mushu (Eddie Murphy) he's got to be the star of the show throughout this movie. Also, the movie's got a decent plot and it's got some interestingly good sing along songs throughout the movie which work quite well. Overall, it's quite an amazing and clever movie with a great cast of actors/actresses and it's got a very lovely animation which holds up very well, it's honestly worth the watch.",
      "review_date": "2020-06-28"
    },
    {
      "review_title": null,
      "content": "Mulan brings a truly strong female lead to life with majestic music accompanying an epic story filled with wit, peril, action, and inspiration for a great addition to Disney films.",
      "review_date": "2020-05-14"
    },
    {
      "review_title": null,
      "content": "Uma obra prima impecável. Personagens carismáticos, enredo empolgante e trilha sonora fantástica.",
      "review_date": "2020-09-14"
    },
    {
      "review_title": null,
      "content": "not a perfect adaptation of the ballad of Mulan but a very solid one. It has its limits due to the language and cultural barriers but it is fun and visually stunning to watch.",
      "review_date": "2020-09-18"
    },
    {
      "review_title": null,
      "content": "Amazing movie. This will always be one of my favourite Disney movies of all time. All of the songs are phenomenal and \"I'll make a man out of you,\" is always a bop. Surprisingly though, the movie actually gets better after the music isAmazing movie. This will always be one of my favourite Disney movies of all time. All of the songs are phenomenal and \"I'll make a man out of you,\" is always a bop. Surprisingly though, the movie actually gets better after the music is finished, not to say the music isn't great, it's actually amazing. Obviously a must see for any Disney fan.",
      "review_date": "2020-07-04"
    },
    {
      "review_title": null,
      "content": "My all time favourite Disney film everything is 10/10 with the soundtrack being on absolute fire.",
      "review_date": "2020-07-10"
    },
    {
      "review_title": null,
      "content": "Rejoice, the orginal Mulan deserves a 10 compared to the live action Mulan (2020) which deserves a 0.I love China but this movie really do the history justice. The director of the 2020 version failed at creating a movie",
      "review_date": "2020-09-05"
    },
    {
      "review_title": null,
      "content": "I consider it one of the best animated films of all time. The message it delivers was ahead of its time. Fun from start to finish.",
      "review_date": "2020-09-10"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n'Mulan' is an animated historical adventure movie based on the \"Ballad of Mulan\" by Guo Maoqian. It was directed by Tony Bancroft and Barry Cook. Thirty-two scriptwriters worked on the script.The Chinese girl, whose name is Fa Mulan, wanting to keep her father safe, dresses as a man and goes to war instead of him with her dragon Mushu who helps her. People around her expected that Mulan would be only a wife like every other Chinese woman, but she turns to be a strong and brave warrior who with other warriors saves her country and protects the emperor from his enemies.Coming out in 1998, it was popular among children and adults as well. Most critics like this movie. It won several Awards and the love of the audience. It is one of the most exciting animated movies of the 90s.Written by Anastasiia Shystovska",
      "review_date": "2021-01-05"
    },
    {
      "review_title": null,
      "content": "A animated disney movie with an engaging story about family duty. It's a pretty good disney movie. but it could've been a bit better if there was more songs and mushu being less annoying.",
      "review_date": "2022-04-17"
    },
    {
      "review_title": null,
      "content": "My favorite animated movie until Encanto. Still a top 20 movie for me all time. This began my love of both animation and fantasy. I love the themes and message of this movie.",
      "review_date": "2022-06-04"
    },
    {
      "review_title": null,
      "content": "A classic movie with strong action and songs. Even if the ending is a tad lame.",
      "review_date": "2022-07-21"
    }
  ],
  "num_reviews": 79
}