{
  "title": "What Ever Happened to Baby Jane?",
  "rating": 7.6,
  "release_date": "1962-10-31",
  "genre": [
    "Drama",
    "Thriller",
    "Horror"
  ],
  "summary": "A former child star torments her paraplegic sister in their decaying Hollywood mansion.",
  "critic_reviews": [
    "The ultimate camp-Gothic bitchfight. Vastly entertaining.",
    "As in the best Hitchcock movies, suspense, rather than actual mayhem, drives the film.",
    "It's a black-and-white shocker, a crazed psycho-melodrama, a pitch-black show-biz satire, a warped meditation on the traumatizing effects of child stardom, and a gothic tale of familial dysfunction as its dysfunctioniest.",
    "Aldrich's direction and dynamite performances from the two old troupers make this film an experience.",
    "Whatever else it may turn out to be, What Ever Happened to Baby Jane? is certainly one of the most fascinating and unusual cinema items of the year, and one that will capture a huge amount of publicity and comment.",
    "Sour as month-old milk and with a tang of off-screen animosity in its mouth, Robert Aldrich's melodrama is still hysterical in every sense of the word.",
    "The film remains fascinatingly warped: an extended study in decaying flesh, set to a score mordantly trying to break into Hooray for Hollywood.",
    "That undeniable off-screen friction only helps grease the wheels of the film’s compulsive forward momentum, supplying a crackling energy to scenes wherein, among other gothic horrors, pet birds are served up for supper with relish.",
    "Once the inept, draggy start is passed, the film’s pace builds with ever-growing force.",
    "This frightening, darkly comic picture is much influenced by Sunset Boulevard.",
    "Producer/director Robert Aldrich acknowledged the two performers’ “monstrous” potential – and by unleashing them face-to-face, he became a ringmaster.",
    "I can't help thinking that the most interesting things happen in the precredit sequence - the fraught childhood, Blanche's sinister \"accident\" - but it's still vivid, barnstorming stuff.",
    "Though far from Aldrich’s best, it still makes for an amusing and enjoyable romp, with Davis’s schizophrenic ravings deepened by the poignant awareness the director shows of loss, ageing and faded glory.",
    "Once seen, Aldrich’s What Ever Happened to Baby Jane? is hard to forget, as it charts the sad path of many a former child star to the backwaters of the Hollywood hills.",
    "The feeble attempts that Mr. Aldrich has made to suggest the irony of two once idolized and wealthy females living in such depravity and the pathos of their deep-seated envy having brought them to this, wash out very quickly under the flood of sheer grotesquerie. There is nothing particularly moving or significant about these two."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "A grim insight into the sadness and bitterness of Hollywood. This film is elevated by its constantly growing suspense, achieved with great direction, fantastically written characters and stellar lead performances.",
      "review_date": "2019-06-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An old-fashioned suspense story, though somewhat difficult to call it horror.What Ever Happened to Baby Jane? It'is more of a story of mutual resentment, therefore until it reaches a certain point, the film is more of a drama that begins toAn old-fashioned suspense story, though somewhat difficult to call it horror.What Ever Happened to Baby Jane? It'is more of a story of mutual resentment, therefore until it reaches a certain point, the film is more of a drama that begins to slide towards suspense and horror.Undoubtedly, not all its components work convincingly and the narrative has a hard time picking up pace in the first half hour, however, I found it quite competent with what it provides and for a film of almost 60 years, it goes without saying that its achievements are quite commendable.",
      "review_date": "2020-10-18",
      "source": "metacritic"
    }
  ],
  "num_reviews": 17
}