{
    "rating": 9.5,
    "release_date": "1985-06-01",
    "num_reviews": 410,
    "genres": [
        "History",
        "Drama"
    ],
    "summary": "At the age of seventy, after years of consolidating his empire, the Great Lord Hidetora Ichimonji (Tatsuya Nakadai) decides to abdicate and divide his domain amongst his three sons. Taro (Akira Terao), the eldest, will rule. Jiro (Jinpachi Nezu), his second son, and Saburo (Daisuke Ryu) will take command of the Second and Third Castles but are expected to obey and support their elder brother. Saburo defies the pledge of obedience and is banished.",
    "reviews": [
        {
            "content": "This Japanese take on King Lear is an essential experience in filmmaking.",
            "review_date": "2023-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An All Time Classic. Every fundamental element is honestly flawless. The shots are framed, filled with color and so intricate with depth of field use its amazing to see. The acting is very distinct and really well done with great expressions on the characters faces. The story itself is as epic as the sweeping presentation is. Anyone who is interested in learning about Akira Kurosawa or international films in general should watch this.",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is, truly, the WORST movie I have ever had the displeasure of watching. I would not wish upon my worst enemy to sit through all 2 hours and 40 minutes of Ran. \n\nThough oftentimes I find the beginning scenes of movie to be poor at setting the tone for the overall film, Ran's opening perfectly establishes the movies pacing: slow, awkward, and difficult to sit through. Even compared to other movies of the time, the effects are poor, and the acting leaves much to be desired. \n\nI do not understand why this movie is rated so well, and disagree to the utmost. I would rather do classwork or physical labor than watch Ran again.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly one of the most deserving films of more than 10 rewatches.  A multi-layered, gritty, thought-provoking, depressing, and complex drama that creates a storyline built upon one of the quintessential  Shakespearean classics in order to formulate one of the most complex movie experiences I have ever had (damn that was a horrendously long sentence).  Although a long and arduous ride ,  Ran constantly demands your full attention through plot twists, moral dilemmas, and philosophical references.  Additionally, this is likely the most visually stunning 3 hours you will ever have whilst watching a movie.  The cinematography is incomparable to any other film and color mixing is impeccable.  An absolute must watch for anyone who considers themselves a cinephile (or anyone who wants an epic three hour experience for that matter).",
            "review_date": "2022-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An experience. Powerful but controlled. Beautiful cinematography.",
            "review_date": "2022-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa and Shakespeare.  Nothing more needs to be said.",
            "review_date": "2022-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is a visual and narrative masterpiece—if it can keep your attention during its runtime.",
            "review_date": "2022-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As Throne of Blood is to Macbeth, Ran is Kurosawa's interpretation of a Japanese King Lear. The plot is thick with betrayal and self-interest, all shot in beautiful, beautiful color — whether it be the rolling green hills or the orange-fires consuming a black and gray castle. Hidetora (Tatsuya Nakadai) abdicates from his position of power, relinquishing complete control to his eldest son, Taro (Akira Tarao), to the pleasure of the middle son, Jiro (Jinpachi Nezu), and to the chagrin on his youngest, Saburo (Daisuke Ryu). This decision casts into motion the entire slimy plot of scheming actors — I must imagine that Ran served as one of George R.R. Martin's many inspirations for GoT. Hidetora's health and visage begin deteriorating once he realizes the effects of what he's done — he eventually doesn't look much better than an afflicted King Théoden. There is a lot of Hidetora wandering the countryside, oftentimes with his jester, Kyoami (Peter), which gives me one of my few criticisms of the film. At 162 minutes, some of this could've been cut. The film is filled with visually stunning scenes, most notably Saburo's cavalry crossing the river, Ayabe's (Jun Tazaki) contingent high on the hill, and the castle engulfed in flames. Kurosawa gives us some solid battle scenes — it is astounding how these actors really fell from their horses and bounced off the ground — but I have to admit I was disappointed we never got the armies really engaging each other in hand-to-hand, katana-clashing combat. Ran is a must-see for anyone who enjoys a blood-covered epic. I'm comfortable giving it one point less than Seven Samurai.",
            "review_date": "2022-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What happens when you mix a Shakespearean play with the weather channel",
            "review_date": "2022-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't get it with these movies. Sure, the visuals and cinematography are great. Films like this are probably important from a historical perspective, but god, is it boring.\n\nThere's little action and the dialogues are very stiff and slow imo.",
            "review_date": "2021-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As I watched, I couldn't help but lament that there will never be another movie made like this.  The artistry involved is lost to time.",
            "review_date": "2021-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran, the sprawling epic by Akira Kurosawa, is a retelling of Shakespeare's King Lear set in 1500s Japan.  Lord Hidetora decides to relinquish his power and divide his holdings between his three sons, leaving his eldest son the power of rule.  As with the source material, the film deals with themes of loyalty and the chaos that results from the struggle for power.  Despite the horribly overwrought acting at times, the film features beautiful cinematography, remarkable sets and costumes, and some of the most powerful battle scenes ever staged and remains one of Kurosawa's crowning achievements.",
            "review_date": "2021-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watch quite a lot of Southeast Asian films, and the great majority have very fine, naturalistic acting. The other Kurosawa films I've seen have your usual cinematic rather than theater-style acting. The acting in Ran takes me out of the movie a lot. Tatsuya Nakadai seems to spend most of the movie bug-eyed and slack-jawed while 'Peter' just seems like some cliched effete homosexual twit. It's the visuals of the impossibly glorious colors, the army marching on horseback, the fantastic clothing design along with the basic story line that make it so remarkable for me.\nThe army crossing the countryside, crashing through the waters, is fantastic. The image brings with it a sense of the regal, the honorable, but also one of impending wrath; it's almost frightening in a way. costumes, which won an Academy Award, carry most of the film's color. I read that the 1,400 costumes were handmade in Kyoto, traditional seat of Japanese tapestries: \"It took three to four months to make each beautifully colored robe (the work was done simultaneously), and it was nearly three years before all were finished.\" Kurosawa frequently chooses drab backgrounds--barren soil, gray slab courtyards, rock steps--to show off their dazzling beauty.\nThe film is set in medieval times, but it is a 20th century film, in which an old man can arrive at the end of his life having won all his battles, and foolishly think he still has the power to settle things for a new generation. But life hurries ahead without any respect for historical continuity; his children have their own lusts and furies. His will is irrelevant, and they will divide his spoils like dogs tearing at a carcass.\nThe story line, partly inspired by Shakespeare's \"King Lear\", but also commenting on on the intricacies of family dynamic, ego, selfish obsessions, and war in general, is compelling for sure. However, I felt too many scenes were unnecessarily wrong, leaving me wanting to skip ahead much of the time. The greatness of the film outweighs the slights, so I'll go with 3.8 stars for now.",
            "review_date": "2021-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the cinema's great visions of apocalypse. With grand, painterly gestures, staggering scale and God-like remove, Kurosawa elicits an effect of hushed, horrified awe at man's impulse for destruction and the eternal folly of war. A master (and master's) statement.",
            "review_date": "2021-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was hampered by missing the cinema release of Ran in its 4k re-release a couple of years ago, seeing it on the small screen is not where it works best. The action sequences still look superb, and the cinematography is unreal, but I did find it less engaging than some of Kurosawa's previous work, most notably Seven Samurai (1954). A loose adaptation of Shakespeare's King Lear, it also takes themes from Macbeth and Hamlet, and is nothing short of epic in scope and scale, but certainly seek it out in 4k blu ray and see it on the biggest TV you possibly can.",
            "review_date": "2021-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa's Ran (乱, translit. Mandarin: \"luàn\", lit. \"chaos\") is one of his most highly regarded films. It adapts the plot and narrative structure of Shakespeare's King Lear to the Sengoku Jidai: in place of Lear and his daughters Goneril, Regan, and Cordelia, we have the daimyō Ichimonji Hidetora and his three sons, Taro, Jiro, and Saburo. This transposition somewhat intensifies certain aspects of King Lear's moral conceit. Hidetora's sons neglect their formal duties under filial piety, just as he abdicates his own responsibilities as lord and father. While the actions of their Shakespearean counterparts is intuitively reprehensible, in Ran, they violate codified central tenets of Confucian ethics.\n\nNihilistic interpretations of King Lear came into vogue in the 20th century, but while neither the stage production nor its film adaptation affirms a strong moral conclusion, to me it is at least clear that an ambiguous morality is not equivalent to a lack thereof. Ran is a cautionary tale about seeking privilege without responsibility, substanceless claims to moral superiority, and the banal yet fragile nature of what is truly good. Kurosawa's direction relies more heavily upon nonverbal techniques than Shakespeare's dialogue, and it is largely for his mastery of visual storytelling that the film is so highly regarded by critics.\n\nThe film feels more of an exercise in visual storytelling, than necessarily a source of mass entertainment. It certainly is instructive in expressive cinematographic technique, with much to be learned and emulated. For the critical viewer, this is indeed a great masterpiece.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran means chaos or turmoil and that's what's at the heart of Akira Kurosawa's take on King Lear and Mōri Motonari. The director had been planning to make this film for decades and this was the realitization of a decade of painting the storyboards for this film. It would be his last epic and the most expensive film that he would ever make.\n\n\n\nBeyond the autobiographical nature of this story, Kurosawa also saw the battle scenes as metaphor for nuclear warfare and the high anxiety after Hiroshima. There's also the influence of Japanese Noh theater for two of the protagonists, Hidetora and Lady Kaede, whose single-mindedness stand in contrast to the rest of the cast of characters.\n\nHidetora is a powerful warlord at the close of his life who has decided to divide up his kingdom amongst his sons, with Taro gaining the First Castle and the leadership of their family, while his brothers Jiro and Saburo are to support him and live in the lesser castles.\n\n\n\nThe wise old man explains unity using three arrows. It is easy to snap one arrow but three together are more durable. Saburo snaps all three arrows and calls his father a fool, which leads to him and a servant named Tango being exiled. Fujimaki, a visiting leader who watches all of this, agrees with the brash young man and offers him his daughter in marriage.\n\nTaro's wife Lady Kaede also demands that her husband go to war, still angry that her entire family was killed by Hidetora. The constant battles — gunfire has replaced swords and arrows — drives the old man mad as he wanders the wilderness, haunted by visions of those he has destroyed in his journey to power.\n\nAs the entire family follows him into some level of insanity, with war, intrigue and double crosses throughout, it seems as if every castle will crumble into nothingness.\n\nHow important was Ran to Kurosawa? His wife of 39 years Yôko Yaguchi, died during the production and he only mourned for one day. His eyesight had also completely deteriorated by the time principal photography began, so his assistants used his paintings as guides to frame each scene.",
            "review_date": "2021-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mixture of brilliant and boring, this film brings us an incredible story and characters but too much of the time I felt bored rather than entertained by what I thought was going to be an amazing epic.",
            "review_date": "2021-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The term 'sweeping' seems to get overused quite a bit when describing epic films, but the term absolutely applies here; Ran is the most sweeping film of Kurosawa's career, in scope and cinematography alike (though perhaps not in theme). While the setting and several details are altered, the nature of Shakespeare's tragedy is evident in full force, as a family initially presented in regal certainty find themselves pulled apart by greed, mistrust, naïveté, madness, and, perhaps most painfully, chance. Vices such as anger and jealousy fan the flames of conflict until they reach the boiling point with devastating consequences; you'll gaze around the smoke-filled battlefields and, thinking back to the opening scenes, wonder how the characters could have arrived at such an unpleasant fate. At its core (as confirmed by the title), Ran is about the thin line between civilized behavior and total chaos, and the hostility associated with periods of evolution as groups vie against one another for supremacy and survival; the relatively innocuous and somewhat well-intentioned series of events that lead to a complete shattering of both peace and Hidetora's mental state amplify one another in unexpected ways, playing off of human weakness. Deeply philosophical and totally morose. Visual composition is spot-on here, as Kurosawa employs distinctive wide angles in accordance with a massive set and costume budget (that was clearly put to good use); the final shot of the lone, blind Tsurumaru left isolated in the shell of his former castle not knowing that his slain sister will not be able to return to him is a heartbreaker, even if he is not necessarily an important character to the actual plot. (4.5/5)",
            "review_date": "2021-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Colorful Akira Kurosawa epic is a film adaptation of one of Shakespeare's stories that boasts stunning costumes and lavish locale",
            "review_date": "2021-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily in the top dozen most visually beautiful films ever made. Nearly every frame of this 2 hour 42 minute epic is art museum/film school material. Pacing was excellent; never feet long or boring. Stellar cast is the icing on the visual cake.",
            "review_date": "2021-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a spectacular film. Isn't it ironic that some of the greatest retellings of Shakespeare are directed by a Japanese person? Ran is about a great lord, Lord Ichimonji, who retires his power to his three sons. But his life of treachery begins to reap his rewards as his two oldest sons turn against him and each other. His own lust for power begets their lust of power, and ultimately, the film ends with destruction. This story is compelling and, probably because it's Shakespeare, makes it feel classic, timeless, almost like a storybook.\n\nI noticed that Kurosawa's cinematic composition is a little different here. Instead of his three dimensional composition, he chooses to frame his shots flatter. It hit me halfway through the film that this was to give it a more \"stage\"-like, proscenium kind of feel. Nevertheless, this was still a joy to watch.",
            "review_date": "2021-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple to follow, too simple, too drawn out, nowhere near enough drama. Other than one excellent battle, I don't understand the praise for this film. It bored me crazy.",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The last sense along is a masterpiece already",
            "review_date": "2020-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the finest historical epics ever filmed. Although the story leans heavily upon Shakespeare's \"King Leer\", every divergence is justified to serve Kurosawa's tale. This film is impeccable in every sense. Harrowing battles staged over hallowed volcanic landscapes, dyed with the stirring banners of mortal treachery. Each haunting constituent aspect coalesces to  articulate the tragedy of humanity in its highest capacity.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This retelling of William Shakespeare's 'King Lear' is an awesome feat. The colors from the wardrobe and the dramatic acting makes this film compelling to watch, and the story keeps you invested and glued to the screen. The battles in this film are impressive and gargantuan, with hundreds of extras and fantastical sets.",
            "review_date": "2020-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Westerns, war films, period films. If you like any of the aforementioned then you'll like this colourful epic. Akira Kurosawa's last epic. Its essentially a re-telling of Shakespeare's King Lare. It's nice to look at, its abit of a slow burn, but its worth it in the end. \nThe action scenes and set pieces are fantastic. Gorgeous. The reds and yellows, the fiery backdrop and the black sand. It's just a masterpiece. \n\n\"Farewell my Lord.\"",
            "review_date": "2020-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "made me extra horny with the boys :)",
            "review_date": "2020-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what the power can do, how can the power lead to corrupt the family, and turn them on each other, your actions will stick on you forever, and your day will come? that what this film shows us in such a great way.\nthis film blowing your mind, the plot was amazing, every event hit the point, and that couldn't happen without a great director like Akira Korsawaa, he did what anyone else cant does, and surely only him can do what he did with this film, a genius directing, he gave the space for actors to show their abilities, time distribution was perfect, he also took advantage of colors, and uses them correctly, in the right moment, place, and situation, when you see the movie you realize the power of colors, and how you can use them, all of that mixed with magnificent cinematography. the editing keeps you hooked all the time, soundtracks were also amazing, they matched with the scenes perfectly, Acting as well as was perfect from all of the cast, they show us a great performance.\nmy only issue with the movie is the characters of the three brothers,\nthey begin to fight each other instantly, they didn't show any potentials at the very beginning of the movie, if we spent with them enough time while showing their real nature, that would be more convincing.",
            "review_date": "2020-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this late career triumph, Kurosawa further cements himself as one of the greatest directors in history by proving to be just as masterful in color as he is with black and white. In the tradition of Throne Of Blood, Kurosawa finds himself once again adapting William Shakespeare work to feudal Japan with exceedingly effective results. RAN is choked full of all the sweeping battles, family betrayals, and political intrigue that one would suggest when bringing the tale of King Lear to the screen. As usual, Kurosawa's direction is perfection throughout. This is different from his films of the 1950s and 1960s. Here we see him take advantage of the benefits that come with shooting a film in color, like color symbolism throughout. The rivers of blood are also much more striking in there more accurate reddish tones than in his previous works. The film was on the whole more generous when it comes to the carnage on screen, a clear sigh of censorship changes over time. Tatsuya Nakadai would have made Sir Anthony Hopkins proud with portrayal of the mad king. He is able to play both Hidetora's proud stubbornness at the beginning and his descent into hysteria at the end with equal fervor. ————————–Overall: While I personally prefer Kurasawa's smaller scale skirmishes like Rashomon or Seven Samurai, RAN is still an impressive spectacle and spellbinding exploration of the profound themes of The Bard's work. ——————Highlight: In the scene of Hidetora's castle being sieged, what would be a thunderously deafening scene is instead only left with the sparse musical score, making the gruesome slaughter on screen all the more vivid.",
            "review_date": "2020-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is a one of a kind film that really shows the realism of family tragedy. I really love this work from Akira Kurosawa from this directing to his imagery of violence, love, betrayal, and revenge. I also enjoyed the editing, costume design, battle sequences, and storytelling. Overall, Ran really knows how to bring the influence of William Shakespeare to the next level.",
            "review_date": "2020-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa dissects a Shakespeare's classic to reveal its universal themes  against a sumptuous feudal japanese style and creates an epic tragedy that matches the original's maestry.",
            "review_date": "2020-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A genuinely sad, harrowing and beautifully macabre Work of art. Intensely dramatic and a flawless, peerless technical work. The use of colour speaks for itself in cleverly distinguishing the family, but more subtly is the use of weather and seasons to be a metaphor the growing distance between each family. It's a bold and tragic piece, rich and unforgettable.",
            "review_date": "2020-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There’s nothing I can say that hasn’t already been said.",
            "review_date": "2020-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The style and story fit together perfectly. This is a legendary movie and deserves to be.",
            "review_date": "2020-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional Movie. Much better than the boring stuff produced in Hollywood",
            "review_date": "2020-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great take on King Lear!\n\nAkira Kurosawa's epic war drama Ran (1985) is a fantastic adaptation of William Shakespeare's tragedy play King Lear. Kurosawa writes sympathetic and complex characters and modernizes Shakespeare's language into finely tuned dramatic prose for the big screen. Ran is riveting as a tale of fatherhood, brotherhood, loyalty, family, honesty, and betrayal. I can make the argument that Ran is the greatest version of King Lear ever put to film. It's exciting in its large scale combat and engrossing in its nuanced drama. \n\nKurosawa's direction is particularly fascinating as his ambition for realism is unparalleled in these epics. Using scores upon scores of extras in full armor, he gallops entire platoons of men full speed on horseback towards one another. The blur of motion in the camera during the action looks startlingly modern. Ran could have come out now with its genuine performances and contemporary look. Kurosawa continues his obsessions with vibrant color and dream sequences. Ran fashions itself out of lovely kimonos, realistic samurai armor, endless muskets, cool katanas, and frightening spears. It's impressive how Kurosawa brings feudal era Japan to life again and again with his films. Ran is just as astounding as his earlier classics.\n\nTatsuya Nakadai is powerful as Lord Hidetora Ichimonji. He plays the clan head well as an elderly man, who falls prey to his sons' dishonesty, while scorning his honest son. Nakadai uses his big expressive eyes effectively as you feel bad for him by the end. He's a very fun actor to watch in Ran.\n\nI really liked Akira Terao as Taro Takatora Ichimonji. His meek responses are funny and his cruel underhanded is interesting. Jinpachi Nezu is perfect as the traitorous son Jiro Masatora Ichimonji. Daisuke Ryu is excellent as the banished son Saburo Naotora Ichimonji. His candid rapport with Nakadai is nice to see. I must mention Mieko Harada steals the show every time she is on screen as the conniving and resourceful Lady Kaede. Toru Takemitsu's score is really refreshing and different for a Kurosawa film. It sounds quite contemporary to my ears.\n\nOverall, Ran is brilliant filmmaking matched by compelling acting. Kurosawa did it again!",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I still don't completely get everything Microscopic from what I just watched, but I give it credit for what it earned and stood for.",
            "review_date": "2019-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is a 1985 film directed by Akira Kurosawa, who also directed Seven Samurai and Rashomon. The film stars Tatsuya Nakadai as Lord Hidetora Ichimonji and Jinpachi Nezu as Jiro Masatora Ichimonji.\n\nThe story I personally felt was really engaging and portrayed extremely well. The story was also both tragic, but fulfilling simultaneously.\n\nThe acting was also really strong especially Tatsuya Nakadai as Lord Hidetora Ichimonji, I felt that he brung a vibrant and spontaneous flow to the already great character.\n\nThe characters were strong and portrayed very well, especially the Ichimonji's and Tango. \n\nThe cinematography was also very strong, with some really outstanding shots of the scenery and characters.\n\nThe settings also helped with the atmosphere and story of the film, from the main setting of Mount Aso to the various castles set on Mount Aso.\n\nThe sets and props I found to be great, from the various set designs to the sheer detail in the weapons and decorations.\n\nThe costumes and makeup were in my opinion one of the greatest aspects of the film, especially with the various warriors and Lord Hidetora Ichimonji.\n\nThe style of the film I also found to be really strong, from the amazing colour palette to the way the characters interact.\n\nThe practical effects were also done extremely well, especially all the great and dangerous stunts.\n\nThe action I found was also really strong, with in my opinion some of the best deaths in cinematic history. \n\nThe film also has some very unique and stylised music, which worked really well with the atmosphere and tone of the film.\n\nThe film at points also had some really strong atmosphere, especially in the second and third act.\n\nThe film I also really enjoyed, and I hope to watch it again very soon.\n\nOver all I give it a \n9/10\n98%\n4.9/5",
            "review_date": "2019-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa had great takes on the plays of Shakespeare and this epic shook me to my core. Three sons replaced Lear's daughters in this tale of betrayal and misplaced love.",
            "review_date": "2019-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What just may be the greatest movie of the 80's, Akira Kurosawa's \"Ran\" tells the story of William Shakespeare's \"King Lear\" has emotionally affected moviegoers (like me) since it has came out. Filled with some of the best choreographed action sequences to come out in film. Akira Kurosawa films another masterpiece of a film.",
            "review_date": "2019-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a masterpiece, sadly only missing Toshiro Mifune; however the film is brilliant in its own right without Kuro's muse. Tatsuya Nakadai is amazing as the \"King Lear\" of this Shakespearean reworking, with some of the greatest battle footage this side of Good the Bad and the Ugly.",
            "review_date": "2019-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My Favorite Film of All Time. The last great film that Akira Kurosawa made. A true classic.",
            "review_date": "2018-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was great.",
            "review_date": "2018-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's some truly perfect moments of cinema here, but that doesn't totally hide the fact that, just like its protagonist, it gets more and more thin and frail as it goes, and the point of the film seems to have been forgotten long before its over.",
            "review_date": "2018-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not his best but still watchable and enjoyable.",
            "review_date": "2018-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa's most suspenseful and visually-stunning tragedy.",
            "review_date": "2018-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The last picture turns into the best picture of all times",
            "review_date": "2018-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran looks stunning. The colors are all vibrant and eye-catching (something I haven’t seen in a Kurosawa film before.) The big battle scenes are choreographed well, and there are so many extras running around on screen it impressed me. It plays into the authentic feel of the movie as well. I thought those scenes were a big highlight and wish there was more of that in the movie. It also helped that all the armies were conveniently color-coded so I could keep track of who was fighting for who. I struggled a lot with the tone of Ran. It seems like it’s all intended to be serious and dramatic. I mean, this is an adaptation of a Shakespearean tragedy, right? But I kept chuckling. For one thing Tatsuya Nakadai plays the role of the old man so big it’s bordering on farcical. He’s followed around by a jester singing ludicrous songs, which doesn’t help either. Then there is the distraction of all the odd-shaped heads because the bald caps people were wearing looked so weird. When I wasn’t finding it unintentionally humorous, Ran is so dour and depressing, I almost don’t want to watch. Every time I experienced a moment of hope while watching the movie it was squashed like a bug. It’s the type of story I don’t typically gravitate towards, and it didn’t blend well with the silliness of Lord Hidetora. The story is still told well, and I can’t discount the visual style of Ran, but I’m pretty sure this is my least favorite Kurosawa film. Doesn’t help that it’s so long...",
            "review_date": "2018-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first Akira Kurosawa film, and, oh boy, what a treat! \"Ran\" is a nice re-tale of William Shakespeare's play \"King Lear\" but with a twist. Thanks to its breathtaking, haunting cinematography and outstanding performance by its main cast, the film was both entertaining and unforgettable. The action, the story, the tragedy that these characters face... It's a film that will keep you guessing until the very end. A kind of epic that you don't see in the theatres anymore...",
            "review_date": "2018-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films ever made",
            "review_date": "2017-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is Akira Kurosawa's last epic. The man was a genius when it came to directing these long Japanese war epics and Ran is no different. This is Kurosawa's interpretation of Shakespeare's King Lear, a play that unfortunately I did not study. The plot consists of Lord Hidetora abdicating his empire and splitting the kingdom between his three sons, who each want to have total control. And so many castles are raided and many horseback battles are conceived. Whatever the scene, everything was filmed to perfection. I just adore Kurosawa's style, he doesn't rush a single scene. Leave a castle burning for 30 seconds, watch a man run through a field for 30 seconds or even look at the sky for 30 seconds. In theory, I should be bored...but his artistic integrity and majestic style is a sight to behold. What resonated with me the most was the screenplay, also by Kurosawa. Several lines of dialogue felt like Shakespeare and it's admirable to see an influential film maker be...well...influenced by another famous writer. Scenes where Hidetora descends into madness are great examples of this. Tatsuya Nakadai, who portrayed Hidetora, was once again outstanding. This equals his role from Kagemusha, it was an emotive and poignant portrayal of a father who has been betrayed by his children. The battle scenes were masterful work, hundreds of extras in clan attire definitely filled up the screen with contrasting colours. The costume and production design were yet again wonderful to look at. I do love me the traditional Japanese environment that Kurosawa captures with ease. Lady Kaeda though, was the manifestation of evil...her manipulative skills were fascinating to watch. This leads me to my only problem, which is that none of the major characters are likeable, even Hidetora had issues. So I struggled to become emotionally invested in these characters. However, the purpose of this iteration was to explore themes of betrayal and insanity, Kurosawa conveyed them to technical perfection. Not a complete masterpiece, but extremely close to being one.",
            "review_date": "2017-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic retelling of King Lear. I didn't enjoy as much.",
            "review_date": "2017-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran feels like a grand scale play, with grandiose sets and costumes; Kurosawa stages each scene with his superior artistry, but it often feels like he's watching what's going on, rather than using music and editing to enhance the drama.",
            "review_date": "2017-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could have cut down on the very long action sequences. The final battle should remain the length as it shows the strategy and thinking of all the warlords however - and is brilliantly done. \n\nI love Kurosawa films and maybe my standard has been set too high. I could not get involved with the characters as much as I'd hoped. There is great development of a few characters who weren't even part of the major plot - like the jester. Also loved the mention of the rabbit and the accompanying cloud at the start. \n\nI felt the ending was a non-event, maybe an attempt to crush Buddhism and all it's lies? (joke)",
            "review_date": "2017-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wherever those hills/mountains are in Japan, I want to be there. This movie is gorgeous. All the shots of nature and the cinematography are perfectly on point. \n\nTaro's wife seems like she bad news. Same with the wife in Kurosawa's brilliant movie, Throne of Blood. It's crazy to see how conniving and corrupt the Great Lord's son becomes. Wow, amazing sequence when the warriors trap Hidetora and his men and then proceed to kill them. Really dark bet yet so elegant especially with the music in the background. \n\nI love how Hidetora looks like a goddamn ghost when he walk out. It's almost like is in fact a ghost. Amazing shot with the castle burning in the background and all the warriors. \n\nThat scene where Hidetora gets carried into a small house is amazing. When the man plays the flute, you can feel all the emotions and feelings he has towards the whole ordeal with Hidetora himself. It's played out brilliantly. The man in the house serves as a reminder to Hidetora of his not so friendly past. \n\nSeeing all those warriors on horseback cross that body of water full throttle is quite a sight to see. That Lady Kaede is probably the most viscous out of all of them. She don't fucking play no games. It's incredible to see the amount of extras Kurosawa used in this movie, he paid no expenses. I'm glad Lady Kaede's life ended that way. But what was more intersting was her reason behind why she did everything she did. It kind of makes you understand why she did what she did, and makes sense. That ending, wow, so much symbolism and metaphor. \n\nOverall, this movie is an amazing epic. It could easily be arranged into a play, and still be good. The acting and the story line are so gripping. The cinematography is beautiful. A lot of attention to detail was given. Especially with all the costumes, castle, set pieces, and locations. Seeing the good relationship they all had, the father and the sons, and then watching it all go to shit once the father relinquishes his power, is something I've never seen in a movie before. This movie is about revenge, avenging lost ones, family bonds, war, corruption, history, and even religion. And it all comes together elegantly and majestically.",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa's last masterpiece takes on king Lear is breathtakingly tragic as it is visually stunning , depicting the human self-destructiveness \nin a form of cinematic thunder, a spectacle for mind and heart..8/10",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Major cinematic event - yes.  Just not for me.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran, Akira Kurosawa's medieval Japanese retelling of King Lear, provides a very spectacular yet very tragic message based on the dangers of inheriting power.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully crafted film and based on one of Shakespear's works. There are empires, warlords, castles and fighting over power possesion here as a retiring Lord tries to depart his fiefdom between his three sons. This does not reach out as planned and there are loads of conflicts here.\n\nSolid story, not too tricky to hang on to, but there are many names to keep track on here, so I don't get the full grip of the story. It's very long, but worth your time. Rearly boring, and anciant films of foreign language that pushes three hours are bound to include some down scenes. This film has few of them.\n\nSome very good mass fight scenes, really old school warfare. Epic fights are looking super realistic and neat. The landscapes and elements of wind and fire are also looking mezmerizing. I like most of the characters, but the actors that give them life impresses a lot. Great leads! \n\nLoads of extras here, 1400 in fact. Together with the 200 horses they are making it a very lively film and it increses the skill of directing even more. Cool sound wraps up this huge film from one of the greatest directors. Only my third film of his I think, but there will be more.\nNot the greatest film I have seen, not a poor one. It's a big archievement and a fantastic production. Story-wise it's OK and it will be remembered as a very slow film that's well-built and has great looks. Huge film.\n\n8.5 out of 10 clouds.",
            "review_date": "2016-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Consisting of powerful themes about humanity and comprise of beautiful cinematography and the excellent uses of colours, Ran is an ambitious and compelling war drama that is loaded with master Akira Kurosawa's great techniques and visual storytelling.",
            "review_date": "2016-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the most gorgeous movies I've ever seen; and that's not a testament to just the cinematographer but to Akira kurosawa as well because he manages to make every shot ooze out life. Each shot tells a story in itself and that's where the real artistic beauty of the film lies. Other than that, the writing is pretty solid and accompanied with some tremendous performances, especially from Tatsuya Nakadai and Meiko Harada.",
            "review_date": "2016-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 Stars. Another masterpiece. Kurosawa just gets it.",
            "review_date": "2016-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa Masterpiece is one of the greatest films ever made.\r\rIve also seen(on the big screen!) Seven Samurai, Rashamon, Yojimbo, Sanjuro, The Hidden Fortress and Throne of Blood. All Masterpieces, but RAN is most definatly his greatest film.\r\rBeautiful score, a great plot(thanks to Shakespeare), fantastic acting, Directing second to none, and brilliant editing. Everything about this film is brilliant.",
            "review_date": "2016-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shakespeare drama, amazing costuming, epic soundtrack and questionable characters. Everything a good Nihilism film needs: but only a master of classic drama like Kurosawa can make into amazing experience.",
            "review_date": "2016-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is now my second favorite Samurai movie, and I can't help but be in awe of Akira Kurosawa's techniques to convey an apocalyptic cynicism.",
            "review_date": "2016-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm ashamed that it took me this long to finally see this in its entirety. Obviously masterful direction (such magnificent compositions and camera movement! Such superb sound cues!) aside, what strikes me the most about this is the theme of karma. Karma is a real bitch, and you reap what you sow.",
            "review_date": "2016-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another feather in Akira Kurosawa's cap, a great Greek tragedy of a Samurai film, with Kurosawa's incredible cinematography & seasoned Medieval Japanese tropes and filming styles elevating this film to the top tiers of his filmmaking efforts. The dynamic scope capturing the immensity of the final battles well.",
            "review_date": "2016-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an utterly depressing movie. Yet such a glorious epic.\n\nYou can really see how much of a film maker Kurosawa grew when compared to his earlier works such as the lighter Hidden Fortress.\n\nWith RAN Kurosawa utilized color in a way that mastered the medium, impressive given his large filmography in black & white. From his sweeping vistas of green to the shocking reds of his bloods. RAN is both a feast for the eyes as well as the mind.\n\nIt's a perfect example of what could be achieved with hundreds of extras that CGI of today's movies can never quite capture the same impact of.\n\nThough the movie moves at a somewhat glacial pace, you are never bored with its proceedings. Every word of dialog reveals the sweeping plot of the unfolding tragedy. \n\nYou owe it to yourself to watch this at least once in your life.",
            "review_date": "2016-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran (1985) C-162m. ???? D: Akira Kurosawa. Tatsuya Nakadai, Akira Terao, Jinpachi Nezu, Mieko Harada.  Shattering retelling of Shakespeare's King Lear follows 16th century elderly warlord, his family's betrayal. Harada is greatest villainess in screen history; her decapitation scene equally memorable.  Haunting, one-of-a-kind masterpiece from Kurosawa.",
            "review_date": "2016-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of those rare films that transport you to a time and a place, and can hold you there in full spirit until the films end. It starts rather slow but escalates at a very steady pace. well worth the watch.",
            "review_date": "2016-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa masterfully uses blood red and a bright palette to contrast with the Greek tragedy of patricide and sibling manslaughter in his grandly operatic and poetic retelling of King Lear.",
            "review_date": "2016-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.5-5. Classic and powerful. Such a good telling of King Lear that it reawakens my (quite dormant) interest in Shakespeare. Very bleak film.",
            "review_date": "2016-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I bristle a little at terms like 'epic', 'sweeping' and 'magisterial' as sometimes they seem like euphemisms for 'overlong', 'indulgent' and 'you've got to like this because it's by an auteur'. There is no question that Kurosawa is a phenomenon, and his films are all worthy of serious attention. 'Seven Samurai' is an absolute classic. 'Ran' is a good but not great film, though. Its strengths lie in its robust characterisation, philosophical insights into the human condition and in its superb retelling of the King Lear story. The actors are all top notch in spontaneity and vigour. The cinematography and colours are beautiful in the recently restored 4K version. But the direction and editing, in my opinion, are undisciplined. Most of the battle scenes are haphazard, repetitive and overlong (and the fake blood looks ridiculous), though the sense of peril in pre-CGI days is palpable at times. There are waaaay too many scenes of the increasingly mental Hidetora (a consistently intense Nakadai) wandering around woefully in wastelands with his loyal fool Kyoami (a girlish and watchable Pita).\nThere are some outstanding scenes of really gripping drama, especially when the psychotic seducer Lady Kaede (Mieko Harada) is on-screen, and I enjoyed the stalwart, unflinching loyalty and integrity of men like Tango, Fujimaki and Kurogane. The film's themes are superb: irresponsibility, ambition, fidelity, authority, power, futility, sexuality, forgiveness, religion and many others besides. But it's hard to fully root for any of the characters and there is no real hero, as Hidetora himself is revealed progressively to have been a bit of a monster in his younger years. If the film was trimmed by at least 40 minutes to get it near the two hour mark, it would be touching greatness. Instead, it's incisiveness is lost in the flab of excess footage.",
            "review_date": "2016-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long, but worth the time devoted to it.",
            "review_date": "2016-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful feat of terrible and raw tragic power. Ran is simply an amazing movie that transcends description.",
            "review_date": "2016-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The downfall of a powerful house...a story about treachery, hate, greed, vengeance...and male weakness...brilliant movie....strong visuals",
            "review_date": "2016-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic adaptation of Shakespeare's \"King Lear\"",
            "review_date": "2016-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A (literal) Shakespearean masterpiece, Akira Kurosawa's Ran is a dazzlingly rich, beautifully staged update of a classic fable",
            "review_date": "2016-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa transports Shakespeare to medieval Japan in an intense and visually stunning later masterpiece by the beloved director.",
            "review_date": "2015-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film doesn't fully come into focus until the end, when everything leading up to it all suddenly comes together. Therefor the film doesn't work when watched as a linear narrative where you're waiting for what happens next as well as it works when observed as a whole where you already know the entire story and its different thematic elements. I have a feeling repeat viewings will be very kind indeed to the film for this reason. In terms of stand-out moments though the dark and bloody first battle around the one-hour mark bears mentioning, as does the ending which has a moment so suddenly over-the-top bloody that I couldn't help but laugh my ass off in delight.\n\n7,5/10",
            "review_date": "2015-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa's \"Ran\" is my favorite movie of all time. I could go on about why this film is so fantastic in every way, but I'll just leave it at GO WATCH THIS MOVIE RIGHT NOW.",
            "review_date": "2015-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic drama.\n\nSet in Japan in the 16th century (or so), an elderly warlord retires,\nhanding over his empire to his three sons. However, he vastly\nunderestimates how the new-found power will corrupt them, or cause them\nto turn on each other...and him...\n\nDirected by famed Japanese director Akira Kurasawa (Seven Samurai,\nRashomon, Yojimbo), this is a grand, sweeping tale of family betrayal\nand lust for power. Based on Shakespeare's King Lear but even if you\nweren't familiar with that work, you can spot the Shakespearean aspects\n- the family feud, the Machiavellian power plays, the plots and\ncounter-plots, the tragic twists, often from seemingly arbitrary\nevents.\n\nNot perfect though. The story could have been tighter - there are a few\nsub-plots which don't really add anything to the story and just prolong\nit unnecessarily. Some plot developments aren't explained very well\neither. And I could have done without the irritating court jester (more\nlike court cynic) character...",
            "review_date": "2015-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "95%\nViewed this on 15/10/15\nKurasowa's respectable take on Shakespeare's King Lear is visually arresting with one of cinema's most effectively haunting combination of stunning cinematography and chilling score. With his extremely beautiful visuals, the director successfully creates a vision of hell in this beautiful but blood spilled Earth. One of the best anti-war films ever made, I believe this is the director's best film till date. Tatsuya Nakadai gives a fine performance as the great lord. Besides, for those who are sick of the lifeless CGI armies in recent Hollywood films and those who adore the fight scenes of films such as Troy can find Ran to be a successful diversion.",
            "review_date": "2015-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest fight sequence in the history of cinema.One of my top five favorite movies and  just another wonderful notch in a long glorious movie belt for Kurosawa.",
            "review_date": "2015-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A long, sometimes overly dramatic, samurai epic. It's really more about a dysfunctional family than Japanese war, as two brothers oust their father and the ostracized brother has to try to save the day. Still, some great battle scenes (thanks for the colours defining who's on which side!), plenty of violence, but overall, it's very depressing.",
            "review_date": "2015-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Kurosawa film that speaks no less of his undeniable mastery over both the samurai period film and over cinema in general. The usual perfection is there - the solid acting, excellent cinematography, strokes of meaningful colour, broad set pieces, and all the more heartfelt and pure emotion.",
            "review_date": "2015-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the top ten films ever made.",
            "review_date": "2015-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa's final masterpiece just might be his best, in a beautifully shot and compelling epic chronically the chaos of one's decent into madness that would make The Bard very proud.",
            "review_date": "2015-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, sweeping epic.  Pretty grim and bleak.  a little drawn out for my tastes though...",
            "review_date": "2015-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a mad world, only the mad are sane.",
            "review_date": "2015-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a modern viewer. Ran is like a Shakespeare novel with a dramatic proportion. A theater style of acting which gives an epic flavor to its motion picture. What's more epic is the authenticity on how the film was made. Hundreds of men gather with hundreds of horses and we have a epic proportion of epic battles. Started very slow but as much as you can follow the sequences, you are in for a treat. Akira Kurosawa's amazing piece of art as what what I can describe and yet this film is one of his greats. Superbly done choreography and the location and the sceneries are fantastic to watch. A must have DVD or Blu-Ray and definitely a must watch. An epic 5 stars out of 5.",
            "review_date": "2015-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic samurai epic that serves not only as a brilliant adaptation of 'King Lear' but also the last Kurosawa's final masterpiece.  The cast is excellent across the board, with Nakadai giving a brilliant performance as Lord Hidetora, who's descent into madness is from not just watching his kingdom fall apart but knowing it was his doing.  The other highlight is Mieko Harada as Lady Kaede, giving one of the great villain performances of film who's thirst for revenge knows no bonds.  Behind the camera, Kurosawa perfectly adapts the Bard's classic to feudal Japan, with beautiful details along with some epic battle, which show the brutality of war without glorifying it.  Overall, one of the finest films by the late master, which makes it by default one of the best films ever made.",
            "review_date": "2015-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Adapted from King Lear, Akira Kurosawa makes this tragedy more colorful and meaningful.",
            "review_date": "2015-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Japanese version of Shakespeare's King Lear. A great film! \n\nIn a mad world, only the mad are sane. \n\nHeaven is far away but hell can be reached in a day.",
            "review_date": "2015-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful and sublime. Truly a remarkable film. I was mesmerized from the start.",
            "review_date": "2015-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a beautiful battle scene in the middle of it and a cool death scene near the end. but other stuff... REVIEW NOT COMPLETE..",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A flawless retelling of Shakespeare King Lear",
            "review_date": "2015-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mr. Kurosawa is a master of merging the epic scale with the meticulous details, the majestic backdrops with the puny humans within it. With Ran, the result is a must-see for lovers of battle films, period films, or cinema as a whole.",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic film with some of the most greatest battle scenes, characters, and visual shots. It's a superb film adaptation of Shakespeare's King Lear.",
            "review_date": "2014-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just another reason Kurosawa continues to reign as my favorite director. So few people can make films this epic and this intimate. Plus it has one of the best uses of color in film history.",
            "review_date": "2014-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Live by the sword; die by the sword.",
            "review_date": "2014-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a modern viewer. Ran is like a Shakespeare novel with a dramatic proportion. A theater style of acting which gives an epic flavor to its motion picture. What's more epic is the authenticity on how the film was made. Hundreds of men gather with hundreds of horses and we have a epic proportion of epic battles. Started very slow but as much as you can follow the sequences, you are in for a treat. Akira Kurosawa's amazing piece of art as what what I can describe and yet this film is one of his greats. Superbly done choreography and the location and the sceneries are fantastic to watch. A must have DVD or Blu-Ray and definitely a must watch. An epic 5 stars out of 5.",
            "review_date": "2014-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know that Seven Samurai is considered the ultimate Kurosawa film, but this re-invention of King Lear is my favorite. Yoshiko Miyazaki steals the film with her icy performance. If only the whole thing were just a bit shorter. For me, the film runs about 30 minutes too long.",
            "review_date": "2014-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually outstanding, engaging in its storytelling and epic in every aspect you can think of,  Ran is top Kurosawa, therefore it is pure cinema.",
            "review_date": "2014-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The flaws are in the dialogue, which has to shoulder the burden of being adapted from Shakespeare; the shots of Kaede's Pollockesque death and the final reimagining of Gloucester's suicide are timeless. There are so many genres seamlessly interwoven in this movie that it stands as an everyman movie, or at least every man who can sit through 2 1/2 hours of people talking Japanese. If only Hidetora's death weren't such a crap scene â?¦",
            "review_date": "2014-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever made, based on King Lear's Shakespeare and made by the genius Kurosawa = a long masterpiece. YOU GOTTA LOVE IT!",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely not the best from Kurosawa. While beautifully produced and built, there are too many trivial characters and scenes. Some of the death scenes were abrupt and poorly executed.",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa's Ran is a brilliant, sweeping picture using plenty of themes for build an incredible story. Greed and revenge are the themes explored in the film, and Kurosawa always managed to get the most out of his film because he crafts films that really resonate with the viewer. Ran is such a film. Brilliantly shot, acted and directed, the film, not only boasts effective performances, but has stunning imagery, which adds so much to the film.  Fans of his work will definitely relish in the power that the film possesses. I much preferred Kurosawa's earlier work, but Ran is nonetheless a strong film that features all the trademarks that has made Kurosawa's work so good. With strong performances, and a simple, yet effective story, Ran is brilliant, poetic filmmaking that should be seen by any film buff. I really enjoy films that have simple ideas for storylines, and I find that the filmmaker is able to get much more depth out of an idea without overdoing anything, and the result is an impressive effort that ranks among the finest foreign films. Nonetheless, I still think that Seven Samurai was Akira Kurosawa's masterstroke of filmmaking. He has never topped it, but he always delivered thought provoking, epics that managed to be some of the finest films ever made. If you want a good action drama, then give this a viewing, it is a film going experience like no other, and it's one of the few foreign films that have stood the test of time. This is a film worth seeing, and it is enthralling experience from start to finish that will surely appeal to viewers looking for a film that has a simple idea, yet grand execution in style. That was what stood out for Akira Kuroswawa's work, his knack to create big, ambitious films while keeping everything to a bare minimum, as to not complicate things for the viewer and in the process, he created something quite remarkable in the cinematic medium.",
            "review_date": "2014-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The circle of violence and vengeance has to be completed and when the final shot is shown & the final question is asked this is what Ran so expressively does and on such a grand scale. The direction from Kurosawa is excellent once again with every shot being a little composition masterpiece. the film looks great with the production sparing no expense in the epic battle scenes. But more importantly, this is once again a Kurosawa character study done by way of Shakespeare, where loyalty & ambition clash in such a violent way it can only end one way. The story weaves, twists and turns only to come back to the source of the problem for Lord Hidetora, who endures the fate he has inflicted on others, with his family in shambles and his enemies triumphant. At the same time, the story does suffer from pacing issues and occasional forays into melodramatics and the acting is uneven at best. Recommended viewing, especially for fans of high drama and high stakes.",
            "review_date": "2014-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran, one of legendary director Akira Kurosawa's greatest films, re-imagines the story of Shakespeare's King Lear against the backdrop of war-torn Feudal Japan. The result is both a visually stunning period epic and a haunting, emotionally stirring tragedy, that serves as a cautionary tale on the destructive nature of ambition, greed, betrayal and revenge. Kurosawa successfully conveys human drama amidst the carnage and savagery, crafting a poignant moral parable that's successfully thought-provoking in spite of all the violence and brutality-or, perhaps, because of it.",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran (1985) - 9\n\nOnce again Akira Kurosawa adapts a Shakespeare tragedy, King Lear, to the Sengoku period of Japan. Just like \"Throne of Blood\", \"Ran\" easily engulfs me in a magical world of great enchantment, but this is a chaotic and cruel world. A world made of suffering where gods will not save Men from himself and where the thirst for power is the mirror of the natural struggle for survival, ethics and morality are subdued by the samurai conduct and interests of the powerful. Film of great symbolic significance, to watch \"Ran\" is like watching an epic and blazing Noh (form of Japanese classical theater) performance that reveals the true gist of human nature and existence. Tecnically superb work with countless memorable scenes, hauntingly beautiful soundtrack by Toru Takemitsu (whose work I highly appreciate), top-notch cinematography, camera work and acting, all in perfect harmony to create a deeply melancholic, beautiful and exciting universe. \"Ran\" is not without its shortcomings though. I may speak for a minority, but this would be a virtually perfect film in my eyes, if not for Kurosawa's maniac obsession with redundant battle scenes, especially in the last half hour or so (yet again, for what?!), some dragging moments ought to be chopped out with more insightful editing work to keep up with the standards of the rest of the film, enough is enough. And hard for me to believe that no life was lost during those crazy shoots. Fortunately, these distractions are relatively minor here, not as bad as in \"Kagemusha\", so it doesn't prevent \"Ran\" from becoming one of my favorite movies ever. The heartbreaking final scene also enters into my favorite list, perfect expression of how helpless we are in the world. Masterpiece from Kurosawa, highly recommended!",
            "review_date": "2014-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Ran\" is an epic, gorgeous film.  It boasts excellent settings and hues, especially during the battle scenes.  I need to see it again.",
            "review_date": "2014-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With its legendary photography and Tatsuya Nakadai's stagy performance, it is arguably one of the greatest epics.",
            "review_date": "2014-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impeccable film making from a certified genius in film making.....a little confusing at times, but I could not take my eyes off of it.......",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite Kurosawa. Visually arresting and intense.  Potentially my favourite interpretation of King Lear.\n\n\"Father... shall we roast the boar?\"\n\n\"He was old. His hide is though, it stinks. Indigestible. Like me, old Hidetora. Would you eat me?\"",
            "review_date": "2014-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerfully acted, excellently directed, and fairly entertaining. The costumes, production design, and battle scenes are all really well done.",
            "review_date": "2014-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This beloved film by master Akira Kurosawa may be my least favourite of his endeavours.  \nThe story, taken right out of shakespeare's King Lear, translates extremely well to a Japanese setting and delivers a tale that delights.\nThe costumes are absolutely beautiful. From the royalty to the soldiers and even the peasants, each is just stunning to look at and I can only wonder what they would be like to wear.\nWhere this film loses me is in the large scale fight sequences. Kurosawa has demonstrated in previous films that he has a good eye for action and framing of action but it seems as though much of that is lost in Ran. Whether the camera is too close not giving much information or far away and stationary, when combined with the editing in the film, you can only help but wonder... were these the only shots available for the film? Where are the matching tracking shots, etc.? While removing these large fight sequences would have eliminated these problems, it might have made the film stale and truly would have taken away from the epic scope of everything. Such are the decisions of the artist.\nI do have to wonder, is this the film Kurosawa wanted to make, or the one he ended up making despite it not being exactly how he envisioned it. Still despite the minor grievances, Ran still brings forth a powerful film and viewers who don't nitpic as much as I, will likely find no fault in this epic of tales.",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotional, colourful and tragic reimagining of King Lear, Akira Kurosawa's supposedly last epic is one of his greatest. With a great use of colour (especially red), direction as if it was gifted from the gods, and a believable performance from the main actor Tatsuya Nakadai - playing a character that has drifted apart from the world mentally, this film has to be a must see for fans of war films, period films, and even if you're a fan of AK's work.",
            "review_date": "2014-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fratricidal war shows us the natural tendency of men to destruction and violence in order to dispel their fears. A gorgeous photography and beautiful sets give rise to a succession of images that delight the eyes.",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacular Epic about ambition, betrayal, vengeance and war! Stunning visually both in beauty and graphic violence! \n\nFor those who would like to skip the 2 hour and 40 minute long film the moral of the story...\n\nBe wary of those lining up to kiss your ass they might be positioning themselves to stab you in the back!",
            "review_date": "2014-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exaggerated form of Throne of Blood? Don't know, but it's a nightmare. An epic tragedy from the Japanese master.",
            "review_date": "2014-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly haunting. A very long film but every minute has an obvious and welcome justification. Well worth the needed popcorn break -- should be shown with an intermission. The film is actually good enough to weigh on your heart afterward. You don't need to be familiar with King Lear to be floored by the story, the production, or the acting. Superb.",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nicely made but exceedingly long and rather boring film.",
            "review_date": "2014-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "King Lear on steroids, a solid look at loyalty, my favorite samurai film, and my favorite film of all time.",
            "review_date": "2014-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This masterful adaptation of Shakespear's \"King Lear\" sees the viewer witness the violent denouement of a blood soaked empire, and the result is a stunning and affecting samurai epic. Technically flawless, and featuring a magnificent Toru Takemitsu score, Ran is testament to Kurosawa's abilities and of one the greatest achievements in film.",
            "review_date": "2013-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is a film that Akira Kurosawa made late in his career, 1985 to be exact, but you'd never know the difference between it and his earlier work. It's a tour-de-force, the likes of which are never found on screens today, except in revival screenings. Kurosawa chose to re-envision Shakespeare's King Lear, but set it within feudal Japan. The story concerns Lord Hidetora, who being quite old decides to foolishly (but with the best intentions) divide up his lands amongst his three sons. He is betrayed by them as they turn their backs on him and go to war with each other over the territories and castles as Lord Hidetora slowly loses his mind. Beautifully photographed, well acted and entrenched with deep emotion, it's a major highlight in Kurosawa's illustrious film career. But then again, all of his films are major highlights.",
            "review_date": "2013-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran, director Akira Kurosawa's epic adaptation of William Shakespeare's King Lear, has the distinction of being one of the greatest and most powerful cinematic tragedies to ever grace the silver screen. Kurosawa had already demonstrated his ability to handle Shakespeare 30 years beforehand in his masterful version of Macbeth, Throne of Blood, but he had to wait until he was 75 to film Ran, a project he had long cherished. Criticized and neglected in his home country of Japan, old, lonely, near blind and suicidal, Kurosawa must have felt some sort of kingship with Lear and set out to bring Shakespeare's tale of greed, power and betrayal to ravishing cinematic life. He ended up making one of the supreme masterpieces of Japanese cinema; a bloody and nihilistic interpretation of Shakespeare's play that, although set in 16th century Japan, highlights the sorrowful state of the human condition in the Cold War era. Although Ran is without question the most devastating film ever about anything, with powerful performances and gorgeous photography, composition and art direction, it is endlessly watchable.\r\n\r\n[IMG]http://www.hollywoodchicago.com/sites/default/files/Ran1.jpg[/IMG]\r\n\r\nAging samurai warlord Hidetora Ichimonji announces his wish to divide his kingdom among his three sons: Taro, Jiro and Saburo. The eldest two welcome their father's decision with false pledges of love, while Saburo believes his decision is insane, as he thinks the brothers will fight for control of the kingdom and end up destroying it. Shocked, Hidetora banishes Saburo in a rage, but his son's prophecy soon proves correct as his kingdom and family are torn apart by war, revenge and an insatiable thirst for power, driving the old lord to the darkest depths of madness. It is a sad end to a powerful life. The most expensive Japanese film ever made at the time, Ran was a colossal undertaking by Kurosawa that he handled with the assurance and vigor of a master at the top of his game. The film received Academy Award nominations for Best Art Direction, Best Cinematography, Best Costume Design (which it won) and Best Direction, losing most to Sydney Pollack's Out of Africa. Only a modest success in 1985, Ran, with the passing of time, has come to be considered one of Kurosawa's finest works, both critically and popularly, and is perhaps the ultimate film adaptation of Shakespeare, arguably even surpassing the play it is based on.\r\n\r\n[IMG]http://media.web.britannica.com/eb-media/57/75057-004-BF0FF502.jpg[/IMG]\r\n\r\nKurosawa's worldview became progressively bleaker and bleaker over the years, as his career plummeted, friends and family passed away and the world found itself on the brink of nuclear apocalypse. The death, isolation and utter hopelessness in the human spirit that so haunted the legendary director were manifested in this masterwork, in which he poured all his rage, nihilism and sadness. The haunting final shot of Tsurumaru standing atop the ruins of his family castle perfectly summarizes Kurosawa's feelings on the human condition: blind, fragile, alone and on the edge of oblivion. Ran is a film that shows us the brutal and destructive consequences of violence and the betrayal of family, and the folly of war, power and greed. It shows us a world that is doomed to suffer endless cycles of violence and death, and not even the heroic, the upright, the virtuous or the innocent are spared. This film is a plea for peace that urges the viewer to transcend his primitive nature and love his brother, or else be damned to a meaningless existence and a painful death.\r\n\r\n[IMG]http://wird.com.ua/wp-content/uploads/2011/08/4e45ca36964d.jpg[/IMG]\r\n\r\nThe director's all encompassing cinematic vision constantly propels the film to new heights of cinematic power. This was Kurosawa's attempt to outdo himself, and he succeeds in all respects. Ran has a contemplative length, depth and grandeur that commands respect and demands our attention. He is never afraid to linger on a near motionless scene, and yet can encompass sweeping sequences of carefully choreographed action with equal panache. As expected, the epic massed battle scenes are superbly realized, and a silent massacre sequence set to Toru Takemitsu's music is one of cinema's most nightmarish. It is not surprising that Kurosawa storyboarded every single shot as paintings, as there is not a single shot that I couldn't hang up on my wall. The film is composed mostly in wide shots with no fast cutting and little camera movement, as if the film is from God's eye view as He looks sadly down on His children, who wage inexplicable war upon each other and think themselves all powerful. Kurosawa's use of the four elements is unrivaled, even by Tarkovsky, and the colors (predominantly red, blue and yellow) jump right off the screen. Truly a visual feast for the eyes!\r\n\r\n[IMG]http://i.discuss.com.hk/d/attachments/day_130714/20130714_f88110142c2d819405afqj31x3538Ons.jpg[/IMG]\r\n\r\nThe performances of Tatsuya Nakadai and Mieko Harada as Hidetora and Lady Kaede deserve special mention. As the old lord haunted by his violent past and in search of redemption, Nakadai gives what is arguably his best performance, while Harada gives exceptional power and conviction to one of the most memorable characters in film history. Translated into Chaos in English, Ran is Kurosawa's vision of a world on the brink of destruction, and a world that needs to change. It is a vision unparalleled in the history of cinema, and one that is still fully relevant. Ran is the triumphant final flourish of a master who overcame every obstacle and gave one last great gift to humanity, which of course failed to recognize it as the cinematic masterpiece that it was until years later. But a cinematic masterpiece it is, and certainly one of the most important ever made. Highly recommended!\r\n\r\nDirected by: Akira Kurosawa\r\nProduced by: Katsumi Furukawa\r\nSerge Silberman\r\nMasato Hara\r\nHisao Kurosawa\r\nWritten by: Akira Kurosawa\r\nHideo Oguni\r\nMasato Ide\r\nBased on: King Lear \r\nby William Shakespeare\r\nStarring: Tatsuya Nakadai\r\nAkira Terao\r\nJinpachi Nezu\r\nDaisuke Ryu\r\nMieko Harada\r\nYoshiko Miyazaki\r\nPeter\r\nMusic by: Toru Takemitsu\r\nCinematography: Asakazu Nakai\r\nTakao Saitō\r\nMasaharu Ueda\r\nEditing by: Akira Kurosawa\r\nStudio: Greenwich Film Productions\r\nHerald Ace\r\nNippon Herald Films\r\nDistributed by: Toho\r\nOrion Classics (USA)\r\nRelease dates: May 31, 1985 (Tokyo International Film Festival)\r\nJune 1, 1985 (Japan)\r\nRunning time: 160 minutes\r\nCountry: Japan\r\nFrance\r\nLanguage: Japanese\r\nBudget: US$12,000,000",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly epic and also humorous, although not sure the later is intentional.",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long but ultimately worth it. Kurosawa rocks!",
            "review_date": "2013-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa is more than a director to me, he is a painter, using a camera rather a brush. I can only admire his creations, yet not necessarily enjoy them. I do not mean that in a negative way, artists like him are rare and deserve the credit and awards that he received, it is purely a matter of taste in what one is looking for in a film.\nHigh notes -\nDr - Akira Kurosawa\nPhotography",
            "review_date": "2013-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Men suffer, kill each other, and the gods watch, indifferent.",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "29/30. It's so satisfying to finally watch a film about nothing.",
            "review_date": "2013-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movie of all times.",
            "review_date": "2013-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as epic Japanese interpretations of King Lear go, it's pretty good.",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most boring Japanese film I've ever seen. It's a period drama about a family fewd which goes on and on and doesn't seem to ever end. It is lauded as a must-see but I really don't know why, I was bored out of my skull.",
            "review_date": "2013-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best epics by one of the best filmmakers in cinema history! Good luck trying to shake this one once it's finished! Fucking masterpiece!",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Akira Kurosawa's best films .\n=)",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is Akira Kurosawas  true masterpiece, not The Seven Samurai. While that film was also more than excellent this is the true crowning achievement of his career. It has an excellent, plot, exquisitely written script, and manages to deliver a sense of spectacle without being over the top. Ran is a tale of power, war, and human cruelty. It may be too bleak for some people, but any fan of cinema should see this one.  This film can be seen as THE justification for why Kurosawa is seen as one of the most revered names in film history.",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tremendous epic reworking of King Lear samurai style",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The poster to the left of this review says A VISUAL MASTERWORK. Okay, I can buy that, in that the film looks very impressive. It was shot on location, the costumes look epic and you really feel like you are watching a story in that time frame. All the war stuff has great choreography.\n\nBut...\n\nThis movie bored me to tears. Until the final twenty minutes or so, the film is just talking and talking and talking. Or more like yelling. Not one person just talks in this film. They scream their lines like crazy.\n\nAnd not to sound awful, but nearly everyone looks a like in this film. It was hard to keep track of who was who, and what they were doing. There is little emotion in any characters, so you can't relate to anyone and in a movie like this, it should be important to feel for somebody.\n\nBesides yelling all their lines, the director clearly hates the idea of a CLOSE UP, so we always feel very distant from every character. When someone dies, we don't really care.\n\nI am a character person first, so the fact that I couldn't feel for any character, let alone tell them apart, really kept me disinterested in this film. Not to mention it took me THREE days to finally get through it. One of the most over praised films I have seen yet.",
            "review_date": "2013-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A feast for the eyes, the ears, & the soul. This epic is based on King Lear set in feudal Japan. The vibrance of this civil war is astounding. You have never experience Shakespeare until seen through the eye of Kurosawa.",
            "review_date": "2013-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serious pacing issues, but the battle scenes made it worth the while.",
            "review_date": "2013-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good acting, but that is about it. The action scenes are pretty intense even if there are only about two. The movie was a great big bore though. I tried to stay awake the whole time. It was too long.",
            "review_date": "2013-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know, when you watch even only a small handful of Akira Kurosawa films, it becomes incredibly difficult to pick which of his works is his best because he seemingly could do anything, no matter what it was and no matter what age he seemed to be. Ran is definitely one of his all-time greats, and it is quite an achievement not only because he made this film at the age of 75, but because it also pushes his greatness as a director to new heights even as time changed. Ran is easily one of the greatest film epics of all time, and I'll do my best to explain why this is so.\n\nWhen Lord Hidetora of the Ichimonji Clan's age begins to take a toll on him, he decides to step down from the throne and divide his castles among his three sons to rule over those particular territories. Taro gets First Castle and will become leader of the Ichimonji Clan, Jiro gets Second Castle, and Saburo will receive Third Castle, while Hidetora will retain his title, but remain mostly in the background of his sons' rule.\n\nWhen Lord Hidetora presents a lesson based on three arrows that can't be broken when together, his son, Saburo takes the arrows and breaks them, stating that the lesson means nothing and that such an alliance can be broken, and also stating that the sons will probably not remain loyal. After all, Hidetora himself used brutal methods to conquer his territories, and his sons have a high probability of following in his footsteps to gain sole control of the territories.\n\nUpon hearing this brutal honesty from Saburo and having suspicions of him, Hidetora banishes him, along with a servant named Tango who stands up for Saburo. Taro and Jiro still have their castles, which Hidetora remains in control of Third Castle.\n\nShortly after his decrees, Taro and his wife, Lady Kaede (Whose family used to rule over First Castle, but were savagely murdered by Hidetora and wants revenge) begin to plot to take control of the territories and take away Hidetora's title as Great Lord. Enraged by his son's offer, Hidetora leaves his castle and travels to Jiro's only to discover that Jiro is just fine with Taro's plan and has similar desires.\n\nHidetora leaves that castle as well and decides to take refuge at Third Castle, only to have it be attacked by forces from both Taro and Jiro who attempt to kill him and his forces. Hidetora escapes death, but is left to descend into madness in the wilderness as he is forced to live with bad decisions and misdeeds come back to haunt him.\n\nIn the midst of the battle, Taro is killed, leaving Jiro vying for control over the Ichimonji Clan and its territories, while also striking up an affair with Taro's scheming wife, Lady Kaede who uses him as a pawn for her own schemes through her seduction and beauty.\n\nNow, an all-out war threatens to tear apart his entire clan, and he is left with to go insane with only a few devotees in the wilderness to keep him company in his personal hell.\n\nThe story is a grand and magnificent tragedy with a deep story and rich characters. There are many layers contained within the plot and every bit of it is engaging and riveting to follow as the characters descend into their inevitable tragedies. There's betrayal, madness, seduction, murder, war, compassion, and many other themes to be found in the tremendous storyline that will give the viewer a lot to think about and process.\n\nThe acting for such a grand epic is stellar, especially Tatsuya Nakadai as Hidetora. Though I've only seen two other films of his where he had a major role (Harakiri, Kagemusha), once again he delivers a great performance like he did in those previous two films I've seen. However, the actors playing the three sons are also magnificent in their roles, as well as Mieko Harada as the manipulative and seductive Lady Kaede. This time, it wasn't just one actor who dominated, there were so many great performances that you can't help but admire.\n\nRan is a glorious epic filled with virtually everything anyone could ever want from a grand, epic tragedy. It's a riveting and deep film that will make its 160-minute running time feel like nothing because there is so much that it has to offer. If you love film epics, Ran is not something to miss.",
            "review_date": "2013-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shakespeare and Kurosawa just belong together.",
            "review_date": "2013-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic film. Expected this from the great Kurosawa. Visually stunning, brutal and at the same time reflects the cruelty of life.",
            "review_date": "2013-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is like the best kurosawa's movie ever! not a single flaw can be found! a superb performance from tatsuya nakadai AS USUAL! who could ever forget the ending and the scenes where the castle burnt to the ground??",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa takes on King Lear (changing the three daughters to three samurai sons) and has Tatsuya Nakadai slowly go mad with crazy white hair and beard while his fool (Peter) speaks and sings the truth (i.e. he screwed up) as the audience's surrogate.  I saw this (my second time) on a really huge screen in 1991 in Surabaya, Indonesia, in Japanese with Bahasa Indonesian subtitles, and the majestic images of blue, yellow, and red armies with banners waving in the wind have never left me.  Now watching it on blu-ray (but with only a 32\" screen), setpieces, such as the brutal battle which leaves the castle in flames, are still pretty amazing.  True, its epic length could be a bit wearying and the plot operates well on a grand scale and not so sensitively on a smaller interpersonal scale.  But these are quibbles and this is a fine elegiac last triumph for AK.",
            "review_date": "2013-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one epic film that would definitely entertain you. It's classic Shakespeare in an Eastern setting. If you like war movies, Ran is definitely for you.",
            "review_date": "2013-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sense of passing on is firmly established in the opening moments of Akira Kurosawa's Ran; a prominent theme throughout the film as well as the situation the distinguished director had found himself in at the time. With this forethought, Kurosawa went out and created a definite 'Epic' in the truest sense of the word-wide sweeping shots of rural Japan, extras that range in the thousands, impressive sets to be the backdrop of battle-film's like this are rare to find. Luckily, the director made the wise decision to place Shakespeare's King Lear as the groundwork of the story, presenting a paranoid lust for power and the struggle of passing on.",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest shakespearian adaptation of all time, & the best of Akira Kurosawa's career, .........",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is a really good Japanese adaptation of William Shakespeare's King Lear, replacing Dark Ages of Britain with the Sengoku period of Japan. Any fan of Shakespeare's works will find this a very good reinterpretation of the bard's great play King Lear.",
            "review_date": "2013-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa doesn't make his movies easy to follow. It works in the 50s, but in the 80s, it doesn't.",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At 75 years old, Kurosawa delivers this epic and breathtaking cinematic spectacle of disgrace and tragedy falling upon mortal men, a grandiose production with overwhelming war scenes and spellbinding visuals - even if also a bit long and repetitious in its second half.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The last thing I'd ever expect Kurosawa to do is outdo \"Seven Samurai,\" but he comes damn near close here.",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa's version of Shakespeare's King Lear play is called RAN... and it is an epic-tragic Masterwork!! This is Genius filmmaking at its best! I am just excited, ormaybe I am just overreacting. For it's tragic/emotional themes, I know I am going to like it even more in the future; rigth now.. \nRAN has to be one of my favorite films of all time. It is an Oustanding Achievement in Kurosawa's filmography and one of his best Films. This is a Majestic film in every-single aspect. This is what you call a real TRAGEDY! Epic.  RAN is a MASTERPIECE.",
            "review_date": "2013-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A long film at just under 2 hours 45 minutes and one that is enjoyable in most parts. A solid film which is consistent and doesn't show many obvious cracks. It follows ancient rule in the lands of Japan and the power struggle between 3 sons who have been given varying degrees of control. In the struggle of overall dominance, all 3 succumb to their fate.",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "He'd make more movies after this, but RAN is the grand finale to Kurosawa's career, classical and modern in one fell swoop. The story is unapologetically pessimistic (KING LEAR, remember, was always a dark, disillusioned tale of a man realizing his existence has come to naught), and it bears the weight of Kurosawa's years. The nihilism spreads everywhere, seeping into everyone's bones (living and dead) by the time the film closes. But the existence of RAN itself, with its epic sweep, dazzling color, and fierce emotional power, can fight it - this is a film for the ages.",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too dark and depressing for my tastes. Also, not a very interesting plot. It was Shakespeare's dialogue that made King Lear great. Maybe it's the same with the Japanese version, but not speaking Japanese it just isn't very good.",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I confess I'm not big into Shakespeare. As such, I haven't rightly seen King Lear, the play this film is based on. If Lear himself is anything like Hidetora Ichimonji, I can't rightly call it a tragedy. Sure the situation itself is tragic, but Ichimonji's war crimes coming back to haunt him and make him pay is more... karmatic than anything else. That said, Ran is a well-executed epic drama, and I will definitely watch it again.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a wonderfully huge epic which will leave you breathless and exhausted, yet completely fulfilled.",
            "review_date": "2012-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this on the back of a question at the European Quiz Championships. It's a great film - though not Kurosawa's best. In the same league as Kagemusha",
            "review_date": "2012-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing visuals.  this is the new school kurosawa at his best, although i have stronger leanings towards his earlier intimate work.",
            "review_date": "2012-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The swirl of human lives is always a beautiful disaster...",
            "review_date": "2012-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa's \"Ran\" is entrenched in glorious colors, haunting visuals and brilliantly realized battle sequences, but underneath all of its glamour and gore, there isn't a whole lot there. While it can be immensely entertaining, it can also be pretty dull, but luckily, the moments of dullness are far and few between. For the most part, this visually striking epic is technically superb and easy to watch, and it's hard to doubt the genius in Kurosawa's direction.",
            "review_date": "2012-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another grand epic from kurosawa, everything here is epic, the sets, the landscape, the music, cinematography, the scope of the story, it's quite an achievement, also the story is classic shakespeare fashion-lots of conspiring and power playing to get power and control, all very well done, deserves all the praise it gets",
            "review_date": "2012-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film defines the word epic in every way. characters, story, soundtrack, omg soundtrack! ambition, cinematography (best I've seen), editing I'm pretty sure I can go on but if you're not watching it right now you probably never will, and what a shame that will be.",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa deserved an Oscar for Direction. He was nominated in this category. Injustice!",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic storytelling from the Japanese master. Kurosawa again delivers a visually arresting picture with a story that is obviously quite Shakespeareian but I found it a little on the long side, dragging a bit in the middle.",
            "review_date": "2012-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film, but sometimes its stillness calls too much attention to itself. The slow pacing is unusual given Akira Kurosawas previous works. Some great scenes.",
            "review_date": "2012-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is pure film magic. Akira Kurosawa is a virtuoso unlike any other!",
            "review_date": "2012-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this Movie!  it's just stunning to look at!",
            "review_date": "2012-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just saw it! It was great!!",
            "review_date": "2012-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily akin to similarly masterful films like Ben Hur and Spartacus, Ran is both a heavily compelling drama and strikingly entertaining war story. Tatsuya Nakadai's haunting portrayal of Lord Hidetora is just one of many hallmark performances, all framed within the broad-stroke genius of Akira Kurosawa. Colorful and majestic, yet dark and brutal; one of the all-time greats.",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seeing as it is a film in a different language, it is hard to judge the acting correctly. I can tell you, though, that this movie inspired some of the greatest film efforts of all time, including Kill Bill (and, actually, Quentin Tarantino's entire career). This puts the 'Epic' in Epic Movie.",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"It's not a great film and in some respects it's not even good...\"\nAward winning movie Ran was over played, It struggled to wrap things up. I should give credit where it's due Ran placed Japanese films into Hollywoods mainstream and inspired other films like 'House of flying Dragons'.\nSadly it was depressing and too Dark for my liking.",
            "review_date": "2012-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "EPIC and just plain beautiful to watch!! I love Akira Kurosawa!!",
            "review_date": "2012-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a depiction of King Lear from Akira Kurosawa. Great production values, varied characters, a dash of conspiracy and tragedy. I thought it was an average movie only. It's about an aging warlord giving up his throne for the oldest son and how it's consequences affect his other 2 sons. It also teaches a lesson to the father about external appearances and how they don't matter. I would say OK, but not great. The Jester deserves a special mention for the philosophical babble.",
            "review_date": "2012-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are no words to describe how you feel the moment this film ends. It ranks along with Apocalypse Now, Lawrence of Arabia, The Godfather: Part II and 2001: A Space Odyssey  as one of the top 5 greatest films ever made, in my humble opinion.",
            "review_date": "2012-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What to say, nothing to say just an absolute Masterpiece, beyond epic",
            "review_date": "2012-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A spectacular retelling of King Lear, through the lens of the astonishing director Akira Kurosawa.  If you are a Lear fan (and if you aren't, deport yourself to another plane of existence, posthaste), Kurosawa fan (see previous) or a fan of film, then this needs to be on your to-see list.",
            "review_date": "2012-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WHAT. A. FILM.\n\nKurosawa only reached my folks by the Western spinoffs of Seven Samurai, Rashomon and Yojimbo. But boy, I wish they could get past the \"foreign\" aspect, because this movie is of unnatural quality. The take on King Lear is brilliant, and ultimately builds on it (Lady Kaede, based on a Japanese legend I believe, is what I speak of - she is played sublimely). The actors are nothing short of brilliant, without exception. The art direction, cinematography, and costume design earned the film Oscar nominations, winning one, but worthy of all three - and more. The film score is distinctive and stunning as well.\n\nI was debating with my brother about which was better - Ran or Seven Samurai. We both felt they were equal in the end. But if anyone is cynical about the 25-year period between Ran's release and Kurosawa's other epochal movies, I have a John Steinbeck analogy: If Seven Samurai is the Grapes Of Wrath, then Ran is East Of Eden. That's a compliment.",
            "review_date": "2012-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to admit, the first time I tried to watch this I didn't get it and ended up not watching very much of it.  Luckily I decided to give it another chance while in an \"artsier\" mood.  A VERY deep movie--with no flash, just substance.",
            "review_date": "2012-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was just another prodigal son story. I was wrong. Epic movie is epic!",
            "review_date": "2012-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an epic battle. This film is so good. Kurosawa is the master of Japanese film.",
            "review_date": "2012-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very close remake of Shakespeare's King Lear, it is done very well for Japanese cinema.",
            "review_date": "2012-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I am more of a fan of earlier Kurosawa, Ran is fantastic as an epic piece full of colour and action that genre busts to such great effect.",
            "review_date": "2012-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched before 7/5/2012",
            "review_date": "2012-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "???? ????? ???. ?? ????? ?????? ??? ???? ???? ???. one of my top 5",
            "review_date": "2012-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was never completely on board with this one --- maybe because of the bland action scenes (as good as Kurosawa is, he doesn't know how to shoot scenes with, well, shooting in them), or maybe its just because of the annoying-as-hell transvestite fool. On the other hand, this film deals expertly in many heavy-handed themes, such as familial loyalty, betrayal, loss, and revenge. Furthermore, 'Ran' has excellent costume design, for which it won an Oscar, that really help to bring the film to life. Then there is the castle-siege scenes, which are absolutely fantastic despite the unrealistic firearms. Even if this is one of Kurosawa's least impressive epics, it's still required viewing for film fans everywhere.",
            "review_date": "2012-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is what happens when artistic vision meets ingenious storytelling. Almost every scene could be a masterwork painting. The film starts fairly slow but the drama builds to an extreme point as we witness the characters take their true forms. Highly rewarding for the patient viewer.",
            "review_date": "2012-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was cheery!.......loved the way it was made though..... Kurosawa is a stickler indeed. \n\nThere were interesting things to note here about it...one bit sounded like a bit in Full Metal Jacket...another bit reminded me of Apocalypse Now...and the main star had a crazy look like Klaus Kinski.",
            "review_date": "2012-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cinematography is incredible; it's full of bright colors and beautiful landscapes. And for a film made almost 30 years ago, it still looks fresh and the story remains powerful.",
            "review_date": "2012-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has been said before, but I would like to reiterate: if Shakespeare made films chances are they would look like Ran. Kurosawa proves that he could still direct films well into his eighties and still obilterate the competition.",
            "review_date": "2012-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a drag it is getting old.",
            "review_date": "2012-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10PM on a work night probably isn't the ideal time to have a Kurosawa urge... but my impulse was too strong and so I watched Ran. It's always been a magnificent film but watching it on bluray was incredible. The format lends itself to Kurosawa's epic story beautifully. The cinematography and use of widescreen is breathtaking and the film has never looked so good. If you've never seen it, it's a Japanese retelling of Shakespeare's King Lear. Combined with Japanese lore the film tells of a ruler gone mad who abdicates his position to his eldest son and divides his land amongst all 3 sons. When one of them rejects the offer believing his father's whim to be out of insanity, he is banished. As the father sinks deeper into madness a power struggle begins between the other two brothers. It's a richly textured film, both visually and thematically. When it needs to be violent the blood is let brutally and when it needs to be tender the emotions are worn on it's sleeve. Many consider this to be Kurosawa's masterpeice and it definitely is amongst his best, but I personally think his next film, Dreams, was his best and most personal. Nevertheless as he was nearing the end of his career (and life), Ran still feels like a personal film. It is very much a statement about the nature of man and I can't help but feel that Kurosawa was disheartened by this. It is even spoken in the film that man seems more content being at war with each other that it wishes for peace. Ran is an epic film made all the more powerful on bluray.",
            "review_date": "2012-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is why Kurosawa is one of cinema's greats.",
            "review_date": "2012-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best war movies ever made.",
            "review_date": "2012-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To an untrained and uncultured mind some parts may be hard to follow, but in total Ran is a masterpiece created by one of Asian cinema's most respected warlords of directing, Akira Kurosawa, heavy in acting, producible in action, and very quiet and spacious, allowing us to take in the period its set, and also admire the beauty of a time ravished by conflict.",
            "review_date": "2012-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa, King Lear, and lots of bright red blood.  What's not to love?",
            "review_date": "2012-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa's films are poetry, meditations on the nature of familial bonds and such concepts as loyalty, power, honor, and corruption.  \"Ran\" is a gauntlet for such considerations.  A fitting accomplishment to cap off a long career.",
            "review_date": "2012-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A colorful and unique rendition of Shakespeare, Ran features all the epic sets and vibrant storytelling found in classic films. Ran magnificently captures the culture of Medieval Japan, with the actors all fully immersed in their roles. Tatsuya's performanace at the end is a bit outrageous, but this is easily overlooked in the graceful presentation of the movie.",
            "review_date": "2012-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, what a movie. I love Japan, it's culture and Japanese. This is a great movie from Japan's best directors Kurosawa. I also love the fact it's an historical movie.",
            "review_date": "2012-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably Kurosawa's most epic film (which of course is saying a lot). Not only does Ran have some of the most stunning battle sequences in Asian cinema, but it's themes of war, nihilism and family make it a great philosophical work as well. The work of Shakespeare (it's a bit of an adaptation of King Lear) probably hasn't looked this good on the big screen since.",
            "review_date": "2012-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Kurosawa's best",
            "review_date": "2012-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is probably one of the most epic movies I've ever seen. Reworking the plot of Shakepeare's King Lear, Ran follows an aging 16th century warlord and his attempt to transfer the sovereignty of his kingdom to his three sons. Naturally, moving the setting to Japan doesn't make the results any less treacherous than how things were under the Bard's pen. Director Akira Kurosawa shoots every frame of this fiery and bloody period piece with the care that he's famous for. The result is a family tragedy that is one of the director's final masterpieces.",
            "review_date": "2012-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa directed Ran with the same insatiable bloodlust comparable to that of Lord Hidertora's raging sons.",
            "review_date": "2012-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant and very thought provoking! Akira Kurosawa is a master of artistic film. The movie is rich in symbolism and epic in nature.",
            "review_date": "2012-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Men prefer sorrow over joy, suffering over peace.\"\nSimply put: When an aging father gives various portions of his empire to his sons, let's just say things don't go exactly as planned. Kurosawa's brilliant epic is a powerful look at the insatiable lust for power that lurks in the hearts of men. How congeniality can turn to savagery at the slightest hint of gain. \nAlso, and what I think is his most effective message of the film: We as a people lie, cheat, steal, and in some instances murder, yet expect the world to be fair to us in return. \nLike all Kurosawa films, he loves using nature to reflect what is happening in the story. As the family bonds being to fray, he often cuts to ominous clouds descending upon the castle. When the father realizes that he is no longer welcome in his kingdom, we get a close up of the sun and the sweat beading on his brow. These are just classic Kurosawa staples that are done beautifully here. While I was expecting this focus on nature, I was not however prepared for how graphic the film would be.\nThere are extended gory battle sequences that frankly were very shocking to me. I have nothing against violence, I just haven't seen Kurosawa tackle it with such intensity. Although it is arresting, it is very fitting to the film as Kurosawa shows that these aren't men engaged in acts of valor, this is wanton violence brought on by greed. The music that plays over it isn't triumphant, it is of something lost. At the tender age of 75, you would think he wouldn't want to dabble in such brutality. But I guess 75 is as good as age as any to show some good old-fashion double suicides. \nWhile there is a lot to chew on, I think that if Kurosawa wants you to walk away with one message, it is to never give up power, especially to your rotten kids.",
            "review_date": "2012-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie I have seen recently, dark, intense, philosophical, good story and good visual.",
            "review_date": "2012-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa's interpretation of Shakespeare's King Lear through the prism of Imperial Japan, is one of the great masterpieces of world cinema...",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For its time , fabulous with some fot eh best orchestrated battle scenes ever. The mix of shakespeare's King Lear, Noh Drama and modern film make for interesting concotion with some solid acting performances. I just wish they hadn't dubbed it and left it in Japanese with subtitles. I can't help but think Monkey Magic, when I see Asian films that are dubbed. Slow to start, Ran eventually picks up and finishes with a bang.",
            "review_date": "2012-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Drawn out and exaggerated",
            "review_date": "2012-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The parts were greater than the whole. By this, I mean that there were specific scenes that I thoroughly enjoyed, and/or just marveled at, especially the battle scenes, and the beginning. However, there were long stretches of time that I found myself rather bored with.",
            "review_date": "2012-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb inspiration of King Lear at the hands of a true filmmaking genius. Akira Kurosawa, you deserve a bow. Tragic epic told with as less cheesiness as possible.",
            "review_date": "2012-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the many masterpieces of the brilliant Akira Kurosawa.",
            "review_date": "2012-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "five stars just for the scenery",
            "review_date": "2012-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a few scenes some of the performances go a little too far over the top for my taste. But that is the only complaint i could even think of for yet another Kurosawa masterpiece. The cinematography, costumes, battles scenes, writing and overall direction are perfect. Ran gives you plenty of memorable characters but i thought Mieko Harada as Lady Kaede was the show stopper. Find a way to see this as soon as you can.",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strikingly beautiful. Outrageously melodramatic. This isn't my favorite Kurosawa, but being less of a Masterpiece than, say, \"Seven Samurai\" still makes it more of a Masterpiece than most directors could hope to achieve. And remember; none of those soldiers, horses, clouds, arrows, flames, or sprays of blood are CGI.",
            "review_date": "2011-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa adapts King Lear into a Japanese feudal era piece flawlessly. The Cinematography, and scale of the production design alone solidify the film as a cinematic landmark. Ran will mesmerize it's audience not only as an epic war film, but also as a ironic and engrossing morality play.",
            "review_date": "2011-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is three of my least favorite genres - war, western, epic - at their most laborious. It's a garish looking movie, resembling DeMille as much as Kurosawa visually. Lady Kaede was the most interesting character and almost saved the film for me a few times, but alas, it was too little too late. Slow and tedious.",
            "review_date": "2011-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific adaptation of King Lear. Of course it is not a faithful adaptation of Shakespeare's play,  it is more of a film inspired by it. Nonetheless, the very essence of Shakespeare's play is captured by Kurosawa's visually stunning epic about an old ruler's haste and foolish decision which his entire family pays the price for. Tatsuya Nakadai gives a masterful performance as a once fierce and now shell-shocked old emperor. He is surrounded by a terrific cast. Kurosawa's vision however must ultimately be applauded for managing to show us just how gruesome the Bard's tale is; through the gore and violence, which make Tarantino's films look PG, teaching us the same lessons about war which Shakespeare wanted to teach us. Striking and breathtaking film, the length of Kurosawa's late masterpiece is of no importance because it is so engrossing. Cannot wait to revisit this film in bluray and see Kurosawa's bold colors again.",
            "review_date": "2011-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Shakespeare adaptations ever!!",
            "review_date": "2011-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tad overlong, but Akira Kurosawa never lost his touch bringing the audience beautiful and stylish visuals... even near the end of his life where he was losing his eyesight. Kurosawa's samurai epic (loosely based on Shakespeare's King Lear) is a feast for the eyes and those who love Japanese lore and an interesting take on one of the most prolific tragedies ever written.",
            "review_date": "2011-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is #4 on my all-time list and just saw a 4k Digital restoration of it in theatres, what an experience.  Such a masterful film, but seeing it on the big screen with an enthusiastic audience was truly special.  If you've never seen it, then run, don't walk, to check it out!",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skillfull re-envisioning of King Lear.",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic of Japanese cinema. If you haven't watched it, do yourself a favor.",
            "review_date": "2011-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Apparently this is another great film from the director of Yojimbo, Seven Samurai, and Rashomon, but i think i slept through half of it.   It's King Lear in Japan, with sons instead of Daughters.  Kind of trippy and weird.  But what I did see was good.",
            "review_date": "2011-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The last movie worth watching from the master.",
            "review_date": "2011-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Kurosawa's last masterpieces. A visual magnum opus.",
            "review_date": "2011-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic epic from every level. Cinematography, music score, costume design, clever performaces, and the battle scenes. The director's re-done ideas of King Lear is as great as you expect. Slow-paced, picking up after the first hour, and then came the heartbreaking ending.",
            "review_date": "2011-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SPOILERS\r\n\r\nAkira Kurosawa's final epic, Ran, takes on William Shakespeare's King Lear. To me, from head to toe, this Kurosawa's picture which symbolizes downfall is absolute stunning - such gorgeousness in a film is utterly rare, and of course, it is one of the Kurosawa's many best films. Ran is a success - having nominated for Academy Awards for best art direction, best cinematography, best costume design and best direction and won one. Ran was also nominated for a Golden Globe for Best Foreign Language Film.\r\n\r\nI repeat this - Ran, from head to toe, is absolutely stunning, and of course this movie is perfect. The film's cinematography, which is top notch, is a killer. The way Kurosawa captured the images of burning castle, a moving horses, dead soldiers, battle scenes are all undeniably respectable, and sublime too, and one great example would be the scenes where the attack of the third castle  was occurring. Very much in evidence that Kurosawa's talent in film-making is transcending. The film's script which was being written by Kurosawa himself, Hideo Oguni and Masato Ide is yet admirable. The exploitation on poetic lines are proven to be effective and fitting for the movie.\r\n\r\nOne would see great performances in Ran. Good acting by the players, but to me, the two actors who stood up above the rest are Tatsuya Nakadai and Mieko Harada. Tatsuya Nakadai plays the great lord Tatsuya Nakadai. The great lord is old, fragile and somewhat defenseless and the character is well characterized by him. Mieko Harada plays a female villain Lady Kaede, whose character is hungry for revenge. Her amazing performance which is raw and gripping, plays a very important part for the success of the movie.\r\n\r\nSurely there are several movie elements which are worthy to be carried out for discussions, but to me, the main highlight of Ran is its cinematography, and it is one hell of a show.\r\n\r\n[10/10]",
            "review_date": "2011-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hated this long f***ing film. had to watch it in class and by the end i felt like i had just lost hours of my life that i will never get back. almost every character was annoying... i just laughed for the last few minutes wondering how anyone could spend ten years making a shakespeare play like king lear even more hard to get through. two thumbs wayyy down",
            "review_date": "2011-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my favorite Kurosawa film and possibly his best. Though it borrows part of it's story, mostly in the set-up, from King Lear it takes the message and underlying meaning of King Lear much more so. One of Kurosawa's bleakest films by far, it's nihilism and unflinching questioning as to the nature of man and god is what ultimately makes it a masterpiece. As always Kurosawa deals heavily in imagery and the final shot in particular really embodies the film's message.",
            "review_date": "2011-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most epic films I've ever scene. This may currently be my favorite film!",
            "review_date": "2011-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific film.  Possibly Kurosawa's finest film.",
            "review_date": "2011-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece, to be sure. Why, the photography, the timing... Battle scenes the \"Lord of the Rings\" should envy. Great theatrical acting; not too hard on the senses like your average Japanese spectacle.\nIn a few words, a film thrilling, touching, epic. A serious consideration if you're planning on watching one of cinema's finest.",
            "review_date": "2011-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is film that everyone needs to see. It brings home the horrors of war, betrayal, and greed. When the kingdom is divided among the sons in this version of King Lear, we just know that the person who bares himself honestly is going to become an outsider. The acting is sensational, with masterful personal encounters. Kurosawa even managed to keep the fool as an integral part of the story. Others have eloquently dissected this movie. What I have to offer is that there is such a poetry to the visual aspects of this film. While the battle scenes are among the goriest and grizzliest that have ever been put on celluloid, there is a dance here, a wave of the most intense coming and going as we watch the soldiers fall. It tells how potentially good men can be influenced by the forces of evil. The wife of the first son is purely vengeful, and horrifying. She is nearly a carbon copy of the woman who played the wife of Mifune's Macbeth character in \"Throne of Blood.\" I have been reviewing the Kurosawa canon and am convinced that this may be his finest work.",
            "review_date": "2011-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a work of art.",
            "review_date": "2011-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"It is a film that already belongs to the ages.\" Richard Schickel",
            "review_date": "2011-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has some of the best acting in japanese film i've ever seen. Its great i love the beginning when the father gets pissed off at his youngest son",
            "review_date": "2011-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is a masterpiece, with beautiful imagery, every frame looks like a perfect single picture, painted by an artist at the top of his game. Kurosawa surely knew how to film battles, but even in the dramatic scenes he makes dazzling images, but visual apart, he tells a great story with great performances from his cast, that sometimes must look weird to ocidental audiences, even though they're wonderful, specially Tatsuya Nakadai as Hirdetora in a ghostly performance as a man who loses everything including his sanity. Ran is not a film for movie scholars only, but to everyone who loves movies and likes to see a work from a great director, and Kurosawa was among the greatest.",
            "review_date": "2011-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is basically a retelling of Shakespeare's King Lear. It works as a samurai film on many levels and with very few substantive changes. The locations/sets are spectacular, the costuming is glorious, and the acting superb.",
            "review_date": "2011-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"For aficionados of the war movie, the western, and the period action epic, Ran is necessary viewing.\" Amy Taublin",
            "review_date": "2011-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty boring.  Just YouTube the main battle scene for full entertainment",
            "review_date": "2011-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching an old evil lose its head and find redemption and meaning in the most unlikely of sources, what a watch this is.",
            "review_date": "2011-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of Kurosawa's masterpieces that I find to be just plain bad.  I'd rather watch Joe Dirt.",
            "review_date": "2011-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is going to ruin my whole day... but it was excellent",
            "review_date": "2011-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's nothing I have to say that hasn't been said by the consensus.",
            "review_date": "2011-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most depressing movies I've ever seen.  After watching The White Ribbon, I wouldn't be surprised if this is one of Michael Haneke's personal favorites.  The style surrounding every scene with Lord Ichimonji is incredibly long, slow, and burning to the teeth.  If Kurosawa's main intention with this movie was to honestly show Ichimonji's demise of the mind, he's succeeded in a way that can only be seen to prove it.  What this means to the viewer is that you will feel completely worn out and like shit when it's over.  It is as honest a depiction of a man going mad over the destruction of his kingdom and family as you'll ever see.  The only question is whether you're up to experiencing it.",
            "review_date": "2011-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far the best film of Asian cinema! Being new to Akira Kurosawa, i'd love to see more of his films!",
            "review_date": "2011-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa's interpretation of Shakespeare's King Lear through the prism of Imperial Japan, is one of the great masterpieces of world cinema...",
            "review_date": "2011-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I came to this without having seen any of Kurosawa's films (Seven Samurai and Rashomon most significantly so) and was surprised by many elements. I didn't expect this film to be so theatrical, even down to the make-up which seemed more theatrical than usual for naturalistic cinema. I do wonder if maybe Kurosawa in his later period was delicate to Japanese criticisms that he was too \"western\" in his technique, and wanted to give it more of a Japanese feel; or perhaps he was deliberately paying tribute to the theatrical origin of the story. Even so, this is certainly a great movie, epic in range and with a huge emotional impact. \r\n\r\n\"Ran\" is basically an updating of Shakespeare's King Lear; the film sees the elderly Lord Hidetora Ichimonji deciding to hand over the reins of power to his three sons. His eldest, Taro, becomes the new Lord, while his younger sons Jiro and Saburo are each granted a province of their own to rule over. Saburo however protests, believing it to be a foolish decision that will split the clan and Hidetora banishes his third son. It isn't long however until Taro and Jiro's ambitions of power lead them to betray their father and the nation begins to fall apart, spurred on by Taro's manipulating wife lady Kaede.\r\n\r\nKurosawa thus blends Shakespearean tragedy with a sweeping historical epic about the loss and gain of power. At the center of it all is a remarkable acting presence in the shape of Tatsuya Nakadai as the displaced elderly Samurai. At the beginning of the film he is a man of stubborn pride, but as his world crumbles and his people die, he soon finds himself with nowhere else to go. The emotional turbulence of being betrayed by his own flesh and blood drives him to his limits, but nevertheless he still refuses to contact Saburo because his warrior principles will not allow him. There seems to be a definite element of Kurosawa himself up there on screen, the director having been near the end of his career with his health failing and his wife having tragically passed away during shooting. Hidetora isn't a perfect ruler but as evidence of his cruelty and oppression during his reign mount up, he remains a sympathetic character, questioning his past decisions and what exactly it is he has achieved in his lifetime. He is the pillar that holds the film together and no mistake. He is aided by some impressive performances all round. Daisuke Ryo's impetuous, outspoken but loyal Saburo is a highpoint of course even if his screen time is limited, spending the majority of the storyline in exile. Jinpachi Nezu's Jiro is another remarkable presence, equally proud and stubborn as his father but beset by insecurities and mistrust. Mieko Harada's Lady Kaede is the film's most hated rouge; her performance is spot on as Kaede is a cold, calculating woman with vengeance on her mind at the best of times, during one pivotal scene towards the middle, she explodes with one dramatic emotional outburst to another, ranting, screaming and licking blood from a knife wound.\r\n\r\nThe battle scene that forms the centerpiece is absolutely breathtaking, with legions of Samurai warriors storming a castle in total silence. There are no sound effects, no speech, just the sad musical overture for the majority of the fighting, until a particularly important gunshot rings out and we are plunged right into the maelstrom. Bodies are filled with arrows, blood drips everywhere and hundreds of warriors are slaughtered in spectacular fashion. It may be a glorious sight to behold, but it is the closest thing a historical epic has got to show that war is hell, no matter what period of human history it is set in. The more blood thirsty among us may then be disappointed by the second clash towards the end, a far more unremarkable skirmish that promised to be incredible after several scenes of armies maneuvering in anticipation.\r\n\r\nThe greatness of Ran doesn't end at its visuals though. There is a fantastic narrative within these vivid and colorful vistas. It is a very slow paced film that dwells on certain scenes for a very long time, yet never overbearingly long. The story itself is fairly complex, as would be expected from such a grand scheme of a picture, yet as long as you stay with it, it is an incredible story with a great deal of subtext and underlying themes that serve to give it an even greater purpose as a revolutionary film. With any epic film like this you'd expect it to cover a lot of proverbial and existential ground and it certainly does. We see everything from the themes of close family bonds and loyalties, to the traumatic effects of war on the human mind and soul. Ran is a dramatic tragedy of lost innocence and peace. It is a harrowing look at the destruction of family and kingdom. Yet, despite these bleak themes, it still manages to be a stunningly beautiful film. This beauty serves to drive home the emotional impact of the film, engraving some very gripping images into your mind.\r\n\r\nIn the end, Ran is an artistic masterpiece of such beauty and grandeur, that it can put one in an immense state of awe and wonder. It may seem theatrical at times, but like a watercolor painting that moves, it is beautiful to watch time and time again. \r\n\r\nStory: B+\r\nActing: B+\r\nDirection: B\r\nVisuals: A\r\nOverall: B\r\n\r\n*** out of 4 stars",
            "review_date": "2011-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most beautifully filmed films, ever.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How do I review a Japanese adaptation of Shakespeare's King Lear in feudal Japan? I have enough trouble reviewing Shakespeare adaptations in general!\nOddly, I will begin by saying the DVD was useless. Despite it being set with subtitles on, and even selecting it anyway, the film did not start with them on! The only option I had was to start from the second scene available, only then did the subtitles worked!\nRan follows a Great Lord Hidetora, who is eventually banished from his lands after giving over power to his arguing three sons. As the three factions wage war upon each other, and even amongst their own ranks, the Lord is slowly driven mad as his kingdom collapses.\nAkira Kurosawa directed the classic Seven Samurai, which I enjoyed a great deal, and this epic does host similarities and a few memorable performances. However, I felt several characters crucial to the story had been pushed aside initially, only to return in the final acts jarringly, while others had received too much screen time for little more than metaphorical effects.\nAn epic, without question, with great set pieces and battles, yet a little meandering with its characters.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa's take on Shakespeare's King Lear - brilliant, like all of Kurosawa's work.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran - 9/10\r\n\r\nAn old, frail War Lord decides it's time for him to hand over his power to his three sons. The younger son reacts with anger and brutal honesty, telling him to rethink his decision whilst the the elder two are more than happy to accept. The elder two soon turn against the Lord and each other, each vying for full control of the land. \r\n\r\nAnother masterpiece from Kurosawa, while I didn't enjoy it as much as another one of his Shakespearian adaptations, Thrown of Blood, it's still up there with his best films. Another stunning film, it's a sharp contrast to his earlier black and white films with stark, gritty cinematography. Ran is shot in colour with lots of bright reds, yellows and blue's to help give the film a unique, artistic look, more of an achievement when you consider that Kurosawa was almost completely blind when he directed it. Tatsuya Nakadai was electrifying as the tragic Great Lord with a layered performance packed with emotion. Just an epic film, can not recommend it enough.",
            "review_date": "2011-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both grand and intimate. This movie is a colorful, emotional epic that ranks up there with Seven Samurai.",
            "review_date": "2011-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa combines stories of feudal Japan with the story of King Lear.  Not my favorite Kurosawa movie, but his last great epic.  The movie is full of great imagery and awesome scenery and unlike many of his early samurai movies, full of color.  The movie drags however full of weighty dialogue, and the fighting scenes aren't up to the level of something like the Seven Samuria (but the story also doesn't lend itself to big fights like some of his other movies).  Still definately worth seeing.",
            "review_date": "2011-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akira Kurosawa is unable to make a bad movie. Yet another classic film from this famed Japanese director. Te cinematography is amazing, as are the performances. The scenes of war are traumatizing and powerful, and it truly is an epic story that sweeps you up in it's story. Oh how the mighty fall.",
            "review_date": "2011-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "epic film I loved the colors",
            "review_date": "2011-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So I LOVE Kurosawa, but I really didn't see the appeal for this, let alone why people often put it in his top 3 films. I'm not familiar with King Lear at all (which this is based on), so perhaps that is a reason for it, but a great film should be able to reach even the audiences who haven't read the source material, and this just didn't do much for me. Nakadai is good (lots of the performances are way over the top, however, but you come to expect this from Japanese films), but everything else is lacking; the camera shots and action scenes are so stolid that I keep feeling like we were watching one of those fake reenactment battles some people do for hobbies - the setting literally just looked like they'd picked the nearest field (the 'castles' and such that they used were great, however). Costume design, etc. is great, but you can't call a film good just for that. The whole film focuses on shaming this old Lord and his horrible, power-grabbing sons. There's little to no story development and structure - certainly not worthy of what I have seen in other Kurosawa films anyway. It's a real shame for me that I didn't like this. I'm going to read King Lear, then watch this again, and see if my opinion changes.",
            "review_date": "2011-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa's greatest achievement...a pure masterpiece",
            "review_date": "2011-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somebody get me a pair of scissors. I'm gonna cut this movie down to not-ridiculous lengths... and make it better by doing so.",
            "review_date": "2011-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just couldn't get into this one and Hidetora just came across as hilarious rather than tragic and insane. Oh well, there's always The Magnifi, err I mean Seven Samuari.",
            "review_date": "2011-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazingly well made epic.",
            "review_date": "2011-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "many cite the fact that hitchcock never won an oscar as the biggest hiccup the academy has ever made.\n\nWRONG.\n\nthe biggest fuck-up the academy ever made was not awarding akira kurosawa an oscar. in fact, they nominated him for best director ONCE. for this film. at least hitchcock got himself nominated five times. sure, kurosawa is NOT AMERICAN, so i guess that rules him into the 'best foreign film' category, but still. there's a reason he was called 'the master'.\n\nran is a setpiece of staggering beauty and craftmanship. it's one of the last true EPICS. in order to create armies in this century we use excessive cgi, it's faster, it's easier to put together and most importantly for the fat cats; it's cheaper. there is still a certain beauty to choreographed battles with a lack of fast cuts giving you some bizarre form of r.e.m. slow, played out, tension building battles with real extras in meticulously crafted costumes lends a real creedence to a film, especially one that is set in a land before cgi.\n\nran is the daddy of these. and as i said, one of the last true epic motion pictures. a 'remake' (for want of better words) of shakespeare's king lear. and one of the final films of kurosawa. he was basically blind by the time the film was finished and his ten years of storyboarding helped his assistants shoot it exactly how he wanted. it's his masterpiece, although it is not my favourite kurosawa film; that honour belongs to seven samurai. i feel that kurosawa was hungrier for film in his early years, his youth giving life to the screen and capturing an effoverscent, almost animalistic style of film making, whilst never taking his eye off the centre of the storm.\n\nran transports king lear to fuedal japan, and lends it a more mystic feel, which sits well with themes of god and buddha. the japanese use a method of acting called 'noh' which is present in ran. a very truncated, over the top, pronounced form of acting more akin to that found in theatres. exagerration is key. shouting and floor beating are rife. like a slipknot show. it's a difficult transation from hollywood blockbusters to a film like this but i think it's wholly important to remember that although films are a form of entertainment, there is a place for it as an artform too. there is beauty in what can be shown and being ENTERTAINED by a film does not always have to be the most important part. there are other factors such as cinematography, acting, make-up, costumes, choreography and story. to like one does not mean an overall arching love of the film. it's important to step back and look at a film by using your knowledge of culture too; japan (especially during the fuedal period) expresses a culture far removed from that of the one we are accustomed to, but that is not a reason to dislike this film. film is a way for us to escape our own and appreciate the beauty in the world (and/or other imaginary lands).\n\nwith all that being said, ran is incredible. it truly is epic in scale, theatrical in its expression and not without an important study of human emotion and volition.\n\nhighly recommended.",
            "review_date": "2011-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never did I think an adaptation of a Shakespeare play could be made into a Japanese epic. Only Kurosawa!!! I'm pretty sure he got MUCHO criticism for this one...",
            "review_date": "2011-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Besides the court jester, everything about this movie is great.",
            "review_date": "2011-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "King Lear remake or Akira Kurosawa biopic? Maybe both, and either way, it's the most entertaining, engrossing, and engaging Shakespeare that I've ever seen, and a completely believeable allegory for a life of mistakes regretted.\r\n\r\nThe story of King Lear is well known: an ageing king divides his kingdom between two fawning daughters and excommunicates the third who dares to tell the truth. In time, he lives to regret his decision, discovering during a descent into madness that, to paraphrase Junius, the subject who is truly loyal to the chief magistrate does not flatter.\r\n\r\nAs a piece of cinema, it's hard to fault Ran. Although the near-3 hour running time seems daunting, the telling of the story rarely drags. Where Shakespeare sometimes loses you in a barrage of Dukes and Earls of various bits of England and navel-gazing soliloquies, Kurosawa's streamlined Lear keeps us focussed on the matter at hand and the key players. The addition of the viscerally evil Kaede (or is she?), while sure to disappoint Lear purists, adds complexity beyond pure greed as motivation for the villains. The scenery and visuals are stunning, from the castles (ruined or not), to the Japanese mountain-scape, to the desert. The score is well judged, never intrusive and never sounding a wrong note.\r\n\r\nThe acting too is faultless. The minor characters are rich and complex, struggling with their decisions, balancing loyalty and honour, greed and lust; never one-dimensional, never purely detestable nor loveable. And Hidetora (Lear) himself is a simply stunningly brilliant portrayal of madness - madness that comes from realizing that his own miserable fate is entirely of his own making. To err is human; to realize that your error has cost you everything you love is the road to madness, and the portrayal here is entirely convincing.\r\n\r\nSo is it Lear? Not in any conventional sense. But stripped of the arcane language, transposed to a different place, and with subtle tweaks to motivation and morality, this is the most accessible Lear I've ever experienced; I truly felt that I understood the point of the play after I saw Ran in a way that a straight reading or literalist film adaptation won't achieve. And is it a biopic? If so, perhaps we can understand the tortured soul of Kurosawa a little better through this, surely his masterwork.",
            "review_date": "2011-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa's version of Shakespeare's King Lear play is called RAN... and it is an epic-tragic Masterwork!! This is Genius filmmaking at its best! I am just excited, ormaybe I am just overreacting. For it's tragic/emotional themes, I know I am going to like it even more in the future; rigth now.. \nRAN has to be one of my favorite films of all time. It is an Oustanding Achievement in Kurosawa's filmography and one of his best Films. This is a Majestic film in every-single aspect. This is what you call a real TRAGEDY! Epic.  RAN is a MASTERPIECE.",
            "review_date": "2011-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Kurosawa I saw so far! No character is shallow and most of them could have a movie on their own.",
            "review_date": "2011-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never really liked Shakespeare tragedies, but with Kurosava and his Ran it was something different. This is, probably, one of the most visually arresting and dramatic films I've ever seen. The camera work is perfect as well as the settings and imagery. Ran is the triumph of color and light manipulations. Performance by the actors? I always had problems with the Japanese actors acting skills assessment.",
            "review_date": "2011-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "potentially the most stunningly brilliant movie ever made.",
            "review_date": "2011-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a masterful and almost perfect visualision and dramatisation of a story that anyone has ever commited to a film reel, in my opinion. The depiction of war is perfectly composed and eeriely envisioned, almost celestially. Every scene is so theatrical that it sometimes feels you are looking at an outdoor stage. It epitomises the intensely stringent character of the Japanese and their complex feudal history. Kurosawa: undoubtedly in my eyes, the master of cinema.",
            "review_date": "2011-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most compelling movies i've ever seen. Excellent in every possible way.",
            "review_date": "2011-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took me 26 years to watch it, to my shame.  Kurosawa's epic masterpiece - based on King Lear - is a monument in its own right.  A stylishly designed, dark-hearted lesson in the tragical realism that the human condition so often descends into.",
            "review_date": "2011-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: 3.9/5. Amazing film by Akira Kurosawa! Terrific cinematography, and very beautiful costumes. The battle scenes are incredible. Tatsuya Nakadai is WOW! Brilliant storytelling by Kurosawa. One of the greatest films of all time!",
            "review_date": "2011-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Four for four for Akira Kurosawa: \"Ran\" is another one of the master's great works. The film follows a family of samurais who vye for being their father's favourite, and unfortunately, the consequences are bloody, brutal, fiery, and highly disturbing. Wars galore in this film. The three previous films I have seen under Japanese master's direction were all from the 1950's, the latest being the masterpiece \"The Seven Samurai.\" Kurosawa is not afraid to show bloodshed here in abosolutely excessive matters, perhaps as much as Sam Peckinpah's \"The Wild Bunch.\" He is also not afraid of taking colour to his advantage, exposing the gorgeous set pieces and scenery within this feature film. \"Ran\" is another great work under Akira Kurosawa.\r\n\r\nOne other note I would like to make is the father in the film. He is allegidly controlled by spirits and although, perhaps there is more to it than that. I believe, because of his age, he may have gone totally senial, sparking utter insanity. He does act really crazy in the film and he passes the effects of his weak mentality onto his sons and the kingdom, resulting in disaster. Kurosawa does a fine job showing the father's craziness, as well as casting actors in terrific performances.",
            "review_date": "2011-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Project 1 (Epic Films)\r\n\r\nDirected by Akira Kurosawa and staring Tatsuya Nakadai, Mieko Harada, Jinpachi Nezu and Daisuke Ryû.\r\n\r\n\r\nThe centre forge of such Isolation and Power is the main part of this epic. Do I love Akira films??? Yes I do and I have watched them over and over, this movie about the struggle of power and of course Kurosawa is very crone to Shakespeare that's how he made this movie all on his work but a more of our Japanese style to it. I remember when I first watched this and that was like years ago I didn't really like the film back then but today, this is one of my favourite epics ever. \r\n\r\nI read somewhere that Akira Kurosawa painted everything before he under took the movie and he get the idea from Lucio Fulci from his masterpiece The Beyond. The way Fucli painted the powerful images of hell and then took them to the screen with the films ending climax with the two Americans in an atheist vision of hell. As well as the croned haunted hell house. I just admire Kurosawa's visions of this epic with the burning of the 3rd castle that was just amazing.\r\n\r\nA story of greed, a lust for power, and ultimate revenge. The Great Lord Hidetora Ichimonji has decided to step aside to make room for the younger blood of his three sons, Taro, Jiro, and Saburo, the Lord's only wish now being to live out his years as an honored guest in the castle of each of his sons in turn. While the older two sons flatter their father, the youngest son attempts to warn him of the folly of expecting the three sons to remain united; enraged at the younger son's attempt to point out the danger, the father banishes him. True to the younger son's warning, however, the oldest Son soon conspires with the second son to strip The Great Lord of everything, even his title. \r\n\r\nI admire the films themes of \r\n\r\nWarfare: Saburo's assassination by a sniper also shows how individual heroes can be easily disposed of on a modern battlefield. Kurosawa also illustrates this new warfare with his camera. Instead of focusing on the warring armies, he frequently sets the focal plane beyond the action, so that in the film they appear as abstract entities.\r\n\r\nChaos: The ultimate example of chaos is the absence of gods. When Hidetora sees Lady Sue, a devout Buddhist and the most religious character in the film, he tells her, Buddha is gone from this miserable world. Sue, despite her belief in love and forgiveness, eventually has her head cut off. When Kyoami claims that the gods either do not exist or are the cause of human suffering, Tango responds, the gods can't save us from ourselves.\r\n\r\nAnd of course there are powerful themes of Power, Greed and Nihilism.\r\n\r\nEven though it may not appear so it is based on the struggle of King Lear, well not entirely directed towards or near it I see the similarities or the two stories and how it was based on it. I read the book once upon a time and it was just beautiful to know were he got inspiration besides overusing Shakespeare. (Not in a bad way at all).\r\n\r\nThe acting style is very strange and controversial. It's rather more body language and the way people reflect on there situation. It's mainly influenced by Noh theatre, it also more body language as I have sated and the distraction of silences that goes into that scene. Not just focusing on the scenery and what is happening to this struggle. Noh aspects of these two characters emphasize their ruthless, passionate, and single minded natures.\r\n\r\nI really liked the way with the camera instead of the simple one camera stands there and...Take done. No he uses more of the old technique and advances more on Long shots to catch the beauty of that scene and what is in view of it, such as the people and the building as well as catching there responses to that action. As well as the arrow hitting the man and the peoples reaction to the perpetrator doing so.\r\n\r\nI really liked the costume designs they took more then two years to make all of them by hand and for every lead and every extra and done so with such creative talent it's not just the leads that get the best it's all of them. I really liked the aspect of course with all the detail put into it, It's not today you see these sort of things anymore. So overall it was worthy of its Oscar for best costume design and I can think of a million other categories it should have won. \r\n\r\nThe sets are just breathing again Akira spent years painting everything to his likening and everything had to be right down to every detail. The burning of the 3rd castle was just incredible no miniatures no computer generated imagery...No. Everything was burned to the ground in the order that it should and every actor or extra needed to know what they were doing. And its not just sets its scenery I remember the scene with the filed of gold they just went for miles and she was walking throw it like nothing because she was no greedy man.\r\n\r\nI think by the end every man, women, child needs to view this epic masterpiece.\r\n\r\nKeiko's score 100%",
            "review_date": "2011-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No comment is enough for Akira Kurosawa's greatness ! The Japanese version of Shakespeare's \" King Lear\", and what a great one !",
            "review_date": "2011-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw Ran again recently. It is a strange stylized movie: although it may seem a minor matter, I found it hard not to be put off by Lord Hidetora's makeup. The movie itself is huge in its scope and bleak vision. It is not simply a remake of Lear although it clearly owes a lot to Shakespeare. I thought the best scene was the seduction of Jiro (second son) by Lady Kaede, the recent widow of Taro (first son). The scene owes more to Richard III than Lear but with the twist that it is the woman doing the forced seduction. I was reminded of Richard's famous speech:\r\n    Was ever woman in this humour woo'd?\r\n    Was ever woman in this humour won?\r\nThe movie grinds on to its inevitable tragic end. There are wonderful, if slightly overblown, scenes of samurai warfare. I was somewhat puzzled by the use of firearms but research showed that by the time of Mori Motonari (the most likely model for Lord Hidetora) firearms would have been recently introduced to Japan.\r\n\r\nIt is an easy movie to respect. A hard movie to love. It has none of the endearing self deprecating humour of Seven Samurai. But it is a film great.",
            "review_date": "2011-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome acting, I especially liked Tatsuya Nakadai's performance.\nThe costumes were beautiful, each enhancing every scene's composition.\nAnd the kabuki-like movements of the actors in general. \nExcept for a camera movement that disturbed me a bit, I liked everything in this movie.\nAlthough being long, it kept my attention till the end. And the starting slow pace was plainly justified by the plot.\nI have to add though that i haven't read King Lear, nor had I ever seen any other Kurosawa movie, so this opinion may change soon.",
            "review_date": "2011-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lush, sweeping historical saga.  Among the best ever made on such a scale.  Kurosawa's genius is on display.",
            "review_date": "2011-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic Kurosawa adaptation of Shakespeare. not to be missed.",
            "review_date": "2011-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "King Lear with Samurais...",
            "review_date": "2011-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An outstanding achievement, an inmense spectacle and a great proof of great filmmaking and story-telling. 162 minutes of great dialogues, amazing and deep characters, wonderful images and everything orchestrated by the hands of Akira Kurosawa. Barely the second film I watch of his (the other being Seven Samurai), and though quite different from each other, and similar in other aspects, both are incredible epic films, admirable in every cinematic aspect. An entertaining experience, and definitely it must be up there among the biggest and best epic movies ever made.",
            "review_date": "2011-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An outstanding achievement, an inmense spectacle and a great proof of great filmmaking and story-telling. 162 minutes of great dialogues, amazing and deep characters, wonderful images and everything orchestrated by the hands of Akira Kurosawa. Barely the second film I watch of his (the other being Seven Samurai), and though quite different from each other, and similar in other aspects, both are incredible epic films, admirable in every cinematic aspect. An entertaining experience, and definitely it must be up there among the biggest and best epic movies ever made.",
            "review_date": "2011-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The massive scale, amount of planning, direction, and coordination that went into this film makes epics like Lord of the Rings look fat and lazy.",
            "review_date": "2010-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Only the birds and the beasts live in solitude.\"",
            "review_date": "2010-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa's ostentatious Shakespearean masterpiece wields vibrant colors, a visceral musical score, extravagant set pieces, and overwhelming epic battles. Despite that, it seemed Kurosawa butchered Shakespeare's play. 98/100",
            "review_date": "2010-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing short of an epic and one of Kurosawa's last great work and nothing short of it. I liked just about everything and thats what makes it amazing.",
            "review_date": "2010-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is absolutely beautiful. Interestingly there are so many horrible actions transpiring amid the beauty. There's pride, murder, revenge, slaughter, deception...but it all looks so pretty. I'm not completely sure if Kurosawa intended for this irony or not. One would assume he did. Throne of Blood is dark and menacing as is Peter Brook's  version of King Lear. Kurosawa's Lear seems so fragile as he shuttles between the conquests he's just bequeathed to his sons. The grandeur of the scenery and costumes doesn't mask his vulnerability. Similarly, Mieko Harada's performance as the vengeful princess is stunning because of the rage that erupts out of her flower-like appearance. Ran delivers a few powerful emotional moments despite its epic proportion.",
            "review_date": "2010-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "again I got a VHS copy of this before but now where can I find a copy?",
            "review_date": "2010-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very long and just beautiful. no words can describe this large scale epic. this is Kurosawa's last great work.",
            "review_date": "2010-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "epic - total chaos reigns - why are the gods so cruel as to squash us like worms? no - the gods can not even save us from ourselves!",
            "review_date": "2010-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sprawling, ambitious, and beautifully shot, Akira Kurosawa's Ran is a marvelous film that showcases Kurosawa's skill for complementing narrative with visuals. The last shot of the film is incredible.",
            "review_date": "2010-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ten years ago, I gave it 3 stars and wrote: \"it's nice and all, but i was too tired, so I fell asleep in the middle of the movie.i will watch it again at some point, to see the whole thing through.\"\nI am older now, and apparently less sleepy. More appreciative of classic cinema and of Kurosawa's style. This is masterful cinema. Majestic. Faultless cinematography, skilful storytelling, great acting, and splendid directing. Thank you, Kurosawa...! (May 17, 2020)",
            "review_date": "2010-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bleak, but in a way that engages the transcendent questions of life. Ran keeps the depravity of human beings (we prefer sorrow to joy) clearly in its sight, leaving only the occasional character to rise above the striving for selfish gain and give their lives in the service of someone else. Ran is Kurosawa's most striking color film. He makes disciplined use of the camera, cutting only when necessary, and sparing use of music, all in an effort to place the madness of humanity front and center.",
            "review_date": "2010-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa's last grand epic, based on Shakespeare's \"King Lear\" about an elderly ruler in feudal Japan who endures a power struggle between his heirs. A beautifully realized production by Kurosawa, still, not for the impatient as it is very slow-going until the tension starts to rise between the characters. From there, it becomes a grandiose, color-splashed war epic that doesn't flinch away from graphic violence. Kurosawa may not be my cup of tea, but I don't deny that he's a poet of cinema.",
            "review_date": "2010-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film has the best girl power scene of any film.",
            "review_date": "2010-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great trajedy and a perfect take on Shakespeare's King Lear...It offers the audience one of the most depressing, brutal and deep experiences possible with its bleak and tragic look on life and the betrayal of a king's sons as well as the chaos of life...arguably one of the greatest drama films and is one of my favorite Japanese films of all times...",
            "review_date": "2010-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let me start by saying that I did enjoy this film. It was as epic as it gets and looked awesome. The costumes and setting were amazing. The acting was pretty good. And the story was very dark, depressing and compelling.\r\n\r\nPerhaps too a bit too depressing though. It was definitely better than Kagemusha, which is so far the worst kurosawa film I have seen. Both starred Nakadai, who is perhaps my favorite Japanese actor. But in Kagemusha, Nakadai had humor to give his character redeeming qualities. Here he has nothing but maniacal redemption, resentment and a desire for absolution. And all of these come after he is punished for his greed. I do have a slight problem with the battle scenes, I had wished they were more...battle-y but they weren't bad. The blood and gore worked well and came out as shocking. \r\n\r\nRan did perhaps contain one of the most well deserved and bloody beheadings in film history though. I don't want to heap praise onto this film just because the consensus is to do so. I think I prefer kurosawa in black and white and he has made quite a few movies better than this one. Still it is better than most film, just not his best.",
            "review_date": "2010-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kenneth Branaugh eat your heart out. Now THIS is how you adapt Shakespeare",
            "review_date": "2010-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the finest films ever made.",
            "review_date": "2010-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. This movie is truly an epic.\r\n\r\nto state very quickly, the movie is about the tragic crumbling of a Japanese war Lord's kingdom as things continuely get worse and desperate not only for him but also for his sons' as well.\r\n\r\nHAUNTING is what specifically describes this movie. it is laid out through the whole movie.\r\n\r\nThere are certain scenes that are extremely picturesque and beautiful that it left me flabbergasted to watch. Kurosawa's direction was amazing and i began to understand that he was using all of his filming experience to his best abilities to make this film come to life, especially the execution and timing of certain scenes.\r\n\r\nThe Japanese acting style is in the film in which each emotion is expressed through not only facial expressions but the body as well. Theater performance can be closely related to the acting just like what was displayed in \"Seven Samurai\". Yet, both styles of acting where very well blended just like in Seven Samurai.\r\n\r\nThe drama was extremely tense for almost every scene in this movie. If you like to watch movies that are upeat, happy, and can make your day, stay away from this movie. LOL. \r\n\r\nOverall, the film is a hauntingly beautiful epic with drama that is fever pitch throughout. This truly is one of Kurosawa's Epic Masterpieces.",
            "review_date": "2010-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For Kurosawa to turn in such a stunning achievement while in his 80s and struggling to find funding and a market in his own country is quite a feat.  Kurosawa made plenty of pictures with personality, but none moreso than Ran.",
            "review_date": "2010-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An obviously masterful achievement with stunning cinematography. It is obvious that every scene right down to single frames in the film were choreographed to perfection by the director. The length of the film was just uncalled for but there are certain set pieces that I will remember for a lifetime. I think that the fact the film was based on a western masterpiece may have let it down slightly rather than raise it to the heights it could have achieved with a Japanese story. In saying that Meiko Harada creates one of the best bitches in cinema history....even if she was justified.",
            "review_date": "2010-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A breathtaking work of art, this is Akira Kurosawa's mournful take on Shakespeare's \"King Lear\". Filled with electrifying performances, particularly by the females playing his daughters, this is an exquisitely rendered work. The cinematography and design are genuinely awe-inspiring. (Japan has a very rich history for this sort of thing, it seems.) Being \"King Lear\", \"Ran\" is a very bleak film, and mirrors Kurosawa's own feelings at the end of his life, but - provided you're not on a ledge already - it's beautiful in its lugubriousness.",
            "review_date": "2010-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fitting \"end\" to a great director's career that is a classic in of its self.",
            "review_date": "2010-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well. This movie scares the fuck out of me. As if Shakespeare's \"King Lear\" wasn't brutal enough, the world famous Akira Kurosawa, a man known for making depressing and violent movies has tackled this tragedy.\r\n\r\nRan, based on King Lear, is about an aged warlord who passes on his land and rule to his sons. But his youngest son rejects his offer because of his belief that his father's violent and bloody past has affected the minds and fates of his family. And how right he is. From then on the story is all about greed, trechory, murder, and the father's descent into madness. Though there are many changes and the story is more simplified compared to King Lear, it does not hurt the movie at all. Kurosawa's vision of King Lear in an Ancient Japan setting gives the story a new respectable look. This movie not only hightens the feelings and lessons of King Lear, but Kurosawa's also focuses on a \"godlessness\" theme which becomes incredably horrifying. \r\n\r\nAkira Kurosawa is one of, if not, the greatest film director of all time. And he gives it his all in this movie. With a greater budget than his other films, everything in this movie is perfect. Unbelievable costumes details, fantastic makeup, chilling music score, and not to mention the movie's achitecture and sets, one tower which was built just for the purpose of burning it down. That's commitment. All combined with Kurosawa's years of filmmeking knowledge to make this movie an epic like no other. And not to mention the wonderful and haunting preformances, especially from the ones who played the scary Lord Hidetora and the femme fetal Lady Kaede.\r\n\r\nKurosawa's inspiration knows no bounds for he is the one who created modern cinema. With his representation of the world in his films, he not only opened new bounds in storytelling to touch, but new ways to show them. Though Ran is one of his latest, it is still just as impressive as any other of his films and a must see for movie buffs.",
            "review_date": "2010-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an quite an epic from Akira Kurosawa. 'Ran' benefits from having a very strong script and some beautiful imagery but it also provides us with insights on life and aging.",
            "review_date": "2010-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good film. It looks very rich, colourful, even elegant. An epic, 16th century, Japanese feudal warlords-at-war film. Almost no CGI effects. There are abt 250 horses & 1500 soldiers/cavalry actors employed. There is a DVD commentary that adds alot to the understanding & appreciation of this film. This story is strong and held my interest thru-out. It is loosely based upon the play, KING LEAR. Lots of battle action & palace intrigue.\r\n\r\nIt struck me especially, as a strong commentary on the futility of war/killing.\r\n\r\nThere is an unusual amount of dust. Whenever men or horses are running, even when they arent; there are great clouds of dust billowing about. Maybe some mood evoking treatment.\r\n\r\nAlso, it is an olde cliche, that male Asian actors, will kind of rapidly, grunt & shout when they say their lines. A peculiar trait of Asian, Kung-fu, chop-socky movies. We have that style of dialogue here. Olde World War II movies also have this characteristic. \r\n\r\nWe have the age-old story-line of the devious, untrustworthy, scheming female; using sex to get what she wants. Most males can relate to that.\r\n\r\nIf you like old-fashioned, swords, archery, & cavalry epics; dont miss this movie.",
            "review_date": "2010-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran proves that even near the end of his life, Akira Kurosawa will always be one of the greatest directors who ever lived.",
            "review_date": "2010-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the all time greatest movies.  Taking the plot to Shakespeare's King Lear, and putting it in a Japanese feudal setting was good enough, but they really went above and beyond with this movie.  All of the actors put in a very passionate performance.  The settings are oftentimes beautiful and there's just so many great things about this movie, I probably couldn't fit them into a FB post.  A must-see movie.  Find a copy and WATCH IT!!",
            "review_date": "2010-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "in a mad world, only the mad are sane.\r\n\r\nAkira Kurosawa adapts Shakespeare's King Lear, and despite changing many aspects, stays faithful to the play in which it is based.\r\n\r\nOne wouldn't think it if he were to look at some screenshots of this film, but this is one of the darkest works (thematically) ever produced; even though there is a comical character in the film, he is present only to comment and drive home the despair and madness, he is not in the film to make you laugh. Leave it to director Kurosawa to completely leave out comic relief even though the opportunity presents itself, but thats one reason i adore him so much.\r\n\r\nWhile i do not like the set and art designs as much as i do in his previous film, Kagemusha, Kurosawa takes more advantage of them, using them in ways that help tell the narrative. The colors of the costume and sets along with the natural landscapes make for an absolute scenic treat.\r\n\r\nRan, is perhaps my favorite Kurosawa film, thats saying alot considering how much i adore The Seven Samurai and Throne of Blood. If you haven't seen it, then may the cruel gods look down on you in pity.",
            "review_date": "2010-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The thing with Akira Kurosawa's films is to me he's flawless. This is scientific proof of that considering he was over 70 when he made this tale of karma. Lord Hidertora Ichimonji is ruthless, cold, and sadistic. Watch it yourself. Take my word.",
            "review_date": "2010-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true masterpiece directed by Akira Kurosawa, now I have to see more of his films apart from the Seven Samurai & Throne Of Blood, which are also excellent!!!\r\n\r\nNot only its a film with amazing fight scenes, but what is even more interesting its how the story progresses, the intense dialogues & the stunning performances!!!\r\n\r\nJust watch it, if you haven't already ;)",
            "review_date": "2010-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story is probably the only thing that I like with a little meat ... and this one delivers.",
            "review_date": "2010-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So fuckin cool. Excellent cinematography, excellent story.",
            "review_date": "2010-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "in a mad world, only the mad are sane!",
            "review_date": "2010-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of Kurosawa's films, this was the second that I watched.  The first was Ikiru, which is so full of warmth and humanity, particularly in the final vindication of the central character Watanabe.  Ran, however, is filmed from the viewpoint of a pitiless, omnipresent deity, and all the possible miseries of life seem to play out across the screen.  The performances, particularly Nakadai's decimated Lord Ichimonji and Meiko Harada's ominous, spidery Lady Kaede, are beyond criticism, and the photography is likely the most sumptuous I have ever seen (approached, in my mind, only by Kubrick's Barry Lyndon).  This is a haunting, indescribably beautiful masterpiece.",
            "review_date": "2010-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before I say the terrible thing that I am about to say, I would like to give this movie as much of a running start as possible:\n\nRan is one of the most incredibly shot and visually impressive movies that I have ever seen in my life. Some of the things that are done in this movie probably couldn't even have been done as effectively with CG (which is what the modern film maker would have resorted to). This movie trots itself around the screen as a prize visual masterpiece. Let's face it - it's a moving work of art. \n\nThe acting in this movie is also pretty fucking good - as much so as you can expect from Tatsuya Nakadai. I cringed a little bit when I saw the ridiculous over acting of Mieko Harada (Lady Kaede) but maybe that's just me. \n\nAnother thing that fits with the aesthetic quality of this movie is the fact that the score was written by Toru Takemitsu - the product does not disappoint the name. \n\nNow time for the bad part. As we all know, 'Ran' is an appropriation of Shakespeare's 'King Lear' - which is a good play in its own right. And to the credit of Ran, it does a wonderful job of translating that play in to its own cultural context whilst retaining its own identity as a story. \n\nThe one thing that this story keeps which I wish it wouldn't is Shakespeare's story structure. The ridiculous and meticulous and numerous folds of narrative that is a Shakespearean play does not translate as well as one would hope to the big screen. Perhaps it is because the modern audience doesn't feel it has the time for 20 different archs to unfold which a simultaneous circular narrative is in place - We love Shakespeare because he is a genius and because his stuff is flat out impressive. We don't love Shakespeare because his stuff makes for bland appropriations and re-interpretations. \n\nWhat this movie needed was the inspiration of Shakespeare and the sweetness of Akira Kurosawa (who is a modern Shakespeare in his own right) - we do not see that sweetness in 'Ran'.\n\nBUT - if you can stomach a 2h 40m spiral in to depression, then enjoy this otherwise masterful work.",
            "review_date": "2010-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Basically a 'Kurosawa' adaptation of King Lear, RAN is an epic that leaves you completely awestruck. The brilliantly captured scenes are breathtaking to say the least, & are only overshadowed by some of the best acting performances i have ever seen. The movie took about 10 years to be made, & every bit of the effort put in is tangible. One of Kurosawa's finest works.",
            "review_date": "2010-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa three of top-ten!  Japanese version of King Lear...",
            "review_date": "2010-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic, beautifully stylish, tragic and disciplined.",
            "review_date": "2010-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching Ran on the big screen is a movie-going experience akin to seeing Lawrence of Arabia in 70 MM. A beautiful and tragic movie.",
            "review_date": "2010-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe the best cinematic treatment of Shakespeare (along with Branaugh's HAMLET), with dazzling cinematography and some of the greatest battle sequences ever filmed.  Must viewing for anyone not afraid of subtitles.",
            "review_date": "2010-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid Film.  As expected from Kurosawa.  Near perfect in almost every aspect.  Really milks the long shot.  Kurosawa clearly likes his extras, had an entire army at his command for this one and it really came through for him.  Performances are flawless, especially the Jester character.  If you got three hours I'd seriously recommend this one.",
            "review_date": "2010-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely impressive scene but somehow fail to give me the passion I got from the original \"King Lear\". It feels \"unreal\" and lost a bit of the attractiveness.",
            "review_date": "2010-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Ran\" is a spectacular epic with beautiful cinematography and intense, exilerating battle sequences, but it is the intimate portrayal of the family that makes this a masterpiece.  The aging king, dealing with the betrayal of his sons is perfectly in line with its source material, Shakespeare's \"King Lear.\"  This was Kurosawa's best film since \"Rashomon\" (1950).  It is  currently available for free viewing at hulu.com.",
            "review_date": "2010-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Put simply, one of the best films ever made. \r\n\r\nAkira Kurosawa redefines what an epic film is, with breath taking story telling, utterly believable characters and real life (non CGI) battle scenes. Not only this, there are so many subtle themes and messages throughout the film that one can't help but be deeply affected. There's a deep root message of nihilism throughout the piece, laced with anti war messages and questions over morality and family bonds. \r\n\r\nThe film is an adaption of King Lear, but one would be hard pressed to tell, if they hadn't been informed before hand. Kurosawa makes the story his own, and brings a true masterpiece to the screen in the process. The detail on offer is astounding, little wonder when you realise that Kurosawa spent 10 years painting every scene. \r\n\r\nA rare marvel of film making vision and depth; one that will stay with you.",
            "review_date": "2010-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion Ran is Kurosawa's masterpiece and one of the best films ever made.  It is also one of my top 5 favourite films and will probably be for a long time. \r\n\r\nIt is one of the rare films that succeeds in every possible way and watching it is a very powerful experience. Ran works equally well as a family drama, a period piece, an anti-war film, there are elements of comedy, romance and revenge. For me it is the definition of an Epic film. \r\n\r\nRan means Chaos, it is loosely based on Shakespeare's play King Lear, an ageing warlord named Hidetora Ichimonji retires and divides his kingdom between his three sons Taro, Jiro and Saburo. Chaos, War and Tragedy ensue. \r\n\r\nWith this film Kurosawa proves to have been one of the greatest film makers to have lived, but he also proves to be an exceptional artist, this film is a work of art. \r\n\r\nThe direction and cinematography are exceptional and astounding, every single shot is flawless, the colours are vibrant and powerful, the locations are breathtaking, the editing is very smooth, almost imperceptible. I liked the way he filmed the action sequences, he stays quite aloof from the action instead of getting up too close as is the trend these days, thus it has more of an impact and is much more comprehensible. \r\nKurosawa spent 10 years painting each shot of this film before even beginning filming, and it shows. I don't think such a beautiful film has ever been made or will ever be made again. \r\nThe scale of it all is beyond belief; he built the Third Castle on the slopes of Mount Fiji only to burn it down in one of the finest scenes in the film. He ordered thousands of suits of armour, weapons and horses, He used over 1,400 extras.  The film cost the equivalent of 12 million dollars, it was the most expensive Japanese film to be made at the time. \r\nSeveral scenes stand out throughout the film but I would say the most brilliant is the attack on the Third Castle, such a powerful scene that shows the horrors of war better than any modern war film. Hidetora's descent into insanity during that horrific scene is amazing to watch and his silent walk away from the burning castle is haunting. \r\nOther scenes that really amazed me were the whole battle scenes between Jiro's forces and Saburo's, the scene in Tsurumaru's hovel and the final shot. \r\n\r\nThe acting was brilliant from the whole cast, I can't think of any one actor who diminished the brilliance of the film, on the contrary they enhanced it especially Tatsuya Nakadai who plays the Warlord Hiderota and whose performance is crucial to the film as well as being one of the best I've seen. The whole cast really became their characters and seemed at perfect ease in the time they were depicting, probably because of the excellent costume design. \r\n\r\nThe characters were all well developed and all had a purpose, I think a lot of work was put into them. Even those will smaller roles were interesting, but there are some who are fascinating to watch, such as Hidetora, his change throughout the film is quite remarkable, he goes from being a rather proud, pompous unlikeable man to a man who has lost his mind to a man who has discovered himself and wants forgiveness for his sins. Another character that is interesting to watch is the \"fool\" Kyoami who at first seems rather insignificant but later becomes one of the main characters and is very important for his role in the events that take place. \r\nI liked the fact that each character was easily identifiable, on previous Kurosawa films I have sometimes been confused to who some characters were exactly, but in Ran it\u0092s much clearer. \r\n\r\nThe soundtrack is interesting, I can't say I like it but I don't really think it was meant to be enjoyable or even likeable. I think it evokes the main theme of the film which is Chaos perfectly so in my opinion it succeeds at what it was intended for. \r\n\r\nWell I think I\u0092ve said enough about the technical aspects of the film and the various qualities, so I think I\u0092ll say a bit about the themes and the overall message of the film which is very important. \r\n\r\nOne theme that is ever present and mostly quite dominant is that of Chaos, the events are chaotic and unpredictable; often moments of calm are quickly destroyed by moments of violence all of which are sudden.  \r\nThe absence of religion is also a sign of the Chaos, the only religious character is Lady Sue and her fate is tragic, when the fool Kyoami curses the gods Tango replies that the gods cannot save them from themselves. The gods play no part in this film, it only shows the cruelty of man. \r\n\r\nThe strong theme of nihilism is present especially towards the end, Saburo\u0092s death just as victory was attained, the murder of lady Sue just when you thought the bloodshed was over, the fate of Tsurumaru... \r\n\r\nI thought the way Kurosawa used Tsurumaru standing alone and blind on top of a ruined castle with an image of Buddha that he dropped lying in the darkness to be very powerful and very clear; Kurosawa was showing modern mans condition. \r\n\r\nThe way good characters are slain pointlessly such as Saburo and Lady Sue and the way evil characters continue to do their evil deeds until they meet violent ends such as Jiro and Lady Kaede is quite depressing, Ran is easily one of Kurosawa\u0092s darker works, it doesn\u0092t contain such deeds of heroism as the Seven Samourai, instead heroic men are treacherously gunned down by faceless enemies. \r\n\r\nKurosawa made this film at a very difficult period of his life, he was going blind, he had attempted suicide and his wife died during production. But he continued work relentlessly and ended up with one of the finest and most powerful films ever made, and I admire him greatly for that.\r\n\r\nIf you haven\u0092t seen this film then delay no longer, it is essential viewing although grim and dark in tone it will not leave you unaffected. But if you are like the people I have seen give bad reviews to this film because it was too long or too boring then I suggest you stay away from it and be content with latest Hollywood Blockbuster.",
            "review_date": "2010-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an exquisite piece of cinema. Shakespeare and Kurosawa make an unbeatable team. See this movie.",
            "review_date": "2010-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is probably cinema's greatest rendition of a Shakespearean Epic. Adapted by Kurosawa from Shakespeare's King Lear, Ran undoubtedly features amongst the best works of the master director. It captures with sheer vividness and surreal resplendence, the true essence of human struggle for survival, highlighting the cruelties associated with life. Ran is strictly indicative of the sole consistency of life i.e. change, an attribute that not only makes the humans vulnerable but also gives them the hope to rise after a fall. The brilliantly captured scenes are breathtaking to say the least, especially the war scene that depicts fate casting the final blow to the ruthless reign of the warlord. The brutality and the bloodshed depicted in the very scene can make even a cold-blooded appear jittery. Ran portrays the poetic justice in such a relentless and abominable fashion that one can't help but sympathize with the narcissistic warlord, who spent his life arrogating and annihilating the innocent souls. The plaintive score gives the movie a much desired tone, a mood that not only supports its melancholic backdrop, but also immensely adds to its poignant beauty.. Ran is a classic example of Kurosawa's brilliance and perhaps a consummation of his artistic direction.",
            "review_date": "2010-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful and inspiring, based on the Shakespeare play \"King Lear\" Kurosawa delivers the epic film Ran. It seems astonishing that Ran is his most beautiful film as he was nearly blind when he directed the film. A classic from the great Akira Kurosawa.",
            "review_date": "2010-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 'Kurosawa' adaptation of King Lear in his film 'Ran' is a tremendous memorable film.\nIt is a very dramatic film with many soliloquies and dialogue, but if you are patient with it, you are treated to some of the most epic scenes of cinematic brilliance that Kurosawa made. After all it is Shakespeare and one must be patient with it if they are not a fan of the old school theater.\nColorful clashing armies, The lord awaiting his fate in a burning castle, a brilliant execution scene, and the blind being left in the hands of Buddha?\nThe Acting in this film was powerful and superb. The colorized version of this film was really applied to this one than Kurosawa's previous works to make the scenery and shots look realistic as they were in a Shakespearean version tragedy.\nWhile Seven Samurai will always be his perfection, Ran is more than an enjoyable movie that should be seen. This one has more story and makes you serious on what's going on with these family about themselves. Just stick with it and you'll never forget this masterpiece of Kurosawa.",
            "review_date": "2010-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Japanese King Lear adaptation is impressive for its beautiful cinematography and epic scenes of battle. The acting is over-dramatic. Out of the big cast, the only characters really worth looking out for are a court fool and a scheming femme fatale - but the movie spends way too much time following a crazy old lord.",
            "review_date": "2010-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran is the pinnacle of every epic film ever made, and should be a shining beacon of what a film maker should strive for whenever taking on history, action and Shakespeare. Kurosawa is my favourite director and Ran is his best work, with Seven Samurai and Rashomon right behind. Every sequence, every line of dialogue, everything is done right. The battles are as epic as one could ask for, the sets and costumes are all accurate to the time but also add to the colourful beauty of the frame. The pace is perfect as we remember all of the characters and their moral positions in the film, which can be tough with all of the long surnames. The film to me is perfect and you couldn't have asked for a better adaptation of the greatest playwright ever.",
            "review_date": "2010-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This could have easily been half as long. Length aside, none of the characters are likable (except for perhaps Tango), so it's hard to get sucked into the story. This also causes the melodrama (which is so typical of these Japanese flicks) to fall flat.",
            "review_date": "2010-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Film making at the top level. It's so clearly laid out and 3 hours just flew by. Battling scenes are epic and well worth a watch.",
            "review_date": "2010-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "King Lear in Japan, with a touch of Macbeth.",
            "review_date": "2010-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was captivated by the interpretation of King Lear in a way that a Japanese person could understand the story.  Of particular curiosity to me was the translation of the fool.  I asked my Japanese flatmate whether or not he related to that character, or whether one would be present in Japanese feudal history, and his response was that there were such men, but usually not near the king.  It's funny how many similarities very different cultures have in common!  \n\nOn the whole a very interesting and well done film!",
            "review_date": "2010-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just saw this at the Belcourt Theater in Nashville and it was AMAZING!",
            "review_date": "2010-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie from Akira. Considering that it was made 25 years ago, it is one great movie. it deserves at least 8.5 out of 10",
            "review_date": "2010-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ran could have been a victory lap. In 1950 Akira Kurosawa turned the conventions of film narrative on their ear with Rashomon, a film so unlike anything before it that Kurosawa's producers and actors insisted it didn't make sense (it did), and in 1954 he made The Seven Samurai which is not only the most influential action/adventure movie of all time, but is one of the 4 or 5 best movies ever made by anyone. With a handful of other classics thrown in for good measure (Ikiru, Throne of Blood, Yojimbo), Kurosawa's place as one of the masters of cinema is undeniable. By 1985, he had absolutely nothing to prove, except maybe to himself.\r\n\r\nBy the late 60s Kurosawa's native Japan had turned on him, declaring that his style had become too westernized and he was essentially banished from the Japanese studio system. He was signed to work on his first American film in 1970, but was fired by 20th Century Fox. He attempted suicide, his eyesight was going, and nobody wanted to finance his films. To make things worse, at the ripe age of 65, Kurosawa had his biggest idea yet, a massive adaptation of Shakespeare's King Lear set amongst the warlords of 15th century Japan. He spent ten years storyboarding the shots for the film he would call Run (which translates to chaos or revolt), designing the costumes, and most importantly, trying to rustle up the money to make what would eventually be the most expensive production in Japanese history. After this decade of preparation, he would team with French film producer Serge Silberman, and Ran would finally get off the ground. \r\n\r\nLike Lear, Ran begins with a man dividing his land among his children. Lord Hidetora has spent his whole life taking over all the land he could see, and killing everyone who stood in his way. Now, in his 70s he has given his land to his three sons in hopes that this will allow him to live his remaining years in peace. What he's actually done, is given everybody access to an army. This is Kurosawa's bleakest film, a sense of dread hangs over all the proceedings. This may also be Kurosawa's deepest work thematically: madness, honor, death, war, sex, God, and family are all within the auteur's wide grasp.\r\n\r\nVisually, Kurosawa has few equals. He fills every inch of the frame with his unique mixture of authenticity and artistry. It's not just the cinematography, which is of course exhilarating, it's the production design, the costumes, the make up. Ran is a complete visual experience. Kurosawa's battle scenes are a reminder of just how poorly most battle scenes are filmed. Instead of obsessing over trying to make the audience feel like we're in the middle of the action (which we never really will anyway) Kurosawa pulls back and let's us see the whole gruesome spectacle. The majesty, the violence, the hatred.\r\n\r\nWhat stands out about Ran for me, as it does for all Kurosawa's work, is his purity as a storyteller. He's the undeniable master of the cinematic epic (David Lean is #2 and then it's a long way down to #3), and you can't make films with the weight and length that he does without perfect pacing. A Kurosawa film is never rushed, never hectic, but also never boring and never lethargic. He always moves at just the right speed, and for the life of me I can't point out an example of this aspect of his genius. So, how did he do it? Why did his films move so much more smoothly then other filmmakers? It must come from inside of him. No, tricks, no techniques, this is the only way he knew how to tell a story. He probably never even thought about it, and that is the sign of a great filmmaker.\r\n\r\nRan is brilliant in every way a film can be brilliant. It strikes us in our hearts, our heads, and our eyes. I would be remiss if I didn't mention the philosophy that Kurosawa so tastefully sprinkled through all of his movies. His films were always full of interesting questions, and in Ran he poses one of his toughest. Is God somehow permissive of human atrocity or having created human beings is He Himself powerless to stop us?",
            "review_date": "2010-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"It is the gods who weep.  They see us killing each other... over and over since time began.  They can't save us from ourselves.  Don't cry.  It's how the world is made. Men prefer sorrow over joy... suffering over peace.\"",
            "review_date": "2010-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"It is the gods who weep.  They see us killing each other... over and over since time began.  They can't save us from ourselves.  Don't cry.  It's how the world is made. Men prefer sorrow over joy... suffering over peace.\"",
            "review_date": "2010-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Samurai Nonsense.. the story of Shakespears King Lear... as a samurai film - excellent",
            "review_date": "2010-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For years I have listened to various ravings regarding Akira Kurasawa's 1985 masterpiece \"Ran\".  I finally got around to seeing it, and I must say, I now understand what all the fuss was about. \r\n\r\nBrilliantly filmed in the hills of Japan, \"Ran\" is a colorful, poetic tale that takes to Japan's fascinating Sengoku era.  Methodical and purposeful, the film is a mix of political intrigue and philosophical observations that will reel you in for an unforgettable and blistering 162 minute ride. \r\n\r\nFrom the opening moments, I knew I was in for something special.  The memorable cinematic moments just kept coming, scene after scene, frame after frame.\r\n\r\nWhile it is a partial myth that Kurisawa had King Lear in mind during development of Ran, Shakespearean elements are nonetheless present.   Key characters are evident, but they are supplemented by secondary characters who have a forceful and memorable impact on the story.  Kurisawa also injects a fool, or jester, who provides continuous insight, musings, and commentary on the madness that surrounds him.\r\n\r\nSome may have issues with the subtitles, and discerning who's who in the various personal conflicts and armed battles.  A generous and strategic utilization of rewind may be in order.  Other than these occasional confusions that rear their head, Ran is a masterpiece of the highest order.",
            "review_date": "2010-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great to finally see a Kurosawa film in color.  The Shakespearean story told in Japanese feudal system was seamlessly done, at times i forgot it wasn't an original story.  The Jester playing the role of the fates for the audience in the film was very useful and informative of the madness the Daimyo suffered. The battle at the third castle was amazing.  Entering the battle late seeing only the aftermath of the destruction and the removal of all sound except the soundtrack, created a dismal hellish atmosphere. Brining across the true chaos and destruction of war. It is as innovative as when Kurosawa invented the slow motion death in Seven Samurai. As the film went on the hell of war became worse and worse.  Ending with almost every character dead, and a final image of the Lord Buddha.  Kurosawa presents a powerful message in a beautiful thought provoking way.",
            "review_date": "2010-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the most depressing epic ever made.",
            "review_date": "2010-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wednesday, May 13, 2010\r\n\r\n(1985) Ran\r\n(In Japanese with English subtitles)\r\n\r\nDRAMA\r\n\r\n  One of the best Shakespeare adaptions as well as my personal favorite out all the Kurosawa to Shakspeare adapted films because of it's straight- forward storytelling of the play of \"King Lear\" as well as it's metaphorical themes.  Awesome ending!!\r\n\r\nMasterpiece\r\n4/4",
            "review_date": "2010-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nr perfect for visuals, deep story (based on Lear) even humor w/his fool, drama, acting, long & satisfying, Kurosawa at the top of his game!",
            "review_date": "2010-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best tragic film ever. More analysis later.",
            "review_date": "2010-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a stunning epic film, with beautiful cinematography and beautiful landscape. A film about power struggle, inhumanity and war. If you like your Hollywood action films with big explosions and lots of CGI, this probably isn't your cup of tea. But if you like the long takes, strong dialogs and beautiful scenes, this is a must see. A brilliant peace of work from Akira Kurosawa.",
            "review_date": "2010-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Kurosawa's best",
            "review_date": "2010-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa = Stunning achievement in epic cinema. and in Color!",
            "review_date": "2010-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurosawa does 'King Lear' in his own meditative and epic manner. The story may be somewhat stagey, but the cinematography - the battle scenes especially - is fantastic.",
            "review_date": "2010-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first experience with Akira Kurosawa. His most expensive movie but I'd say a brilliant one nonetheless. I'd like to add that this movie, or these kind of movies arent for everyone as it can sometimes get a bit slow or too expressive. But if you don't understand that this one is a true epic, then you don't understand much about movies either.",
            "review_date": "2010-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this on the big screen in Chicago Monday.  It is playing around the country because it just got re-released on 35 mm. film.  Although some of the acting is a little overdone, it is well worth a drive to see it.  Breathtaking colors, fabrics, warfare.  Good!!",
            "review_date": "2010-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well done movie that earns its fans and love from critics. not something I'll see again, but I'm glad to have seen it at all.",
            "review_date": "2010-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mieko Harada is creppy and evil as Lady Kaede.  The sweep of the \"King Lear\" story is ever sprialling downward.  The visuals are striking and gruesome and beautiful.  A wonderful film.",
            "review_date": "2010-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Right up until the end, Kurosawa was a master of the film art form, and Ran is definitely one of his finest films.  An adaptation of King Lear, it tells the story of Lord Hidetora who, being long in the tooth, decides to divide his land between his three sons (not daughters, Shakespeareanites).  However, his son's have other ideas about how to deal with the old man who relinquished his power, but wants to retain his status of Great Lord.  The cinematography is gorgeous, and the battle scenes are an achievement all by themselves.  In this day of CGI all battle scenes feature hundreds of computer-generated extras: not Kurosawa.  His film is filled with hundreds, probably thousands of extras, but more then being a fight movie, it is also a tragic tale of how a father was overthrown by his sons' greed.  SEE IT ALREADY!",
            "review_date": "2010-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is playing at Cinema 21 right now.",
            "review_date": "2010-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strikingly beautiful. Outrageously melodramatic. This isn't my favorite Kurosawa, but being less of a Masterpiece than, say, \"Seven Samurai\" still makes it more of a Masterpiece than most directors could hope to achieve. And remember; none of those soldiers, horses, clouds, arrows, flames, or sprays of blood are CGI.",
            "review_date": "2010-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i actually like Kagemusha more, but this was still great.",
            "review_date": "2010-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best way to describe this movie is a \"beautiful tragedy\". The roots of the movie are obviously Shakespeare's \"King Lear\" but I think even Shakespeare would have approved of Ran.\n\nMost of the direction was done in long shots and I think that really allowed for the audience to feel the emotions that were not just weighted within each character but all of them (including the extras) as a whole.\n\nTatsuya Nakadai as Lord Hidetora Ichimonji is incredible. I was completely engaged in his character from beginning to end. Supporting cast does a fine job as well. I didn't no find myself bored at any time (however some might find the movie a little long).\n\nOverall a fantastic movie, 9/10.",
            "review_date": "2010-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fantastic film by Kurosawa. Kurosawa takes an in depth look at the consequences of chaos and war that is very much influenced by Buddhist theories. Hidetora's past actions have come back to wreck havoc on his family and territory. Some have even considered the film to be a sort of biography of Kurosawa. Kurosawa does an excellent job once again with the cinematography. Yet, in my opinion, its not one of Kurosawa's best works.All of the characters with the exception of Saburo were rotten to the core acting entirely out of self-interest. While such a characterization may have been part of the message Kurosawa sought to get through, I found it difficult to truly accept the almost exaggerated egotism of many of the characters. I think the work was also hindered by Kurosawa's close adherence to the Shakespearean play, King Lear. In doing so, it really limited the originality of the film as a whole.",
            "review_date": "2010-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Kurosawa's crowning achievements.  It's epic scope and masterful retelling of King Lear make it a film with no equals that I know of. The subtitles are not too big of a problem, but I think it's best to read through it once and go back and watch it again without the distraction to get the full effect. Top tier filmmaking this!",
            "review_date": "2010-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In 16th century Japan, the Great Lord of a powerful samurai clan abdicates his power to his oldest son, causing a rift between two younger sons and their father, leading to much betrayal and warfare in Akira Kurosawa's 1985 transformation of \"King Lear\" to the feuding clans epoch.  A companion piece, as it were, to three previous Kurosawa films, \"Seven Samurai\", \"Throne of Blood\", and \"Kagemusha\", but \"Ran\" stands alone as the pessimistic, apocalyptic vision of a master filmmaker who feels his time may be near, and though he'd still make films for another eight years, this is the film that effectively sums up his career, both glorious, difficult, and overwhelmingly dark, a devastating portrait of human frailty, greed, and betrayal at it's bleakest.  But the colors, the amazing reds, yellows, and greens, and the Oscar winning costumes, remain warm and bright, a lovely vision of purity amongst constant decay.  If you get both the Criterion double disc and the recent Studio Canal Blu-ray in your hands at the same time, you'll be in for hours and hours of in depth study of one of the great action epics of our time.",
            "review_date": "2010-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a stunning epic film, with beautiful cinematography and beautiful landscape. A film about power struggle, inhumanity and war. If you like your Hollywood action films with big explosions and lots of CGI, this probably isnâ\u0080\u0099t your cup of tea. But if you like the long takes, strong dialogs and beautiful scenes, this is a must see. A brilliant peace of work from Akira Kurosawa.",
            "review_date": "2010-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a very humble way I can say, this may be the best movie I've seen in my entire life!\r\nIt has took me a very long time to finally watch a Kurosawa movie. So I can't say much about his other films, but if this is not even considered his best... then I've got a lot to be looking for! :D\r\nAs for Ran - it's just perfect. The entire movie is pure perfection. Not one scene is wrongly placed. The cast is amazing. The way Kurosawa combines epic fight scenes with psychological character study is not to outperform. The whole movie is pure genius, and should be remembered as an eternal treasure of the human race!\r\nThe old guy - Tatsuya Nakadai - delivers one of the most stunning and most rememberable performances I've seen. Also the rest of the cast couldn't have been better.\r\nKurosawa's use of music, sound, colors, camera angles, his use of language and symmetry is undescribably beautiful. I find no other words than to call this movie a timeless masterpiece.\r\nThank you, Shakespeare, for the original! Thank you, Mr. Kurosawa, for one of the best movies in the history of cinema!",
            "review_date": "2010-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Giant Samurai Epic based on Shakespeare's King Lear with great Battles and Natur Shots grandious directed by the Master Akira Kurosawa a tragic Masterpiece about Trust and Mistrust",
            "review_date": "2010-03-21",
            "source": "rt",
            "lang": "en"
        }
    ]
}