{
    "rating": 9.1,
    "release_date": "1985-06-07",
    "num_reviews": 170,
    "genres": [
        "Kids&family",
        "Adventure",
        "Comedy"
    ],
    "summary": "When two brothers find out they might lose their house they are desperate to find a way to keep their home. They find a treasure map and bring some friends along to find it. They are all out looking for the \"X\" and trying to get away from a group of bad guys who also want the treasure.",
    "reviews": [
        {
            "content": "Bland And Boring Movie",
            "review_date": "2023-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember watching this movie in theaters and I have to admit that after all these years the characters are just as consistent as they are endearing.",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We all know that THE GOONIES is one of the greatest adventure films ever made, so there's no use telling you something you already know! A+",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can you say, it's a classic. Everyone should see it at least once.",
            "review_date": "2023-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films ever made. Full of action and laughs. Awesome story",
            "review_date": "2023-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great example of a cast working together like peanut butter and jelly. Goonies has some of the most genuine warmth that you will ever see in a coming of age film and a captivating plot to boot.",
            "review_date": "2023-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of all time. If I you didn't watch this during your childhood I pity you. But hey it's not too late get it watched.",
            "review_date": "2023-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pathetic and stupid movie! 💙❤",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everybody loves the Goonies movie Especially if you grow up in the 80s",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's only one thing to be said. ANDY… YOU GOONIE!",
            "review_date": "2023-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took me way too long to finally watch this one. Always catching bits and pieces of it over the years. It's a charming movie about kids on an adventure that end up getting in a bit over their heads. There is something genuine about The Goonies that simply no longer exists in Hollywood films today.",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was incredibly annoying. This might be the worst Steven Spielberg film I've ever watched (even though he's not even the director). All the characters act absolutely filthy and braindead (which is sad because these actors went on to do much better things in their lives). The script (yes, there is a script) is just so awful I'm starting to either wonder if the MPAA was dumb or if the script-writers just didn't even care what the age for this film is. In fact, the actual age is so confusing that when I look up Corey Feldman on this site, his bio lies to me about the films he starred in (the site claims that \"Gremlins\" and this film are \"kid-friendly\" even though when you watch them, you'll realize that they're actually not). Anyway, back to this. The story is cliche. The Goonies themselves are so annoying and are just constantly fighting over each other. They yell, swear, fight, and start literally doing not kid-friendly stuff (such as looking up people's skirts and making jokes about a statue's penis). The most annoying character of all, Chunk, gets kidnapped by the villains and literally just cries and whines his ass off for like five minutes in front of them. Literally right in front of them. While the villains threaten to chop his fingers off. What was Spielberg even thinking? You are such a legend and you think that will entertain the kids?! Then he feeds the deformed guy I can't even remember the name of Baby Ruth (wow.) Then the other brats find the ship, Chunk reunites with the kids, then the ship just sails off and eventually sinks. I just don't really care anymore. I know all of you guys like this film, but throughout the movie, I was hoping for all the kids to fall to their deaths or something like that. All I will say is, if you want a good Spielberg film, just watch Jaws, Close Encounters, E.T., Indiana Jones, Jurassic Park, Back to the Future, and all other stuff. This did not deserve my time at all. Even Gremlins is better compared to this. And the fact that my mom likes this film makes this whole thing worse. Just avoid this. Anyone who says this is good is an idiot.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Creative, fun, adventurous. Cool to see the cast now and rewatch it. It’s a classic",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid pacing. While the movie can appeal to most audiences its clearly targeted for kids. Despite the large amount of cussing which had me rethinking the filmakers target audience. Pretty good acting from the kids. Mouth and Chunk were standouts.",
            "review_date": "2022-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My FAVORITE movie of all time. A true classic.",
            "review_date": "2022-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could have been awesome growing up in the 80s with bangers like this... It's not perfect but that is what makes it iconic and memorable.",
            "review_date": "2022-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goonies\nPG\nAdventure\n\nIn 1985, the date of the release of the movie, the Goonies was a success, the goonies needed money to pay for their homes.\nWilly, the pirate had lots of money, sure to pay for the condominium, the group faced three  thieves, saved sloth. It is an adventure, a comedy and a family movie. In my opinion it is a very good movie, congratulation!\n------------------------------------------------------------------------------------------------------------------------------------------------------------\nGoonies .. for 1985 the film is very good , i love see five kids lase goind after of a treasure",
            "review_date": "2022-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a 14year old born in 2008 i can tell you that I didn't care at all that the movie was released so many year before I was even born, it was amazing. I enjoyed this movie so much and it actually caught me wishing I was a teen in the 80s",
            "review_date": "2022-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably one of the greatest 80's movies of all time. Period.",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie after it was recommended to me by my brother. I thought what would be in the movie that it became cult classic, so I decided to watch it. It was not a great movie but it was enjoyable. It is purely made for children as it has all the elements that a child will love to see. All the cast members performed nicely. I felt the pacing and direction was going good in the starting but it started to feel weak in the last 1 hour due to which I started getting bored at one point but overall it is a good film that the whole family should enjoy. I think this movie can be expanded into a franchise easily with new adventures in every movie.",
            "review_date": "2022-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it wasn't well received when first released. The Goonies is consider to be one of the great Cult films to ever exist that give us a children's story told by soon to be famous adult super stars.",
            "review_date": "2022-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (7.5/10) ; Cinematography (8.5/10) ; Plot (7.5/10) ; Acting (8/10) ; Pacing (8.5/10) = 80%}\"",
            "review_date": "2022-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest movie of my generation. ",
            "review_date": "2022-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Rudd was not in this movie",
            "review_date": "2022-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the greatest kids movie ever made. It's pure cinematic magic. It sums up what it means to be a kid in an adult's world perfectly. It's the greatest ensemble cast for a kid's film ever. The writing, cinematography, acting, and direction are all perfect. This is the first kid's film that made itself known as being a great film on all other metrics. It's a perfect film. I've watched this film more than I can count. I've watched it so many times that my dreams almost always take place in the same kind of coastal town as the film. It's a genius level film. There is no standard you can judge a film that it doesn't measure up to. It's perfect.",
            "review_date": "2022-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic! Watched it with the kids this weekend and it as awesome as I remember. Side note of caution this movie does have some bad language and violence so it may not be for all parents with small children.",
            "review_date": "2022-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All ages admitted!!!!!!!!!!!!!!! LOL, the funniest 01 hour: and 51 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best movie of all time.",
            "review_date": "2022-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was great to take the kids to see a classic. Of course we had bought the movie years ago but the big screen again was awesome.",
            "review_date": "2022-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watched The Goonies in the theater again. It was as good as the first time around. The music is great, I just wish at some point they would release an extended version of this classic. Someone take the time to put the silly octopus scene in. I have just seen this movie so many times it would be nice to have more. Feels like childhood.",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great to rewatch a favorite movie on the big screen!",
            "review_date": "2022-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a movie you must see before you die!!! Its about friendship, bravery, finding your destiny. You wont regret it!",
            "review_date": "2022-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "as a child of the 80's, i never got the hype on this one at the time. it wasn't very good to me then so i decided to check it out again as an adult. it didn't age well.  i know it has a cult following and all that but it just didn't do it for me and i love most all movies, even the bad ones.",
            "review_date": "2022-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best movie ever on the big screen.. if you ever get the chance to watch the goonies on the big screen don't hesitate just go watch it.",
            "review_date": "2022-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A childhood relived. Never get tired of this movie",
            "review_date": "2022-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GOONIES NEVER SAY DIE!!!! this is one of my favorite movies of all time and you guys gave me the opportunity to watch it on the big screen! can’t wait for Raiders of the lost ark! see you guys soon",
            "review_date": "2022-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was amazing being able to see such a classic part of my childhood on the big screen.",
            "review_date": "2022-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my absolute favorite treasure hunting movies and a classic \"kids on bikes\" joint. This is a movie that does well to bridge the interests of kids and adults into one movie. Along with the fun goofs there are moments of pure heart. Due to the subject matter of stealing from pirates, this movie will stand longer. Using an ambiguous treasure with no real origin helps the PC problem. I love treasure hunting movies but I want them to be able to stand the test of time as well.",
            "review_date": "2022-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goonies is by far the best movie I have seen in my lifetime. It brings me back so much nostalgia from watching it with my family when I was younger. Every time I watch it, I love it just as much as the first time I saw it. I love the way the actors portrayed the characters, especially Jeff Cohen playing Chunk. This movie gave me a true interest in adventure as a kid, as I am sure it did for many others. The plot truly never gets old, it is a timeless classic. The Goonies will always be one of my favorite movies.",
            "review_date": "2022-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the movie that most represents my childhood and has marked my life forever.",
            "review_date": "2022-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really fun adventure film!",
            "review_date": "2022-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my favorite 80s movie, Goonies is so much fun from start to finish. Hilarious, exciting, and heartwarming, Goonies inspired millions of kids like me to go on treasure hunts and other made up adventures with my friends and siblings. Love, love, love how pure 80s nostalgia this is.",
            "review_date": "2022-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goonies, what a fun movie. I will admit Richard Donner's direction was a little too leisurely and there are some parts in the middle half that are too slow and falls dangerously into cloying sentimentality. Still this childhood favourite of mine is great fun from beginning to end. No matter how thin the story is, it has an intriguing premise and Donner and Chris Columbus keep the action going strong and the adventure fun enough for the younger audience. The script is funny and affectionate, the music is memorable and in general the special effects are good. The image of the pirate ship was mind blowing and the cinematography and costumes are very well done. The performances are very good; while Sean Astin and Corey Feldman are the standouts of the child cast, it is Anne Ramsey who steals the show as Ma Fetali in a effortlessly over the top and deliciously evil performance, very like Diana Dors in The Amazing Mr Blunden. All in all, a fun adventure yarn. 8/10 Bethany Cox",
            "review_date": "2022-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directing a bunch of kids must be a monumental task in itself, but Donner was able to keep the comedy coming with these guys & gals thru a great script from Spielberg. Wanting to achieve something as a kid to help your family is a premise we can all take a lesson from. Having a few bad people thrown into the mix to make things more difficult creates tension and the possibility of failure. A love interest was obvious at the ages of Brand & Andy, and is a sidebar comedy situation in itself. The way the entire story is neatly sewn together to allow the kids to reign supreme in the end, as well as a parallel of One-Eyed Willy's booby traps that are similar to Mikey's gate-opening design sequence multi-stage mechanisms, show how they both think on the same page on many levels.",
            "review_date": "2022-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goonies is really exciting thrilling adventure for kids and family and I definitely compared it to Spielberg's adventure film Indiana Jones.",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best kid's films of all time. Action, adventure and comedy lead the way in this 80's masterpiece!",
            "review_date": "2021-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still today, one of the best family films out there. Fantastic and we still watch it over Xmas holidays. Wish they were still making family films like this.",
            "review_date": "2021-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way overhyped. Never had the chance to watch it as a kid and viewing it as an adult was painful.",
            "review_date": "2021-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What about this movie has everyone so obsessed? Everything, it instantly gets every kid and quite frankly adults hooked from start to is finish with the story of a group of goofy misfits searching for a legendary pirates treasure. While also being pursued by murders/bandits who they crossed paths with in the film during their search.",
            "review_date": "2021-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Group of kids who face all of them to escape from a gang that wants a treasure, a very banal but well done plot and adapted to a children's film that manages to entertain the whole family",
            "review_date": "2021-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite films of all time. A must watch for anyone of any age.",
            "review_date": "2021-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goonies\n\nThis film is one of my childhood favorites. I practically grew up with this film.\n\n \nThe story is about a gang of criminals on the run while an innocent group of kids get caught up in an adventure. Four of them are a group of boys determined to save their house from being demolished. Another one is the older brother to the boy Mikey (who gets the idea of saving the house) and two girls, one called Andi who is in love with the older brother Brand and another girl tagging along with Andi. Eventually all the kids are caught in a wildcat adventure of getting money to save their house by finding some treasure while along the way they come across the bandits who want the treasure too. \n\nThe film is similar to an Indiana Jones film. It even has the same kid actor from Temple Of Doom. However it's more kid friendly but has the same structure of an Indiana Jones story. Lots of comedy and adventure and thrills. Most of the comedy stems from the fish out of water aspects of where the characters are. As stated, these kids have reasons why they have gone on this adventure. Mikey is the one who gets the idea of saving the house, while his friends, Mouth (the blabbermouth) Chunk (the big eater) and Data (the tech whiz) come along as their homes are in danger of being demolished too. As you can tell by the names, Mikey's friends are pretty eccentric yet have potential talents. Mouth, despite barely shutting up, uses his mouth to his advantage with his gift for Spanish. Chunk may be obsessed with food but he ends up saving his friends after coming in contact with one of the less mean criminals. And Data's inventions prove to be pretty useful along the adventure as silly as they can be.\n Holding this group together is Mikey. The most normal of the group and the guide for the audience. He's pretty much the most relatable low key member of  the group. He's fearless and the most determined out of all his friends despite being the least eccentric.\n Then there's Mikey's brother Brand. He doesn't mind too much about moving and comes along reluctantly as he's trying to protect his brother. It's only when Andi comes along that Brand decides to come along. In turn, Andi comes along because as long as she's with Brand, Andi doesn't mind going on the adventure. While she does overcome her naivety along the journey, learning about the dangers she has put herself in, its not all for the bad. Andi uses her piano skills to help during a perilous part of the adventure. Like Andi, Steff doesn't have any idea of the perils of the journey either but comes along as she shares close ties with Andi. However, unlike Andi, Steff is more cynical and sarcastic and not as naïve as Andi\n\nThe Goonies is a great adventure flick. Even as an adult I still like it. I would recommend it to a friend who would likes fun adventure films.",
            "review_date": "2021-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh my goodness. What a lovely film. I enjoyed this movie wholeheartedly and It made me want to be a kid again!",
            "review_date": "2021-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my Top 3 All Time.",
            "review_date": "2021-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that manages to capture growing up in the 80s and tell a whimsical adventure tale simultaneously.",
            "review_date": "2021-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a fun 80s adventure movie sloth steals the show and has become So iconic over the years it has some serious Indiana Jones vibes which shouldn't be surprising after all it was written by Steven Spielberg I just wish they hadn't cut the octopus cave scene",
            "review_date": "2021-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this several times growing up through the 90s & early 2000s and seemed to enjoy it more each time. It's the movie I compare other 80s movies to when I want to judge just how much of an 80s vibe the other movie gives off. I will say that rewatching it as an adult took some of the magic away as some of the booby traps they navigate through felt redundant and some of the banter didn't really land, but as a result Chunk was even greater comedic relief to me this time than he had been before. The romance subplots felt a little tacked on too, but otherwise the villains were excellent and the child actors acquitted themselves well. The production design was solid, though I have an issue where I noticed that 1982's Poltergeist and 1993's Jurassic Park had practically the exact same prop tree in it and realized that Spielberg has an ultra-distinct style of prop/background design that has made other movies he's involved in look less realistic to me. The score really follows the action well and crescendos at all the appropriate moments. I'll surely rewatch this again in a few years.",
            "review_date": "2021-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is the face of the 80s",
            "review_date": "2021-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When it comes to adventure movies for kids, you can't really do better than The Goonies. This brain-child of Richard Donner, Christopher Columbus & Steven Spielberg features a cast of unforgettable characters, exciting action, and endlessly quotable lines. This is the type of quest I always wished my friends and I could go on when we were young. Hey you guys, watch this movie!",
            "review_date": "2021-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic for all ages",
            "review_date": "2021-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, but probably a bit overrated?",
            "review_date": "2021-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Screaming, screaming, and more screaming. Useless villains. Plot made no sense. The story of the golf course being built where the houses are would've ended the story right there. You can't build a golf course there. The end. I would give it a zero but it's not allowed. Nostalgia is one thing but this just sucks. Sorry not sorry.",
            "review_date": "2021-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's canonical but yes fun and delivers in every way possible to be a great adventure movie for the whole family to this day.",
            "review_date": "2021-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just got finished re-watching The Goonies, and I have to say that nobody acted like these brats from back in my heyday as a kid.  In fact, some of the stunts pulled were so dangerous, that someone would have been sued, take the scene of the older teenager on the bike, being driven off the cliff, that should have caused major life-taking scene, and the Director never should have put that scene in the movie.  Overall, this movie I cannot recommend anyone to see!",
            "review_date": "2021-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most iconic kids & young teen adventure movies of the '80s, while not without obvious flaws, \"The Goonies\" has an ensemble of characters for everyone, and that take us along for a contemporary Spielberg-style treasure hunt.",
            "review_date": "2021-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nostalgia got this movie into the Library of Congress.",
            "review_date": "2021-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my absolute favorite 80's movie. The characters are charming and hilarious. Every kid should watch this movie.",
            "review_date": "2021-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly iconic - and overrated, I liked \"The Monster Squad\" way better, overall - thanks to the competent direction by a experienced Donner, and a cast with some future stars (Brolin, Astin), but it is too cheesy and maybe not enough campy to validate the \"classic\" status it has. The obvious comparison, again, is \"The Monster Squad\" and the key difference is, in the latter, there's always the sense of real danger for the kids, while in \"The Goonies\" the sensation of urgency and danger is completely dilluted thanks to the Spielberg-disneyesque production company having all its footprints over the film.",
            "review_date": "2021-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dumb and cheesy adventure movie that really doesn’t have any adventure that is suspenseful like it should.",
            "review_date": "2021-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was always bugging my old work for a family channel, alas, we were really focused in the boobs and butts of the music industry, despite any progressiveness this country may be facing as a whole. The bottom feeders are still focused on bottoms. \n\nIf we had a family channel this would be the movie we'd want to license. Despite my lack of interest in censorship, showing the underage Andy's panties in the car scene is creeperstown from Spielberg, and the family can't have that anymore. I don't care about catering to teenage audiences, when an old man is shooting a girl's crotch in an otherwise family-friendly film, the issue, no matter how brief (pun intended) is a huge mistake, and really gross.\n\nSorry Steven, we're wide awake in the family these days...",
            "review_date": "2021-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best kids movies of all time. 9/10",
            "review_date": "2021-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So funny, so emotional and a thriller of a ride through childhood fantasy.",
            "review_date": "2021-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film will never die.",
            "review_date": "2021-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute classic, comedic, light hearted, baby Thanos, short round, baby Sam awesome dumb fun",
            "review_date": "2021-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was my childhood. almost every other week it was me and the goonies finding the treasure. it never got old.  the humour is on point and the story is great. and I always wanted to try the organ waterslide.",
            "review_date": "2021-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great funny family film",
            "review_date": "2021-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the Best! The movie rarely pauses to breath and is easily one of the best teen adventure movies of all time.",
            "review_date": "2021-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ten year olds saying \"shit\" compilation",
            "review_date": "2021-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this when I watched it as a kid, and I enjoyed it when I watched it with my daughter. But, as an adult, it's kind of a dumb kids movie.",
            "review_date": "2021-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is fine. I think that it is creepy, annoying, or disgusting at times.",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goonies is an exhilarating adventure film directed by the best person to handle movies like this, Richard Donner. Along with Superman, this might be one of his best works ever, as it brings a light innocent charm and likability to its story and characters while not shying away from darker, more dramatic elements as well.",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect movie and so fun to watch again and again.",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Hey you guys come look at this classic 80s movie\" This movie is brilliant from the acting to the story this movie is destined to be enjoyed by all different ages. The characters in the lines are so iconic you could write a whole review out of them.The story is written by Steven Spielberg was just helps this movie out.",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my child hood favourite film. \"Hey you guys\"",
            "review_date": "2020-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goonies is an absolutely brilliant film, totally intelligent and funny, the 2 hours of duration fly by.",
            "review_date": "2020-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a very funny film and definitely surprising at the end. I'd recommend it for 8 years and over. It does not have any swear words in. You guys really need to watch it. I suggest it gradually gets funny. It is about adventures finding treasure.",
            "review_date": "2020-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Goonies is a great family adventure. My only issue with the film is that it slows down a little bit when it cuts to the Chunk and Sloth subplot.",
            "review_date": "2020-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All time classic that everyone should have seen at least once.",
            "review_date": "2020-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The classic is so much fun!",
            "review_date": "2020-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So, I had never seen this movie before. It was a wonderful story. I want to see it again.",
            "review_date": "2020-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Adventure, comedy, identifiable kids, a surprise hero, pirates, mystery and a lot of great scenery.  What more could you want?  Some great music?  Yes, This movie has it all and you can take your kids to it also.",
            "review_date": "2020-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "loved seeing it on the big screen again. one of my favorites from childhood",
            "review_date": "2020-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was nice to see older movies at a decent price.  We are looking forward to more in the future.",
            "review_date": "2020-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still one of the most entertaining and hilarious coming of age films ever made. It's the movie you watch every time it's on. ",
            "review_date": "2020-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic movie! I hadn't seen it in years and had forgotten many details, scenes, lines and puns/sight gags and product placements! Great fun to hop in the Wayback Machine and take a trip back to the 80's when things were simpler and escape the stress of today!",
            "review_date": "2020-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it when it came out and enjoyed taking my son to see it!",
            "review_date": "2020-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good family movie. Must see classic from the 80s",
            "review_date": "2020-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We loved watching Goonies on the big screen!",
            "review_date": "2020-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "NOSTALGIA ‼️ GOOD TO SEE IT IN THE THEATER WITH MY KIDS 😳",
            "review_date": "2020-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Basically perfect. Nothing else to say.",
            "review_date": "2020-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love watching classics on the big screen. Still makes me laugh.",
            "review_date": "2020-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not really much for action movies but I loved this one. Hilarious moments and a great cast. Loved the scenes that where shot in Oregon (Astoria and Cannon Beach) and the special effects are amazing.",
            "review_date": "2020-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely enjoyable despite being fantastical; such a collection of top notch actors in their youth or at the height of fame; amazing effects before CGI",
            "review_date": "2020-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can watch this movie every day! My kids have seen it at least 30 times already lol",
            "review_date": "2020-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie still even 35years later it made me laugh.",
            "review_date": "2020-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just wished they would have kept more of the treasure.",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What else can I say about a classic movie that others haven't said.  It is a delightful romp through childhood.  Beating the bad guys and having fun doing it.",
            "review_date": "2020-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie. It is so good. #Gooniesneversaydie #heyyouguys",
            "review_date": "2020-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brought me back to my teenage years",
            "review_date": "2020-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have loved this movie since I was a kid, have seen it a thousand times. Was great to see it in the Theater",
            "review_date": "2020-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I grew up on 80s movies. I was late to this party though. By the time id seen Goonies, id seen every other 80s  and 90s movie that did everything better than Goonies. I just did not see the amazing chemistry everyone else saw. I thought the movie was boring and lacked any impact. I never formed a bond with the kids. I found them all to be mostly annoying. Stranger things of today did a better job at everything the Goonies did back in the day. I didnt feel that sense of adventure and wonder going through caves and backwater towns.",
            "review_date": "2020-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie, classic!!! ",
            "review_date": "2020-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember seeing this when it first came out. Took my kids to see tonight, this movie never gets old. The HD and big screen makes this movie come to life!! What a great night!",
            "review_date": "2020-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Movie of all time. Thought me life lessons as a child like friendship, resourcefulness, perseverance, and Chunk loves Sloth!",
            "review_date": "2020-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of fun to be back in theaters and this was a perfect movie!  Loved seeing The Goonies on the big screen again.",
            "review_date": "2020-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kids and Family should have an amazing time watching The Goonies it's pure fun adventure comedy film.",
            "review_date": "2020-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even better with age..a great, family friendly movie...",
            "review_date": "2020-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is truly the best movie ever made fun to see it on the big screen",
            "review_date": "2020-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it has aged fairly well, I would like to see where the characters are now.  like a reboot with the kids of the kids in the movie",
            "review_date": "2020-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw it in the theater in 1985, it was awesome to take my daughter to see it in the theater in 2020!",
            "review_date": "2020-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie! Had so many funny scenes!",
            "review_date": "2020-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie and it was so great to see it on the big screen",
            "review_date": "2020-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blast from the past. My kids favorite",
            "review_date": "2020-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was great to take my family to see such a fun classic. The kids loved it.",
            "review_date": "2020-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a classic! Funny and creative and takes you back to the good ole 80’s!",
            "review_date": "2020-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of all time. Since it came out the year I was born I never got to see it in theaters. Im so glad i finally able to enjoy it on the big screen",
            "review_date": "2020-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best 80s movie. Loved seeing it on the big screen!",
            "review_date": "2020-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was cool to be at a theater",
            "review_date": "2020-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We loved seeing the movie on the big screen",
            "review_date": "2020-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Reminded me of being a kid again!",
            "review_date": "2020-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I still like this movie even when I know I can see the movie at home but still glad to see a movie in regal cinema six in key west fl.",
            "review_date": "2020-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true classic, kids loved it.",
            "review_date": "2020-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of all time. ",
            "review_date": "2020-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First time for my son to watch the GOONIES we enjoyed it together..great theater and staff.",
            "review_date": "2020-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorites. Could watch it over and over :)",
            "review_date": "2020-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite childhood movie!!!",
            "review_date": "2020-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was the first time I've ever seen it, and while I really enjoyed it, it certainly didn't live up to the hype for me.  Josh Brolin's arms were really sexy, though.",
            "review_date": "2020-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved seeing the movie on the big screen. Goonies is a long time family favorite.",
            "review_date": "2020-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie. Brings me back to my childhood. The last time I saw it was back in the early to mid 2000s at the restored historical Five Points Theatre in Jacksonville, Florida. It’s one of those old movie theatres where they serve beer and food. The entire experience was amazing.",
            "review_date": "2020-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic adventure movie.",
            "review_date": "2020-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great fun movie... Fun to see it on the big screen again !",
            "review_date": "2020-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing!!! A great throw-back during a tough time in life!",
            "review_date": "2020-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too long. Too much of the same thing for too long!",
            "review_date": "2020-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hey you guys!! Nothing else to say!! Absolutely perfect film; and not just for a middle age nostalgia trip!!",
            "review_date": "2020-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what a joy it was to see this again on the big screen.  Never gets old!!",
            "review_date": "2020-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie as a whole doesn't feel as fun as some of its individual parts.",
            "review_date": "2020-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOVE this movie so much !!  What a treat to see it in the theater again !!",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unless you are a really young boy  there isn't much here.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps not for everyone now, but still a fun classic that should be remembered.",
            "review_date": "2020-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie to see anytime!!!",
            "review_date": "2020-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect filmmaking and a well-crafted teenage journey.",
            "review_date": "2020-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just saw this at Studio Movie Grill when it opened throughout the COVID-19 pandemic, and it was hilarious. This is truly another Steven Spielberg, Michael Kahn, and Kathleen Kennedy masterpiece.",
            "review_date": "2020-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am just sorry that I never saw this as a kid, probably would have liked this even more with the nostalgia.",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a 2 thumbs up it was so good the music is good too",
            "review_date": "2020-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely brilliant movie. Really funny. Great moments. Absolute need to see.",
            "review_date": "2020-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely fantastic to see great movies on the big screen!!!",
            "review_date": "2020-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "we loved the drive in. this reminded me of when i was kid and we went to the movies to see it.",
            "review_date": "2020-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stephen Carty's review states \"If you don't like The Goonies you may be a little dead inside.\" And I think that sums it up pretty well for me, too.",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A one liner filled 80s adventure with amazing set pieces that brings out the adventurous spirit of childhood.",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before he was Samwise Gamgee and Before he was Thanos. Sean Astin and Josh Brolin starred in this classic 80s adventure for the whole family. If you love movies that are about finding treasure then this one is for you. The Goonies are here to stay and will forever be a timeless classic.",
            "review_date": "2020-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie it's a must see to grow and become a better person and friend.\n\nI will show this movie to my kids just to make them understand the importance of adventure, Having fun and Friendship.",
            "review_date": "2020-05-11",
            "source": "rt",
            "lang": "en"
        }
    ]
}