{
    "rating": 7.8,
    "release_date": "1964-12-16",
    "num_reviews": 174,
    "genres": [
        "Drama",
        "Musical",
        "Romance"
    ],
    "summary": "A young woman separated from her lover by war faces a life-altering decision.",
    "reviews": [
        {
            "review_title": "\"I Will Wait for You\"",
            "content": "Maybe not. Les Parapluies de Cherbourg is one of the most beautiful movies ever made with an enchanting and haunting score by Michel Le Grande, and totally focused, sharp and creative direction by Jacques Demy. Catherine Deneuve gives a fine performance in pinkish white makeup with her blonde hair pulled away from her famous face, at twenty playing a seventeen-year-old shopkeeper's daughter who falls in love with a garage mechanic. He is called away to the war in Algeria after making her pregnant. Will she wait for him as the award-winning song proclaims? Will their love endure the long separation?All the dialogue is sung. The script is terse with nothing extraneous to the bittersweet story. Because the dialogue is stripped to the barest essentials, the singing seems natural and enhances the dream-like quality established early with the rain falling on the umbrellas and the cobblestone streets of the seacoast town. The sets are splashed in vivid color. Everything is superficially romantic, but the events are the starkest realism.When a young girl if forced to choose between love and security, which does she choose? It depends on the circumstances, and sometimes circumstances and the passage of time can change her heart.I was a teenager in France when this was made in the sixties. The backdrops of the white Esso gas station, the red and yellow passenger train cars, the bouffant hair styles on the girls, their eyes heavily made up with mascara and black eyeliner, the ubiquitous bicycles and the little French \"cigarette roller\" cars all brought back vivid memories of youth as did the musical score. A question: what ever happened to the \"other\" girl, Ellen Farner who played Madeleine? To be honest I found her more attractive than Deneuve who of course went on to become a great star and an acclaimed international beauty.Farner was never heard from again.Some scenes made more effective by their simplicity: When Genevière (Deneuve) returns home after a late evening with Guy, her mother (Anne Vernon) surveys her daughter and exclaims, \"What have you done?\" Genevière retorts sharply, \"Mama!\" and it is clear what she has done. Also, as Guy is going off to the army Madeleine arrives upon the scene as he is saying good-bye to his stepmother who is ill. They exchange glances that reveal Madeleine's love for him. And then she sings out softly in the heartfelt regret of parting, \"Adieu, Guy.\" We know these are not the last words that will pass between them. Additionally, the brief, beautifully structured, final scene at the shiny new Esso gas station is not to be forgotten.The scenes with Roland Cassard (Marc Michel), the suave, traveling man of means who sells Madame Emery's jewelry so she can pay the taxes on her umbrella shop, are nicely staged so that we can see at a glance that he is enormously taken with Genevière and that the mother will do everything possible to further his case. It is agreeable for those identifying with Genevière that Roland is not only well off financially, but is as handsome as the garage mechanic. But will he still want her when he learns that she is pregnant with another man's child?Jacques Demy who also wrote the script is to be commended for the effortless pace and tight focus of this romantic tale of star crossed lovers. I wish every director had such an ability to cut the extraneous and concentrate on the essentials without intrusion. The tale is an atmospheric tour de force of love lost and gained, of bourgeois values triumphant.This might be a bit precious for some, but upon seeing this for the third time, I can tell you I was enchanted anew.(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
            "review_date": "2003-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just simply the most beautiful romantic film ever made",
            "content": "In 1957 France a 17 year old shop girl (Catherine Deneuve) is in love with a gas station worker (Nino Castelnuovo). Her mother is totally against the romance. He's called off to serve in the war for two years. They must part but have sex before he leaves. Then she discovers she's pregnant...Sounds terrible but it isn't. All the dialogue is sung and the film is done in just breathtaking color--all the sets are decorated to take advantage of this. The colors just leap out at you and some of the scenes are unbelievably beautiful. The musical score is haunting and Deneuve (who became known by this film) and Castelnuovo make a very attractive, sympathetic couple.The film is just gorgeous--I can't stress enough how beautiful it is and the music (especially the title theme) is so moving. It all leads up to a finale that has me crying every single time I see it. It IS a happy ending (sort of) but the emotions of the two characters really tear you apart.The acting is good, the film moves quickly (90 minutes) and--quite simply--this is one of the best foreign films ever made. It's not for everybody but if you're a romantic (like me) you'll love it. But be warned--have PLENTY of tissue handy for the end. I've seen it four times and I STILL cry at the end! A definite must see. A 10+.",
            "review_date": "2005-09-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If cotton candy were a movie...",
            "content": "A very French, very idiosyncratic musical that while lacking any discernible 'songs' or dance routines manages to be one of the most affecting musicals ever written. Remy says he was inspired by American musicals, and yet a more non-American could hardly be imagined. Can we really pretend that an American studio in 1963 would endorse the story of pre-marital sex and the romance of marrying a 17-year old girl pregnant with another man's child and not feel the need to moralize or condemn? Only in France, and thank God for it. All the cast are brilliant - charming and charismatic; the production design looks like a psychedelic gingerbread house; the score is exceptional; the singing genuinely heart-felt and moving; and the whole thing is carried off with such effortless confidence and unreserved joy that it's impossible not to fall in love with it.",
            "review_date": "2006-06-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I can't believed how much I loved this film",
            "content": "I still can't believe that I LOVED a film in which EVERY line of dialog was sung by the actors! When I first heard about this, I was VERY hesitant to watch, but decided to give it a shot. After all, I really like French films.The story concerns the love between a young girl and her slightly older boyfriend who is called up for military service. Can their love survive the many obstacles in its way? --Other than that, I'd rather not reveal the plot or the twists, as I'd hate to spoil it for the reader.Suffice to say, this is an absolutely beautiful film throughout--especially the incredible cinematography. So beautiful and engaging that I found myself in tears as the movie concluded--and the ending is one of my favorites in film history. This says a lot, as I don't usually find myself so affected by movies. Have some Kleenex handy!",
            "review_date": "2005-03-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It makes my heart ache just to think about it...",
            "content": "Some things are so wonderful you can't quite believe they exist. A technicolour heaven with a young Catherine Deneuve at her most beguiling and beautiful in a film that's entirely sung in the most exquisite way? Pinch me, I still can't get over the fact this film exists.Everyone has a film they return to when they're feeling jaded, sick of Hollywood or simply because it's raining outside. I have two films I turn to at these times. One is Singin' in the Rain; the other is this little gem. Both transport me to a world of colour, joy and heartache, yet both stay just the right side of sentimental too.Of course the plot is a little convoluted; of course the entirely sung script makes it a little jarring at first - but just sit back and let Les Parapluies do its magic. You won't regret it. I promise ;-)",
            "review_date": "2003-09-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bold Series of Uninterrupted Recitatives Constitute Demy's Brightly Colored But Sad Love Story",
            "content": "In 1964, filmmaker Jacques Demy made an audacious move by directing a deceptively simple love story completely in song. I would be hard pressed to call this movie a musical, opera or even an operetta since there are neither show-stopping production numbers nor soul-bearing arias on the soundtrack. Instead, we are presented everyday dialogue in a series of recitatives that bring a dramatic urgency to the most mundane of events. Why it works is that the story is not the happy-go-lucky romance one would suspect it will be from the bright colors of the production but rather a melancholy tale of love unfulfilled and the tenuousness of longing in the face of harsh realities. It is a Gallic version of \"Romeo and Juliet\" by way of William Inge's tale of teenage lust, \"Splendor in the Grass\" (in fact, Demy's ending bears a striking resemblance to the last scenes of Elia Kazan's film three years earlier).The plot focuses on teen-aged star-crossed lovers Genevieve and Guy, who develop a relationship through clandestine meetings despite the disapproval of Genevieve's mother, who thinks a gas station mechanic is beneath her daughter. The lovers eventually consummate their relationship once Guy finds he has been drafted to serve for France during the Algerian conflict. With Guy away, Genevieve discovers she is pregnant and must decide whether to wait for Guy's uncertain return or marry the rich diamond dealer, Roland Cassard, her mother's preference given the failing business of her umbrella shop. The story develops in subtle strokes almost like a Yasujiro Ozu film in that there aren't really any melodramatic confrontation scenes but instead moments of revelation. The wondrous Catherine Deneuve, all of twenty, had her first important role as Genevieve, and it's no wonder her career seems assured from her ethereal performance. With his earthy good looks and open-hearted manner, Nino Castelnuovo complements Deneuve as Guy, and their romance is palpable even in an amusingly contrived shot where they are obviously on a conveyor belt moving down the street. Anne Vernon lends a robust presence as Genevieve's mother as she plots her daughter's fate, and Marc Michel is appropriately bland as Roland.Along with the vibrant colors faithfully recaptured in a 1996 restoration, such artifices really add to the film's charm. However, just as essential is Michel Legrand's score with his swooning romanticism at its most cinematic (and a precursor to the music he composed for Barbra Streisand's 1983 \"Yentl\"), as it fills the dramatic arcs from start to finish. You will likely recognize the lounge standard melodies for the Americanized translations, \"I Will Wait for You\" and \"Watch What Happens\", as they are pervasive through the recitatives. I enjoyed the movie very much but realize this will not be everyone's cup of tea, especially those already alienated by the musical genre. One can see this as an even more exaggerated form, but you can probably tell by the first two minutes whether you will be enraptured by it. The DVD also includes an excerpt from Demy's widow Agnes Varda's illuminating 1995 documentary, \"The World of Jacques Demy\".",
            "review_date": "2005-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Most unfortunate if you can't bear singing in movies.",
            "content": "1. Coloring, that is absolutely matchless 2. Even the first notes of the main theme make you cry 3. Unique way of singing in a musical 4. One of the most touching love stories 5. Beautiful Catherine Deneuve 6. It's not American 7. Made in the sixties 8. You can watch it over and over again 9. Since you've once seen it.. you must watch it over and over again 10. Esso-sceneTen more or less good reasons why this just might be the one.. the favorite movie of mine. I partly understand people who hate it, the singing is the main reason i think. But the unique way of singing! Not in the traditional way this is a musical, people just happen to sing when they talk. And the music (especially main theme) is so hauntingly beautiful it really does make you want to cry when you hear the first notes.The coloring is like in no other film. The clothing and background have been matched in every single scene of the movie. That's real cinema, that's beautiful! And if that's beautiful already, then what comes when the 20-year old Catherine Deneuve is in the lead role! Just WOW! Once again I don't bother explaining any of the plot, because there's no point really...but one of the saddest scenes in movie history, is the Esso-scene in this one. Watch it! if you're not too busy watching the latest Van-Damme.",
            "review_date": "2006-06-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "9/10",
            "content": "The first of the three segments is perhaps the sunniest film ever made. It's a totally original film (at least from what I've seen); so original, in fact, that at first it's kind of off-putting -- the artificiality of the bubble gum colors (in the first segment, as they change slightly as each moves into the next), the constantly moving camera, and the fact that all of the lines are sung makes it hard to get situated within the film, for the same reason that you turn the car radio down when you're driving down a street trying to read house numbers. (\"I can't follow the plot, they keep singing...\") And yet Demy isn't satisfied with just being sunny (and his brightness is never garish); each segment has a specific feel, the grandest being the last, with an ending that's just right. (Though it should be said that Demy never once sacrifices the pleasure he creates, nor does he fall into any stale conventions, even while his story is based on the oldest of movie clichés -- wait for me!).I hesitate to use the word melodrama, but that's essentially what the film is, both for the meaning of the word \"melo\" (music) and for the heightened emotions brought on my the music. It feels like we've got our head in the clouds, not least of all because the acting is aided by, well, the singing. The music, which is nearly always splendid (and never song-and-dancey), compliments the actors. At first the acting is very plain; or at least, it seems that way. I think that's due to the unconventional approach. Deneuve's loveliness as a young woman keeps us from responding to much aside from her beauty (and she starts off as a typical love-struck sixteen year-old), but by the end she's quite a different person, and to overuse a term applied to Deneuve, she becomes elegant. (I kept looking at her handsome costar thinking Alain Delon would have been perfect in the role; then I learned his most noteworthy film aside from this one was the Delon-starring Visconti film, \"Rocco and His Brothers.) Surely some people would probably vomit at a film of such shameless exhibitionism and style, but I was left astonished, thinking, How in the hell did they pull it off? 9/10",
            "review_date": "2005-01-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Toto, I've a feeling we're not in Kansas anymore.",
            "content": "A glorious film just a few things to add to what everyone else has said[NB SPOILERS towards the bottom of the page - not that the plot is exactly a suspense]It's a \"realistic\" story on the face of it. The whole thing is reminiscent of the \"verismo\" Italian operas from the end of the 19th century, like Cavalleria Rusticana, where soap-opera plots about ordinary people are set to emotionally stunning over-the-top drama-queen music - inherently a democratic kind of style, saying that shopworkers and little old ladies have as much right to passion and glory as kings or gangsters or movie stars.Yes, the singing is silly. But the film knows this - in the very first scene the men in the washroom joke about \"Carmen\" (another example of the same style) and one of them sings something like \"I'm going to see a film, I don't like Opera, I can't stand all the singing\". Its a film that *knows* mechanics don't (usually) sing arias while they check the oil, and makes a joke about it. Buffy fans will have got the same point from \"Once more with feeling\" - the Fundamental Problem of the Musical is: \"why is everybody singing?\"But there is something unrealistic about it, the beauty. Everyone and everything is good-looking. The people are beautiful. The dirty old town is beautiful. Cheap bars are beautiful. Squalid damp flats are beautiful. Abandoned hulk ships are beautiful. A garage forecourt with petrol pumps and a canopy is beautiful. All the men are good-looking. And as for the women - someone asked why more men than women like this weepy film. The obvious answer is Catherine Deneuve. But Anne Vernon playing her mother is cuter than anyone her age has a right to be. And as for Ellen Farner... Guy has not one but two stupendously attractive women after him, which is about 1.99 more than the average member of the audience.The costumes match the background far too often for it to be anything but deliberate. At first its even more confusing than the singing. Madame Emery dresses differently to match the wallpaper of the shop and her flat, sometimes her clothes even seem to change colour for no reason other than to match the scenery. Genevieve stands in front of a window while a truck that's exactly the same shade as her cardigan pulls up behind her. When she tries on her maternity dress it has the same combination of royal blue background and pink flowers as the wallpaper behind her. When she walks past the docks with Roland they are both wearing different shades of off-white - hers matches the rusting paint on the old ships, his matches the cliffs visible in the distance. When Guy and Madeleine sit next to each other outside the cafe her orange-brown clothes and even her lipstick match the door behind her while his dark brown jacket matches not only the wood behind him but also her hair - exactly the same trick we've seen when he was sitting next to the prostitute Jenny with her red dress on front of the red screen inside the other bar. We are in fantasy land here, even if it looks a little like Cherbourg. but this is all the same as the singing. To ask \"how does a poor family afford such clothes?\" or \"why is the delivery van exactly that shade of yellow?\" is to miss the point as much as to ask \"why does a shopkeeper sing to his customers?\" or \"why does it always rain when we say goodbye?\". In this movie, in this fantasy land, the world is turned upside down, the meek can inherit the earth (or at least look as if they might), small-town Cherbourg is as romantic as Paris, sailors and truck-drivers sing while they work, the poor wear clothes that money can't buy, the scenery changes colour to match your wardrobe, every man looks like a leading man, and every shop-girl truly is as beautiful as any duchess. This is \"Singing in the Rain\" set in the backroom of a shop instead of the back lot of a Hollywood studio, this is \"West Side Story\" without the violence, this is a small-town \"Moulin Rouge\", this is \"Brief Encounter\" on acid.It's not a tragic ending, any more than the endings of Casablanca or Brief Encounter are tragic. It's the right ending. We're not so much sad for Genevieve - even though we are crying - as we are happy for Roland (who deserves a break. Even though we know he's probably a crook) If we are crying its because Guy needs to hug Francoise. We expect that the marriages will work out in the end - maybe they have worked out already. If these people are not going to be happy its not because they married the wrong partners. and what other film has had hundreds of thousands of viewers in floods of tears watching an aerial shot of an Esso service station?",
            "review_date": "2004-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pure romance with a beautiful score",
            "content": "I saw this movie in 1964 when I was 11 years old.  It was my introduction to heartbreaking love and this movie probably influenced my love life or how I imagined love was supposed to be.  My mother had to lead me from the theatre when it was over because I was blinded with tears.  Many years passed until I was able to order the film in VHS and watch it again (about 3 years ago). I still love it.  The vivid colors, Genevieve and Guy's beauty and youth, and the beautiful score by Michele LeGrande combine to transport you to a magical place.   I loved the fact that every word was sung, but it was not like opera at all.  After a few minutes it was as if every word is always sung and talking doesn't exist.  Catherine Deneuve was so beautiful!  I love this movie and highly recommend it.",
            "review_date": "2003-10-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautifully sad; a must-see! (SPOILER)",
            "content": "I heard so much about this film but missed seeing it in 1964 during its first release simply because it was never shown here. I finally got to see it 40 years after its debut and it remains as fresh and enchanting as I imagined it to be. The film is quite heartbreaking because Genevieve (Catherine Deneuve) did not persevere in her love for Guy. I can only imagine what pain Guy had to bear facing war in Algeria knowing his fiancée back home was pregnant with his child and he couldn't do anything about it. The blaze of colors in the movie was a contrast to the somber atmosphere of infidelity and lost love. I suppose they both had fairly good marriages but we can gleam that they did not reach the pinnacle of joy and had to settle for second best in the end. It sort of reminded me of Elia Kazan's \"Splendor in the Grass\"--Warren Beatty's character and Natalie Wood's character--they did not \"live happily ever after\"--they just settled for second best. It is very clear that Genevieve continued to carry the memory of her lost love--otherwise she would not have made the detour to Cherbourg and meet Guy \"accidentally\"...It was such a heartbreaking scene--they meet each other after many many years and they have named their children with the same name--the name they planned to give their first-born as they made their future plans together before he leaves for his army stint. I wonder, would it still be as beautiful if it ended happily? In any case, it is one of the most unforgettable films I have ever seen. Try to get hold of the DVD copy for your collection. :-)",
            "review_date": "2004-09-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A bittersweet and sad film operetta without spoken dialog well made by Jacques Demy",
            "content": "A young woman called Genevieve, Catherine Deneuve, is the teenaged daughter of a widow, Anne Vernon, who owns an umbrella shop at the little town of Cherbourg, France . Then Genevieve is separared from her fiance' , Nino Castelnuovo, by Algeria war and during a long time she faces off dificulties and loneliness in her new situation. When her former lover goes back they are several surprises . But when they meet once again will their love be rekindled?. A film for all the young lovers of the wide , wide world...A Valentine for All the Young Lovers of the World , in Song and Color .Pretty good musical movie considered to be a classic French movie , set in Cherbourg where the famous Umbrella Shop still exists at 13 Rue Da Port . Wonderfully evocative musical score and glamorous cinematography enhance the story . It is well set for 1957 to 1963 in Cherbourg, actual town that Jacques Demy took over for shooting . The exciting tale deals with a bittersweet and downbeat romance in which a beautiful girl falls really in love for her equally young boyfriend but both of whom are separated by his military duty in Algeria. It is divided in three parts : Depart, Absence and Le Retour. The picture is very well starred by Catherine Deneuve as the abandoned young woman who is expecting, Nino Castelnuovo as her garage mechanic lover , Marc Michel as the wealthy Roland and Ann Vernon as unfortunate but stubborn widow. This candy-colored fantasy drama to be watched in French language with subtitles, though is also available dubbed in English, but being inappropriate, no having the same effectiveness . It is followed by a similar film : \"The young girls of Rochefort\" by Jacques Demy with Catherine Deneuve, her real life sister Francois Dorleac , who a bit later on she died by car crash , George Chakiris, and Gene Kelly. It contains a colorfully brilliant cinematography by cameraman Jean Rabier, the gorgeous photography influenced really on subsequent French films , along with a marvellous soundtrack by Michael Legrand.The motion picture was original and competently directed by Jacques Demy. It won Gold Palm in Cannes Festival and Oscar nominated to best foreign film. Demy was a good French director who made all kinds of genres and getting successes in Musical ones . His first big hit was Lola . Shooting nice films as The seven deadly sins , Bay of Angels , Peau D'Ana, Una chambre en ville, A slightly pregnant man, Lady Oscar, The pied piper, Donkey skin, Parking and \"The young girls of Rochefort\" that is Demy's followup to Umbrellas of Cherbourg , it is equally an atractive and charming musical in similar style . And a TV series : Louisiana. Rating 7/10. Better than average. Well worth seeing.",
            "review_date": "2019-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "cinema",
            "content": "Always I considered this film as brilliant example of real cinema. for reasons escaping from the skin of words. for a special form of beauty. for the courage of director. for performances and colors and story. and, yes, especially for music. it seems be a musical. but it is so different by one ! for a sort of...magic. who remains in your memory. who determes you to see it time by time. and for the great emotion defining it as a n experience. it is real cinema example because it is not entertainment. it is not refuge for blockbuster pieces. it is not a demonstration. it is not a show. it could be a confession. about love, life, Cherbourg, umbrellas shop and compromises. in the most delicate and precise manner. a film who remains the best answer when, for understand the life, need, for 90 minutes, escape from it. a gem, maybe. or just the real cinema.",
            "review_date": "2018-05-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An offbeat but beautifully stylised and colourful piece of cinema",
            "content": "This must be amongst the most distinctive, idiosyncratic and exquisite films I have seen in a long while. There is nothing particularly new about the plot, which is a straightforward and uncomplicated love story divided into three acts, but the beauty of this film is in the telling of it.All the dialogue in this film is sung, which at first is a little unsettling, but it actually takes very little time to adjust to. The verse/chorus format of popular music and the musical genre is eschewed for an approach more resembling a modern opera, as the characters croon their lines to each other over a continuous score. This gives the most banal of lines a rhythm and cadence of their own. Because of this I found the French a lot easier to understand than with more naturalistic films, which was fairly handy for me as the print I was watching was with Dutch subtitles! I must confess, I did find that the music (written by Michel Legrand) began to grate towards the end of the 87 minute running time but even so there is still much to admire here. Visually it's stunning, with a bold and vibrant colour palette of almost hallucinogenic intensity and sumptuous costume and set design (that wallpaper!). The opening credit sequence sets the mood perfectly: a birds eye view of the inhabitants of Cherbourg in the rain beneath their umbrellas as they walk across the frame is reduced to a colourful abstraction. Catherine Deneuve is predictably gorgeous and the first act of the young couples courtship is one of the most beautifully pure pieces of cinema I can think of. It reminded me a bit of 'Jacques Brel is Alive and Well and Living in Paris', a film which I saw in television a long time ago and would do absolutely anything to get hold of a copy. 'Les Parapluies de Cherbourg' is a wonderful, sincere and uplifting film that everyone should go and see at least once, and preferably on a big screen. Once seen, never forgotten.",
            "review_date": "1999-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pretty charming musical with some really great moments in-between",
            "content": "\"Les parapluies de Cherbourg\" or \"The umbrellas of Cherbourg\" is a French/West German co-production from 1964, so this one already has its 55th anniversary, which shows you how old it is. However, despite the film's age many of the people (especially actors) working on it are still alive today. This also includes the actress who played the female protagonist's mother. But first things first. The director is Jacques Demy and he also wrote the spoken/sung words and the exact plot. You can say that for him, but also many other cast and crew members, this is the defining work of their career. It is a pretty famous film. Best example is that Chazelle stated this film the main inspiration for \"La La Land\". Well, this one here may not have reached the same awards recognition like La La Land, but it sure was a big success as well and it sure is not too usual for a French film to scored no less than 5 Oscar nominations, even if it did not win a single one eventually. But also it was Oscar--nominated in two different years, which is quite an interesting achievement. It got Demy no less than three nominations and same is true for Michel Legrand, whose music truly made an impact here. And I can see why. The story was okay for sure too, but the music was the overall highlight without a doubt. Some good songs and a great soundtrack with a marvellous main theme that can be heard on several occasions and it is kinda sad, yet epic and positive at the same time I would say. It may sound a bit like fanboying, but no it really is that good and it would have been nice to see this film win an Oscar in one of the categories where Legrand and Demy were both nominated preferrably.Now as for the cast. The defining name here is of course Catherine Deneuve and she is very famous to this day unlike all her other cast members you could say. It is the story of a young woman (17 in the movie, 20 in real) who falls for a young man and gets pregnant, but before she tells him he has to leave for the army. No war or anything, there is no plot about life and death, even if one early quote made me think maybe there could be like when it was how people in certain situations only die in movies with the film making a bit fun of itself. It os pretty light frequently, but overall still a drama for the most part. Don't be confused because everybody is singing here. It's lifechanging stuff going on on many occasions. Take the male protagonist's mother for example and her ailing health. I also thought she was my favorite singer from the cast, but that is entirely subjective and everybody probably has somebody else he really likes there. I did think though that the supporting actors were usually better singers than the two in the center of the movie. But they obviously also had to do more acting, soo it's understandable they had to take other factors into account during casting. The singing only felt a bit strange early on I would say. You get used to it quickly that all the spoken language is presented via music this way, an approach that could have been pretty cringeworthy without a doubt if not executed properly, but the professional approach they took in here was just working out really well from beginning to end of this not too long 1.5-hour film. Another parallel I found interesting was how the male protagonist leaves great weather, hugging the one he loves, she constantly singing je t'aime, but when he returns, it's raining, he is alone, no joyful melodies and she is married to another man. And he finds somebody new too eventually. I actually had a feeling with the focus being on him then in the last chapter.. oh wait there are 3 chapters I must add that, the first with the two being together, the second her being alone and the final chapter what happens when he returns. So yeah, in this last chapter it would have been an unusually interesting idea to just leave her out completely. We find out she gave in to her mother's attempts to have her marry the rich guy (funny somehow how they keep singing his full name), she even moved to another city, so chances were there they would never see each other again. But eventually they do, a bit of coincidence, maybe not entirely and we have them reunite at a gas stop. Will they get the typical Hollywood ending of getting together again? Nope, Demy instead took the far more realistic approach of how things turned out and I really loved it. It was certainly among the best parts of the film what happens when the two let each other go again, he does not want to see his child, she leads a wealthy life now and they just are too different at that point. The camera moves away as we see him with his new family and we hear the beautiful soundtrack. Now that was amazing, also not everybody may see it like that, but i would definitely say it is a happy ending. I mean nobody is unhappy right? Ellen Farner is really stunning too, so certainly no loss for the male protagonist that he got her and not the mesmerizing Deneuve (I am saying this as somebody who is usually more into dark-haired girls, so it means something). Shame Farner's career was so short-lived, but at least she is still alive and hopefully having a sweet time in her senior years. Okay that is pretty much all I have to say about this movie. I think it is really worth watching and if you like musicals, then definitely give it a go. It is in color, which makes it feel a bit more modern than mid-60s. You should not expect too much comedy, even if here and there there is a bit of a moment like the mailman running gag or also the one moment when asked about her pregnancy and how it happened by her mother, the female main character answers just like it happened for everybody else with a smirky smile. Sure it is a film that wants to be taken seriously, but the good thing is it has the right to quality-wise and still in-between it offers nice little distractions from time to time, also the very first scene really with the guys at work. All in all, no hesitation for me to give this a thumbs-up. See it with your loved one.",
            "review_date": "2019-07-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Haunting Love Story",
            "content": "This film rises above the novelty of all the dialogue being sung. Not operatic, just sung. This is the sad story of two people who are driven apart by circumstances. The result of one night is a child. Forces beyond their control get in the way and they must take other directions. This has some of the most beautiful scenes in it. It is the true love story without a lot of contrivances and the haunting factor of the beautiful interaction of the two leads later in life. Catherine Deneuve is startlingly beautiful and she dominates the screen whenever she is on it. Gorgeous. Lovely landscapes in the French countryside. A feast for the senses.",
            "review_date": "2016-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Tears of Cherbourg...",
            "content": "Jacques Demy's \"The Umbrellas of Cherbourg\", Golden Palm winner of 1964, is a deliberately simple and straight-forward story sublimated by the music, I guess that's a way to put it simply.Still, I was never in a rush to watch this film, forgive my bias but the premise of one hour and half of all-singing made me expect some syrupy nothing-specialness à la \"New Wave\" sauce that I couldn't take seriously. I thought I would endure the film more than experience it. And to be fair, it's hard to get used to the all singing 'gimmick' (for lack of a better word) at first and the opening make you wonder if it's not unconsciously intended as a sort of spoof but the film finds a way to set its tone, making the singing a sort of natural background, allowing you to focus more on the story.First, there are the first notes of Michel Legrand's penetrative score (the \"I Will Wait For You\" theme) that started to resonate during the opening credits. I knew I heard that tune before and then it hit me, \"Jurassic Bark\", poor Seymour waiting for Fry... \"I Will Wait For You\", one of the saddest melodies ever, that was meant to be used for the saddest TV moment ever. Now, knowing that it came from Michel Legrand and that it would be the defining theme of the film made me realize that in terms of emotions, \"The Umbrellas of Cherbourg\" 'meant business', and within the right context and served by the right lyrics, the score reached unsuspected levels of poignancy.Secondly, when the film starts in a jazzy upbeat mood, there's an exchange between Guy, the mechanic played by Nino Castelnuovo and his friend about their plans for Friday night. The friend says he doesn't like operas, all the singing gets on his nerves, he prefers movies. What can you say after that? Such a line so early in the film can't be innocent, this is Jacques Demy's anticipating the natural resistance of some viewers, toward what can be perceived as a gimmick. Demy basically tells us that even movies can work like operas and that maybe this film can help us to consider singing as a language as adequate to film-making as facial expressions in a silent movie.In fact, it's not exactly singing buy lip-syncing with other professional singer's voices (which is a wise choice because I can't imagine these melodies with amateur singers) but progressively, the musicality becomes such a natural aspect of the movie that any line said without any melodic intonation surprisingly rings false. The music becomes part of the background, and in total osmosis with the art-direction, the costumes, the photography. If you pay attention to the way some women's dresses always fit the patterns or colors behind, you're tempted to interpret that as a foreshadowing of their chameleonic nature, their superhuman capability to adapt to any situation or predicament in their lives.The visual delights also lay on the depiction of Cherbourg which, depending on the season, the weather or the general mood, can be either cheerful or depressing. One day, the two lovers dance a mambo behind the red walls of a nightclub, it's red, passionate, lively, and the day after, they're in a depressing and neutrally grey train station saying goodbye to each other. Even a cute and cozy little umbrella shop can become a cold and depressing washing-machines' stores. The film is as competent in conveying emotions through visual than musical delights, but the raw core is still the romance between Guy and Geneviève played by a beautiful and young Catherine Deneuve, without it, this would have been one of these 'all flash and no substance' film. (Spoilers in Next Paragraph)The story isn't a revolution, two young enamored people make plans for the future then comes the call of duty, they have one last night together, promise to wait for each other ignoring that the \"harm is done\" already and then there's the absence, the separation, and throughout her pregnancy, Geneviève is courted by a providential rich man named Roland Cassard (Marc Michel) which she finally marries, so her baby can have a father. When he's back, Guy is wounded physically before being hurt emotionally, he sinks in bitterness and alcohol before being rescued by his friend Madeleine, they marry and have a child. Finally, a few years after, the former lovers meet in an Esso station and the film concludes with the right notes of realism, foreshadowed by Genevieve's mother (Anne Vernon) who said that times fix everything and only in movies, people die from love. If I wasn't so emotionally overwhelmed by that ending and how daring it was to contradict the then-romantic tropes, I would have kept thinking of a certain movie that almost won Best Picture last year. I just wish I saw Demy's \"Umbrellas\" before Damien Chazelle's \"La La Land\". Now I know where he got the inspiration, it's all to his credit to revive the magic of this classic for a contemporary tale, but now I see the ending less as a masterstroke of originality than a well made homage to Jacques Demy. The last time I had a similar regret is when I discovered Fellini after Kusturica's \"Undeground\", another Golden Palm winner.So, what I loved about \"The Umbrellas of Cherboug\" is how misleading it actually is, these jazzy musical interludes, the playful way characters recite their lines by singing, you wouldn't believe this film would be so dark and so realistically bold, dealing with pregnancy, financial problems, not much war traumas than the disillusion of homecoming soldiers and of course, broken hearts. It's like a strawberry-flavor candy with a lemon bittersweet taste in the end. The film is well-made, well-edited, and well-written. Of course, the singing can get on people's heads but hey, the film is one hour and twenty something minutes long, it's not too much patience demanding.And the final minutes will reward your patience anyway, listening to it, I know why Michel's name is Legrand.",
            "review_date": "2018-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful, colourful musical",
            "content": "'Les Parapluies de Cherbourg/The Umbrellas of Cherbourg' is one of those musicals which shouldn't really work, but does. It lacks big song and dance numbers (the only song which has really gone into the public consciousness is the one known in English as 'I Will Wait For You'), but nevertheless, Michel Legrand's score is addictive and effective.In Jacques Demy's film everything, even the most dull and ordinary of settings, bursts with life and colour. The film boasts one of the most beautiful colour palettes ever seen on the screen, right from the opening scene of umbrellas in primary colours rushed by anonymous people through a rainstorm.And the film has the young Catherine Deneuve. She is of course as luminous and colourful as her surroundings. As Genevieve, her love affair with Guy represents the first part of the the film, the second and third parts following each of them exclusively. The film says that life choices can't always be what we want, and mistakes have to be made. It is a bittersweet message which means that this film is no fairytale.",
            "review_date": "2008-04-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Changing The Wallpaper",
            "content": "Absolutely wonderful French musical featuring twenty-year old Catherine Denevue singing every word of dialogue along with a cast of well-known (at the time) French actors. The production is opera as only the French knew how to do it. The tale is from old Europe -- love, betrayal, remorse but cast against the last years of France's Algerian crisis. The music, well it starts to sound like side 2 of a Sergio Mendes & Brasil '66 record after awhile, nevertheless it does catch your attention and makes you focus on the story. A truly unique movie-going experience, \"Umbrellas\" is sure to entertain from its giddy start to its surprisingly poignant end. Find it!",
            "review_date": "2005-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of my favourites",
            "content": "I love musical films and movies with romance, so The Umbrellas of Cherbourg when I first saw it a year ago was more than ideal. I loved it then, and since then I've seen it many times and find something new to love about it each time. It is such a beautiful movie, in the gorgeous music- one of my favourite movie musical scores actually-, the colourful visuals, the charming and touching(if slightly convoluted occasionally)story and Catherine Deneuve at her most irresistible. And it is also a unique one, not only in the sparkling sung dialogue but in how it's sung too, it always surprises me at how interesting the singing is and how the singing is done. The cast are uniformly excellent, though it is Deneuve that makes The Umbrellas of Cherbourg so good, the film moves quickly and the direction is sharp. All in all, a real bon-bon of a movie. 10/10 Bethany Cox",
            "review_date": "2011-09-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Touching",
            "content": "Such a touching love story, one that's both sad and joyful at the same time. Just as a warning, it may leave you tingly at the end and humming the main song \"I Will Wait for You\" for days. All of the dialogue being sung seemed a little gimmicky early on, but it ultimately works, giving the film a lightness and charm. The acting isn't affected by it either and is solid throughout; look for Catherine Deneuve in the scenes where she truly looks distraught. Director Jacques Demy hits us with bright, bold colors in scene after scene, and the sets seem artificial but dreamlike. He also captures some really nice images amidst all that visual pop. When the young woman (Deneuve) and her mother (Anne Vernon) are wondering if her lover (Nino Castelnuovo) is in danger fighting in Algiers, we see joyous street partying outside during Carnival, and I liked how subtly he did this. My favorite though was the shot at the gas station, with him in the background, out of focus, but clearly staring at her, which was just wonderful. The film hits us emotionally by reminding us of young love and those big moments that may send us down a very different set of tracks in life. There is a sadness in thinking what might have been, but also a resilience and strength in moving forward, which really hit home.",
            "review_date": "2019-07-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Like eating a bowl of rainbow sherbet",
            "content": "The Umbrellas of Cherbourg is like a bowl of rainbow sherbet. It's bright, it's colorful and it's almost impossible to dislike. However, this movie isn't all sugary sweet-there's an unexpected tartness to it that makes it stand out among romantic musicals. Ice cream similes aside, this film is simply impressive. From the costumes to the set design to the music, it's a memorable work of art.",
            "review_date": "2018-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very bright movie visually but not with a standard happy story in it.",
            "content": "This movie was actually quite a surprise. I had liked Jacques Demy movies in the past so I had no doubt about it that I would like this movie as well but what I didn't expected was that this was an actual musical. Something that Jacques Demy had never done before.And not just any musical; this movie has only sung dialog in it. It's a non-stop musical, in which even everyday lines like 'hello' and 'is the tea ready' get sung. This was something i really had to get used to and to be frank, I also didn't really liked watching the movie at first and probably also wouldn't had liked it by the end (at least not as much as everyone else seems to), were it not for its story.Of course it has a sweet romantic story in it but what I especially like about it is that it really isn't a standard formulaic one. Even though the movie looks very bright and cheerful, the story is actually quite dramatic and also doesn't progresses in a way that you would expect from a romantic musical. You expect the two main characters to remain together, no matter what all of the obstacles are and what people opposing them throw in their way. But the movie really doesn't pick a standard approach and also lets its characters do some unexpected things, which all really makes this movie original and also really unique of its sort.Once you really start thinking about it and start analyzing the movie you'll notice how big the contrast actually is between the movie its look and atmosphere and its actual story. But somehow these two completely opposing things strengthen each other and make the movie work on all kinds of different levels. It works as a charming and happy, harmless movie, as well as a more dramatic and heartfelt one.But it remain mostly the visuals of the movie that stick with people. It's an incredibly bright movie, using deliberately bright colors for mostly the movie its backgrounds. And yes, the movie is visually impressive to look at and features some nice camera-work as well. It just only seems to make people forget what a great story \"Les parapluies de Cherbourg\" actually does has in it.Just stick with it, even if you don't like it at first. Chances are you really end up loving it by the end!8/10 http://bobafett1138.blogspot.com/",
            "review_date": "2011-09-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful french musical",
            "content": "... with the little unusual touch that each and every line in the entire movie are sung. Indeed, there is music throughout the entire movie.The story is a little melancholical, a loving young couple separated when the boy is sent away on a long military service. They do promise each other fidelity and that they will wait for each other (one of the recurring musical theme were later made into the song \"I will wait for you\"). It is rather quickly evident that they won't and the movie shows the heartache they both suffer because of it. Refreshingly there are no bad guys, it is just life that happens to them... unfortunately it is not hard to rather early know how the movie will end, but it is not the twists of the movie you watch this. It is the feelings, emotions and how it is portrayed in song that makes the movie really good.It is a interesting, peculiar movie. In addition to the music there is an interesting use of colour, with characters sometimes almost blending into the surroundings.Not the most spectacular movie that I wish to see over and over again, but definitely fun to have seen once.",
            "review_date": "2019-02-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bittersweet brilliance",
            "content": "Pure cinematic joy - and that's just on a 32\" TV. I would love to see this on the big screen.Let yourself be transported by the beautiful images and music. This film is life-affirming and moving, without ever resorting to over-sentimentality. I keep hearing the main theme tune in my head and welling up inside. A haunting and beautiful experience.*** Spoilers follow *** Guy's decision to forego an embrace with the daughter he has never seen has to be one of the most moving moments in film. It is this, rather than meeting his ex-love once more that is heart-breaking. At the same time, it indicates that Guy is the one to have truly moved on and probably ended up with the right partner too. The moment his wife and son return outside the garage is equally moving. The end is therefore uplifting and brutally crushing at the same time. Bittersweet brilliance.",
            "review_date": "2007-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pretty",
            "content": "I guess my memory colored this. I remembered it fondly, and pulled it recently as something to watch to warm the heart here.I wanted a movie that wasn't much work, that would come to me, sugared and served. That's what I got, but I recall some nourishment from the past that seems to have seeped out of it. The anti-war message seemed strong enough at the time, but that was before the bloody lies of Vietnam, and the thing just doesn't register now. The edge is so soft it becomes a pretty protest, a decoration on history.Another French notion that fades.But there is one lovely and powerful cinematic technique here. It begins with the notion that humans create their environment. Here, it is a matter of the key people in this literally coloring the surface behind them. The last time I saw this as effectively was Emma Thompson's \"Nanny McPhee.\"Ted's Evaluation -- 2 of 3: Has some interesting elements.",
            "review_date": "2006-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hello Brolly",
            "content": "Okay, here's a superficial smart-ass take on this entry: We're in a French port, there's a guy who loves a gal and a gal who loves him right back, arguably she loves him just a tad more than he loves her. He goes away for a couple of years but not without leaving her pregnant. There's an older guy, richer guy in love with her for whom until now she had no time. She levels about her situation and he marries her anyway and raises the child as his own. Now, hands up all those who said 'That's \"Marius\" by Marcel Pagnol, the first part of his great trilogy'. While you're wiping the egg off your faces I'll try a less frivolous take. IF Pagnol had been born in the North instead of the South of France it's just feasible that he may have written a story set in the Northern French port of Cherbourg, called his male protagonist Guy and not Marius, had him conscripted into the army for his obligatory two years National Service spent in Algeria and called his female protagonist Genvieve instead of Fanny. Jacques Demy may well have had Marius in mind albeit subconsciously when he wrote and directed The Umbrellas Of Cherbourg - and it was, incidentally, just about the same time that Harold Rome wrote the words and music for a condensed and musical version of Pagnol's trilogy which, as 'Fanny' was produced on Broadway by David Merrick - but nobody creates in a vacuum and Demy has come up with a charming, not to say enchanting movie. How referential it actually is can be left to the quasi-academic pseuds but it might be worth noting in passing Demy's self-referential nod to his earlier equally romantic movie 'Lola' in which the character of Roland Cossard (played here by the same actor, Marc Michel) was the protagonist in love with Anouk Aimee's eponymous Lola, the background music was also by Michel Legrand whose main love theme turns up again here. Younger viewers will most likely be unaware of the two half-decent lyrics that were written for the two main themes of Umbrellas and enjoyed no little success as respectively 'I Will Wait For You' and 'Watch What Happens' and those who DO remember will marvel at the banality of Demy's original words - 'lyrics' may be stretching it. It might be interesting to discover which came first, Demy's pedestrian words or Legrand's lush melodies. It's fun at that to imagine Legrand, faced with something like 'pass the salt', 'it looks like a nice day', 'the girls are wearing their hair shorter this year', etc and coming up with those gorgeous melodies (I'd rather not dwell on the opposite). Ultimately this is a movie it's hard not to like, from the muted pastels, reminiscent of Les Grands Manouvres, to the Audrey Hepburn-lite sub-Givenchy outfits worn by Deneuve and Ann Vernon as her mother. Cynics may say that it's just one large chocolate-box full of soft centres and they'd have a point but it's not too long and it does offer both entertainment and escape.",
            "review_date": "2005-09-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not a good experience",
            "content": "I try to evaluate a film considering mainly my experience, obviously within my context and my prejudices. And I also consider the genre to which the film belongs, taking my favorites from that genre as benchmarks (in this case, \"The Sound of Music\", \"The Greatest Showman\" and \"La La Land\"). I know that there is some anachronism in my analysis, but I can't deal well with a musical that is sung in every single word. It is extremely artificial and exaggerated - even annoying, irritating. It just spoils a good story, at least in my experience. Sorry, but it didn't work for me.",
            "review_date": "2021-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sweet France",
            "content": "Typical French story of the sixties of last century, a mixture of romanticism and realism this time shown through beautiful very sentimental lyrics (it's a musical after all). A very simple love story full of encounters and disenchantments anyway. It's well told in images and dialogues and of course Catherine Deneuve is so beautiful... But that mother of hers (role done by Anne Vernon) spoiled her romance with her greed and conventional ideas. And the war in Algeria contributed no less to it too.A good movie indeed and if it isn't a masterpiece it's only because the story is too simple and unsophisticated.",
            "review_date": "2010-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Visually Magical",
            "content": "This love story told strictly through song is super fun to experience for the visuals and memorable score alone. The story, while familiar, provided an ample vehicle for the film to progress. Catherine Deneuve became a major star as a result of her participation in this film and she is a captivating presence throughout. Nino Castelnuovo as her true love also does a great job in that her really allows her to shine. The Michele Legrand score is highly emotive and memorable. This film is very unique and original and definitely work checking out. Seeking it out on the big screen is also worth the effort to fully appreciate.",
            "review_date": "2018-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Film that Inspired La La Land",
            "content": "Considering La La Land is one of my all-time favorite films, surely I have to see the film that inspired it, right? The Umbrellas of Cherbourg is a beautiful and melodramatic take on a French romance in musical form. Just as it was the case with La La Land, I have a feeling this film will get better on repeated viewings. With every word sung, and in a different language, sometimes it's difficult to follow what is being said and what the emotional intentions are of each word. Watching romances in another language is always a fascinating experiment. On one hand, you could say that the language doesn't ultimately matter because what is meant is often shown through facial expressions. But at the same time, not being familiar with the native language can make it difficult to understand the exact tone of each spoken word. After all, how do we really know how well the actors can act if you aren't familiar to their language?With all that said, there's no escaping the beauty to The Umbrellas of Cherbourg. Jacques Demy crafted this story in such a unique way, through imagery and framing devices. Catherine Deneuve and Nino Castelnuovo resemble last year's Ryan Gosling and Emma Stone by being an honest and charismatic couple that you can root for. Just the pure emotion that both of them pour into their characters is admiring. Only, I wish we did get to see a little more of them doing things together, instead of just gush over each other through song after song.Getting lost in the music, colorful imagery, and dreamy sequences are probably why this film became so popular, and further inspired La La Land. Although nothing really compares to the latter, 'Umbrellas' works on other levels because it's a contained, quiet, and sincere love story told through beautifully arranged musical numbers. This is one for the ages.8.6/10",
            "review_date": "2017-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "not perfect, but so wonderful that it can inspire joy in the most depressed",
            "content": "The Umbrellas of Cherbourg was a film that screened in a modern European film class at my old college. This is the ideal setting to see the film (even if, as happened to me, the teacher talked and laughed incessantly throughout), since it's the kind of movie that transcends the academia setting and just lets you escape into the clouds in terms of a cinematic experience. The funny thing about the film, directed by the inimitable Jacques Demy, is that it's not entirely a \"light\" story, but it's told and expressed in such a way that you can't help but smile from first frame to last. Not every line of dialog sung clicks, but most of them do, strongly, and what would otherwise be a very sad story is elevated to a pure melodrama beat.There's credit obviously due to Michael Legrand, who has to be as painstakingly detailed in his movements with the notes and beats as does the director. Whereas if the lines and emotion were delivered as in reality, there wouldn't be a lot of hubub and sentimentality. But Legrand and Demy latch on to exactly what makes it sentimental and gives it uplift and pathos. At the same time in the story of Genevieve and Guy's romance, and the downers of unplanned pregnancy and Guy's induction to the army, is told with some humor mixed in with the drama, Demy films it as if he wants to make every color bounce off into the audience. It's the direction, not so much the story, that should garner attention for most film buffs, as it embraces color film in the same mold as did the Hollywood directors when color could first be utilized to beautiful effect in the 40s and 50s. Its subversive quality as an opera is conflated by it being very basic and very alive in every moment.But wait, what about Catherine Deneuve in her debut? If you don't see her appeal here, right before she broke out as a huge star with Repulsion and Belle de jour among many other classic or not so classic films of the 60s, then you never will. This is Deneuve with a light but totally affecting beauty, delicate enough that she can be loved (for lack of a better or more accurate description) by the camera; she looks and is very young here, and it serves the character and the story while cementing her own iconic status. Other actors like Nino Castelnuovo Anne Vernon fare well, but if there's a reason more people watch the film today it's for Deneuve, and maybe for the bright colors and ironically sunny music. 9.5/10",
            "review_date": "2009-05-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A stunning use of the musical form",
            "content": "I won't spoil anything, but I just wanted to emphasize what a perfect ending this film has. If anything, this movie encapsulates in its purest form what a musical motif can do. Remove the soundtrack from the final scene and what would you have. But include it as the final and most intense instrumental reprise of a song we've already come to understand, and you have one of the greatest endings ever filmed.This movie is wonderful. There's a very archetypal simplicity to the plot, such that a lesser filmmaker could have used the same story to create something quite forgettable and dull. Demy takes such a mundane story, however, and with a splash of candy color and expertly arranged music manages to craft a timeless, heartrending masterpiece.It's a short film. Don't miss it!",
            "review_date": "2018-09-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "no... thats how you spell neorealism",
            "content": "when I was in high school, taking french, the teacher would occasionally push a tape into a slot and show a \"movie.\" the idea was for us kids to hear the language. well, this was one of the movies. at the time, my feelings concerning \"umbrellas\" were... truthfully, I didn't know what to think. as a seventeen year old I don't think I would have recommended it. channel surfing last night I came across it again on TCM. what a difference 9000 days makes. this is a very unique film. it's not a musical, even with the sung dialog, jazzy score and saturated colors. it's stylish camera work/art direction doesn't contradict the neorealism aspect either. It enhances it.even with the \"star crossed lovers\" aspect, the film isn't sentimental or corny. and the socio-economic angle is also treated tastefully.This is an ART film in the true sense of the term. and Anne Vernon. Je t'aime.",
            "review_date": "2014-04-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Powerful, stylized art!",
            "content": "I wasn't planning on watching this movie when it aired on TCM last night. The on-screen TV guide's synopsis sounded dreadful: \"a movie with the dialogue entirely sung\"? Um, no thanks! But it came on after a movie that I _was_ watching, and I was elsewhere in the house and didn't bother turning of the TV, and on came \"The Umbrellas of Cherbourg\". About 10 minutes into it, I found myself loving the music. The French was so beautiful, and the voices were so clear and melodic. I went back into the TV room and rewound the movie to the beginning (thank you Tivo!) and watched the entire thing. It was just that captivating! The music, the singing, the bold colors, the attractive actors, the sweet and sad story ... it all hooked me and reeled me in. I would imagine this is a film that you'd either love or hate, as it's so \"out there\" style-wise.The story is told simply -- not simplistically, but simply. Like with a good silent film, we don't need tons of dialogue to understand what's going on -- we can supply the details and the emotions ourselves, and that makes us part of the picture ourselves, not just mere observers. I felt that somewhat with Umbrellas as well -- the singing dialogue briefly touches on the underlying emotions, and we fill that in with our own experience and emotions. And of course helping with this is the music, which has its own language and touches you in places words can't reach or describe. I found the whole \"conceit\" of the movie to be quite effective, and not gimmicky at all ... it was a genuine, artistic, and powerful means of conveying an all-too common story and making it so much more. It is a beautiful piece of moving art!",
            "review_date": "2007-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Review - Les parapluies de Cherbourg",
            "content": "It is an ageless movie. But do yourself a favor, if you don't like musicals, don't watch this movie, it is entirely musical.This movie has amazing cinematography, it is almost poetry, in this case, it reinvented the code even before movies like The Graduate, and the pastel colors depicting the 1950s are great in every circumstance.Now, I want to warn again possible viewers that all the plot is sung, it can be very surprising and destabilizing at the first viewing as the dialogue are that great, but sung in disharmony, they were written to fit the tone of the story not the beat of the music.Finally, other than for being a Palme D'or, this movie has an important cultural impact just recently, Damien Chazelle' La La Land went on theater, and it is strongly inspired by \"Les parapluies de Cherbourg\". In other words, you have to know the bases and the classics like this movie.",
            "review_date": "2020-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stirs echo at the bottom of music",
            "content": "Demy challenged himself in a simple way here; portray an ordinary life of hindrance and difficulty as we might know it, so a melodramatic plot about a love affair that is quashed by distance, and layer this through the desire to flow to a further distance than just hurt; release.So he makes opera, the plot is fully sang, colors are fierce and bright in celebration of a life that we would like to be in this other way, more musical than it is and yet this desirous life breaks down on the way. None of this interest me overmuch, that is to say as artifice. But it achieves an airy feel; French is such an airy language, full of vowels, unlike the marching sounds from the other side of the Rhein. It grants the cinematic breath free passage.Oh there are melodramatic obstructions the characters face, obstacles in the path of love - the girl's beau has to spend two years in Algeria in the army, there's a lot of dismay over absence, his at first, hers when he gets back. But even more important is the evocative finale where they meet again after years one night, these last two minutes are everything; there could be friction, recrimination, ego and drama, but the film lets go, grants free passage.Indeed if you decide to track this it shouldn't be just for mellifluous song and bright colors, mere aesthetics; it should be also to contemplate release in the last gesture. Demy does it as best he can without a transcendent tradition to work from, which the French don't have.But something lingered in mind after watching. How much release is there, or how much drama that goes unspoken and is carried after they part? No clear answer other than what you embody of course.But see now. The film is an extension of a previous one by Demy, Lola. The protagonist there returns as a character here, there are other parallels. Previous knowledge isn't required of course. But the choice, to deliberately echo things we may have known from a previous life (if only we have lived through that previous life), factors in what we're saying, about drama - internal narrative - that continues to echo.And more tantalizing is to note how a third film, Le Bonheur, annotates this one and the last scene, made by the wife of Demy, Agnes Varda, obviously inspired by the work of her husband and released a year later. It's not a scholarly connection I'm after; here we have work by soulmates for whom love and romance were things they shared in life, not tropes. In Bonheur we see a husband and wife who could be the boy and girl of this one had everything worked out, whose married life is as blissful as the romance here hoped to materialize. Both films are about happiness and betrayal. Even more pertinently; both are about distance, empty space, in which internal narrative begins to form.Here every emotion is externalized in earnest, the distance is explicit; he goes away to Algeria, she to Paris. There, every emotion is externalized too - by the man - and yet the distance is implicit, masterfully so, in the women keeping silent. Varda creates empty space in which we pour our internal narrative of betrayal and come to disbelieve our senses; hauntingly rendered as an ambiguous scene of death that viewers anxious for certainty interpret unambiguously.Varda goes beyond but in my eyes the inspiration is founded on Demy's marvelous last scene where everything - we presume - is let go of; except all that lingers and you carry in life only you'll know. For a few nights of marvelous introspection you will see this together with Lola and Le Bonheur.",
            "review_date": "2015-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent musical",
            "content": "A wonderful musical film from Jacques Demy. Set in a fantasy Cherbourg (a French seaside town famous for its rainy weather) during the late 50s and going on for several years, it consists in three acts. First act: Genevieve (a very young Catherine Deneuve) is a teenager living with her mother, with whom she works in a shop that sells umbrellas. She fells in love with Guy (a car mechanic, played by Nino Castelnuovo), who is only a little older than she is. Her mother opposes the romance, as she sees Genevieve as too young and Guy as too poor. Guy is drafted to the Algerian war for two years, but not before leaving Genevieve pregnant. Act two: Genevieve's mother not only has now an unwed pregnant daughter, but the financial situation of her shop is dire. Fortunately for her, a diamond dealer in love with Genevieve agrees to pay her debts. He wants to marry Genevieve (despite being pregnant with other man), and eventually Genevieve will agree. Third Act: Guy returns from the war with a limp in one of his legs. He goes to Genevieve's shop, but sees that mother and daughter have gone. He becomes bitter, is soon fired from his job. His beloved aunt dies, and after that, he marries her caretaker, Madeleine. With his aunt's legacy, he is able to buy a gas station. He and Madeleine have a boy. Final Scene: Christmas Eve. Genevieve, now married and with a daughter, arrives with her car to Guy's gas station. Surprised to see each other, they decide to go inside the station to talk, but they both soon realize that their relationship belongs to the past. She goes away, and soon Madeleine and their boy arrive, and they celebrate Christmas by throwing each other snow balls. End of movie. All this is done through sung lines (rather than songs proper). It's an extremely entertaining and amazingly fluid movie, despite not having the traditional happiness of musical movies. Demy tried to repeat the magic a few years later with Les Demoiselles de Rochefort (also with Deneuve), but he couldn't; that's a much weaker movie. Only quibble with Cherbourg: Isn't the constant product placement for Esso a bit too much?",
            "review_date": "2008-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant",
            "content": "To all the usual praise, let me add something about the excellent acting. Everyone is taken, rightly, by Catherine Deneuve, but so much that they perhaps tend to miss the others.There is a lot of real, completely non-cynical tenderness in the acting. Nino Castelnuovo is very good as Guy, particularly in the first part, where his portrayal of unalloyed joy is wonderful. I love the scene with his aunt before he goes to the theatre. I'm surprised this film did not make him a star. Perhaps he was unlucky to have Deneuve as his co-star.Geneviève's mother (Anne Vernon) is fabulous, and so is Roland Cassard (Marc Michel) who does a great job as the tentative and kind substitute husband. I could go on about the aunt and Madeleine -- they are all great.And what a brave film this was to make -- quite unlike any film before or since.",
            "review_date": "2008-04-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Doomed Love",
            "content": "Young love becomes thwarted by circumstances out of their control in Jacques Demy's musical masterpiece THE UMBRELLAS OF CHERBOURG, and released at the bracket of years when Hollywood was turning out behemoths like MY FAIR LADY, THE SOUND OF MUSIC, and MARY POPPINS, among others, this one remains the most experimental of them all. Where the traditional musical features pauses in between songs and have energetic dance numbers (a style Demy would exercise in his companion piece THE YOUNG GIRLS OF ROCHEFORT) UMBRELLAS is about as close as anyone can get to an opera without having trained singers a la Maria Callas and Placido Domingo ever appear. All the lines are sung (dubbed by singers who replace the actors). As it is, it predates EVITA by thirty years, and is most important in succeeding in its innovative style. Another crucial difference between UMBRELLAS and its American counterparts is the fact that despite the explosion of color from all sides, it's a fairly tragic affair; a sad story that at times becomes heart-wrenching, particularly in two key moments: when Genevieve says good-bye to Guy at the Cherbourg train station, and when they finally meet up again years later, both clearly changed individuals who have set up families with a vague remembrance of a lost chance at love and happiness. Even so, it's not a depressing movie: UMBRELLAS simply doesn't decide to go overboard with an delusional attitude towards love and relationships -- that would happen in YOUNG GIRLS, where the movie would shriek out the longing and the exuberance that is absent in the former. Young love sows its seeds, even when the parties involved may have to part ways. This film marked a breakthrough for Catherine Deneuve who at age 20 is ethereal and luminous and nobly suffers throughout the entire story; after this she would set forth a career that continues alive today.",
            "review_date": "2006-08-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sixties French Magic",
            "content": "Most outstanding in this 1964 restored classic is the score, an outstanding '60s soundtrack by Michel Lagrand and dialogue by director Jacques Demy. Stars Catherine Deneuve as Geneviève, the story is about her and her boyfriend Guy (Nino Castelnuovo) who wants to marry her, but has been drafted in the Army to fight in Algeria.All elements converge to create '60s French magic as much sweet sorrow's invoked.Also here is great cinematography and it should be said this is not one of those schmaltzy Rogers and Hammerstein-type musicals...well just a bit of schmaltz, but the plot's got an edge, as does the style. You don't have to be into musicals to like/love this, just into great film and music.",
            "review_date": "2006-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's raining on the heart",
            "content": "To my knowledge the only musical in film history that is based solely on song and music. It takes a while adjusting to this highly unusual way of making a film, but after a while you get quite compelled by this. It is a surprising work of art, this movie, extremely aesthetic but also very complex and very profound too, as is the case with most of Jacques Demy's (1931-1990) films. Regardless of what one might think about this film, it must be acknowledged as a great piece of work from a thematic as well as an aesthetic point of view. A beautiful but also heartbreaking experience, Michel Legrand's score is simply unforgettable. I think that it is a film that transcends the genre of musicals. It is much more than just song and dance.",
            "review_date": "2005-07-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Timeless musical romance",
            "content": "It was a rare privilege to be present at a film house screening of the restored print of this timeless musical romance. Seldom do I find myself actually holding my breath at such beauty, but that's what happened. The restoration was astonishing, and the years slipped away and the audience was there in 1964.  The accolades awarded this remarkable achievement have been duly expressed. I can only concur and sing this film's praises, too.  It is a one-of-a-kind work, with all elements of the production uniting into a masterpiece.\nLegrand's score weaves its through-composed themes utilizing leitmotifs, recurring patterns, Faure-like harmonic designs, and structural forms into a hypnotic flow.  His recitatives are perfectly blended into the rich texture, and move naturally and beautifully, recalling such ingenious French opera realizations as Bizet.  Yet, Legrand's main songs are likewise woven into the score, like arias--haunting in their simplicity and sweetness.  The singers on the soundtrack are excellent, and the choice of actors to match the vocal work is done to perfection.  Nowhere in the annals of cinema can one find a work like this lovely creation.  Thanks to the painstaking task of restoration, all can once again thrill to the original French version of \"The Umbrellas of Cherbourg.\"",
            "review_date": "2000-05-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A musical that compares the expectations of love with the harsh realities. The heart sings and breaks.",
            "content": "The Umbrellas of Cherbourg is a unique film experiment. It's a musical where every line is sung. Even the mundane lines which have little to do with the film. While this style could be expected to be under threat of being too sweet, the film avoids this by approaching sentimentality with heart-wrenching reality, which the musical aspect of the film highlights. It's a love story. And the film is aware that it begins as a movie love story, addressed by the fact that the protagonist genuinely expects to die if they are parted. Instead of dying, the film explores one of my favourite deep subjects in art, by comparing the expectations of love brought on by pop culture with the harsh reality without being overdramatic. It's nostalgic and extremely genuine.As expected, the omnipresent music is absolutely wonderful and can speak for the film's emotion even without translation. How they managed to fit in the dialogue so fluently is incredible, let alone perform it. The set decoration and costume design is another highlight as well, with bright and bold colours, which the sweeping camera movement compliments perfectly. Despite the broad story, the film is surprisingly small scale with a limited use of sets, but the colour palette makes the world feel huge. There's some incredible use of match cuts as well. Though this film has a fantastic and charming atmosphere, it's the simple and effective storytelling that makes it, particularly the heartbreaking and subtle end. Bona fide classic.9/10",
            "review_date": "2013-07-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tres Bien!",
            "content": "Here is a film where I knew many of the songs before I got a chance to see the film.I bumped into this gem one morning recently...and what got my attention was the songs. I have heard these songs as piped in \"elevator\" music in the 70's when I was a very young child waiting for the doctor or dentist. Since I saw the doctor and dentist on a regular basis, I grew familiar with a few of the songs in this film. But I had NO idea it was in a movie until now. When I finally saw the film, I started humming the songs! What an interesting film this is. My first \"all singing film\" without it being a musical per ce was \"Tommy\" and I thought that was the first one, now I know it was not. This one was surreal. The colors were meant to stand out, you can't help but notice.But here is a love story we all want to avoid - to fall deeply in love with someone only to have a parent not let you be with him/her because he's/she's not rich enough. Love happens and most times, it's without money being the driving factor. And this is what happens to our two leads. They love for love, but...it's not enough. Not for momma.But throughout time, we discover that for many, money is a driving factor in \"love\". In this film...there are two people who fall in love with each other, belong together who settle for...and yes, I will say it...second best ... thanks to the almighty dollar. A tale told time and time again, this time in glorious surrealism and music.I really liked this film - and it's interpretation really is rich for the early sixties. I would think that as you watch it, you will \"decide\" how you think what the ending really means and that is one of the joys of the film. Let's you figure out where YOUR heart is.A true gem.",
            "review_date": "2006-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Umbrellas of Cherbourg",
            "content": "When I read the title for this film in the book of 1001 Movies You Must See Before You Die I knew it was a foreign film, from France, but I had no idea it was a musical, so I was most intrigued to watch, from director Jacques Demy (Lola, The Young Girls of Rochefort). Basically seventeen year old Geneviève Emery (Catherine Deneuve) lives in an umbrella shop in Cherbourg with her widowed mother Madame Emery (Anne Vernon), and she is secretly in love with twenty year old auto mechanic Guy Foucher (Nino Castelnuovo), and the two of them want to get married. She reveals this to her mother however, and she objects thinking that her daughter is too young and that he is not mature and well-established enough, and he may be required to do military service, and shortly later he is sent to Algeria after being drafted to serve in the war, but before leaving he and Geneviève consummate their love. Following this Geneviève is pregnant, while he is away he hardly communicates and they have drifted apart, so she listens to her mother's strong encouragement to accept a marriage proposal from Roland Cassard (Marc Michel) (he previously appeared as the same character in the film Lola), the affluent gem dealer who is in love with her and promises to bring her child up as his own. Guy is discharged from service before his two year term is up due to being wounded, he returns home and finds out Geneviève is married with a child and has moved away, and following this he sinks into deep depression and anger, which he struggles to control. But Guy recovers from his state when he falls in love and married young Madeleine (Ellen Farner) who had been caring for his aunt Élise (Mireille Perrey), who is now deceased, and she left him an inheritance which he uses to fulfil his ambition to open a service station. Years pass, and Geneviève, who is now discernibly wealthy, has returned home with Françoise (Rosalie Varda), her and Guy's daughter, and have an accidental meeting at his service station, their short conversation is obviously filled with unuttered fondness and regret, and in the end they finally part ways. Also starring Jean Champion as Aubin and Harald Wolff as Monsieur Dubourg. Deneuve is beautiful and gives a great delicate performance as the young woman longing for love from one man until fate changes everything, Castelnuovo is interesting as the man who is in and out of her life, and Michel is likable as the wealthy man with good intentions. The story is relatively simple, complicated romance, but what makes this musically distinctive is that every scene has singing, from the most mundane conversations to emotionally charging moments every word is spoken and sun in tune, and the picture has good use of vivid colour and design as well, it is a fantastic musical. It was nominated the Oscar for Best Song for \"I Will Wait for You\", Best Original Music for Michel Legrand and Jacques Demy, Best Music Adaptation or Treatment for Michel Legrand, Best Writing, Story and Screenplay - Written Directly for the Screen for Demy and Best Foreign Language Film, and it was nominated the Golden Globe for Best Foreign-Language Foreign Film. Very good!",
            "review_date": "2013-07-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Much Better Than I Expected",
            "content": "As I sat down to watch this movie, I did not expect to like it. First of all, it is the worst kind of foreign film, which is to say, it is French. I won't elaborate. You are either with me on this or you are not.Then I discovered it is a musical. I like musicals well enough, but when I realized that every line of dialogue was going to be sung throughout, I groaned. One of the great improvements of Hollywood musicals over operas is that in the former, ordinary dialogue is merely spoken, whereas in operas, everything is sung relentlessly, even if it is just a husband asking his wife, \"What's for dinner?\" There are a couple of real songs in the movie, but by the time it got to them, I was a little worn out from all the singing that preceded.Finally, the story promises to be a cliché. Guy and Geneviève want to get married. However, he is drafted to fight the war in Algeria. On his last night before leaving, they make love. And you know what that means. When a woman in a movie has sex with a man just once, she gets pregnant. We then figure that either Guy will forget about her and fall in love with someone else, or he will be killed in the war. Either that, or she will be so desperate about covering up the shame of her pregnancy that she will marry someone else.Much to my amazement, I actually became engrossed in this movie, especially when the story went against my expectations. After only four months, Geneviève starts to forget about Guy. She says it feels as though he has been gone for years, and that she is losing the feeling she had for him. She has to look at his picture to remember what he looks like. It is true that she has only received one letter from him in four months, but you have to figure that a man fighting a war might not have the luxury of writing regularly (in fact, he is wounded by a grenade).And so she ends up marrying another man. The movie could have given her the standard motive of a woman desperate to cover up the shame of her pregnancy, but it does not. Neither she nor her mother seems unduly concerned about the matter. And in the one letter she receives from Guy, he writes that he is looking forward to coming home after his military service is over, marrying her, and seeing their child. It is unlikely that she would have married the other man had she not been pregnant, but we still get the sense that her decision to opt for a marriage of convenience was made possible by the brute fact that her love for Guy had faded.Before Guy and Geneviève separate, they sing the song we in America are familiar with as \"I Will Wait for You.\" The lyrics in the movie are a bit different, but the thrust is the same. The two lovers express their undying love for each other. It reminds me of the movie \"Oliver\" (1968), in which Nancy sings the song \"As Long as He Needs Me,\" referring to her lover Bill, who has no need for her at all, and ends up murdering her. We have a similar irony with the song \"I Will Wait for You.\" Although the lyrics in the American version of the song say, \"If it takes forever, I will wait for you,\" Geneviève does not even manage to wait more than four months. But the movie does not condemn her. It merely states the cold truth about love, that it creates an illusion that it will last forever, and then simply dissipates, despite our efforts to hold on to it.Guy eventually returns to find that Geneviève has married another man. Eventually, he marries too. When Guy and Geneviève finally meet again by accident, we see that they still have feelings for each other, but it is more a feeling of a love that was lost than of a love that still is.",
            "review_date": "2015-03-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Magical with 3 great scenes",
            "content": "The first time I rented this movie, I fell asleep. I was not ready for singing gas station attendance in an absurd world of extreme colors. The one thing I picked up from that partial viewing was that this movie was unique.Years later I gave Umbrellas a second chance...knowing what I was in store for. Once I got past that 'god this is silly' feeling, the movie started to grow on me. The movie kind of meanders with trite situations, almost setting the story up for three peak moments: ***SPOILERS*** The first masterpiece scene is of course \"I Will Wait For You\". The song is beautiful, and by this time in the movie you're perfectly willing to accept the fact that the couple can 'glide' down the street...they don't need to walk, they're in love.The second great scene is the closing of Act One at the Train Station. I love the fact that it's short and without the overkill Shakespearian dialog. \"My Love\" and \"I love you\"...simple and painful.The ending of this movie may very well be the best ending to a movie ever. Part of it's brilliance is that it just comes out from nowhere...December 1963 is the only warning. It looks like another random scene at the gas station, then a car rolls up and that familiar music begins to play (it's like the music to Jaws...you just know something is about to happen.) The tension is as thick as any war or action movie...I mean just the guy asking what type of gas she wanted was stressful. It's perfect, probably because it seems so real (and they're still singing that crazy dialog.) This movie is not for all taste. But if you can get into it, it's magic. I've seen the movie now over 10+ times...it's sickening how it grows on you.",
            "review_date": "2006-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Only the French Could Have Made a Movie Like This!",
            "content": "What a beautiful and sad movie this was!  The score, as everyone before me has no doubt already noted, haunting and beautiful, and I loved the fact that every word of the script was sung.  It's amazing how much music can add to the feeling of a movie.  If the characters were to simply speak the simple lyrics (at least as they were translated into subtitles), it would have seemed banal and trivial.  But the way they are presented here -- c'est magnifique!",
            "review_date": "1999-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A film for all lovers of the world, the young and the old",
            "content": "The Winner of Cannes Film Festival's Golden Palm in 1964 and five times Oscar nominee, Jacques Demy's/Michell Legrand \"The Umbrellas of Cherbourg\", is a superb romantic movie. It tells a very simple story of love lost but not forgotten in such enchanting, unusual, and ambitious way with such delightful results that no other musical or romance was able to achieve since. The beauty of the film lies in the unique combination of color and sound. Every word is sung with no spoken dialogs, and every scene has perfect harmony in colors with the clothes of the characters matching the interiors and exteriors of the sets. The movie made a superstar out of 20 years old Catherine Denueve as teenager Genevieve, a girl madly in love with Guy (Nino Castelnuovo), a garage mechanic. I have not seen the film for long time and should admit that while re-watching it last night, for the first ten or 15 minutes, I had some doubts and reservations about constant music and singing that make The Umbrellas of Cherbourg more of the filmed opera than a musical. But the more I watched, the more I became overwhelmed by its kind and sweet tenderness and I enjoyed with all my heart the unique romantic delight.",
            "review_date": "2008-08-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best movies ever",
            "content": "From 1957-1963, two young lovers in a northern French coastal town must bear separation for two years. All the dialogue is sung with no spoken words.After a sixth viewing, I still find this to be one of the most charming and endearing films ever made. Jacques Demy does great work as a director especially during the opening credits. (Yes, back then, opening credits were mandatory in every film.) He ably creates a mood of genuine melancholy especially in the end of the first of three sections as well as the finale. He is greatly assisted with the superb music of Michel Legrand. Some songs are brilliant especially \"I Will Wait For You\". When this song is used in the film's saddest moments with loud orchestrations, it's hard to restrain the emotions.The film covers many other themes including bankruptcy, terminal illness, social climbing, war drafts, and other forms of heartbreak. With a final image of an Esso gas station on a snowy night, the film ends on a perfect note. One to be treasured. - dbamateurcritic\nRating: 10 out of 10Notable Achievments:1) Directing by Jacques Demy\n2) Music by Michel Legrand",
            "review_date": "2020-09-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Singing into people's hearts",
            "content": "Madame Emery has a boutique with her daughter Geneviéve in the coastal town of Cherbourg, in Normandy, France, where they sell umbrellas.Geneviéve is in love with Guy Foucher, a mechanic who lives with his sickly aunt and godmother Elise along with her quiet and dedicated care-giver Madeleine, who's secretly in love with Guy.Geneviéve's heart is broken when Guy is drafted and he has to leave to fight in the Algerian War.The night before he leaves, they make love and she becomes pregnant, as she soon finds out.She feels like Guy has abandoned her, since he doesn't write too often.A Parisian jeweler called Roland Cassard shows interest in her and they get married.After two years Guy returns from the war with an injured leg.He finds out how things are, that her sweetheart has married another man and also the umbrella store is gone.Soon her aunt dies and he feels all alone.But there still is Madeleine whose love for Guy hasn't died.He marries her and he also becomes an owner of an Esso gas station.Les Parapluies de Cherbourg (The Umbrellas of Cherbourg) from 1964 is directed by Jacques Demy.The story is presented in three parts: The Departure, The Absence and The Return.It takes place during the years 1957 and 1963.It's a great French romantic musical drama of which all the dialogue is sung.And it works, it really works.Catherine Deneuve gives such a memorable and lovable performance as Geneviéve Emery.She's able to bring both naivety and maturity into her character.Nino Castelnuovo also brings a lot of depth into Guy's character.Anne Vernon is wonderful as Madame Emery.Marc Michel is terrific as Roland Cassard.Ellen Farner gives a sweet performance as Madeleine.Mireille Perrey is brilliant as Aunt Élise.Jean Champion is great as Aubin.Michel Legrand has done a remarkable job with the music.In this movie we see these people sing their lines as if they're living in some magical fantasy world.But they also face the harsh reality of life.The movie has combined those elements in a fantastic way.It's sad and beautiful when Guy tells Geneviéve that he's leaving to fight in the Algerian War, as they sing the theme song.And also when they see for the last time at the Esso gas station and the famous tune is heard.They have both started lives of their own, but there shall always remain a place in their hearts for each other.",
            "review_date": "2009-05-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Some kind of Lola 2.",
            "content": "At the end of \"Lola\",Roland (Marc Michel) is rejected by the heroine.We find him back in Cherbourg,where he will play an important part in the plot.\"Les parapluies de Cherbourg\" is an unique movie,not only in French cinema :it extended the Musicals concept by using an entirely sung dialogue.It does not work without some ludicrous lines ,which the non -French -speaking audience cannot notice.Singing in a garage about a \"broken-down\" car would be guaranteed to net nothing but horselaugh..but there's the magician Demy,abetted by talented Michel Legrand.Legrand's score integrates snatches of Bizet and the great organ during the wedding scene.The scenery is bright,with vivid colors.The town is daubed with green and blue pastels,candy pink and mauve.All the actors give successful performances, Anne Vernon iis as effective as her daughter Deneuve.Strangely,the characters recall the thirties Pagnol movies,and the ending has got something from \"splendor in the grass\".Demy would try to repeat his sung dialogue in \"une chambre en ville\"(1984) ,but time had passed and the main drawback which was mastered in \"les parapluies (singing about things that are too down to earth!)ruined the eighties work.NB:The lead female part was intended for a real singer ,Isabelle Aubret.Because of a car crash,she was not able to play it.",
            "review_date": "2001-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Michel Legrand, RIP",
            "content": "There have been a number of over-the-top movies over the years, but \"Les parapluies de Cherbourg\" (\"The Umbrellas of Cherbourg\" in English) has to take the cake. Essentially an opera, it depicts the romance of some young French people in the late '50s and early '60s.What caught my eye about it - and was apparently the case with most of Jacques Demy's movies - was the use of color. Almost every scene features some stark color, often involving people's clothes and the walls. It reminded me of Wes Anderson's movies that way.I don't know if I would go so far as to call the movie a masterpiece, but it IS an impressive piece of work. And damned if Catherine Deneuve isn't a real babe here! I recommend it just so that you can appreciate the work that they put into it.As for the part about the man having to fight in Algeria, I recommend reading about the atrocities committed by the French army there, and also watch \"The Battle of Algiers\".",
            "review_date": "2019-04-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The film became an international sensation, turning neophyte Deneuve into a star.",
            "content": "A French shopgirl (Catherine Deneuve) loves a gas station attendant (Nino Castelnuovo), but when he goes off to the Algerian War, she finds she is pregnant and marries another man (Marc Michel). Years later the couple reunite briefly and accidentally.The Umbrellas Of Cherbourg is a unique, delightfully colourful piece, with sung-through dialogue and camera work that enhances its faintly magical, fairy-tale quality. This was Deneuve's breakthrough film role, and she makes the most of it. In a category all by itself, this admittedly flimsy narrative has remained a perennial favourite, partly for its swooningly lovely music and for its moving, tear-jerking qualities. Umbrellas is the middle film in an informal \"romantic trilogy\" of Demy films that share some of the same actors, characters and overall look; it comes after Lola (1961) and before The Young Girls Of Rochefort (1967).",
            "review_date": "2010-05-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great French musical about passionate love",
            "content": "This French musical is about tragic love between young people and interesting ideas about changes in one's life after passionate, but tragic love affair.Well, this French musical unlike American musicals \"My Fair Lady\", \"West Side Story\", \"Oklahoma\", \"Chicago\" (2002), \"The Phantom of the Opera (2004)\" will undoubtedly make the viewer think more deeply about passionate love and true-to life situations, catharsis of the musical due to many aspects in setting, language, and plot.The setting, the plot the language are French style, so it means you can expect passionate twists, suspense and intrigue. Also the music does create interesting mix of jazz, instrumental and classical tunes, which are merged with the spoken language of the characters.The characters of the movie reveal tragic social changes in lives due to different social status (mechanic, the daughter of the lone mother, the jeweler who had tragic love affair, the ill old woman). On the one hand it looks that the love affair of the mechanic and young daughter is romantic, bears resemblance to Shakespeare's Romeo and Juliet story, but on the other hand it is shown that young people do not have patience to fight for their love ignoring social status, money. Because of that it is shown that young people suffer.The work of the film director, and other people is interesting to watch because of different camera angles, very colorful interior of the houses, and atypical for the French or American musical end of the love story.A musical worth watching and thinking about the message.",
            "review_date": "2008-07-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Truly a masterpiece",
            "content": "I saw this movie many years ago, when I was still a boy. It must have been shortly after its release, when I was 11-12 years old. I went with my best friend; the film was recommended to us by my friends mother. She talked about how the dialogue was all singing. We thought that sounded weird, but we went anyway. I remember that I was truly moved by this movie. I remember that I thought the singing dialogue was weird at first, but after a very short while, it appeared natural, and I didn't think about it anymore. I remember, that I was truly in love with the lovely Catherine Deneuve. I remember, that her choices and her fate was not wrong. It was only sad. I remember how the wonderful tune of the main character touched my heart and stayed with me ever since.I only saw the movie again a few days ago. So many films from the 50's and 60's loose their magic when you see them again after many years. Not so with Les Parapluies de Cherbourg! The dialogue is not quaint like so often felt. Perhaps, the singing dialogue keeps it forever young. The words ring true and fresh like ever. The dilemma of love and life is present as a real and forever relevant question. The acting is subtle and discrete, underplayed almost, free of theatrical overacting and dramatization. The music is amazing. Les Parapluis de Cherbourg is a truly timeless, moving and worthwhile masterpiece. A true gem. Watch this movie with someone you love.",
            "review_date": "2010-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Is there a lovelier film than this?",
            "content": "LES PARAPLUIES DE CHERBOURG (THE UMBRELLAS OF CHERBOURG) (1964) 9/10I'm a fan of musicals. From TOP HAT to CABARET, from SINGIN' IN THE RAIN to MOULIN ROUGE, I just love them in every possible way. But I must confess that I was a bit worried before watching THE UMBRELLAS OF CHERBOURG, directed by Jacques Demy and starring the wonderful Catherine Deneuve. Not because it's French- some of my favorite movies are French (THE DISCREET CHARM OF THE BOURGEOISIE, BELLE DE JOUR, JULES ET JIM, SMALL CHANGE). That was because every line in this film is sung, something that made me love and hate EVITA. Watching it, I discovered one of the most lovely and beautiful films ever made, and also one of the most realistic musicals. If the characters talked instead of singing, this would still be a great film. But the music adds a charming, irresistible atmosphere that is never cheap or schmaltzy. Deneuve never looked better as the girl whose passion for a young man suffers all kinds of trouble. The ending will make some people cry, but naturally. Naturally as the lines are sweetly sung by the actors.\nThis is not the kind of movie you are used to watching, not even the usual kind of musical. It's just a wonderful film that will make you forget the world out there.",
            "review_date": "2001-11-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What about Nino Castelnuovo?",
            "content": "I have read through many - but not all -- of the comments on this movie, and I am shocked -- just shocked -- not to find any praise for Nino Castelnuovo who plays the mechanic-draftee Guy.  Everyone seems to be captivated with Catherine Deneuve -- which fascination is understandable, I admit.  But lack of attention to the centrality of Guy's role -- loved, betrayed, redeemed -- and blindness to the acting and handsomeness of Nino, are totally, totally unforgivable! IMHO.",
            "review_date": "2000-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful, laid-back movie",
            "content": "The Umbrellas of Cherbourg is a very pleasant movie from 1964 that I was finally able to catch on TCM. I was drawn into the opening credits shown against the rain falling on a cobblestone street. I did hesitate to watch this movie because the dialogue is sung. In fact, this actually made this beautiful movie more of a treat. With severe hearing loss and trouble keeping up with rapid fire dialogue and captions, I found the movie a positive change from many reality shows that totally ignore the need for some of us in the viewing audience to hear clearly. The story is about a lovely young woman, played by Catherine Deneuve, who works with her mother in an umbrella shop in the wet, coastal climate of Cherbourg in France. Deneuve's character is wooed by two men who are literally too good to be true. Her first love is sidelined for two years when called up for military service. This absence results in another suitor who has more money and is just as sincere but he cannot replace her first love. Needless to say, circumstances change. How will it play out? Without giving anything away, it ends very naturally. With this movie, I can appreciate the satisfaction that comes from taking time to catch up with a little gem from the past. Turner Classic Movies to the rescue.",
            "review_date": "2019-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Under my umbrella (Ella ella eh eh eh)\"",
            "content": "Checking a selection of Euro Art-films which my dad had kindly picked up on video for me,I was pleased to see that one of the movies starred an actress who I had heard about for some time.Searching round on IMDb,I quickly got the answer,when I found that the film had been chosen for the IMDb's Indian Cinema board's next joint viewing,which led me to grabbing my umbrella,and getting ready to come face to face with Deneuve for the first time.View on the film:Using the opening of the movie to have Roland Cassard take the audience into the film's startling Technicolour world,writer/director Jacques Demy teams up with costume designer Jacquline Moreau to smartly contrast the dark troubles facing Roland and Genevieve's families by aw-ashing the film in dazzling,flowing colours,which along with perfectly matching the detailed costume work of Moreau,also creates a lively atmosphere as the couples relationship increases in passion.Along with the shining colours, Demy also uses expertly stylised constantly moving,long tracking shots to show the life is so exciting and fast moving that Genevieve and Roland don't have a change to notice the changing backgrounds,until freezing the camera,to show the harsh,war light of reality hitting the couple's dream.For the screenplay, (all of which is sung!) Demy shows an impressive restrain of not including any fiddly,overly complicated words,but to instead go for something much more brilliantly simplistic,that allows the viewing to be completely caught,in the pure joy of Genevieve and Cassard's dates.Sharing almost every scene with each other for the first half the film, the beautiful Catherine Deneuve and Marc Michel each give splendid performances that perfectly compliment each other,with Deneuve showing Genevieve to have stars in her eyes every time she looks at Cassard,whilst Michel shows Roland to be someone who desperately wants to see the same stars that Genevieve does,but is sadly unable to get away from the harsh reality taking place around them.",
            "review_date": "2012-09-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heartbreaking",
            "content": "Little more I can add that has already be said, other than that this has the most heartbreaking ending of any film I can think of. The stoical way the guy turns down the chance to see the daughter he has never seen and gets on with looking after his petrol station slays me every time.Everything that is great about French cinema is here. The emphasis on human relationships over plot, the disregard for tradition, the love of women, the love of life.I would recommend anyone who likes this film to check out Coppola's One From The Heart too.",
            "review_date": "2006-01-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a lovely treat for eyeballs and eardrums equally",
            "content": "A three-act musical (or four if one counts the final reunion independently) with all dialogue sung by its characters, the second of its unique kind I've watched so far, the previous one is Tom Hooper's LES MISÉRABLES (2012, 6/10), THE UMBRELLAS OF CHERBOURG is director Jacques Demy's third feature, a controversial Palme d'Or winner, more for its groundbreaking technique than its own substance, nevertheless it instantly launched the starlet Catherine Deneuve into stardom and has initiated her extended and illustrious career not only limited in the French cinema.Denueve's glacial beauty is her calling card even in her earlier stage (the dismissive DONKEY SKIN 1970, 4/10, another Demy-Denueve collaboration, does her wrong to disguise her as a free-spirit and spontaneous princess), at the age of 20, she plays a young girl Geneviève living with her widow mother Madame Emery (Vernon), they are running a chic umbrella shop in Cherbourg in 1957, Geneviève's sweetheart is Guy (Castelnuovo), a young boy working in the local garage and lives with his auntie Élise (Perrey) and an orphan girl Madeleine (Farner). The film is slickly divided into three parts: departure, absence and return, Guy is mandatorily drafted in the army in 1958, two lovers have to be split for two years. In the second act, told in Geneviève's perspective, she is pregnant with Guy's baby, but gradually persuaded by her mother to marry an affluent man Roland Cassard (Michel) and they left Cherbourg after the wedlock; and in the third act, Guy returns from the war, becomes despondent of Geneviève's betrayal, but life must go on, he inherits some fortune from Élise and marries Madeleine, and they have a boy named François.Years later, they inadvertently meet at the gas station owned by Guy, Geneviève is accompanied by their young daughter Françoise, always the most awkward reunion for two former lovers, the film ends in a more rational note when they gingerly trade conversations, leaving too many unsaid undertones flowing torrentially, and a timely farewell is a befitting coda to the lingering blues. The story may be a bit sad and nondescript, but the biggest asset is its varicolored locale settings, costumes and coiffure à la mode, even for the not-so-rich protagonists. Guy's brown suit ill-matches his black shoe, nevertheless his azure and pink shirts are divine, as for Denueve and Vernon, the daughter-mother pair dominates the show every time with their distinctive flair for haute couture and color compatibility.Also, let's not forget it is an out-and-out musical, singing voices are all dubbed at post- production nevertheless, French is already mellifluous in speaking, so the singing part sounds like an unremitting bombardment of chansons, which inconveniently degrades into monotony soon after, thus it does demand a more tonality-friendly ear to revel in the excessiveness, after all, it is a love letter to the sentimental romantics, a lovely treat for eyeballs and eardrums equally.",
            "review_date": "2014-07-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Most underrated film",
            "content": "First i want to thank Damien Chazelle and Justin Hurwitz . The reason i bought this Blu-ray disc is because it's Damien Chazelle and Justin Hurwitz's favorite movie of all time ! And i love film La La Land as well , according to what Damien Chazelle and Justin Hurwitz said , this film became huge inspirations for the film La La Land . So i decide to watch this film , and what a surprise ! This movie is most beautiful french film i ever seen ! And just like La La Land , it's full of magic ! The film soundtrack is beyond excellent ! Heartbreaking story and true love , how i wish that girl named Francoise live in white gas station . After watched this film in th last day of 2018 , my heart is full of happiness and loves ! Today is aslo the day that La La Land left TOP250 List , i don't know why those movie with heartbeaking ending are such underrated , but as long as we know those movies are the best , that's good enough .",
            "review_date": "2018-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Candy-coated tragedies and operatic first loves",
            "content": "A quick bit of personal history: I first saw this in May 1996 theatrically, in a newly-restored print. It was about a month after breaking up a 6-year relationship which I didn't want to end, though I should have. She was probably the least-romantic person I've ever met - not that she didn't have \"romantic\" notions in the larger sense, nearly everyone does, but the romantic part of relationships she didn't get. Or her idea of romance was just so remote and unexplainable that I could never figure it out, and she could never have told me. Why 6 years, I'll never know. She probably hated this film. I, on the other hand, am as enraptured by it now as I was on that first viewing 13 years ago and the couple of times in between. From the first shot of the harbor of Cherbourg panning gracefully down to an overhead shot of candy-colored umbrellas in the rain, to the final mirroring shot of an equally artificial-looking Esso station in the snow five years later, it's pure sentimental, stylized magic. Some have mentioned that there isn't much in the way of character development in this admittedly very simple story of young lovers parted by war and ultimately finding new relationships and lives apart from each other - but I think they're missing the point. It's not supposed to be terribly real, or rather it is suffused throughout with a sense of heightened reality, exemplified most obviously in the entirely sung dialog and in the brightness of the color scheme, but also in the intensity of emotions that could, after all, be experienced by any of us. It doesn't matter that I don't really \"know\" Geneviève or Guy - they are any young lovers and what the film is about, it seems to me, is that bittersweet feeling we all have towards our first loves. At the end of the film, both are married and it is fairly clear that they have made the right choices - one thing I find fascinating is that the two leads are both rather weak and passive, and in both cases they end up with stronger, more aggressive and more competent partners. Had they ended up with each other, what kind of future would they have had? The music - well, you can't take the music out, or it does, in fact, show its thinness. Here's a great quote from Jonathan Rosenbaum's long review regarding composer Michel Legrand's contribution to the film: \"Though Legrand isn't credited as the film's co-writer, his collaboration with Demy, who wrote the lyrics, suggests that he may well deserve to be, for this is a film in which the score and the narrative are inseparable, shaped to the same architecture. Demy once noted that Umbrellas should be described as a film 'in song' the way that some films are 'in color.'\" If one can't get past the notion that this is, in fact, a romantic fantasy amped up to the nth degree through color, through its plot absurdities (one night of passion resulting in Geneviève having to marry the diamond merchant, Guy's beloved godmother dying on the same day he learns of Geneviève's marriage and quits his job, etc) and most of all through the hyper-romantic music which runs the gamut from jazz to chanson, then there's not much I can say. You have to fall under the spell and take it as it is, not ask for what it doesn't provide - asking for more realism in the relationships seems to me to be missing the point. For me the only real flaw in the film at all is Deneuve, who at 21 really is a little too old for the naiveté of Geneviève, but this is a very minor point in a film that I can never grow tired of. I like Demy's next musical, \"The Young Girls of Rochefort\", possibly even more -- and I'd suggest all who love this to make that a priority. All who hated this of course should avoid it like the plague, unless they can find a way to put themselves under the spell that they somehow missed in watching this sublime confection...",
            "review_date": "2009-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "115 reviews so far...",
            "content": "... and they condense every possible information and observation one can make about this awesome movie. I will see it again out of an intense curiosity and nostalgia (I saw it many years ago and left me flabbergasted --patidifuso-- with all its fantastic beauty) after having listened the radio program I mention further down.I write these lines not to review one more time the film, but just to comment that I was listening a radio program from France Culture radio and they made a reportage about Cherbourg, where this movie was shot FIFTY YEARS AGO... and they are celebrating that anniversary in Cherbourg pulling out all the stops.It seems that the filming on that location 50 years ago was a big happening for this small and quiet coal town, apparently very dirty and facing away from the waterfront (now they have changed that concept and all new buildings are facing the waters) since then the huge popularity of this movie worldwide was such a ground shaking event for the inhabitants that they became aware of their own ignored potential and started to change everything, renovating shops and cleaning the city, to such an extent that nowadays the place is unrecognizable from its past dreary image.Japanese tourist go there to visit the umbrella shop where part of the action takes place (still looking and functioning like then) and even French people go there to visit the shop and take pictures!! During these fifty years Catherine Deneuve appeared in 117 films, leaving behind an enormous quantity of documentation to her legendary ice blonde beauty.",
            "review_date": "2013-05-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good, but not Marvelous",
            "content": "I liked the Umbrellas of Cherbourg, but was acutely aware that it was gimmicky. The American musicals of the 1950s obviously influenced this film quite a bit, and that genre was already nearly dead in the world as filmmaking began to move into the more artistic (American) films of the 1960s, like Bonnie and Clyde or Butch Cassidy and the Sundance Kid. The gimmick, to have every line, no matter how mundane, sung by the actors, is interesting at first, but after about 30 minutes, it gets old. The music is never all that great in the first place, and it is really repetitive. Also, the actors aren't very good singers. What I did like was the art direction and the costumes. The color schemes are very interesting throughout the film. But even this, the best part of the film, owes a lot of debt to the American musicals of the 1950s, especially An American in Paris and Singin' in the Rain. Remember the color schemes in the extended \"musical number\" sequence near the end of Singing in the Rain where Gene Kelly proposes the grand finale of the film they are making? It involves a goofily dressed Kelly trying to find a job as a dancer. Especially memorable in this scene is his dance with Cyd Charisse, decked in a gorgeous green flapper dress. Basically, the Umbrellas of Cherbourg constantly looks like it takes place in the same world as that scene in Singin' in the Rain. I would suggest renting those two films before The Umbrellas of Cherbourg. And if you want a French musical, I suggest Le Million.As for the rest of the movie, i.e., the plot, the dialogue, etc., it is extraordinarily light. It is very two-dimensional and it is instantly forgettable. It isn't very romantic, and it is very predictable. It reminded me a bit of Elia Kazan's Splendor in the Grass in its plot, but it doesn't produce the same feelings in me that Splendor did. All in all, I would still recommend it if you're a lover of world cinema, but I'd just warn you not to expect the masterpiece that it is often touted as. I give it a 7/10.",
            "review_date": "2000-09-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bittersweet French Musical",
            "content": "The teenage daughter of a woman running a financially-troubled umbrella shop in Cherbourg conflicts with her mother. The slightly older boy working as an auto mechanic at a garage is living with his elderly and sickly godmother, who has a young woman come in occasionally to take care of her, has conflicts of his own. He and the daughter meet and fall in love...but as expected, the boy gets drafted and has to serve in the military for two years with war in Algeria going on. They must separate, but will the romance last? Especially with the daughter unexpectedly pregnant and a rich man also desiring to marry the daughter? The movie has its dialogue entirely sung, and the sets are in very bright colors. Despite this, the characters and their interactions are all believable, and the story line, though not entirely predictable, does follow a logical path. The movie is basically a confection, but it works.",
            "review_date": "2017-10-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perhaps the greatest French film ever made",
            "content": "Although I am a fan of French cinema, I feel this movie can be enjoyed by everyone.  The story of two lovers separated by unfortunate circumstances has been told so many times that by now it has to be sung.  The beautiful music, the lovely singing, the bright colors and the gorgeous young couple betray the harshness of life in Cherbourg.  Ultimately, the wonderful gloss of the movie can not hide the pain experienced by everyone involved when the realistic \"wrong\" path is chosen by Deneuve.",
            "review_date": "1998-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sort of like MADAME BUTTERFLY, with a sunnier ending",
            "content": "Or, for those of post-operatic sensibilities, it's kind of like a version of MISS SAIGON in which only the old people pass away. Certainly it is a stepping stone to that recently overwhelming musical and visual treat, ACROSS THE UNIVERSE. While many others see this story as sad, bittersweet, and poignant, it strikes me as more of a case of just desserts being dished out to ALL of the lead characters. If you watch THE BATTLE OF ALGIERS, which came out about the same time as UMBRELLAS, the terrorists win. On the other hand, though the French misadventure in Algeria plays the pivotal role in the lives of UMBRELLAS' lead characters, life goes on for them with only the amount of bad karma they collectively deserve for living in such a country. Americans may best understand the distinctions between these two cinematic approaches to the French war against Algeria by viewing BATTLE OF ALGIERS as that conflict's THE DEERHUNTER, while UMBRELLAS takes the position analogous to GOOD MORNING, V1ETNAM! But apart from any parallels, UMBRELLAS is an incomparable feast of ear- and eye-candy that should not be missed.",
            "review_date": "2009-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unusual, romantic and realistic (Spoilers)",
            "content": "\"The umbrellas of Cheurborg\" is an very unusual musical. They're is no dancing or talking. I enjoyed the singing and melody.I think it's interesting that they never stop singing, because it probably is fairly difficult and needs a lot of talent. And that's what they indeed have! The singing becomes so natural, that you even stop thinking about it! I was surprised to hear someone talk after the movie. Also, the colors are extremely bright. Especially the pink wallpapers in the heroines house and her green dress she wears in the beginning. It's also interesting how it starts with the hero, then switches to the heroine, and ends with the hero. Catherine Deneuve has a charming charisma, and is a real treasure. She and Nino Castelnuovo have a nice chemistry, which makes the film successful in the romantic elements. The heroine's mother is a typical way of portraying parents in films, but Anne Vernon pulls it of so well that it didn't bother me at all. All characters are believable and even the end is realistic. I won't tell you how it ends, but believe me, it ain't no stupid Hollywood ending! Everyone I know have dedated whether the endings sad or not- personally I don't think so. I have to also say, the translation is perfect! I have come across a few fairly awful ones, so it was a pleasant surprise to see that they had really tried with this one. The directer, Jacques Demy, impressed me with his brilliant, superb, moving writings and directions. He has created one of the most beautiful love stories. And I just don't like any romance stories, so believe me, this one works perfectly! It's also one of the most spectacular musicals. It a movie everyone should see, from youngsters to adults.",
            "review_date": "2006-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Interesting and respectable classic",
            "content": "For me, this is one of those movies that become delightful and thoroughly likable once you know it in its entirety. In other words, it is not about the surprise's force\u0097but about the meaning of the acquirement. The film's force comes from its conception, from its aesthetic principles. The content is skillfully distributed. Excellent and satisfying shape, that uses but six characters\u0097a minimum of characters.It is Deneuve's film, undoubtedly. Exquisite and even thrilling beauty, Deneuve made the '60s her decade. She had several opportunities\u0097she used them fully. Les Parapluies De Cherbourg came when Catherine Deneuve was 21. Throughout the movies, she looks stunning. By then, she was already a mother\u0097she had a son with Roger Vadim, Christian Vadim-- born in '63. (Roger Vadim was the first of her more famous liaisons , followed by other four men--David Bailey, François Truffaut, Marcello Mastroianni and Pierre Lescure).It's also obvious that the director understood well the advantages of this highly stylized dramatic form, and he gave it a decent content. When Demy used them, these melodramatic devices were no longer real internal necessities\u0097on the contrary, as conventions they were a luxury. It is Demy's merit that he abstained from turning them into whims. He made them work is this film. He gave them some meaning. Demy gave his stories and intelligent and unconventional air. It is known that each frame is a plastic and color composition. The musical theme that signals the couple's scenes knows a deserved fame. On the other hand, there aren't any other songs worthy of mention in this film. Les Parapluies \u0085 is one of the giant machineries conceived by Demy, and meant to startle, amuse and amaze. Here the canvas is very small \u0096only a few characters, as I said, and a masterful pace--,yet the impression is of a big machinery , a big machine made by Demy for it's own sake, a pure demonstration of the virtues of a genre. In this sense, Demy's reputation is fair, he is rightly perceived as a creator of such intelligent delightful machineries that have as purpose the grand fun. Demy's whole career as a director was a project\u0097an experimental project. Fortunately, it was also a successful one. He achieved to manage this fancy genre he had patented as if it were a popular genre, though it obviously wasn't. In cinema, I love bold projects, experiments, large scales, the dynamic continuity, the identity. I like the achievements, the ideas that manage to be transformed into a functional work of art. Demy's career is one of the success stories.The masterpieces\u0097or at least very good movies-- that Deneuve made in the '60s are well known\u0097several delightful classics\u0097between '64 and '67-- Les Parapluies De Cherbourg, Repulsion and Belle De Jour\u0097or, in other words, Jacques Demy, Roman Polanski, Luis Buñuel. Her best roles are, I think, in the last two of the films indicated. In Les Parapluies \u0085,Deneuve is not required, of course, to give any extraordinary creation; on the other hand, she looks quite glamorous, and there are some moments when she is endearing. The role doesn't elicit much _expressivity, and the performance given by Deneuve is understated, of a praiseworthy undertone.",
            "review_date": "2007-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Is there an Oscar for wallpaper?",
            "content": "The story is on the level of soap-opera, the music is generic French-ballade (the main tune seems to be a rip-off of the folk-song Moscow Nights), but the pictorial composition makes this film worthwhile. Every frame should be studied by decorators and dressmakers,and constitutes an art-work in its own right.It's novel the way every line of dialogue is sung, while sounding thoroughly natural, though Lady Macbeth of Mtsensk (1992) manages the same thing with much more force.Recommended for its visual beauty, but don't expect to be swept away by it.",
            "review_date": "2003-05-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great style and ending, but mostly the singing detracted from the narrative and characters",
            "content": "This film has been name-dropped by many recently – or at least by those much more versed in cinema than I. I try not to be swayed by this – although it helps that the IMDb comments contain a good handful of overly snobby comments about how unintelligent others must be for not loving this film. So let's take this as another sign of my lack of intelligence then, because I did not find Umbrellas of Cherbourg to be as great as many suggest. There is a lot to love about it though. The great colors and style throughout; it is dated to a time and place that maybe didn't ever exist – and it looks great, and feels so effortless in its coolness. This quality is very much part of the ending too, however the conclusion to the film is much more than the beautifully shot moment that it is – it carries an emotional weight and honesty to it that really works well.The score adds plenty of color, and fits the production design to a tee. Unfortunately, though the singing left me cold – which understandably had a massive impact on how I was able to enjoy the film. I did not like the singing style throughout. The way it was done seemed to make all the delivery sound the same. It also seemed to reduce the narrative in nuance and detail, leaving it rather broad most of the time. It still had strong moments, where the actors gave more than the material offered them in the dialogue, but mostly it felt limited.For sure it was still a very cool watch, with several great moments – the best of which is a very strong ending – however too much of it failed to land with me.",
            "review_date": "2017-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Top Ten Musicals of All Time",
            "content": "How does one describe a Jacques Demy movie to someone that hasn't seen any of his films? Demy has made a few films that are the pique of delightful Technicolor musicals. His movies are bright and colorful; his stories, unique and heartwarming (or heartbreaking); and his music scores are absolutely divine. I've seen three of Demy's films thus far, all of which have featured my favorite actress, the pulchritudinous Catherine Deneuve (\"Repulsion\"), but out of all of those, \"Umbrellas\" is by far my favorite. While \"The Young Girls of Rochefort\" provides some of the best music in his whole oeuvre (which, I might add, was incredibly influential to Damien Chazelle in his production of \"La La Land\"), and \"Donkey Skin\" provides a delightful spin on a classic French fairy tale, it's this film that I'm drawn back to, over and over and over again. I honestly think it's in the top ten musicals ever made. The music is wonderful, the sets are gorgeous, the story itself tugs at your heartstrings, and the characters are nigh unforgettable; this is truly a magical movie, one that I recommend to everyone.",
            "review_date": "2020-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Creative, but not unique",
            "content": "\"The Umbrellas of Cherbourg\" is a beautifully filmed story of Romance in '50s France.  It's about young love that just can't be because of a disapproving mother, a war, and a mild surprise in part 2.The film in one way is a novelty since ALL of the dialogue is sung.  It's not just a musical with spoken dialogue and musical numbers.  But it's not a greatly original concept.   It's really a filmed opera with fancier sets. Like an opera, the story is told in 3 acts (or parts).  And like an opera, all of the dialogue is sung.   A typical opera usually consists of an overture, preludes to acts, arias, recitatives, and choruses.  There's little to any in the way of recitatives (i.e. monologues) or choruses, but is plenty of the rest.Michel LeGrand had the unenviable task of scoring all but about 30-seconds of this 87-minute film.   That said, he did a fantastic job, and managed to use probably no more than 6-8 themes for the entire film.  Of course, this means you may get tired of some of the music after a while... but at the same time, you become familiar with the music and are able to pay less attention to that, and more attention to the story as it develops.By no means, is it the greatest film or even musical, but it is very enjoyable.  Rating: 9 of 10.",
            "review_date": "2001-05-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Glorious All-Song Modern Opera",
            "content": "Michel Legrand's classic of French cinema is more like an opera than a typical musical. The film's dialogue is all sung as recitative, even the most casual conversation. The beautiful melody \"I Will Wait for You\" reappears seamlessly and ironically throughout the film. Directed by Jacques Demy and starring Catherine Deneuve and Nino Castelnuovo, the movie tells the story of star-crossed young lovers who are separated after she becomes pregnant. It seems they must be headed for a happy ending, but there is more to the story than that. The snowy scene at end is a real tearjerker. Every stylish frame of the film is like a work of modern art. \"Umbrellas\" is the middle film in an informal \"romantic trilogy\" of Demy films that share some of the same actors, characters and overall look; it comes after \"Lola\" (1961) and before \"The Young Girls of Rochefort\" with Gene Kelly (1967), both interesting to watch for many of the same reasons. Translation alert: You do not need subtitles to understand what is happening in the film. ---from Musicals on the Silver Screen, American Library Association, 2013",
            "review_date": "2020-04-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm sorry, but no",
            "content": "Imagine that one day, people just start singing at you -- not singing songs or hymns or arias, but just pointlessly warbling everything they have to say, from \"Good morning\" to \"You want fries with that?\" How long do you think it would take before you slapped someone across the face and screamed, \"STOP SINGING! Talk like a normal human being!\" For me, it would take about twenty minutes. And that's what I learned from *The Umbrellas of Cherbourg*.The music seems primarily to serve the purpose of stretching a fairly thin plot across ninety minutes of screen time. In a real musical, with good songs and dancing, this can actually work (see, e.g., *Singin' in the Rain* and *On the Town*). But this isn't a real musical, more's the pity.Apart from the cinematography (and even that gets cloying by the end) and the opening title sequence (which is truly wonderful), I honestly can't see what so many people see in this film.",
            "review_date": "2007-09-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Sweet Film.\"",
            "content": "Art cannot be for someone who fears. The director's approach fits in this quote. When I learned (before seeing the film) that it was a musical, I expected a rip off of the sound of Music. But when I started watching, everything started to look weird. All the dialogs in the film are in a musical way. You start to feel funny and irritated at the same time. The story is a very general, so do not expect much from it. It is just one normal love story that has a neutral ending with a good message. But what makes the film a must watch is its colorful cinematography. If for the first few minutes you are feeling irritated because of the musical dialogs then just wait some more and you will find yourself completely immersed in the film. After a time the dialogs, with music and everything look so normal that even such a predictable story can make you feel happy. It needed a lot of faith to make a film like this. The director has given a beautiful film which is definitely going to make you feel lighter. The most charming thing of the film is that none of the characters is shown as evil. It is the circumstances that are acting here as the obstacles. The film made me remember the films of Ghibli studios by Hayao Miyazaki. The film won the Palme d or in its time. But this is not the reason why you should be watching this, but that it is very much watchable in its own weird way.MESSAGE: \"Life\"VERDICT: \"A recommended watch.\"",
            "review_date": "2013-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Overrated",
            "content": "\"Umbrellas of Cherbourg\" is a very critically acclaimed French musical film but it is also very overrated and not nearly as enjoyable as people make it out to be. The musical score is very weak and limited in scope and use. All of the dialogue is sung acapella in soft voice and monotone which makes for a very dull movie, and which doesn't allow proper emotive expression and variability in the dialogue and action (of which there is little). The plot is too basic and the characters too wooden and undeveloped causing the viewer to care little for them. This 90 minute film felt very long and was a challenge to get through. Really the sole positive here is the nice cinematography, colors, and visuals. But not a film I would recommend except to real cinephiles and lovers of obscure arty films. I rate it a 4/10. I enjoyed \"The Young Girls of Rochefort\" much more and gave that a 9/10 rating. If you're looking for an engaging musical see Rochefort instead.",
            "review_date": "2022-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An absolute gem - possible spoiler",
            "content": "Just saw this film at long last on Sundance channel. I was in high school the year it came out and remembered the theme music which enjoyed a fair measure of radio play at the time. And, I had seen other films by Catherine Deneuve, so I was pleased when I happened on it. The non-stop singing and the vivid colors were a bit much at the beginning - I was a bit reminded of Baz Luhrman's Moulin Rouge although that had much larger sets and more obvious camera movement. Following sub-titles is also a challenge - three and a half years of studying French in school has left me with a limited ability to read French and almost no ability to follow a conversation, let alone songs. And yet, the music is so good and so much of the film just makes sense emotionally that you could almost figure out what is going on without any words at all. The use of explicit titles to identify year and month as the story jumps across several years helps to keep the audience on track with the development of the characters and there relationships, as does the obvious clues to the seasons (flowers in spring, snow in winter). The snow falling in the final scene just before Christmas helps to set the mood as snow makes everything perfect and new and covers all the hurts of the past. BTW, I don't know if they did product placements in films in those days, but a few scenes (especially the end) almost look like a commercial for Esso petroleum products.",
            "review_date": "2007-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Power of the theme music",
            "content": "The emotion I had still remains in me. The melody of the theme music still remains in my brain, and I can't help singing it. I don't know any other film in which the theme music is that important. It is as if the theme music is the film itself, and the plot and acting are adjunct to it.All lines are sung, but complete music is the theme music only. By this format, you don't have to care about the logic behind the plot or about detail of acting. The whole film invokes strong empathy of the audience. And you may recall the memory of your own love affair long ago.Personally, it is why I was so moved that the memory 38 years ago came back. One day, I met my former lover at Tokyo station with my 3 years old son. Watching the film, I recollected the complicated, wistful, awkward feeling of the time. I could not help tearing at the last scene.By the way, the most outstanding point of the film is that all the lines are sung. Even the line \"I don't like Opera, I can't stand all the singing\" is sung. Is it successful? Yes it is. By singing all, the lines have to be blunt. But this enhances the emotion of the love story, because love does not need reasoning. After Guy's aunt died, Madeleine says she is leaving the house. Guy asks her to stay, and she soon changes her mind. The conversation is so simple, that you know they are already attracted to each other.Another point is that everything is beautiful in the film. How beautiful Geneviève's mother is! And this town looks so beautiful by raining.",
            "review_date": "2009-03-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sometimes it's unclear why some movies are regarded as classics",
            "content": "I've been wanting to see this movie for a long time. Especially after an old colleague who went to film school told me it's one of his favorites.Full transparency: I don't generally like musicals, but that doesn't mean I automatically hate every single one of them. But is this really a musical? Granted, every single line, no matter how mundane, is sung (sort of) but are there any songs? It's as if every actor freestyled whatever they felt like on set and then it was up to some poor composer in post to try improvise some non-descript light jazz to fill in the gaps. I finished this movie five minutes ago, but I'll be damned if I could hum even one tune or theme.The story is paper thin, and so are the characters (a generous use of that word). The movie might just as well have been a silent movie, because everything in the acting is BIG.I worked as s lighting technician and designer as well as a photographer in the 90-00's and I have to say that this movie has some interesting shots, especially in the beginning. But that's not enough to save a movie.I'm giving this movie an extra star for an unintentional piece of humor in the end which made me laugh. Guy's wife and son are about to head out in heavy snowfall, and to protect him from the cold they put him in a raincoat. With zero insulation. Where are child protective services when you need them?",
            "review_date": "2022-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "magical",
            "content": "What can I say, this is one of the most magical and beautiful films I've ever seen. It does sound a bit silly at the beginning, with all that singing in the garage, but then it just takes over you entirely. A word of warning though: don't watch it with your girlfriend. Because, sorry, but it is not about her, it is about the past. About things that were happening once, that were so great while they lasted, but that did not last long. That you want to forget, and yet don't want to forget. If you were ever young and full of love, and then the world collapsed, and yet you now feel masochistic enough to actually want to re-live every single moment of it, then this film is for you.What amazes me most is that this film is actually so incredibly simple. Despite all the singing, there is no high poetry, dying of love, pompous gestures, and all that stuff. But that's precisely what gets you, what makes it so true and so how it actually happens. You just come, and she is gone, and then nothing makes sense any more. End of the world is actually amazingly simple, the world just ends.And about what happened to the Guy next. One might say that he moved on too soon. But I can tell you that the most unbearable thing at this stage is _not_ having someone next to you. When it used to fill all your life and now there is just void, it is simply beyond what you can comprehend or live with.And the finale! Wow. And again, there are hardly a few words there, \"How are you\" - \"fine\". Yet that's exactly how it happens. You want to say so much, you want to bring it back all over again. And yet you don't want it, you know that it won't do anybody any good, and it won't really happen. You cannot walk into the same river twice. The river is not the same, and you are not the same.And I haven't even mentioned the music. Which is absolutely magical. And again (did I mention it), it is so simple, yet it completely blows you away. It pours with rain, with snow, with sunshine. It promises, it worries, it straggles, it swipes with all the rain and sadness, it brings the past back. Every time you hear those accords, it just brings the tears to your eyes.It is so sad and yet so beautiful.",
            "review_date": "2008-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "POSSIBLY THE MOST HEARTBREAKINGLY BEAUTIFUL MOVIE EVER MADE",
            "content": "The music, the singing, the characters, the colors, the romance, the heartbreak - no, this isn't \"La Bohème\", this is \"Les parapluies de Cherbourg\"... but both are cut from the same magical cloth. I'm getting teary-eyed just thinking about this masterpiece. THIS FILM IS A MUST-SEE!!! ...sniff...",
            "review_date": "2018-11-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A film with a unique style that grows on you",
            "content": "This film is not only a one-off in cinema terms, it is in terms of any art form. It is not in the style of a usual musical or even an opera. While all the dialogue is sung as recitative as in opera, it doesn't have the regular musical highlights that musicals and opera provide. There are a number of very distinctive musical themes - most of which have been recorded by other artistes with completely different words - but at no point do we get an intended show-stopper - and there's definitely no dancing! So a first viewing can be a complete culture shock. I almost didn't persevere past the first ten minutes, but, if nothing else, the presence of Catherine Deneuve (whom I would watch singing the Paris phone book) persuaded me to continue. I did start to get the measure of things, but had it not been for the dramatic, sad, and possibly ambiguous last few minutes I'm not sure I would have returned to the film again. I did however do so, again taking a while to adjust to the 'rules' but getting increasingly involved again as it moved to the the conclusion. It was only on a third viewing after a break of several years and being ready for it that I fully enjoyed the whole enterprise - the bright colours, the town of Cherbourg which I know from a long time ago, Catherine Deneuve (I may have mentioned her already), the music with its restrained orchestration, the plot, and that ending.",
            "review_date": "2008-10-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A New Genre",
            "content": "A wise man once said a great song becomes a picture in which you can imagine the words. Now imagine a visually created musical universe of individual thoughts, all created by the same words, the same song. I know that might sound a little heady but even a MUSICAL has dialogue; words.\nLes Parapluies de Cherbourg, an unwise man once commented, WAS a musical, it is not! After a while of watching the film you forget the dialogue is entirely composed of song, and even though there were no songs that i went away humming from this picture, the images slowly became something other than film, and the songs became something other than song.With Les Parapluies de Cherbourg, Jacques Demy created something entirely new, something no other film maker has been able to achieve with film and music. Sure the great silent films of cinema's early days were able to achieve an atmosphere of people worship to which the entire film making industry the world over still suffers and although there was no dialogue and very little music, sometimes accompanied live with the showing of the film, silent films were never as Magical as this, simply because i have watched a few... and we always knew we were watching a film no matter how impressionable we were...Not only does Demy manage to create a world in which nothing is real seem real, he creates a place, love and a film along with A song that you wish were a part of. No!!! that isn't what I want to say...what I want to say is this... If you see this film it becomes a part of you and you will become a part of it. And as I like to think...in ALL the old cinema's and film festivals and private living rooms where this film could, can, and will be played... I know where ever it is showing it just isn't the same without me.Les Parapluies de Cherbourg stands as the only film ever made that is its very own genre. Others may have tried...but what sense does any art make if it doesn't at least attempt to be something original?",
            "review_date": "2004-07-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Vidiot Reviews...",
            "content": "The Umbrellas of Cherbourg Busking is almost like living in a musical except teenagers steal your change-filled hat.Fortunately, the vocalists in this musical have real jobs to do while they sing.Umbrella saleswoman Geneviève (Catherine Deneuve) is smitten with mechanic Guy (Nino Castelnuovo). But when he's conscripted into the Algerian war, she is left alone and pregnant in their French village.Encourage by her mother (Anne Vernon) to marry the local jeweler (Marc Michel), Guy returns from war to discover Geneviève has left Cherbourg with the daughter that he never knew he had.Years later, a chance encounter finds the former lovers face to face for the first time in forever.Considered an unorthodox musical on account that all of the dialogue is sung similar to an opera, this brightly hued tale is also unique in its true-to-life take on love and its unpredictability.Interestingly enough, karaoke in Cherbourg is actually talking off-key.Green Lightvidiotreviews.blogspot.ca",
            "review_date": "2017-04-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very beautiful and realistic film",
            "content": "This is a very beautiful and realistic film, whose final part messes immensely with us. During the movie we are not expecting such an ending. If it were a North American movie, with the same story, the ending would be different, the unfolding of the film itself would be different and everything would end up in a happy end, even more for a musical. It's not that the movie, as it ends, \"ends badly.\" It ends ... how it has to end.",
            "review_date": "2018-03-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unique and very enjoyable",
            "content": "I bought this DVD mainly for the beautiful title, which I've loved since first hearing it in the mists of childhood. I knew they sang, I knew Catherine Deneuve was in it, I'd heard the theme song. When I watched it, however, I was still pleasantly surprised. This movie is truly original - I don't think I've ever seen anything quite like it. It's a Musical/operetta (and they sing ALL the time) but with a very realistic and quite dark storyline. The story could very well have been told as a regular drama, totally without music, and would probably have worked very well. This does not, however, mean that the operetta treatment is superfluous. Rather it adds a dimension, something eternal and bittersweet, which only enhances the poignancy of Guy and Genevieve's bleak story. This would probably be a good starting point for everyone out there who claims not to like Musicals. First, there are no transitions (people bursting out into song) since every line is sung. Second, the music never causes you to lose track of the story or the feelings it conveys. Technically, I can wholeheartedly recommend the Tartan edition from 2001. ( ASIN: B00005B5YE, Catalogue Number: TVD3326). It's letterbox, the colors and picture quality are great for a forty-year-old movie, as is the sound (quite important). Not much in the way of extras, but some interesting notes on director Jaques Remy and the actors.",
            "review_date": "2005-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "beauty beyond violence",
            "content": "Monsieur Jaques Demy deserve more attention than he receives now. he made lot of brilliant films always clever and playing with borderlines close to fall in situations that could be very ridiculous, but he never fail and gives like in Parapluies de Cherbourg some of the most beautiful films ever. Les Parapluies are color, real color like nobody give us before(color as statement),is songs, never before a film was entirely sung, meaning every simple dialogue, a simple yes or no, is sung, is happiness but no an artificial one, happiness surrounded with problems like in real life; is locations that everybody knows(like a garage) in a middle of a musical, is the intelligence to tell a story beyond the easy plot solutions full of violence of these days; its a film that your old auntie can enjoy beside you and both can obtain something great for your own lives. Where at the start you just see a kitsch film, slowly becomes a masterpiece because the intelligent and coherent style of Monsieur Démy.",
            "review_date": "2004-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A dazzling but slightly flawed jewel",
            "content": "This film is powerfully rooted in a particular time and place (1950s France - specifically Cherbourg, during the Algerian War). At the same time, however, the director addresses universal themes of love, absence, opportunity and regret.The glimpses of Cherbourg are tantalizing, and somehow achingly beautiful for anyone who has ever spent any time there, and the color palette is simply stunning.Catherine Deneuve looks stunning too (she never looked quite like this again - even in the second half of the film she has already changed). The simple plot is carried along, at least in the first half, by the convincing nature of the relationship between Deneuve's character and her mechanic boyfriend.The film is slightly spoiled, however, by the rather disjointed plot in the second half, and the lack of variation in some of the sung dialogue (in fact there are no spoken words in the entire movie). However, it is worth watching for the look alone. The best music comes in the scene at the railway station, which somehow manages to feel emotionally authentic despite being so stylized.So watch the movie if you can. There is no other like it.",
            "review_date": "2001-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Genius. Gallic Genius.",
            "content": "This film is a glorious and beguilling mix of radiant Hollywood-esquire musical and melancholic Gallic melodrama. If it doesn't have you humming along to the tunes and drawn in to the story then you must be just about dead. The raindrenched streets and technicolour sets are nods to the great Hollywood musicals of the fifties, but this film is not about usual musical love story, it is about as real as you will get with singing characters. There is an almost perverse depression that pervades this film. A darkness. Lost youthful love clings to this film.The first act has all the romance of that first love, the second act is a quite beautiful meditation on a tough decision and the third act has all the redemptive darkness of a great character study.Catherine Devenue is stunning in the lead role, her luminous beauty and the characters understated sense of humour makes you understand Guys feelings in the third act.This film will make you sing, smile and cry. It is that good.",
            "review_date": "2006-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a treat",
            "content": "It's films like The Umbrellas of Cherbourg that are examples of how beautiful cinema can be. The love story here is one for the romantics - I still find it moving even after numerous viewings. The direction is stunning, it's wonderfully filmed, colorful, and very dynamic. It's a film that can help you escape from the misery of the world and absorb yourself in. Sung from the beginning to the end, it may not have the best vocal talent in the world on display, but being such an ambitious project, it's easy to get swept in. Whatever your views are on French cinema, or musicals, The Umbrellas of Cherbourg is capable of dismissing them with its romance and color.",
            "review_date": "2000-10-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Demy's Breakthrough",
            "content": "A young girl separated from her lover by war faces a life altering decision.This is the film that Jacques Demy will always be known for (his other films say \"from the director of\" this one on the cover). While not necessarily the best (that could be debated with \"Donkey Skin\"), this really exhibits Demy's sense of color and broad range of music that he had not really been able to express before and would go on to be known for.Catherine Deneuve as Geneviève Emery is the film's highlight, although Danielle Licari provided the signing (and with an all-singing musical, that makes Licari every bit as big a star as Deneuve). This film certainly helped launch Licari's career, as she did not release her first album until the following year with \"La Geographie en Chansons\".",
            "review_date": "2014-09-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "emotional, powerful and corny",
            "content": "This is perhaps one of the greatest french movies ever made. It could only be done in french - it simply would not work in english. And any attempt for Hollywood to do so would be a farce. It is a fantastic film because of the way it handles its characters and manipulates us to perceive them the way it wants. Yes, the ending is sad, but definitely the right one. I remember first watching it and although it took a short while to get used to the non-stop singing, the film soon grabs hold of you and you're not even aware of it. The signature tracks are all super and emotion-stirring too. The scene where Guy and Genevieve are with each other in the cafe, heads locked intertwined together, is perhaps the most heart-wrenching in the film. I had goosebumps. It is a corny film. And that is the best thing about it, there should be more like this today. The lack of them is a reflection of how our society has become.",
            "review_date": "1999-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sound of my youth",
            "content": "I must have been twelve when I saw this movie for the first time (1970). My mother, two younger sisters and I used to watch every romantic movie we could lay our hands on. The melody of the song \"Les parapluies de Cherbourg\" has stayed with me ever since. Every now and again I would hum it, never meeting anyone who recognized it. Seeing it again after such a long time was a new experience. Never expected it to be a cult-movie. Even my husband (he likes a movie when they're weird) liked it! Admitted, it's a strange movie, but I'll always feel that thoroughly romantic sensation when I think of it, as if I were twelve again!",
            "review_date": "1999-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Musical Realism?",
            "content": "The Umbrellas of Cherbourg (1964)\nWritten & Directed: Jacques Demy\nStarring:Catherine Deneuve, Nino Castelnuovo, Ellen Farner, Mireille Perry, Anne Vernon, Marc MichelGuy (Nino Castelnuovo) is a mechanic caring for and living with his godmother (Mireille Perry) frequently cared for by Madeleine (Ellen Farner) who is secretly in love with Guy. He's in love with Genevieve (Catherine Deneuve) an Umbrella merchant. After a night of passion Guy is drafter to fight in the War at Algiers and Catherine now pregnant gives up on seeing him again is persuaded to marry Roland (Marc Michel) a wealthy business man.You know how in bad musicals of the 50s-60s people break into song elongating a short plot with 6-12 songs that do not forward the story at all? Normally they can be about people in show business, or heightened situation where breaking into a random song sort of makes sense. You watch because your mom or girlfriend love the show, and therefore you humor them.It's rare a musical has songs that serve a purpose more than a variety show moment... at least to me.Umbrellas of Cherbourg is not one of these movies.In a Hollywood movie I could see this plot turned into a farce or upbeat musical comedy with an added 30 minute long dream ballet danced by Gene Kelly giving the movie a 2 hour plus award fodder length. Also not the caseThis is an opera essentially about two realistic characters living realistic lives and dubbing along to music. FYI: it was very common to dub everyone in musicals.The beauty in this movie is in its simple mundanity of setting and character. It's a bittersweet snd realistic love story where the main character finds what needs and desires not in the person he thought, but in the person life presented him. Madeleine is truly is true love. She knows the real him and is a poignant match.Favorite sequence: The end. Not because it's over, but a chance meeting reconnects Guy and Genevieve. In the end he owns his own gas station and mechanic shop. Genevieve accepted the belief Guy would amount to nothing and accepted a prosperous yet empty marriage based on this belief, which is sad because Roland is a good guy, means well, but isn't Guy. But here a Guy is, back from the war with his own gas station purchased by the inheritance from his godmother and pension. And here is his old flame, at his place of business, with the daughters she kept from him. In the end Guy makes the correct choice.Loved it. Real people in an opera. No Gods. No capes.FYI: the art of the movies easily launched the French fashion craze of the 1960s. Rightly so. It's gorgeous to look at. A meticulous work of art.",
            "review_date": "2021-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nicely-decorated but never involving",
            "content": "Writer-director Jacques Demy collaborated with composer Michel Legrand to create this 1950s French love story presented entirely in song. Catherine Deneuve and Nino Castelnuovo are the young lovers forced apart by circumstance and fate. She's the daughter of a shop-owner who sells umbrellas in the town of Cherbourg; he's a handsome 20-year-old service station attendant who's been drafted and will be gone for the next two years. Demy cleverly trims his picture with amusingly arty accouterments, which is a good thing considering his thin story (separated into three chapters) has very few characters, an abundance of mother-daughter confrontations (set to music) and simplistic story contrivances. The picture did give us the Oscar-nominated song \"I Will Wait For You\", which is more memorable than the actual film. *1/2 from ****",
            "review_date": "2017-08-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A unique jewel of a movie",
            "content": "I first happened on this exquisite jewel of a movie several years ago after my teenage son told me he'd watched an unusually poignant episode of Futurama featuring a song called \"I Will Wait For You\". Intrigued, i did some research and found that it was written by Michel Legrand and Jacques Demy and was from a cult French musical movie called The Umbrellas of Cherbourg, in which every word of dialogue was sung. This i had to see, so I ordered it up on DVD. From the minute i first started watching it i was entranced, and i still am today. My son watched it with me, and so was he. This unique film is almost beyond criticism. I don't agree with the often levelled objection that the central theme is slight. The pain of young love, and the dawning realisation of how the world really works, these are things of universal importance. I love the way the movie raises so many questions that could have so many different answers. Did Genevieve ever really love Guy? Did she/will she ever really get over him? Did he/will he ever really get over her? I love the way it creates the drama using believable characters who in their own ways, despite the mistakes they make, are all actually rather likable. The use of colour and attention to detail are amazing, the music striking and memorable, and the English subtitles are terrific. A lot of films are let down by their subtitles, but these are literate, witty and often quite subtle. (At least they are in one of the two versions I've come across. The other, which from its reference to gasoline rather than petrol I assume to be American in origin, is considerably inferior.)For all those reasons i would already have considered it my favourite movie ever, even before i recently and belatedly bought on DVD Demy's earlier film Lola. Watching that movie has brought a whole new dimension to Umbrellas. It features one of the characters in Umbrellas, Roland Cassard, and his love for a dancer, which is recapped briefly in the later film. We learn how although Lola has a good heart and cares for Roland, she can't return his love because her heart belongs to another man, Michel, the father of her child, who left seven years before and has never come back. She has never quite given up hoping that he will, but tells Roland she plans to go away for a couple of months to think about things, implying that there may be a chance for them when they meet again. Roland meanwhile is himself about to go abroad on business, so will also have a chance to put his thoughts in order. The situation is further complicated by Roland's friendship, mirroring what happens in Umbrellas, with an attractive widow who is obviously interested in Roland and has a precocious teenage daughter (though this one is 14 rather than 16).Lola the movie ends with Roland about to leave for Johannesburg, unaware that Michel has just returned unexpectedly and Lola has committed her future to him. Roland has spent most of his life up till now in his home city of Nantes drifting through a series of unsuitable jobs, and in desperation has agreed to a decidedly dodgy assignment involving the smuggling of diamonds. When we next see him a few years later in Cherbourg, 200 miles from Nantes, he's a rich and successful businessman in the jewellery trade who's always away on mysterious business trips. So what is he doing in Cherbourg? Has it got anything to do with the fact that the widow's daughter Cecile went there when she ran away from home? Was he bitter when he found out about Lola and Michel and how did it alter his view of the world? Is his wealth based on the proceeds from smuggling, and if so is Genevieve at any time aware of this? Why can't Roland aspire to anything more than a marriage of convenience? What's the real significance of the parallel between the two widows and their daughters? Could Umbrellas possibly have a darker subtext than is commonly suspected? You could keep returning to these questions again and again over the course of a lifetime, and that, more than anything else, is why i like this movie so much.",
            "review_date": "2013-11-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Umbrella for Your Thoughts",
            "content": "Shot on location in Cherbourg in northwestern France, the Umbrellas of Cherbourg is a tale, told through sung dialogue, of young love and separation. Winner of the 1964 Palme d'Or and favourite film of La La Land director Damien Chazelle, it has come to be regarded as a classic. The strengths of the film are plain to see but so are its flaws, notably a surfeit of sentimentality and its elementary story.The Umbrellas of Cherbourg is atavastic even for a film released in the 1960s. Its social conservatism and depoliticization stand in marked contrast, for instance, to films of the French New Wave. Set in the present, the film offers no criticism of modern life and reinforces traditional gender roles. The film interprets the actions of characters solely through the lens of old-fashioned sexual mores with the result that the characters' lives follow a predetermined course that is arbitrarily restrictive and unrealistic. Indeed, the plot is so simple and trite as to resemble a fairy tale. The ending departs from the formula slightly but is nonetheless predictable. Jacques Demy probably had every intention of making an uncomplicated, old-fashioned musical but intentions are no excuse for weak storytelling.The Umbrellas of Cherbourg is a veritable ode to colour. Almost every shot is awash with an array of luridly bright colours both contrasting and complementary. These colours amplify the intense emotions of the characters and reinforce the cheerful, light-hearted tone of the film. A skyward tracking shot of a blue sky dotted with clouds along a street lined with blossoming planes is particularly breathtaking, albeit comparatively restrained in its use of colour. Contemporary directors take the widespread availability and low cost of colour film for granted by overusing colour combinations, composing monochromatic shots, or simply paying little heed to how they use colour in their films. Demy, on the other hand, provides an extravagant feast for the eyes that will leave the viewer feeling satisfied and delighted, if perhaps a little bloated.The actors are suitably charming and attractive like almost everything in this film. Catherine Deneuve throws herself into the role of Geneviève which she credits for making her a star. She succeeds in bringing a rigidly stereotyped character to life, for instance, through her strategically-inserted bouts of emotion. Nino Castelnuovo shines as the jovial and amorous mechanic. Encumbered by the unimaginative writing, he is less persuasive when emulating the malaise Guy experiences upon returning from military service. The primary consideration in casting was evidently not singing ability. To be sure, Deneuve and Castelnuovo are capable singers in spite of having thin voices. Deneuve in particular is successful at conveying a range of emotions with her voice.Demy elects to have the actors sing every line of dialogue as opposed to having songs interspersed with ordinary dialogue. Sung dialogue sounds like a song but lacks the characteristic structure, such as the reiteration of certain sections, that can make a song catchy and appealing. Demy succeeds nonetheless in crafting a screenplay with rhythmic dialogue that effectively communicates the film's simple story. Like the film, the jazz-hued score, with its soaring strings and pleasant melodies, is appropriately maudlin.The Umbrellas of Cherbourg is a delightful but excessively sweet confection, replete with je'taimes and mon amours, laughter and weeping, vivid and kaleidoscopic colours, and charming and beautiful people. Its undeniable charms will take hold of but not transport you.",
            "review_date": "2017-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wet but wonderful",
            "content": "It's no news that Catherine Deneuve circa 1964 is the loveliest thing on the planet, or that Michel Legrand excels at writing wistful, ineffably French ballads (though they get rather over-recycled here). What makes this fantasy-musical-grounded-in-reality so watchable is Demy's graceful mise-en-scene, pastel palette, and uniformly attractive cast. The soap-opera plotting is nothing special, and Demy doesn't even bother to stay in period -- his 1957 looks just like 1964, the better to show off Deneuve's wardrobe. (And how does she afford those clothes on a shopgirl's budget?) But carping over details is useless in an endeavor as unique and sublimely romantic as this. The bittersweet ending feels just right. And you'd probably end up humming \"I Will Wait for You\" if Legrand hadn't programmed about forty reprises of it.",
            "review_date": "2002-03-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful",
            "content": "Beautiful visually. One of those films where you can't help but notice the importance placed on colour as it relates to set design, costume, props, etc. Painterly precision. Wanna teach someone the possibilities of great mise-en-scene? Almost every frame in this film could serve your purpose.Then there's the film's gimmick: all the dialogue is sung. When I was watching this film, I kept thinking one could write a really great paper comparing this film to \"Moulin Rouge\". Both unorthodox musicals. Both quite melodramatic. Love is the main theme in each. But to me, \"Moulin Rouge\" was multicolored whip cream compared to the sumptuous sundae, with rich ice cream, fresh fruit, and tasty chocolate syrup, that is \"Umbrellas\". I preferred the latter film in a major way. Of course, there are some who would prefer \"Umbrellas\" before even seeing it. Rare French New Wave flick vs. hyped Hollywood production? For elitist moviegoers, the choice is already made. That's not me, though. It's just, \"Moulin Rouge\"'s in-your-face approach represents the excited overachiever and Demy's film represents the calm ACHIEVER. See both and tell me you disagree.What makes \"Umbrellas\" so rich? It's a package. The story may be melodrama, but it is fascinating, beautifully-structured melodrama that holds you in its grasp as it unfolds. The story is extremely well-done and the movie has THE best ending I've ever seen in a romantic film. I won't reveal it, but let's just say that those ready to dismiss the film as sentimental before seeing it are missing out on pure genius. But the sentimental will enjoy this film as well. You have these baby boomers who look back fondly on stuff like Zeffirelli's \"Romeo & Juliet\" when this is 10x better. Anyway, characterization - amazing. Each character is fleshed out well and engrossing in their own way. Add to that impressive, touching, memorable performances as well as striking attractiveness (that last one is not something I look for in a film's characters, but for those who do...). Then there's the realness of the story - the way it touches on the politics and current events of the time (the war with Algeria, etc. - French colonialist pigs!).As I said, it's a package. Any complaint this movie could inspire would sound petty. I'll come out and say it - it's a masterpiece. If I made it, any slump I hit, I'd remind myself, \"I've made a masterpiece. I've made a valid contribution to the world of art. I am satisfied.\" If you get the chance, check it out. Without a doubt.",
            "review_date": "2001-07-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Rainbow of Color and Beauty",
            "content": "The Umbrellas of Cherbourg is one of the best musicals I have ever seen. Merely on a musical level, the score of the film is a wonderful achievement, with the lyrics and melodies feeling completely natural and appropriate to the situation. In fact, this film could be characterised as an opera since the recitative runs throughout. The themes are continually varied from situation to situation to fit the mood of the scene.Aesthetics is one of the strongest suits of the film, and the design of clothing and sets in the scene is brilliant. Bright, colorful visuals give the film an unique look, not faded with age or technology. It seems to capture the essence of the 1960's, of when it was filmed.When it comes to the plot, one can consider it cliched, but it is effective and well written. Young girl called Genevieve, from a rich family, is in love with a car mechanic Guy. She is even having a child with him, but just as he is preparing to take care of the child, he is called into the army to fight in the Algerian War of Independence. Meanwhile, Genevieve marries a rich suitor, while expecting the child of another, and breaking her promise of waiting for Guy.The film achieves near perfection with its ending scene. Guy, now a successful owner of a service station of his own, is visited by Genevieve wanting to fuel her tank with gasoline. The gaze and meet each other, exchanging a few trivial words of politeness with one another. The wistful memory of the earlier memory plays in the background, in the form a melody of a song they used to sing.",
            "review_date": "2023-01-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Charming (At First)",
            "content": "When this movie began, I was madly in love with it. I loved the colors and the cinematography and the opening titles and everything about the first sequence. And then we meet the characters, and we are charmed by their voices and how adorable the movie is, and the entire film keeps you invested. I was really into it until the last 20 minutes when the charm sort of wore itself off after a while. And that is NOT saying that the ending is bad, it isn't; it's just that this film might be a little longer than it needs to be. But the beautiful colors and glamor of the actors make this movie enjoyable, and the music is very nice to listen to. It sort of is like a modern day (well, 1960s) opera. No words are spoken; they are just sung. And it works, and the characters are interesting and the scenario is interesting. It's just that as it god near the end, I was looking at my watch a little more and more. It is worth checking out, and it is adorable, and it is a piece of film history. It's a wonderful experience that I think I could enjoy once, but not again after that.",
            "review_date": "2015-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful--But Where's the Blu-Ray?",
            "content": "One of the most beautiful movies ever made deserves a Blu-Ray release. I first saw \"The Umbrellas of Cherbourg\" a few years ago on cable with a dinosaur CRT television, and even in that format it glowed. I want to buy the disc, but I'm holding out for Blu-Ray.The movie is stunning in every way. I can imagine a couple of female friends sharing a bottle of wine and a box of Kleenex and having a good, purifying cry. It is everything that a filmed romance should be, an amazing sung story of lost love, with a poignant ending that is--depending on your viewpoint--sweetly happy or deliciously sad.If you haven't seen it yet, don't wait--see it now on DVD. Those of us who have already seen it will patiently await the Blu-Ray.",
            "review_date": "2012-09-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The majority of comments seem to miss the real meaning of the ending.",
            "content": "Many people seem to think that both Guy and Genvieve are aware that they have settled for second best.I don't think that was Demey's real intent. Guy is handsome, but not motivated to work hard enough to please a girl who sees herself as fit for a crown. The buffont hair, mink coat,& finery. Roland's trophy wife ala 1964 at 22! Madeline, on the other hand is every man's wet dream. Beautiful to the same extant as Genvieve, just \"STILL WATER RUNS DEEP\" sexier, and does she love their life together.? and does he? You bet they do!!The ending is the very greatest affirmation of sensual marriage and healthy family value ever committed to film! It is a secular moral revelation! It is a moral lesson like \"A Place in the Sun\", which taught that you shouldn't have ongoing sex with someone you know is unsuitable for marriage. I saw that at about 10...my father wanted me to start learning some practical morality!",
            "review_date": "2005-01-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A film for lovers, and for lovers of film...",
            "content": "Imagine the pitch to `le studio`: A realist Algerian wartime romance set to music with all dialogue sung `en francais`, which takes place in the nondescript fishing port of Cherbourg...Strange, then, that \"The Umbrellas of Cherbourg\" is a milestone of  European cinema. Superficially it has a simple storyline: garage mechanic boy falls in love with umbrella shop-girl; girl gets pregnant; boy is drafted to Algeria, love tragically compromised; boy returns; girl has begun lifeless marriage to jewel dealer, film ends on snowy garage forecourt. But from these banal `quotidien` details emerges Demy`s brilliantly  willful blend of continuous jazz-score, hyper-real colouring and sheer French style. A critic at the time commented that even the wallpaper should be Oscar-nominated, and viewing the wonderful 1996 re-print one can only concur. The music undeniably drives the film along, and central themes `I will wait for you` and `Watch what happens (theme de Cassard)` went on to be hits for Frank Sinatra, Tony Bennet and Jack Jones. Michel Legrand`s imaginative use of traditional orchestra with big-band jazz lead him to be approached for similar duties on `The Thomas Crowne Affair' some years later. Notable also for Catherine Deneuve`s cinematic debut as shop-girl Genevieve, the film simply dances in front of your eyes. (No mean  achievement for a story set in Cherbourg.)A film for lovers, and for lovers of film. If you want to know just what stylish direction looks and sounds like... you will be enchanted. Highly recommended.",
            "review_date": "1999-08-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Magnifique!",
            "content": "What a wonderful wonderful film. From the bittersweet singing, to the intriguing camera positions, to the story which is romantic without ever becoming melodramatic, to the music -a masterpiece in its own- , to the atmosphere, (watch that final scene with the gas-station in the snow and you'll get the point) all is styled so delicately.Sure, you've got to get used to the format.  Every line, every word, every whisper in this movie is sung.But it's well worth the effort. This movie is about ordinary people. In a surreal setting. And the beautiful thing is that the singing itself serves a purpose and you somehow feel the movie wouldn't grab you like it does now. It does so innocently. But deadly.",
            "review_date": "2000-06-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A movie hasn't made me shed tears since A.I. until I watched this.",
            "content": "As the credits rolled, I sat there with a tear streak still remaining on my face from a minute passed. I was bewildered. Bewildered by how this movie managed to invoke such strong emotion in me. It isn't a particularly sad movie. I'm not a even French movie buff. I'm not sure if I've even seen a French movie before. The movie is set in the small town of Cherbourg, France from 1957 to 1963. The walls are still all brick and mortar, covered with vibrant colors, hand painted on. Young Genevieve (Catherine Deneuve) lives with her protective mother (Anne Vernon) and together they run a quaint Umbrella shop in Cherbourg, France. Genevieve and Guy (Nino Castelnuovo) , a car mechanic at a local garage, are deeply in love and contemplate marriage but they are forced to put everything on hold as Guy (prounounced Gee in Geese) goes to serve his mandatory two years in the French army. Can their love survive the separation while she is being pushed by her mother to marry a rich jewel merchant by the name of Cassard (Marc Michel) in Guy's absence? It is a quintessential love story.Catherine Deneuve is breathtakingly beautiful. The characters are memorable and their personalities distinct. You might find that their relationship interactions a bit funny by modern standards but remember, this is set in the late 50s. Back when it was normal for ladies to lean on their partner's chest and caress his hands lovingly with their face.....while being pet like a cat. Still it added to the charm of the movie. The daintiness of the Genevieve that is, not the petting. The movie breaks down into four acts. After each act the movie fades to black and you are briefed on the next act. If you went and saw this movie upon its release, you went to the theater to watch......theater.One thing to note is that this is a different form of musical. ALL of the dialogue is sung instead of having musical numbers fitted in between spoken dialogue. The only other movie I've ever seen that has all the dialogue sung is \"Repo the Genetic Opera\". Imagine a gothicized Paris doing a musical number; Enough said. This one's much better.Back to the movie at hand, Michael Legrand could not have composed a more beautiful and fitting orchestral score. I must mention that the score is continuous throughout the whole movie from beginning to end. And it led to a beautiful song covered many great artists. The definitive and most haunting version by Connie Francis; Titled, \"I will wait for you\".The cinematography translates the charm of Cherbourg to film, wonderfully. The shots are simple and effective. My favorite shot in the movie is that of a departing train. I have seen my share of train scenes but I don't remember seeing it ever done this way.I recommend this movie, unless you despise theater, can't stand orchestral music and refer to French fries as Freedom Fries. I recommend watching it with your significant other (for maximum effect) and staring into their soul after the movie ends. Then put on some Marvin Gaye and get it on while keeping in mind that tomorrow may never come.",
            "review_date": "2011-09-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the greatest musicals",
            "content": "Although I am not a fan of the musicals there are certain \"classic\" ones that I love and The Umbrellas of Cherbourg is up there. It was weird at first that every line is singed but I got used to it after 10 seconds, also character's emotions are beautifully represented through their voice. I really felt all the emotions along with characters, especially the sad part. I don't have to mention that this is one of the best looking films ever, it made me wanna live in that colorful world. I wish the movie started with how they met each other, the impact on me would be much bigger that way.",
            "review_date": "2020-05-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Deeply sad and profoundly beautiful ---POSSIBLE SPOILERS",
            "content": "Jacques Demy's \"Les Parapluies de Cherbourg\" is an enchanting and melancholy film.  It chronicles the love story of Genevieve and Guy, and their final separation.The first part of the film evokes a sense of giddy love with its music and vibrant colors.  All the dialogue is sung, and while none of the music is particularly impressive, it is pleasant, charming, and often moving. The sets are dominated by bright, pastel colors, which convey the sentiment of the love story, and make the film one of the most visually attractive and distinctive I have seen.  It truly is a stunning movie.As the events of the film unfold, these elements, instead of producing the joyous feelings associated with a love story, enhance the sadness. Ultimately, \"Les Parapluies de Cherbourg\" is a very sorrowful movie, and the bright and charming elements, by evoking sentiments of love, emphasize that the characters' love story has come to an end, and so make the film more profoundly sad.For those who enjoy melancholy beauty, \"Les Parapluies de Cherbourg\" should be a wonderful experience.",
            "review_date": "2003-12-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Strange and Beautiful Film",
            "content": "\"The Umbrellas of Cherbourg\" as it's known in English is hard to explain. It's a modern (well, mid 20th century) French opera set to a 60's euro MOR/pop score. It's a visual and aural treat. If you don't like it you just don't get it.",
            "review_date": "2004-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pleasant surprise",
            "content": "I usually detest romantic movies.  But this film totally charmed me, the most cynical person around the block.  The ending is very satisfying, and the rail station scene is pure movie experience.  Nostalgically I thought that bus station or airport couldn't do nearly as well as railway for romantic farewell.  Amtrak could really use it as their commercial. :)The singing stopped bothering me 5 min. after the beginning.  Although other than four sentence of the main theme, no other music segment really stand out.   The theme was just repeated over and over, it did annoy me a little when I re-watch it the 2nd time, as soon as I watched it the 1st time.I thought was Ellen Farner (Madeleine) acted really well.  Her first scene, first glance clearly told audience everything between her and Guy, without saying a word.  Made me shake my head in envy (of her acting, not of Guy's good luck :)",
            "review_date": "2001-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic",
            "content": "I love french cinema, and I love Catherine Deneuve.  This film makes me gush.  I don't think there's anything more romantic than Part One, and even though the film takes the turn it takes, it somehow retains the romanticism. Umbrella's is truly a masterpiece....from Legrand's score to Demy's direction and brilliant use of color.  The restoration is amazing and the film is suddenly widely available - so there's no excuse to miss this classic.",
            "review_date": "1999-03-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful but Empty",
            "content": "We saw this at a museum screening in the mid 60's when it was brand new on the scene. The museum director apologized to the crowd after the screening because everyone was so disappointed in the film.The scenery was breathtaking. The music was heart stirring. The story and dialog, that's another story.This is a great movie if you're illiterate. Some maniac decided that the dialog had to be translated literally, so musical passages are translated into brilliant statements like \"Next week we'd better rotate the tires on your Fiat,\" or something like that.And the story is no great shakes, either. Young girl loves a boy whom her family consider unworthy. War in Algeria. Heartbreak.To use a French word, banal.Fast forward to the 21st century when the movie comes on Turner Classic Movies. Same reaction. About twenty minutes did it for me.Instead of translating the dialog, a summary of what's happening would have been so much better. The girl announces that she's pregnant. The boy tells her he's going into the army.Demy more than redeemed himself with THE YOUNG GIRLS OF ROCHEFORT three years later. Great, great movie, finally available on DVD.Buy the CD. Avoid the movie, unless the DVD allows you to play it without any subtitles at all.",
            "review_date": "2006-09-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Luscious Fantasy Anchored to the Harshest Reality",
            "content": "I have been to France but never to Cherbourg. Even though it is not a port, my own hometown in New Jersey could have even served as the setting, although I don't believe that it has the charm of Cherbourg. While few in Union, New Jersey spoke French and the people did not sing on the streets, I was amazed when I realized how much the two towns have in common. Even Ms. Daneuve's hairdo in the final and very compelling scene was a very prominent fixture in my 1967 yearbook. I didn't say Ms. Daneuve. I said her hairdo.This is a film, directed so inventively by Jacques Demy, which may be difficult to accept at first watch, but it is one that actually improves with each subsequent viewing, at least for me, and that is a very rare phenomenon. If you don't like musicals in the first place, this may not be your cup of tea. If you may ordinarily accept musicals but don't like this musical score by Michel Legrande, a score which I have grown to love, you will probably dislike this movie. If I don't like the score of a musical, there is no way that I will like the film adaptation. The theme song, \"I Will Wait For You\", so highly ironic when we consider the story's outcome, has probably been covered by more than 50 artists since 1964, and every time I see this movie, it remains with me for days afterward, and that's a good thing. For me, it is a song that has certainly withstood the test of time, especially since it immediately evokes images of this ingenious film.Much has been written about the color scheme, including the matching of the characters' costumes with the scenery and the significance of specific colors to the moods and to the transition of action, which is unique and very creative in itself. Throughout the film, the candy colored images dramatically contrast the starkest, even the most brutal, elements of real life, including the pain of separation, the psychological upheaval and physical injury of war, the suffering of a terminal illness, an unexpected pregnancy, parental and employer conflict, the heavy weight and pressure of financial debt, and, most of all, the struggle to make a living and to provide for oneself and one's family. All of these experiences are universal challenges that we all may be forced to face in life.Without revealing too much about the ending, I was very moved by the last scene, which was brilliantly designed, but, at the same time, I wasn't sad for the future of Guy and Genevieve. We make decisions in life and learn to accept the consequences. We suffer, but we learn not only how to survive but how to thrive. It's a wonderful message from an outstanding movie that I will see again and again.",
            "review_date": "2021-08-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The most beautiful film ever made!!",
            "content": "This film is absolutely brilliant.  From the colors to the historic shot to the haunting soundtrack, this film is, without a doubt, a masterpiece.  It's one that lingers in the mind for days after viewing and a film that one will want to see over and over again. I'm moved to tears everytime!",
            "review_date": "1999-06-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watch it for the music, the colors, the story, and for the diving Ms. Deneuve",
            "content": "I have always associated my favorite musicals with Broadway, apart from this one, which is up there with my top three favorites. Filed as a love story, it also makes my top three. And Catherine Deneuve? She's definitely in my top three most beautiful actresses of all time. Then there's Michel Legrand, my second favorite composer (after Chopin, and if you must know, the third ones would be the Lennon/McCartney collaboration). How does one get so willingly hooked to a movie? Just sample the first five minutes of it, you don't even wait for the first lines of song to realize you're in for a gem of a film. Before you hear any of it, the sets are bound to get you. For the colors, those vibrant, palpable colors are a veritable visual feast. And have I mentioned the divine Catherine Deneuve? If there's anything most likely to distract your attention from the sets, it would be her presence. And last, but not least, for long after you may have forgotten the plot, you will never forget this: that melodious, hummable music, a song most of us associate with having heard from childhood, that beautifully threads the scenes of the story together--and you have the perfect musical. The most poignant love story (reminiscent of Splendor in the Grass, another coming-of-age film with a most genetically- blessed lead actors), with an ending that breaks the heart, but one which I completely approve of!",
            "review_date": "2013-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unsentimental Sentimentality",
            "content": "Demy's musicals are spaces of fantasy, identification, sentimentality, to be sure. Yet they also attain their unique flavour through a kind of realism. For Demy, escapism is not always the creation of an entirely alternative space, a willed blinding to a reality, but a transformation, in the brightest of colours against the richly drabbest of backdrops, and the most soaring of songs, that returns that reality, both as it should and should not be. What's easy to overlook about this charmed and each time tear-jerking ode to first love and missed opportunity is that, for all its undeniable surface sentimentality, is how non-judgmental and unsentimental aspects of it are. In particular, though this is far less obvious than in a film like Resnais' 'Muriel' from the same period, it's in large part a film about the Algerian War and the destruction of a generation in the vain thrashings of empire, the bourgeoisification of social climbing and its interleavings with romance: its lovers ending the film as small businessman, a garage owner, selling American oil, and the coiffured wife of a bourgeois barely pausing to get out of the car. That's what you hear when Legrand's second, or is it third, hanky moment occurs as Deneuve is left behind on the station platform-'I will wait for you'; and again when the camera tracks out from the garage in that devastating final scene. No one's waiting here; no one can, for to moulder in dreams would be worse than to nourish them in the sustaining space of fantasy. For all his attachment to the sorrows and joys of romantic love (though even those are bittersweet), Demy doesn't present it as a kind of goldfish bowl of redemption or aspiration, but as a deep part of the contradictions deep within the social fabric of an unjust society. It's this, as well as the deeply manipulative, but no less affecting presentation of romance, that make 'Les Parapluies' such a great film.",
            "review_date": "2020-08-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "By rights, it should have been a disaster, but it turned out to be a classic!",
            "content": "Imagine an American producer coming up with an idea like this: \"Let's do a boy-dates-girl, boy-loses-girl type story. But, instead of having ordinary spoken lines, we'll have everyone SING their lines to music composed by Michel Legrand. Not highbrow or poetic or witty operatic lines, but really mundane prose. Like, when the mother asks her 17 year old daughter how she got pregnant, the daughter will say, \"Well, just like everybody else.\" We'll cast it with the most attractive actors we can find, and have the dialogue dubbed by people with decent singing voices.\"Then, to keep the audience's eyes busy, not only will we have Catherine Deneuve at the height of her beauty, but we'll add some dazzling color to the movie sets. We'll paint walls and doors and building in impossibly bright crayon colors, and the interiors will be covered with brilliant,almost psychedelic, floral and striped wallpaper. And,hey! Let's not end the movie with the usual \"Boy Gets Girl\"formula----let's have them both end up with somebody else.\" Sounds like a potential flop in the making, doesn't it? And yet it works. I don't know why it works, but it does. The gaudy colors and sung dialogue actually enhance rather than distract from the story----and it stays with you for days after seeing it.An achingly beautiful young Catherine Deneuve plays the impoverished bourgeoise Geneviève, and the Italian actor Nino Castelnuovo her poor working class lover. Marc Michel, who starred as Lola's admirer in Jacques Demy's 1961 \"Lola,\" reprises his Roland Cassard role, several years later, as Geneviève's wealthy admirer. Will she settle for unconditional love from a man she doesn't love? Will she find happiness with the father of her unborn child? Will her dress coordinate with the brilliant wallpaper in the dining room? The end is no more formulaic than the sung dialogue or the brightly colored sets. But somehow it's satisfying, and a movie to watch again and again.",
            "review_date": "2011-08-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful music, beautiful love story",
            "content": "In the beginning the fact that the characters are singing all the time is a bit ackward, but don't give up on the movie, you quickly get used to it. Some of the songs are wonderful, the kind you can't keep from humming for days afterwards.You have to know a little French to enjoy the movie fully, it certainly wouldn't work in another language. I'm not too much of a French speaker myself, but the singing actually makes it much easier to grasp the words.Ok, I admit, the young Catherine Deneuve was one of the reasons I watched the movie in the first place, and I wasn't disappointed, she's truly magnificent. The story about the lost love between a mechanic and an umbrella girl is probably both simple and banal, but I love it. Don't miss this film.",
            "review_date": "1999-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "cinema as art",
            "content": "This film is what cinema is about! when you watch this movie you understand the value of staging and direction. you understand that a movie as a form of art is an idea of someone brought to life. the technicity of this film will blow you away, the cutting, the camera movements, the colors, photography, and cinematography are outstanding, Demy stands out as a visionary and a master of his art. this story wouldn't work as a book, nor as a live musical alone it only works as a film, because it's so artificial yet so real, it looks childish and sweet but it's audacious, dark and political. when I'll remember this film I'll remember the traveling, the characters floating, the rooms colors that match the character's clothes, there is a pleasure and a precision in the staging and how it's all brought together. it's very classical and Hollywoodian yet transgressive and experimental; before this movie, it was strictly forbidden for characters to stare at the camera yet Demy broke the fourth wall twice in such gracious ad precise way when JeanVieve accepts the fact that she will marry the rich Marchand Rolland and in the church during the marriage scene. it also shows how the biggest artifice out there can Evoque reality and how colors can Evoque how dark reality is, and it's one of the rarest french movies to Evoque the Algerian war, it was probably written during the war, it's deeply political since it showed how it could destroy a young man, it's also tragedy about a girl who promises to wait but never even if it starts with some romantic classicism to only diverge to this dark realistic portrayal of life. for me, it's a masterpiece one of my favorite of all times.",
            "review_date": "2020-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Let It Rain",
            "content": "What have I been missing? I've hardly watched any French New Wave movies and even as I appreciate this amazing film has to be total one-off, what an imaginative, remarkable, uplifting movie it is.I can see that its colour and vibrancy echo the great big-screen Hollywood movies of the recent past, but the mundanity of the subject matter, the naturalness of the performances and of course the bold step to employ sing-speak dialogue to tell the story all make it a truly remarkable movie experience.The story is simple and down-to-earth. It's 1957 and a pretty, seventeen-year-old girl Genevieve lives with her single mother in Paris. Together they struggle to make their umbrella-shop business pay and this time when the quarterly rent bill comes in, the mother despairs of being able to pay it.Her daughter meanwhile is caught up in the first throes of love with her handsome young mechanic boyfriend. He lives with his elderly, ailing aunt who's visited every day by a dutiful if slightly dull young woman who clearly loves Guy but he can't see it.Genevieve goes with her mother to the local jeweller where the mother hopes to sell some of her valuables to help make ends meet. Although the jeweller turns her request down, also present is a smooth, rich merchant who takes a shine to Genevieve and opportunely bales the mother out, but has ulterior motives on the young girlThen, disaster for Guy and Gen as their plans are turned upside down when he's called up for the then-compulsory two year French Army National Service. There's just time for one last tryst between the young lovers with the inevitable outcome. From there to the end we follow the couple's separate paths as each compromises their future to meet the path of least resistance before one last Christmas-time bitter-suite reunion at the conclusion.I was caught up immediately by the colourful set design, natural acting by all and in particular the chemistry between the handsome young couple. Behind the musical tilt to proceedings is a credible, natural story of young love combatting everyday obstacles of disapproving parents, money worries, teenage pregnancy and, very much a factor at the time, the dread draft notice arriving through the door.I'm not saying that after the movie ended I was whistling tunes from the Michel Legrand soundtrack which oddly for the time, makes no reference at all to either the prevailing rock and roll or jazz styles of the day and yet I loved the novelty of every cast member bursting into song to express even the most banal of utterances. Catherine Deneuve and Nino Castelnuevo are terrific as the latter day Romeo and Juliet but they get strong support from all the supporting cast. The direction by Jacques Demy, right from the wonderful opening shot looking down at the rain falling on the Parisian general public, is super-stylish and has moments of genuine flair.This is a film to bring sunshine to the rainiest of days. Walk between the raindrops, if necessary, to watch it, c'est tres magnifique y jolie.",
            "review_date": "2022-05-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "intertextuality",
            "content": "one of the most interesting things about this movie is the sub-text of the mother's infatuation with the diamond-seller. On the surface, she's trying mightily to make a match between her daughter and this guy, but when she finds out he's interested more in her daughter--!! It's a nice complication, and quite subtly done.I really have little more to say, but I see I must have at least ten lines, so I will also admit that the music of this piece will haunt you for the rest of your life, and it doesn't hurt that you get to spend 90 minutes in the company of one of the most beautiful women in the world--but I did wonder, at times, if she actually sung those lines.",
            "review_date": "2005-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful film with entirely sung script and marvellous wallpaper.",
            "content": "Proof that style can transcend plot, Umbrellas of Cherbourg is one of my favourite films, even though its simple story of lost love is nothing special, though very moving and uncliched in the way it develops. What makes it extraordinary is that the entire script is sung. The film is also visually stunning, with an amazing sequence of costume-coordinated wallpapers.",
            "review_date": "1999-03-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful!",
            "content": "1. Coloring, that is absolutely matchless 2. Even the first notes of the main theme make you cry 3. Unique way of singing in a musical 4. One of the most touching love stories 5. Beautiful Catherine Deneuve 6. It's not American 7. Made in the sixties 8. You can watch it over and over again 9. Since you've once seen it.. you must watch it over and over again 10. Esso-scene Ten more or less good reasons why this just might be the one.. the favorite movie of mine. I partly understand people who hate it, the singing is the main reason i think. But the unique way of singing! Not in the traditional way this is a musical, people just happen to sing when they talk. And the music (especially main theme) is so hauntingly beautiful it really does make you want to cry when you hear the first notes.The coloring is like in no other film. The clothing and background have been matched in every single scene of the movie. That's real cinema, that's beautiful! And if that's beautiful already, then what comes when the 20-year old Catherine Deneuve is in the lead role! Just WOW! Once again I don't bother explaining any of the plot, because there's no point really...but one of the saddest scenes in movie history, is the Esso-scene in this one. Watch it! if you're not too busy watching the latest Van-Damme.",
            "review_date": "2012-03-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A unique masterpiece of the music outgrowing and dwarfing the film",
            "content": "What makes this film is not the characters, it's a trivial story that could occur in any town about very common people, there is actually no character here but only the account of very ordinary events that more often than not happen to young people; also it's not the wonderful color designs of the film, although the color play is fascinating and efficient all the way, it does not lift the rather bleak story, the actors are good but very conventional, they are not supposed to be more than commonplace, which although no ambition they succeed in reaching, no, all this is just superficial humdrum every day normal matter of no interest at all, the dialog isn't even witty or interesting, but what raises all this disinteresting unintelligent stuff to higher levels than almost any other love film after \"Black Orpheus\" is the music. Without the music this film would be all nonsensical drivel. But the music gives it a spirit of beauty that not only is kept sustained all the way but which constantly is heightened in gripping authenticity and sincerity. The music gives these most ordinary humdrum characters a soul of eternal life. Neither Jacques Demy nor Michel Legrand would never again make anything like it, although their next film, \"The Girls of Rochefort\", was technically more advanced and architecturally more brilliantly composed, but in this film the music also adds poetry and the infinite beauty of infinite sadness. If you listen to only the music without the film, it will give you more than the entire film. Although only recitatives, the tunes will stick, and as they are repeated throughout the film like real \"leitmotifs\", they will make the music create a deeper and truer impression of the feelings and passions involved here than the actual film. It is a masterpiece unique of its kind, there is no other film like it, and no one ever even tried to make something similar. You will cry more for the music than for the matter of fact of the tale and the characters.",
            "review_date": "2021-08-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the highest artistic level without speaking - without speaking of glorious words",
            "content": "The most original and one of the most wonderful musicals I've ever seen. Masterpiece of the times, when European artists were able to make pleasant, not difficult films at the highest artistic level. \"Les parapluies de Cherbourg\" is a kind of fairy tale without happy-end. There is a beautiful photography colored with taste and lyricism but without realism; courageous idea of singing simple, ordinary words during whole film; incredibly beautiful music of Michel Legrand and not worse, lovely Catherine Deneuve as a naive teenager fallen in love. But there is also a realism - in characters' feelings, in the way they love and suffer. And this is the only thing important in the story.",
            "review_date": "2006-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Wallpapers Of Our Lives",
            "content": "Young lovers Guy and Genevieve (Catherine Deneuve, with superstar written all over her pale, flawless face) are torn apart by circumstance in 1957 France, but not before their breathless teen love results in a French bun in the oven. Genevieve is forced to make the choice of a lifetime, whether to wait for pretty playguy Guy to return from war, or to forego true amour for stable moneybags Cassard. Her naivete gradually unravels, and as in all coming-of-age tales, she must kiss her innocence good-bye forever. Though often dated in its technicolor sensibility and melodramatic delivery, this simple love story melts like a tasty, psychedelic confection. So eye-popping is each frame, in fact, that it's easy to visualize an army of harried set designers feverishly concocting the brilliant hues and geometries of its palette. Given the haunting presentation of life's heavy, inescapable issues and the bitter aftertaste of life's sweetest moments, this idealized musicartoon still mesmerizes with sexy jubilation(don't miss Genevieve's widowed mother shamelessly flirting with every Frenchman in sight!)and the realization that things will, at least for some of us, somehow work out in the end ... as long as we keep singing to the invisible orchestra.",
            "review_date": "2002-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "C'est si bon!",
            "content": "I just saw this film a few weeks ago and I was blown away. I loved the colors and the costumes (they match the wallpaper!!!) The music stays with you for days and the images are unforgettable. I suggest seeing \"Jaquot\" after seeing \"Umbrella's\". It really gave me an understanding of Demy's motivations. Happy screening!",
            "review_date": "1999-04-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A NOT-TO-BE-MISSED VISUAL TREAT!!!",
            "content": "Les Parapluies de Cherbourg is a unique film that incorporates all that is good in movie making.  Catherine Deneuve and Nino Castelnuovo are superb in their roles, the colors are surreal, the dialog poignant, but the absolute best part is the haunting score. NE ME QUITTE PAS will echo through your mind long after you have seen this film. It is the best movie I have ever seen in my whole life. I can recommend it without reservations, even to those who do not speak French or are not ardent Francophiles. Try it and experience the joy for yourself!",
            "review_date": "2000-01-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "They are singing. Now they stopped. Oh wait, they are singing again. And again. And again. And again. And again...",
            "content": "Like Tati, Jacques Demy knows how to create beautiful sets and scenery. And yes, just like Tati, he doesn't know jack about writing a good story that can keep us entertained. While Americans were making classic after classic during and after the Golden Age of Cinema, the French filmmakers were experimenting with dialogue, with sets, with pacing, and with the way films are made. In this case, we have a musical that runs from the beginning to the very end. Every word of dialogue is sung, every last word. Only the French language (and maybe Spanish) could craft such a type of work, since their language tends to roll off the tongue easier than English and especially German. However, with that being said, it becomes quite tedious, and the musical becomes irritating when the dialogue refuses to mature past (\"It's cold outside,\"\"Come inside,\"\"Its warmer here\").Les Parapluies de Cherbourg follows a relationship of two people (Guy and Genevieve) that suddenly deteriorates for various reasons as Guy heads off to war. This sets off a series of events that chronicles Guy's attempt to mentally and emotionally recover as Genevieve is nowhere to be seen. It's the average love story with a bitter twist, and it never quite dwells any deeper than it should. He loves her. He is happy. She loves him. She is happy. It does not dig any deeper, there is little dialogue that shows these two were in love and were meant to be with each other forever and ever. All the dialogue is little bits and pieces of obvious observations (\"It's cold now\"\u0097if you see snow and have it fall on you, how else would the weather be!?!?). It has been decades since romance classics like Casablanca, Gone With the Wind, City Lights, etc., and you still don't realize that the heart of a love movie is the chemistry of the main characters? There's about as much chemistry here than a math problem.The singing itself isn't bad, and they could have taken advantage of this if they had reduces a bit of the singing and worked on the actual emotions. There are about four facial expressions throughout the entire film. Catherine Deneuve and Nino Castelnuovo could sing, but can't really act. Maybe that's why they turned it into a full-fledged musical. Then again, it's hard to truly showcase your skills when most of your sentences tend to be five words or less. Dialogue can kill an entire acting performance, and in this case hinders the performance of everybody involved.Jacques Demy repainted an entire town for the natural look of the setting in this film. The sets themselves look magnificent and contain plenty of detail. The mere idea of using an already-developed area for a colorful film was smart; since it doesn't require as much money to fix a city rather than build one from scratch (Jacques Tati probably wouldn't have hit bankruptcy if he had followed this formula). The walls, the umbrellas, the houses, they all looked magnificent. The French nailed it in terms of eye candy back in the 50s and 60s, something the American filmmakers at the time didn't focus on as much. If there is a reason to keep your eye on the movie, it's because France looks beautiful throughout the film. He isn't too bad at moving the camera around to capture the beauty. The idea of the whole life-is-one-big-musical thing isn't exactly terrible, but the execution was extremely poor, as when you sing all the time with little raises and dips in tone, it fails to create any sort of emotion or ability to elicit a reaction from the viewer.The musical score itself was shooting for epic, but comes off as laughable as the music tries to match the emotions running through during the scene, resulting in some hilarity. When you shift the tone of music from happy to sad to depression in mere seconds, it doesn't sound good to the ears, and comes off as melodramatic. Of course, there is one well-known piece that has stood the test of time, which is \"I Will Wait For You,\" the best musical number in the film. But, aside from the sets and little bit of music, this film is a total mess. Just more pathetic, overrated garble that's praised to the high heavens from stuck-up critics and film snobs that turn their backs on anything modern and fall in love with anything old-school. Experimentation with music can be entertaining, with Silly Symphonies from Disney being an older example, but Silly Symphonies had a bit of heart and personality along with the testing of what music can do to film. Les Parapluies de Cherbourg has about as much heart as a ruthless dictator that eats souls and kicks puppies as a hobby.Bottom Line: This film is an utter mess, because it's another example of French eye candy dwelling as deep as a kiddie pool. Film is about visually telling a story, not incoherently deciding to make everyone sing about obvious observations that the audience can figure out. Film is not about being able to predict the next line of dialogue or the next major event that occurs. Film is not about showing people resembling wooden puppets and creating no entertainment value whatsoever. Why else would we remember the American classics but none of these so-called masterpieces from overseas? Because the Americans built likable characters, grand epic stories, and tales that we hadn't seen or heard about time and time again. Demy proves that people can sing a whole movie\u0097but nothing more. We can't dissect this film into multiple layers, and we can even do that with some action films of today. There's nothing to dig here; what you see is what you get\u0097and that is singing, singing, bickering while singing, and showing an eternal pout face while singing.Sing this with me: This movie reeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeks!",
            "review_date": "2008-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A perfect movie",
            "content": "I have seen this movie with no translation as I can speak french, the lyrics are selected with a great sensation , the music is superb and completely harmonized with each word, this movie can be considered as one of the best musical films in the 20 century. The movie theme is unforgettable , you can hear it playing in your mind when ever you remember the romantic scene of Geneviève and Guy. The master scene in this movie is the last scene when Guy asked Geneviève to leave and then his wife Madeleine and his kid Francois returned and he started to play with his kid insisting on forgetting his old love. I think that no one can ever do such a master piece except with Catherine Deneuve and Nino Castelnuovo.",
            "review_date": "2006-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Utterly artificial but beatiful all the same",
            "content": "\"Les parapluies de Cherbourg\" is essentially a pulp fiction story and nevertheless it is a beautiful film.The film is willful in several ways. The way the complete dialogue is sung, mostly as a recitative. The use of bright, candy like colors. But also deliberately using of artificial montage. When the two lovers Guy (Nino Castelnuovo) and Geneviève (Catharine Deneuve) walk home for their last evening together it seems that they are standing still while the scenery behind them is moving. Just like in a 50's movie when the car is standing still but movement is suggested by projecting a moving landscape in the rear window. Sloppy technique by director Demy according to 1964 standards? Not at all. By using this effect the characters seem to float instead of just walking. They are madly in love after all.Through all the choices mentioned above director Jacques Demy made a film that is clearly artifical. It must have been an atrocity for the directors of the \"Nouvelle vague\" movement, then dominant in France. Even today films that are so utterly artificial are scarce. However different from \"Les parapluies de Cherbourg\" I can only think of \"Dancer in the dark\" (2000, Lars von Trier) and \"8 femmes\" (2002, Francois Ozon).\"Les parapluies de Cherbourg\" has a very powerfull final scene. It is a happy and an unhappy ending at the same time. The scene contains an explicit message about Guy and an implicit message about Geneviève. When you see how the spontaneous girl from the opening scens has been transformed in the expensive lady of the final scene you know that materially speaking all is well. But what about emotionally speaking?\"Les parapluies de Cherbourg\" made Michel Legrand, who did the music, famous. Above all however it was the breakthrough of Catharine Deneuve. Twenty eight years later she was still the \"Grande Dame\" of French cinema in the already mentioned \"8 femmes\" (2002).",
            "review_date": "2021-06-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Candy Colored Delight",
            "content": "This candy colored musical is like a dish of macaroons brought to life.The plot is wispy thin and nothing more than a collection of cliches, but whoo boy is this film romantic. This movie is designed to be felt, not dissected. It aches and swoons, but only if you're willing to give in to its aesthetic. Catherine Deneuve is lovely even if her character is limp and irritating, and Nino Castelnuovo is a handsomely stubbled leading man. The theme of the movie is what time, distance, and pragmatism do to love, and it's set to one of the most glorious movie themes ever written.\"The Umbrellas of Cherbourg\" was nominated for a Best Foreign Language Film Oscar in 1964, and then, because rules of the time made imported films eligible for all other categories the year after its initial release, it scored four additional nominations in 1965: Best Original Story and Screenplay (Jacques Demy), Best Original Score (Michel Legrand and Jacques Demy), Best Scoring Adaptation or Treatment (Michel Legrand), and Best Original Song, for \"I Will Wait for You,\" written by Legrand and Demy, with Norman Gimble providing lyrics for an English language version that was made famous by Johnny Mathis.Grade: A",
            "review_date": "2021-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The First Film Musical Ever Produced",
            "content": "One fundamental and innovative feature of this movie may be difficult to detect by present-day users. Even in 1964 many professional experts overlooked it. 'LES PARAPLUIS' STARTED AN ENTIRELY NEW GENRE, viz. THE FILM MUSICAL. Without any exception, the music of every previous musical was created with the aim of functioning appropriately in the theatre. By contrast, in 'Les parapluis' the team of the director (Jacques Demy) and the composer (Michel Legrand) for the first time decided to produce a work in which the sound should be 100% film music. No one had previously attempted such a task. - This innovation may seem less conspicuous today, because theatre musicals and cinema musicals have reciprocally learned from each other. But note! Even though some musical techniques and phenomena may function well in both the theatre and the cinema, this is by no means true of all techniques and phenomena. - Today it is no revolutionary view that 'West Side Story' and 'Les parapluis' belong to the ten best musicals ever made for the screen. But Swedish reviewers in the 1960s had limited musical competence. Leonard Bernstein's contribution to the former movie was called 'a heap of banal hits', and the latter movie was depreciated as 'a sugary Hollywood melodrama'. - It is definitely not my intention to belittle the non-musical merits of the movie. Even if all music had been deleted, I would still consider it a great movie. Nevertheless, I asked myself whether the music of any other film is of a comparable quality, while being at the same time congenial with the action and situations. I think there is one and only one rival, viz. 'Phaedra' by Jules Dassin, with music by Mikis Theodorakis. However, in 'Les parapluis' all music reaches the highest quality, from the first to the last note. In 'Phaedra' the same thing is true of at most two tunes, among them the love theme. - The DVD version is 31 seconds shorter than the cinema and the video versions: the penultimate 31 seconds have been cut away to ensure that the picture and the music should finish at exactly the same time. It would be vainly to complain about such re-editing. However, the technique with a rotating playback-and-record-head has existed since forty years. If this technique had been applied, the cut would not have been annoying to musicians. But most regrettably, the cut is performed with ordinary scissors. - Users who do not love music, or not this kind of music, would more often than not be disappointed by this movie (although not necessarily so). - The action is very simple. Guy and Geneviève love each other. He is a motor mechanic, and she works in her mother's umbrella shop. When he is enlisted and sent to the North African colonies, she is pregnant. Continual war activity makes it difficult for him to write many letters. Geneviève's mother is worried about her pregnancy. Her pressure eventually makes Geneviève marry a jeweller, whose love may well be as sincere as Guy's. But we are not told whether Geneviève feels more than gratitude because he saves her from becoming an unmarried mother. - When Guy returns from the war and Geneviève has left the town, he becomes very depressed. But he eventually marries the nurse who had for years taken care of his godmother. All the time she had secretly been in love with Guy. - After some years Guy and Geneviève accidentally meet again, but nothing much happen at this meeting. - What so many people admire is the moods and the atmosphere of each scene; not least the transparency and depth of the emotions of the persons. Some people even feel as if they themselves experienced the events and situations on the screen.",
            "review_date": "2004-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Death by treacle",
            "content": "Your jaw will drop in disbelief at this. Adult people in a hideously childish world - with so many primary colours that you expect to see Noddy and Big-ears drive by in a little yellow car - singing their way through a story of mind-bending banality - well, not exactly singing\u0085 more like wailing in a meaninglessly undulating voice to odd, inappropriate bursts of music. It's all as unendurable as the pink-n-purple wallpaper in their house.No, we don't ask for gritty neo-realism in all our movies, but as an audience - and I presume to speak even for children also - I do expect to be credited with more depth and intelligence than a Barbie doll. This is just so much trivial nonsense, cretinously superficial, for those who like sugar, sugar, sugar, and more sugar in their tea - in fact, forget the tea, have some more sugar. If you survive more than five minutes of this you will have the sticky feeling of being slowly suffocated in molasses, and by the end you will have aged perceptibly out of pure despair.Possibly the most monumental lapse of taste in cinema, and my candidate for the most appalling \"good\" film ever made.",
            "review_date": "2005-09-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "intertextuality",
            "content": "one of the most interesting things about this movie is the sub-text of\nthe mother's infatuation with the diamond-seller. On the surface, she's\ntrying mightily to make a match between her daughter and this guy, but\nwhen she finds out he's interested more in her daughter--!! It's a nice\ncomplication, and quite subtly done.I really have little more to say, but I see I must have at least ten\nlines, so I will also admit that the music of this piece will haunt you\nfor the rest of your life, and it doesn't hurt that you get to spend 90\nminutes in the company of one of the most beautiful women in the\nworld--but I did wonder, at times, if she actually sung those lines.",
            "review_date": "2005-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Maximum expression of art",
            "content": "The cinema is a meeting of all the arts in a rectangle.\nWhen there are so many things in the same place, so many tones, colors, expressions and ways to take you out somewhere to tell you a story, it is hard to keep everything in balance and don't be carried away by what is most striking, so at the end you can miss the full picture and what is like to listen a story as a whole. The Umbrellas of Cherbourg finds that balance better than any other movie ever made, and reaches a tipping point in the representation of any technical aspect.I think we all go to the movies not just to enjoy the technical aspects, not even to listen a story; well, yes, but we go to the movies to feel, to get excited, to be moved. Jacques Demy knows how to play with that.This movie will leave you with a lump in your throat, with a tune in your head, and with a pretty clear and confusing idea of what is love to you.Even if you don't like the opera (movies are better), you've got to see this movie.",
            "review_date": "2020-06-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "There's a reason why I'm obsessed...",
            "content": "There's a reason why The Umbrellas of Cherbourg garnered the Palme d'Or at Cannes when it was released; it's a cinematic experience unlike any other. Agnes Varda, wife of deceased director Jacques Demy, had the film restored and resurrected in 1996, and the new print makes the film all the more visually stunning.  Demy as a director was heavily influenced by the musicals of the forties and fifties, as well as his native France.  His meticulous attention to detail, however, took the concept of the musical to new levels with this film.  Yes, the film relies on melodrama, but the world that Demy created, all sung, all brightly colored fluorescents and pastels, is one that we can only dream of inhabiting.  Don't miss it for anything.",
            "review_date": "2000-07-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the 10 best films ever made",
            "content": "Everything is perfect, the opening scene with the rain and umbrellas from above, the colours, the music (Legrands) the location and the cast (Deneuve is so lovely). The initial shock after the first singing, instead of normal talking, disappears after a short time. It´s natural, why not? It´s the sad love story that matters and Demy stands above all the others in French cinema, he has a heart, a big warm human heart. He and Truffaut are the true human directors after Renoir. Do not miss Demy's other masterpiece, Lola (60) and his wife Agnes Varda´s film about his youth, Jacquot des Nantes.",
            "review_date": "1999-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My favourite movie of all time!",
            "content": "I first saw this movie at the cinema a few months ago - and I instantly fell in love with it!I didn't know anything about it beforehand - and when I found out it was an all singing musical I almost left the cinema because I normally hate musicals (all that singing gives me a pain ;-)However, after the initial ridiculous lines such as \"Is my car ready yet ... the engine knocks a bit when its cold but thats normal ... merci\" it develops into a beautiful tragic love story with enough room for you to make up your own mind as to what went wrong.The sets / costumes are beautiful (never thought I'd say that in relation to a movie.), Catherine Denevue is gorgeous (lets face it, she still is 36 years on!) and the music is wonderful.Take my advice - if you haven't already seen it, go out and buy the DVD! If you don't have a DVD player then get one of them too!  (I've watched it so often I'd have worn out a VHS tape by now!)Incidentally, its interesting that stereotypically its women who are into romantic movies - and yet most of the comments about this one are from males - other than the only negative one I've seen!",
            "review_date": "2000-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad idea",
            "content": "I couldn't stand this film, it was my first Demy but I had pretty high expectations due to Catherine Deneuve being my favorite actress and I had heard nothing but good things.I should start by saying that I rarely like musicals but this film was just plain bad. The story was great or at least good and Demy is obviously not a hack! The frames, camera movement and the overall look was very good. The actors didn't really do anything wrong but the movie just couldn't help sucking.The score though good could not help the \"musical numbers\", it was just people talking with each other with music behind it. Next to no musical timing nor good songs at all. In fact there was no songs just what they wanted to pass off as singing. This so called singing annoyed me so much that I couldn't even think of the possibility of liking it.Because of all the positive (story, frames, camera movement, cinematography and acting) I will not give it a 1 nor a 2. Though it was nearly painful to watch some of it I will be nice enough to give it a weak 3/10.",
            "review_date": "2009-01-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect!",
            "content": "Caught between sounding colors and the grieving song of Geneviève's stricken face, receptive audiences are destined to crumble in love with this popular French tearjerker. Everything works: the directing, the camera, the set pieces, the dialogue, the songs, the story, the makeup, the costuming, the actors, and the actress. Beautiful! Memorable! Heartbreaking! Perfect for adding to a collection! This movie is the prime souvenir of Jacques Demy and contains Catherine Deneuve's most emotional performance. Audiences of all ages can enjoy, especially those who enjoy romance musicals. Take a comfortable seat with a hot cup of chocolate, and brace yourself for not only one of the best movies of the 1960s, but of all-time.",
            "review_date": "2016-07-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Weak",
            "content": "Beautifully Shot but Empty and weak story that is easy to predict, I'm sorry, but no.",
            "review_date": "2020-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "wonderful movie indeed",
            "content": "I like French movies; they always have a realism to them. I also like them cause they're almost always done in a very artsy way, and this one was no different. The artsy part is the way the colors are shone in the film. They kind of stick out from the rainy back-drop. Another notable thing about the film is how it was all done in a singing style. The director has to be commended for that.",
            "review_date": "1998-12-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A chef d'oeuvre in the musical medium",
            "content": "Man, what a movie, both a joy and a wreck emotionally. The first 20 minutes is a total joy while the rest is just a tragic event after the other which leaves you by the end of the film totally wrecked.I'll start by saying that I have enjoyed every second of this film visually, every single frame is near perfection, and all of the colors present in each frame pop and shine which makes this film one of the most visually satisfying films I have seen, there was not a second watching this film I thought \"that looks kinda ugly\", the best way I can describe the color palette and the production design is that if you were to taste it, it would have a sweet candy-esque taste, basically all you want from eating candy.I believe that the screenplay deserves a lot more acclaim, as the entire dialogue in this movie is sung which is a fun twist from the usual musical medium, but to be able to write a good screenplay and have it work as a series of songs is something else, and the screenwriters deserve more praise for being able to make this screenplay work as a series of songs. It brought some really replayable and gorgeous songs and was effective storytelling-wise. I ended up seeing the film twice in a row just because of how catchy the songs were, and how mesmerizing Michel Legrand's musical score was.In other aspects, the movie delivers too, Catherine Deneuve's performance is great as a conflicted teenager having to choose to wait for her lover's return or to marry somebody else, it isn't necessarily award-worthy but it is still an entertaining and charismatic performance. The same goes for Nino Castelnuovo and other supporting actors giving good and charismatic performances as their respective characters.Being a musical, it delivers in terms of sound design, when real-life sounds fade in and out in between tunes or tracks, which is done wonderfully, and I felt pretty much immersed into this world despite the lack of real-life sound during conversations and some of the tracks, giving this movie a little bit of a fantastical feel to it (setting-wise).Overall, I certainly did not expect a movie this heartbreaking but I still enjoyed every minute of it thanks to the musical numbers, the writing, the performances of Deneuve, Castelnuovo, and Vernon, and of course its color palette and set design.It is definitely an all-time classic in the musical genre but also in the romantic tragedy medium, and should be watched by all movie-lovers especially those who enjoy musicals such as Singin' in the Rain or La La Land.*SPOILER EXTRA:*Storywise, this is maybe where it hurts the most, as this film's main story reminds us of the harsh realities of life, and how a sudden event or decision can have heavy consequences. In this film's case how Genevieve (Deneuve) and Guy (Castelnuovo) are separated as a result of unfortunate events (Guy joining the army, Genevieve getting married to someone else after being asked by her mother to support her financially). The most aching part is the ending when they cross paths many years later, both having moved on from the previous relationship they shared at the start. The point is that how real-life constraints can have heavy costs in this case their romantic relationship and their ideas of a happy life together.",
            "review_date": "2021-07-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's true, it's a beautiful movie",
            "content": "I never went to see this movie growing up in France, mostly because my parents loved it. I might not have loved it then (I was 15 years old) but I sure loved it now. So if there are any other French guys out there who haven't seen it, go rent it and be surprised and proud of at least one French musical.",
            "review_date": "2001-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Charmant!",
            "content": "I've been meaning to dive into Demy's filmography since hearing he had a huge impact on Chazelle's La La Land, with this one being singled out as the primary influence, that's not to mention it's often cited as Demy's chef-d'oeuvre. Infused by jazz melodies as well as thumping percussion for an added flair, featuring eye-candy pastel-coloured set and costume design on full display, and cycling through seasons in a way thematically suggestive, Chazelle's musical is definitely not far removed from this one although each has its own approach to its distinct story. What grabbed my attention the most is how Demy progressively jettisons the fantastical, iridescent world in favour of an otherwise grounded one. From the opening sequence of an aerial view of raindrops pitter-pattering on cobble stones and the titular umbrellas, to the bold, bright colours, to the constant singing, Demy muster all technical tools, congregating to lend a lulling effect that sent me into a delightful stupor, and to kaleidoscopically play up the emotional union and jovial state of Geneviève and Guy who're enamored with each other.Cherbourg is almost presented in pink, before giving to brown-ish and blue hues to emote Geneviève's feelings of forlorn and sadness respectively, and fuchsia and red to suggest warning and uncertainty, when Guy leaves to Algeria due to his conscription, leaving Geneviène facing a tough decision that threatens their relationship. Even colours brimming with joy at first, such as yellow, gradually wane and pale, giving way to some of their dull and faint derived shades. All these create melancholic undertones along the way that ground the film in reality while portending its bittersweet ending where there isn't a dry eye to be found. But The Umbrellas of Cherbourg is a film of the of vicissitudes of life and how one has to resign to fate so long as latching onto hope becomes more and more difficult, and it's more than just a matter of counting the days.The Umbrellas of Cherbourg is also of teenage love and recklessness, and it's here in particular where it sets itself apart from the rest with its sense of verisimilitude. \"People only die of love in movies,\" said Geneviène's mother who neither believes in love at a young age nor love at first sight. She's pragmatic and even cynical, and maybe that's her main impetus for wanting her daughter to get married to the wealthy jewellery merchant. Yet, her happiness at seeing her blear-eyed daughter a bit cheered up when handed a letter from her lover is real and indicative of a true motherly affection. Make no mistake, this is far from the flawless film I was expecting. The editing is a bit clunky, which shows most in the continuity of music. It also took me a while to adjust to the dialogue, entirely being recited and sung, but soon I started to appreciate the unconventional lyricism of it all. A visual and emotional stunner that's not to be missed by all the fools who dream and lovers of musicals in general.",
            "review_date": "2021-07-27",
            "lang": "en",
            "source": "imdb"
        }
    ]
}