{
  "title": "American History X",
  "rating": 8.6,
  "release_date": "1998-10-30",
  "summary": "A groundbreaking controversial drama about the tragic consequences of racism in a family.  (New Line Cinema)",
  "critic_reviews": [
    "This is the sort of incendiary role a lot of actors would kill for, yet the shock of Norton's performance isn't its showboat flamboyance. It's that he makes this sadistic junior sociopath rueful and intelligent.",
    "Jolting, superbly acted film.",
    "An inflated yet gut-slugging film.",
    "While this movie is sometimes overbaked, it is the first major studio release in a while to engross wall-to-wall.",
    "May be flawed, but it's not easily forgotten.",
    "Unflinching in its depiction of racism, anti-Semitism, violence and jailhouse politics.",
    "A series of well-drawn sketches and powerful scenes, in search of an organizing principle.",
    "Such an ambitious, well-acted film that it's easy to overlook its flaws as relatively minor.",
    "The movie can't explain as much as it wants to about what makes (and unmakes) a skinhead, but it carries us a fair distance.",
    "Trenchant and visceral, American History X may not be perfect, but it's a darn sight better than good.",
    "It's Norton who makes the film such an enlightening experience, and he's mesmerizing.",
    "It's a testament to Norton's utter immersion in the role that he can even halfway connect the dots between this fundamentally sweet, brainy kid and the magnetic, white trash monster who'll haunt our minds long after the movie's liberal pieties fade into static.",
    "A violent, sober cautionary tale, strictly middle-of-the-road when it comes to its much-ballyhooed politics and grimly obvious in its telling.",
    "Excellent in flashes, unintentionally absurd and lead-footed at other moments, the movie stumbles under the weight of its own grandiose intentions.",
    "There may be much to like about his movie, but it's all been done before to more challenging degrees of moral ambiguity. That's a pretty fatal flaw.",
    "It's hard to know whom to blame for the film's choppiness, its mixture of rage and sentimentality, the stridency of some of the acting.",
    "Director Tony Kaye may be reaching for opera, but screenwriter David McKenna has set his sights distinctly lower.",
    "This material is charged enough without piling on the melodrama and the lip-smacking violence. The movie too often sacrifices reportage for razzle-dazzle.",
    "For all its surface verisimilitude and for all its focus on a problem that couldn't be more current, this film can't manage to feel more than sporadically real.",
    "As a visit to a world and a way of life most of us will never experience, American History X is vivid, and it feels honest. At the very least, it's not typical.",
    "Fails dramatically as well as ideologically.",
    "Norton's high-energy acting is the only element that saves the picture from being a total loss.",
    "A mess of a film.",
    "A mousy little nothing of a picture."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "One of the greatest movies I've ever seen, with an amazing, captivating performance by Edward Norton. This film sheds light on issues that many people in society are afraid to discuss or take seriously. A beautifully composed film, a must see.",
      "review_date": "2010-11-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If I had to describe this movie with a word limit this is what I would say:\"A must watch classic\".Unexpected turn of events more than once & Edward Norton makes it even better as he shows his true talent from the beginning.Mixed feelings andIf I had to describe this movie with a word limit this is what I would say:\"A must watch classic\".Unexpected turn of events more than once & Edward Norton makes it even better as he shows his true talent from the beginning.Mixed feelings and a variety of thoughts are brought up by the performances.Definitely 9/10.",
      "review_date": "2012-12-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think that this movie MUST take 10/10, because of it's thoughts about racism and Nazism. The end is curt, but still amazing... If you haven't seen it, you should. It's changed my feelings about Nazism positively and that's wonderful.I think that this movie MUST take 10/10, because of it's thoughts about racism and Nazism. The end is curt, but still amazing... If you haven't seen it, you should. It's changed my feelings about Nazism positively and that's wonderful. Finally don't see it half. You'll dislike it.",
      "review_date": "2013-05-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Now this is a great film. Yes, it is dark, violent, and quite disturbing at times, but it is also powerful, moving, and important. Edward Norton is absolutely phenomenal. He takes this deeply troubled character who comes to realize what isNow this is a great film. Yes, it is dark, violent, and quite disturbing at times, but it is also powerful, moving, and important. Edward Norton is absolutely phenomenal. He takes this deeply troubled character who comes to realize what is truly going on his life and he knocks it out of the park. He was terrific and put the film on his shoulders and absolutely killed it. The director, Tony Kaye, while he wishes to distance himself from the final product, he did a great job as well. There was some beautiful imagery here and while it may not be the version he intended as the final cut, his vision absolutely is here and the messages it provokes is still powerful. Really, after watching this film, I felt like I had been hit by a ton of bricks. The entire film is so moving and affecting that it really leaves you in a trance once it ends and the credits start rolling. On top of that, there are many powerful scenes, but none as powerful as the final one. It really leaves you on the brink of tears as you try to deal with what you just watched.\r A truly mesmerizing character study with a heart and soul, American History X should absolutely be considered a \"must watch\" for all.",
      "review_date": "2014-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I've lost track of how many times I've seen this, but it still makes me tear up in the end, Norton really proves himself to be a powerhouse actor, his passion and raw emotion could scare anyone. One of better movies of 98",
      "review_date": "2011-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very rough and intense but fantastically acted and written! Music is also awesome and so is the whole movie. Absolutely great with a tragical story but so is life. A masterpiece!",
      "review_date": "2012-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie that brings a lot of reflection over racism and prejudice. Give it a shot, it's totally worth it. Hope you enjoy it as much as I did. I can't see how it got a overall score under 8.",
      "review_date": "2014-05-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a rough gritty film that deals with modern day Nazi's and how it affects people. It is a very real movie that shows truth and is powerful. It is no the best ever but a very good movie.",
      "review_date": "2013-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a must watch! Yes it's tough,rude and brutal at momments (no spoilers), but i can't deny this movie's amazing story and message to all people!",
      "review_date": "2015-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "American History X is one of the most shocking, brutal, disturbing and evil spirited films I've ever seen. Edward Norton gives an absolute masterclass and the two performances he gives either side of his characters transition are bothAmerican History X is one of the most shocking, brutal, disturbing and evil spirited films I've ever seen. Edward Norton gives an absolute masterclass and the two performances he gives either side of his characters transition are both incredibly captivating. There's no doubting how manipulative and pretentious this film can be. And at times the propaganda can even feel persuasively targeted at the audience. But to the films credit that's what makes it so compelling. And ultimately you cannot believe such evil, destructive & irrational people like this actually exist. Tony Kaye's overall direction is impressive and the black and white sequences in particular look stunning. American History X is certainly a tough film to enjoy but personally I think it's essential viewing and an incredibly bold piece of filmmaking.",
      "review_date": "2014-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest movies of all time. This film is able to look true, real-life evil in the face and humanize it. There are people that actually live their lives like the neo-nazis in this film, and American History X absolutely does notOne of the greatest movies of all time. This film is able to look true, real-life evil in the face and humanize it. There are people that actually live their lives like the neo-nazis in this film, and American History X absolutely does not sugarcoat it. It shows the true colors of some of those people in our world, yet it doesn't bash them. It shows their intentions, shows us why they do what they do, and while we don't agree at all with it, we understand. Edward Norton gives the performance of a lifetime in what is a film that everyone should watch before they die.",
      "review_date": "2013-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI love this movie. This has to be one of the best films created to date. Edward Norton does an excellent job playing his role as a white supremacist, when placed in prison, learns how all races truly are. It is an eye opening film, that keeps the watcher entertained the whole way through. I enjoyed how it transitioned from color to black and white, to show the difference between past and present.  Highly recommended film for anyone.",
      "review_date": "2014-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fantastic movie. This movie is tough to get through in the sense that there were many brutal violent or rape scenes that were really disturbing, but they were really well shot. The acting by Norton was phenomenal and the best performance ofA fantastic movie. This movie is tough to get through in the sense that there were many brutal violent or rape scenes that were really disturbing, but they were really well shot. The acting by Norton was phenomenal and the best performance of his career. I didn't think I was going to like this movie as much as I did but it was great. I love the style of the movie on how it was shot with some scenes being black and white and the rest in colour a great job.",
      "review_date": "2014-05-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "American History X is so ground breaking and ahead of its time. This film is considered controversial because of its content and its language but I feel that it is one of the most important films ever. Edward Norton may have but his bestAmerican History X is so ground breaking and ahead of its time. This film is considered controversial because of its content and its language but I feel that it is one of the most important films ever. Edward Norton may have but his best performance ever in this film and Edward Furlong manages to shine yet again at such a young age. I love every aspect in which the story is told, which is in a very unorthodox timeline but is very appropriate for the movie and the film splits between colour and black and white.",
      "review_date": "2015-07-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just a masterpiece! A new point of view to racism with a worldwide message.Great acting by Norton.Fabulous ending. Really an underrated movie.With a worldwide message.A must see.",
      "review_date": "2014-10-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest movies I have seen in a while. Edward Norton played his controversial role so well he could have been arrested for being so racist. The actor who played his brother (John Connor in Terminator 2) was very good as well. TheOne of the greatest movies I have seen in a while. Edward Norton played his controversial role so well he could have been arrested for being so racist. The actor who played his brother (John Connor in Terminator 2) was very good as well. The plot was great -- well everything about it was fantastic really.",
      "review_date": "2015-01-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI love this movie so much that even after years of saying that it is impossible to like a movie more than the shawshank redemption I had to admit that American history x is better, the acting is better, the story is better, the narration is better, and most importantly the ending is better. Also, even though the shawshank redemption has some intense, disturbing, and even gritty scenes American history x beats all of them just with the, \"bite the curb,\" scene. Also, I can guarantee you that if you watch the shawshank redemption and then watch American history x not only will you say American history x is better and not only will you be suggesting it to everyone you know, ( Spoilers ahead) but you will also be crying when Danny Vinyard gets killed in the bathroom at the end of American history x.",
      "review_date": "2016-10-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "American History X handles racism in such an incredible way. I'm watching in 2018, 20 years later, and, sadly, I feel like this movie could have been released these days. The cast is amazing, Edward Norton went incredibly well on his role,American History X handles racism in such an incredible way. I'm watching in 2018, 20 years later, and, sadly, I feel like this movie could have been released these days. The cast is amazing, Edward Norton went incredibly well on his role, everything seems genuine, from the start to the end. This is, without any doubts, one of the best, and most important, movies I've ever seen.",
      "review_date": "2018-07-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A shocking portrayal of the effects of hate and racism, this film is an absolute must-see.  Not only is it a monolith of its genre, the message it conveys should be heard by all.  Edward Norton never ceases to amaze when it come to sheer talent.",
      "review_date": "2010-10-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "62??? really???? This is one of the greatest movies ever made. Edward Norton hit a home run on this film, his acting was amazing. The story was great also. I am still trying to figure out who the heck these 'experts' are.",
      "review_date": "2011-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Why did I watch it?\rRecorded this one a while ago while it was on as it's always been one of those films I've wanted to watch, purely based on its controversy, but somehow never got around to.\r\r\nWhat's it all about?\r\n\r\nNorton beefed up forWhy did I watch it?\rRecorded this one a while ago while it was on as it's always been one of those films I've wanted to watch, purely based on its controversy, but somehow never got around to.\r What's it all about?\r Norton beefed up for the role A story of two LA neo-nazi brothers, American History X stars Edward Norton and Edward Furlong as Derek and Danny Vinyard. Angry with perceived injustices against the white population of Venice Beach and the nation as a whole on top of the murder of their father by a black drug dealer, the pair embrace the teachings of a local supremeist. The film alternates between the present day and flashbacks chronicling the relationship of the pair as the older brother, Derek (Norton), gets drawn into trouble with the gang and later tries to prevent his younger brother from making the same mistakes as him.\r Should you watch it?\rViolent, powerful and controversial, American History X is a hard-hitting drama dealing with a difficult but realistic subject and at times can be hard to watch. Obviously bearing in mind the subject matter, the script is unpleasant at times but the decision to give both characters a high degree of intelligence was a smart one as it at least allows them to put forward their argument in a reasonably articulate manner.\rEdward Norton is absolutely excellent as the older brother before and after his run in with the law and totally deserved his Oscar nomination. Furlong also deserves credit for his performance and it's disappointing that he didn't go on to better things from this. The black and white older footage, when Norton is at his angriest, adds to the powerful nature of the film and was a masterstroke. Norton's angry, shaven-headed, white and Nazi-tattoo clad torso in black and white is, from a cinematic perspective, a pretty powerful and controversial image.",
      "review_date": "2012-11-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing movie. Someone please tell me that the critics are playing one big joke on the audience by not universally acclaiming this movie. But then again, who cares what they think, anyone who watched this knows it's a classic.",
      "review_date": "2012-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most powerful films I've ever seen. Extremely dark,disturbing,sad and enlightening. Edward Norton gives one of the most underrated screen performances ever, as he plays a Neo-Nazi who tries to stop his younger brother from headingOne of the most powerful films I've ever seen. Extremely dark,disturbing,sad and enlightening. Edward Norton gives one of the most underrated screen performances ever, as he plays a Neo-Nazi who tries to stop his younger brother from heading down the same awful path he chose. Very visceral movie.Highly recommended.",
      "review_date": "2013-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really enjoyed this film. I loved the acting and powerfull message this movie had. I think this movie kinda helped me with some stuff I was going through as well.",
      "review_date": "2013-09-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"American History X\" is immensely relevant to modern audiences, perhaps now more than ever. A gritty and provocative drama that puts in graphic terms the dangers of racism and hatred, propelled to greatness by Edward Norton's mesmerising and\"American History X\" is immensely relevant to modern audiences, perhaps now more than ever. A gritty and provocative drama that puts in graphic terms the dangers of racism and hatred, propelled to greatness by Edward Norton's mesmerising and powerful performance and his interplay with Edward Furlong is one of the most affecting pairings in film. And the ending is shattering no matter how many times it's watched.",
      "review_date": "2014-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Truly great movie, really does depict racial tensions in america to this day (despite being made in 90s)\rGreat acting,setting is great and it is also a really entertaining movie. One of the best",
      "review_date": "2016-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A truly powerful film, with a message that will stay with you long after the screen goes off, American History X is a force to be reckoned with.  Edward Norton's performance stands out.  It is a very believable and gripping performance.  IA truly powerful film, with a message that will stay with you long after the screen goes off, American History X is a force to be reckoned with.  Edward Norton's performance stands out.  It is a very believable and gripping performance.  I love any movie that touches on 'touchy' subjects.  In this case, it's racism.  The thing with this topics in films is that they are very easy to mess up, or become cliche.  Luckily, this movie wonderfully, and shockingly tells the story of a man that escapes the life of a Skinhead, and further tries to prevent his younger brother from falling down the same path.  A classic film, and a must-see for any movie-buff.  9/10",
      "review_date": "2011-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think one of the most powerful movies i've ever seen. There isn't one dull moment and it draws you in from the first minute. It's insane how buff Edword Norton got for this.",
      "review_date": "2012-02-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A dramatic movie which give us a look in the american skinhead scene but doesn't forget the humans behind their story.",
      "review_date": "2018-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "American History x of beginning already cemeça with one of the best scenes already seen in black and white (spectacular), for me the whole movie would be like that, it was spectacular in this way, the soundtrack, although not remarkable, doesAmerican History x of beginning already cemeça with one of the best scenes already seen in black and white (spectacular), for me the whole movie would be like that, it was spectacular in this way, the soundtrack, although not remarkable, does an exceptional job, Delivery what is being proposed in the environment, fear and tension are examples; The script is able to deliver a great story, as the name already says: American History, in the simplest form is a film of American society, but in the way that some do not accept diversity, equality. Edward Norton is in one of the best jobs of his career (if not the best); The film at the beginning proposes an idea, but from a certain point it shows that it is there for something else, a beautiful work of a script well written, I have to praise the script and much; What a story, I swear that in the end it surprised me; Because although I already expected that I did not expect it that way, although there are colorful scenes that stand out even in black and white, I have already praised it once and I will continue to praise the way the black and white scenes became sensational, if The whole movie was in this way would only improve this great work that deserves to be recognized. At the end of it all that guy who people did not believe that would change changed and everything because he saw the other side of the coin, saw that all are equal and despite everything some day we can depend on that person we do not like, we hate and among them we One can see the trust and other things that we do not see in those we treat equally just because they are of the same color; American History x is a work of art and undoubtedly one of the best movies I have ever seen!",
      "review_date": "2017-06-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Insanely GreatAmerican History X is powerfully directed, Shows the horrors of Neo-Nazis, Amazing performances from Norton and Furlong, and a terrific script.",
      "review_date": "2019-07-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Seriously one of the best movies ever made.  It's a different kind of movie.  It's not one you want to watch over and over.  It's horrible in its depiction of hate but the redemption story is something to behold.",
      "review_date": "2018-11-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was indulged into the movie from start to finish and I could feel the emotions, from fear, disgust, to anger. And the killing scene literally made me wet with sweat as I could really feel what Danny was feeling. This movie was an experienceI was indulged into the movie from start to finish and I could feel the emotions, from fear, disgust, to anger. And the killing scene literally made me wet with sweat as I could really feel what Danny was feeling. This movie was an experience that I will not forget anytime soon.",
      "review_date": "2020-02-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If one fine morning we discovered that from now on all people are one nation, one faith and one race, then even before dinner we would have invented new prejudices.George Aiken\n\n\nIf you haven't thought about serious things for a long time,If one fine morning we discovered that from now on all people are one nation, one faith and one race, then even before dinner we would have invented new prejudices.George AikenIf you haven't thought about serious things for a long time, watch this movie. There will be many thoughts at once",
      "review_date": "2020-08-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of the best movies, I have ever watched. It was such a nice and different experience. Edward Norton's acting was masterful such that you can understand every little pain he felt and caused. His smile and manner switching beforeThis is one of the best movies, I have ever watched. It was such a nice and different experience. Edward Norton's acting was masterful such that you can understand every little pain he felt and caused. His smile and manner switching before and after was so distinguishing. Movie's cinematography was also amazing; both black and white phase were amazing. The film ran smoothly and hands off to the director for making this movie such a gem along with shocking and unexpected ending. At last, I can say that you can watch this movie anytime.",
      "review_date": "2020-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Edward Norton is the best part of this movie, his character grows so much throughout the film as he abandons his racist past to help his younger brother. This is truly a must-watch and a masterpiece.",
      "review_date": "2021-04-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was way ahead of its time when it was released, as it discusses topics such as the neo-nazi movement and racism in the United States, which is still prevalent today. Tony Kaye does a great job in telling this story and discussingThis movie was way ahead of its time when it was released, as it discusses topics such as the neo-nazi movement and racism in the United States, which is still prevalent today. Tony Kaye does a great job in telling this story and discussing these topics, although it may not have turned out the way he intended to. Edward Norton arguably delivers the best performance in his entire career and it's such a shame that he didn't win an Oscar for it, and Edward Furlong also does a great job in his role. I also love how the film tells its story in a non-linear sequence, as it utilizes the black and white cinematography to showcase the flashbacks and cuts between the past and the present. There are some gruesome violent and sex scenes that I found it a bit hard to watch, but it doesn't take away from the experience. A must see classic that still remains relevant today and will go on to become one of the greatest films ever made.",
      "review_date": "2021-07-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most powerful films anyone should  and must watch. Edward Norton excels all boundaries of acting  In American History X. For a moment it just feels too real and you forget he's acting.  He lands a remarkable, touching, and trueOne of the most powerful films anyone should  and must watch. Edward Norton excels all boundaries of acting  In American History X. For a moment it just feels too real and you forget he's acting.  He lands a remarkable, touching, and true character, struggling to fight for the errors committed in the past.",
      "review_date": "2011-04-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was introduced to this film in a philosophy class. Undoubtedly one of the best films I've seen in moral issues. I recommend this movie to anyone who has not already seen, in fact, I recommend this movie to human and personal instruction.I was introduced to this film in a philosophy class. Undoubtedly one of the best films I've seen in moral issues. I recommend this movie to anyone who has not already seen, in fact, I recommend this movie to human and personal instruction. The film is already being shown in schools, which I think is a fantastic instructional level, but even an adult who still have not seen it have something to learn. In my class there were some tough guys, and even after seeing the film they reflected on the evil they had done until that day.",
      "review_date": "2011-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest films I've ever seen. Edward Norton is such a fantastic actor and Edward Furlong is such a underrated actor. It's a definite must watch.",
      "review_date": "2013-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "American History X is purely brilliant. It dispels and breaks down racism and prejudice without bashing it. Finally, a film that can convey a willingness to open oneself to new ideas, without writing off certain beliefs as taboo or evil. IAmerican History X is purely brilliant. It dispels and breaks down racism and prejudice without bashing it. Finally, a film that can convey a willingness to open oneself to new ideas, without writing off certain beliefs as taboo or evil. I can't say it doesn't take any side, but it certainly doesn't force any side on the viewer, and instead forces us to assert the situation as a whole. It's just an excellently directed and acted film in every way, and I think everyone should get the chance to witness what it has to offer.",
      "review_date": "2014-12-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "American History X is just as everyone's been wanting since its release to theaters. Now in its way to home media, it's something unmissable for you and only you.",
      "review_date": "2016-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Finally got to write a review for this great great movie. It's definitely emotional, touching, sad, but it was a great experience watching it. Amazing performances. The movie says, that a man can change, but actually there need to be a bigFinally got to write a review for this great great movie. It's definitely emotional, touching, sad, but it was a great experience watching it. Amazing performances. The movie says, that a man can change, but actually there need to be a big factor for that to happen  (like getting into prison, kidding). And there are always two sides of the story (the end). Of course, there where some unnecessary things. I promised to my boyfriend to mention it.. That little penis there in the bad room was totally unnecessary, like I laugh a lot to this 5cm hairy thing. :D",
      "review_date": "2018-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "With an impressively good performance by Edward Norton, a good and interesting script, interesting characters and an unpredictable and sad ending, American History X is a masterpiece of modern cinema.",
      "review_date": "2018-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its an amazing film. Solid acting by the cast and Edward Norton is amazing in it. The only downside of the film is that its rather graphic and can be off putting a bit.",
      "review_date": "2011-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A mess of a film that attempts some kind of message but fails dismally. Just like \"The Green Mile\" and \"Once Were Warriors\" before it, the film tries so hard to get a reaction from the audience that it ends up feeling forced and exhausting.",
      "review_date": "2005-12-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What we have here is a message picture determined to undo itself, with simple ideas (see: I think racism is a tad more complicated than Norton and his black friend) needlessly histrionic dialogue (see: interactions with family), andWhat we have here is a message picture determined to undo itself, with simple ideas (see: I think racism is a tad more complicated than Norton and his black friend) needlessly histrionic dialogue (see: interactions with family), and manipulating moments of over-drama with the force of a chainsaw rising out of a volcano (see: every scene in which racial atrocities are committed, which are all in black and white, slow-motion and have a choir singing the music of hell in the foreground).",
      "review_date": "2011-08-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's not an impressing movie. It is nothing great or big in it. It is not any light or teaching as the movie is expecting to give. The Norton is a good actor. The american life style and habit is not something to great to see. And this movieIt's not an impressing movie. It is nothing great or big in it. It is not any light or teaching as the movie is expecting to give. The Norton is a good actor. The american life style and habit is not something to great to see. And this movie is pretty much about it.",
      "review_date": "2011-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A good movie that had been better if not the forced, yet sometimes confusing message. Maybe if I watched it back in 1998 , I would appreciate it more, but its position in any kind of film rankings is misleading. The only thing I couldn`tA good movie that had been better if not the forced, yet sometimes confusing message. Maybe if I watched it back in 1998 , I would appreciate it more, but its position in any kind of film rankings is misleading. The only thing I couldn`t forget was Edward Norton`s exceptional performance,  and not only because others played roughly average roles. The story tries hard to establish the characters and the origin of racism but succeeds only in part. The viewer doesn`t get a full explanation, only bits of information that want him to think clearly : this is good, this is bad. We see a bunch of people changing their ways but we do not get the reasoning behind it.  The main conclusion is not very clear and doesn`t find a strong material to it in the movie. The result is : you get the message this movie wants you to get, but mostly because it is literally given to you at the very end of it. You do not really understand why this particular message, because the story suggests something different.  An excellent idea executed poorly with a bit of a genius play.",
      "review_date": "2011-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "White supremacist Derek Vinyard lands himself in prison having savagely murdered a black gang member caught trying to steal his truck. Whilst in prison he has time to reflect on his beliefs and realises that he must change his ways. Upon hisWhite supremacist Derek Vinyard lands himself in prison having savagely murdered a black gang member caught trying to steal his truck. Whilst in prison he has time to reflect on his beliefs and realises that he must change his ways. Upon his release however he finds that his younger brother, Danny, is following a similar path and vows to stop him.\r As an audience it can often be difficult to understand why a person may hold racist viewers. Unlike the majority of movies dealing with race however American History X paints a picture of why its characters feel and act the way they do giving it far more relevance to real life as well as making for a far more interesting movie.\r Fantastic performances from the cast, particularly Edward Norton in arguably his finest ever performance, also help to maintain the authentic feel of the movie. By the time it reaches its finale it is easy to have become invested in the characters in what is an engrossing look at racial tension within Los Angeles.",
      "review_date": "2014-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I had very high expectations going into American History X, but I found the whole to be less then the sum of it's parts. The film is full of situations but it never turns into a whole. This is not to say that it's parts are not extremely wellI had very high expectations going into American History X, but I found the whole to be less then the sum of it's parts. The film is full of situations but it never turns into a whole. This is not to say that it's parts are not extremely well made and powerful.",
      "review_date": "2012-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Edward Norton puts in a career-defining performance as Derek Vinyard, a smart yet troubled individual who is part of the Neo-Nazi movement after tragedy befalls his family.\rTold in a non-linear fashion, the story tells of Derek's rise in theEdward Norton puts in a career-defining performance as Derek Vinyard, a smart yet troubled individual who is part of the Neo-Nazi movement after tragedy befalls his family.\rTold in a non-linear fashion, the story tells of Derek's rise in the ranks of the movement, and an eventual vicious crime which leads to him being locked up. he soon sees a different side to his own life and attempts to alter it, one person not on board with his leaf turning is his fellow cult member brother, Daniel (Edward Furlong).\rWe see the typical everyday lives of the two brothers, who have to deal with a very sick mother and an over-bearing leader in their Neo-Nazi movement, and as the film goes on, we see beautifully rendered black and white flashbacks of Derek in prison, and he doesn't exactly have an easy time of it. He soon strikes up an unlikely friendship with a black inmate (Guy Torry), Derek, initially quite reluctant, starts to come out of his shell a little and begins to re-examine his hatred for different ethnicity.\rAmerican History X tells a strikingly painful yet optimistic tale, putting across a message of not to judge a book by its cover, but also to examine said cover in great detail, Norton's character is adorned in hate tattoos yet he is an extremely smart and well-educated individual, and the film also shows the boundaries that are pushed to send a message.\rEdward Furlong is worlds away from his heroic turn in Terminator, swapping that for a person we don't quite understand, he clearly has hatred for those outside of his white supremacy, yet we know this is largely due to the influence of his older brother, thus maintaining strong family ties. The heavy race theme of the film will of course spread controversial themes, but its all about looking at the bigger picture, the value of family and the measures of belief.\rNorton of course puts in an Oscar worthy performance, and although he didn't win, this was a clear stepping stone to bigger things, Fight Club being one of them.\rThere is a lot to take in tin this tale of trial and retribution, when a man who seeks revenge decides that this is not perhaps the best way to approach such a delicate matter, but a brother who simply wants the approval of his elder.\rPowerful and engrossing, American History X will not be to everyones liking, but it will certainly send a clear and simple message of love and hate combined in a wonderfully crafted piece of cinema.",
      "review_date": "2013-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I watched this for Edward Norton and he did not disappoint me. The movie alternates between his character's past and the present. He is a haunted man who just wants to be left alone, and to set his family affairs in order. But the movieI watched this for Edward Norton and he did not disappoint me. The movie alternates between his character's past and the present. He is a haunted man who just wants to be left alone, and to set his family affairs in order. But the movie failed to inspire me. Its attempts to evoke feelings of racial equality were mediocre at best. I feel that if they had done away with all pretence and concentrated solely on the transformation of Norton's character, this could have been something special.",
      "review_date": "2013-10-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "American history X has a comic book quality with its iconic picture of Edward Norton(playing Derek Vinyard) topless with a shaved head, circle beard and a swastika prominent on his chest.\rHe looks like a meanie.\rAnd he is.\r\nFor  the openingAmerican history X has a comic book quality with its iconic picture of Edward Norton(playing Derek Vinyard) topless with a shaved head, circle beard and a swastika prominent on his chest.\rHe looks like a meanie.\rAnd he is.\rFor  the opening scene of the movie has him massacring a group of black Americans(can I write Negroes?) single handed.\rHe is smart kid, we are told by Bob Sweeney, a black teacher who doesn't want to give up on the smart kids.\rSweeney is wrong, of course.\r'Smart 'doesn't describe it: the white dude is positively gifted.\rThat is why he has that swastika on his chest.\rAnd can go Rambo on them gangsters.\rAnd shame them Negros by whipping their asses on their own turf: basketball.\rAnd is best in his class, reading Native Son.\rStuff his dad disapproves of.\rIt is negro shyte, dad tells son Derek.\rYeah dad, he says even though he sounds somewhat unconvinced.\rCause dad is right.\rAnd likely racist.\rCause some black dudes got the jobs meant for the 'better' white men.\rBut it all went to shyte when dad, a fireman, got killed by them brothers.\rSo Norton shaves his head, grows a beard, tattoos his body, hangs up Nazi stuff in his room, and becomes a violent white power supremacist.\rCause that is how it works.\rAnd it works the other way too..\rMeet a good black man in jail that saves your butt:  anti-violent, equal rights-for-all supporter.\rFlip switch one way: violent white racist bloke. Flip switch other way: negro loving correct dude.\rJew hating fascist - liberal cheery guy.\rGay bashing hater - tolerant respectful LGBT man.\rRacist redneck Klansman - multicultural equality hero.\rWhat was that again: false dichotomy?\rThe tossed up eye candy - using things like black and white shots- can not hide that underneath all the visuals and emotionally laden scenes,  well played as they are - Norton is marvelous -  there is shockingly superficial story indeed.\rFor what is American History X but the glib tale of white guy who goes bad for wrong reasons, repents and tries to redeem himself by rejecting his white supremacist past  with a gesture that makes it look  like it is as easy as taking of your coat? You just need to meet a good black man to see that black men can be good. As if the racists glasses come off that easily.  As if racism is just being pissed at black men because a black man killed your father.\rBut wait. In the end? Will Derek don that white supremacist coat again?\rThe switch trembles.\r Bottom line.\rThe cast is great, the cinematography well done, but the movie sucks. Like biting in a burger to find out  that the dog stole the meat. (It was the cat, of course. Cause them are smart buggers and frame the dogs.)\r Note: do not to forget to shave your head once you become a white supremacist. It is a thing. As a man of course: women stock up on combat boots, piercings and short hairstyles. And tattoos for all. At least there is some equality there.",
      "review_date": "2016-07-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A well-made film that raises awareness of the harmful nature of hatred and the consequences of racism.\r (Note: It's violent, so I would not recommend it to all audiences.)",
      "review_date": "2015-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved this movie as a teenager. Rewatching it today I completely understand why it rates in the 60s. It's still enjoyable to watch and Ed Norton is great, but it's terribly overwrought in parts and unintentionally hilarious in others. TheI loved this movie as a teenager. Rewatching it today I completely understand why it rates in the 60s. It's still enjoyable to watch and Ed Norton is great, but it's terribly overwrought in parts and unintentionally hilarious in others. The basketball scene is pure comedy!",
      "review_date": "2017-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If it wasn't for the violence this would seem like an after school special from the old days, despite its cinematic pretensions.  Granted, the acting and cinematography were great, as was the conceit of having the story told by the youngerIf it wasn't for the violence this would seem like an after school special from the old days, despite its cinematic pretensions.  Granted, the acting and cinematography were great, as was the conceit of having the story told by the younger brother, but the didacticism of the movie and its persistent homoeroticism (which, don't get me wrong, I love a good-looking man, but it did get a bit tedious) coupled with a simplistic plot, kept the movie from reaching its potential.",
      "review_date": "2019-09-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "American History X has one of the most compelling stories I've seen in movies in a while. It's a gut-wrenching, and heartbreaking story. But Tony Kaye's powerful and challenging direction is what made the movie so provocative.The movie alsoAmerican History X has one of the most compelling stories I've seen in movies in a while. It's a gut-wrenching, and heartbreaking story. But Tony Kaye's powerful and challenging direction is what made the movie so provocative.The movie also proves that Edward Norton has a huge talent that, unfortunately, has been wasted. Norton delivered the performance of his career in this movie. A performance that elevated the entire movie. While Derek Vinyard, Norton's character, has the most powerful lines in the movie, they wouldn't have been as powerful as they are without Edward Norton's staggering delivering.Also, Edward Norton's performance may be the only thing that remained sharp and solid throughout the whole movie. Because aside from Norton's riveting and smart monologues, the dialogue in this movie, especially at the first two acts, is so weak and often cheesy! The things got better at the last act but at that time I was wondering why the dialogue wasn't that good most of the movie. It's really baffling because the movie needed badly to have a decent and strong dialogue from its beginning, considering its subject matter. The dialogue often was too on the nose and preachy while it should have served its already gripping story. That also made some scenes in the movie feel so awkward and heavy-handed.The dialogue isn't the only, or the biggest issue I've with American History X. As I think that everything related to the Neo Nazi gang is completely underdeveloped. All the characters of the members of this gang are one-dimensional characters. They are totally undeveloped and bland, and almost have no depth. Which is a shame because they play a pivotal part in the story. They are part of the main plot, so to speak.Besides that balancing between two contradictory aspects of the story, Tony Kaye with his mixture of black & white history contrasting with colorful reality is magic to absorb and shows this film up to be what it is. Smoothly moving camera in the scenes in Black and White that are set in the past to convey an unsettling feeling, and bleak and restrained colored scenes to match the dystopian-like present.American History X also has one of the most shocking endings ever. But its ambiguity is what makes it more dreadful. It's an ending that can make you question the protagonist's fate, and that's more than horrifying!(8/10)",
      "review_date": "2018-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This title, Black and White politics has two dimensions in its context. The first one simply points out the racist drawings about the Black and white people in America and the second one recalls us that the Black & white period were peopleThis title, Black and White politics has two dimensions in its context. The first one simply points out the racist drawings about the Black and white people in America and the second one recalls us that the Black & white period were people who seem to be colorless. American History X is none other than that. The subject is so strong and it has its world appeal. It looks familiar not only in America but also in the entire world. Racism and important topic which was talked, discussed and rectified (up to a mark) all-time ago but it has its significance in these times also. We are unable to eradicate it. And that core element swings through each and everyone which indirectly points to secularism and the shut down of secularist vision. Racism has strong roots nowadays also. When it comes to the film, mainly it revolves around the character of Norton, his subjective consequences, and his mind stage from wrong to right and his relieving part. In the end, there comes another beginning of the circle where he carries his brother's shot dead body. The politics is just between black and white similarly it was the politics in between right and wrong.",
      "review_date": "2020-04-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "American History X is pretty much about this lad called Derek (Edward Norton) who's served three years in prison for a hate crime.Since he's got out of prison, he wants to try and change the thoughts on which his brother Danny (EdwardAmerican History X is pretty much about this lad called Derek (Edward Norton) who's served three years in prison for a hate crime.Since he's got out of prison, he wants to try and change the thoughts on which his brother Danny (Edward Furlong) is having. The reason for this is so, that his brother Danny, doesn't follow the same path on what he did and what it did to him.The movie's got some outstandingly good acting from all of the cast especially from Edward Norton, this might be his best performance yet.There's lots of dark and racist moments which end up happening throughout this movie and it shows what racism can be really like around the world.Also, the moral which this movie's got is honestly well shown and it's about how bad racism really is and how violence begets violence and how it can effect someone.The flashback which Derek has in prison shows us what he experienced and how he had great character development when he came out of prison.Overall, American History X is a great movie. The movie's got a brilliant story, some brilliant acting, some very strong and graphic scenes, a great moral and it shows a lot about racism.",
      "review_date": "2020-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is not exactly reflecting the time or place I live in but it doesn't matter because the film explains it very clear. The film is a very interesting story about the trouble of the American society, which is of course very sad andThis film is not exactly reflecting the time or place I live in but it doesn't matter because the film explains it very clear. The film is a very interesting story about the trouble of the American society, which is of course very sad and unfortunately but is an important concern. The film's character, Derek, is a very well constructed character, and at least I can sort of understand his opinion and thoughts through the film, and while his opinion changes, mine starts to shift too and I start thinking my self, its a cool happening, with lack of a better word, and caught me off guard.The film is very well done and doesn't have many bad scenes, I think the characters and their personality is fantastically done and acted, they were super realistic. This film has some really tough, powerful, violent scenes which I as a teenager liked, but It also had some emotional and sentimental scenes which I also really liked. I feel like both of these elements were very important elements for the film.American History X got allot of wise life advice and really left you thinking, and that's how you know that it's a good movie.",
      "review_date": "2020-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really loved the message and performance by Norton, but I feel like there's something missing in the script which makes it too simple. Even though I can't explain myself how the critics give it such a low rating",
      "review_date": "2021-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Movie was great but the tragec ending took away alittle.",
      "review_date": "2005-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Single greatest movie of all time, in my eyes.",
      "review_date": "2006-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The basketball scene was horrible. Were we expected to stand up and cheer \"Go white racists, go!\"? I think this movie really failed to address what lies beneath these subgroups. Not every one of those hundreds of kids had a The basketball scene was horrible. Were we expected to stand up and cheer \"Go white racists, go!\"? I think this movie really failed to address what lies beneath these subgroups. Not every one of those hundreds of kids had a fireman-dad-get-shot-by-crackguy story - how did they get caught up in this B.S.? The movie doesn't say. There are a lot of strong performances but a lot of stuff that just doesn't add up.",
      "review_date": "2007-05-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Some of the best acting I have ever seen.",
      "review_date": "2008-10-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The most powerful movie I have ever seen. Its truly is a wonderful film. And the outstanding acting by Edward Norton! Loved it!",
      "review_date": "2008-05-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie pisses you off, makes you cry, and think about \"What you have done to make your life better.\"",
      "review_date": "2005-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie shows everyhitng that people need to know about skinheads...Sttuff you think is not out there.",
      "review_date": "2006-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Way too good of a movie for the critics to come up with a 62 rating. Well acted. I think it gave a realistic insight to why some people believe what they believe. I don't think anybody would argue that racism is ugly and terrible. I Way too good of a movie for the critics to come up with a 62 rating. Well acted. I think it gave a realistic insight to why some people believe what they believe. I don't think anybody would argue that racism is ugly and terrible. I compare this movie to \"Crash\" as far as attempting to show small unseen factors that effect people.",
      "review_date": "2007-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most brilliant films of a generation.",
      "review_date": "2008-04-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A film well done. A must seen!",
      "review_date": "2009-06-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's almost brilliant. Almost. Certainly it's a stunning evocationcondemnation of this right-wing everyone-hating mindset. And the acting is superb: Ed Norton, Stacy Keach, John Connor, Avery Brooks and so on are all incredibly It's almost brilliant. Almost. Certainly it's a stunning evocationcondemnation of this right-wing everyone-hating mindset. And the acting is superb: Ed Norton, Stacy Keach, John Connor, Avery Brooks and so on are all incredibly impressive. Oh, and the direction is pretty damn good, as you would sort-of expect from Kaye having seen his previous work - any British people who've seen any of advert-nostalgia programmes: the chap who did the Intercity \"Relax\" adverts in '89, and the Dunlop S&M \"Tested For The Unexpected\" one in '95, the bald-headed tit with about ten billion facial piercings: that was Tony Kaye, that was. So why is it only \"almost\" brilliant? Well, it doesn't quite hold up as a piece of drama is the thing. A few too many convieniences. The plot is second to the social commentary, but it could have gone hand in hand. Still, though, if it's not brilliant, it is at least pretty damn great. Can't say fairer than that.",
      "review_date": "2003-10-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Superb directing and acting. Tony Kaye takes us on a dramatic journey that leaves us on the edge of our seat.",
      "review_date": "2005-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i thought this movie was very good,then ending of the movie had my heart racing it's an amazing movie with a good message and this movie just shows what happens to people all around the world every day that this stuff is really real and i thought this movie was very good,then ending of the movie had my heart racing it's an amazing movie with a good message and this movie just shows what happens to people all around the world every day that this stuff is really real and we should try to do more to become a better society and world.",
      "review_date": "2006-05-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I could say a lot more about this movei than I'm going to, simply because my fingers are all typed out;) I'm shocked at the low rating this film got- It's one of my favorites. Norton is a master, and Furlong just clinches it I could say a lot more about this movei than I'm going to, simply because my fingers are all typed out;) I'm shocked at the low rating this film got- It's one of my favorites. Norton is a master, and Furlong just clinches it for me. Well written, well acted and well directed- this one speaks to all my longings as an avid movie-buff and cinema freak.",
      "review_date": "2006-07-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Superb film, very thought-provoking, Norton should have won an oscar.",
      "review_date": "2006-08-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Powerful stuff.....great performance by the lead character. Should have won Oscar.",
      "review_date": "2007-12-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Stunningly moving flim with an immense performance from edward norton, a crushing, moving ending after a movie ridden with thought provoking and captivating story lines and scenes.",
      "review_date": "2008-03-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest movies ever made. Norton's performance was inspiring.",
      "review_date": "2008-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Unbelievable film. great acting performance by ed norton and genius directing by tony kaye, although he didn't feel he was able to make it exactly how he wanted it in the final editing. The movie gives a great message, and shows how Unbelievable film. great acting performance by ed norton and genius directing by tony kaye, although he didn't feel he was able to make it exactly how he wanted it in the final editing. The movie gives a great message, and shows how some perfectly valid right wing ideas can go completely misconstrued.",
      "review_date": "2009-05-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "one of the best movies ever. has great storytelling, and a powerful ending.",
      "review_date": "2006-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I enjoyed American History X because it dealt with racism well, maybe not as well as To Kill A Mockingbird but it does a fine job anyways. I saw American History X after watching many classics the previous week before. It stood out to me for I enjoyed American History X because it dealt with racism well, maybe not as well as To Kill A Mockingbird but it does a fine job anyways. I saw American History X after watching many classics the previous week before. It stood out to me for some reason I feel that it was misunderstood by some critics. It is an underrated film. But as I watched it for the first time I realized that this film was a monument in movies. [***SPOILERS***] As the final seen rolled and you see Edward Norton crying over Edward Furlong, I thought it was the best movie I had ever seen. But as I moved on in the history of movies my knowledge grew and I realized that this film was superb but good never be the best film I have ever seen because i was young and had no knowledge of Kurosawa yet. As I watched it for the second time I felt it was old and not as gripping as the first time around. So was a great film? Yes, But is it a movie that should be considered the best ever? I do not think so.",
      "review_date": "2006-04-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of the best movies around. It actually shows the real relationship between different races; it shows not only that white people are racist but other races are too.  This movie is very informational, and expresses a good, true moral!",
      "review_date": "2006-04-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The most powerful movie I have ever seen. Bar none. Norton solidifies himself as a movie god.",
      "review_date": "2007-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I came in not knowing what to expect, but I left knowing that I just watched one of the best movies ever, bound to be a classic this movie is a MUST SEE, Edward Norton's performance is so strong and believable it's hard to not call I came in not knowing what to expect, but I left knowing that I just watched one of the best movies ever, bound to be a classic this movie is a MUST SEE, Edward Norton's performance is so strong and believable it's hard to not call him one of todays best actors, bottom line, easy 10.",
      "review_date": "2007-05-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really enjoyed this movie. Launched in 1998, it remains extremely current and relevant today, in the midst of a world where hatred and intolerance seem to have settled in to stay. I'm not just talking about the Nazis, but about so manyI really enjoyed this movie. Launched in 1998, it remains extremely current and relevant today, in the midst of a world where hatred and intolerance seem to have settled in to stay. I'm not just talking about the Nazis, but about so many others who hate each other for the most diverse and, not infrequently, the most idiotic reasons.The film follows the path of two brothers in the neo-Nazi world: Derek, the eldest, became the leader of the local gang, formed to resist what they considered to be an invasion of their neighborhood by blacks, Latinos and other races. It turns out that he ended up killing, in cold blood, two blacks, and was arrested for it, leaving his younger brother Danny lost and confused. When he gets out of prison, he finds that his brother has followed in his footsteps and is now being indoctrinated to become just like him, even writing an essay laden with neo-Nazi doctrine for a black teacher at his school... but prison changes people, and Derek no longer follows those ideas. Therefore, he decides to collaborate with the teacher and the authorities, and try to prevent his brother from becoming a person as violent and harmful as he is.Directed by Tony Kaye, the film was produced under the sign of discord, with constant fights in which the director opposed the revisions and changes demanded by the actors to their material and ideas. Things got to the point where the director wanted to give up, and see the name removed from the credits! Personally, and after seeing the film, I feel the direction is not safe and the film doesn't seem to know where to go at times. The script, in turn, brings us a powerful family drama and addresses tough, pertinent and current issues, such as the breakdown of the family, local neighborhood communities, illegal immigration, hatred between races and religions. The script even manages to avoid portraying neo-Nazis in a simplistic and one-dimensional way, as fanatical beasts without any humanity, as other films would have done. Even so, it is a simple narrative, sometimes undeveloped, in which some details sound far-fetched. One of the less developed and most important points of the film is the story of Derek in prison: it is inconceivable that such an indoctrinated and fanatical individual could radically change with so little.The cast is very good and, without a doubt, one of the strengths of the film. Edward Norton proved to have made the right choice when he decided to star in this film instead of being just another actor in \"Saving Private Ryan\". The film is perfect for him, and the changes that he made to the material he received allowed him to improve the character, smooth the edges and make the fruit of his work even more mature and juicy. The actor is exceptionally good, I've said it on other occasions, and this film shows, once again, his talent. Next to him is Edward Furlong, a young and promising actor who, as we know, never took off. He's good, and he shows us that, even in a movie where the character is relatively minor in the plot. Stacy Keach appears little, but manages to appear menacing and subversive. Beverly D' Angelo is good, but she got a blank character and Avery Brooks limited herself to what she had to do and her character sounds, well, amorphous and uninteresting. Also noteworthy were the honorable appearances of Fairuza Balk (in yet another slightly eccentric character) and Ethan Suplee.Technically, it's a film with many points of value in its favor, starting right away with a good filming and cinematography job. The use of black and white to differentiate all flashbacks worked perfectly, even though it sometimes makes the film too dark and seems to me to have been overused. The makeup work, particularly Norton, allows him to assume a younger, aggressive and physically tough face and attitude in the flashback scenes, making a good counterpoint to the portrait of maturity and awareness that the actor brings to us after his character leaves from prison. The sets were really well done, particularly Derek's room with all those Nazi props. The visual, special and sound effects work well and the soundtrack, signed by Anne Dudley, sounds good, although it is very similar to thousands of other movie soundtracks out there.",
      "review_date": "2021-08-11",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 124,
  "genres": [
    "Drama",
    "Crime"
  ]
}