{
  "title": "The Truman Show",
  "rating": 6.7,
  "release_date": "1998-06-05",
  "genre": [
    "Drama"
  ],
  "summary": "Twenty-nine years ago, a baby boy was adopted by the OmniCam Corporation to become the subject of the most popular television show of all time. His name is Truman Burbank.  (Paramount Pictures)",
  "critic_reviews": [
    "A gemlike picture crafted with rare and immaculate precision.",
    "Delicately subversive, hypnotically sardonic, full of terror, banality and wafer-thin lyricism.",
    "That rare cinematic experience-a movie so close to pure perfection that it seems a shame to spoil it by even reading a review beforehand.",
    "An original, inspired piece of work.",
    "Weir's offbeat directing makes the most of Andrew Niccol's inventive screenplay, which includes large doses of surprisingly sardonic satire aimed at today's entertainment trends.",
    "I enjoyed The Truman Show on its levels of comedy and drama; I liked Truman in the same way I liked Forrest Gump--because he was a good man, honest, and easy to sympathize with.",
    "A miraculous movie. It will rattle both your head and heart",
    "A beautifully sinister and transfixing entertainment-age daydream.",
    "A sunny-looking movie about the darkest paranoia.",
    "Adventurous, provocative, even daring.",
    "One of the smartest, most inventive movies in memory, it manages to be as endearing as it is provocative.",
    "Hollywood's smartest media satire in years--and a breakthrough for Jim Carrey.",
    "The Truman Show is one of the films for which the '90s will be remembered, and it is not to be missed.",
    "The result is a rarity on any screen: intelligent fun.",
    "Funny... and the payoff is the most provocative Hollywood concoction in a while.",
    "A crowd pleaser that caters to our horror of totalitarianism, our love of personal freedom, our belief - justified or deluded - that knowledge is a powerful tool and that access to information is a God-given right.",
    "Warm, affecting and refreshingly shtickless, he (Carrey) occupies center stage here through sheer, beguiling force of personality.",
    "Carrey is a genius at registering the rage behind television's sunny smile, while Laura Linney excels as his wife.",
    "The film is a nightmare but an oddly comforting one.",
    "A sharp-witted, visually layered, gorgeously designed, meticulously directed piece of formula pablum.",
    "An appealing, offbeat, one-hundred minute diversion for those who really are tired of monsters tearing down buildings and action heroes saving the world.",
    "A cool indictment of television's near-irresistible pandering to the inner peeping tom.",
    "Undeniably provocative and reasonably entertaining, The Truman Show is one of those high-concept movies whose concept is both clever and dumb.",
    "The film is unfortunately about little more than its potentially mind-boggling plot and structure.",
    "It's unusually provocative and challenging for a Hollywood movie and, surprisingly, allows the audience to piece things together without too much external direction."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Seriously, hands down- one of my favorite movies. The story is orginal. The cinematography is perfect. Jim Carey is excellent. Surely this movie is a comedy and it has it's fair share of funny moments however, the depth of this movie is whatSeriously, hands down- one of my favorite movies. The story is orginal. The cinematography is perfect. Jim Carey is excellent. Surely this movie is a comedy and it has it's fair share of funny moments however, the depth of this movie is what brings me back time and time again.",
      "review_date": "2010-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A fantastic movie with a interesting plot that makes you think, and a very good performance by Jim Carrey.",
      "review_date": "2010-01-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Best Movie of 1990s. Jim Carrey gave a performance of his lifetime.",
      "review_date": "2006-11-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "All you tools that don't have the brain power to understand the simples plot of The Truman Show should go back to your tool racks and rust. And for all you kids crying about there not being action in the move, it's because IT\"S NOT All you tools that don't have the brain power to understand the simples plot of The Truman Show should go back to your tool racks and rust. And for all you kids crying about there not being action in the move, it's because IT\"S NOT AN ACTION MOVIE!",
      "review_date": "2009-10-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a movie about ideas. The drama is well crafted and the movies prediction to the ethics of modern media and reality TV is brilliant. There is much to think about with the themes and analogies this movie presents. The Truman Show is oneThis is a movie about ideas. The drama is well crafted and the movies prediction to the ethics of modern media and reality TV is brilliant. There is much to think about with the themes and analogies this movie presents. The Truman Show is one of my favourites. HIGHLY RECOMMENDED.",
      "review_date": "2011-09-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Brilliant movie idea and a great performance by Jim Carrey how he did not win an Oscar for this suggests that perhaps they do have a thing against some comedians.",
      "review_date": "2012-11-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"The Truman Show\" can truly be considered a cult classic. This is one of the best Jim Carrey movies to date, and even a fantastic movie period. Nothing short of a masterpiece.",
      "review_date": "2013-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie might be the trigger of all reality shows in television industry. Yeah, who knows? Only this one is the realest reality show ever. No script and no drama. But surely I don't wanna live like this. It's like being betrayed, right?This movie might be the trigger of all reality shows in television industry. Yeah, who knows? Only this one is the realest reality show ever. No script and no drama. But surely I don't wanna live like this. It's like being betrayed, right?\rWatching this movie made me think how God rules this world and the humans. How God tries to \"control\" Truman's life and finally gives up to his persistent will, which finally leads to the change of his destiny. Isn't it interesting? It's just like being given the primary secret on how to get what you really want. Great!!! I hope I can practice it in my life",
      "review_date": "2016-01-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "wow, some of these user votes have the most retarded, ignorant opinions. this is one of my favorite movies, and is a genius film if you think about it...and whoever thought that this was an action flick is a moron.",
      "review_date": "2010-01-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My favorite movie. This film silences even the harshest Jim Carrey critics. This man was robbed of an Oscar nomination for his performance in this movie. Great supporting performance by Ed Harris as well. This movie will really make you My favorite movie. This film silences even the harshest Jim Carrey critics. This man was robbed of an Oscar nomination for his performance in this movie. Great supporting performance by Ed Harris as well. This movie will really make you think and you won't be shy of things to talk about after you watch it. This is quite simply the most original movie I have ever seen. The greatest film of the 90s.",
      "review_date": "2006-08-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is amazing and anyone who thinks oherwise is wrong... Jim Carey was amazing in it. The movie was easy to understand and follow.",
      "review_date": "2007-01-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A brilliantly made movie, with fun, suspense and even a little action. Jim Carry does a great job selling the role and is supported by great actors/actresses.",
      "review_date": "2006-10-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Jim Carrey may have more notoriety for his zany humor-driven titles like Ace Ventura or The Cable Guy, but they're all second to the authentic performance delivered in The Truman Show - a movie that in some ways reinvented reality TV andJim Carrey may have more notoriety for his zany humor-driven titles like Ace Ventura or The Cable Guy, but they're all second to the authentic performance delivered in The Truman Show - a movie that in some ways reinvented reality TV and inspired other films to be made (ED TV).  The cast is excellent and the movie has a charm about it that is undeniable.  If you haven't seen this movie yet, add it to your list because it's one of the greatest films of the 90s.  Some may say of all time.",
      "review_date": "2014-08-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Truman Show is an undeniably great movie. However, I feel the TV show aspect should have been kept a little more secret and only revealed at the end. It would have made a great mystery or rug pull movie. But The Truman Show we have isThe Truman Show is an undeniably great movie. However, I feel the TV show aspect should have been kept a little more secret and only revealed at the end. It would have made a great mystery or rug pull movie. But The Truman Show we have is excellent anyway.",
      "review_date": "2014-09-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is so awesome in every way. It manages to prove that a funny man can break our hearts (which would happen again in Punch Drunk Love with Adam Sandler some time after). This film has one of the most original story-lines from '98 andThis movie is so awesome in every way. It manages to prove that a funny man can break our hearts (which would happen again in Punch Drunk Love with Adam Sandler some time after). This film has one of the most original story-lines from '98 and is written to perfection. The balance of originality and great writing, not to mention Carrey, isn't the only thing that delivers a power punch. It is the message, that is explained in such a manner that even the people not searching for depth in the first place can find it, that is amazing. The depth of thought that the writers went through to get to the theme that \"whatever world we are born in, we will instantly believe is real\" is astonishing. The Academy made big mistakes in '98: 1. Saving Private Ryan not winning Best Picture, and 2. The Truman Show not being nominated for Best Picture, Actor, Score and Cinematography (the first two getting a win wouldn't have been an upset to me). Basically, if you want a wholly original film that is funny, heartbreaking and thought-provoking, The Truman Show is one of the best picks.",
      "review_date": "2011-02-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is my absolute favorite movie ever.  Jim Carrey is brilliant in a role that isn't slapstick comedy--I much prefer him here.  The movie is well crafted all-around, from the casting to the soundtrack.  The story is compelling and unique,This is my absolute favorite movie ever.  Jim Carrey is brilliant in a role that isn't slapstick comedy--I much prefer him here.  The movie is well crafted all-around, from the casting to the soundtrack.  The story is compelling and unique, drawing you into the artificial world Truman lives him.  Follow him in his journey towards knowledge of the truth!",
      "review_date": "2011-01-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The figurine was simply perfect. The script, I should say that if you don't count the cliche's, so is too. The acting was amazing, but the scenario could have been better. The soundtrack would have been better if it wasn't for one single songThe figurine was simply perfect. The script, I should say that if you don't count the cliche's, so is too. The acting was amazing, but the scenario could have been better. The soundtrack would have been better if it wasn't for one single song that was bad. The skin of the film was bad. Like, really, really bad. The choice for the actors was great, if you don't count that they chose that actress to do Sylvia. She isn't beautiful enough to do a woman who makes a men fall in love with her at the first sight. But she was a great actress. The special effects (that were supposed to be bad) were really perfect, as was the make-up and the hair. And finally, the photography of this film was absolutely perfect.",
      "review_date": "2011-10-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This gripping film is not what it looks like, when you see Jim Carrey on the cover. This very emotional and profound comedy drama with this light provoking note between the lines is featuring Carrey's performance of a lifetime, a evil andThis gripping film is not what it looks like, when you see Jim Carrey on the cover. This very emotional and profound comedy drama with this light provoking note between the lines is featuring Carrey's performance of a lifetime, a evil and mean Ed Harris and a memorable climax. Big cinema!!!",
      "review_date": "2013-05-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An original, thought provoking, and deeply affecting movie; The Truman Show is not only funny, and emotionally draining; It correctly predicts a world gone crazy over reality television.  It's very smart, directed with unique style, andAn original, thought provoking, and deeply affecting movie; The Truman Show is not only funny, and emotionally draining; It correctly predicts a world gone crazy over reality television.  It's very smart, directed with unique style, and contains what is one of Carrey's best performances.  This movie also has the power to make you paranoid; even more so than The Matrix.  You'll feel great empathy for Truman throughout the whole movie.  He's a great character.  It's a great movie.  It's a classic.",
      "review_date": "2014-10-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wonderful movie with a though. A though of many people lives. Good storyline, music, idea, actors performance and whole movie is amazing. One of those movies where you speak about it when it ends.",
      "review_date": "2013-08-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Weir's impeccable directing and the brilliant script give this film the deserving title of a true masterpiece. Carrey proves his versatility as an actor and the supporting cast help deem this a true work of art.",
      "review_date": "2013-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Plato's Cave from 20th (almost 21th) century. Cativant, acid, tense and very clever. Hard not feeling bad about truman and intrigued about entire movie.",
      "review_date": "2018-09-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"The Truman Show\" dares to question the reality. It's original, complex, and philosophical. It manages to make you feel truly frustrated and claustrophobic.\r Perhaps many of us can relate to Truman as we live in a time of routines. We often\"The Truman Show\" dares to question the reality. It's original, complex, and philosophical. It manages to make you feel truly frustrated and claustrophobic.\r Perhaps many of us can relate to Truman as we live in a time of routines. We often live our lives without giving a second thought to the simplicity and meaninglessness of life itself. Our limited perspectives keep us from seeing. The lies we are told keep us from the truth. If we could push the boundaries of our reality, what are the odds that we'd face what Truman faced in the end?\r It was a joy to watch \"Jim Carrey\" as \"Truman\", it is yet another proof that Jim isn't just a comedian.",
      "review_date": "2014-10-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Proving that a blockbuster doesn't have to be big, brash, vacuous and wedged with a ton of eye-stinging special effects, The Truman Show is practically an anti-Event Movie. Instead of taking a low-brow/high-thrill approach to its ingeniousProving that a blockbuster doesn't have to be big, brash, vacuous and wedged with a ton of eye-stinging special effects, The Truman Show is practically an anti-Event Movie. Instead of taking a low-brow/high-thrill approach to its ingenious idea, Peter Weir has given us a thoughtful, intelligent, wholly character-driven masterpiece. Nor is it just a great movie in its own right; it's a great mainstream movie. Watch it by yourself, take your girlfriend/ boyfriend or go with a bunch of friends, you'll enjoy it just the same. Like Titanic, The Truman Show is a rare multiplex crowd-pleaser that doesn't begin to insult your intelligence and, because of this, it more than makes up for big disappointments Godzilla, Lost In Space and Armageddon.\r Of course, the less you know about the plot the better, as this is an extraordinary experience from start to finish. It's the sort of movie that you wish Hollywood made more often: the perfect combination of a witty script (mercifully unhacked by gag-adding writers-for-hire), a refreshingly short running-time and a small principal cast so perfectly suited to their on-screen roles they might have been born to play them. Harris brings a controlled God- complex to the role of The Truman Show's creator/producer/director Christof and Linney excels as Truman's slogan-spouting wife. McElhone, meanwhile, has the difficult task of playing the plot-advancing, rebellious love interest who tries to convince Truman that it's all a lie. Yet, although their performances are faultless, these actors are constantly being eclipsed by the two real stars.\r The first is the bizarre premise. Truman Burbank (Carrey) has grown-up in the artificial town of Seahaven, a prefab suburban nirvana jammed in a happy timewarp sometime between the '50s and the '90s. Five thousand mini-cameras (hidden in plants, car radios, shirt buttons and the like) survey this mammoth television sound stage, following every aspect of Truman's existence and broadcasting it 24 hours every day to an eager world. Actors play his friends and relatives, while Christof (who gets to utter such lines as \"Cue the sun\"), manipulates this goldfish bowl-style micro-reality from an office concealed behind the Moon. It's only after a series of on-set accidents (a spotlight falls out of the sky and Truman tunes into a radio frequency instructing the show's actors), that our hero starts to question the world around him.\r Naturally, the impact of this concept would be lessened without a believable central character, and Carrey turns in the performance of his life. Forget his rubber-faced zaniness in comedies like Ace Ventura and Liar Liar. It doesn't matter if you've never liked him before. Yes, there are still traces of the OTT comedian in the character of Truman, but Carrey approaches his role with gentle, honest kindness, creating a real human being with real emotions, who's about to discover his life has been a carefully-orchestrated lie. It's a powerful, masterfully understated and moving performance, veering perfectly between moments of humour and heart-tugging seriousness. Carrey deserves full credit for his part in making The Truman Show the huge success it so evidently is.\r Clever, funny, enjoyable, this is not just the best mainstream comedy of the year, it might rank as the best of the last five years. With a multitude of subtexts, social comment and satirical sideswipes, it's a beautifully-crafted, emotional piece with an original heart and an irresistible storyline. It's so good you don't want it to end. Films this great don't come along often. Queue to see what is surely one of the defining movies of the '90s.\r Jim Carrey proves he has more than one acting dimension in this original, clever tale of junk-culture excess. The Truman Show makes every other block-buster look empty and stale. Hollywood take note: intelligent film-making can work. More please...",
      "review_date": "2015-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best ways to represent the postmodernism\rThe best movie that Jim Carrey could ever have\rAnd that saying much. I enjoyed it watching it, im sure im gonna to watch it over and over.",
      "review_date": "2016-05-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There really isn't a movie quite like The Truman Show. Funny, thought-provoking, heartwarming, a commentary on consumerism and society, charming, and deep are just some of the phrases I would use to describe this one-of-a-kind movie. EasilyThere really isn't a movie quite like The Truman Show. Funny, thought-provoking, heartwarming, a commentary on consumerism and society, charming, and deep are just some of the phrases I would use to describe this one-of-a-kind movie. Easily one of Jim Carrey's best performances. Andrew Niccol's script and Peter Weir's direction go hand in hand. The cinematography is so subtle that you almost forget about it. The Truman Show is almost a perfect philosophical film, and one I highly recommend.",
      "review_date": "2018-11-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wow, I've just seen it again in 2016.\rThis movie aged very well, and this is a clear indicator of the quality.\rGood script.\rGood performances.\rGood screenplay.\r26 years later and -as the good wines- it gets better with time.",
      "review_date": "2016-08-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The plot may rarely override itself in some moments, but nevertheless \"The Truman Show\" is a funny but sad movie that uses wonderful performances by Jim Carrey and innovative direction from Peter Weir as its main fuel.",
      "review_date": "2011-10-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best Jim Carrey movie ever made. This movie shows that Jim Carrey is more than just the wacky guy off of Dumb & Dumber. He can act and he can act very well in dramatic movies.",
      "review_date": "2011-03-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hands down, this film rocks. The world created for Truman and the way they movie plays out is truly amazing. I love seeing films like this make their way into theaters and into our hearts.",
      "review_date": "2013-09-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Magnífica atuação de Jim Carrye, em um fantástico filme com uma ótima históriaMagnífica atuação de Jim Carrye, em um fantástico filme com uma ótima história    ",
      "review_date": "2014-01-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A brilliantly written and directed dramedy, featuring easily the best performance Jim Carrey has ever committed to film.",
      "review_date": "2012-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing movie! Other then Eternal Sunshine my favorite Jim Carrey movie ever. Carreys acting, the direction, the story and just about everything else in this movie is fantastic.",
      "review_date": "2014-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Taking reality TV taken to its ultimate extreme everything Truman Burbank has done since birth has been seen live by a worldwide audience of millions. Unfortunately for Truman he is unaware of this as he lives inside a giant Hollywood domeTaking reality TV taken to its ultimate extreme everything Truman Burbank has done since birth has been seen live by a worldwide audience of millions. Unfortunately for Truman he is unaware of this as he lives inside a giant Hollywood dome containing a made for TV town. Everyone in his life, his friends, his neighbours, even his wife are all actors hired by the shows creator.\r Jim Carrey is unusually reserved, but brilliant in the title role importantly making Truman likable so that we really begin to feel for him as the movie reaches its climax. Part satire, part comedy and part drama The Truman Show is one of those rare movies that takes an original, intelligent and interesting concept and truly makes the most out of it. It is rare for a film to entertain whilst also making you think but this is one movie that certainly manages it.",
      "review_date": "2013-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Just absolutely love the movie. It is a weird one that really makes you think, but as Truman begins to get wise to everything, it is hard not to root for him. The drecting was great, Jim Carrey was funny and great, and all of the supportingJust absolutely love the movie. It is a weird one that really makes you think, but as Truman begins to get wise to everything, it is hard not to root for him. The drecting was great, Jim Carrey was funny and great, and all of the supporting actors did well. The movie is certainly funny, but is more than just a comedy.",
      "review_date": "2013-07-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In the world of Jim Carrey, all he does is basic stuff. Making people laugh at his comedic skills, but with the Truman Show, things are beginning to change for him and his moviegoing industry. Okay sure this was also comedy, but it's by farIn the world of Jim Carrey, all he does is basic stuff. Making people laugh at his comedic skills, but with the Truman Show, things are beginning to change for him and his moviegoing industry. Okay sure this was also comedy, but it's by far more than that.",
      "review_date": "2016-05-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The whole concept of this movie is just amazing. It's an original idea that is developed perfectly. The acting and cinematography are both extremely well done. In general, this is an all around great movie and one of my personal favorites.",
      "review_date": "2013-07-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "By far the best screenplay I have ever seen, and Jim Carrey does the performance of the year. It's the one film that you actually want Jim Carrey to go crazy. Laura Linney was surprisingly dazzling in her performance and the events happen inBy far the best screenplay I have ever seen, and Jim Carrey does the performance of the year. It's the one film that you actually want Jim Carrey to go crazy. Laura Linney was surprisingly dazzling in her performance and the events happen in the smartest way possible. This film is absolutely beautiful.",
      "review_date": "2013-01-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film, in my opinion, was nothing more than a steaming pile of garbage. Jim Carrey should have stuck to what he does best, and that is, of course, comedy. He simply doesn't work as a dramatic actor. The rest of the cast sucks, too. This film, in my opinion, was nothing more than a steaming pile of garbage. Jim Carrey should have stuck to what he does best, and that is, of course, comedy. He simply doesn't work as a dramatic actor. The rest of the cast sucks, too. The only thing that saves this from being a total disaster is Peter Weir's directing ability. But, even he was hampered by the terrible script.",
      "review_date": "2007-01-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An amazing film with and with a great ending, a rare thing.The writing is great and I never knew what was going to happen next and when it did, it was an awesome thing to see.Jim Carrey is most definitely a LEGEND!!!\n\nGood Morning, oh andAn amazing film with and with a great ending, a rare thing.The writing is great and I never knew what was going to happen next and when it did, it was an awesome thing to see.Jim Carrey is most definitely a LEGEND!!!Good Morning, oh and in case I don't see ya. Good Afternoon, Good Evening and Good Night. :D",
      "review_date": "2012-03-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I did not like the movie because there was not much action. I was kind of funny. It was boring and did not make much since. I got lost a few times in the movie and did not understand what was going on.",
      "review_date": "2009-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I didn't really care for the movie all that much. I got lost quite a few times during the movie. But they changed scenes a lot more than I had expected they would, which that's where I sort of got confused. And didn't I didn't really care for the movie all that much. I got lost quite a few times during the movie. But they changed scenes a lot more than I had expected they would, which that's where I sort of got confused. And didn't understand the point in the movie.",
      "review_date": "2009-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I didn't like the movie at all. It wasn't interresting at all. It wasn't really fun at all. All I liked a bout was the funny Jim Carrie. How he was in the film of filmen the videos.",
      "review_date": "2009-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm usually an action/sci-fi fan, and don't give much a care about movies outside of that genre, save for war dramas. However, this one proved to be quite an exception. I just get lost in this film, absorbed in it like nothing else.",
      "review_date": "2005-09-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An absolute bore, sure the performances were goodbut the movie just dragged on.",
      "review_date": "2006-02-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An excruciatingly empty film with the most annoying characters, script and pace, surely making this movie one of the worst I've ever endured. The more simplistic a movie gets, the greater it's general acclaim? Must be... Should be An excruciatingly empty film with the most annoying characters, script and pace, surely making this movie one of the worst I've ever endured. The more simplistic a movie gets, the greater it's general acclaim? Must be... Should be listed under 'Horror'.",
      "review_date": "2008-07-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quite brilliant quasi-satire that's well-directed and features a great Jim Carrey performance.",
      "review_date": "2020-02-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the rare occasions when Jim Carrey is actually good as an actor, and the supporting cast fit in their  roles really well too. The director and  writer made a movie that has the right amount of comedy, drama and social-criticism.One of the rare occasions when Jim Carrey is actually good as an actor, and the supporting cast fit in their  roles really well too. The director and  writer made a movie that has the right amount of comedy, drama and social-criticism. Recommended if You are interested in an entertaining and rather original movie.",
      "review_date": "2013-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The story is about a man whose life is a TV show, everyone knows that, except himself. Later he realizes it and struggles to end this show. The main topic is a problem of choice: to live your life as it is even if you are not satisfied withThe story is about a man whose life is a TV show, everyone knows that, except himself. Later he realizes it and struggles to end this show. The main topic is a problem of choice: to live your life as it is even if you are not satisfied with it or risk everything to change things around. Good and original plot and great actors. A must see.",
      "review_date": "2013-10-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I've always been a fan of Jim Carrey's movies since i can remember,\rand the Truman show is critically acclaimed which i should like automatically right, NOPE.\ri admire that the story is creative and coming from high imagination but theI've always been a fan of Jim Carrey's movies since i can remember,\rand the Truman show is critically acclaimed which i should like automatically right, NOPE.\ri admire that the story is creative and coming from high imagination but the problem with a high imagined movie is the end,\rbecause with your imagination you can create a perfect movie world with perfect events,\rbut the hardest thing to do is to close this world with an eventful plot, unfortunately the end in this movie was so bad,\rthat it actually pissed me off, Truman was born and raised in this fake world, so he have no idea about the actual real world,\rso you'd think he's very excited and anticipated to get out but a huge character development was missing from the plot and ending the movie like this with a fake smile \"good morning, good evening and goodnight\"\rwas the worst ending to a movie i have ever seen.\rthe end actually left me speechless for about 9 minutes.",
      "review_date": "2013-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fresh comedy-drama about the dark side of massive media, closer to Big Brother. Highlights an inspirational but controlled Jim Carrey and Ed Harris as the machiavellian, cynical producer. Shall not miss it.",
      "review_date": "2017-09-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A really good movie with really nice humor and an interesting plot and story about a man who don't know his entire life is a lie and I was REALLY SATISFIED at the ending when he finds the truth",
      "review_date": "2018-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a film that is uncomfortable and difficult to digest because it weaves hard social criticism. Life in that seaside city represents the reality that we want to show to others, as if we live by appearances (we actually live). It is anThis is a film that is uncomfortable and difficult to digest because it weaves hard social criticism. Life in that seaside city represents the reality that we want to show to others, as if we live by appearances (we actually live). It is an ideal city, perfect, calm, without trash, without crime, without poverty, where all are good friends but there is no relation of closeness or friendship, or anger or rancor... no trace of humanity, in the good or the Bad sense of the term. And Truman Burbank is the symbol of an artificial human being in an artificial world. It is this artificiality latent in everything that bothers, always bothered the character who, after all, is unaware of being part of a millionaire reality show, which transmitted to the world every moment of his life. And here lies another important provocation essential to understanding the film: a critique of the kind of TV shows we watch, programs that exploit and make millions at the expense of people's weaknesses and pains. The film also makes some surreptitious and highly philosophical considerations, equating the nature of God, the size of the Universe, the reason for Man's existence. The film develops well, around Truman's quest for truth behind the apparent lie where he lives.Jim Carrey is the big name of this movie. He does an excellent job and proves to us that he can also be serious and dramatic. However, he may have disappointed some audiences who went to see this movie expecting another comedy. He shone in this dramatic role, is almost always present and succeeds, even in the serious context of the film, to look nice and play without getting to the point of idiocy. Ed Harris also shone in the role of the director of the television program, always trying to keep his star. It's a side supporting role, but Harris knew how to ennoble your character with a job well done.This is a complex and provocative film, but it hides behind a relatively simple story and great humility. It is not an elaborate production, it does not seem to me to have been expensive nor does it have huge special or visual effects. Everything is done with discretion but efficiency. However, it is not a movie for anyone. It's funny without being funny because it's not the humor that makes the movie work. It leaves a lot open, leaves many questions and reflections in our head. For some, it will be a boring movie.",
      "review_date": "2018-04-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Brilliant story. Excellent acting by Jim Carrey. A must-see movie. Unforgettable.",
      "review_date": "2018-12-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I can't understand why so many bad reviews about this great film, The Truman Show is one of my favorite ever movies, with a original story and acting, is one of the best movies Jim Carrey's ever made.",
      "review_date": "2019-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "No seré muy objetivo ya que es mi película favorita.Historia redonda, no se hace pesada ni larga. Una actuación fantástica de Jim Carrey, posiblemente junto al \"Numero 23\", \"The Cable Guy\" y \"Olvídate de mí\" la mejor de las 4.No voy aNo seré muy objetivo ya que es mi película favorita.Historia redonda, no se hace pesada ni larga. Una actuación fantástica de Jim Carrey, posiblemente junto al \"Numero 23\", \"The Cable Guy\" y \"Olvídate de mí\" la mejor de las 4.No voy a destripar nada de la trama ni de la historia, pero decir que es muy original y única. Un best seller que nadie puede perderse. Se merece el 10 sobre 10. Mi primera crítica u/o review de la sección de Movies.",
      "review_date": "2019-01-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie is the best movie i ever saw in my life. I love the idea and the script. The cast fits perfect into the movie.",
      "review_date": "2019-07-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It’s Beautifully Done, the best movie of jim carrey and the beat movie i’ve ever watched",
      "review_date": "2020-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe movie is great don’t get me wrong but the ending was the worst thing to have ever existed are you f*cking kidding me it was bullsh*t, most unfulfilling ending ever, WHERE IS THE SPICE OMG, I’m so upset this was ridiculous, if I could give it -10 I WOULD.",
      "review_date": "2020-06-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the most fun and original movies ever. Both Carrey and Linney are great.",
      "review_date": "2021-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Jim Carey's is an all around actor. Awesome movie.",
      "review_date": "2006-08-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie. In my opinion, Jim Carrey's best performance and one of the most underrated films of all time. Very emotional ending, which gets me just about every time I watch it.",
      "review_date": "2007-03-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fabulous movie.",
      "review_date": "2008-07-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An almost perfect movie. The ending is one of the best I've ever seen. Definately a must-see.",
      "review_date": "2008-08-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A masterpiece. In the beginning you feel lulled into a false sense of security about the crafted world Truman is placed in. From a wonderful start to a very emotional ending, the Truman Show is by far one of my favorite movies ever. The last A masterpiece. In the beginning you feel lulled into a false sense of security about the crafted world Truman is placed in. From a wonderful start to a very emotional ending, the Truman Show is by far one of my favorite movies ever. The last few reviews seem to be posted by the same 12 year old, though. Don't take them seriously. This is a brilliant and original film.",
      "review_date": "2009-10-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best movies I've ever seen. Jim Carrey actually plays a character instead of just Jim Carrey. It's clever and even though it's old, it's awesome.",
      "review_date": "2009-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I knew Carrey was talented and this movie was the real demonstration of his skills. The plot is amazingly well-constructed and the details and themes (medias, allegory of the cave, existentialism, ...) are brilliantly used and true (for the I knew Carrey was talented and this movie was the real demonstration of his skills. The plot is amazingly well-constructed and the details and themes (medias, allegory of the cave, existentialism, ...) are brilliantly used and true (for the world we live in)! And maybe this shocked and irritated some of the people who gave negative reviews. But hey... Wake up, welcomle to our word!",
      "review_date": "2009-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I liked the movie! It kept you guessing, it was funny and also serious. The sad part is when he relizes it is all fake. It was funny when the boat crashes throughthe sky/wall. His last words were \"Good morning,Good evening and Goodnight\". I liked the movie! It kept you guessing, it was funny and also serious. The sad part is when he relizes it is all fake. It was funny when the boat crashes throughthe sky/wall. His last words were \"Good morning,Good evening and Goodnight\". The lines were done well. The characters did excellent. This movie was really good.",
      "review_date": "2009-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I liked to movie, but it had some weird parts. I liked what the movie was about. I didn't like the picture color of the movie. I didn't like how they were being mean to Truman. It was weird how they trapped him in his own world. I liked to movie, but it had some weird parts. I liked what the movie was about. I didn't like the picture color of the movie. I didn't like how they were being mean to Truman. It was weird how they trapped him in his own world. Also, I didn't like how his wife is mean and a freak.",
      "review_date": "2009-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I fell in love with this movie at a very young age. It is a movie that is impossible to turn away from. The ending is one of the greatest scenes in film history.",
      "review_date": "2005-09-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I will never understand critics. Bruce almighty was 10 times funnier than this movie and it got really bad reviews. but then this movie get good reviews from nearly every critic. It wasn't even that good. It was ok, but it wasn't I will never understand critics. Bruce almighty was 10 times funnier than this movie and it got really bad reviews. but then this movie get good reviews from nearly every critic. It wasn't even that good. It was ok, but it wasn't funny enough to be a comedy or dramatic enough to be a drama. it got boring.",
      "review_date": "2009-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The problem, it seems, is that the only low scores come from people that have failed to grasp the plot and / or only enjoy watching things blow up. If you're too simple to understand the film then feel free to pass through without rating.",
      "review_date": "2009-07-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies of all time. The Truman Show is so gripping, yet ominously false at the same time, the line of distinction becomes marred into a glorious film.",
      "review_date": "2005-11-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My favorite movie ever. This movie does a perfect job showing the media's exploitation of personal rights. The movie empathizes with the viewer and the viewer empathizes with the movie. Truman is the sad sole, who deserves a life, but My favorite movie ever. This movie does a perfect job showing the media's exploitation of personal rights. The movie empathizes with the viewer and the viewer empathizes with the movie. Truman is the sad sole, who deserves a life, but is not given a true one. Its beautifully made with an ending that is so emotionally perfect, that you feel you are part of this fake world.",
      "review_date": "2008-01-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sentimental but still quite resonant.",
      "review_date": "2008-07-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "All you kids that get lost and confused in the movie should go back to school. The movie was excellent, and the cinematography and script is outstanding. And to all you people that got bored of it because there was no action, IT'S All you kids that get lost and confused in the movie should go back to school. The movie was excellent, and the cinematography and script is outstanding. And to all you people that got bored of it because there was no action, IT'S BECUASE IT ISN'T AN ACTION MOVIE! Gtfo the internet and go back to your hole you trolls.",
      "review_date": "2009-10-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A masterpiece in every sense of the word. A metaphor of the struggle to break free from the expections of others and to live an authentic life. Bravo, Mr. Weir.",
      "review_date": "2007-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If only every movie could be this brilliant. It transcends entertainment and becomes poetry. The scene where his boat punches a hole in the sky has to be the most powerful image I have ever seen.",
      "review_date": "2008-11-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Outstanding movie! One of the greatest actors of all time Jim Carey will totally thrill you in this superb comedy thriller! Such a great story... MUST WATCH!",
      "review_date": "2015-06-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I know that people say that this movie is one of the best movies ever made. I'm not trying to rant on this movie or anything, but in my opinion, it's not really the best movie ever made. It's a great one don't get me wrong, but it's not theI know that people say that this movie is one of the best movies ever made. I'm not trying to rant on this movie or anything, but in my opinion, it's not really the best movie ever made. It's a great one don't get me wrong, but it's not the best movie in the world. The storyline is very original indeed. The characters seem to really work together and Jim Carrey nails it as Truman Burbank. Sometimes it has its slow parts, but no matter what it's still very interesting to watch. The combination of the comedy and drama worked really well. Not only that, but I actually liked the score in this movie. I thought the music was original and well thought out. Overall, it may not be the best movie in the world, but it's sure a great masterpiece.",
      "review_date": "2013-06-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies of all time! Love it, can watch it over and over again.",
      "review_date": "2013-06-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Фильм категории \"Must See\" , являющийся выдающимся лишь по причине оригинальной идеи. Ничего в фильме гениального нет, но это не мешает ему быть просто отличным.A \"Must See\" film that is outstanding only because of the original idea. No, itФильм категории \"Must See\" , являющийся выдающимся лишь по причине оригинальной идеи. Ничего в фильме гениального нет, но это не мешает ему быть просто отличным.A \"Must See\" film that is outstanding only because of the original idea. No, it does not prevent him from being just great.",
      "review_date": "2019-06-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The story was original, well crafted and interesting. It was funny, well acted and also pretty entertaining.The Truman Show is not your average comedy, but it's still totally worth the watch.",
      "review_date": "2017-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A smart, sweet and vivacious masterpiece. Peter Weir and his great work in this film is simply moving. The acting of Jim Carrey is, probably, his best work in all his career. The amazing, funny and inventive screenplay written by AndrewA smart, sweet and vivacious masterpiece. Peter Weir and his great work in this film is simply moving. The acting of Jim Carrey is, probably, his best work in all his career. The amazing, funny and inventive screenplay written by Andrew Niccol. All they make this film live and surprise us, and somehow, made ??him a wonderful film about life, love and the exploitation of television today, an intense drama about the world we are living. The modern life we are living. The life we are living: this is the phrasal who identifies this great movie. The Truman Show is The Life Show!",
      "review_date": "2014-07-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Truman Show is amazing. If I could give it a 9.5 rating, I would. This movie is one of the best movies ever made and one of the best of Jim Carrey's. It had amazing acting, a great story that was original and amazing music (Especially theThe Truman Show is amazing. If I could give it a 9.5 rating, I would. This movie is one of the best movies ever made and one of the best of Jim Carrey's. It had amazing acting, a great story that was original and amazing music (Especially the ending song).\r The Truman Show is also really funny while really emotional, it is really sad at moments which is a good thing since that is what this movie was trying to do and they did it incredibly well. Truman is a very likeable character that has the appropriate reaction to finding out that his whole life is fake, which makes him relatable.\r While The Truman Show is one of the best movies, it could have used more scenes where Jim Carrey expressed his feelings more and it felt a bit slow but even with those flaws, The Truman Show is a must-watch for everyone",
      "review_date": "2014-11-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Why would anyone who likes to think and actually paid attention to what he watched would dislike this movie? There are occasion when you say people have different tastes and its ok but sometimes I think having that different taste is notWhy would anyone who likes to think and actually paid attention to what he watched would dislike this movie? There are occasion when you say people have different tastes and its ok but sometimes I think having that different taste is not quite justifiable.",
      "review_date": "2015-08-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A really fun and entreaging movie that has a lot to say. Its one of Jim Carreys best roles but seems a bit overrated, like i said it is a good movie and has a great premise i personally wanted a bit more at the end but it was funny and heartA really fun and entreaging movie that has a lot to say. Its one of Jim Carreys best roles but seems a bit overrated, like i said it is a good movie and has a great premise i personally wanted a bit more at the end but it was funny and heart felt and worth a second viewing",
      "review_date": "2016-01-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mega original, divertida y emotiva. Y que sea interpretada por Jim Carrey es un plus",
      "review_date": "2018-02-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Truman Show is one of the best films of Jim Carrey's career. One of the best movie dramas of the 90s. Despite the fact that most of the film is served as a comedy drama, the film is revealed only when Trueman begins to behave aggressivelyThe Truman Show is one of the best films of Jim Carrey's career. One of the best movie dramas of the 90s. Despite the fact that most of the film is served as a comedy drama, the film is revealed only when Trueman begins to behave aggressively and the entire staged world falls apart. The script of the film ignores many details that even the most unbiased viewer pays attention to. But this is not done, the message of The Truman Show in another. There is a vivid reflection of modern society in this hypertrophied toy world. The work of Christophe's team reflects the state. The ending of the film leads to the expected climax of Trueman's growing up and sobering up. The Truman Show is a film that deceives the viewer. It can be watched by both a child and an adult viewer and everyone will find something of their own in it. Great movie.",
      "review_date": "2022-10-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Хороший фильм, с интересной сюжетной завязкой! Не думал я, что под конец 90х - люди могут снять фильм с таким сюжетом!",
      "review_date": "2021-12-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of my all-time favorite movies of all time. Jim Carey is amazing in this movie, and just kills it every minute he's on screen. The plot of this movie is extremely original and interesting, in-between The Twilight Zone and anThis is one of my all-time favorite movies of all time. Jim Carey is amazing in this movie, and just kills it every minute he's on screen. The plot of this movie is extremely original and interesting, in-between The Twilight Zone and an American sit-com. There are many little interesting details in the created-fake world that you won't notice the first time you watch the movie. The second time you watch the movie, you will start to see these humorous little details and the movie will be even better. The ending is great. No other movie is like The Truman Show, and that makes it even better.",
      "review_date": "2017-12-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best. So many layers & narratives - satire, comedy and a great performance from Jim Carrey",
      "review_date": "2020-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What might be one of the best films ever made, The Truman Show gives a strange, yet ahead-of-its-time look at the reality tv boom that would explode in the 2000's.",
      "review_date": "2018-07-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Jim Carrey's best performance with tons of creativity and humanism. Exactly what all the drama movies try to be.",
      "review_date": "2019-04-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies. Crazy to say considering it come out 22 years ago and just now watching it for the first time at age 27. It aged well.",
      "review_date": "2020-07-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Buena película con unas ideas muy interesantes, aunque el final queda medio inconcluso.",
      "review_date": "2019-08-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An amazing movie starring Jim Carrey with an idea that is unique and interesting. The psychological comedy-drama is a movie I highly recommend watching and the plot is amazing. Truely one of the best movies of the 90s.",
      "review_date": "2021-06-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "É um bom filme.Temos uma premissa interessante, que claramente não envelheceu e pode ser usada como uma critica nos dias de hoje; uma performance do Jim Carrey interpretando a sim mesmo - que é muito agradável para quem curte o ator, comoÉ um bom filme.Temos uma premissa interessante, que claramente não envelheceu e pode ser usada como uma critica nos dias de hoje; uma performance do Jim Carrey interpretando a sim mesmo - que é muito agradável para quem curte o ator, como eu; criticas subjetivas que enriquecem a experiencia para quem se adentrou a trama e uma boa pitada de humor, que não funciona em diversos momentos, mas também rende umas cenas engraçadíssimas. Acredito que o filme demora um pouco para \"decolar\", mas  a partir da metade se passa muito rápido. Creio que ele tenha acabado no momento correto, e cabe a nós imaginar o que havia por vir. O diretor escolheu uma abordagem mais caricata, visto que algo \"pé no chão\" mudaria muito a atmosfera do filme e como os personagens reagiriam ao longo dele. Visto que a obra não se leva a serio, nossa tolerância aumenta e a realidade ali posposta tende a ser menos depressiva e pessimista.The Truman Show é engraçado, traz umas reflexões interessantes sobre o tema e tem um final assertivo com um clímax bem definido.",
      "review_date": "2020-05-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of my all-time favorite Jerry Seinfeld performances. He really killed it with this film, though I find the idea of bees suing the human race to be a little far-fetched.",
      "review_date": "2019-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I honestly enjoyed this movie quite a bit, the plot was brilliant and the cast do a really good job for what they're given especially Jim Carrey. Jim Carrey gives an outstanding performance during this movie and it adds that little bit moreI honestly enjoyed this movie quite a bit, the plot was brilliant and the cast do a really good job for what they're given especially Jim Carrey. Jim Carrey gives an outstanding performance during this movie and it adds that little bit more comedy to the movie, which makes it amazing. Overall, this movie never feels like it drags for a second and it's quite a clever movie from the start but it's honestly worth the watch.",
      "review_date": "2020-05-22",
      "source": "metacritic"
    }
  ],
  "num_reviews": 125
}