{
  "title": "The Big Lebowski",
  "rating": 8.6,
  "release_date": "1998-03-06",
  "summary": "'The Dude', Jeff Lebowski is unemployed and as laid-back as they come. That is until he becomes a victim of mistaken identity, and two thugs break into his apartment with the errant belief that they're strong-arming Jeff Lebowski - the Pasadena millionaire. In the hope of getting a replacement for his soiled carpet, 'the Dude' pays a visit'The Dude', Jeff Lebowski is unemployed and as laid-back as they come. That is until he becomes a victim of mistaken identity, and two thugs break into his apartment with the errant belief that they're strong-arming Jeff Lebowski - the Pasadena millionaire. In the hope of getting a replacement for his soiled carpet, 'the Dude' pays a visit to his wealthy namesake...… Expand",
  "critic_reviews": [
    "For those who delight in the Coens' divinely abstract take on reality, this is pure nirvana (cross Blood Simple with Raising Arizona if you must), yet beyond the hysterical black comedy, scattered violence and groovy dialogue, there sounds the same song to human goodness which enriched Fargo.",
    "A deliriously fractured film, ambitiously packed with bowling, bimbos and other great inspirations of latter-day thought. Closest in style and temperament to Raising Arizona, this Gramercy release should roll box office strikes with select-siters and score some winning spares with mainstream viewers.",
    "Immensely inventive and entertaining, the film may not have the enigmatic elegance or emotional resonance of Barton Fink or Fargo, but it's still a prime example of the Coens' effortless brand of stylistic and storytelling brilliance.",
    "Apart from psychedelic dream sequences with a bowling twist, it's the wealth of great characters and their insane dialogue that make this a memorable film.",
    "Magnificent. A multiplex-friendly critics' movie in the stripped-down Blood Simple/Fargo style, but with a more restrained hint of Raising Arizona slapstick. A crime-sex-drugs-kidnap-bowling-nihilism mystery of the highest order.",
    "It's paved with delightfully irregular and unanticipated bits of business that stimulate the viewer to stay fully alert, while renewing our faith in the sheer joy of watching movies.",
    "It put a smile on my face that never left for 117 minutes.",
    "It’s a great performance from Bridges, and he seems weirdly young in this film, certainly compared to the brilliant craggy oldsters that later became his acting birthright. You can still see the boyish, vulnerable figure that he was in Peter Bogdanovich’s The Last Picture Show. One of a kind. [20th Anniversary]",
    "With their inspired, absurdist taste for weird, peculiar Americana-but a sort of neo-Americana that is entirely invented-the Coens have defined and mastered their own bizarre subgenre.",
    "There are few films that genuinely get better with each successive viewing. The Big Lebowski is one of them. This is owed not only to its near-infinite quotability, which itself grows with time, given how much of the film’s humor is self-referential, but also because its tangled plot requires a substantial amount of unraveling before it can be fully understood and appreciated.",
    "The movie is as visually inventive and wildly eccentric as the Coens' earlier movies, but it lacks the emotional maturity and moral clarity of 1996's \"Fargo.\"",
    "So even when they don’t achieve the glorious farce of a Fargo, there is always something fascinating about following the Coens’ rapt gaze as they peer into the American nut bowl.",
    "The Big Lebowski is the best movie ever set mostly in a bowling alley.",
    "It's a pinball arcade of a flick -- the Coens invent a bunch of wonderfully flaky characters, stick them into a Plexiglas narrative, and let them bounce off each other.",
    "Watching it amble along is enough of a treat, since the Coens populate this story with oddballs and bowling balls of such comic variety.",
    "Brilliantly scripted and full of a virtual Who's Who of familiar faces, The Big Lebowski is yet another golden hunk of totally unique celluloid from the versatile Brothers Cohen.",
    "Some may complain The Big Lebowski rushes in all directions and never ends up anywhere. That isn't the film's flaw, but its style.",
    "Viewers with a taste for bizarre, even surreal, humor will have a ball.",
    "This is a comic amusement park ride – a wildly uneven movie that offers tremendous pleasure for the moment, even if it doesn't stand up well to post-screening analysis and scrutiny.",
    "It's neither the clean strike Coen-heads expected after Fargo nor the gutter ball anticipated by Coen-phobes like myself.",
    "The Big Lebowski is packed with show-offy filmmaking and as a result is pretty entertaining.",
    "Spiked with wonderfully funny sequences and some brilliantly original notions, The Big Lebowski, a pseudo-mystery thriller with a keen eye and ear for societal mores and modern figures of speech, nonetheless adds up to considerably less than the sum of its often scintillating parts.",
    "Nearly everything in The Big Lebowski is a put-on, but all that leaves you with is the Coens' bizarrely over-deliberate, almost Teutonic form of rib nudging.",
    "Because it's by the Coens, The Big Lebowski is studded with visual and verbal jokes and flourishes, but ultimately they amount to pearls without a string. The Coens have thrown their considerable talents into making the world's smartest dumb movie, a dubious distinction that for their admirers will have to suffice, at least for now.",
    "The great flaw in most of the Coens' work is, surprisingly, an inability to sustain a plot over a two-hour span.",
    "This film feels completely haphazard, thrown together without much concern for organizing intelligence.",
    "Frothing from two mouths, they parody film noir, megaviolent thrillers, sports allegories, ravaged-war-veteran movies, existentialist Westerns, even Busby Berkeley musicals.",
    "An off-kilter thriller with a sad-sack hero.",
    "Although some of its parts are brilliantly executed and played by a terrific cast, the result is scattered, overamplified and unsatisfying.",
    "It is a visual tour de force, but as a whole the movie slowly deflates into a cross between \"Arizona\" and \"The Hudsucker Proxy\".",
    "The clever dialogue, seductive camera work, and beautiful production design (the lavish dream sequences look like Busby Berkeley on Ecstasy) almost make you forget the vacancy at the movie's core, but in the end there's no escaping the feeling that the Coens are speaking a secret language.",
    "I laughed out loud a few times during The Big Lebowski, and Jeff Bridges, as always, is very good, but after I write this review, I'll probably never think about the movie again. And I spend way too much time thinking about movies.",
    "If it's all supposed to be in fun, why does it feel so much like an insult?"
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Simply put this is a comedic masterpiece. It is one of the Coen Bros. best films and features some superb writing and comedy. This is my all-time favorite comedy and is either #1 or #2 for best movie period.",
      "review_date": "2012-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Man, this is totally like an awesome experience you know? I mean, hilarious characters and actions, yet with awkward reasons. The story is like; you know,  confusing and disjointed. Yet it it, ravels me with performance, so I don't reallyMan, this is totally like an awesome experience you know? I mean, hilarious characters and actions, yet with awkward reasons. The story is like; you know,  confusing and disjointed. Yet it it, ravels me with performance, so I don't really understand the story, but that's the point man. Our protagonist is the dude (Jeff Bridges) who is minding his own business, but is wrapped into this complex; and might I add pointless, hostage plot, and has to figure out how to get his rug back. What's totally sweet about this picture is Jeff Bridges as the dude, he like is so mystical like in the role as the dude. He is such a likeable person; an enjoyable loser maybe, and is accompanied by his best man Walter (John Goodman). Who is also cool. With a over the top attitude, and can't help but try to relate every event to Vietnam. While the dude's performance is sweet, the story and pacing is not as sweet. While one may feel great for being able to follow what is going on; I sure did man, but like this does get a bit muttled and mind mumbling. That aside, this is totally worth a watching; you'd be really uplifted if you saw it multiple times, and is a art house masterpiece man.",
      "review_date": "2013-06-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my all time favorites. Pure comedy genuis. It's original, uniqu and hilarious. It deserves it's cult following and fan base. And if you don't like it, Well that's just like your opinion man.",
      "review_date": "2014-04-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Big Lebowski is the gold standard for cult movies, and is an incredibly inspiring film. The stoner humor is great and remarkably high brow. The performances are great, and the script is constantly quotable. This is a lot of people'sThe Big Lebowski is the gold standard for cult movies, and is an incredibly inspiring film. The stoner humor is great and remarkably high brow. The performances are great, and the script is constantly quotable. This is a lot of people's favorite movie, and it's one of mine too! Very inventive and a lot of fun!",
      "review_date": "2018-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Cohen brothers hooked me with No Country For Old Men and Fargo, so going into this film I was expecting to like this. It's save to say that I love The Big Lebowski. It's really the absurdity that makes this movie great. The eccentricThe Cohen brothers hooked me with No Country For Old Men and Fargo, so going into this film I was expecting to like this. It's save to say that I love The Big Lebowski. It's really the absurdity that makes this movie great. The eccentric characters work so well and John Goodman is hilarious in this. Some of the structure seemed muffled and there was some exposition but other than that, this is an awesome movie that's driven by its own self aware insanity.80/100",
      "review_date": "2019-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't know if 98% of the humour went over my head, but I don't think this is a \"timeless masterpiece\". It's a story about a guy who just wants to get a new carpet and who hangs out with his friends who couldn't be more socially deviant.I don't know if 98% of the humour went over my head, but I don't think this is a \"timeless masterpiece\". It's a story about a guy who just wants to get a new carpet and who hangs out with his friends who couldn't be more socially deviant. Still a very enjoyable movie.",
      "review_date": "2021-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Big Lebowski is honestly a masterpiece and a half, it has to be one of the most funniest comedy movie's I've ever watched and I've watched a lot of comedy movies.The plot is really good, it's about these two rough guys who accidentallyThe Big Lebowski is honestly a masterpiece and a half, it has to be one of the most funniest comedy movie's I've ever watched and I've watched a lot of comedy movies.The plot is really good, it's about these two rough guys who accidentally mistake The Dude (Jeff Bridges) for the millionaire Lebowski. So, they end up pissing on his rug.So, he tries to recompense the rug which he's got from the billionaire Lebowski and he later gets involved in this big kidnapping case.Also, all of the cast throughout this movie are honestly brilliant, either that being with their dialogue or just anywhere throughout this movie.The cinematography from Roger Deakins is honestly beautiful and it's really shown that, he's beautifully shot this movie as a whole.The fight scenes are honestly pretty funny especially the one with Walter (John Goodman) near the end of the movie, that's honestly amazing.Finally, the scenes which The Dude and Walter have together throughout this masterpiece and half are honestly amazing and hilarious.The movie's even got a great soundtrack, which is honestly another positive for this movie in my opinion.Overall, this movie is honestly a masterpiece and a half, it's got a really good plot, a brilliant cast, brilliant dialogue, beautiful cinematography, some pretty funny fight scenes, there's some great moments which The Dude and Walter have throughout, loads of hilarious moments and a great soundtrack. It's honestly worth the watch, I'd honestly recommend this movie to anyone who's wanting to watch a brilliant comedy movie with a great plot.",
      "review_date": "2020-08-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Big Lebowski isn't just a movie, it's a way of life.",
      "review_date": "2008-06-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "the one thing you can almost always say about the coen brothers is they are inovative with there films . this is a very funny film with a entertaining plot . great acting especially by goodman and bridges . its a great film that if you wanathe one thing you can almost always say about the coen brothers is they are inovative with there films . this is a very funny film with a entertaining plot . great acting especially by goodman and bridges . its a great film that if you wana see some thing funny and differnt then you should deffinitly check this out.",
      "review_date": "2010-09-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Some of the most surreal sequences I have ever seen, this has to be the slacker equivalent to Pulp Fiction. Like it or not, we all know the Dude, and there is a little of the Dude in a lot of us.",
      "review_date": "2008-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My favorite comedy film of all time (Hot Fuzz is A VERY CLOSE 2nd), it is just genius and very subtle. The story is highly underrated, Walter Sobchak really makes this movie better, and The Dude being the main character is a genius choiceMy favorite comedy film of all time (Hot Fuzz is A VERY CLOSE 2nd), it is just genius and very subtle. The story is highly underrated, Walter Sobchak really makes this movie better, and The Dude being the main character is a genius choice (especially considering The Dude would seem like he would be a comic relief character in 95% of other movies if he were to be a character). This is a movie you should just see at least once just to get why this movie is a big deal. I am not one of the biggest fans of it (there's a religion based around this movie), but you should still see it because of how it shows a representation of the period (the 1990's) and I could go on more, but just see this important film.",
      "review_date": "2012-12-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolute genius. One of my favorite movies ever made (along with The Royal Tenenbaums). Hilarious, visually wonderful, with a dozen lines that should be bronzed and framed in the screenwriters' hall of fame (\"Say what you want about the Absolute genius. One of my favorite movies ever made (along with The Royal Tenenbaums). Hilarious, visually wonderful, with a dozen lines that should be bronzed and framed in the screenwriters' hall of fame (\"Say what you want about the tenets of National Socialism, at least it's an ethos\").",
      "review_date": "2006-07-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I've heard good comments about this movie for years, but finally got around to seeing a copy. Hilarious! The basic story is unoriginal, but the dialogue is funny and imaginative. I highly recommend this if you're looking for I've heard good comments about this movie for years, but finally got around to seeing a copy. Hilarious! The basic story is unoriginal, but the dialogue is funny and imaginative. I highly recommend this if you're looking for something a bit quirky and off-beat.",
      "review_date": "2007-11-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is spectacular....I must admit that the first time I saw it I thought it was \"OK\" but I've seen it many times since and it gets better as I listen to the dialog more carefully. John Goodman is like a cranky Grizzly bear and This movie is spectacular....I must admit that the first time I saw it I thought it was \"OK\" but I've seen it many times since and it gets better as I listen to the dialog more carefully. John Goodman is like a cranky Grizzly bear and steals many scenes with his angry outbursts and irrelevant rationale. The \"real\" Lebowski is like Dick Cheney poured into a wheelchair with a porn star wife......Phillip Semour Hoffman is a brilliant brown noser and the Dude really ties the movie together with turns of defeated slacker logic and certain charming familiarity that makes him an ironic and lovable hero.",
      "review_date": "2009-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Big Lebowski finds that middle ground between the most realistic depiction of life and the strangest dreams that sometimes we all have. There is plenty of material here that the critics should of loved  but as it is,maybe its better thatThe Big Lebowski finds that middle ground between the most realistic depiction of life and the strangest dreams that sometimes we all have. There is plenty of material here that the critics should of loved  but as it is,maybe its better that not everyone understands. Let this movie be a cult classic, for that is exactly what it deserves.",
      "review_date": "2010-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Quite possibly the funniest, and greatest movie of all time.",
      "review_date": "2006-05-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Smart, funny, ironical, delirious, surreal, sarcastic... and with a very nice soundtrack.To me, one of the best movies in the history of cinema! This dvd really ties my collection together ;)",
      "review_date": "2010-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I had never seen this movie until yesterday, and totally enjoyed it.  Pure, intelligent, exciting entertainment.  It's very well written, with a tight plot that will keep you engaged from the get go.  Jeff Bridges, John Goodman, JulianneI had never seen this movie until yesterday, and totally enjoyed it.  Pure, intelligent, exciting entertainment.  It's very well written, with a tight plot that will keep you engaged from the get go.  Jeff Bridges, John Goodman, Julianne Moore and all others in the cast create such wondreful characters.  Especially \"The Dude\"  You just love The Dude, man.  John Goodman's character his hilarious, and he's calmer than you are.  I see why this film is such the cult classic that it is.  Be sure and check it out if you havent.",
      "review_date": "2012-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"The Big Lebowski is strange, off-putting, and unrefined. . .but that is exactly why it's the perfect comedy. It tickles you in nearly every spot you can be tickled in and it never, ever, ever stops.",
      "review_date": "2012-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "entertaining film the whole way threw, 10 years ago funny but still a good watch. acting was good, story was decent. not a movie you take seriously at any point.",
      "review_date": "2011-04-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "First and foremost I am a Coen brothers fan, HOWEVER I hate FARGO and BURN AFTER READING and a few more.  When I first  watched LEBOWSKI I was not a huge fan. For some reason (I am most certainly NOT a prude) I didn't like the use of the wordFirst and foremost I am a Coen brothers fan, HOWEVER I hate FARGO and BURN AFTER READING and a few more.  When I first  watched LEBOWSKI I was not a huge fan. For some reason (I am most certainly NOT a prude) I didn't like the use of the word f**k throughout the film. After the fourth or fifth time I watched it (it was on commercial TV) the bleeped every F**K. Oh my God that totally wrecked the humor and continuity of the film. This film has great actors ( Steve Buscemi is a Coen brothers fav and mine too). The plot is funny, and most of all the cinematography is the best ( only second to Hudsucker Proxy).After the fifth time this became one of my top 5 Coen brothers films. THE DUDE ABIDES!!!",
      "review_date": "2010-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A film that should be mandatory for anyone who calls themselves a fan of the cinema. The Coens are at their goofy best here, twisting and turning through multiple plot changes, genres, styles, and berserk characters. \"The Big Lebowski\"A film that should be mandatory for anyone who calls themselves a fan of the cinema. The Coens are at their goofy best here, twisting and turning through multiple plot changes, genres, styles, and berserk characters. \"The Big Lebowski\" somehow involves us by showing inner America (though it's set in California) at its weirdest and most truthful. It's gloriously goofy and unabashedly silly, one of the best films this duo has made.",
      "review_date": "2010-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Personally this movie was fantastic and I loved every minute of it cause I mean why wouldnt any person like a movie with Jeff Bridges and Bowling! Haha",
      "review_date": "2012-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie ever! It's one of those movies where you have to be smart to understand the comedy and if your smart, you'll love it.",
      "review_date": "2006-06-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie got some bad reviews because it takes a few watches and some real thought to get its fantastic humor. It's a highbrow comedy in a lowball costume, and many critics didn't understand that when it was released. Ultimately This movie got some bad reviews because it takes a few watches and some real thought to get its fantastic humor. It's a highbrow comedy in a lowball costume, and many critics didn't understand that when it was released. Ultimately it is deep with rich themes and a great cast, and nearly every line in the movie has become legendary. There's a strong case to be made that this is the funniest movie of all time, and one of the best movies overall; it's a shame it suffered critical distaste due to its complex nature and, of course, that it was the Coen bros. follow up to Fargo.",
      "review_date": "2006-07-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie proves that critics don't have a clue. I absolutely loved this movie. I will be buying this one for my collection. Listen to the user reviews, not the critics.",
      "review_date": "2007-12-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Some funny stuff scattered about but overall I thought it was pretty flat, misfiring more than it hit. Occasionally clever and inspired moments were often undone by heavy-handedness and a tendency to overindulge in them. I kept feeling a Some funny stuff scattered about but overall I thought it was pretty flat, misfiring more than it hit. Occasionally clever and inspired moments were often undone by heavy-handedness and a tendency to overindulge in them. I kept feeling a real good movie could've broken out with a little more subtlety and nuance.",
      "review_date": "2008-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is my honest opinion that this movie is the best cult film ever made. You can watch it over and over again and it never loses appeal. Immensely qouteable, fantastically funny, and full of great dialogue - this is the ultimate shaggy dog It is my honest opinion that this movie is the best cult film ever made. You can watch it over and over again and it never loses appeal. Immensely qouteable, fantastically funny, and full of great dialogue - this is the ultimate shaggy dog story. 'The dude abides...'.",
      "review_date": "2008-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Many people get frustrated with this film with the fact that the story does not make sense or goes anywhere. To me, this is part of the reason why this is one of the best movies ever to be executed. It's more about the amazing Many people get frustrated with this film with the fact that the story does not make sense or goes anywhere. To me, this is part of the reason why this is one of the best movies ever to be executed. It's more about the amazing characters created along with the perfectly crafted jokes and timing of them. This movie also has some great visual work. It is an original work of art. Perfectly cast, directed, and edited.",
      "review_date": "2010-02-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An ingenious parody of Chandler-esque P.I. thrillers, and one of the most important comedies of the twentieth century.",
      "review_date": "2005-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its the best fricken movie!!!!!!!",
      "review_date": "2005-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My favorite movie -- hysterically funny. After a hundred viewings it's still hysterical...it takes a special soul to know that this one is a gem!",
      "review_date": "2006-02-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simply the funniest movie I have ever seen. I have seriously watched this move over 100 times, and I still find new things to laugh at, as well as the classic lines. Almost every scene in this movie is quotable, and it is very satisfying to Simply the funniest movie I have ever seen. I have seriously watched this move over 100 times, and I still find new things to laugh at, as well as the classic lines. Almost every scene in this movie is quotable, and it is very satisfying to run into someone who knows the movie as well as you do. If you're scared off because of any of the Coen Bros. earlier work, like Fargo (which is an excellent movie, but nothing like this one), go rent it and be prepared for a hilarious tale. Like a fine wine, this movie gets better with time.",
      "review_date": "2006-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolute the best comedy in my world. Amazing story, cast, acting, and everything else. The humor in this film went to eleven on every sense. It's smart, funny, and legendary. Watch this gem!",
      "review_date": "2007-02-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Up there with Spinal Tap and Bull Durham as my favorite comedy of all time. The characters are unforgettable and dialogue is priceless.",
      "review_date": "2007-04-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a hilarious movie! F the TV Guide! Rent it and have fun!",
      "review_date": "2007-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My absolute favorite comedy of all time and the best movie the Cohen Bros. have made.",
      "review_date": "2008-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a masterpiece. I don't know much about film but I do know when something is great. This is something that is great. Take the scene when the Dude is talking to an apparently despondent Mr. Lebowski in front of his fireplace. This is a masterpiece. I don't know much about film but I do know when something is great. This is something that is great. Take the scene when the Dude is talking to an apparently despondent Mr. Lebowski in front of his fireplace. While Lebowski laments, Dude just sits there dumbly, as if only half-aware of his surroundings. This scene could have been an emotional window into Lebowski's soul, but all such connotations are ruined by the Dude in all his stonerdom. The hero is just that, a stoner walking though life as if by accident.",
      "review_date": "2008-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is absolutely the only movie which I never tire of watching. The overcomplicated plot is indeed just an excuse to tie together a melange of colorful and hilarious vignettes -- the Coen brothers recognize the meaninglessness of the story This is absolutely the only movie which I never tire of watching. The overcomplicated plot is indeed just an excuse to tie together a melange of colorful and hilarious vignettes -- the Coen brothers recognize the meaninglessness of the story by showing us in the end that no kidnapping actually occurred. It matters not. The movie like the enduring music of Ravel is about style and flair over substance. And like that music The Big Lebowski is absolutely classic.",
      "review_date": "2008-02-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I recently saw this movie for the first time. I came in with low expectations - I was told it was a silly stoner movie. And I'm a pretty tough critic on movies overall and no big fan of stoner movies. Well they were right, it IS a I recently saw this movie for the first time. I came in with low expectations - I was told it was a silly stoner movie. And I'm a pretty tough critic on movies overall and no big fan of stoner movies. Well they were right, it IS a stoner movie. And it is also absolutely freaking brilliant. As in hilarious. This movie absolutely gets into her head and won't leave it. Some scenes are now indelibly etched into my brain now. Among many others, the scene with The Dude morphed onto a bowling ball and rolling down the lane - between the legs of a horde of beautiful women - and to some groovin' music - may be the funniest and most surreal thing I've ever seen in film. So ignore the up-tight critics. If you want something really different and can relax and go with the flow, this flick is for you. As for it being a stoner flick, well, it probably wouldn't hurt if you lit one up while watching this film either. It no doubt would make it even funnier. Why not - he actors and the Coen brothers were all definitely under the influence while making this masterpiece.",
      "review_date": "2008-04-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Masterfully written, cast, acted, and directed, this is an absurdist romp that never disappoints, sometimes surprises, and always entertains. Eminently quotable and relentlessly funny, this movie is worthy of its cult status. I feel sorry Masterfully written, cast, acted, and directed, this is an absurdist romp that never disappoints, sometimes surprises, and always entertains. Eminently quotable and relentlessly funny, this movie is worthy of its cult status. I feel sorry for the people who do not enjoy it; one of my all time favorite movies.",
      "review_date": "2009-09-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Ve f*#cks you up! Ve takes ze money.\" Simply put, the greatest movie to ever enter my psyche. I have sat for days quoting it to my friends who also feel the same. The Dude is quite possibly one of the most memorable characters in cinematic \"Ve f*#cks you up! Ve takes ze money.\" Simply put, the greatest movie to ever enter my psyche. I have sat for days quoting it to my friends who also feel the same. The Dude is quite possibly one of the most memorable characters in cinematic history. So too is Walter, Donnie, Maude, Ullie, Brant, Jesus... If you don't get it, thank God. The little Lebowski urban achievers that do are that much cooler due to your ignorance. My dirty undies Dude, my f.ckin' whites.",
      "review_date": "2007-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my absolute favorites...and I'm a movie guy...don't like TV. Several of the lower scores by the reviewers refer negatively to how 'scattered' it is, but frankly that's what it's supposed to be. The One of my absolute favorites...and I'm a movie guy...don't like TV. Several of the lower scores by the reviewers refer negatively to how 'scattered' it is, but frankly that's what it's supposed to be. The metaphor is bowling as life...and we're the pins.",
      "review_date": "2008-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is as close to a masterpiece as a movie about an unemployed bowler embroiled in a kidnapping scam can be.",
      "review_date": "2009-05-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "He fixes the cable?",
      "review_date": "2005-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Personally my favorite Coen Brothers film. Funny to see that it has the lowest critic rating. The Dude is one of those characters that you know in real life. Whether you have a friend like him or there's a little bit of Dude in you, you knowPersonally my favorite Coen Brothers film. Funny to see that it has the lowest critic rating. The Dude is one of those characters that you know in real life. Whether you have a friend like him or there's a little bit of Dude in you, you know this guy. Quotable lines, great actors, great storyline, this is definitely the Coen Brothers movie you don't want to miss.",
      "review_date": "2011-05-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Big Lebowski is the greatest comedy ever made. It's relentlessly funny no matter how many times you see it. The amount of quotes from this movie that have sneaked into my daily life is frankly absurd!",
      "review_date": "2012-08-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Big Lebowski is a wicked sharp genre satire disguised as a stoner comedy. It really isn't that hard to pick-up on it, but The Big Lebowski is a modern day version of a film noir. You've got the reclusive male lead (The Dude), the femmeThe Big Lebowski is a wicked sharp genre satire disguised as a stoner comedy. It really isn't that hard to pick-up on it, but The Big Lebowski is a modern day version of a film noir. You've got the reclusive male lead (The Dude), the femme fatales (The trophy wife and the daughter), the mysterious alliance of criminal henchmen (The German nihilists), the decadent businessman (Jackie Treehorn), and the fat, rich, scheming individual who oversees the fates of all those involved (The Big Lebowski). The situation The Big Lebowski gives us is what if you took out the private eye and replaced him with a man so lazy, he is unable to solve any mystery. What the film that shows us is precisely how ridiculous the entire situation is. This is actually even clearer when observing the typical Coen brothers theme, which is finding the humor in the darkest situation (this was proven indefinitely in the brilliant Fargo). Well, film noir literally translates as \"dark film\" so that means that this is really as dark as you can get outside of the Holocaust (and no, I don't wish the Coens made a comedy about the Holocaust). And boy is it ridiculous when it is shown before us through the eyes of the passive individual. While the satire is brilliant enough, the Coens make it even better with their signature style of idiosyncratic dialogue, and absurdist themes about the nature of life and crime. Inject that with a dose of irony, and The Big Lebowski is the Will Hunting of comedies: He's brilliant, but you sure wouldn't guess it by looking at him.",
      "review_date": "2011-08-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While not as funny as some comedies, The Big Lebowski relies on clever and intellectual humor that pushes it light-years beyond most. Add an ensemble cast, the greatest directing duo in Hollywood, and an interesting twist ending, this filmWhile not as funny as some comedies, The Big Lebowski relies on clever and intellectual humor that pushes it light-years beyond most. Add an ensemble cast, the greatest directing duo in Hollywood, and an interesting twist ending, this film remains a cult classic for good reason.",
      "review_date": "2011-12-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Big Lebowski is the funniest movie ever created, the Coen Brothers deliver one of their best movies about a slacker caught up in a case of mistaken identity that leads him into a ludicrous situation involving kidnap. The movie stays aThe Big Lebowski is the funniest movie ever created, the Coen Brothers deliver one of their best movies about a slacker caught up in a case of mistaken identity that leads him into a ludicrous situation involving kidnap. The movie stays a comedy great without forcing laughs upon you, it is smart and well thought out with a story and characters that could easily be stupid and pathetically displayed, but the Coen brothers have portrayed a film that is very interesting with characters portrayed very well and entertainingly, Jeff Bridges is fantastic as our lead character Dude with his carefree attitude and relaxed world being thrown into disarray his change of relaxed and calm is changed drastically with him becoming a man who is absolutely confused and who just wants to go bowling. John Goodman and John Turturro displaying two of the most memorable and hilarious characters you'll ever come across. Goodman as Walter, Dude's best friend and war veteran who is going through a bit of a crisis as he attempts to help the Dude whilst also becoming distressed over the memories of the Vietnam war, usually at inappropriate times. Turturro's brief appearance as a rival bowler who has a bit of a rivalry toward Walter and instantly steals the movie with his character Jesus. You will never watch a film quite as entertaining and hilarious as this one. One of the greatest movies ever created.",
      "review_date": "2012-02-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Classic, void all the special effects and digitiazation these days. Although \"the dude\" is the center of the movie Buchemi and Goodman carry the flick. Like a good carpet, they tie the movie together.",
      "review_date": "2012-09-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie has got one of the best actor cast of all time. All the tiny supporting actors, that we only see for about 1 minute in the whole movie are just great! The screenplay is nice, as it always is, when the Coen Bros. write it. But theyThis movie has got one of the best actor cast of all time. All the tiny supporting actors, that we only see for about 1 minute in the whole movie are just great! The screenplay is nice, as it always is, when the Coen Bros. write it. But they overdo it here. The ending is too absurd, e.g. Also it's not that exciting all the time. But the awesome cast is predominant.",
      "review_date": "2012-09-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ok, this, like any other Coen Brothers' movie, is hilarious as **** and **** is pretty funny nowadays. all the quotes, all the humor, all the characters/ actors, all the stuff you're gonna remember for the rest of your life. In my opinion,Ok, this, like any other Coen Brothers' movie, is hilarious as **** and **** is pretty funny nowadays. all the quotes, all the humor, all the characters/ actors, all the stuff you're gonna remember for the rest of your life. In my opinion, this is Joel Coen's best movie that wasn't nominated for any Oscars. In that case, Fargo is the best of Joel Coen's that actually won Oscars. I would recommend this movie to all Coen Brothers' fans. I would also recommend tuning- out all distractions and pay attention to the movie, because there's some **** you just might not understand without a bowl o' popcorn and no one to annoy you while you're trying to pay attention.",
      "review_date": "2010-09-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The greatest creation ever handed down to mankind from God above, and I thank him. And don't mess with that, because after all, you don't **** with the Jesus.",
      "review_date": "2012-03-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love the Coens' films but this is the one I've enjoyed the least. I found it uninspired, lazy and monotonous. Almost like they lost focus after the success of Fargo. Massively overrated in my opinion.",
      "review_date": "2014-04-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'll admit it, I'm not the biggest fan of The Big Lebowski. I think the Coen Brothers have done many much more impressive films in their career (Fargo, The Hudsucker Proxy, No Country for Old Men, A Serious Man), but I'm not blind to itsI'll admit it, I'm not the biggest fan of The Big Lebowski. I think the Coen Brothers have done many much more impressive films in their career (Fargo, The Hudsucker Proxy, No Country for Old Men, A Serious Man), but I'm not blind to its appeal. For one thing it's very funny. For another it's got a great soundtrack. It also features some of the finest performances of John Goodman, John Turturro, Steve Buscemi, Julianne Moore and not forgetting The Dude himself, Jeff Bridges. The plot itself is straight out of film noir, and is complex and multi-layered even by the standards of the genre - in fact, I'm convinced that the only way to make complete sense of the film is to be in a similar state of inebriation and/or being stoned as The Dude. That's one of my main problems with the film (though some might argue that it's part of the charm) - compared to most of the Coen's other work, The Big Lebowski completely lacks focus, and I find that a little irritating. After an hour or so you really couldn't care less what's going to happen, and it just becomes a steady stream of bizarre set-pieces. The film is never dull, but it never really has anything to say either. It may just be a weird series of events stemming from some stoned bum trying to get his rug replaced, which is fine, but a profound comment on everything from modern society to philosophy and religion it is not. But I guess as a cult film it's meant to divide you. I do like the Big Lebowski as a piece of entertainment, but just can't fall passionately in love with it as so many others do - it just doesn't speak to me.",
      "review_date": "2011-12-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Big Lebowski\" is about an attitude, not a story. It's easy to miss that, because the story is so urgently pursued. It involves kidnapping, ransom money, a porno king, a reclusive millionaire, a runaway girl, the Malibu police, a woman whoThe Big Lebowski\" is about an attitude, not a story. It's easy to miss that, because the story is so urgently pursued. It involves kidnapping, ransom money, a porno king, a reclusive millionaire, a runaway girl, the Malibu police, a woman who paints while nude and strapped to an overhead harness, and the last act of the disagreement between Vietnam veterans and Flower Power. It has more scenes about bowling than anything else.\r This is a plot and dialogue that perhaps only the Coen Brothers  could have devised. I'm thinking less of their clarity in \"Fargo\" and \"No Country for Old Men\" than of the almost hallucinatory logic of \"Raising Arizona\" and \"The Hudsucker Proxy.\" Only a steady hand in the midst of madness allows them to hold it all  together--that, and the delirious richness of their visual approach.\r Anyone who cares about movies must surely have heard something about the plot. This is a movie that has inspired an annual convention and the Church of the Latter-Day Dude. Its star, Jeff Bridges, has become so identified with the starring role that when he won the 2010 Oscar for Best Actor, Twitterland mourned that his acceptance speech didn't begin with, \"The Dude Abides.\" These words are so emblematic that they inspired a book title, The Dude Abides: The Gospel According to the Coen Brothers, by Cathleen Falsani. This is a serious book, though far from a dreary theological work.\r The Dude is Jeff Lebowski, an unemployed layabout whose days are spent sipping White Russians and nights are spent at the bowling alley. There is always a little pot available. He has a leonine mane of chestnut hair, a shaggy goatee, and a wardrobe of Bermuda shorts, rummage sale shirts, bathrobes and flip-flops,. He went to Woodstock and never left. He lives in what may be the last crummy run-down low-rent structure in Malibu.  Trust the Dude to find it.\r It is widely known that the Dude was inspired by a real man named Jeff Dowd, a freelance publicist who was instrumental in launching \"Blood Simple\" (1984), the first film in the Coen canon. I have long known Jeff Dowd. I can easily see how he might have inspired the Dude. He is as tall, as shaggy and sometimes as mood-altered as Jeff Lebowski, although much more motivated. He remembers names better than a politician, is crafty in his strategies, and burns with a fiery zeal on behalf of those films he consents to represent.\r In the film, Jeff Lebowski tells the millionaire's daughter (Julianne Moore) that in his youth he helped draft the Port Huron Statement that founded Students for a Democratic Society, and was a member of the Seattle Seven. In real life Jeff Dowd was indeed one of the Seattle Seven, and remains so militant that at Sundance 2009 he took a punch the jaw for insisting too fervently that a critic see \"Dirt,\" an ecological documentary Dowd believed was essential to the survival of the planet. True to his credo of nonviolence, the Dude did not punch back.\r In \"The Big Lebowski,\" our hero has left politics far behind, and exists primarily to keep a buzz on, and bowl. He is never actually drunk in the movie, and always far from sober. His bowling partners are Walter Sobchak (John Goodman) and Donny Kerabatsos (Steve Buscemi). Walter, even taller than the Dude, is a proud Vietnam veteran and the strategist of the three. He and the Dude never mention politics. Donny is their meek sidekick, always a step behind the big guys. He says perhaps three complete sentences in the film, all brief, and is often interrupted by Walter telling him to shut the f--- up. He is happy to exist on the fringes of their glory.\r Details of the plot need not concern us. It involves a mean-tempered millionaire in a wheelchair who is the Big Lebowski (the Dude becomes, by logic, the Little Lebowski). He broods before the fire in a vast paneled library, reminding me of no one so much as Major Amberson in \"The Magnificent Ambersons.\" His trophy wife Bunny (Tara Reid) appears to have been kidnapped. This leads indirectly to the Dude being savagely beaten by hit men who mistake him for the Big Lebowski. Well, how many Jeff Lebowskis can there be in Malibu? One of them urinates on The Dude's rug, which he valued highly (\"it pulled the room together\"), and the whole movie can be loosely described as being about the Dude's attempts to get payback for his rug.\r The inspiration for the supporting characters can perhaps be found in the novels of Raymond Chandler. The Southern California setting, the millionaire, the kidnapped wife, the bohemian daughter, the enforcers, the cops who know the hero by name, can all be found in Chandler. The Dude is in a sense Philip Marlowe  not in his energy or focus, but in the code he lives by. Down these mean streets walks a man who won't allow his rug to be pissed on. \"That will not stand,\" he says, perhaps unconsciously quoting George H.W. Bush about Saddam's invasion of Kuwait. The Dude does not lie, steal or cheat. He does swear.",
      "review_date": "2013-05-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a terribly overrated film. A hardly funny stoner flick, it goes for to long and is quite simply a bore. Cult classics are supposed to be good not haphazard mediocrity. On a more positive note the directing was at times brilliant with What a terribly overrated film. A hardly funny stoner flick, it goes for to long and is quite simply a bore. Cult classics are supposed to be good not haphazard mediocrity. On a more positive note the directing was at times brilliant with many memorable shots and some of the jokes amusing. The worst Coen film I have seen.",
      "review_date": "2009-12-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Some funny quotable lines smothered by to many too-long dream sequences, inane dialogue choking out clever bits, and overblown, monotonous banter.  A rather bland combination.  The only highpoint is the artfully crafted scenes andSome funny quotable lines smothered by to many too-long dream sequences, inane dialogue choking out clever bits, and overblown, monotonous banter.  A rather bland combination.  The only highpoint is the artfully crafted scenes and photography.  In a nutshell:\rDumb people think its boring\rClever people think its smart\rIntelligent people find it trite",
      "review_date": "2012-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I must have missed something, or maybe this is America's sense of humor, I do not know. What I do know is that I didn't find it funny, amusing at times but never enough to be worthwhile. An unfunny comedy is a bad movie. Maybe I couldn'tI must have missed something, or maybe this is America's sense of humor, I do not know. What I do know is that I didn't find it funny, amusing at times but never enough to be worthwhile. An unfunny comedy is a bad movie. Maybe I couldn't assimilate with the protagonists. I thought it would be good according to the reviews. What a boring experience. If feel like this would only make a child laugh, is it intended for children? Or am I offending some of you? Either way it spoiled my evening.",
      "review_date": "2013-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Overrated average comedy with weak character motivation and dull jokes.",
      "review_date": "2005-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is not the worst movie ever made by established star like Bridges, Moore, and Goodman. But it's close. Horrible. Not funny, not smart, not witty, not entertaining in the least.",
      "review_date": "2015-04-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The main downfall of the movie is that it's just not funny at all. There were certainly some funny scenes, but certainly not enough for a comedy. The plot was interesting and the acting was good, which saved it from being a total trainwreck.",
      "review_date": "2013-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The ultimate cult film!! The Big Lebowski is a strange, quirky and very funny film and one of the Coen Brothers' BEST!! Jeff Bridges plays the role of the iconic Dude flawlessly!!",
      "review_date": "2016-05-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest films ever made. A fantastic cast with superb humor and drama. Strikingly perfect compared to the rest of the Coen brother's oeuvre.",
      "review_date": "2017-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "(89/100)Pretty funny man like it's fun to watch dude and that's just like my opinion man.",
      "review_date": "2018-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Whoever dismisses this film as one which cannot manage its plot and overcomplicates itself, is actually overcomplicating him-or-herself, or is too conventionally ordered to actually enjoy this extravagant and flowing masterpiece.The CoenWhoever dismisses this film as one which cannot manage its plot and overcomplicates itself, is actually overcomplicating him-or-herself, or is too conventionally ordered to actually enjoy this extravagant and flowing masterpiece.The Coen Brothers (Joel and Ethan) and their 'Big Lebowski' are laughing and isolating themselves from the dependence on a plot to make a film function. This is not about plot. This is not about what happens to \"that poor girl... that poor sl*t!!\" which \"kidnapped herself\". This is not about a means to an ending. This is about style, attitude, flow and pure conversational experimentation. The three 'stooges' of this film are Theodore Donald 'Donny' Kerabatsos (Steve Buscemi), Walter Sobchak (John Goodman) and, of course, The Dude or \"Duder, El Duderino or His Dudeness\", you know, in case you're not into the whole \"brevity thing\". They are three buddies enjoying bowling. Their personalities are incredibly original and thorough. The Dude is a man with no past and no future. That is because he lives in the present; a slacker taking life as it goes, meanwhile Walter is a Vietnam veteran and is really hard to forget. They get drawn into a kidnapping plot involving rich people, feminists, performance artists, porn directors and nihilists. Donny is more of a filler to the trio. He is constantly ignored, told to shut up by Walter. Yet he pays no mind. He is happy to just be among them. He is so devout of personality that he is interesting.As I said, the plot is mercilessly deconstructed. Although, believe it or not, it all started when some goon urinated on The Dude's rug. There are continuous set-pieces which feel isolated, there are plot holes, lack of cohesion but all among them we are carried by a smooth, funny, balanced, rhythmic pace. The Coen Brothers take the plot in so many directions that it becomes obvious that they are doing it intentionally. Their visual style is eclectic, elegant yet not opulent, the characters are weird, intriguing and their interactions is something to behold. They confuse each other, over-complicate themselves.There is a scene in which The Dude is called upon to the mansion of a rich man. Brandt (Philip-Seymour Hoffman), his assistant, opens the twins door to the old man's room in a theatrical manner. He stands in the middle and dramatically pushes them away. There is explosive symphonic music filling the room. The man stands in front of the fire-place and contemplates at his mistakes. The opulence and grandeur of this scene was completely changed by the Coen Brother's hyperbolic approach to it. But its attitude was not reduced at all. Comedy often has a way of humiliating things. Here, it is bizarre and even pretentious.'The Big Lebowski' is paradoxical in its approach. Its comedy is humiliating yet hyperbolic and proud. It takes a natural talent to balance it perfectly. Its sublime flow and abstinence rises above all conventions. Its surreal scenery is a visual delight. And throughout all this complex script and the sheer amount of quotable lines, The Dude rises itself above all criticisms; the independent deadbeat. And like The Dude, this film is constructed in such an anarchistic manner that it revolts against all standards and simply enjoys itself.",
      "review_date": "2018-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "First off I must say that I do love this movie a great deal and give it a very high recommendation, but only to the right audience.  Some artsy fairy is not the type of audience you want viewing this movie.  Many complain that it has no plotFirst off I must say that I do love this movie a great deal and give it a very high recommendation, but only to the right audience.  Some artsy fairy is not the type of audience you want viewing this movie.  Many complain that it has no plot and really goes nowhere, but that is the whole point of the movie.  That is even explained in the opening dialogue of the movie delivered by the great Sam Elliot.  It is a movie that isn't necessarily supposed to make sense and just be kind of stupid funny.  Stupid, if done correctly, can be crafted into gold and that is the exact case with The Big Lebowski.  It's not trying to draw you in with a deep plot with twists and turns that leave you on the edge of your seat for the duration of the film.  It's just meant to be a goofy comedy about the craziness that ensues following a simple misunderstanding.  If you can't wrap your water drenched brain around that concept than their is no hope left for you.  This is not a deeply moving picture that is supposed to leave you in deep thought after viewing.  It is exactly what the directors intended it to be and nothing more.  Just because your TV guide suggests you avoid it due to a lack of story or character development does not mean that it can't still be hilarious.",
      "review_date": "2019-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mistaking him for millionaire Jeff Lebowski two thugs break into the apartment of the chilled out and unemployed Jeff (The Dude) Lebowski, believing that they can extort him for money, and soiling his living room rug in the process. Hoping toMistaking him for millionaire Jeff Lebowski two thugs break into the apartment of the chilled out and unemployed Jeff (The Dude) Lebowski, believing that they can extort him for money, and soiling his living room rug in the process. Hoping to get getting a replacement for his rug The Dude visits to his wealthy namesake but soon finds himself caught up in a completed plot involving all manner of criminal activities.With little plot to speak of it was important that yet again the Coen brothers have managed to create some truly memorable characters. Jeff Bridges is fantastic as The Dude and the foul mouthed Walter, played by John Goodman, delivers some brilliantly funny lines. Aside from arguably few scenes in the middle of the movie The Big Lebowski is consistently funny throughout and one of the best comedy movies of the 1990s.",
      "review_date": "2017-06-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very funny but the preponderance of swearing and crudity becomes tiresome. Acting is good.",
      "review_date": "2019-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Big Lebowski is about a man who has lived life on his own terms, failed at it, but still has no regrets. Every scene with the protagonist, the Dude, is ripe with little quirks of his character. He is a perpetual chiller. Some of theThe Big Lebowski is about a man who has lived life on his own terms, failed at it, but still has no regrets. Every scene with the protagonist, the Dude, is ripe with little quirks of his character. He is a perpetual chiller. Some of the supporting cast also made for good comedy, chief among them Walter, who is a Vietnam veteran angry with the world for no good reason. The humour mainly came from the characters of the Dude and Walter, whose inept skills of detecting mess up everything that could make things easier for the world, themselves included.\r Some hoodlums mistake the Dude, whose real name is Lebowski, for a millionaire and extort him. They decide to piss on his favourite rug, which makes him want to seek compensation from the rich man. Needless to say, things escalate unexpectedly when this man's wife is seemingly kidnapped and he asks the Dude to take the ransom money to the rendezvous and potentially identify the kidnappers. His involvement in the affair seems to be to the detriment of all the concerned parties. Things go wrong from the beginning as the pair, the Dude and Walter, lack a reasonable voice and go along without planning anything. There's a plot that moves the movie forward but the focus is on the lifestyle of the Dude. Everything else works to portray his life as fully as it could be.\r What the movie does extremely well is insert quick-witted quips throughout the length of the movie, often when you won't be expecting them, which certainly had me cracking up every other moment. There was a lot of serious talk going on in the guise of dialogue. A comedy it was but to be able to discern these little moments of enlightenment every other while made me respect the script a lot more than I would have if the intention had been just to make me laugh at goofy lines. That was a work of genius and deserves recognition.\r There were a lot of secondary characters which lighted up the moments. There was this rival of the main duo at the bowling alley who seeks to incite confrontation with every word of his. Walter always seems to want to stand up to bullies and makes big statements and bold moves, the majority of which end up creating trouble for the Dude. Thrown into the mix is the rich Lebowski's daughter (Julianne Moore) who believes that her father's trophy wife is faking her abduction and wants the money for her own. So she sets the Dude on her own personal agenda to help her prove that she's right.\r The Dude is pushed around by everyone who comes into contact with him, from the rich Lebowski to his daughter, the kidnappers, a porn producer and even the police; and much of the comedy originates from this. They all just barge into his private space whenever they feel like it and bully him. But nothing ever shakes his exterior and his values of pacifism never leave his side. Even for a man as passive as him, trouble seems to find ways to bring itself to him.\r There are some scenes of such hilarity that I literally had to double over and hold my stomach. There was also a fair amount of profanity and nudity, and the Dude is a compulsive smoker of weed.\r The narrative during the first half was strong and carried the movie very well. The second half seemed to lose a bit of steam, as the plot became somewhat convoluted. But what you have to understand is the bigger picture_ which is not to get the plot which is by no means difficult to follow, but witness a chapter in the life of Jeff \"The Dude\" Lebowski while he tries to enjoy his life. I feel like Jeff Bridges deserved  to be lauded for his portrayal for the character much more than he did for his other roles.\r For such an intelligent comedy, which is a rare brand, I feel like it deserves a perfect ten for the effort and achievement in creating compelling characters that succeeded in making people laugh yet be a bit brooding and make statements about politics and war under the layer, if you care to look for them, without diminishing the entertainment value of the piece in the least.",
      "review_date": "2014-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love The Big Lebowski. It is so damn funny all throughout and the characters are so interesting to watch. It gets better with every viewing and I good quote this movie all day.",
      "review_date": "2013-02-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies given to an audience by the Coen Brothers. A bizarre, funny, and clever case of mistaken identity. John Goodman and Jeff Bridge work so well off of each other, and the rest of the cast ties it together.\r Very quotableOne of the best movies given to an audience by the Coen Brothers. A bizarre, funny, and clever case of mistaken identity. John Goodman and Jeff Bridge work so well off of each other, and the rest of the cast ties it together.\r Very quotable and fun to re-watch. Bowling, carpet, cars, money, and weird stuff..   It can be understandable that it's either a love/hate film for people  but what's not to love. Listen to user reviews.",
      "review_date": "2013-02-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am so confused as to how I feel about “The Big Lebowski”; it’s like the whole movie is a prank on the audience.  Was the whole point that there is no point?  It is so expertly made, and it really does a great job of making each sceneI am so confused as to how I feel about “The Big Lebowski”; it’s like the whole movie is a prank on the audience.  Was the whole point that there is no point?  It is so expertly made, and it really does a great job of making each scene entertaining.  But the story just feels so unresolved, like I was waiting for a payoff that never happened.  It is totally worth watching, and it is possible that repeat viewings might make me like it more.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out.",
      "review_date": "2021-08-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I had high hopes when I rented this movie. As you can tell from my score, I was not disappointed. I love this film, it's funny, it makes you feel good, and it's just overall a good movie.\rJohn Goodman and Jeff Bridges deliver outstandingI had high hopes when I rented this movie. As you can tell from my score, I was not disappointed. I love this film, it's funny, it makes you feel good, and it's just overall a good movie.\rJohn Goodman and Jeff Bridges deliver outstanding performances in one of the best movies of all time.",
      "review_date": "2013-07-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A hilarious tale about a bum trying to get his rug back. The performances are very strong for a comedy, particularly from John Goodman. Every character is very likable in their own way. The story is a bit scattered but, easy to recognize. TheA hilarious tale about a bum trying to get his rug back. The performances are very strong for a comedy, particularly from John Goodman. Every character is very likable in their own way. The story is a bit scattered but, easy to recognize. The writing is absolutely superb, thus making this one of my personal favorite comedies.",
      "review_date": "2013-09-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the Coen brothers finest work, it entices me more than \"Fargo' of 'No Country\", but added more hilarity without destroying quality. Jeff Bridges and John Goodman lead the film's chaotic and black humor that the Coen brothers alwaysOne of the Coen brothers finest work, it entices me more than \"Fargo' of 'No Country\", but added more hilarity without destroying quality. Jeff Bridges and John Goodman lead the film's chaotic and black humor that the Coen brothers always embed into their scripts without adding any corny aspects, beside the dialogue. One of the funniest, and surprisingly smartest comedies I've seen in a long while. To inspire a festival!",
      "review_date": "2014-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There is simply no amount of words that can contain The Big Lebowski. Every little detail is thought out and executed with a master's touch by the Coen brothers. The one thing I will mention is that I felt so bad for Donny (Steve Buscemi),There is simply no amount of words that can contain The Big Lebowski. Every little detail is thought out and executed with a master's touch by the Coen brothers. The one thing I will mention is that I felt so bad for Donny (Steve Buscemi), who was constantly being tormented by John Goodman, but it added an extra little treat to the film that the Dude never directly talked to him throughout the 117 minute run time.",
      "review_date": "2013-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is just one of those movies that gets mixed feelings from everyone. Some like it, some hate it. The premise may be a bit dumb, but that's what makes the whole movie so much fun to watch. Again, it's a not a movie for everyone.",
      "review_date": "2013-09-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is extremely funny with really good acting. I was disappointed by some of the stuff in it, but it did a fantastic job at making a comedy movie.",
      "review_date": "2013-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe Big Lebowski is a cult classic that can be watched over and over. It might seem a bit stupid at first, but as it progresses, it becomes a funny and surprisingly good movie about Jeff Lebowski, or The Dude, and his attempt to get his rug back that turns into an awesome movie throughout. And Steve Buscemi dies in it. What more could you want?",
      "review_date": "2013-10-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The problem with The Big Lebowski is that it isn't very likely to reward you on the first go. I find it nearly impossible to watch a movie more than once within a period of several years, but I can almost always sit down with this film andThe problem with The Big Lebowski is that it isn't very likely to reward you on the first go. I find it nearly impossible to watch a movie more than once within a period of several years, but I can almost always sit down with this film and get something out of it. The story is really secondary here, with its lazy and seemingly directionless progression hiding an impressive meticulousness. Not a single second is without purpose. By the end, the film becomes a brilliant philosophical inside joke about itself that gets funnier every time. Or not. Either way's a pleasure.",
      "review_date": "2014-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great crime comedy from The Coen Brothers, a smart story with very weird and colorful characters, Jeff Bridges puts on a great comedic performance, great work from the supporting cast that includes John Goodman, Julianne Moore, Steve Buscemi,Great crime comedy from The Coen Brothers, a smart story with very weird and colorful characters, Jeff Bridges puts on a great comedic performance, great work from the supporting cast that includes John Goodman, Julianne Moore, Steve Buscemi, the late Phillip Seymour Hoffman and many others",
      "review_date": "2014-06-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Big Lebowski was pretty good. It is a little out there because it is a film from Joel and Ethan Coen, but besides that, The Big Lebowski was still pretty good.",
      "review_date": "2014-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A masterpiece. The Coen's brothers at their finest. A film unlike any other even to this day. It's film bliss. Beautifully well acted, cleverly written and overall just pleasant.",
      "review_date": "2014-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's not particularly funny, it's not particularly entertaining and  the story was pretty stupid. In fact, That's the problem with the movie, it's just average. The acting was good and the soundtrack was great but it wasn't enough to make theIt's not particularly funny, it's not particularly entertaining and  the story was pretty stupid. In fact, That's the problem with the movie, it's just average. The acting was good and the soundtrack was great but it wasn't enough to make the movie good.The Big Lebowski definitely is an underwhelming movie.",
      "review_date": "2016-09-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I often find that Coen Brothers movies can be rather hit and miss, sadly The Big Lebowski was a miss for me.  It was one of those films where I really wished I could get the hours back that I had lost watching a film that I feel just doesn'tI often find that Coen Brothers movies can be rather hit and miss, sadly The Big Lebowski was a miss for me.  It was one of those films where I really wished I could get the hours back that I had lost watching a film that I feel just doesn't measure up to some of the other Coen entries.\r The film had moments that made me chuckle but never really had me in stitches with laughter, perhaps it just wasn't my humour (which is fairly broad I might add).  I'll give it credit that there were some good performances during the film from the likes of Bridges and Buscemi but on the whole I wasn't hugely impressed.  I must be missing why this film has such a cult status... then again some of the most terrible movies have cult status for some reason or another.",
      "review_date": "2014-09-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Smart, entertaining and downright ridiculous this movie is truly one of the best sleazy films full of wit, stupidity and truly quotable moments. Jeff Bridges and John Goodman make the one of the best comedy duos in this cult classic.",
      "review_date": "2015-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm giving this film a Mild 7 because I would classify it as more or less entertaining.  If you can imagine potheads and semi-psychotic vets as a source of comedy then probably you will find The Big Lebowsky to be worth the watch.I'm giving this film a Mild 7 because I would classify it as more or less entertaining.  If you can imagine potheads and semi-psychotic vets as a source of comedy then probably you will find The Big Lebowsky to be worth the watch.  Ultimately, this film is not a comedy masterpiece, it's not deep, and it probably isn't correct to say that it's actually \"about\" anything.  But it is more or less entertaining, which is why I call it a Mild 7.\r I'm not really a fan of John Goodman, but in this film he does some good work and actually did provoke me to laugh \"out loud.\"  There is also a scene involving an artist \"painting\" like a Jackson Pollock no one has ever seen.",
      "review_date": "2016-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The big lebowski is one of the best films of all time the characters have a likability that most films cant capture, the dialogue is one of the funniest and most natural I have ever seen and the film has a lot of things to uncover such asThe big lebowski is one of the best films of all time the characters have a likability that most films cant capture, the dialogue is one of the funniest and most natural I have ever seen and the film has a lot of things to uncover such as theories that are not directly told but in a subtle way so multiple viewings is beneficial and a lot of fun.",
      "review_date": "2015-06-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Unfortunately, The Big Lebowski failed to \"bowl\" me over.  I wanted it to \"strike\" me the way it struck others. However, it was more like staring down the \"lane\" at a \"7-10 split.\"",
      "review_date": "2015-05-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie, funny, at times weird, interesting, unexpected, not usual. COnsidered cult classic nowadays.",
      "review_date": "2019-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very funny film, although slow at certain points. It's good that The Dude is a sympathetic character, because his friend is **** annoying, honestly.",
      "review_date": "2015-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film stands the test of time very well. It is laugh-out-loud funny and has an outrageous messy crime story. The plot is creative and unique. Gangsters attack a man, because he happens to have the same name as the real man they wereThis film stands the test of time very well. It is laugh-out-loud funny and has an outrageous messy crime story. The plot is creative and unique. Gangsters attack a man, because he happens to have the same name as the real man they were looking for. After the mishap, he seeks reparations for his rug that was soiled in the process, only to find himself strewn in the mess even further.The Coen Brothers are masters of their craft, creating a genre-busting film with witty dialogue, comedic irony, subversions of expectation, a perfect soundtrack, and acting that gives life to the characters. If you're looking for a perfect film, try this stoner comedy with a tremendous crime plot.",
      "review_date": "2020-08-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Black comedy about a lazy man who is a victim of identity confusion. Mixture of stylized violence and wacky dialogues (I'm not Mr. Lebowski, you are Mr. Lebowski) Jeff Bridges had never looked as wonderful as he was hilarious, as had hisBlack comedy about a lazy man who is a victim of identity confusion. Mixture of stylized violence and wacky dialogues (I'm not Mr. Lebowski, you are Mr. Lebowski) Jeff Bridges had never looked as wonderful as he was hilarious, as had his co-stars Buscemi and Goodman.",
      "review_date": "2020-09-04",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 133,
  "genres": [
    "Comedy",
    "Crime"
  ]
}