{
  "title": "Goodfellas",
  "rating": 8.7,
  "release_date": "1990-09-01",
  "summary": "Based on the bestselling book \"Wiseguy\" by Nicholas Pileggi, Scorsese's film profiles nearly 30 years of mob life in New York City.",
  "critic_reviews": [
    "No finer film has ever been made about organized crime - not even \"The Godfather.\"",
    "One of Martin Scorsese's most brutal but stunning movies, an incredible, relentless experience about the singleminded pursuit of crime.",
    "No so-called serious gangster film has ever been more fun, or less dangerous, or more intrinsically feminist, than GoodFellas. Even \"I Married the Mob\" was scarier.",
    "With patience, care, and strict attention to detail, Scorsese has staked out an impregnable position in the history of motion pictures.",
    "Goodfellas is a compelling, black-comic nightmare.",
    "Although Goodfellas doesn’t aspire to the grandeur of Coppola’s mob, Scorsese’s New Yorkers have their own vitality, even if – or perhaps because – the threat of violence is never far away.",
    "The movie’s morality lies in its form.",
    "Martin Scorsese scores again with his gritty, kinetic adaptation of Nicolas Pileggi's best-selling \"Wiseguy.\"",
    "Scorsese's rich tapestry is both broader in scope and more detailed than a mere recounting of the events in the trio's life of crime.",
    "Stylistically, it's a remarkable effort -- with a continuous sense of gliding motion -- and the film is entertaining and gripping throughout.",
    "Simultaneously fascinating and repellent, Goodfellas is Martin Scorsese's colorful but dramatically unsatisfying inside look at Mafia life in 1955-1980 New York City."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "An amazing film that shows mob life at its grittiest, goriest, lowest levels.I loved Goodfellas. Every time I watched it, it still felt great. But one thing really perked me. How is it a classic? It is one of the best movies I ever watchedAn amazing film that shows mob life at its grittiest, goriest, lowest levels.I loved Goodfellas. Every time I watched it, it still felt great. But one thing really perked me. How is it a classic? It is one of the best movies I ever watched but why is it so revered? I watched it another time just to keep my eye out for details.Now I understand.It isn't easy. Especially to praise a film with countless violence and seemingly aimless profanity (300 f words total). But Goodfellas isn't about that. It's about the story. It's about the array of characters. It's about the suspense. It's one of the most accurate portraits of mob life, specifically those in the lower end of the food chain.THe story is narrated by Henry Hill, an ex-mobster who explains his dreams of becoming a gangster. Through Henry's eyes, being a gangster was everything. Money. Cars. Girls. Respect. Nobody would dare talk rough to a gangster. And the cops could care less too. Our main man Henry, narrates his 30-year career as a mob member from parking cars to setting cars on fire to dealing drugs to carrying out dastardly schemes (the infamous Lufthansa heist). In the end, Henry is forced to give up his mob life and expose his fellow gangsters after learning his best friend is going to kill him. Even then, he still misses his old life stating that he is now a regular guy aka a nobody, a \"schnook\".Robert De Niro is charming yet cunning as Jimmy Conway. He smiles but behind is a greedy desire. He makes sure he gets what he wants and those who don't follow him get whacked. Joe Pesci, the show stealer, gives a fiery performance as the short-tempered Tommy De Vito. He wants respect and one word is enough to make him go berserk. Ray Liotta and Lorraine Bracco both give fine performances even though they are the most thankless roles in the film.Dialogue is a highlight even if it is laced with numerous profanity. But the music is something that really adds to the success. The eclectic rock soundtrack fits its scenes like a modern-day orchestra. Scorsese is able to fit a piano version of Layla and a montage of dead bodies so perfectly. That is a rare gift.Once again my favorite director stuns me with another classic that I now fully realize as a classic. It may not be his best (that would be Taxi Driver) but it definitely is one of them.",
      "review_date": "2010-08-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you enjoy gangster movies, then Goodfellas is a must see.",
      "review_date": "2011-05-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies of all time. Definetly my favorite gangster movie. If you haven't seen this film, you owe it to yourself to watch it. Its exciting, fun, exhilarating! Not to mention its based on a true story! Great movie, watch it.",
      "review_date": "2014-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Martin Scorsese at his very best. Everything about the film is perfect. Real-life gangsters have attested to the accuracy of the film. A masterpiece!",
      "review_date": "2021-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great movie all round. Good acting, perfect pacing, and direction. You feel like you know what it would've been like to live the life of the main character because it seemed so personal with the narration. It's a very upfront film with noA great movie all round. Good acting, perfect pacing, and direction. You feel like you know what it would've been like to live the life of the main character because it seemed so personal with the narration. It's a very upfront film with no special effects or jazzing up because it doesn't NEED lots of action or anything. It's just pure brilliance in storytelling.",
      "review_date": "2014-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Interestingly, I read the book \"Wiseguy\" before watching the movie. While the movie is excellent, and very well made, it did not even come close to the greatness of the book's details. This ranks as one of my favorite films, so do not get meInterestingly, I read the book \"Wiseguy\" before watching the movie. While the movie is excellent, and very well made, it did not even come close to the greatness of the book's details. This ranks as one of my favorite films, so do not get me wrong; I highly recommend this movie, but will recommend the book even more.",
      "review_date": "2013-11-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gangster movies is an old and known formula to making movies. But in Goodfellas it works. Oh... and how it works.",
      "review_date": "2018-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas. He wanted to become a gangster. This is the greatest film in which it is shown how much not the life of the main character Henry Hill, but the life of the entire mafia. The top three look great, but Robert De Niro's Jimmy ConwayGoodfellas. He wanted to become a gangster. This is the greatest film in which it is shown how much not the life of the main character Henry Hill, but the life of the entire mafia. The top three look great, but Robert De Niro's Jimmy Conway is the favorite.",
      "review_date": "2020-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie is great. Characters are great High quality movie about gangsters that is definitly a must see",
      "review_date": "2019-06-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas is honestly a masterpiece. The movie's got a great plot, bloody action, amazing actors/actresses, beautiful songs and some beautiful cinematography from Michael Ballhaus. Overall, it's a masterpiece of a movie and it's honestlyGoodfellas is honestly a masterpiece. The movie's got a great plot, bloody action, amazing actors/actresses, beautiful songs and some beautiful cinematography from Michael Ballhaus. Overall, it's a masterpiece of a movie and it's honestly worth the watch.",
      "review_date": "2020-07-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great movie. Basically just a movie following the life of a gangster. If you haven't seen it before you are missing out.",
      "review_date": "2021-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Briskly paced with tight editing, acting, and music placement, Scorsese's \"Goodfellas\" strikes moments of gold in an exciting adaptation of a survivor's true story.",
      "review_date": "2021-08-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Martin Scorsese, like many of his compositions, is very shrewd in his good comrades, and in a narrative that is carefully constructed and avoids us as an audience.Goodfellas is a better and more thoughtful version of his previous film MeanMartin Scorsese, like many of his compositions, is very shrewd in his good comrades, and in a narrative that is carefully constructed and avoids us as an audience.Goodfellas is a better and more thoughtful version of his previous film Mean Streets, especially since Goodfellas takes us on a journey to find out who is telling us the story in the film. Reflect on whose words we listen to and tend to accept. This is an important question in the context of a film that asks us to consider gangsters as notable human beings. Henry Hill, the narrator and the main character of the film, seems to be in the role of our guide.He talks to us throughout the film (using Voice Over) and what we see as the viewer is actually what he sees and the story seems to be controlled by him as the main character. As Scorsese constantly questions the fact whether humans have control over things or it is the circumstances and the story that happen to humans. This is one of the recurring themes and an important part of the main structure in this good director's films. The use of a omniscient (narrator) who is also the main character of the film in each of the films has made the viewer feel inside the story.",
      "review_date": "2022-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best mob movie of all time after the first two parts of The Godfather and one of the best movies of all time",
      "review_date": "2022-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a movie that gets every great thing about mob movies but should of been longer.",
      "review_date": "2022-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Based on a true story, Goodfellas is another great film by Martin Scorsese that isn't one of his best films in my opinion, but is still pretty good. I would give this movie three and a half stars, but a lot of you guys would probably give itBased on a true story, Goodfellas is another great film by Martin Scorsese that isn't one of his best films in my opinion, but is still pretty good. I would give this movie three and a half stars, but a lot of you guys would probably give it four stars because of its great directing. Definitely worth seeing.",
      "review_date": "2012-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I live gangster movies, but more importantly I love the history of gangsters. This movie has all the great backstories of the gang world, however not that much violence, which made it lose some pop. The plot also seemed a bit twisty. Maybe onI live gangster movies, but more importantly I love the history of gangsters. This movie has all the great backstories of the gang world, however not that much violence, which made it lose some pop. The plot also seemed a bit twisty. Maybe on a second viewing I'll see why people love it so much, but for now it's just a rely good mob film.",
      "review_date": "2012-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas is Martin Scorsese's crime masterpiece, one that should have one both Best Picture and Best Supporting Actor. It is a perfect deception of crime, and one of the greatest crime movies, or any movie for that matter, of all time.",
      "review_date": "2012-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A startlingly violent yet charming portrayal of life in the mob. Goodfellas really give you a sense of what it would be like to be in the mafia. It's defiantly the best film in the genre, better even than the godfather.",
      "review_date": "2011-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas is one of my Top 5 greatest movies of all time  Now matter if it are the characters, dialogues or if it is the pacing and the violence, everything in this movie is at a top level.",
      "review_date": "2013-11-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest Oscar snubs of all-time, besides well Raging Bull and Taxi Driver. Martin Scorsese was on his way to becoming the new Stanley Kubrick in never receiving the coveted Best Director or Best Picture award. The cast is greatOne of the greatest Oscar snubs of all-time, besides well Raging Bull and Taxi Driver. Martin Scorsese was on his way to becoming the new Stanley Kubrick in never receiving the coveted Best Director or Best Picture award. The cast is great Peci and De Niro are awesome.",
      "review_date": "2012-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Definitely the best crime/mafia movie ever made. The fact that it is a true story makes it even better. How this film didn't win best picture is beyond me.",
      "review_date": "2012-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I saw this movie right after I saw Godfather 3. I needed a god mobster movie to wash out the bad taste of the last one. Goodfellas did just that. The acting was all around excellent. Not one person in the movie stood out as a particularly badI saw this movie right after I saw Godfather 3. I needed a god mobster movie to wash out the bad taste of the last one. Goodfellas did just that. The acting was all around excellent. Not one person in the movie stood out as a particularly bad actor. Ray Liotta's first person narration works really well and helps us get to know the character all that much better. The story kept me interested the whole way through, showing us Henry Hill's life and how cutthroat and dangerous the mob can really be. This may very well be the first movie I have ever seen that made me want to watch it again IMMEDIATELY after watching it!",
      "review_date": "2012-04-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I just finished Goodfellas for the first time, and wow. A stunning film that captures organized crime to perfection. The screenplay, the direction, and the acting are all superb. Usually, I write wordy essays critiquing films, but thisI just finished Goodfellas for the first time, and wow. A stunning film that captures organized crime to perfection. The screenplay, the direction, and the acting are all superb. Usually, I write wordy essays critiquing films, but this transcends words. One of my favorite films ever made.",
      "review_date": "2013-12-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a masterpiece by Martin Sorsesse.  One of his best films, if not his best ever made.  Follows the life of Henry Hill and his life in the Mob.  Great characters, story and best of all directing.  Wonderful movie...watch it now.",
      "review_date": "2013-06-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A brilliant film by Scorsese, the best filmmaker alive in my opinion. Unbelievably entertaining for two and a half hours, with colorful characters, hilarious dialogue, and brilliant violence. Joe Pesci gives his best performance of hisA brilliant film by Scorsese, the best filmmaker alive in my opinion. Unbelievably entertaining for two and a half hours, with colorful characters, hilarious dialogue, and brilliant violence. Joe Pesci gives his best performance of his career, and Scorsese seems to be at his energetic best within this film. One of the best films ever made.",
      "review_date": "2010-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just watched this last night. Totally blew me away, drawing me in from the very start. Funny, shocking but overall one of the best of its kind. Martin Scorsese delivers a film experience that anyone who calls themselves a buff NEEDS toJust watched this last night. Totally blew me away, drawing me in from the very start. Funny, shocking but overall one of the best of its kind. Martin Scorsese delivers a film experience that anyone who calls themselves a buff NEEDS to experience. I liked the way the whole movie is told in chronological order, showing 30 years of mob life in NYC. Possibly the best gangster film I have seen so far.",
      "review_date": "2011-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Scorsese's best film easily . its a story spanning 30 years of a life of a mobster . from when he was a kid getting in till his downfall . as the story is being told you are getting narration from henry hill played by ray liotta the mainScorsese's best film easily . its a story spanning 30 years of a life of a mobster . from when he was a kid getting in till his downfall . as the story is being told you are getting narration from henry hill played by ray liotta the main charicter of the film. which puts you in his head on what he was thinking and why he does what he does. this is easily liotta's nest performance . joining him are paul sorvino as big pauly , joe peshi as tommy , and robert deniro as jimmy conway . all there acting in this picture is just fantastic . peshi's performance expecially stands out he really comes off as a guy you dont mess with and why he won the oscer for best supporting actor. if you wana see some great acting and hear a great story and get inside the head of the mob this is the movie to see . even better then the godfather id say.",
      "review_date": "2010-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I believe that Martian Scorsese is my favorite director, not once have i had to sit down and watch a **** film from him. Good-fellas, based on a true story, is an absolute master-peace of a film that truly shines in about everything  fromI believe that Martian Scorsese is my favorite director, not once have i had to sit down and watch a **** film from him. Good-fellas, based on a true story, is an absolute master-peace of a film that truly shines in about everything  from cast, Plot and Characters, everything just flows so perfectly from beautiful shots to dark gritty and violent scenes to beautiful numbers filled with fine song and dance numbers. The film is **** fantastic and recommend all to sit down and watch",
      "review_date": "2014-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best mob story ever written by Martin Scorsese and also in the cinema too. Ray Liotta, Robert De Niro, and Joe Pesci played the most awesomest performances of a lifetime.",
      "review_date": "2011-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I had heard so many good things about Goodfellas, I just never got around to watch it. I recently picked it up at the store (on recommendation of a friend), and I am a fan of Martin Scorsese's films, and I can easily say it is Scorsese's bestI had heard so many good things about Goodfellas, I just never got around to watch it. I recently picked it up at the store (on recommendation of a friend), and I am a fan of Martin Scorsese's films, and I can easily say it is Scorsese's best film. The movie has the violence and language that every Scorsese film has, but it is the story and the characters that truly make this film memorable. The movie definitely shows the grittiest aspects of mob life, and definitely shows it through the violence and betrayals. The plot twist throughout the movie, matched with excellent acting by all, make this my new favorite Scorsese film.",
      "review_date": "2011-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Better paced than The Godfather and more interesting than Scarface, makes this the best mob film ever. Based on a true story, this Scorsese masterpiece shows why he is the god of film making.",
      "review_date": "2012-07-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Godfather defined the mafia film genre in 1972, with astonishing performances from everyone involved. Martin Scorsese re-defined that same genre with this film in 1990. Not only was it masterfully put together, but almost all of theThe Godfather defined the mafia film genre in 1972, with astonishing performances from everyone involved. Martin Scorsese re-defined that same genre with this film in 1990. Not only was it masterfully put together, but almost all of the acting (bar Lorraine Bracco) was absolutely astonishing, the musical choices were great, it united screen legends De Niro and Pesci for the first time, it won an Oscar, and it propelled Martin Scorsese to a new level of fame he had not seen since such films as Taxi Driver and Raging Bull. This set the bar not only for Scorsese films after it, or mafia films after it, but crime films in general. This is one of the best films of all time, and if you don't believe that you should watch it again.",
      "review_date": "2013-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas can easily be considered one of the greatest films ever made during the 90's. What makes it so brilliant, you ask? Without a doubt, it's number one quality is it's PLOT. Utterly captivating from the first scene the plot deliversGoodfellas can easily be considered one of the greatest films ever made during the 90's. What makes it so brilliant, you ask? Without a doubt, it's number one quality is it's PLOT. Utterly captivating from the first scene the plot delivers one of the best cinematic experiences you will ever encounter.",
      "review_date": "2012-04-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Martin Scorsese's last classic film (The Departed was borderline, and for me it was on the wrong side of that border) gives an incredibly realistic depiction of life in the mafia. Surpassed only by the first two Godfather films in terms ofMartin Scorsese's last classic film (The Departed was borderline, and for me it was on the wrong side of that border) gives an incredibly realistic depiction of life in the mafia. Surpassed only by the first two Godfather films in terms of crime films, but this is more re-watchable and more entertaining. Joe Pesci gives one of the greatest supporting performances of all time. Should have been the third oscar for Martin Scorsese (with Taxi Driver and Raging Bull). Yet another academy **** up",
      "review_date": "2014-04-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is absolutelly brilliant, this is the best movie of Martin Scorsese.Is funny, is scary is depressing and is a classic.",
      "review_date": "2018-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The famous crime movie \"Goodfellas\" is a decent movie. It is very realistic and portrays the daily life of crime. However the movie is unnecessarily long and tedious, lacking lasting appeal. Nevertheless, Martin Scorsese did create a fineThe famous crime movie \"Goodfellas\" is a decent movie. It is very realistic and portrays the daily life of crime. However the movie is unnecessarily long and tedious, lacking lasting appeal. Nevertheless, Martin Scorsese did create a fine movie that supports the core of American crime genre.",
      "review_date": "2011-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "best movie ever i love mafia movies and this movie is the best mafia movie ever i even think this movie is better than the godfather (which is also a great movie btw) the end was good and i loved the characters",
      "review_date": "2017-05-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie revolves around Henry Hill, an American gangster, and the route he did within the restricted circles of organized crime. Directed by Martin Scorsese, it has a Nicholas Pileggi script and a cast headed by Robert De Niro, Ray LiottaThis movie revolves around Henry Hill, an American gangster, and the route he did within the restricted circles of organized crime. Directed by Martin Scorsese, it has a Nicholas Pileggi script and a cast headed by Robert De Niro, Ray Liotta and Joe Pesci. The film was nominated for six Oscars, winning only one of them (Best Supporting Actor).This is a cult film for lovers of gangster movies. Based on real events, the film shows us a lot about the inner world of the Mafia and can transport the audience into the world of organized crime with great ease. It has an excellent script, which focuses its attention on the brutality of the men, and the superficiality of appearance of lives that crime allowed them to bear. All the actors were at the highest level but Joe Pesci exceeded expectations giving his character the soul of a true psychopath, with very strong action scenes. In fact, all the action scenes in this movie are intense, but they are even better for never losing realism and do not seem too far-fetched. De Niro achieved in this film, one of the most careful and well-achieved interpretations of his entire career to date. Much of the film's success is due to the painstaking efforts of Scorcese, a committed director who likes to make exceptionally good films. The photography is excellent, quite dark at times, which helps to capture the most tense moments of the film. All visual effects and sound were made carefully and look good on the screen.",
      "review_date": "2018-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "(97/100)Stop busting my balls! Goodfellas is a must watch ganster movie that's funny, entertaining and engaging.",
      "review_date": "2018-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There must be something extremely wrong with you if you don't love this movie. Either the violence is to graphic or language is strong, you've got to at least love it.",
      "review_date": "2011-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This IS NOT...NOT...the best gangsta movie ever. It's not even close, and it surely isnt Scorsese best film. I unfortunately watched this after watching Casino, which is much better, and since they are very similiar movies i would This IS NOT...NOT...the best gangsta movie ever. It's not even close, and it surely isnt Scorsese best film. I unfortunately watched this after watching Casino, which is much better, and since they are very similiar movies i would highly recommend you either A. watch this movie first, then Casino or B. watch Casino and dont watch this movie...just ok",
      "review_date": "2007-05-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I've watched this film several times now and each time I've grown to dislike it more and more. There are no life lessons to be learned from this movie, viewing this film will not enrich the spirit, rather it will leave a dark stain on your soul.",
      "review_date": "2019-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's an overall decent and good movie. It has the same flaw as the departed though and that's WAYYY too much cussing. Okay I don't mind cussing you cuss alot you're a bad ass. You cuss everynow and then sure fine whatever. However, if youIt's an overall decent and good movie. It has the same flaw as the departed though and that's WAYYY too much cussing. Okay I don't mind cussing you cuss alot you're a bad ass. You cuss everynow and then sure fine whatever. However, if you just keep cussing and cussing on and on and on and on it really gets on my nerves and comes off as annoying. Anyways though this movie was interesting had a decent plot, and I enjoyed it.",
      "review_date": "2011-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In my opinion, this just about pips The Godfather to the seat of the best Gangster movie ever made and why? For one it's all based around the real lives of Henry Hill and the others who appear in this fine piece of film making and TommyIn my opinion, this just about pips The Godfather to the seat of the best Gangster movie ever made and why? For one it's all based around the real lives of Henry Hill and the others who appear in this fine piece of film making and Tommy DeVito. I like knowing that some of my favorite movie characters actually existed, it gives some kind of fufillment knowing that the events this film depicts actually happened. Like I said, the other reason is the character Tommy DeVito, played wonderfully by Joe Pesci who won an Oscar he really deserved for his perfomance, he was an amazing and psychopathic character.",
      "review_date": "2011-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies and the best gangster movie. The blue ray DVD version is epic. The extras has a interview with the Henry Hill played by Ray Liotta and there is an option to play the movie with Henry Hill and the fed that set him up inOne of the best movies and the best gangster movie. The blue ray DVD version is epic. The extras has a interview with the Henry Hill played by Ray Liotta and there is an option to play the movie with Henry Hill and the fed that set him up in witness protection narrating together. EPIC.",
      "review_date": "2013-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not nearly as good as it is made out to be. I recently rewatched goodfellas and found it over long and discovered the film has no actual story but simply it's goal is to portray life as a gangster as realistically as possible.",
      "review_date": "2012-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favourite films ever, great storyline, superb cast, Lliota is under rated in his lead role and support cast around him is amazing, De Niro, Pesci, are great. Scorcese at his best. A must watch for any gangster movie lover.",
      "review_date": "2012-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Utterly brilliant. A timeless, flawless masterpiece documenting the rise and fall within an organized crime family. Better than The Godfather. Pesci's performance in this movie is unequaled and mesmerizing. Must watch!",
      "review_date": "2015-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An indisputable classic. An epic tale of the mafia that is intense, funny, entertaining, and acted fantastically. The dialogue, the music, everything is just near perfect.",
      "review_date": "2016-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas is one of the greatest films ever made. It showcases the mob like no other film ever has, even The Godfather. The difference between the two films is this. The Godfather feels scripted professionally, like every line has a place inGoodfellas is one of the greatest films ever made. It showcases the mob like no other film ever has, even The Godfather. The difference between the two films is this. The Godfather feels scripted professionally, like every line has a place in the film. Goodfellas feels wild and ad-libbed, especially by Pesci, who is phenomenal.",
      "review_date": "2012-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis has got to be the greatest movie I'v ever watched and i absolutley love the roll that the fine Ray Liotta plays it just turns me on hahaa  its a MUST SEE KIND OF MOVIE !!!",
      "review_date": "2012-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gangster films don't get much better than this. Martin Scorsese's \"Goodfellas\" is a masterfully made love letter to crime, long form storytelling, and the more complicated elements of Italian-American history.",
      "review_date": "2015-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Possibly the most entertaining gangster movie ever. Goodfellas is based on a novel named Wiseguy (which means the same thing) and is narrated by the character of Henry, who we follow as he enters into the underworld at the age of twelve.Possibly the most entertaining gangster movie ever. Goodfellas is based on a novel named Wiseguy (which means the same thing) and is narrated by the character of Henry, who we follow as he enters into the underworld at the age of twelve.\r Every minute is used to build suspense and drama. The plot follows three relatively small time gangsters_ Henry, Jimmy and Tommy_ who fall way in over their heads with the Mafia and the law enforcement, and the repercussions of this conflict. I found the characters of the latter two especially captivating.\r The direction was mesmerizing. The camera angles used reminiscent of an old beloved era. The dialogue and the voice-over were used in conjunction to propel the plot onwards, skipping over seemingly insignificant details and moving onto more exciting parts of the story like a great novel. The art direction and the soundtrack were spot on and created an atmosphere of the 1970s quite successfully.\r This is a period piece and was stylized only to the extent that it wouldn't spoil the effect that Scorsese set out to create. In essence, by focussing on substance over style, a picture much closer to reality was created. And that was the beauty of the film. Gangsters are interesting of themselves and showing them in their raw form was much more alluring. How they behaved, spoke, lived and settled disputes was shown with painstaking detail. Clearly a lot of research has gone into it.\r Some great movies stick to developing the plot and sometimes succeed in also developing the characters, like The Godfather; others are more successful in relating the sense of the passage of time and have a minimal plot, like The Shawshank Redemption. Goodfellas does both of them. The plot about the trio's troubles with the Mafia and their many heists would have been quite enough for a lesser film, but what makes it truly great is its success in also letting us take a glimpse into the daily lives of these gangsters as the years pass by smoothly from scene to scene.\r No gangster film is complete without a few violent murders and Goodfellas is no different, but Scorsese takes no pleasure in it. He moves away from them gracefully after he's made sure we've seen enough to understand what's going on. I did not find it gory in the least. Scorsese takes a much lighter tone than the more traditional crime movies. There were so many quick-witted quips and retorts, and scenes of pure hilarity, that never for one second does one find themselves in a gloomy and despairing mood.\r We're shown a lot of other characters too, but they only feature to enrich the world of the three main characters and their experiences. We do not linger too long on anyone to drag the narrative to a standstill. Scorsese does this so successfully that despite this, I still managed to find some of the other characters, especially Paulie, quite engaging.\r There are a lot of movies depicting crime but they are deliberately stylized to make the characters likeable but what I loved about this movie was Scorsese did not set out to achieve that but succeeded in this feat only by sticking to reality and depicting gangsters as they had lived themselves. And since these psychopathic beings by virtue of their lack of inhibition were quite charismatic to begin with, this charm seems much more genuine and infects us with their extraordinary personalities.\r All things considered, I think Scorsese has been more than successful in making a perfect film. If I did not have a nostalgic attachment to the story and characters of The Godfather, even though it was released sixteen years before my birth, I would have jumped on the bandwagon without a second thought in hailing Goodfellas as the finest gangster film, and perhaps the greatest film ever, of all time.",
      "review_date": "2013-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Martin Scorsese's classic tale of mob life in New York City is a stunning, vivid look at the ugliness and depravity of a subculture that has been glamorized, sanitized, and romanticized in countless other films. This is the real deal. NothingMartin Scorsese's classic tale of mob life in New York City is a stunning, vivid look at the ugliness and depravity of a subculture that has been glamorized, sanitized, and romanticized in countless other films. This is the real deal. Nothing prepares an audience for the raw amorality and insanity of this crew. No movie has better shown how the \"goodfellas\" create a community wholly isolated from the rest of society by its own warped values and staggeringly amoral code. In scene after scene, Scorsese and his team bring this magnetic evil to life.",
      "review_date": "2013-11-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie ever.  Everything from the story is so amazing. And like I said best movie ever and my favorite too\rRobert De Nitro, Joe Pesci, and Ray Loitta did an amazing job",
      "review_date": "2013-05-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Describe a classic is a difficult task as it evaluates more, but to avoid spoilers and save time can translate this film in three words: elegance, rise and fall together, his only flaw is its time duration over which for some can become aDescribe a classic is a difficult task as it evaluates more, but to avoid spoilers and save time can translate this film in three words: elegance, rise and fall together, his only flaw is its time duration over which for some can become a little tiring, but its qualities the consecration as the best gangster movie since The Godfather, because its soundtrack is hesitant and almost unbroken which helps keep the climate and the performances are very good especially Pesci doing a mad man and corrupted by power",
      "review_date": "2013-12-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest gangster films of all time! Just short of the godfather (my favorite flick ever) but not by much and like the godfather there is more than one oscar winning performance here (deniro, pesci, liotta, and bracco) they allOne of the greatest gangster films of all time! Just short of the godfather (my favorite flick ever) but not by much and like the godfather there is more than one oscar winning performance here (deniro, pesci, liotta, and bracco) they all deserve it to me.. maybe my second favorite film ever next to the godfather",
      "review_date": "2013-12-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is as classy as it gets.\rGoodfellas is undoubtedly Martin Scorsese's best film. It is one of  the greatest gangster films of all time, many believe it to be better than The Godfather.\rGoodfellas is based on a true story. Direction isIt is as classy as it gets.\rGoodfellas is undoubtedly Martin Scorsese's best film. It is one of  the greatest gangster films of all time, many believe it to be better than The Godfather.\rGoodfellas is based on a true story. Direction is pure genius, the narration in the film is excellent and the acting is brilliant.\rScorsese has made many good films   Raging Bull, The Departed,The Aviator, Taxi Driver  but GOODFELLAS  is the greatest of them all.",
      "review_date": "2013-07-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas is a 'true' picture; unlike some mob movies, it doesn't glorify organized crime, per se, it captures it perfectly on-screen.\r The key in the success of Goodfelas is the dialogue. The script is just absolutely amazing. As profaneGoodfellas is a 'true' picture; unlike some mob movies, it doesn't glorify organized crime, per se, it captures it perfectly on-screen.\r The key in the success of Goodfelas is the dialogue. The script is just absolutely amazing. As profane and raw as it is, it really gives you a glimpse of how gangsters actually work and what they actually do. There's no denying the realistic nature of the film and how Scorcese's genius puts this film on the same level as \"The Godfather\", if not better.\r The characters in this movie are captivating. De Niro's calm, collected character is offset by Pesci's loose cannon, loud-mouthed performance. Pesci definitely deserved the Oscar he won for this role, as he plays a character that is sick, as shown by his actions, yet likable all the same. That just shows what a great actor Pesci is.\r Liotta gets Henry Hill down perfectly. His performance is one of the best in his whole acting career. He is innocent, yet violent; quiet, yet he has a temper at times; calm, yet crazy; his personality contradicts itself throughout the movie, yet this isn't a bad thing. In fact, it makes his character *that* much more interesting to watch.\r Overall, this Oscar Winning, highly acclaimed picture deserves all the hype it gets: it's smart, realistic, and raw. These elements combine to form one of the best Gangster movies ever made. And yes, I think it is even better than \"The Godfather\".",
      "review_date": "2013-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of the best martin scorsese movies ever made and absolutely one of the greatest mafia movies ever produced in the hole history, i like that movie a lot",
      "review_date": "2014-03-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies of all time.  As all ways Martin Scorsese does not disappoint. This is defiantly the best mob movie ever made. Just truly amazing.",
      "review_date": "2014-01-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A classic mafia movie that is very accurate according to a former mafia boss. For me this is one of De Niro's, Pesci's and Liotta's, respectively, their greatest performance I've watched.",
      "review_date": "2014-01-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"For as long as I can remember I always wanted to be a gangster. To me that was better than being president of the United States.\" The opening lines of Goodfellas couldn't have set up what was to follow any better. This is without a doubt\"For as long as I can remember I always wanted to be a gangster. To me that was better than being president of the United States.\" The opening lines of Goodfellas couldn't have set up what was to follow any better. This is without a doubt \"The Godfather\" of gangster films.",
      "review_date": "2015-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas is undoubtedly one of greatest movies of the 1990s, This motion picture has very smart dialogue, great direction and superb performances by Joe Pesci, Robert De Niro, Ray Liotta and Lorraine Brasco and a good supporting cast.Goodfellas is undoubtedly one of greatest movies of the 1990s, This motion picture has very smart dialogue, great direction and superb performances by Joe Pesci, Robert De Niro, Ray Liotta and Lorraine Brasco and a good supporting cast. Goodfellas is the best movie of the 1990s",
      "review_date": "2014-05-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely brilliant piece of art. Joe Pesci gave his best performance ever and the Scorsese's genius made me hold my breath until the very end. This film is one beautiful masterpiece!",
      "review_date": "2014-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "On Wikipedia, this film is described as \"the best film ever made\" for a reason. An absolutely riveting and upstanding true story with a knockout cast make this film an absolute masterpiece. If you are an action, drama, horror... I don't careOn Wikipedia, this film is described as \"the best film ever made\" for a reason. An absolutely riveting and upstanding true story with a knockout cast make this film an absolute masterpiece. If you are an action, drama, horror... I don't care what kind of films you may like, you cannot live without seeing this.",
      "review_date": "2014-06-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Now that the film simply too good. I did not expect to like so much. Honestly till the end I never realized it was based on reality. Movie masterpiece.",
      "review_date": "2014-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This amazing gangster tail is jam-packed with action, f-bombs, and quality film making. With Martin Scorsese at his best, this film tops \"mean streets\", and \"hugo\" by far. Great acting, great writing, great movie.",
      "review_date": "2014-08-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "'Don't worry-don't worry!'\rA very entertaining and dramatic film. While I feel as though it dragged on a bit, the ending burst into life. Not quite at the level of 'The Usual Suspect' or 'LA Confidential' but a gritty Scorsese mob dash.'Don't worry-don't worry!'\rA very entertaining and dramatic film. While I feel as though it dragged on a bit, the ending burst into life. Not quite at the level of 'The Usual Suspect' or 'LA Confidential' but a gritty Scorsese mob dash. Great dialogue, top accents and no shortage of depth into an intriguing period of American history.\rRecconmended for Godfather tragics-c'mon be a wise guy!",
      "review_date": "2015-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not the best gangster film. The greatest movie of all time. Period.\r 24 years later and nothing has come close since, if The Irishman is half as good it will be phenomenal.",
      "review_date": "2014-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It even Challenges the Godfather if not triumphs over it as one of Scorsese's greatest Achievements. It is truly one of the greatest films to ever hit the screens.",
      "review_date": "2015-01-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A masterpiece of Cinema, Scorsese's crime classic Goodfellas is an example of filmmaking at its finest. Filled with 4 terrific performances, a great soundtrack and classic moments such as the fantastic opening sequence. Goodfellas is one ofA masterpiece of Cinema, Scorsese's crime classic Goodfellas is an example of filmmaking at its finest. Filled with 4 terrific performances, a great soundtrack and classic moments such as the fantastic opening sequence. Goodfellas is one of the finest gangster films in cinematic history. An all time classic crime film from beginning to end.",
      "review_date": "2015-03-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a classic. The quintessential MOB movie. Interesting because none of the main characters are actually in the MOB.  This film stands on a pillar to all influenced by films of this genre. From directors to actors, curious onlookers toWhat a classic. The quintessential MOB movie. Interesting because none of the main characters are actually in the MOB.  This film stands on a pillar to all influenced by films of this genre. From directors to actors, curious onlookers to actual gangsters, this film is more a documentary than a mere movie. Celebrating its 25th anniversary it still is as influential as it became the summer of 1990. Hailed by notorious film critics Siskel and Ebert as \"the greatest MOB mover ever\". The two critics often disagreed but when it came to \"Goodfellas\" they shared a rare collaboration of positive notions as to the direction of the ever influential Martin Scorsese as well as great performances by Ray Liotta, Robert Deniro, and Joe Pesci whom took home a gold statue as best supporting actor.\rI recently read an article that caught my eye about the making of Goodfellas. It is in the most recent May 2015 issue of Playboy magazine. It tells of the numerous walkouts at the preview screening. Irwin Winkler, the films high powered producer says in an interview \" People started running out of that theater like the place was on fire,\" \"we had 38 walkouts alone after the scene where Joe Pesci's character Tommy DeVito, knifes the body of Billy Batts in the trunk of a car. And that was just the beginning of the movie.\" \"The screening didn't go badly it was disastrous.\" Funny that this was the reaction the night of screening. I wonder what the people who walked out that night think of this movie now? Obviously it was a different time but nonetheless this movie is now immortal. Fun fact to prove this point, Goodfellas holds a place in the Library of Congress's National Film Registry. If you are unaware the film registry is a prestigious list of culturally, historically, or aesthetically significant films. Even the much more modern MOB portrayal HBO hit \"The Sopranos\" owes its creative roots to Goodfellas. The shows creator David Chase has acknowledged his debt to the film, saying, \"Goodfellas is the Koran for me\".\rPersonally, this film moves me a great deal. Having grown up watching it, I still find it interesting. I have literally watched the film hundreds of times yet find new chuckles every time I watch it. I find particular joy in the event I am able to share this all time great with an unfamiliar audience. It is a violent movie yes, but also an unfolding drama and love story of epic proportions. Depicting the rise and fall of an Irish-Italian American street thug whom eventually becomes a real life Mafia insider. Every time I pop it in my VHS player I smile. Yes VHS, it gives it even greater charm I assure you. In conclusion this movie is not to be missed and worth re-watching year after year.esumptuous to say it will remain MOB film for decdes to come. It is always funny to me that people assume the MOB is a thing of the past. I suppose you just don't hear much about it anymore. I always joke to people they didn't disappear, they just went to Congress! HA! With that being said I will leave you with the infamous first line of narration: \"As far back as I can remember, I always wanted to be a gangster.\"",
      "review_date": "2015-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Almost every filmmaker in the history of cinema would be thrilled by the knowledge that a feature of his (or hers) is considered an undisputed classic - a benchmark by which other, similarly themed movies are judged. Director Martin Scorsese,Almost every filmmaker in the history of cinema would be thrilled by the knowledge that a feature of his (or hers) is considered an undisputed classic - a benchmark by which other, similarly themed movies are judged. Director Martin Scorsese, considered by many to be the finest American film craftsman working today, can claim a unique distinction - he has been responsible for a classic during each of the last three decades of the 20th century. In the '70s, it was Taxi Driver. In the '80s, it was Raging Bull. And in the '90s, it was Goodfellas (the most lauded, at least in terms of official awards and nominations, of the director's features). No one else, not even greats like Ingmar Bergman, Stanley Kubrick, and Eric Rohmer, can make a similar claim. With patience, care, and strict attention to detail, Scorsese has staked out an impregnable position in the history of motion pictures.\r It is not a coincidence that Scorsese's three masterpieces all star Robert De Niro. These two men, who have worked together eight times, bring out the best in each other. Even their \"lesser\" collaborations, such as Casino and The King of Comedy, possess an energy and intensity that shows how well they understand one another. Scorsese is at his best when directing De Niro, and De Niro is at his best when being directed by Scorsese. The pair has become inextricably linked in the public consciousness because of Taxi Driver, Raging Bull, and Goodfellas.\r There are essentially two kinds of Mafia movies: those that romanticize the life and those that depict it with gut-wrenching clarity. The best known and most accomplished of these films, The Godfather, stakes out its territory firmly in the first area, leaving Goodfellas to stand atop the other. Both pictures have fully realized, three dimensional characters and strong atmospheres, but Francis Ford Coppola's effort embraces the mythos of the gangster, while Scorsese's exploration is more pragmatic. Violence is a key component of each, but it is a more brutal companion in Goodfellas than in The Godfather. Clearly, the different approaches adopted by the directors result in films that, while populating the same genre, are dissimilar in temperament and tone.\r Goodfellas is, as we learn at the very beginning, based (however loosely) on a true story. Developing the screenplay's skeleton from the events related in the novel Wiseguy by Nicholas Pileggi (who also co-wrote the script), Scorsese has used the facts from an infamous '80s case involving an important mob informant to develop a rich and multi-layered study of three characters and the culture that shaped their lives. It's a fascinating exploration of a lifestyle that has beguiled Americans for most of this century, whether in movies, in novels, or on television.\r Goodfellas is as compelling and absorbing as any crime drama I have ever seen. The script shows all the facets of these characters; they are all fully developed individuals capable of great good and great evil. The moral ambiguity of their lifestyle is treated with a shrug. Goodfellas is not about Mafia dons, but about those who exist on a lower level. It's about the bonds that are formed between compatriots in crime, and how betrayal is the most heinous offense imaginable. The mob is a fraternity - an all-boys club where everyone looks after each other.\r The story, which spans a quarter of a century, has an epic feel despite its intimate perspective. The first forty minutes, which detail Henry's childhood and his acceptance into mob life, is presented almost as a fairy tale, using the same kind of romanticized approach embraced by The Godfather. The purpose of this segment is to forge a bond between the audience and the main character while he is still relatively innocent. Henry does not grow up to be a nice man, but, because of the way Scorsese has structured the early portions of the film, we remain sympathetic to him throughout.\r Over the years, few directors have exhibited Scorsese's ability when it comes to using pop music to set a scene or cement the atmosphere. On many occasions, the appropriation of period songs seems like a transparent attempt to sell the movie's soundtrack album. But, in Goodfellas, Scorsese's selection of \"Then He Kissed Me\", \"Ain't That a Kick in the Head\", \"Gimme Shelter\", \"Monkey Man\", \"The Magic Bus\", \"What Is Life\", and dozens of others proves to be invaluable. The songs mesh perfectly with the visuals, successfully taking the place of a strong score.\r Film critics will argue over which represents Scorsese at his best - Taxi Driver, Raging Bull, or Goodfellas. Each movie has its fierce advocates, but to single out one at the expense of the other two seems to be a pointless and counterproductive enterprise. Taxi Driver and Raging Bull are more focused on an individual than Goodfellas, which examines how a culture shapes values, life choices, and relationships.",
      "review_date": "2015-05-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best Martin Scorsese Film Ever He knows how to direct his films\rI remember watching this and I was so impressed by how well this is done Pesci De Niro are fantastic",
      "review_date": "2015-08-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas was and is one the best Mafia Movies of all time.Martin Scorsese did very realized and thorough depiction of life seen through the eyes of main character Henry Hill (played by Ray Liotta) through the 1950's to 1980's. It doesn'tGoodfellas was and is one the best Mafia Movies of all time.Martin Scorsese did very realized and thorough depiction of life seen through the eyes of main character Henry Hill (played by Ray Liotta) through the 1950's to 1980's. It doesn't matter what  part of the Country you are from,because you will live and see as Henry saw events.The supporting cast that in Robert Di Niro and Joe Pesci are at the top of their craft as far as acting is concerned.As A matter of fact everyone on the Movie acted superbly and without fault whatsoever.It's A absolute classic and although it is not A literal interpretation of Henry Hill's actual life the key moments are still there and it still stands the test of time as one of the best Movies ever made and I will continue to watch it from beginning to end every single time I have the opportunity to watch it.",
      "review_date": "2015-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas is one of the best gangster movies of all time. Definitely my favorite gangster movie. Joe Pesci nails it. What a crazy Son of a B*****!. If you like gangster movies, then its a must see.",
      "review_date": "2015-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas has everything a mafia film should have and then some. Great casting, memorable scenes, humor, twists, violence and that obvious Scorsese feel. Easily one of the best.",
      "review_date": "2015-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simply, an amazing film, a great glimpse in the life of an otherwise secluded society. The constant feeling that all this could be real, that's what makes it so great.\r It's such a fine reflection of the mafia culture, the actors are fitSimply, an amazing film, a great glimpse in the life of an otherwise secluded society. The constant feeling that all this could be real, that's what makes it so great.\r It's such a fine reflection of the mafia culture, the actors are fit perfectly their roles and the scenes are so natural. Surprise and urgency are the two main emotions which define the movie constantly. Although the main turning points are predictable (after all, that the mafia quietly takes that rattles everyone out), they are are still masterfully done. All is well acted with no signs of hesitation nor mercy. It's a clinical performance.\r Also, the obsessive psychological inspection of the characters, the carefully developed plot and they way everything makes sense in the end are all the reasons for a straight 10. This is, hands down, straight 10.\r Overall, a great movie, one of the best contributions to the western cinema.",
      "review_date": "2015-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas is a must-see for everyone who's a Goodfellas and related films fan. To include a bunch of characters in my review, I'll type all of this information in to reach to the 150 character limit.",
      "review_date": "2016-02-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "EXCELLENT\rOne of the best mafia movies and one of Martin Scorsese's Best.\rI like how this film is not just about mafia, it's also about how your personal life interferes with your life into mafia and vise versa.\rA truly work of a master.",
      "review_date": "2016-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Almost every filmmaker in the history of cinema would be thrilled by the knowledge that a feature of his (or hers) is considered an undisputed classic - a benchmark by which other, similarly themed movies are judged. Director Martin Scorsese,Almost every filmmaker in the history of cinema would be thrilled by the knowledge that a feature of his (or hers) is considered an undisputed classic - a benchmark by which other, similarly themed movies are judged. Director Martin Scorsese, considered by many to be the finest American film craftsman working today, can claim a unique distinction - he has been responsible for a classic during each of the last three decades of the 20th century. In the '70s, it was Taxi Driver. In the '80s, it was Raging Bull. And in the '90s, it was Goodfellas (the most lauded, at least in terms of official awards and nominations, of the director's features). No one else, not even greats like Ingmar Bergman, Stanley Kubrick, and Eric Rohmer, can make a similar claim. With patience, care, and strict attention to detail, Scorsese has staked out an impregnable position in the history of motion pictures.\r It is not a coincidence that Scorsese's three masterpieces all star Robert De Niro. These two men, who have worked together eight times, bring out the best in each other. Even their \"lesser\" collaborations, such as Casino and The King of Comedy, possess an energy and intensity that shows how well they understand one another. Scorsese is at his best when directing De Niro, and De Niro is at his best when being directed by Scorsese. The pair has become inextricably linked in the public consciousness because of Taxi Driver, Raging Bull, and Goodfellas.\r There are essentially two kinds of Mafia movies: those that romanticize the life and those that depict it with gut-wrenching clarity. The best known and most accomplished of these films, The Godfather, stakes out its territory firmly in the first area, leaving Goodfellas to stand atop the other. Both pictures have fully realized, three dimensional characters and strong atmospheres, but Francis Ford Coppola's effort embraces the mythos of the gangster, while Scorsese's exploration is more pragmatic. Violence is a key component of each, but it is a more brutal companion in Goodfellas than in The Godfather. Clearly, the different approaches adopted by the directors result in films that, while populating the same genre, are dissimilar in temperament and tone.\r Goodfellas is, as we learn at the very beginning, based (however loosely) on a true story. Developing the screenplay's skeleton from the events related in the novel Wiseguy by Nicholas Pileggi (who also co-wrote the script), Scorsese has used the facts from an infamous '80s case involving an important mob informant to develop a rich and multi-layered study of three characters and the culture that shaped their lives. It's a fascinating exploration of a lifestyle that has beguiled Americans for most of this century, whether in movies, in novels, or on television.\r Goodfellas is as compelling and absorbing as any crime drama I have ever seen. The script shows all the facets of these characters; they are all fully developed individuals capable of great good and great evil. The moral ambiguity of their lifestyle is treated with a shrug. Goodfellas is not about Mafia dons, but about those who exist on a lower level. It's about the bonds that are formed between compatriots in crime, and how betrayal is the most heinous offense imaginable. The mob is a fraternity - an all-boys club where everyone looks after each other.\r The story, which spans a quarter of a century, has an epic feel despite its intimate perspective. The first forty minutes, which detail Henry's childhood and his acceptance into mob life, is presented almost as a fairy tale, using the same kind of romanticized approach embraced by The Godfather. The purpose of this segment is to forge a bond between the audience and the main character while he is still relatively innocent. Henry does not grow up to be a nice man, but, because of the way Scorsese has structured the early portions of the film, we remain sympathetic to him throughout.\r Film critics will argue over which represents Scorsese at his best - Taxi Driver, Raging Bull, or Goodfellas. Each movie has its fierce advocates, but to single out one at the expense of the other two seems to be a pointless and counterproductive enterprise. Taxi Driver and Raging Bull are more focused on an individual than Goodfellas, which examines how a culture shapes values, life choices, and relationships. Taken together, these three offer insight into the themes and ideas that are closest to Scorsese's heart. Taken individually, each represents an amazing motion picture accomplishment, with Goodfellas standing alongside The Godfather as one of the two greatest mob stories told on film.",
      "review_date": "2016-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Almost every filmmaker in the history of cinema would be thrilled by the knowledge that a feature of his (or hers) is considered an undisputed classic - a benchmark by which other, similarly themed movies are judged. Director Martin Scorsese,Almost every filmmaker in the history of cinema would be thrilled by the knowledge that a feature of his (or hers) is considered an undisputed classic - a benchmark by which other, similarly themed movies are judged. Director Martin Scorsese, considered by many to be the finest American film craftsman working today, can claim a unique distinction - he has been responsible for a classic during each of the last three decades of the 20th century. In the '70s, it was Taxi Driver. In the '80s, it was Raging Bull. And in the '90s, it was Goodfellas (the most lauded, at least in terms of official awards and nominations, of the director's features). No one else, not even greats like Ingmar Bergman, Stanley Kubrick, and Eric Rohmer, can make a similar claim. With patience, care, and strict attention to detail, Scorsese has staked out an impregnable position in the history of motion pictures.\r It is not a coincidence that Scorsese's three masterpieces all star Robert De Niro. These two men, who have worked together eight times, bring out the best in each other. Even their \"lesser\" collaborations, such as Casino and The King of Comedy, possess an energy and intensity that shows how well they understand one another. Scorsese is at his best when directing De Niro, and De Niro is at his best when being directed by Scorsese. The pair has become inextricably linked in the public consciousness because of Taxi Driver, Raging Bull, and Goodfellas.\r There are essentially two kinds of Mafia movies: those that romanticize the life and those that depict it with gut-wrenching clarity. The best known and most accomplished of these films, The Godfather, stakes out its territory firmly in the first area, leaving Goodfellas to stand atop the other. Both pictures have fully realized, three dimensional characters and strong atmospheres, but Francis Ford Coppola's effort embraces the mythos of the gangster, while Scorsese's exploration is more pragmatic. Violence is a key component of each, but it is a more brutal companion in Goodfellas than in The Godfather. Clearly, the different approaches adopted by the directors result in films that, while populating the same genre, are dissimilar in temperament and tone.\r Goodfellas is, as we learn at the very beginning, based (however loosely) on a true story. Developing the screenplay's skeleton from the events related in the novel Wiseguy by Nicholas Pileggi (who also co-wrote the script), Scorsese has used the facts from an infamous '80s case involving an important mob informant to develop a rich and multi-layered study of three characters and the culture that shaped their lives. It's a fascinating exploration of a lifestyle that has beguiled Americans for most of this century, whether in movies, in novels, or on television.\r oodfellas is as compelling and absorbing as any crime drama I have ever seen. The script shows all the facets of these characters; they are all fully developed individuals capable of great good and great evil. The moral ambiguity of their lifestyle is treated with a shrug. Goodfellas is not about Mafia dons, but about those who exist on a lower level. It's about the bonds that are formed between compatriots in crime, and how betrayal is the most heinous offense imaginable. The mob is a fraternity - an all-boys club where everyone looks after each other.\r The story, which spans a quarter of a century, has an epic feel despite its intimate perspective. The first forty minutes, which detail Henry's childhood and his acceptance into mob life, is presented almost as a fairy tale, using the same kind of romanticized approach embraced by The Godfather. The purpose of this segment is to forge a bond between the audience and the main character while he is still relatively innocent. Henry does not grow up to be a nice man, but, because of the way Scorsese has structured the early portions of the film, we remain sympathetic to him throughout.\r For character-based dramas such as Goodfellas to rise above the level of a well-crafted melodrama, strong acting is a necessity, and this movie contains several unforgettable lead performances plus solid support by those in lesser roles. The most flamboyant portrayal is turned in by Joe Pesci as the often out-of-control Tommy. Pesci won an Academy Award for his work here, crafting a character that can be charming at times and unexpectedly violent at others. (Pesci virtually replicated this part for Scorsese's Casino.) The brilliance in the performance is how easily and rapidly Tommy shifts from one mode to the other. A single minor thing - an action, a word, etc. - can set him off. Pesci makes the sudden transition seem credible rather than jarring.\r Taken individually, each represents an amazing motion picture accomplishment, with Goodfellas standing alongside The Godfather as one of the two greatest mob stories told on film.",
      "review_date": "2016-03-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas is a pure masterpiece. There is no other movie like it, when it comes to gangster flicks. There is never a dull moment, and it keeps you on the edge of your seat the entire length of the film. Goodfellas is Scorsese, De Niro,Goodfellas is a pure masterpiece. There is no other movie like it, when it comes to gangster flicks. There is never a dull moment, and it keeps you on the edge of your seat the entire length of the film. Goodfellas is Scorsese, De Niro, Pesci, and Liotta at their finest. This is a must see for any fans of gangster movies, or just movies in general.",
      "review_date": "2017-10-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If every Gangster film would have been like this Scorsese classic, it would have been so much fun.Quite an evocative and thought-provoking Gangster flick.",
      "review_date": "2017-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "So ... Scorsese is a mobster, right? There is no way he can come up with a movie like that without being in the know. It's brilliant.",
      "review_date": "2020-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After this one I'm done with mob movies. WOW, it's sooo interesting, that your characters sniff coke the entire time, and look how bad they are! They even kill people, my god look how dramatic it is how they cheat on their wives! I don't evenAfter this one I'm done with mob movies. WOW, it's sooo interesting, that your characters sniff coke the entire time, and look how bad they are! They even kill people, my god look how dramatic it is how they cheat on their wives! I don't even know anymore, it's not as boringly infuriating as The Irishman, but I'll refrain from watching this type of movies from now on.",
      "review_date": "2020-09-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas is the ultimate mob/gangster/crime film from 1990 and directed by Martin Scorsese. The director named Scorsese has gone on to make many movies including Casino which may follow on from Goodfellas but that may be highlyGoodfellas is the ultimate mob/gangster/crime film from 1990 and directed by Martin Scorsese. The director named Scorsese has gone on to make many movies including Casino which may follow on from Goodfellas but that may be highly controversial and I may be wrong. Casino has some of the same actors like De Niro and Pesci and the same director so it's similar to Goodfellas and so how it was made too. ..... The main actor in Goodfellas is a guy named quite politely Henry Hill played by Ray Liotta, other characters are Jimmy Conway played by Robert De Niro and whatever Pesci's character was called, Tommy I think. The film revolves mainly around violence and family issues aswell as a few gangster scenes, a scene where an old friend insults Tommy (Joe Pesci) at a bar, says sorry and Tommy comes back later and with his friend Jimmy Conway (De Niro) beats the **** out of him on the floor after he insulted Tommy to the point where he's a bloody mess then dump him in the boot of a car then later stab him is genuinely one of the best scenes in this movie. There are many well made violent scenes but there's a few problems with Goodfellas and one is Lorraine Bracco who plays Henry Hill's wife because all she does is moan, cry, whinge, shout, yell and be absolutely annoying and you just want to knock her out. The other problem is that Goodfellas centres too much around family involvement and family issues which makes the film more boring than is necessary for a 18 rated violent movie, some of the characters are silly and even unlikeable. I thought drug use in the movie was a good idea but being mainly centred around family and family issues weakened it for me and having kids and babies star in an adult, graphic violent movie shot the director in the leg on this masterpiece. It just didn't work and Lorraine Bracco is unlikeable as Henry Hill's wife and even Henry Hill (Ray Liotta) is a bit dull or over the top at times. Joe Pesci was excellent in Goodfellas, Robert De Niro could of been much better but the violent scenes were good with plenty of blood. However mostly I found Goodfellas to be boring, bit too long with annoying Lorraine Bracco in it which is just absolute torture to sit through and experience and that annoying kid at the beginning of the movie who played a young Henry Hill putting petrol or gasoline over cars and setting them alight so all the cars explode into a ball of fire then running away was totally unnecessary. Mostly a bland, dull, boring movie with some annoying characters, some good characters, some horrible songs played throughout the film, some good violent scenes but nothing special and a bit gloomy.... Could of been much better a film.",
      "review_date": "2020-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Goodfellas is an amazing film, pitch perfect in every detail. Scorsese tells the rise and fall of Henry Hill with the ease of talent and panache that only years in the industry can bring. This film feels like a real look at the world of theseGoodfellas is an amazing film, pitch perfect in every detail. Scorsese tells the rise and fall of Henry Hill with the ease of talent and panache that only years in the industry can bring. This film feels like a real look at the world of these men, with each of our main characters fully fleshed out to the point where we understand them all perfectfully. Helped along by Thelma Schoonmaker working at her best, there isn't a frame that feels out of place.",
      "review_date": "2020-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest gangster movies ever made.The 2 1/2 hour runtime flys by in this captivating masterpiece.The best movie of 1990.",
      "review_date": "2021-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Both the first time I saw it, and seeing it again after many years, I find this film decidedly unpleasant. Thelma Schoonemaker's masterful editing doesn't make up for a story that gets extremely repetitive and boring in the second part.Both the first time I saw it, and seeing it again after many years, I find this film decidedly unpleasant. Thelma Schoonemaker's masterful editing doesn't make up for a story that gets extremely repetitive and boring in the second part. Definitely unpleasant characters. The violence in this film is never measured and finalized but always over the top for the sole purpose of entertaining the audience. The movie remains full of skilled directing but it turns out to be a barely watchable movie for my tastes.",
      "review_date": "2021-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is simply a masterpiece, from the cast to the storytelling...everything!",
      "review_date": "2009-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its a very good film that I love it as my best.",
      "review_date": "2010-02-03",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 111,
  "genres": [
    "Biography",
    "Drama",
    "Crime"
  ]
}