{
    "title": "The Thin Man",
    "rating": 0.0,
    "release_date": "1934-05-25",
    "num_reviews": 187,
    "genres": [
        "Comedy",
        "Crime",
        "Mystery"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "The first of the series, and one of the best",
            "content": "\"The Thin Man\" introduces film audiences to the Dashiell Hammett characters Nick and Nora Charles, portrayed by one of the great screen couples, William Powell and Myrna Loy. MGM was very surprised when the film, for which they had no ambitious plans, became a huge hit and even garnered four Oscar nominations.This Nick and Nora have very little to do with Hammett's Nick and Nora, and it's just as well. William Powell and Myrna Loy created a lively, fun, loving couple that's all their own. The two actors worked better together than probably any other team - they're the non-dancing Astaire and Rogers. Loy's entrance into this film - she's dragged by Asta into a bar while she's balancing Christmas gifts and ends up flat on her face - is one of the best. Nick is pretty much smashed through most of the movie - people drank a lot more in those days. Powell manages to be elegant, funny, smart, warm, and do slapstick - sometimes all at the same time. Asta has a helluva time keeping up with them.A very pretty Maureen O'Sullivan costars as a young woman whose father is missing and then is suspected of killing his ex-wife - that's for starters. He seems to be on a killing spree. Though Charles hasn't been involved in detective work in four years, she begs him to help her. After a visit from the police in the middle of the night, Nora asks Nick, \"Are you going to take her case?\" \"Take it?\" Nick asks, reaching for the booze. \"I'm in it!\" Highly recommended for first-class chemistry, wit, humor, a good mystery, and overall enjoyment.",
            "review_date": "2006-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "William Powell and Myrna Loy are a fun couple",
            "content": "Nick Charles (William Powell) is a former detective who returns to NYC with his new wife Nora (Myrna Loy) and their dog Asta after 4 years in California. He's happily retired after Nora's father left them a fortune. His friend inventor Clyde Wynant has mysteriously disappeared after he confronts his secretary Julia Wolf about $50k in missing bonds. Clyde's ex-wife Mimi (Minna Gombell) is looking for more money but finds a dead Julia Wolf instead. Clyde becomes the prime suspect. Clyde's daughter Dorothy (Maureen O'Sullivan) refuses to believe it. Nora convinces Nick to take the case after gangster Joe Morelli barges in on them.William Powell and Myrna Loy are terrific together. Their dialog is quick and snappy. It's loads of fun. If anything, this movie needs more of them. That's my only complaint. The movie takes too long to get to them as it concentrates on Wynant and the murder. The murder mystery works well but not necessarily anything original. This is simply a fun couple and the movie is best with both of them on the screen.",
            "review_date": "2014-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waiter, will you serve the nuts? ... I mean, will you serve the guests the nuts?",
            "content": "The Thin Man is directed by W. S. Van Dyke and co-written by Albert Hackett and Frances Goodrich. It is based on the Dashiell Hammett novel of the same name. Starring are William Powell and Myrna Loy, with support coming from Maureen O'Sullivan, Nat Pendleton, Minna Gombell, Porter Hall and Skippy as Astra the dog. William Axt scores the music and James Wong Howe is the cinematographer.Plot finds Powell and Loy as married couple, Nick and Nora Charles, he is a retired detective, she a good time heiress. Planning to finally settle down, their life is upturned when Nick is called back into detective work due to a friend's disappearance and the possibility he was also involved in a murder. Murder, malarkey and mirth are about to become the order of the day.It was the big surprise hit of 1934. Afforded only a tiny budget because studio head honcho Louis B. Mayer thought it was dud material, and he ordered for it to be completed in under three weeks time! Film made stars out of Powell and Loy and coined an impressive $2 million at the box office. Also birthing a franchise (5 film sequels and a radio and television series would follow), it's a film that has irresistible charm leaping out from every frame. It's easy to see even now why a mid 1930's audience could take so warmly to such an appealing motion picture.From the off the film was in good hands, Dyke (One-Take Woody as he was sometimes known) was an unfussy director with a keen eye for pacing and casting, both of which are things that shine through in this production. There's also considerable talent in the writing, both in the source material and with the script writers. Hammett based his witty bantering couple on himself and his relationship with playwright Lillian Hellman, this was ideal material for Hackett and Goodrich, themselves a happily married couple fondly thought of in the cut and thrust world of Hollywood. As a couple they would go on to write It's a Wonderful Life for Frank Capra and win the Pulitzer Prize for their play The Diary of Anne Frank.It stands out as a film of note because it successfully marries a murder mystery story with a screwball comedy spin, this was something new and exciting. While the believable relationship between Powell and Loy was also a breath of fresh air - a married couple deeply in love, devoted, funny, boozey and bouncing off of each other with witty repartee. It can never be overstated just how good Powell and Loy are here, true enough they are given an absolutely zinging script to work from, but the level of comedy, both in visual ticks and delivery of lines, is extraordinarily high.Small budget and a small shoot, but everything else about The Thin Man is big. Big laughs, big mystery and big love, all bundled up into a joyous bit of classic cinema. 9/10",
            "review_date": "2011-07-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great fun--and probably the best of the genre",
            "content": "1934 was a super-important year. That's because up until then, Myrna Loy's rise to fame was very slow. While her parts had improved, she still was a second-tier actress (at best) until this great film catapulted her to fame. It was also an important year because it marked the premier of the best romantic-comedy-mystery films of all time--all thanks to the movie THE THIN MAN.So why is this such a special film? Well, the writing and chemistry are just perfect here. William Powell and Myrna Loy were absolutely perfect together--with amazingly witty and fast dialog. The only other film that might be better in this regard is HIS GIRL Friday. Asta the dog also provided some welcome comedy relief as did the supporting characters--they were just great. Never before or sense did Hollywood get it so right. Even with the wonderful follow-up Thin Man films, they never quite reached the same pinnacle of success.On top of all these positives, the mystery itself was excellent--something that, unfortunately, often gets lost in these style films.Give yourself a treat and watch this film. If you are hooked, and I assume you will be, then try watching the entire series. Too bad they didn't make even more of these wonderful films.",
            "review_date": "2008-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The first in a great series of mystery films",
            "content": "This is one of my favorite movies from any decade. William Powell and Myrna Loy have such chemistry together and their expressions during their verbal sparrings are priceless. Under different circumstances it might be easy to dislike Nick and Nora Charles - they are the idle rich who spend their time overindulging in alcohol, having loud parties, and destroying their own property with air rifles at a time (1934) when much of America was starving through the worst part of the Great Depression. On top of that, Nick makes no secret of how appealing his wife's money is to him. However, the intricate plot, the couple's clever dialogue, and their chemistry draw you in and make their world even seem somewhat normal.The Thin Man refers to Clyde Wynant, a somewhat absent-minded inventor, the chief suspect in what turns out to be three murders, and someone who only actually appears in the first 15 minutes of the film, never to be seen afterwards.The Charles' get caught up in the mystery of Wynant's disappearance because his daughter Dorothy (Maureen O'Sullivan) is an old friend of Nick's and asks Nick for his help. Wynant has told his daughter that he is going off somewhere secret to work on an invention so that nobody can steal it from him, but promises he will be back before Christmas so he can be present at her wedding. However, Wynant has never resurfaced and nobody has heard from him. Nick initially has no interest in continuing his former occupation of detective - he is much more interested in having a good time - until a series of circumstances and his own wife's urging draw him into the mystery and back into his role as private detective.The film is full of unsavory yet interesting characters. Wynant's family is truly dysfunctional. His son is an oddball bookworm obsessed with abnormal psychology, his ex-wife has remarried a gigolo who appears to be hiding a questionable past and finds the idea of working for a living insulting, and Wynant's girlfriend is a very greedy and aging ex-flapper who steps out on Wynant with other men whenever she thinks he isn't noticing. The only virtuous characters in the film seem to be Wynant's daughter and her fiancé. In short, there is no shortage of possible suspects and worthy victims. Even the police in the film are unappealing - they are very good at getting rough with people and performing illegal searches, but not very quick on finding clues or making even obvious deductions. The constantly semi-inebriated Nick Charles has no problem running circles around them and turns out to be both brave and brilliant in his role as sleuth.I recommend this film to anyone who likes a good murder mystery laced with a bit of dark comedy.",
            "review_date": "2009-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sleuthing Among The Rich and Famous",
            "content": "Though five sequel films were made from this very popular original there are still to this day people who will answer the question who is the Thin Man with William Powell.The answer of course is Edward Ellis, an inventor whose disappearance gets a recently retired detective named Nick Charles to solving a case where three murders are committed almost in spite of himself. Ellis is a tall and very skinny man, hence the title.One thing I always liked about The Thin Man. The formula never varied, MGM didn't believe in tampering with success. It was always that Nick and Nora Charles get dragged almost kicking and screaming into some homicide. Nick is always four jumps ahead of the police be it Nat Pendleton or Sam Levene. Two or three other murders are committed before the solution is arrived at. And always the gathering of the suspects at the end when Nick lays it all out for them, the cops and we the audience. And of course Nora whose help except for moral support is somewhat dubious.One thing that was cut down on was Nick's alcoholic consumption. The Thin Man just beat it under the wire with The Code and as the Charles had a baby in later stories, it wouldn't do to have one of the father role models in America be a complete drunk all the time.I always liked the fact that in all The Thin Man stories the murderer is never obvious. A twist in the plot could have made any one of the suspects the guilty party.The Thin Man was nominated for Best Picture and Oscar nominations were given out to William Powell, director Woody Van Dyke, and screenwriters Goodrich and Hackett for adapting Dashiell Hammett's original story. Unfortunately The Thin Man ran up against It Happened One Night and got skunked out of all the top prizes.But amazingly enough Myrna Loy was not nominated for Best Actress. In fact the woman NEVER got an Oscar nomination. If there was every a case where the chemistry between the leads made a film, The Thin Man was it. How you could nominate Powell and not Loy is beyond me.But that's Hollywood for you. The Thin Man is a fresh today as it was over 70 years ago.",
            "review_date": "2006-11-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great fun",
            "content": "A great comic murder mystery that relies on the acting and snappy dialog and less on the plot, which otherwise is a standard whodunit from a novel by Dash Hammett. Powell, Loy and O'Sullivan give it their all as society people caught up in a trashy murder involving Mrs. Tarzan's zany scientist dad. Were it not for these three, the film would likely be unwatchable today. They are nicely supported by an army of bit players doing their best Runyon-esquire impressions as felons and thugs who all seem to have a passion for Powell's Nick Charles, ex-cop and now the gin-swilling husband of millionairess Loy. The story takes place at Christmastime in Manhattan, which gives it a nice sense of time and place even though it was clearly shot on Hollywood sound stages. No one apparently planned on a followup, but the movie proved so popular, the entire production team was back in place two years later for the only slightly less captivating AFTER THE THIN MAN, this time set in California on New Year's Eve.",
            "review_date": "2010-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nick and Nora drink a little...",
            "content": "Nick Charles, a retired detective, and his beautiful wife, Nora, return to New York for the holidays, and a bit of socializing. Nick and Nora love to drink a little. Nick is awakened from his pleasant life, when Dorothy Winant comes to ask for his help in finding her missing father, an inventor.Dashiell Hammett, the mystery writer, wrote serious crime novels, but in the delightful \"Thin Man\" series, he is playful, as he is never too serious about the cases he gave his captive audience. The film was directed by W. S. Van Dyke, a man that clearly had a good feeling for the material. Albert Hackett and Frances Goodrich marvelous adaptation of the novel contributed to make this motion picture into one of the most beloved works of that era.It helped that MGM had two of its best stars in the leading roles. William Powell was one of the best actors of that era, and he was born to play Nick Charles, a man that appreciated a good martini, or any drink, for that matter. Equally excellent was Myrna Loy, a woman who had great chemistry with Mr. Powell. Her Nora is a sophisticated lady who was at home with an elegant crowd, as well as with low class scoundrels her husband investigated.Also in the cast, a good Maureen O'Sullivan as the gorgeous Dorothy Winant. A young Cesar Romero also made an impression as the lover of the inventor's former wife. The director got fine ensemble playing from his supporting cast, notably, Nat Pendleton, Minna Gombell, and Natalie Moorhead, among others, and let's not forget Asta. James Wong Howe photographed the movie with his usual style.\"The Thin Man\" is still delighting after more than seventy five years since it was produced.",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Puts modern movies to shame",
            "content": "\"The Thin Man\", a deliciously superb mix that keeps getting richer becomes better with every single viewing. The first time I missed a bit of the murder plot, but repeated viewings just enhance the movie.\nIt has started making me wanted to go out, get a terrier and call it Asta, drink too much for my own good and become a private eye detective. And move to New York. The lovable couple make it all look fun, and even if they do drink too much. Only after I have snapped out of admiration mode for the movie I remember that they were highly paid actors following a script in a hit film of 1934, and I'm living in the year 2000, cannot get a dog, am living in Sydney, and worst of all, I'm fourteen, so I can't drink or become a detective. Such is the modern manner of the movie. It is one of the very few films of its time that retains its freshness, intrigue and brilliant humour. William Powell and Myrna Loy are incredibly likeable, the wisecracking darlings of society who we all want to know. Their performances were both absolutely brilliant! Some of their antics are a good deal wilder than those we are used to, but in fear of being caught up in murder would keep me away from them, but not long enough. I don't believe there are any shallow characters at all. Thank goodness for \"The Thin Man\". One of the first to show an affectionate couple in love, I'm still scanning for the same in movies of the 50s. W.S Dyke is of course not one of the most remembered directors of his time, but for this alone he could be considered a great director. He was not Alfred Hitchcock, but he successfully combined high comedy, crime and thrills into one film. No wonder the major film studios were hot after this property.  And Dyke didn't have to rely on the excruciatingly hilarious elements of slapstick. A married couple and a dog was all that was needed. Such a simple thing to emphasise on, and how well it worked! Could there be a more stolen plot of today?Unfortunately, MGM, despite creating one of the best teamings of the era by putting the platonic Powell and Loy together, released this film in 1934. A nominee for Best Picture, Actor and Director, among other things, it was Capra's \"It Happened One Night\" that made history by becoming the first film in history to sweep the five major categories at the Oscars. If it had been released in 1933, it would have beaten the now forgotten \"Calvacade\", in 1935 it may have swept some Oscars up against \"Mutiny on the Bounty\". I wonder why Loy was not nominated. The film simply could not have been done without her.Powell and Loy went on to make many movies together. Asta, appeared again as George in the 1938 slapstick masterpiece \"Bringing Up Baby\".\nAlthough we need some good movies now, no one should even think contemplate for a split second on a remake. There is no way justice could be done to this film. It is a comic masterpiece that continually tricks the viewers, and without a doubt, one of the very best and brightest movies of the 1930s.\nI hope I can watch the other \"Thin Man\" movies. I will definitely be reading the book. The film ended half an hour ago, but I already feel like going back for a second helping. Rating: 10/10",
            "review_date": "2000-01-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "'The Thin Man' is still as fast-paced, stylish, sexy and hilarious as it ever was",
            "content": "Where to begin? I guess I'll start off by saying that this is one of my favorite films of all time. I first saw it on TV years ago (I was probably eleven or twelve) and I still totally love it. Every time I see it, I feel like I get more out of it. I feel like I see AND hear more than I did before.The story goes that creepy Clyde Wynant (wonderful character actor Edward Ellis) wants to give some bonds to his daughter Dorothy (Maureen O'Sullivan) as a wedding present. But his mistress Julia (Natalie Moorhead) has gotten rid of them. When Julia turns up murdered, Wynant is the obvious suspect, but nobody can find him.Enter Nick and Nora Charles (William Powell and Myrna Loy), a detective and heiress, just recently married, and clearly very much in love. Nick finds himself pulled into the case, with everyone around him urging him into it. He's reluctant: it's his honeymoon after all. But sure enough he's persuaded to take the case, solves it and exposes the murderer at a climactic dinner party.Bill Powell and Myrna Loy have astounding chemistry. As husband and wife, they are equals, equally hard-drinking, equally witty, equally fun-loving. They have the same sense of adventure, the same stubbornness, the same competitiveness. In so many scenes, Powell will saw something in his playful, semi-childish, half-drunk sort of way, and Loy will respond with some fabulously delivered retort, in a manner that is almost like a world-wary mother saying to her child 'Now, now, Junior...' It's hard to describe exactly. If anything, I suppose you could say it's deceptively simple. It's one of those things you have to see for yourself.The rest of the cast is good. I particularly love Minna Gombell, Mynant's ex-wife Mimi, with her latin boyfriend (Cesar Romero) and her tight, shiny black dresses with white fur-lined princess sleeves. Slight, ernest and bespeckeled, William Henry turns in a riotous performance as Gilbert, Mimi and Clyde Wynant's son and Dorothy's brother. A Kinsey-lke figure, the role of Gilbert is one of those bookish, overly-analytical Hollywood stock characters who try to explain other character's subconscious reasons for their actions, and who give strangers peculiar looks at parties. Henry makes the character believable, and he stands out as one of the characters in the movie. Gerturde Short, in an uncredited role, gives a good performance as well. Her delivery of the \"I don't like crooks, and if I did like'em...\" line is unforgettable. (If you blink, you'll miss Tui Lorraine Bow, friend and step-mother of It Girl Clara Bow! Bert Roach of The Crowd has a small role as well.)For a modestly-budgeted, rapidly shot, b-level production, The Thin Man is a classy and stylish film. The clothes, assembled by the genial Dolly Tree, are great, and make this a must-see anyone even remotely interested in period fashions. The art deco sets are quite fine, if modest and at times a bit sparse. The editing is good, as is the fairly simplistic photography. Woody Van Dyke, the director, always worked fast, and Myrna Loy recalled that all the movies they worked together on were made at frantic pace. Part of the reason that The Thin Man moves so quickly is the fact that production was so hurried.The Thin Man gets a ten out of ten from me for being one of the best films ever produced, and one of my absolute favorites of all time.",
            "review_date": "2004-07-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Classy, sassy fun",
            "content": "W.S. Van Dyke's 1934 film \"The Thin Man\" stars Myrna Loy and William Powell as Nora and Nick Charles, upper class sleuths who unwittingly become caught up in the case of a missing friend and former client. Nick is a former detective who has been in retirement for the last four years, living the high life with Nora when Dorothy Wynant (Maureen O'Sullivan) implores with them to help find her father, who has been missing for three months. Throughout the investigation, Nick and Nora rarely are without a drink in their hands, are forever trading bons mots and getting themselves into comical situations; they even get their terrier Asta in on their investigation.\"The Thin Man\" is a great detective story that is enhanced by its classiness and humor. Powell is definitely the physical comedian of the pair, with Loy looking stunning and conveying so much with the looks she gives him. I honestly found myself guessing the outcome until the end, which culminates in a deliciously wonderful dinner party where all of the guests are suspects. It is stunning that this film was made in 1934, because it seems so ahead of its time; which is probably just one reason why it is so highly regarded and remains on many critics' lists. \"The Thin Man\" is so thoroughly enjoyable, and its stars (including Asta) are so engaging that I look forward to seeing more in the six-film series. Rent this one or catch it on Turner Classic Movies, like I did. It is well worth seeing, and surely an inspiration to many film genres ranging from screwball comedies to detective stories. A very strong 8/10.--Shelly",
            "review_date": "2005-01-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Now a Manhattan you always shake to fox-trot time, a Bronx to two-step time, a dry martini you always shake to waltz time.\"",
            "content": "With The Thin Man, William Powell and Myrna Loy created what may be the perfect on-screen couple \u0096 Nick and Nora Charles. The two work flawlessly with one another. Their witty quips and playful banter seem so natural. I know that real people don't exactly talk like they do, but it just seems so effortless. Nick and Nora have style to burn. Just watch Nora glide from her bedroom to the front door in her flowing silk nightgown and you'll see what I mean. Their alcohol consumption may be a bit overdone, but it fits their characters. These people can do more after drinking a bottle of gin than most can do completely sober. The plot to The Thin Man hardly matters. These two could make reading the phone book an enjoyable experience. To sum up my ramblings, I love watching Powell and Loy as Nick and Nora.But of course The Thin Man does have a plot \u0096 a murder that Nick wants no part of is literally thrust upon him. Even Nora wants to see him solve the case and, naturally, offers her assistance. There are plenty of suspects \u0096 the dead woman's employer/lover, his kids, his ex-wife, her lover, and a who's who of shady types. In mystery novel drawing room style, Nick gathers everyone together for the big reveal.",
            "review_date": "2005-12-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Hey, would you mind putting that gun away? My wife doesn't care, but I'm a very timid fellow.\"",
            "content": "What a pleasant surprise! Settling myself down to watch 'The Thin Man,' W.S. Van Dyke's highly-suspenseful, hard-boiled detective film, based on Dashiell Hammett's mystery novel of the same name, I had no idea that the film would be a remarkably well-written comedy, with the murders themselves taking second tier to the witty banter of Nick and Nora Charles (William Powell and Myrna Loy). Hilariously scripted, with flawless acting from all involved, 'The Thin Man' is one of the most refreshingly funny films I have seen in a very, very long time.Nick is a retired detective, but he is purported to have been one of the best. Nowadays, he is quite content to sit back, help himself to another martini and pay little mind to the mysteries that may pass his way. When we first sight Nick, he has his back turned to the camera, and he is teaching the bartenders how to properly prepare a martini: \"The important thing is the rhythm. Always have rhythm in your shaking. Now a Manhattan you shake to fox-trot time, a Bronx to two-step time, a dry martini you always shake to waltz time.\"Nora, who can match wits with her husband at any time, is Nick's playful and exuberant wife, always itching for a little mystery and intrigue. The two have the sort of chemistry that we all hope for in a marriage, and is always the most fun to watch on screen. They have a playful understanding with each other; there is no obligatory family discord in this marriage, nor are there any secrets or mistresses (these evils are saved for the less \"perfect\" relationships in the film). Husband and wife take any chance they can to good-naturedly disparage each other and prove their own superiority, and, by the end of the film, they are about at level pegging. Walking into a bar on one occasion, Nora demands to know how many martinis her husband has already consumed. She immediately orders five more to be even with him!The mystery itself is a bit of a muddle, but if you think too hard about it you'll miss all the clever repartee between our two detective spouses. When secretive inventor Clyde Wynant (Edward Ellis, who is the \"Thin Man\" referenced in the title, though most audiences and critics ostensibly referred to Powell's character as such) goes missing, and his former lover (Natalie Moorhead) is found dead, Wynant is considered the prime suspect. Eventually returning from retirement to clear his friend's name, Nick and an enthusiastic Nora enter a web of deceit, lies and betrayal to find the real murderer. Among the possible suspects are Wynant's ex-wife, Mimi (Minna Gombell), Mimi's new partner, Chris (Cesar Romero), a petty thief, Joe Morelli (Edward Brophy) and a shifty criminal, Arthur Nunheim (Harold Huber). Having finally come to a conclusion about who the murderer is, Nick invites all the prime suspects to a dinner party at his place, announcing to everyone at the beginning of the meal, \"the murderer is right in this room. Sitting at this table! (and then to the waiter) You may serve the fish.\"'The Thin Man' was nominated for four Oscars at the 1935 Academy Awards (Picture, Director, Adapted Screenplay, Actor (Powell)), and spawned a respectable five sequels, a 1957 television series and a radio play. It also made a star of Skippy (later renamed Asta), the Wire-Haired Fox Terrier who accompanies the Charles' on several of their clue-finding missions. In terms of pure entertainment value, films do not get much better than this.",
            "review_date": "2007-04-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Can you say all-around classic?",
            "content": "Subtle without being boring, funny without being silly, \"The Thin Man\" shows the best that a movie can be. William Powell and Myrna Loy get the roles of a lifetime as the couple investigating a murder. I especially liked how she sassed him occasionally. And that dinner? One of the cleverest scenes in movie history. And of course I'd be remiss in ignoring their dog Asta. That pooch is a character unto himself (he occasionally appears as an answer in crosswords).I don't know if I'd call it the year's best movie, but it deserved its Oscar nods. If it's from a Dashiell Hammett work, you know that it's gonna be good. I now hope to see the rest of the series. The rest of the cast includes Maureen O'Sullivan (Mia Farrow's mom) and Cesar Romero (a few decades away from playing the Joker).All in all, a great movie in every way. You can't call yourself a cinephile until you've seen this at least once.",
            "review_date": "2018-09-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the booziest films in cinema history",
            "content": "Often said, but still a marvel to watch, even after 72 years. If you want some intelligent fun with that since long vanished Hollywood class, catch this one. This comic murder mystery introduced the world to one of the most perfect screen matches I know, the incomparable duo William Powell and Myrna Loy. Shot by Woody \"one shot\" van Dyke in just twelve days with many of the first takes used in the film, it still comes across as wonderfully fresh. The story revolves around William Powell as detective Nick Charles, who tries to crack the case of a missing scientist, together with his wife Nora (Myrna Loy). But forget about this whodunit aspect of the film, it's not that important. It's just adding to the fun. It's all about the marvellous interaction between Powell and Loy, simply the most wonderful screen pairing ever. Their constant courtship is a marvel to look at and watching the wonderful chemistry burning of the screen leaves me in a pleasant happy daze, slightly intoxicating.They must be one of the very few boozy characters in the history of cinema, that seem to be drunk all the time and be continuously happy at the same time. On a continuous drinking frenzy, they're either perpetually pixillated or fighting the hang-over. Never marry someone who doesn't join you when drinking. Nora certainly does. When they meet up in a restaurant Nora asks: 'Say, how many drinks have you had?'. 'Uhmm, this will make six Martini's.' 'Alright, waiter, will you bring me five more Martini's. You can all line them up right here.' Between the endless string of cocktail parties their lives seem to consist of, he still needs to crack a murder case, as a journalist remembers him. 'Do you know anything about the case?' 'Yes, it's putting me way behind in my drinking.' A stellar supporting cast, a witty script with wonderful dialog, style and class to spare, and most importantly, the one of a kind chemistry between Powell and Loy all contribute to the enjoyment of this film. A real winner.Camera Obscura --- 9/10",
            "review_date": "2006-07-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Witty, Delightful and Charming",
            "content": "In New York, Dorothy Wynant (Maureen O'Sullivan) visits her father, the inventor Clyde Wynant (Edward Ellis), with her fiancé to tell him that she is going to get married. Before traveling, her father opens the safe in his company to get some stock certificates to give as a wedding gift and realizes that his mistress Julia Wolf (Natalie Moorhead) has stolen them. When Clyde vanishes and Julia is killed, his daughter approaches the former detective Nick Charles (William Powell) to investigate the mysterious disappearance. His wealthy wife Nora Charles (Myrna Loy) convinces the reluctant Nick to work on the case, since it would be exciting for their boring life. When two other men are killed and Clyde is accused of murder, Nick invites all the suspects to have dinner with Nora and him and resolves the case, disclosing the real criminal.\"The Thin Man\" is a witty, delightful and charming comedy with a great mystery and many suspects. William Powell and Myrna Loy show a fantastic chemistry and have wonderful lines and situations. The story has no malice and is a clever entertainment. The dog Asta is hilarious. My vote is eight.Title (Brazil): \"A Ceia dos Acusados\" (\"The Supper of the Accused\")",
            "review_date": "2007-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the funniest films ever made...",
            "content": "I am not really a fan of comedies, but I can definitely appreciate a good one when it comes along.  Often times comedies only really work when they are combined with another genre (in the case of this film, the 'hard-boiled detective' film)... and sometimes they achieve brilliance.In what might have otherwise been a sort of mediocre movie, Bill Powell and Myrna Loy breath a phenomenal life into the roles of Nick and Nora Charles, a rich woman and her dandyish (but dangerous) lush of a detective husband. This film entertains on so many levels and establishes (not exploits) so many cliches that it should be mandatory viewing in any introductory film class.The plot of The Thin Man is pretty much peripheral to the performances by Low and Powell, but it is involving in its own way.  Murder, loose women, police brutality (fun police brutality), adultery, polygamy, science, swindles, two dinner parties and drinking... lots and lots of drinking... all combine into one hell of fun movie.  There is even a fair amount of tension in the film and all kinds of great one-liners and set-ups.\nThis is quite simply a phenomenal film, lots of fun (even for Gen Xers like myself), and well worth watching.",
            "review_date": "2000-07-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Classic Film",
            "content": "The film producers of this Thin Man Film never realized this first film starring William Powell, (Nick Charles) and Myrna Loy,(Nora Charles) would be such a great success and would go on and have six other Thin Man series. Nick & Nora Charles are newlyweds very much in love and are going to San Francisco for a honeymoon train ride. However, Nick is a detective and gets himself in a murder investigation in New York City and works with the police to solve a very mysterious story with murders and plenty of twists and turns right to the very end. This film is very fast paced and has lots of comedy with a fox terrier who steals lots of the scenes from the actors. Cesar Romero makes a brief appearance in this film along with Maureen O'Sullivan, (Dorothy Wynant) who was the wife of John Farrow a producer and was the mother of Mia Farrow. In my opinion this is the best of the Thin Man Films, and William Powell and Myrna Loy had a great magic with their performance as husband and wife. Enjoy.",
            "review_date": "2007-12-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'll Drink to That!!",
            "content": "I'm not sure Dashiell Hammet's depiction of Nick and Nora is as boozy as the movie, but it doesn't matter. William Powell and Myrna Loy have some of the greatest chemistry of any duo in film history. Having grown up with an alcoholic, it takes some resilience for me to overlook the way that ninety percent of the movie involves guzzling liquor. That said, we never see a debilitating effect. They are perpetually joyful. He is suave and she is gorgeous. In addition to the way the two interact, this has a great plot and some of the most memorable character actors of the time. Nick has decided that since Nora has more money that one can really deal with in a lifetime, he decides to retire from being a detective. She, on the other hand, longs form adventure. We know, of course, that he is not going to stay away from the case of the wealthy missing man for long. One of the really hilarious scenes is a dinner party where Nick is going to announce who the murderer is, but in an almost Marx Brothers way, it goes on forever, each guest staining at the bit.",
            "review_date": "2015-08-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Delightful mystery",
            "content": "William Powell and Myrna Loy star in this classic screwball comedy cum detective thriller which very much created its own genre. It's based on a book by Dashiell Hammett.They play Nick and Nora Charles. He is a retired detective, she is a wealthy socialite who now resides in LA. During a Christmas trip to New York, the rich and glamorous couple get caught up in the mystery of the disappearance of a wealthy workaholic engineer and factory owner. Added to this, dead bodies turn up and this missing Thin man is the prime suspect.There is a lot of banter and red herrings with a greedy ex-wife, a greedy mistress, various relatives and hangers on related to the mystery of the missing Thin man.Keeping it all together is Powell and Roy plus their dog and plenty of rapid fire repartee casually mixed with high voltage alcohol. In fact I reckon the couple needed to attend AA meetings.I guess The Thin Man films were the inspiration for the 1980s TV series Hart to Hart.It's enjoyable stuff, some of the humour requires knowledge of the time period or else it will fly past your head such as the joke about the Mann Act.",
            "review_date": "2015-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nora's best film.",
            "content": "As other reviewers have indicated this is a cute romantic mystery. Nick & Nora Charles broke new ground with their love bickering. The film is a nice break from the more typical hardboiled detectives of the 20's, 30's and 40's. I think Nora (Myrna Loy) was at her best in this film. She is beautiful. Her cute nose, which as she aged grew less and less cute, and short dark hair came off as very sexy. This is the only film in which her desire to see Nick work as a detective came off as genuine. In the later films it seemed to be a little to scripted. I think my favorite scene is when Joe Morelli broke into Nick and Nora's bedroom. In order to keep Nora from getting shot Nick punches Nora in the jaw to knock her out of the line of fire. As a married man I can tell you Nick got to do what most men wish they could do at some point in time. (jk). Nora takes it like a champ. Instead being upset at Nick she's upset that she missed the action while she was dazed on the floor.While not my favorite THIN MAN movie overall I do think it has the best romantic sparring between Nick and Nora.  The plot is pretty good and the story moves at a good pace.  If you're not familiar with that many 1930's films you'll get a kick out of the 30's lingo, especially some of the womens lingo, in the film.  I don't know if recreational drinking was ever as carefree as it is with Nick but it doesn't come off as hokey and is quite funny.The best thing about the film is the relationship between Nick and Nora.  I wish there were more directors like Van Dyke around today.  He, without lengthy dialogue scenes, was able to capture the love Nick and Nora had for eachother.  He also kept the pace moving.  He was able to deliver in a hour and a half what most directors spend 2 to 3 hours trying to do and not succeeding as well as he does.",
            "review_date": "2004-04-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Unbeatable Pair",
            "content": "Watch out Fred and Ginger, Hepburn and Tracy, Bonnie and Clyde, because Nick and Nora (or should I say Powell and Loy) are hot on your tails as all-time great screen couple.\"The Thin Man\" was the first film to team up William Powell and Myrna Loy as famed sleuthing team, not to mention husband and wife, Nick and Nora Charles. A film like this could only have been made in the 30s--I don't think there's a scene where Powell doesn't have a martini in his hand, and the movie's filled with those sarcastic bon mots that defined 30s screen comedies. Don't even ask me to summarize the plot, because it doesn't matter. The whodunit aspect of the movie is beside the point, and I didn't really care who the killer was, or indeed if the killer was ever even caught.What matters here, of course, is watching the chemistry between Powell and Loy, which practically melts the television screen. William Powell was a sort of Clark Gable with an edge. He looked remarkably like Gable, and he also had that droll way of delivering a line, but he wasn't as much of an everyman as Gable. Myrna Loy is absolutely adorable, one of my favorite actresses from this time period, even though I'm still convinced she was never really used to her full potential. Her appearance in this is as close as any film maker ever came to taking full advantage of her sex appeal, cuteness and comedic flair, but even at that she too often takes a back seat to Powell.And of course special mention must be made of Asta, giving one of the best performances ever delivered by a canine in a motion picture.The later films in the \"Thin Man\" series weren't ever able to recapture the magic of this first installment, but that would be a difficult feat for any movie.Grade: A+",
            "review_date": "2005-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Say hello to a very interesting couple.",
            "content": "This screwball comedy/murder mystery launched a very successful series that pleases with each viewing. William Powell is Nick Charles, a semi-retired detective that ends up in the middle of murder capers that are solved with the aid of his lovely wife Nora played by Myrna Loy. This charming couple love their alcoholic refreshments and that is part of the running comedy. Their dog Asta shares in the comic relief. A missing man(William Henry) and his stolen bonds are the center of this episode that would later be followed by five other popular movies. Also in the cast is:Maureen O'Sullivan, Nat Pendleton, Cesar Romero and Minna Gombell.",
            "review_date": "2003-06-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nick & Nora's first romp. A classic comedy whodunnit!",
            "content": "William Powell and Myrna Loy share a wonderful chemistry in this very close adaptation of the Dashiell Hammet novel. The interplay between Powell & Loy comes off very natural, as if they WERE married.Nick is a lovable lush with a sharp mind and Nora is rich beyond imagination, with a freshness and innocence not found in today's movie characters. The film has plenty of site gags with some occasional drama interspersed.All of the characters are made believable by the actors and the direction is superb. The plot revolves around the disappearance of Prof. Wynant and everyone seems to be involved in helping him stay missing. Nick reluctantly takes the case and the fun really gets going. Plenty of misdirection keeps you guessing \"whodunnit\". The now classic gathering of all suspects lets you know. A really odd family, some \"shady\" characters, and William Powell/Myrna Loy's acting make this one great! This is the first in The Thin Man series, and, in my opinion, the best.Rated 10 in my book. A must see for fans of comedy and classics.Where are these kinds of movies nowdays?",
            "review_date": "1999-09-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A classic that I think has held up well",
            "content": "As a child I loved The Thin Man. True some of the plot went over my head but I loved the characters, clothes, performances and writing. I think today at 19 it has held up, and the plot makes much more sense to me now. The production values are very stylish, with sets especially that do look great, the clothes look amazing and the cinematography is excellent. The script is hilarious and witty, WS Van Dyke's direction is right on the money, William Axt's score is suitably jaunty and the two lead characters are likable and the epitome of style and sophistication. The acting is fine, William Powell and Myrna Loy are both brilliant and make a sizzling couple, and when it comes to the support acting, which I had no problem with either, Edward Ellis stands out as Clyde Wynant, and to me the film is never dull because of the script and the leads being so good. Overall, a great film and I will always revere it as a classic. 10/10 Bethany Cox",
            "review_date": "2011-05-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"The murderer is right in this room. Sitting at this table. You may serve the fish.\"",
            "content": "Former detective Nick Charles (William Powell) has come out of retirement to investigate the case of a missing inventor whose wife has just been found murdered. Nick is reluctant to get back into the sleuthing business but his wife Nora (Myrna Loy), a wealthy heiress, thinks it's all very exciting and pushes him to solve the case. The first of a wonderful series of comedy-mysteries. Possibly the best. Based off of Dashiell Hammett's last novel. Nick and Nora would become the trademark roles for Powell and Loy. This first entry in the series is excellent and one of the finest detective films made in the '30s. The wonderful comedy is a great plus. Nice support from Maureen O'Sullivan, Nat Pendleton, Edward Ellis, Cesar Romero, and many more. Just a fantastic cast with a great script and fine direction from Woody \"One Take\" Van Dyke. The Thin Man series was also one of the best at the wrap-up segments where all the suspects are gathered together at the end as the detective explains what happened (to them and to us, the viewers). These parts of detective movies are always either exciting and fun or boring and talky. This series always managed to be fun.",
            "review_date": "2014-04-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"The murderer is right in this room, sitting at this table..., you may serve the fish.\"",
            "content": "An eccentric inventor has disappeared and his mistress secretary has turned up dead, after admitting that she has taken fifty thousand dollars worth of bonds from his shop safe. Enter Nick and Nora Charles (William Powell and Myrna Loy), newlyweds who get pulled into the case in between social gatherings and martinis - \"A dry martini you always shake to waltzes\".This is the first entry in \"The Thin Man\" series, named for the gaunt and wiry inventor Clyde Wynant. All signs point to Wynant himself as the murderer, especially after two more victims turn up. But Nick Charles isn't buying it, there are too many suspects - Joe Morelli, a hood that Wynant catches in his secretary's apartment, Wynant's ex-wife Mimi (Minna Gombell) who's always asking for more money, her new husband Chris (Cesar Romero), the suspicious Tanner, Wynant's bookkeeper, and Herbert MacCaulay, his lawyer. Seemingly uninterested in the case, Nick wryly digests the events that unfold following Wynant's disappearance, exchanging snappy banter with wife Nora. One is caught off guard when Nick actually slugs his wife to prevent her from catching a bullet from the gun of Morelli, who comes to the Charles apartment to plead his innocence. To catch the murderer, Nick invites all the suspects to a dinner party, where he methodically reveals what he knows, waiting for an opening for the real killer to expose himself. It's all delightfully done, and Nick doesn't miss a beat for a second. \"The Thin Man\" holds up exceedingly well for it's seventy plus years of age, and is a classic comedy/mystery achievement, showing up on many \"best\" lists. Do give it a try, and it may wind up on yours as well.",
            "review_date": "2004-10-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waiter, will you serve the nuts? I mean, will you serve the guests the nuts?",
            "content": "Nominated for four Academy Awards, it had the misfortune of going up against It Happened One Night. It is still the quintessential detective movie, and a very funny one at that. Even the dog was hilarious.The Thin Man (Edward Ellis) exemplifies the adage, \"There is no fool like an old fool.\" He trusted his secretary (Natalie Moorhead) and she fleeced him, or worse.Nick (William Powell) and Nora (Myrna Loy) are roped into finding out what is going on when a body turns up. Well, Nora does a lot of the roping.Outstanding ending where the murderer is caught. Gotta see the next one.",
            "review_date": "2009-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Former detective is working on a case...of scotch!",
            "content": "Comically-sparring married couple Nick and Nora Charles manage to solve a murder mystery while retaining their upper-crust charm and sophisticated etiquette. Hugely popular bit of screwball hasn't dated too badly, with stars William Powell and Myrna Loy very loose and charismatic. Followed by five sequels, this mixture of slapstick and suspense nearly loses its balance, yet the screenplay (by Albert Hackett and Frances Goodrich, from Dashiell Hammett's book) manages to keep it all on an even-keel. Powell, in particular, is well-attuned to the changing rhythms of the handling and easily steals his scenes. **1/2 from ****",
            "review_date": "2009-02-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Slightly squiffy and altogether spiffing",
            "content": "What an enjoyable romp of a film. You'd barely know that Hollywood had only a few scant years before, graduated to the \"Talkies\", so sharp and prolific is the dialogue in this loosely adapted take on Dashiell Hammett's novel. The plot has more kinks in it than a slinky and while the denouement is well handled in classic style with all the suspects assembled improbably around Powell and Loy's Depression-busting dinner service, it's all pretty secondary to the lead players' obvious chemistry and the devilment in their performances. Powell is engaging and endearing as the soak-cum-detective, with neither a drink or barbed witticism ever far away from his lips. Myrna Loy is lovely in some great costumes, by turns irreverent and doting on Powell. The rest of the cast invest their roles with personality and colour and the direction is tidy and to the point. Particularly, I admired the camera perspective shot at the dinner-table scene along with notable use, post Eisenstein, of a montage sequence, amongst other devices, to keep the action moving at a fair clip. The film though is best remembered and rightly celebrated for its racy dialogue. The early Christmas Eve scene in Powell and Loy's apartment recalls nothing so much as vintage Marx Brothers while both my and Powell's eyebrows shot to the ceiling with Loy's insouciant comment to the police busy searching their apartment in the early morning, when she cracks \"What's that man doing in my drawers?!\" There's plenty more of that \"Roaring Thirties\"-type dialogue besides, presumably pre-Hays Code with the amusing climax (no pun intended) at the finish when it's obvious that the couple are not going to be sleeping in the separate bunks provided in their train's overnight berth, (perhaps even influencing Hitchcock's similar ending to \"North By Northwest\", where The Master further accentuated the obvious with a shot of Cary Grant and Eva Marie-Saint's train entering a tunnel!). I don't even mind the dog, for goodness sake and I usually hate animals in films! In summary, a film as sparkling and flavoursome, no doubt, as the numerous glasses of champagne that are quaffed in this great early 30's classic.",
            "review_date": "2008-06-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "look up 'Charming-as-all-heck Detective Movie\" in the dictionary",
            "content": "You couldn't make The Thin Man the way they did it back in 1934. For one thing, the book by Dashiell Hammett - which I have to imagine the filmmakers were faithful as could be within a 90 minute run time - has as its two main heroes characters who love their booze. There's only so many moments that you see Nick (William Powell) without a drink, or looking for one, and Nora is only so far behind (though Nick is certainly more the booze-hound). Nowadays, a producer would look at material like that and want to take it out. And yeah, in reality, being a drunk or the \"A\" word (alcoholic) isn't much fun. But this was the movies and Hollywood and 1934 after all! This is a world where a hangover isn't necessarily glossed over completely - see as Nick is in bed after the Christmas party and has to get another drink to make himself, uh, 'regular', and of course has to get Nora one right after he comes back to bed. But... yeah, it's a comedy after all.The Thin Man is a glorious escapist movie, and a riot at times. The story itself is fine enough, a solid, mostly serious yarn about an engineer (the 'Thin Man' of the title actually) who goes missing, and a woman he was seeing is found dead. Who killed her? Where is Clyde Wynant? Did he commit the murder and go off with money and skip town? There's a lot of questions to be answered, to be sure - it is Hammett, after all, the author of The Maltese Falcon and all those Continental Op thrillers. But that's not why the film is still fresh today, maybe even better by the passage of time like wine, because of the characters and the snappy dialog.By the 'characters' I do mean mostly our leads, Nick and Nora, though the supporting characters - played by the likes of Maureen O'Sullivan, Nathalie Moorehead and the original Joker himself Cesar Romero - are perfectly fine and acted memorably. They are a catty couple of people, and are constantly kidding themselves, though certainly are very seriously in love. They're the kind of couple who, when Nora walks in and sees Nick trying (little as he really can given his disposition) to give comfort to a sorrowful Dorothy, they make faces at one another to kill the tension. Outstanding comic timing. And speaking of not being able to do certain things today as in 1934, the moment where, to distract a heavy holding a gun on the two of them, Nick slugs Nora so he can then get HIS gun away! Whether this was right before the Code fully took effect, I'm not sure, but it wouldn't surprise me (the innuendo at the end is perfectly cute, though I'm sure rather scandalous also for 34).There are so many juicy and awesome moments between these two that it's little wonder they went on to make five more films over the course of fifteen years, and the public thought the actors were married in real life (!) The chemistry enough would make it a crackerjack semi-screwball comedy, though what levels it out as a great film of its year is that the director, WS Van Dyke, and the screenwriters, make some indelible set pieces. The Christmas dinner party, for one, really gets the audience fully immersed into the quick wit and here-to-there-and-again timing of a party where everybody wants a drink, one guy really wants to call home to his mother, and everyone keeps hounding Nick Charles to take on a case after being away from the sleuthing for years. This alone would make the movie a must see - but that ending, where everybody involved with the case is brought in so that Nick can crack it (he even admits, you know, he isn't entirely sure to Nora, who can do nothing but make spectacular quips) pushes it over into classic territory.When The Thin Man wants to be suspenseful, it can be as well. When Nick has to go looking in a dark place after hours and someone is coming in, all the lights go off and it takes on the air of an early noir. This, again, really is necessary though, and Van Dyke really makes sure that the more dramatic elements work in their vein, the comedy in its own, but that the two sides can meet, rather deliriously and uproariously into a charming package of a Hollywood movie. It's the kind of movie that I'm sure inspired Hitchcock, too, with the younger brother obsessed with morbid crimes and bodies; notice the reaction of the police when he offers to help them with forensics work. Again, 1934 people.",
            "review_date": "2015-02-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An unexpected boon to Dashiell Hammett",
            "content": "Dashiell Hammett constructed five novels and many short stories, all dealing with crime and detection. They were based on his work as a Pinkerton Detective, which gives them a gritty realism that lifted them from the more forgettable mystery novels of the 1920s like S.S.Van Dine's \"Philo Vance\". Up to Hammett's time American mystery novelists would try to copy the styles of British mystery novelists. Perhaps the most original type of mystery writer in America was Mary Roberts Rinehart, who constructed the \"Had I but known\" school in which a naive heroine is swept into a romance or marriage with a handsome, dashing type, who turns out to be a secret killer or fortune hunter or generally evil type. It actually worked - and influenced other writers (the type of story is found in variations in such movies as THE SPIRAL STAIRCASE or UNDERCURRENT). It worked for Rinehart, who used her massive profits to help build up the publishing house. But Hammett was willing to show the real crime in urban American. He also was able to have a clean writing style, and even toyed with symbolism on a limited scale (like how he turns \"the Thin Man\" of this story into a slenderer and slenderer figure until he is actually a skeleton).Another thing that Hammett brought in was his political sympathies. He hated being a paid goon for the rich as a Pinkerton operative. So some of his stories (RED HARVEST, for instance) is about the underlying labor/capital tensions in an industrial town. There are traces about this in THE THIN MAN, where Nora likes Nick's lowlife friends - the antithesis of the snobs she grew up with.In 1934 he was living in California with the woman who would be his lover until his death in 1961: dramatist Lilian Hellman. He was approached to write a novel for a large sum of money. Most of his work he carefully thought out, but this was a pot boiler. He did not realize that it would be the biggest best seller of his career (yes, even more than THE MALTESE FALCON). THE THIN MAN is basically a fantasy. Most of the detectives in his other stories are hard working poor guys like Sam Spade or \"the Continental Op*\" [*for Operative]. Here Nick Charles was the hard working poor guy detective, but he married Nora, an heiress. So he retires from detecting and is managing her properties. Nora, by the way, is based on Lillian's personality (supposedly).There is more comedy in the story than in most of the others (think of THE GLASS KEY for a more typical Hammett plot). There is also more drinking, which was, unfortunately, the situation in the Hammett - Hellman household. And the plot was complicated and clever: where did the inventor disappear to? Did he murder his thieving mistress? Or did anyone else cause the murder? With a cast headed by William Powell and Myrna Loy (actually the first time they were paired as the leads, as opposed to MANHATTAN MELODRAMA that they shared with Clark Gable) they were both brilliant as a realistic married couple. In fact they would play a perfect married couple in five more \"Thin Man\" films, and four other movies as well. The rest of the cast, Maureen O'Sullivan, Minna Gombell, Porter Hall, Nat Pendleton, Harold Huber, Edward Ellis, and Ed Brophy were fantastically good too. Under Woody Van Dyke's skillful direction they created a great detective film. And they gave Dashiell Hammett further film work for over a decade.",
            "review_date": "2006-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The first, and the best, in a very good series",
            "content": "There's a story, perhaps apocryphal, that when Ian Fleming was first introduced to the actor who would bring his 007 to life in \"Dr. No,\" his immediate reaction was a loud and emphatic, \"Oh, NO!  Anybody but HIM!\" Luckily, of course, no one paid him any attention, and a largely unknown actor and former bodybuilder named Sean Connery was off and running toward stardom. Likely enough, had anyone thought to run the idea of William Powell as Nick Charles past Dashiell Hammett -- always assuming, somewhat blithely, that the author would have been sober at the moment -- his reaction would have been identical to Fleming's years later.  Powell, insouciantly dapper and suave, almost as slender as the silly mustache he affected, was virtually the complete antithesis of Hammett's concept of Charles, the hard-drinking, two-fisted former New York detective who married an heiress much younger than he and yet somehow managed to remain uncorrupted by his good fortune. Yet Powell -- as would Humphrey Bogart several years later, when similarly physically miscast as Sam Spade in the third film version of \"The Maltese Falcon\" -- went on to make the character of Nick Charles so totally his own that even today, six films and almost sixty years later, it is well-nigh impossible to envision anyone else in the role. Powell was always at his best when playing opposite a strong leading lady -- i.e., Rosalind Russell, Carole Lombard, Irene Dunne -- yet he was never better than when paired with Myrna Loy as Nora in the six \"Thin Man\" films. Every bit his equal at the backchat and martini-tossing, Loy proved the perfect collaborator in making the Charleses lovely people to visit (but you wouldn't want their livers) time and time and time again.  Particularly in this, the adaptation of Hammett's novel, which created the audience demand for the ensuing series. And which also shows that, even if you do consult the writer, it's not necessarily wise to give him/her final approval over casting.",
            "review_date": "2001-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "First rate",
            "content": "Combination murder mystery/comedy with lighthearted couple of Nick (William Powell) and Nora Charles (Myrna Loy) solving the disappearance of inventor Clyde Wynant (Edward Ellis)--he is tall and thin, hence the title.  And they have an adorable dog named Asta (who does help solve the case). \nThe legendary movie that was shot in 2 weeks and turned into a huge hit.  It moves VERY quickly...there's TONS of exposition in the first 45 minutes, was made on the cheap (it shows) and has mostly terrible acting--surprisingly even Maureen O'Sullivan and Cesar Romero are terrible in this.  BUT the script is incredible--very smart and very funny.  And Powell and Loy are in top form--they're really enjoying themselves and it rubs off on the audience.  The movie also moves so fast you can ignore the bad acting--especially by Minna Gombell (she's truly horrendous).  And it's beautifully shot too.My only complaint--the constant drinking by Nick and Nora.  It's portrayed as cute and charming...back then it was.  Today it makes them look like severe alcoholics.That aside this is a GREAT film.  A 10 all the way!",
            "review_date": "2004-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "He didn't come anywhere near my tabloids.",
            "content": "Never have I had the opportunity to witness such an entertaining hour and a half of cinema as I did with The Thin Man. Upon viewing (due to a suggestion from my father), I have a whole new respect for the films made in the 1930s as well as the widely unknown works of director W.S. Van Dyke. This film was an amazing blend of comedy, who-dun-it, and satire combined into a surprisingly short 93 minutes. The charm and wit of the characters, the classic mystery nestled between, and the surprising ending helped create this coveted piece of work. I can honestly say this; I have seen several films come through the Hollywood machine over the years, yet none can compare to the excitement that I experienced watching this film for the first time. I cannot wait to watch it again. It reminded me of my first viewing of the widely hysterical television series entitled Are You Being Served? The dialogue was extremely smart and seemed to break the boundaries of that era's cinema.I will be perfectly honest, if anyone had approached me prior to my viewing of this film and asked if I knew who William Powell was, I would have given them the classic \"stare into the darkness\" look. Now, I cannot wait to revisit other pieces of his work. He defined and created the film version of the Thin Man better than I have witnessed any modern day actor do. He took a simple story, a murder mystery that would have been dull otherwise, and transformed it into this satiric comedy about sex, booze, and women. It was a transformation that I was not ready for, which only heightened my overall experience of this film. While some credit has to go to Van Dyke, I applaud William Powell. His sharp tongue, his irresistible charm and charisma, and his chemistry that he had with everyone in this film, especially his wife, Nora (Myrna Loy). The scenes that these two share show us how two people can have fun on a set, define themselves, as well as show us a new standard for the Hollywood married couple. They broke boundaries in cinema, while continuously showing us that no media is needed to expand their hype \u0085 a la Mr. and Mrs. Smith. Powell and Loy carried this film and skyrocketed it past the average point and into one that will remain deeply rooted within your mind as you watch other films of the same genre.The Thin Man is another perfect example of what happens when good actors create great characters in a film that could have just passed through the average shelves. After witnessing the power of Powell and Loy, you cannot help but also see that others in the film are trying to reach their excitement. There is just this aura of \"fun\" and a new level of quality that is nearly absent in so much of what Hollywood today has to offer. I am a true believer that if you have actors that want to be in the film, they give their full 100% and it shows through the screen, then the others will follow suit. It is those films where the key players only give 10%, or we rely heavily on special effects that ultimately the film suffers. That was not the case here at all.Finally, I would like to say that this film doesn't suffer from aging at all. I thought that when I placed it into my player that I would be constantly reminded of how old this film was. Knowing that it was made in the late 1930s, I thought that the jokes and comments would be dated and, perhaps less funny. I couldn't have been more wrong. The jokes had me laughing, the circumstances had me roaring, and the fabulous connection between Nick and Nora had me glued to the screen. This film had everything in place and executed it correctly. While the era was dated, the jokes were not. The words from Powell's mouth seemed refreshing and utterly hysterical. I was impressed, and it kept me glued to the screen throughout the entire film! Overall, I couldn't have been happier about this movie. This is what the cinema is all about. Taking a classic story, adding in some refreshing and powerful characters, and keeping your audiences guessing until the final moment. The Thin Man was one of those films where I didn't know who-did-it until it was revealed. Imagine a funny film with a great caper that gives nothing away until the final climactic moment. I know to some that seems imaginary, but friends, I witnessed it here with The Thin Man. So, go grab your favorite girl, your best martini, and expect to have an exceptional two hours of monumental cinema! Grade: ***** out of *****",
            "review_date": "2005-07-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "First in a Series...",
            "content": "After hearing of his daughter's upcoming wedding, a scientist goes to recover his savings for a wedding present. It's missing! Shortly after accusing his secretary of stealing it, the scientist goes missing, too... who has the money, and where is the scientist? The father and daughter are opposed to the idea of a \"big church wedding\", calling it \"all that fuss\". The mother, divorced from the father, disagrees. I find this interesting that divorce and non-church weddings are such casual talk in 1934. There is also excessive drinking.Beautiful cinematography -- stark contrasts, long shadows. For all the advantages of color, there are some things monochrome still does better, and this film proves it.Nick Charles is a wonderful detective, sort of like Adrian Monk without the mental illness. There are plenty of witty remarks, though they are subtle. The film is clearly intended to be humorous, though not a comedy. How to classify the film then becomes a mystery. The film itself is a mystery, but not straight up drama or even film noir.",
            "review_date": "2010-12-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Forget the plot, enjoy the banter.",
            "content": "Never mind trying to follow plot, instead follow the banter between Nick and Nora Charles, as portrayed by William Powell and Myrna Loy in this delightful comic mystery. Between the banter and the sexual innuendoes, the constant guzzling and shennanigans, this sophisticated couple actually do manage to solve a murder or three. This seventy year old film still holds up well today and the reason is that the screenwriters knew how to write dialogue and character and were not dependent on action sequences to fill in the blanks like so many of today's screenwriters and directors, who are too busy chasing the big dollar to make a movie that is going to stand up over time. How many of today's action movies will we be watching seventy years from now? Admittedly, there is some clumsy acting by some of the minor characters, at least viewed from today's point of view, but don't let that, like the plot, get in your way or you will miss out on what this charming film has to offer. And say, who was that Thin Man, anyway?",
            "review_date": "2004-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Precocious, Adorable, and Irascible.",
            "content": "This movie is a delightful start to a stellar romantic comedy detective series. The principals involved are awesome, as they realistically demonstrate the intimate relationship between two balanced and mentally healthy people with a great sense of humor and inner strength.Honestly, these are so fun. They are heart warming and endearing, and give a great couple of hours' entertainment. This IS black and white, and retro-dated. Totally period, and beautifully sentimental in a nonchalant kind of way that Chevy and Goldie never captured in Fowl Play, but touched upon in Seems Like Old Times.MacMillain and Wife was pretty good, but still not of the caliber. Hart to Hart had some of this kind of magic, but only to a superficial depth. Cybil and Bruce had a bit of it in Moonlighting, but not to the same depth as Zimbalist and Brosnan of Remmington Steele. No matter where you look at these types of 1970-1990's rom-com/detective stylized serials, the Thin Man movies of the 1930's and 1940's top them all and surpass the 1950'stelevision series, in my humble opinion.All in all? This is precocious, adorable, and irascible. This bears some decent suspense and a lot of endearing chuckles at its own expense. I really like this, and own the whole series, but if you have a problem with the children being exposed to gratuitous alcohol abuse, you might want to watch this after they've gone to bed.It rates a solid 8.2/10 from...the Fiend :.",
            "review_date": "2009-01-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nick and Nora: Society Sleuths",
            "content": "THE THIN MAN (Metro-Goldwyn-Mayer, 1934), directed by W.S. Van Dyke, from the novel by Dashiell Hammett, is a classic mystery-comedy that helped establish the careers of both its leading performers, William Powell and Myrna Loy, Powell especially, in a performance that earned him an Academy Award nomination. There have been mystery-comedies prior to this, A SHRIEK IN THE NIGHT (Allied, 1933) with Ginger Rogers and Lyle Talbot as rival news reporters that immediately comes to mind, but THE THIN MAN stands in a class by itself.With the plot set in New York City at the start of the Christmas season, the ten minute prologue begins with Clyde Wynant (Edward Ellis), an absent-minded inventor, who discovers that his secretary, Julia Wolfe (Natalie Moorehead), with whom he has been carrying on a romancer, has stolen $50,000 worth of government bonds he's been saving for the upcoming wedding of his daughter Dorothy (Maureen O'Sullivan) to Andrew (Henry Wadsworth). Wynant confronts Julia with his accusations, and after learning the truth, he angrily walks out of the apartment down the dark streets alone. The story gets underway as Wynant's ex-wife, Mimi (Minna Gombell), in desperate need of money, comes to visit Julia to learn of Wynant's whereabouts. After entering the apartment, she finds her dead. Before the police are called, Mimi takes something from Julia's hand belonging to Wynant, and withholds the item as possible evidence. As for Dorothy, she suspects something terribly wrong when her father, away on a secret trip unknown even to his personal attorney, Herbert McCauley (Porter Hall), hasn't returned in time for the wedding. She soon takes her worries to Nick Charles (William Powell), a friend of the family having a time of his life drinking cocktails in a speakeasy. Nick, a former detective visiting from San Francisco with his wealthy wife, Nora (Myrna Loy), is asked to investigate. At first Nick declines, but after three additional murders take place, linking it all to gray-haired thin man, Wynant, now missing for three months, Nick, at Nora's urging, comes out of his four years of carefree living to look into the case. Along with Lieutenant John Guild (Nat Pendleton) and his dog, Asta, Nick stumbles upon some clues while investigating in Wynant's workshop, to surprising and unexpected results.Suspects in question include William Henry as Wynant's studious intellectual son, Gilbert; Cesar Romero as Chris Jorgensen, a lazy loafer living off Mimi; and Julia's gangster acquaintances played by Edward Brophy (Joe Morelli); and Harold Huber (Nunheimer), the latter being murder victim number three. Then there's Bert Roach being the overgrown crybaby guest at the Christmas Eve party wanting to use Nick's phone to call his \"maw\" long distance.The success or failure for any motion picture relies simply on fine scripting (Albert Hackett and Frances Goodrich) and perfect casting. THE THIN MAN succeeds on those counts and chemistry by Powell and Loy. Having already some detective experience to his name, that of Philo Vance on three separate occasions, \"The Canary Murder Case\" 1929); \"The Benson Murder Case\" (1930 and \"The Kennel Murder Case\" (1933), Powell's Nick Charles, unlike any other detective commonly found in motion picture mysteries, is very much witty, down to earth, and of course, married. Rather than typically presenting a detective sleuthing with a male counterpart as comedy relief, a gal reporter, or very much alone, Nick Charles is assisted by Asta, his wire-haired fox terrier. Observant and clever with his deductions, Nick Charles is also quick with his responses, a fondness for liquor and fun at parties. His friends are usually ex-cons whom he's \"sent up the river,\"holding no grudge against him. Myrna Loy has found her true character in Nora Charles. Breaking away from the stereotype bossy spouse, she accepts her husband for what and whom he is, and equals with his enjoyment of fun and mystery combined. Great scene captures her sitting on the couch gowned in fur coat calmly watching her husband being a little boy at heart playing with the sling shot he's gotten for Christmas, shooting away the ornaments hanging on the Christmas tree one by one. As much as Nora would prefer sleuthing with him during his investigations, she seldom gets that chance. The climatic finish where Nick summons all connected with the case at the dinner gathering is well constructed in both humor and suspense.The success of THE THIN MAN not only brought forth many imitations, but five additional sequels starring Powell and Loy, along with the basis of a 1957-59 television series starring Peter Lawford and Phyllis Kirk, but nothing to compare with the 1934 original, being the most famous and revived of all the \"Thin Man\" presentations combined.Distributed to video cassette as early as the 1980s by MGM Home Video enclosed in plastic clam shells, cable television presentations on the Disney Channel's \"Best of Hollywood\" in the 1990s, Turner Classic Movies from 1994 onward, and finally DVD where this and others continue to acquire both a new audience along with those who know who the killer is but to just simply want to watch over and over again in the manner of Nick and Nora Charles, just for the fun of it. (***1/2)",
            "review_date": "2011-07-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A most unusual but highly successful offering from MGM",
            "content": "In 1934, there were only seven or eight people on the vast Metro-Goldwyn-Mayer lot, whom Mayer permitted to walk into his office any time of the day or night, without an appointment. These privileged few included his secretary, Ida Koverman; his executive producer, Irving G. Thalberg, and Thalberg's wife, Norma Shearer; film editor, Margaret Booth; and director, Woody Van Dyke. One day, Van Dyke approached Mayer with his idea of teaming Powell and Loy in \"The Thin Man\". Although he strongly disapproved of Van Dyke's suggestion – in fact he told him to his face that the whole idea of casting Powell and Loy was \"insane\" – Mayer compromised (as he often did in his dealings with \"favorite sons\"). Extracting a promise from Van Dyke that he would complete the whole picture in just 3 weeks, Mayer reluctantly gave him the go-ahead.Woody's first problem was to find a cameraman sufficiently speedy yet masterfully skillful to photograph an \"A\" picture in an unheard- of eighteen working days. Fellow-director Jack Conway recommended James Wong Howe.\"Van Dyke didn't cheat on his commitment to Mayer by working overtime on the picture,\" Wong Howe recalled in a 1969 interview. \"He'd come in at nine. At twelve, we'd break for lunch. Back at one. Then leave at five. Van Dyke was a real expert. He'd rehearse the players and often as not, shoot just one take.\"The picture actually starts with a shadow effect – and very dramatic too – as the flickering shadow of the Thin Man is eerily cast on the wall of his warehouse as he works on some new invention. As colorfully played by Edward Ellis, the title character dominates the first quarter-hour or so of the action. He's not a nice man at all. Grumpy, short-tempered, dominating, cruel, sadistic – yet his daughter likes him. When he fails to turn up for a promised Christmas re-union, the action really starts, for at this point the film finally introduces us to Nora and Nick, both engaged in their favorite pastime – drinking.Prohibition had recently been repealed in the USA, so audiences were not accustomed to seeing people openly drinking on the screen in lush surroundings. Drinking was associated with gangsters, speakeasies and dives.Oh yes, the mystery side's very engrossing too. Impossible to pick the killer, though a few clues are fairly thrown our way. And there's one chilling sequence in a deserted warehouse which will raise goose bumps on even the most jaded flesh.Like some contemporary Warner Bros pictures, the script is very critical of the police. Nat Pendleton (usually cast as a moronic clown) plays the police inspector as not exactly dumb but certainly three or four shades removed from the sort of competence we might expect.The most telling scene occurs when Nick suggests to serio-comic crook Joe Morelli (played by Ed Brophy who specialized in aggressive but stupid henchmen) that he should ask the police some questions. \"Me, walk into the police station and start asking questions?\" Morelli snarls. \"They'd like that – right down to the end of their blackjacks.\" – A prophecy fulfilled less than a minute later when a uniformed cop walks up to the now helpless little thug and, for no particular reason, smashes him in the face.The Thin Man was nominated for four of the prestigious annual awards voted by members of The Academy of Motion Picture Arts and Sciences: Best Picture, Best Actor (William Powell), Best Director (Woody Van Dyke), and Best Adapted Screenplay (husband and wife team, Frances Goodrich and Albert Hackett). The movie also scored at the domestic box-office with a rentals gross of $1.2 million (which made it the 5th most popular release of the year).",
            "review_date": "2017-12-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the classics and a delightful diversion",
            "content": "This, the first Thin Man, is one of the most beloved of the old time movies, and watching it for the first time since I was a child--I'm sure I saw it in the fifties at one of those three features, a cartoon and Movietone for a dime theaters, but remember nothing--it's not hard to see why. The chemistry between William Powell and Myrna Loy (Nick and Nora Charles) is effervescent, bubbly and delicious. It is obvious they are in love and take such joy in each other's company while teasing each other in a most delightful way. You will just love the way Asta, their dog (who is quite a star in this movie himself) covers his eyes in the final scene--such a delicate dog with such delicate feelings! (Actually I understand that all dogs in movies in those days at least were females for reasons that might be imagined.) The movie starts a little slow by modern standards, like a stage play, but becomes increasingly enthralling, until suddenly it is over, and YES, let's do a sequel! And they did, six of them, but, well, sequels may or may not be as good as the original. In this case, I understand they weren't and I'm not surprised. It would be hard to achieve something like The Thin Man again. Everything just fell into place, the plot was agreeable and clever, the lesser characters quirky and intriguing, the direction by W.S. \"One Take Woody\" Van Dyke smooth and focused, and the twenties going on the thirties (but not really) atmosphere was authentic with the rich holding lavish dinner parties and drinking way too much, especially Nick Charles (Powell) who complained that sleuthing caused him to get behind in his drinking.The witty dialogue comes first from Dashiell Hammett's novel and then from Albert Hackett who adapted the script. Hackett was just getting warmed up. He wrote his first script in 1931 (something called Up Pops the Devil) and his last for The Father of the Bride Part II in 1995 at the age of 95!--well, he got partial credit for that script which was morphed out of his 1951 script for Father's Little Dividend and the original Father of the Bride (1951).By the way, I always imagined that \"the thin man\" was the detective Nick Charles, but actually the thin man is Clyde Wynant, the eccentric inventor played by Edward Ellis who goes missing after the first reel. However, everybody thought the same thing, so in the sequels, the thin man is the detective! One of the reasons the repartee between Nick and Nora is so great is that it was taken (somewhat) from real life exchanges between Hammett and his longtime live-together girl friend the celebrated playwright, Lillian Hellman.Anybody with any pretension of knowing Hollywood films has seen this. See it yourself if you haven't. It's a delight and will take you back to a time full of styles so very different from those of today.(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
            "review_date": "2007-05-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "follow along as married couple solves mystery",
            "content": "Myrna Loy & William Powell are a married couple who get roped into solving a murder mystery.  By far, the first of the b/w Thin Man series is the best.  Powell is never without a drinkie in his hand, back when it was okayto drink & smoke making for some funny jokes.  Powell & Loy as Nick & Nora Charles bicker in clever, pleasant tone as Powell tries to keep Myrna Loy out of harm & out of his hair.  of course,the dog Asta is along for the cute-factor.  Fun who-dunnit story by Dashiell Hammett (also did Maltese Falcon). Also includes Maureen OSullivan, who was \"Jane\" in numerousTarzan movies and had a long successful career.",
            "review_date": "2004-04-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Landmark Film On DVD",
            "content": "THE THIN MAN is a landmark film in so many ways that it is difficult to over-estimate either its impact or its brilliance. Based on the popular novel by Dashiell Hammet, the film presents us with a completely egalitarian husband and wife who trade witticisms as freely as they mix cocktails--and the concept was so completely unexpected that it proved extremely controversial in the 1930s and even today still sets the standard for witty comedies in which couples engage in clever verbal sparring. The script is sharp and clever; the cinematography by James Wong Howe anticipates later film noir by mixing glossy black and white beauty with an underlying grittiness; W.S. Van Dyke's direction is fast paced and never allows your attention to wander; the supporting cast is remarkably fine; and the production values offer MGM at the height of its considerable powers.All of this would be enough to make THE THIN MAN memorable, but what really elevates it into a rarefied atmosphere is the chemistry between leads William Powell and Myrna Loy, who handle their lines like sparkling rapiers, playing a combination of dry wit and unexpectedly silliness in high relief against a remarkably dark tale of multiple murder. Hard drinking, and mixing socially with both the uppercrust and the underworld, they are the people we would like to be in the sort of relationship we would like to achieve: glamorous, stylish, intelligent, and having tremendous fun as they work together to track down a missing inventor who may or may not be responsible for his lover's sudden murder. Although Powell and Loy made numerous films together, including five sequels to this one, THE THIN MAN shows them at their zenith, and I can think of no other screen couple to date who have played so effectively together.Regrettably, the DVD release has not been restored, and although the print is crisp it does contain a number of blemishes; similarly, although the DVD does include trailers for all of the \"Thin Man\" films Powell and Loy made, the bonus features hardly do justice to the film's inexhaustible charms. Still, I do recommend the DVD over a VHS for the simple reason that you are likely to return to the film again and again, hoping some of the Powell-Loy sophistication will rub off--and in the process you are likely to wear out a VHS in fairly short order. Of all the many films I have seen and enjoyed, this is probably the one I have watched most often, and I cannot recommend too highly. A must have for your collection.Gary F. Taylor, aka GFT, Amazon Reviewer",
            "review_date": "2005-04-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Formula Thin Man stuff is still witty and sophisticated...",
            "content": "Although I was never a big fan of the Thin Man films the way so many were, I have to admit that Loy and Powell carry the film with abundant charm, whether sober or drunk (or just feeling high as they line up the drinks), but apparently its pat formula was so successful that it was repeated in film after film, so much so that it's hard to tell the other \"Thin Man\" titles apart.For a film that was shot in eleven days on a modest budget, it certainly did well at the box-office and ensured that there would be many more Nick and Nora adventures to follow. All the successful ingredients are here--a cast of suspicious characters, each with a motive, and an assembly of first rate talent to support the shenanigans of Loy and Powell--MAUREEN O'SULLIVAN (as the daughter of the missing inventor), NAT PENDLETON (as a detective), CESAR ROMERO (as a playboy), EDWARD ELLIS, blonde MINNA GOMBELL (years later, a nurse in \"The Snake Pit\"), and PORTER HALL.As usual, the comedic elements are stressed more than the mystery about the disappearance of a well-known inventor, but fans of the series probably preferred it that way due to the deft sophistication and debonair wit of one of the screen's most classic couples.",
            "review_date": "2006-11-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Slim Pickings? Yes And No",
            "content": "Okay, we're talking 73 years so, to paraphrase Linda Loman, allowances must be made. What shines out like a beacon is the chemistry between Powell and Loy and their deft handling of both dialogue and situations. Such is the charisma/charm of Bill Powell that he can state categorically that he is living off his wife - an heiress - and not arouse contempt although this may be because the script provides him with another gigolo in the shape of Cesar Romero, who plays it ugly making Nick (Powell) look almost noble. As for the plot, such as it is, it's best forgotten other than as a spine to hang the two principal performances on. What we take away from this is the memory of two people who genuinely like being married to each other and see marriage as a game of Style punctuated by martinis. Quintessential thirties movie making Hollywood style.",
            "review_date": "2007-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Adorable Alcoholic",
            "content": "A Charming Who Done It with a Charming Alcoholic Couple. The Camaraderie of William Powell and Myrna Loy as the Classic Nick and Nora Charles and the Relentless Snappy Patter are what makes this one of the Most Popular Films of All Time. But there is more.The Plot is Complicated and Manages to keep Viewers Guessing. The Cast is Equipped with Good Actors Playing Interesting Characters that are Fleshed Out and that is Unusual for a B-Movie. All are Distinctive and Quirky. There isn't One Character On Screen that is not Full Blooded Including the Dog.The \"gather all the suspects in one room and unveil the Murderer\" is the only Thing that is rather Standard in this Always Engaging, Rapid Fire, Combination of a Screwball, Slapstick, Mystery, Movie with some Impressionism and Dark Undertones. It is one of those Rare Occasions when a Movie Fires on All Cylinders and is a Tightly Wrapped Package. There are many Quotable Lines with most of the Humor Derived from Drinking and the Rich, Married Couples Breezy Relationship.It is an Artifact of its Age in Regards to Attitudes about Alcohol and Drinking. Here it is all done with Funny Quips and there is Never a Hint about the Dangers of Excess as Nick and Nora are more than Competent Drunks and because They are Extremely Wealthy, without a Care in the World They Easily get away with it. The Film Shows in Stark Terms just how the Cultural Considerations can Drastically Change with the Current Hypocrisy (the War on Drugs) that will be ever so Clear with the Passage of Time.",
            "review_date": "2014-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A fantastic start to a great series",
            "content": "Come celebrate the end of prohibition with William Powell and Myrna Loy as the high society and wise-cracking Nick and Nora Charles.  Not only do they put away a large quantity of alcohol, but they solve a bizarre and fascinating murder case in the process despite Nick's best efforts not to get involved.  He finally succumbs by taking the case to not only outside pressure, but instinctive curiosity and boredom that goes with being part of the idle class.  Not only is he a super sleuth turned gentleman, but he is quite the aficionado on mixing drinks.  We are first introduced to Nick as he instructs bartenders on the proper technique on mixing drinks (\"In mixing the important thing is the rhythm.  You should always have rhythm in your shaking.  A manhattan you shake to a foxtrot, a dry martini you shake to a waltz\", etc.)  Also added into the fray, is their terrier, Asta, who helps Nick solve the mystery. Despite being made nearly 70 years ago, Powell and Loy's performances and chemistry together remain as strong today as they were then.  This detective has clearly married into a family with a significant fortune, but Nick and Nora's love for each other is genuine and often reflected in sarcastic teasing of each other.  When Nora walks in on him consoling a beautiful young woman by embracing her, he just wrinkles his nose at her and she returns the gesture which indicates the level of trust that exists among this couple.  While Nick is often observant of an attractive woman, Nora doesn't keep him on a tight leash because their instinctive trust with one another.  The film is packed with humor centering around the Charles' vices, mainly drinking and the subsequent hangovers and the complacency of not being required to work for a living.  How many detectives are such smooth talkers that they befriend the criminals they helped convict once they've served their time and party with them on Christmas Eve?  So if you enjoy a bit of sarcastic humor in your murder mysteries, chances are you'll love this film. A few side notes:  Watch for Cesar Romero in this film.  He later played The Joker in the Batman series in the 1960's.  In later Thin Man movies, you can see a young Jimmy Stewart, Donna Reed, Dean Stockwell, and Penny Singleton. Also, I noticed that it was Christmas Eve in this movie 2 days in a row. First, in the bar where we first see Nick, Maureen O'Sullivan says to her boyfriend that it's Christmas Eve and the next morning when Nora wakes up with a hangover they say it's Christmas Eve then.  My only other criticism was the scene where Nick diverts the attention of a man holding him at gunpoint in the bedroom by tossing a pillow at him.  I wish they had come up with something a little more believable.  Other than those 2 minor points, an outstanding movie.  I don't think Hollywood could make something as original and entertaining today if their lives depended on it.  On a scale of 10 martinis, 9/10.",
            "review_date": "2003-08-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Classic oldie",
            "content": "Ah, the movie that started it all: fourteen beloved William Powell and Myrna Loy films with banter, laughs, drama, and above all, heart. The Thin Man series is just like any other whodunnit, but with a married couple who obviously love each other. In fact, when the leads went traveling to promote the film in various premieres and festivals, hotel managers were shocked to find out they weren't actually married in real life! A second room (non-adjoining) was required.Nick and Nora Charles, the life of the party in society, want for nothing. They have a darling little dog, Asta, enough money, interesting friends, and an endless supply of martinis. This series is also famous for the amount of liquor William Powell can drink and still function. Bill used to be a detective, and he's lured back to his old job by a friend and former client. The man he's looking for is actually nicknamed \"the thin man\" because of his description, but the phrase became so popular, the series quickly transferred it to Bill himself.You'll see familiar faces in each of the six installments. In this one, you'll see Maureen O'Sullivan, Nat Pendleton, Edward Brophy, Porter Hall, and Cesar Romero in only his second movie. If you haven't seen at least one of the Thin Man movies, you're missing out on some classic cinema.",
            "review_date": "2021-05-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nick & Nora serve up some murder & martinis",
            "content": "\"The Thin Man\", based on Dashiell Hammett's novel of the same name, features the first pairing of Nick & Nora Charles. Nick is a retired private detective and Nora is his spirited society wife. When a noted inventor becomes the prime suspect in a murder case Nora convinces Nick to take up the case and the mystery begins to unfold.William Powell & Myrna Loy are the stars of the show as Nick & Nora Charles. They have excellent chemistry together, with Powell's nonchalant demeanour providing the perfect counterpoint to Loy's playful exuberance. Powell landed an Oscar nomination for his performance but the Oscar-nominated screenplay deserves equal credit for supplying both he & Loy with plenty of witty dialogue.I didn't think that the direction by W.S. Van Dyke was particularly notable though it's pretty impressive that he shot the entire film in only twelve days. In any case, he managed to land a Best Director Oscar nomination, so that's got to count for something. It should also be noted that the film was recognized with a Best Picture nomination as well.All in all, \"The Thin Man\" is an engaging detective yarn that's spiced up with plenty of witty repartee. While 75 year old comedies aren't likely to suit everyone's taste I think that this one has aged admirably.",
            "review_date": "2009-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Let's have a drink with Nick and Nora Charles!",
            "content": "The first time we meet Nick Charles, he's tutoring waiters about the art of cocktail mixing; each one's got its rhythm: a Manhattan plays like a foxtrot, a Martini a waltz. Once the martini is done, Nick takes a long sip. Later his wife Nora joins him and asks him how many Martinis he had. \"Six\" he says, she orders five more to catch up with him. If that exchange doesn't set the tone of alcohol-soaked complicity between William Powell and Myrna Loy as Nick and Nora Charles, I don't know what it does.Alcohol is perhaps a more pivotal element than any clue, murder or hunch during the investigation, it connects Nora and Nick in a way that never borders on alcoholism but on a rather hedonistic view of life that can only draw smiles on our faces and was probably irresistible at the peak of the Great Depression. Nick is the ex-San Francisco detective who retired after marrying a rich heiress and took over her father's business, and she's a happy socialite. They're both rich, happy, thy have fun, friends and never miss an opportunity to bring the two at a party. Their lifestyle is shown in full transparency and I guess the reason why it works so well is because the film plays it straight, but with an edgy charm.When asked to comment about the case, one of Nick's terrific one-liners is \"it puts me away from my drinking\", in fact, whenever the two are there, a bottle or a glass is never too far, just like a gun in a crime picture or a horse in a Western. In fact, one should pay much attention to get every little gag or silent detail involving alcohol, it's like the film is slightly inebriated, you know, that agreeable feeling after you've fueled yourself with a few glasses but not too many. \"The Thin Man\" floats above its own sense of debauched poetry, one that allows a man and a woman to talk their hearts out and be constantly playful with each other. Whether for Loy's cute nose grimaces or Powell's hammy shocked faces he throws here and there, there's never a doubt that these two are husband and wife.The film actually treats the relationship between Nick and Nora like the cocktail wisdom: a matter of chemistry, alcohol is not the only ingredient, you've got to count on some spicy interactions and sweet tenderness, it's also a matter choreography, the music comes from the dialogue naturally. Adapted from the novel \"The Maltese Falcon\" author Dashiel Hammiett, it was adapted on screen by Albert Hackett and Frances Goodrich, a married a couple, you can't fake this stuff, the film was a winner from the start. Director W.S. Van Dyke himself said they shoot the film in 16 days and each \"frame had that sweet smell of success\", you can't fake that either. It's remarkable that such a quality film (Best Picture nominee after all) only took half a month, but it says something about the simplicity to reach quality when you get the right casting.80% of the job is done with the right cast, said Gene Siskel and we can all agree that the film owes a great deal to the Oscar-nominated performance of William Powell as the suave and serious man who doesn't take himself too seriously, Myrna Loy as his partner in love, occasional assistant and principal competitor when it comes to their drinking habit and Asta the fox-terrier who's like Snowy to Tintin, the scene-stealer. But Powell leads the show splendidly with the swiftness of a Fred Astaire on a ballroom and his Ginger Rogers (all right I borrowed the comparison from Roger Ebert's review, I stole it, happy?) and also the ringmaster's skills of an Hercule Poirot.The film has the makings of the mystery that involves so many protagonists you lose track, the girl played by Maureen O'Sullivan who's the white sheep of a family full of crooks, mistresses and cheaters, her father who mysteriously disappeared after they found his secretary dead, a lawyer and an accountant who don't strike like straight arrows, a bunch of thugs and muscle men, cops, reporters, spinning headlines, one of them inspiring the legendary \"tabloids\" quote. The story is well-written and gets easier to follow after a second viewing but it's accessory compared to the style, so original that it spanned a series of sequels and was the trope-codifier of the male/female crime solving duo.Still, Van Dyke must have quite a way with series starters as he served the same with \"Tarzan: the Ape Man\", also starring Maureen O'Sullivan. Speaking of serving, I couldn't stop laughing at the \"Waiter, serve the nuts, I mean serve the guests the nuts\" during the climactic dinner sequence (a nod to these Agatha Christie's moments when all the suspects are rounded up), that line alone explains why the film, which is a decent mystery and a great romance, earned only one spot in the AFI's Top 100 Laughs.Finally, \"The Thin Man\" is the kind of late experiences that reveals my limitations as a movie lover, I can't believe it took me so long to discover that gem. I guess I expected a screwball comedy but the film is far better than that, no one tries to outsmart the other, love is already there, it's not something to be earned, not even to be proved, the film has a way to say that things are much fun with marriage, and we're tempted to agree.And you know why? Because although it's a pre-Code film, it could still get away with everything since they're married (there's a line about the Sullivan's act that shows how self-aware the writers were) and the last shot of the film (that might have inspired \"North by Northwest\") is just perfect, because it has everything the film's greatness relied on: drinks, wits and quips, marital fun... not to mention, Asta.",
            "review_date": "2019-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Comedy, romance and mystery are a hit combination",
            "content": "\"The Thin Man\" is the first of half of dozen comedy mystery movies that William Powell and Myrna Loy would make together. Based on Dashiell Hammett's novel of the same title and year, this ushered in a new type of mystery show that would entertain audiences for the next four decades plus. It wasn't the first mystery to include comedy, but it solidly established the man and wife team in a mixed genre of comedy, romance, mystery and crime. Add to Powell and Loy a very talented pooch by the name of Asta, and some humorous antics happen as well. The series became known as the Thin Man films, although the name doesn't come from Powell as Nick Charles. Rather, it was the victim in this first film. Anyway, Nick Charles is a super sleuth who, as a private detective, was responsible for sending a large coterie of crooks of various types to prison. - or, \"up the river,\" as more than one of them say in this film. However, on meeting and marrying the very wealthy Nora Charles, Nick has sworn off of sleuthing and instead gone to boozing. He's a heavy drinker, who appears tipsy at times in this film. For as much booze as he puts away, it's a wonder he could ever have a clear head to solve this mystery. But, the solution comes when he seems not to have been imbibing for some time. Nick and Nora otherwise lead a life of pleasure that includes many encounters with Nick's old friends. Many are ex-cons who swear that it was Nick who got them to go straight. Of course some haven't, as we see in this flick. Nora enjoys the party atmosphere and cocktails as well. And, she's fascinated by her hubby's former profession. Nick protests that he can't go back to sleuthing because his new work is to oversee his wife's fortune and investments, for which he married her. But, Nora's interest and nudging lead Nick back into his sleuthing, only now he has a sometimes intruder, sometimes helper, sometimes rescuer in his devoted Nora. \nThis is a wonderfully entertaining film that led to a superb and enjoyable series of films. Powell and Loy made their first appearance together the same month that this film was released, in \"Manhattan Melodrama,\" with Clark Gable. It wasn't a comedy, but Powell and Loy clicked. Credit Louis B. Mayer for spotting the talent match. Powell and Loy would be gold for MGM as the best-loved movie match couple for two decades. They may be the best match of all time. Their last of 14 total films together was \"Song of the Thin Man\" in 1947. In 1957-59, NBC ran a half-hour Thin Man series on TV. It had 72 episodes and starred Peter Lawford and Phyllis Kirk with another Asta. The man and wife mystery venue still proved to be popular when Universal and NBC teamed up for a long-running TV series, \"McMillan & Wife\" in 1971-77. The comedy was toned down considerably in this series, which took on a little more serious tone about crime. But, there still were some lighthearted moments, sometimes at the expense of John Schuck who played Sgt. Enright. \"McMillan & Wife\" had only 40 episodes over seven years, but they were full-fledged films of 90 to 120 minutes - all very entertaining.Here are some favorite lines. For more funny dialog, see the Quotes section under the IMDb Web page of the movie. Nora, \"You know, that sounds like an interesting case. Why don't you take it? Nick, \"I haven't time. I'm much too busy seeing that you don't lose any of the money I married you for.\"Nora gets out of bed to answer the doorbell late at night, and returns to the bedroom. \"Someone to see you, dear,\" she says. Nick, \"Well, that's good. I was afraid I'd have to go to sleep.\"Nick and Nora are reading the morning papers at the breakfast table. Nick, \"Oh, I'm a hero. I was shot twice in the Tribune.\" Nora, \"I read where you were shot five times in the tabloids.\" Nick, \"It's not true. He didn't come anywhere near by tabloids.\"Nora, speaking to Asta before he leaves with Nick, \"If you let anything happen to him, you'll ever wag that tail again.\"Nora, \"Uh, waiter, will you serve the nuts. I mean will you serve the guests the nuts.\"Nora, \"Is that him?\" Nick, I don't know.\" Nora, \"Then why are you saying it?\" Nick, \"It's the only way it makes sense.\" Nora, I hope you're well.\"Nor, \"Oh, I'm glad you're not a detective.\"",
            "review_date": "2018-03-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Delightful Comic Mystery",
            "content": "William Powell and Myrna Loy are the top two reasons why this is such a delightful comic mystery, but \"The Thin Man\" also features an interesting story with good characters, entertaining dialogue, and some very amusing moments. Although this is the kind of movie that was much more popular in earlier eras, it has lost nothing over the years, and it still seems as fresh as ever.Nick and Nora are wonderful characters, and they seem almost to have been made for Powell and Loy to play them. Both stars not only have plenty of charisma, but they also work very well together, making their characters so believable and appealing that they almost seem like your own old friends. It's almost not necessary to have much of a story, but the mystery - while certainly not as complex as an Agatha Christie - holds your attention in its own right. There are some good turns, each one handled with wit and charm by Powell and Loy, and everything packaged together skillfully by W.S. Van Dyke.This is one of the movies that typifies the best of its era and of classic film-making. It's enjoyable even after several viewings.",
            "review_date": "2004-09-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A new favorite to add to my classic section.",
            "content": "I have always loved a good mystery,especially mysteries with a touch or more of humor.I have heard much about The Thin Man series of films for years and tonight,I finally had the pleasure of viewing the first in the series.I can't believe I had waited such a long time to indulge in this wonderful film.William Powell and Myrna Loy have perhaps the best screen chemistry that I have ever witnessed.Their constant playful interaction was so mesmerizing that you forget momentarily that you are watching a murder mystery.The supporting cast is excellent right down to the dog,Asta,who I hear seldom in her movie career did they ever have to do more than one take in any scene she was in.A new favorite in my classics section.",
            "review_date": "2014-10-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The first private detective film to break through the sound barrier",
            "content": "\"The Thin Man\" had the advantage of being based on a successful book by Dashiel Hammett, who had himself been a private eye\u0085The audience did not have to bother about who murdered the butler with a sliver of ice in the locked library: they were asked to be interested in what was happening now, why it was happening and sometimes how it was happening\u0085 They could be just as concerned with the by-play between detective Nick Charles and his wife Nora (William Powell and Myrna Loy) as in wondering who did the murders\u0085 For most of the film, in fact, the audience is led to believe that Winant, the missing inventor, is the murderer; only towards the end does Nick show that Winant has been dead a long time and someone else is doing the killing\u0085 Another factor which made \"The Thin Man\" notable was that Nick and Nora were - well, almost \u0096 real people\u0085 Rich they might be: hard drinkers they certainly were\u0085 They were a married couple in the film, and they actually managed to appear to enjoy it, making gentle fun of one another in every scene they played\u0085 \"The Thin Man\" pointed the way, with such success that five follow-ups were made, culminating in \"Song of the Thin Man\" in 1947.Most of \"The Thin Man\" films were predictable but they were historically important for introducing sophistication and witty repartee into the private eye film\u0085 Their biggest asset was that they were escapist pictures made for a Depression-weary audience\u0085 The Thin Man pictures took the audience away from grim reality simply by ignoring it",
            "review_date": "2005-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the ultimate classics!",
            "content": "This film is simply magnificent. Powell and Loy have fabulous chemistry and their dialogue is so smooth that there are many moments when you forget you're watching a film. Script is really sharp, witty, but doesn't take away from the plot. No silly gags, the jokes are usually underhanded or understated, but still hilariously funny. And to top it off, it's quite a good and faithful rendition of Dashiell Hammet's fabulous novel. Simply put, this film is end to end enjoyment. Technically sound, great acting, better story. There's not much to critique. Time stops while watching it, an hour and a half go by as if it was only half an hour, tops.There are better films; it's not at the level of the Maltese Falcon, for example, but there aren't many that can top it. A few members of the cast are a touch too annoying (Natalie Moorhead is one of them; she makes me grit my teeth whenever she's on screen) but the film is so clever, and Powell and Loy outshine the rest of the cast so much, it hardly matters. And Asta is *so* cute!! (and a better actor than Moorehead;) Look for a young Cesar Romero as Chris Jorgenson...I highly recommend this to anyone looking for an hour and a half of thrilling enjoyment, complemented by laughs aplenty! An easy 9/10.",
            "review_date": "2001-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Let's drink to a wonderful couple",
            "content": "Meet Nick and Nora Charles, possibly the best husband-and-wife team in the history of cinema. They love each other, but they also have a lot of fun together. Boozing, solving mysteries, throwing swish cocktail parties and caring for Asta- Smooth, witty William Powell and gorgeous Myrna Loy certainly make a wonderful couple.The plot to \"The Thin Man\" really isn't much; it's a catalyst for a heap of entertaining situations and great comic lines. And the film has plenty of those, with Powell and Loy breezily delivering the funny and sexy dialogue with ease. Let's drink to a terrific film pairing that shows us marriage can actually be pretty swell.",
            "review_date": "2008-08-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Highly entertaining",
            "content": "This was the movie that would launch the 'Thin Man' series, and as in the sequels which would follow, William Powell and Myrna Loy are so damn charming, endearing, and wonderful that you'll want to eat them up. The movie starts off with a gritty feeling, as an inventor finds he's been robbed of bonds from his safe, and angrily approaches his mistress. His daughter, played by the lovely Maureen O'Sullivan, is about to get married, and when he disappears shortly thereafter, she begins to worry. She runs into William Powell in a bar (where else?), and explains things to him, but he's on vacation and doesn't want anything to do with the case. Eventually of course, he gets sucked in.Powell is simply outstanding in this movie. His character is what every man wishes he could be: witty, charming, one step ahead of everyone else, calm under pressure, married to the cute and playful Myrna Loy, and able to hold an incredible amount of liquor. Far from being stressed out, he's bemused by it all. Powell plays this role perfectly, and his chemistry with Loy is extraordinary. Their banter and quirky behavior quickly takes over the movie, rendering the mystery of the 'thin man' secondary. There are just so many funny lines and facial gestures that I was literally laughing out loud 83 years later. All that and 'Asta' the dog too! The actual solving of the crime is a little convoluted, but don't worry too much about that, you'll be highly entertained.",
            "review_date": "2017-06-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Reporter: Well, can't you tell us anything about the case? Nick Charles: Yes, it's putting me way behind in my drinking.",
            "content": "It is not easy to make a good comedy or a good mystery but to combine two genres together and make Comedy / Crime / Mystery as sparkling, funny, elegant and dynamic as 93 minutes long \"The Thin Man\" (1934) directed by W.S. Van Dyke is incredibly marvelous. The film owes a lot of its charm to the great working chemistry between two main characters, the husband and wife sleuths, Nora and Nick Charles, a rich and adventurous woman and her ex-detective husband. Nick is not too interested in going back to work on the case because \"it's putting him way behind in his drinking\" but Nora sees it as an exiting adventure. They solve a murder case (actually, three murders case) somewhere between couple of drinks during the never-ending party at their house. Bill Powell and Myrna Loy deserve Oscar for the Best On-Screen Couple of the Year.",
            "review_date": "2007-09-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Emaciated & Underweight...",
            "content": "... most probably because it's a film that suffers terminal cirrhosis - like many of its characters must have done by the amount of booze they consumed.Of its time and occasionally amusing, in that context, if you've had a few, but so overwhelmingly superseded by what was to follow; this is more of a stage theatrical performance committed to film as much as anything else - and it shows. Can only assume that those who are so fond of it today yearn to return to the days from whence it came - sentimental nostalgia fine but not a 9 or 10 rated film by a long chalk.",
            "review_date": "2020-09-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fun With Nick and Nora",
            "content": "Why is \"The Thin Man\" such a highly regarded and loved film? It was successful enough that it launched a number of other Thin Man films, and made Nick and Nora Charles (played by William Powell and Myra Loy) an iconic film couple.I think the answer is that Powell and Loy seem to be such a fun-loving couple. Viewers have fun watching them. Simple as that.You might ask if \"The Thin Man\" is more style than substance? I think that is somewhat true. The story is, at heart, a who dunnit that offers nothing unique. It is the style of Nick Charles in solving the crime that is interesting. And it is the relationship of Nick and Nora that brings the audience along for the ride. The same might be said for \"The Maltese Falcon\". Does anyone really think the plot is that captivating (or understandable)? It is Bogart's style that made the film iconic.The ending of \"The Thin Man\" is particularly fun--a take-off on many murder mystery finales, where the detective brings all the suspects together to reveal the murderer...and he has fun doing it!",
            "review_date": "2014-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My brief review of the film",
            "content": "A largely entertaining blend of comedy and mystery, the film has the ability to make one laugh as well as to make one think about everything that is happening in detail. The cinematography captures the action quite well, the lines are often witty, and the chemistry between Powell and Loy is simply excellent. It is, for that reason, a shame that the leads do not have more time on screen together, for their characters are by far and away the best in the film. Most of the supporting characters are silly and under-developed, but Powell and Loy shine when together. However, even when they are alone, the two hardly dominate the film. Perhaps as much as 40% of the material involves just the other characters. Still, even with the best characters sidelined, this is amusing stuff, and worthwhile if mysteries and/or banter comedies take one's fancy.",
            "review_date": "2005-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Martini time with Nick and Nora",
            "content": "There wasn't any film noir at the time. There were a few early notions formed in Weimar Germany about dazed minds succumbing to control of storymakers. The femme fatale was beginning to get shape as a force in the story. And then there was the detective film; each studio run its own highly successful series, each one influenced by the one before.The Thin Man is now the most famous of these (along with Charlie Chan), I believe six films in total pairing William Powell with Myrna Loy as Nick and Nora Charles, dilettantes and sleuths, openly quoting Sherlock Holmes.The game here is that the detective plot is incidental to the story and only the hook that lets all the other effects sink in. The screwball comedy, the sexual innuendo, the fashions, the wit as dry as the martinis. You may piece something together but quite apart from what sleuthing is going on; no one is really sure if the sleuth is on the case or not, including him, the clues and suspects are laid out on his living-room in the middle of a party and they're merely a lot of noise that gets in the way of sipping one martini after another. Our introduction to Nick is where he's showing waiters how to shake cocktails, foreshadowing handling of the case to us.Naturally he pieces everything together in the final explanatory denouement; a dinner party with all the suspects invited, one of them the killer. No device is more contrived these days, in part because it used to work so well.You didn't have to puzzle about any of this, or fates in control of the thing, because there were none. All you had to do was kick back and sip at all the extraordinary chintz of the sleuthing.This type of film culminates in the Maltese Falcon, incidentally also adapted from Hammett and the shift towards noir proper. The more elaborate trick there was that all the suspects were aware of a ridiculous detective film going on, and constantly switched between elated viewers and mischievous storymakers. Sam Spade's main assets were great acting and making up stories.The only mischief going on here is between Nick and Nora, who constantly wink at each other about sex they're not having - until the end. Their chemistry sizzles in a way that deep love does.",
            "review_date": "2012-05-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Powell & Loy provide the charm of this movie",
            "content": "Before Hercule Poirot there was Nick Charles (William Powell). This movie - based on a story by Dashiell Hammett - basically runs like a typical Agatha Christie-written murder mystery in which everything is revealed at the end to a congregation of all the suspects. The main difference is that there are two detectives, Nick and Nora Charles (Myrna Loy), versus Christie's solo acts of either Poirot or Miss Marple. It proves to be a wise decision to have two leads - an affection-through-sarcasm husband-wife team - as they make for most of the comedy elements of this movie. The bantering chemistry Powell and Loy have provide the charm which made this movie a hit.",
            "review_date": "2002-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The beginning of a wonderful... screen team",
            "content": "This is the movie that made up the starting point for one of the most famous (even though not very long compared to others: it consists of only 6 movies), and most popular even today crime movie series: \"The Thin Man\". Shot originally as a B movie, with a comparable modest budget for MGM standards, and with the two protagonists for the first time working together, it was an immediate smash hit - and marked the beginning for one of the most beloved screen couples; and certainly THE most beloved of the non-married in real life ones! William Powell was already an 'old hand' at crime, coming freshly from his \"Philo Vance\" series success; while Myrna Loy had been playing more in melodramas up to then - but director W.S. van Dyke, who personally chose her for the role, was convinced that she had a GREAT sense of humor as well. And how right he was...Nick Charles is a former 'tough guy' style private dick from New York (although there's not too much left of the original character that Dashiell Hammett had created in the novel which had just been released a few months earlier), who 'married money' (as he himself ironically points out from time to time, much to his wife's chagrin) in the shape of Nora, the daughter of a rich businessman, who nevertheless is a perfect match for him: she loves adventure and crime and doesn't get scared easily - and most of all, she drinks almost as much as Nick himself... The movie was released just a little while after the end of the Prohibition, and so of course everybody could relish in excessive drinking parties even in an MGM movie, where they had always been rather careful about this subject as long as alcohol had been prohibited (in the novel, the story is set during the Prohibition days, and so Nick and Nora are of course often found in speakeasies, ignoring the law...); and the easing off of the horrible social effects of the Depression also shows in a generally carefree, almost childishly funny party atmosphere throughout the movie - even in the middle of a dark, mysterious murder case...Clyde Wynant, an eccentric inventor, has vanished all of a sudden; while his secretary and former lover Julia, who had stolen the bonds he had intended to give to his daughter for her wedding, is found dead in her apartment. So, of course, everybody's searching for Wynant, who is described as the 'thin man with white hair' (hence the title), as the murderer (soon double murderer, when a slimy little informer gets bumped off as well) - and of course, there's a whole bunch of suspects to choose from: Wynant's ex-wife, who also happened to find Julia's body, his lawyer, Julia's boyfriend, the informer's girl, the ex-wife's new lover... And Nick and Nora, the certainly most unusual (on-screen) married couple of the time, drink and party themselves through the case, accompanied by their terrier Asta, and more than once getting in real danger themselves - until Nick, with his cleverness and talent for improvisation, finally reveals the culprit at a hilariously funny and at the same time extremely suspenseful 'murder solving dinner', with all the suspects sitting at the same table! The enormous success of the movie, which so elegantly combines light comedy with tough murders, led to a whole series of films which always used the title of the original one (although it doesn't actually refer to Nick Charles, like many people believe today) - and are until today, and with FULL justification, ranking among the most popular and beloved by a wide audience classic crime comedies of all times!",
            "review_date": "2014-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Enjoyable mystery made better by the playing of Powell and Loy",
            "content": "When her inventor father goes missing, Dorothy Wynant turns to family friend Nick Charles to help track him down. Having confirmed that her father is alive (albeit missing his stolen bonds) Nick sits back until a dead woman means Dorothy requires more help when her father is accused of murder. Resisting getting involved even when wife Nora wants to taste the adventure with him, Nick is left with little choice when incompetent police and a visit fro man armed man drag both him and Nora into the case, putting his playboy lifestyle somewhat on hold temporarily.Having taped \"Another Thin Man\", I thought it was unfair to jump into the middle of the series without rewatching the original film to get a grip on the film's tone and characters. So I sat to a film I had not seen for over a decade and, barely able to remember it at all, I was surprised by how slowly the film opened as it set up the mystery plot but was glad when it hit its stride. It did this with the introduction of the Charles's, in particular Nick getting involved in the mystery as this brings the comedy, pace and wit to the film that made it and the series so famous. The pace of the dialogue injects real energy and the lines are sharp and funny without making the film feel like just a collection of wise cracks. The mystery plot is still good and it does work well with the humour but, while you can imagine the humour working with a lesser plot, I can't imagine the plot being able to stand up without the humour.A massive part of the mix working is simply down to the cast \u0096 certainly the humour works thanks to the great delivery and chemistry between Loy and Powell. Powell is the main star for my money and it is his alcohol-soaked dry delivery that makes his character such fun. Loy holds her own alongside him and she is very good even with a little less material to work with. The various suspects etc are all well enough played to make the mystery work and keep it interesting \u0096 Pendleton is funny, Brophy is amusing and Ellis is good (playing the title character); shame that O'Sullivan and her fiancé were a bit bland.Overall this is not a perfect film as it is neither funny enough to win me over in that regard or gripping enough to work as a mystery. However the mix is very good and the result is a very enjoyable film that is light, breezy and fun. The material throws up plenty of good lines but the real winner is the acting and chemistry from Powell and Loy, who have great fun and really helped me get into the film.",
            "review_date": "2005-02-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Memories are golden",
            "content": "Having established herself as a comedienne in Love Me Tonight and a witty female lead in Penthouse, Myrna Loy successfully completed her move away from vampy roles with The Thin Man, a superlative mystery-comedy that paired her with William Powell for the second time (following the same year's Manhattan Melodrama). The screenplay, skilfully adapted from Dashiel Hammett's bestselling novel, left intact both the suspense and humour, whilst Van Dyke's effortlessly economical direction hit a peak here. He brought the film in before time and under-budget and it shows: zipping along at breakneck pace, incorporating a half-dozen terrific subplots, numerous hilarious characterisations (Gilbert, the Freudian scholar and amateur detective is a real stand-out) and a series of increasingly inspired plot-twists. Where the film really succeeds though is in the verbal sparring of the Powell and Loy, who create a wonderfully warm chemistry, illustrated by scenes both tender and funny.\"If you let anything happen to him, you'll never wag that tail again!\", Myrna tells the family dog Asta, as he accompanies his master on a late-night foray into boarded-up shop that acts as a backdrop for financial and murderous intrigue. Tears in her eyes, she embraces her retired detective husband. Seconds earlier, this wonderful exchange:Nora: I think it's a dirty trick to bring me all the way to New York just to make a widow of me.Nick: You wouldn't be a widow long.Nora: You bet I wouldn't.Nick: Not with all your money.And herein lies the magic of the film: real danger and humour given an emotional centre by two beautifully judged lead performances. The script is perfect, striking just the right balance between plot and characterisation, laughs and thrills (calling to mind that famous tagline), boozing and crime-solving, helped along by a cracking supporting cast. This film is one of my all-time favourites - I recommend it to anyone who loves a good comedy, a good romance, a good thriller, or just a good movie.",
            "review_date": "2004-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderfully Witty Whodunnit",
            "content": "Detective Nick Charles (Powell) and wife Nora (Loy) try to solve a murder mystery between drinks. The story from a Dashiell Hammett novel becomes somewhat convoluted but it is secondary compared to the marvelously witty interplay between Powell and Loy. The pair co-starred in about a dozen films over their careers and this was one of their high points (Libeled Lady is another). There are so many memorable exchanges between them that it's impossible to pick the funniest one. The fine supporting cast includes Asta the cowardly dog. Van Dyke's light touch keeps everything moving at a breezy pace. Followed by five sequels with \"Thin Man\" in the title although this is the only one in the series in which that character appears.",
            "review_date": "2006-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Crime-comedy at its best!",
            "content": "Genre mixes don't often work, and if one of the genres is comedy, it's normally a sign of a unfunny film at best. However in \"The Thin Man\", the combination of crime and comedy works perfectly. A good script, a great cast that actually works well together, and the very likable couple Nick and Nora Charles makes this film one of the best ever made. The story is a mess from start to finish, and might actually get in the way of enjoying the film. Roughly, it goes something like this: Nick (an ex-policeman who retired after marrying) and Nora (his wife, a rich heiress) is on vacation in New York. By coincidence Nick meets Dorothy Wynant, the daughter of inventor Clyde Wynant, a man Nick worked for in his policeman days. She is worried that she can't find him (it's Christmas Eve), and in so many words seeks help. Nick, who is busy instructing the bartenders which dance goes to shaking which cocktail, doesn't take the disappearance seriously - yet.The rest of the film revolves around the missing Clyde Wynant (the actual thin man). The Police starts looking for him, first as a missing person, then as a murderer. Nick, who is reluctant to get involved, is finally pushed into the case by a number of characters, most importantly his wife Nora, who thinks sleuthing sounds like fun. The rest of the film includes a number of strange, yet fascinating, characters: Wynant's devoted daughter (Dorothy), his psychology-studying bookworm son Gilbert, his greedy ex-wife Mimi (calls herself Mimi Jorgenson) and her new, poor man, Chris Jorgenson. There are also other important characters, such as Wynant's (also) greedy ex-lover, her new and old boyfriends, his lawyer and a number of others closely or loosely connected to him. The revealing of the murders (there are three) is quite surprising, if you have managed to hang to the story all the way.The film is my personal favorite mainly because of the characters. They help this film to be not only a good crime story, but a great comedy as well. However, the true magic of the film is the relationship between Nick and Nora (with good help from the police lieutenant Guild and the Charles' dog Asta), their witty comments, their (especially his) inebriated observations and their love of adventure makes them the couple you'd just want to invite again and again.",
            "review_date": "2005-07-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the Funniest Movies Ever",
            "content": "There are moments while watching The Thin Man that I think it may be the funniest movie of all-time. The dialogue is, of course, rapid-fire perfection, but the editing, directing, and infallible performances deserve just as many comedic accolades. Nick and Norah are fabulous characters, but the real star? Their relationship; a real example of the whole being greater than the sum of its impeccable parts.",
            "review_date": "2021-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Highjinks and Highclass!",
            "content": "The Thin Man is one of the most fun films ever created. All the people work perfectly together! The main duo Nick and Nora Charles (and dog Asta) seem to have a perfect life, they are married, in love with each other, and Nick drinks all the time! He rarely gets real drunk, considering the amount of booze he drinks. They go to parties, they wear beautiful clothes, and suddenly they are involved in a murder mystery. Believe it or not, unless you have seen the film, you won't guess whodunit! The whole series of Thin Man films are wonderful, however, this is the first and finest of the lot! Watch The Thin Man, have fun and enjoy! You'll enjoy the whole series if you like this one! Nick and Nora are 2 of the most well known screen couples, of all time, and they have yet to top the two sophisticated husband and wife crime solving team! Watch and laugh!",
            "review_date": "2005-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Era Where Liquor Was Always The Answer",
            "content": "I can see why this was so popular in its day but would lose its appeal in today's age where smarter people realize drinking alcohol ALL the time is not cool, is not funny and is just plain dumb. In this series, especially in this debut film, William Powell is obsessed with drinking. \"Have a drink\" is the answer to everything!That, and a plot this is difficult to understand at times (who is who and what is what) took away from the enjoyment of this for me. However, I did like several of the sequels, just not this movie. \"The Thin Man,\" and all the sequels had witty dialog and charming rapport between Powell and his wife, played by Myrna Loy. \"Nick and Nora Charles\" were definitely a fun couple. For added fun, there was their famous dog, \"Asta.\"But all that booze and smoke looks absurd in this day-and-age.",
            "review_date": "2006-08-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Movie Odyssey Review #110: The Thin Man",
            "content": "110: The Thin Man (1934) - released 5/23/1934, viewed 8/15/08.The Three Stooges release their first short. Bonnie and Clyde are killed in a hail of police gunfire in Louisiana.KEVIN: On its own, 'The Thin Man' is a pretty standard old movie. In the context of other old movies, it may not appear to be the classic that one might expect. In the context of the other Thin Man movies in the series\u0085well, I have no idea, because I haven't seen them yet. But the whip-smart dialogue and the spot-on chemistry of William Powell and Myrna Loy seems fully formed right out of the gate, and it's not at all surprising that Nick & Nora Charles (not to mention Powell & Loy) would become a gold-standard of on screen couples for years to come. The actual mystery could have been better. The conclusion felt anti-climactic, as the big reveal of the culprit lacked dramatic punch and was over too quickly. The supporting players, especially Maureen O'Sullivan, are commendable, but none hold a candle to the two leads.DOUG: We are nearing the end of the Pre-Code Era. Fortunately, where there are ends there are also beginnings, and here begins the Thin Man film series starring William Powell and Myrna Loy. I don't have a huge amount to say about this movie except that it is very much worth the watch. I watched it a couple of years ago, but I didn't really get it at all, which was probably my own fault. My brain must have been switched off or something. But the good news is I really enjoyed the movie this time around. The most groundbreaking aspect of this little sleeper hit was its portrayal of the Charles' marriage. Most movies made during this period focus on either the courtship or the falling out (even One Hour With You, which begins and ends with the two leads married, shows them on the rocks), but Nick and Nora are a married couple and that's that. Storywise, the movie works very much like a TV pilot, showing the beginning of this couple as a crime-solving team and working their first case together. The chemistry between Powell and Loy carries the movie far better than the murder mystery. My favorite line? \"It's not true. He didn't come anywhere near my tabloids.\" Oh, and Maureen O'Sullivan (Jane from the Tarzan movies) appears in a supporting role. I'm noticing an overlap of actors in the movies we're watching a lot more than before. This is turning into the Year of the Contract Players. I wouldn't be surprised if the reason this film is considered the best in the series is because it's the only Pre-Code installment. Will the later dialogue be trimmed to be less risqué? Will Nick's rampant drinking be cut down? Time will tell...Last film: Twentieth Century (1934). Next film: Of Human Bondage (1934).",
            "review_date": "2009-02-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Adventure and Comedy; Fun in the Air All-the-Way; First of Its Series",
            "content": "Despite what so-called critics have to say about \"The Thin Man\", they have not said very much in my judgment. William Powell has a medium-strength cultured speaking voice, high intelligence and a way of delivering lines that often gets the very most out of a line. He is very good at comedy, capable of drama, and has superior timing and adequate charisma. This suits him ideally to play the sort of screen detectives, and comedy parts to which he was invariably assigned. In one of their series, after the \"Philo Vance\" series had been launched, MGM decided to make use of his comedic talents by casting him opposite thin-voiced by exceptionally bright Myrna Loy. His delivery was a bit more dynamic, her suggestion of hidden depths, humor and sexuality was extremely strong. Result: a potent pairing that lasted for years and seven films. The \"Thin Man\" was the first of these. It introduced Prohibition holdovers Nick Charles, former ace police detective, and the new Mrs. Charles, Nora, who together with their wire-haired terrier Asta made up one of Hollywood's seminal nuclear families--until the disruptive arrival of young Nicky several films later. She has wealth; so he is retired, and they are drinking continually. There is a party going on in their suite, with or without permission, during the entire film. Also, here Nora wants Nick to get involved in a detective case so she can see him at work and help him; he has other ideas. So they get involved in a case. There is a request from a daughter to help her father, who does not want any help. Nick is shot at, reported wounded or worse and mostly unharmed. After the protracted prologue which takes place three months before the aftermath, most of the movie is given a holiday setting, which includes cocktail events on and the obligatory 1930s expository unmasking of the killer at a dinner party sometime around New Years' Eve. The movie is based on a novel by Dashiell Hammett. It was as an inexpensive B-picture, which broke new ground for detective films by combining the hard-drinking lawyer-detective lead with screwball-comedy husband-and-wife dialogue and situations. Powell and Loy had had a success earlier the same year in the Clark Gable--William Powell \"A\" picture \"Manhattan Melodrama\" . The astonishingly brief two-week-plus shooting schedule was enabled because there are few sets and negligible exterior shots required; \"The Thin Man\" as also a dialogue film, and a very fine one; and also, the feature's director, veteran W. S. Van Dyke, was known for sticking to a schedule--around the studios he was known as \"One-Take Woody\". . Make no mistake about this attractive little mostly-drawing-room mystery with bodies; this is noir. Nick cannot ask the police for help because they want him off the case; he has to take risks, as does Nora in this one. Briefly, the story-line involves the disappearance of a cantankerous inventor--who is an old colleague of Nick Charles', and later a murder suspect-- and the concern of his daughter (Maureen O'Sullivan) for her father; then there is the avarice of the inventor's ex-wife (Minna Gombell, the desire of her husband (Cesar Romero) for swag ; the motives of the inventor's mistress (Natalie Moorhead); and further action involving various thugs, reporters, policemen, low-life's, and party-goers who turn up to disturb the Charles's vacation. The other characters include the inventor's psychology-spouting son, the mistress's various lovers, the scientist's lawyer and other types drawn from the 1930s. The production is a serviceable one, with script by Albert Hackett and Frances Goodrich,from the Hammett novel \"The Thin Man\" (the title referring to the inventor, not Nick Charles). The set decorations were supplied by art directors Edwin Willis and David Townsend, the production was designed by Cedric Gibbons. The cinematographer was James Wong Howe. The talents who contributed to the film account for its smoothness and some of its immense popularity. Critics love to expound on why the series was so popular; my answer is simple--if you do not look at it too closely, this is a romantic turn on the boozy detectives of the 1930s, with swift pace, good acting and a story-line that can usually be followed. But the fun in this adventure-comedy lies in seeing Nick do what he does so well, playing in a merry war off Nora; his theme is, \"Have fun doing whatever you're doing\"--and so is hers...The viewer is invited to share their hi-jinks, dangers, setbacks and encounters, a fine way to make an entertainment film work, by my lights.",
            "review_date": "2005-07-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"The Thin Man\" (1934) is one of the best films ever made....a great stage play made into a great movie!",
            "content": "\"The Thin Man\" (1934) is one of the best films ever made....a great stage play made into a great movie.It was originally a stage play written by Dashiell Hammett, and no doubt retained most of Hammett's great writing when Albert Hackett and his then young wife, Frances Goodrich turned the play into a movie script.This was the first important movie where the lead romantic couple exchange in banter and \"repartee\" which reflected the acceptance (finally) in the 1930's the \"the independent woman\" (even married independent women!) in USA culture, less than two decades after women finally \"got the vote.\" Major players and minor supporting actors in \"The Thin Man\" (1934) are all lovable, and that includes the villain, lawyer Herbert MacCauley, marvelously portrayed by long time movie character actor of note, Porter Hall.The story is a \"Whodunit\" and the audience never guesses the real culprit until the penultimate scene (the next to the last scene) when hero detective, Nick Charles (played to perfection by William Powell), hosts a grand dinner for half a dozen likely suspects (and police in attendance, too, both as tuxedo clad guests and also as waiter staffers!), and fingers the guilty guy.Many people opine that the best final scene in any movie is the one in Casablanca (1943) where Humphrey Bogart (playing \"Rick Blaine\") tells Claude Rains (playing the French \"Prefect Of Police\" who just helped Bogart and now becomes a fugitive along with Bogart) tells his new friend, and fellow accomplice, \"Louie, I think this is the beginning of a beautiful relationship.\" But I think \"The Thin Man\" (1934) has the best final scene of all.It's a rapid fire \"end of the film\" portrait of the Nick and Nora Charles married couple about to get to bed in a moving railroad train private room, this in a movie which shows the two alone together in bedrooms before with nothing sexy at all happening between them.The audience sees unexpected beginnings of \"married love,\" and the camera switches instantly to the nighttime train entering a tunnel with the \"San Francisco, Here I Come\" tune played brightly and zestfully.Alfred Hitchcock used the same \"affectionate couple (Cary Grant and Eva Marie Saint) about to get into bed together on a train, then quick switch to train entering a tunnel\" at the end of \"North By Northwest\" (1959), but that movie ending didn't have \"San Francisco, Here I Come\" music along with it, and that makes all the difference!---------------------- Written by David R. \"Tex\" Allen, SAG Movie Actor.Email Tex Allen at TexAllen@Rocketmail.Com Visit WWW.IMDb.Me/TexAllen for movie credits and biography information.",
            "review_date": "2012-11-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A drinking detective with his wife on the wagon resolves some murders with their dog.",
            "content": "A drinking detective with his wife on the wagon resolves some murders with their dog: Still more hilarious than ever after 80 years and better than most comedies made since, in its well mixed cocktail of screwball comedy and serious murder stuff - the murder doesn't occur until after 20 minutes and many drinks, which most of the film is decently decorated with, including Christmas parties and many other drinks and parties, keeping the intrigue and comedy going all through the film, while the drinking detective just keeps plodding on in resolving the perfectly impossible murder case, which no one else would have been able to get any head or tail out of. Maybe the dog Asta with her constant intrusions helps the case progressing and adding to the very entertaining tempo. The real thriller doesn't set in until after the first hour, with the dog really adding to it. The triumph of the film though is the sustained witty dialogue, which never tires off or stops shooting with hits every time. Wonderful to see it again after half a century - hope to see it again after another half century.",
            "review_date": "2015-03-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolute fun with the right mix of Chemistry",
            "content": "The Thin Man is one of those unique gems that more than holds it's own even 70 years later. It is a sheer delight made up of a quirky \"who dunnit\" and a cast of characters, many who you'll think back about and have a good laugh. And leading this cast are Nick and Nora Charles (William Powell and Myrna Loy). Their chemistry is marvelous: a wink here, a nod there, a drink (or three) here, here and here.Actors, screen writers, producers and directors KILL for a chemistry that these two seem to have been born with when paired up for this film. And it comes off to the audience so natural, so real... and absolutely believable.\nSure some of the dialogue might be \"dated\" but in this case that only adds to the charm of the entire film. It's not like we're talking \"Starsky and Hutch\".With this movie you get the the whole package; great story, great writing, great cast and great acting. And putting it all together is that wonderful Chemistry. It keeps me coming back to watch it over and over again (maybe 7 times now). I can't wait to get the DVD. (yes, that means that all the times I've seen it have been on the big screen in a rep theatre).",
            "review_date": "2003-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sparkling champagne",
            "content": "Read the novel once, seen the film a dozen times - both classic but the film was made easier to follow and besides Powell & Loy brought something extra to the story. And to the movies in general too of course, with their mutually fast and affectionate wise-cracking risqué badinage they were a perfect team. Even now this happily married romantically attuned scenario is uncommon, and anyway the word \"risque\" has given way to \"in your face\" nowadays.The thin man here didn't have much of a part, looked slightly plump to me and seemed a too thoroughly nasty guy to deserve anyone's sympathy. Nick & Nora quipped and drank their way from scene to scene, getting sucked into solving a multiple murder case while Asta had his own comedy sub-plot going off. Presumably a long time in the pc future there will lots of cuts made so that the idea that continuously drinking alcohol and smoking cigarettes is fun is erased. By that time only sex and violence will remain untouched. Director W.S.Parks and his team were routinely inventive throughout - even the Philo Vance into Nick Charles cinema trailer was clever stuff for 1934.It took 11 days to make, came in way under budget, turned out an out and out classic eventually with five sequels and is still watched and admired by fans of the cinema over 70 years afterwards. Will todays sex violence cgi riddled fodder that is labelled Classic or Art make an impression that lasts that long?",
            "review_date": "2006-04-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Minority vote about this movie",
            "content": "The Thin Man (1934) was directed by W.S. Van Dyke. This picture has an extremely high IMDb weighted average of 8.1. I had great hopes for this film, which we saw at a New Year's eve showing at the excellent Dryden Theatre at George Eastman House in Rochester. I'm sorry to report that the film didn't work for me at any level.William Powell and Myrna Loy play Nick and Nora Charles. He's a former detective, she's an heiress. They are rich, glamorous, and very, very sophisticated. Powell and Loy were wildly popular in these roles, and reprised them again and again. Powell more or less looks the part, but I think Loy was miscast. She looks and acts like one of the bright, snappy, working-class women in a screwball comedy. She doesn't look or act like an heiress. A second problem I had with the film was the unending focus on alcohol consumption. Getting and being drunk was far more acceptable in society then than it is now. Even so, the film really wasn't about mystery or romance--it was about drinking. People are endlessly talking about drinking, or they're drinking, or they're holding icepacks to their heads on the morning after. Powell acts half-drunk for most of the film. (For the rest of the film he acts drunk.) I just don't find that entertaining. For me, the highlight of the evening happened before the film. The Eastman House volunteer who presented the film came dressed in a long, slinky, 1930's-style gown. She gave a witty, intelligent talk. This woman had the physical and mental attributes that would have made her a perfect Nora Charles. It's too bad that her role ended when the lights in the theater dimmed.P.S. I rarely post negative reviews of films that other IMDb reviewers have liked. That's not because I'm timid, but rather because if others liked them, I usually like them too. However, on the rare occasion when I've criticized a popular film, I've been sent some abusive personal comments. If you disagree with me, I'm happy to have you tell me so. Maybe I'll learn why other people think this film is so good. However, please don't use the opportunity to comment on my parentage, my species, or the depth of my mental inadequacies.Thanks,Red-125",
            "review_date": "2012-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is great.",
            "content": "I found very little to fault here-great acting, involving if twisty murder mystery plot, fun sets, clothing(check out Loy's wardrobe-almost outta a Flapper comic strip!), wry sense of humor, you name it. Very professionally made film, despite being shot in two weeks. They didn't call director W.S. Van Dyke 'One Shot' for nothing. Here it works.You kinda do figure out early on that the Mel Blanc looking lawyer is at least involved in the killings, and some of the dialogue is clichéd. But that's minor-I enjoyed the interplay between Loy and Powell very much, their sloshed-boozy-riche lifestyle was perfect for the times and has lasted.****",
            "review_date": "2005-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of my favorite films",
            "content": "I've watched this film many times and still find it quite entertaining; only a handful of movies would do that for me. What you get with \"The Thin Man\" is the delightful combination of mystery and humor. William Powell and Myrna Loy have great chemistry; while director, Woody Van Dyke, propels the action along at a fine pace. One thing about the film that I find interesting is the apparent illogical snow scene very early in the film. This occurs shortly after Maureen O'Sullivan says good-by to her father, before his disappearance. As she getting into a taxi, it's snowing. Later at Christmas time, we learn that her father has been missing for three months! If so, we have to accept a mid-September snow storm in New York City! -- that requires a goodly suspension of disbelief. :) I'd love to know why the snow scene was ever shot? or, why it wasn't later cut out of the finished film?",
            "review_date": "2005-02-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Best and Brightest of Classic Romantic Comedy-Mysteries",
            "content": "No wonder THE THIN MAN (TTM) is a classic. This smart, snappy romantic comedy-mystery is so wryly sophisticated that, among other things, it almost makes excessive drinking look fun! :-) William Powell and Myrna Loy have breezy chemistry to spare as Nick and Nora Charles (inspired by the relationship between Dashiell Hammett and Lillian Hellman). Just goes to show that when written and portrayed well, a happily married couple can be far more loving, sexy, and fun to watch than the childish bickering too many writers mistake for sexual tension. My hubby and I frequently quote its dialogue, especially the thug/waiter's \"Have a cocktail!\" and blonde moll Gertrude Short's \"I don't like crooks, and if I *did* like crooks...\" tirade. That's taken verbatim from Dashiell Hammett's novel, by the way. This film, along with the '41 MALTESE FALCON and the '42 GLASS KEY, got me wanting to read Hammett's books and turned me into one of his fans! TTM is not only one of my favorite lighthearted mysteries, it's also one of my favorite New York-set movies (as a native New Yorker, I'm a sucker for flicks set in my hometown). Considering TTM takes place during Christmas week, it quickly became one of my fave Christmas movies, too. :-) The whole THIN MAN series is a joy to watch, but in my opinion, the first one is still the best!",
            "review_date": "1999-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Four Academy Award nominations (including Best Picture)",
            "content": "Nick and Nora Charles cordially invite you to bring your own alibi to The Thin Man, the jaunty whodunit that made William Powell and Myrna Loy the champagne elite of sleuthing. Bantering in the boudoir, enjoying walks with beloved dog Asta or matching each other highball for highball and clue for clue, they combined screwball romance with mystery. The resulting triumph nabbed four Academy Award nominations (including Best Picture) and spawned five sequels. Credit W.S. \"Woody\" Van Dyke for recognizing that Powell and Loy were ideal together and for getting the studio's okay by promising to shoot this splendid adaptation of Dashiell Hammett's novel in three weeks. He took 12 days. They didn't call him \"One-Take Woody\" for nothing.",
            "review_date": "2019-07-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb combination of comedy and crime-drama: very funny and highly intriguing",
            "content": "Eccentric inventor Clyde Wynant has disappeared and is suspected of murdering his mistress. Wynant's daughter Dorothy approaches former private detective Nick Charles to investigate but he is not keen. However, the more the case goes on the more he and his wife Nora are drawn into the affair.Superb murder mystery comedy-drama directed by WS Van Dyke and based on a novel by Dashiell Hammett. The crime side is very cleverly and stylishly done, with the culprit and even the sequence of events only revealed at the very end. While some pieces of the puzzle can be strung together, the perpetrator is never obvious.Great atmosphere to the mystery side, reminiscent of film noir, even though that genre did not exist yet (in name, at least).However, this is more than a murder mystery, far more. There is a large comedic element to proceedings, and the humour is fantastic. It usually involves Nick and Nora Charles (William Powell and Myrna Loy): the banter and chemistry between them is off-the-charts, amps-to-11 brilliant. Some incredible lines and physical comedy. Just some of the looks they exchange are hilarious and wonderfully flirty.The film garnered four nominations in the 1935 Academy Awards - Best Picture, Best Director, Best Adapted Screenplay and Best Actor - but unfortunately did not win any Oscars.A classic.",
            "review_date": "2020-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A good mixture of surprisingly dark drama and lighthearted comedy",
            "content": "I saw this after I had seen some of the sequels and was a bit surprised at the very dark storyline surrounding the more light material involved with solving the mystery.In the first scene we see The Thin Man who is a scientist involved in some highly suspect work that eventually gets him killed. We see that he is not a very sympathetic individual, but he does have a soft side when it comes to his daughter. There is some evidence that he is also capable of slapping women around, as indicated in a later scene with his mistress.The first half hour's darkness works surprisingly well with the more lighter material. The sequels were more interested in the shenanigans of Nick and Nora, but here they seem more involved with the sad characters and Nick's one-liners are not as pronounced as the would be in the sequels. Nick and Nora are actually more supporting characters and that may be a bit disappointing. Furtunately, there are many comic highlights involving the geeky son, the inept police and the shrill ex-wife of the scientist. The motive of the murderer is a bit underdeveloped and the ending is a bit of a letdown. It is always the least likely suspect but watch closely and you can actually figure it out pretty quickly.The movie's pace is also a bit slower than its sequels' but that is because of the relatively new adjustment to sound and not a fault of the actors. There is almost no underscoring and that gives it a sort of creepy vibe in the dramatic scenes. Good first movie but the two first sequels were a bit more funny.",
            "review_date": "2011-06-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "one of the finest comedy teams ever, romance and mystery with high society",
            "content": "myrna loy was a total babe, voted the woman men of the 1930's most wanted to marry! mainly because of her characterization of nora charles in the thin man series. nick charles is played by debonair and witty william powell, certainly one of the most underrated actors of any era. a true star pairing. this movie is meant to be watched with friends and family, hilarious movie with a lot of plot twists. one of the best motion pictures ever made. you will see why it spawned 5 additional successful sequels. i saw this movie for the first time over 30 years ago and have watched it 5 or 6 times since.each time i pick up more of the excellent script and acting. the cast is superb with the exception of the role of mimi.it isn't often you get a chance to watch perfection of an art and a fresh approach. this movie provided this at is inception and continues to live up to this high standards today as well, still fresh and fun after all these years.",
            "review_date": "2005-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Classic Hollywood Whodunit",
            "content": "\"The Thin Man\" is a smart, sophisticated, urban whodunit staged with Spartan style and little nonsense by W.S. Van Dyke who went on to helm the first three entries in the six film franchise. This was not the first time that mustached William Powell either played a detective or paired up with Myrna Loy. They co-starred in several movies before and after \"The Thin Man\" series, such \"Manhattan Melodrama,\" \"The Great Ziegfeld,\" \"Libeled Lady,\" \"Double Wedding,\" \"Love Crazy,\" \"I Love You Again,\" and \"Evelyn Prentice.\" This clever mystery thriller unfolds in three-acts. The suspects and the situation are laid out in crisp, expository fashion, and then we meet Nick & Nora Charles who become involved in the mystery. It seems our hero knew one of the suspects. This association draws him into the investigation. All this is capped off with a huge party that Nick throws for the suspects to smoke out the murderer. A variety of characters make up the cast. Remember, M-G-M produced this mystery back in 1934, when Hollywood couldn't depict violence with any realistic detail. As it is, \"The Thin Man\" looks like a drinking man's champ. Our hero guzzles and so do many others. Nick has guzzled six martinis by the time his wife joins him in the bar. This 91-minute melodrama qualifies as a Christmas movie because it occurs during the holiday season. The dialogue is often snappy, especially the being \"shot five times in the tabloids.\" The secretary of an eccentric scientist, Julia Wolf (Natalie Moorhead of \"The King Murder\"), has been murdered. The eccentric scientist, Gilbert Wynant (William Henry of \"Rubber Racketeers\"), vanishes afterward without a trace. Earlier, Wynant's wife Mimi (Minna Gombell of \"High Sierra\") divorced him because of a fling with Ms. Wolf. Worst, the conniving secretary was up to no good under Wynant's very nose. Quietly enough, Julia had been embezzling money; she cashed in two bonds amounting to $50-thousand. Wynant catches her with a gangster, Morelli (Edward Brophy), and they quarrel about the kind of men that she ahs been seeing. Gilbert Wynant is the jealous type. Myrna Loy's entrance in the action is funny. Asta literally drags her with packages piled up in her arms. Later, Wynant's attorney Herbert MacCaulay (Porter Hall of \"His Girl Friday\"), inquires if Nick is sleuthing for Wynant's ex-wife. Nick informs MacCaulay he gave up being a private eye four years ago. \"My wife's father died and left her a narrow gauge railway, and a lumber mill, and several other things. I'm taking care of them.\" When they have this conversation, Wynant has been missing for three months.The first entry in Metro-Goldwyn-Mayer's \"Thin Man\" franchise, \"The Thin Man,\" takes about twenty minutes before Nick Charles (William Powell) makes his entrance. He is teaching bartenders how to mix various alcoholic beverages. \"You see, the important thing is the rhythm. You should always have rhythm in your shaking. \"A Manhattan you shake to a fox trot. A Bronx to a two-step time. A dry martini you always shake to waltzes.\" When he completes this elaboration lecture, Nick takes the drink that he prepared so fastidiously and sips it. Wynant's daughter Dorothy (Maureen O'Sullivan of \"Tarzan of the Apes\") walks up to him and informs him that she remembers him from a case. Dorothy is searching for her father. Mimi goes to see Julia Wolf about getting more money. Morelli (Edward Brophy of \"All Through the Night\") learns about Julia's murder and barges into Nick's apartment. Morelli tries to kill Nick, and the authorities are suspicious about our hero. The police confiscate an unregistered gun and promise to ask him more questions. Nick Charles hasn't worked on a case as a private eye for four years. Since he has married Mrs. Charles, he handles his wife's considerable affairs. Eventually, Inspector John Guild (Nat Pendleton of \"Trapped by Television\") convinces Nick to work with them. Nora persuades Nick to take the case after the fugitive, Gilbert Wynant sends him a request to investigate the case. Reluctantly, Nick takes Asta and goes prowling in the dark. He uncovers an unidentified body in Wynant's laboratory. Meantime, the police and the press believe that Wynant has killed three people. The use of modern technology at the time helps Nick to find the answer that he is looking for but nobody else knows.Nick and Nora are a couple to watch.",
            "review_date": "2013-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Masterpiece",
            "content": "I got hooked on the THIN MAN films as a kid because my parents were big fans. I've since read the novel several times & actually feel that the movie is a little better. Hammett's novel is great, but the book's Nick Charles is nowhere near as entertaining as William Powell makes him. Myrna Loy is equally entertaining & the 2 actors seem to feed off of each others charm & wit to create arguably the best on screen combination/couple in the history of film. The film itself is wonderfully entertaining to watch for both laughs & suspense. It spawned 5 sequels starring both Powell & Loy, & all 5 are good, but the original & the 1st 3 sequels are the best, (probably because until the 5th film they were all directed by the legendary W.S. \"Woody\" Van Dyke). The films are usually characterized as comedy but in my opinion deserves mention with any good murder mystery films ever to come out of Hollywood. I would recommend this film to any audience & to all ages. It is a true gem.",
            "review_date": "2006-09-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"I've gotten used to you...\"",
            "content": "I can certainly imagine getting used to watching THE THIN MAN on a continuous loop--William Powell and Myrna Loy bring Nick and Nora Charles, an eccentric, decidedly alcoholic couple, to life. He's a private-eye in semi-retirement, she's a daffy heiress and they live in New York, enjoying each other's company and, of course, the drink. They quickly get embroiled in the Wynant family saga, however--Julia Wolf, the Patriach Wynant's lover, has been murdered. As the number of bodies and suspects keep increasing, Nick gets increasingly involved and eventually solves the mystery.I'm a big fan of murder mysteries (books, films, whatever), and the one contained in this film is itself pretty enthralling. It certainly kept me guessing all the way to the end just exactly who the murderer was. But another reason to watch this film is how it so cleverly weaves the murder mystery into the relationship between Nick and Nora--they banter, they kiss, they squabble... and yes, they have separate beds. But it still doesn't stop one from believing in their relationship. What's refreshing about Nick and Nora is that they seem perfectly at home with each other, and yet perfectly believable. I love it when they bat each other around, when he throws a pillow at her head, or he falls backward onto her lap, and when she gives him a toy shooting rifle for Christmas and blithely informs him that he gave her a lovely mink coat. Perhaps the only thing lacking is Nora herself actually taking a more active role in the sleuthing. All the same, the film is brilliant. William Powell is perfect as Nick Charles, whose intellect and skill as a detective is evidently *not* hampered (and probably aided!) by the amount of alcohol he consumes. Myrna Loy does 'cute' like no one can, and just lights the screen up whenever she's on it. One of my favourite scenes is when Nick has Dorothy in the room and is hugging her: when Nora comes in and sees them in a clinch, Nick makes a face at Nora, and Nora makes one back. It's adorable! Watching THE THIN MAN is really like sitting in on one of the Charles's elaborate dinner parties--they'll make you feel so much at home as their guests that you'll never want to leave!",
            "review_date": "2002-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stylishly Entertaining",
            "content": "Nick Charles, a retired private detective, is pressed back into service by Dorothy Wynant, a young woman worried by the disappearance of her businessman father Clyde. The case starts out as a simple missing person inquiry, but when Wynant's former secretary and mistress, Julia Wolf, is found dead, it becomes a murder. The police believe that Wynant is the obvious suspect, but Nick is not convinced. The mystery is eventually solved at a classic Agatha Christie-style dinner party at which all the suspects are present. The \"Thin Man\" of the title is Clyde Wynant; the fact that he is thin rather than fat turns out to be an important plot point, although I will not say what its significance is as that would be to give away too much of the ending. Audiences, however, frequently assumed that Nick himself was the \"Thin Man\", and five sequels were made between 1936 and 1947, all with the words \"Thin Man\" in the title. The film was made in 1934, just before the Production Code came into force. (Had it been made a bit later, the Hays Office might have taken exception to the fact that the hard-drinking Nick is seldom seem without a glass in his hand). Although it involves a murder case it is much lighter and more comedic in tone than the films noirs which were to dominate the crime genre in the American cinema a few years later. Nick's wife Nora, who helps her husband solve the mystery, is as important a character as he is, and their light-hearted bantering exchanges are a notable feature of the film. The third member of their team is their wire-haired fox terrier Asta, who frequently steals the scene from both Nick and Nora, although it is said that Asta, real name Skippy, was not as engaging away from the cameras as he appears on screen. (He is said to have bitten Myrna Loy in one encounter). The characters were originally invented in a novel by Dashiell Hammett, who based them upon his own difficult relationship with Lillian Hellman. The screenplay was written by Albert Hackett and Frances Goodrich, themselves a married couple. The film stars William Powell and Myrna Loy as Nick and Nora. Neither would have been the first choice of the studio, MGM, but the director W. S. Van Dyke persuaded the studio bosses that they were right for the roles. Van Dyke's instinct was a happy one, because it is the chemistry between these two which is largely responsible for lifting \"The Thin Man\" out of the category of \"run-of-the-mill whodunit and turning it into a stylishly entertaining classic, still fondly remembered today more than eighty years after it was made. 8/10",
            "review_date": "2017-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Thin Man eloquently and unashamedly melds screwball-y jollification with the morbid procedural of a whodunit",
            "content": "Ex-sleuth Nick Charles (Powell) doesn't really want to go back to his old profession and why would he? He and wife Nora (Loy) live in the lap of luxury with nil to worry about. But Dorothy Wynant (O'Sullivan) is an old acquaintance of him and on the Christmas eve she has a foreboding that her father Clyde (Ellis) seems to renege on his promise of returning before Christmas to attend her upcoming wedding with Tommy (Wadsworth), as Clyde has gone on a secret business trip months earlier and no one has heard from him since, our reluctant gumshoe only manages to squeeze an interest in....read rest of my review on my blog: cinema omnivore, thanks!",
            "review_date": "2019-08-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Never before has murder been this much fun",
            "content": "Bringing Dashiell Hammett's The Thin Man to the screen was a stroke of genius. Its's not only a fair adaptation of the original book, it was also one of the biggest grossing motion pictures of 1934 and helped turn it's two leads, William Powell and Myrna Loy into Hollywood royalty.Having starred as detective Philo Vance in a series of Movie 'Murder Cases' William Powell was well versed in the sleuth genre, but in the ever serious and slightly square Vance, Powell was rather limited in the amount of characterisation he could use. What a joy it was therefore that Powell was able to show the lighter side of both Vance and himself in the ever lovable and witty character of Nick Charles.Charles is a retired but legendary private detective who for the last four years has lived a respectable life after marrying Nora, a wealthy heiress, played by the wonderful Myrna Loy. The two seem to have spent their marriage in a permanent state of intoxication, bought about not only by love but the copious amounts of alcohol they consume. For the first and possibly the only time in motion pictures we are presented with a couple of drunks who are both likable and inoffensive.Whilst on a Christmas Holiday in New York, Charles is approached by the daughter of Clyde Wynant a former client, who is worried as her father seems to have disappeared. Although reluctant at first to have anything to do with the case, he is forced to act when a the dead body of Wynant's girlfriend is discovered, and all the evidence points to Wynant as the murderer.Knowing Wynant, Nick is convinced he is not the killer, and after considerable brow beating by Nora, frequent visits from Wynant's family, an attempt on his life and increasing suspicion from the police, he reluctantly comes out of retirement to find the real killer himself.After suitable investigation and in true Agatha Christie style, Nick invites all the suspects to a black tie dinner party, and by explaining the whole saga from beginning to end he forces the murderers hand and unveils the killer right in the middle of the fish course. Wonderful Stuff.Sounds like a serious melodrama doesn't it, but believe me this film is a comedy through and through.In Nick and Nora, Powell and Loy create the perfect screen couple, always drinking, always making wise cracks at each other, in some sort of permanent game of oneupmanship but with all always completely happy. It was their performances which helped garnish this film with five sequels.Although Powell and Loy would also be paired together in several non- Thin Man movies, it is the characters of Nick and Nora Charles for which they will be best remembered.I love the scenes where he tries to get rid of Nora so she's not in the way...hilarious, and I love the way Nora tries to investigate matters herself always thinking shes giving the 'flatfoot' a run for his money.This is the original and the best of The Thin Man series, with so much wit and humour and just the right amount of suspense and mystery, The Thin man is a detective movie which pretty much set the mould for how movie detectives would be seen from that day forward.Special mention to Edward Ellis, who appears briefly as Clyde Wynant who in fact is the the title character, The Thin Man himself, although the legend would be applied to all Nick and Nora Charles' movie adventures, this is the only film in which he appears.",
            "review_date": "2005-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A classic duo",
            "content": "This film really is brilliant, moreso for the fact it was filmed in just two weeks. William Powell and Myrna Loy are perfect together. In their constant inebriated state, they trade searing quips that still crack me up twenty times after seeing it. Myrna Loy is stunningly beautiful, and who can forget Asta. My favorite line: \"He never came anywhere near my tabloids.\" That one still has me ROTFL.",
            "review_date": "2001-03-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely fabulous.....A MUST SEE.... ***** out of *****",
            "content": "Classic Murder Mystery/Comedy from the early 1930's which is just as enjoyable and humorous to watch over seven decades later, it doesn't seem to have aged as much as other films from the era. William Powell and Myrna Loy play newlyweds Nick and Nora Charles along with Asta the pooch who are in New York City at Christmas, Nora is an 'it girl' from a wealthy family where as Nick is rather a rough and ready Private Detective who keeps bumping into acquaintances he has sent down the river over the years. Both Nick and Nora very quickly get involved into the sudden disappearance of a wealthy inventor.The Scene in the bedroom brings a smile to your face as Nick and Nora, a married couple are seen sleeping in separate beds, as Hollywood couldn't show a man and a women sharing a bed in them days, how times have changed!!! Powell is superb and received a Oscar nomination for his performance in this movie and the chemistry between him and Loy is amazing Great Movie followed by 5 sequels between 1936 & 1947/***** out of ***** (A Rare 5 star Movie!)",
            "review_date": "2008-03-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A stylish and humorous detective story from the Dashiel Hammett",
            "content": "A slightly different take than the normal Hammett hardboil, this features a husband/wife team who somehow find the time to solve cases between long bouts of heavy drinking and hosting parties. The rich blend of dialogue overshadows the few weak characters, especially the antagonists and supporting players, but overall does justice to the genre.An eccentric inventor goes missing, and his mistress/secretary turns up murdered. A man who was seen at the scene of the crime (and is consequently played in such a way as to make us believe he is responsible for the woman's death) is also killed. The detective Nick Charles (William Powell) and his able, beautiful, and insightful wife Nora (Myrna Loy) only officially take the case to discover the killer and the whereabouts of the mysterious `Thin Man.' Nick rousts the killer using a dinner party, with all the suspects as guests, and his ingenius wit, improvisation, and ability to hold attention as the hooks.Powell and Loy work admirably together (as they did in four other `Thin Man' movies), playing off each other, complimentary and interesting. Their devotion to each other matches their aloofness from the case, and ultimately it is the charm and good-natured aspects of their characters that pull this movie to its final great moment.All the typical 30's detective movie characteristics are here: witty dialogue, veiled sexual innuendo, the dull but likeable police detective, the woman in distress. Here, they play together in a very likable way. The ending, while not glistening with the Hitchcockian Freudism of North by Northwest, is wonderfully suggestive, and brings to a close excellent performances by Powell and Loy.",
            "review_date": "2004-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watch this film",
            "content": "One of those confusing Movie names that seem to get addled unintentionally,ie; \"The Pink Panther\" which of course has nothing to do with the Clouseau character save for the title in the first movie, but becomes synonomous thereafter. Powell and Loy tower over this film with the sort of chemistry that modern day movie makers either dont look for or consider unneccessary, only in buddie films such as the Lethal Weapon series does anything come close.The script fairly zips along with great one-liners being scored off each other, eg;(Loy)\"it says you got shot five times in the tabloids\",(Powell)\"I was shot nowhere near the tabloids\", fairly risque for 1934. Had Powell been born fifty years later, accent apart, he would surely have given Sean Connery a run as prime candidate for the first serious Bond,he even drinks Dry Martinis, for breakfast, lunch and dinner,in fact the alcohol consumption in this film is no less than staggering there's hardly a scene with him not drinking. The plots o.k. but watch this film for the performances!!!",
            "review_date": "2003-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good whodunnit with great dialogue",
            "content": "No dated material here, as The Thin Man stays relevant and funny 70 years after it was made.  William Powell and Myrna Loy (who looks like a 30's version of Debra Messing) share some crackling dialogue as Nick & Nora Charles that had me laughing the whole way through.  If you've ever thought about hosting a cocktail party at your house, this movie would be perfect reference material to keep the guests laughing while you serve the drinks. There's a murder mystery good enough to hold your attention as well, but the real attraction is the snappy banter between the two leads.  There are a few sexual references thrown in under the radar (well, until Powell turns and looks at Loy with his eyes bugging out) that are pretty original.",
            "review_date": "2004-07-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nick & Nora are infinitely entertaining",
            "content": "This murder mystery is fine, but what really impressed me about The Thin Man is the relationship between the characters of Nick & Nora. It's an absolute delight to watch William Powell and Myrna Loy play off of each other with witty banter and even simple facial expressions. I would have liked to see more of it, actually. Now I understand why this movie launched an entire film series.",
            "review_date": "2021-09-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Hollywood pairing ever!",
            "content": "Forget all the rest! William Powell and Myrna Loy as Nick and Nora Charles were the greatest Hollywood pairing of all time. The on screen banter and sparks were flawlessly executed in this, the first of their \"Thin Man\" outings. Anyone with even the slightest interest in the classics should check out this smart and HILARIOUS murder mystery thriller!As the bodies continue to pile up, Nick keeps insisting \"I'm not on the case!\" (except for a case or two of Scotch, gin, etc.), but nothing can keep him from clearing his old friend's name and finding the real killer (even if only by accident or a little luck). Of course, with a little pressure from his rich and sexy wife Nora who matches him barb-for-barb and drink-for-drink, there's no way he can refuse! This film is easily one of the best of the classics with a pair of lead actors whose talent and timing on the screen stands up against the best of any generation!",
            "review_date": "2006-06-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not as good as it's made out to be",
            "content": "I wonder if some of the glowing reviews on here of this movie weren't written through a familiarity with the movies that followed this one in the Thin Man series. Too often the actors seem to stumble over their lines, which leads me to suspect that the movie was made hurriedly without much time for remakes. And it just isn't that clever or funny, nothing like some of the Thin Man movies that follow. Though the cast is first-rate, it seems like an MGM B movie.Don't expect a 10 here. It just isn't that funny.*Imagine two lines of filler here to bring this to ten lines. I have nothing more to say about this movie but I have to provide at least 10 lines.*",
            "review_date": "2016-02-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Vidiot Reviews",
            "content": "The Thin ManThe hardest part of being single at Christmas is figuring out what gift to get your sex doll.Luckily, the couple in this whodunit can verbally communicate their wish list to each other.When ex-gumshoe Nick Charles (William Powell) and his heiress wife Nora (Myrna Loy), along with their faithful terrier Asta, head to NYC for the holidays the last thing they expect to do is solve a murder. But when a client's daughter (Maureen O'Sullivan) asks him to find her missing father, Nick has no choice but to help when a decomposed body turns up.The first episode in the long-running film series based on Dashiell Hammett's fast-talking, hard-drinking, crime solving couple of independent means, this initial installment is a triumph, not only in its sleuthing but in the chemistry between Charles'.Incidentally, sticking a suspect's tongue to a frozen pole is a good way to get a confession. Green Lightvidiotreviews.blogspot.ca",
            "review_date": "2017-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Dialogue, great dog",
            "content": "The Thin Man celebrates romance, wit and a hell of a lot of drinking. The banter between Nick and Nora Charles is often brilliant, thanks mostly to William Powell's delivery and timing(Think Groucho Marx meets Alec Guinness). Lots of fun, a bit confusing at the end, but great dog. Not one to watch if you are trying to stay away from the bottle.",
            "review_date": "2000-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Living Life Through Drink",
            "content": "One of the great comedy/mystery films of all times and the first pairing of pretty, snappy-comeback Myrna Loy with witty, polished William Powell as Nick and Nora Charles in a Dashiell Hammett vehicle that relies more on comedic timing than the actual mystery. Nick, having recently married wealthy Nora and having no problem telling everyone he married her for her fortune, has retired from the detective business when visiting back in New York is asked by an old client's daughter to help her find old missing client. Along the way we are introduced to a handful of suspects that might have wanted to kill the old client or could even be him himself. While I enjoyed the red herrings and the mystery, it is definitely secondary to the by-play between Powell and Loy who have oodles and oodles of screen chemistry and great comedic timing when delivering lines. Loy is just wonderful as she pushes her often drunk husband back into detection so she can see what he used to do. Loy is at once beautiful yet unpretentious as a wealthy woman no less. This ability to do this is quite an achievement. Powell is equally as good musing about whatever after hoisting another drink. Of course, the biggest scene stealer is their dog Asta. This is classic stuff here by classic actors. Director W. S. Van Dyke knows how to make the most of the talent he has at hand. All of the supporting players are very good and the end finale with Powell having everyone over for dinner so he can tell who killed who is a real gem. The prevalence of drink in the film, though the impetus for much of the humour, is also a bit saddening as it must be that which keeps Powell and Loy so happy in their marriage as they never seem to be without! A true classic!",
            "review_date": "2006-07-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Well, look what's come to our party!\"",
            "content": "You wouldn't know how good it was going to be; not by watching the opening. This movie ought to start around the twelve minute mark, where the book begins: in a speakeasy, with droll rich people playfully dancing around the tangles of a plot. Instead we spend several lame scenes limping with second-raters who make blatant a number of motives only tangentially relevant and better left alone. Despite this dumb, dragging false start, THE THIN MAN turns out to be a really good time, nearly as enjoyable in its way as the genre-defining Dashiell Hammett novel that spawned it.Husband and wife writers Albert Hackett and Frances Goodrich, later to attain immortality receiving credit (partly due to others) for IT'S A WONDERFUL LIFE, here achieve far less with the shamus angle than with the comedy to which they were better suited. While its harebrained storyline bungles most of the mystery that compels the novel, the script makes a happy turn toward humor, the most exciting part of the book and by far the best element of the picture. To their profit they lift some of the best scenes directly into the screenplay. W.S. Van Dyke steers the film, mostly by camera placement and actors' performances, squarely into screwball territory. This salvages what could have been a sour punch and makes of it a sweet cocktail, one of those silver screen magic moments that sustains us through the long years of lesser fare.The supporting cast, most of it after Natalie Moorhead is killed, is excellent. Maureen O'Sullivan is as pretty and comfortable in a penthouse with Arrow Shirt men as perched in a tree with \"that ape son of a bitch\" Cheetah; her ingenue is not nearly as interesting as the book's dipso head case, but she does exactly what she ought with it, even if the screenwriters don't. Olympic jock Nat Pendleton gives a very nice turn as the thick but not completely stupid cop; Cesar Romero gives a delicious single take as the weary gigolo, in his only real moment of the picture. And Asta, the last of the smart wire terriers, is as fine a funny little dog as ever stole a scene from Cary Grant and Irene Dunne. Plus Gertrude Short, who gets to say: \"I don't like crooks. And if I did like 'em, I wouldn't like crooks that are stool pigeons. And if I did like crooks that are stool pigeons, I still wouldn't like you.\"The lion's share of the film's triumph of course is claimed by its two enormously watchable stars. William Powell is never anything but beautiful, with his ridiculous face and graceful drunkenness; Myrna Loy is always the very portrait of lovely mischief; together they embody insouciant sympathy with a success just about no other movie couple ever has achieved. Watching this movie it's hard to imagine them not in love, or even apart. Such chemistry is a delight to see and by comparison makes most real-life love strain for credibility. They have so much fun together that they inspire imitation, the sincerest form of appreciation. Christmas morning shooting ornaments off the tree with an air rifle became a tradition in my house; so did a lot of drinking. Some movie behavior doesn't politely translate to three dimensions, but I still shoot that BB gun at everything shiny. As Powell says to Loy when she's about to order food, \"Isn't that a waste of energy?\" Well, yes, when you've already got ambrosia like THIN MAN. We don't always, though; most of the time we've got crap to eat like this movie's many awkward and repetitive sequels. Fortunately for all of us, Powell also got to make stuff like MY MAN GODFREY and LIFE WITH FATHER, while Loy went on to live THE BEST YEARS OF OUR LIVES and help nurse THE RED PONY.",
            "review_date": "2009-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "THE PERFECT HOLIDAY MYSTERY, ANYTIME!",
            "content": "Set during Christmas, THE THIN MAN makes for solid holiday viewing if you're homebound for the holidays, however, it's an entertaining whodunit the rest of the year hands down. I have been tuning in this fine mystery for decades and it never gets old, special thanks to the chemistry between William Powell and Myrna Loy. This film actually marked Loy's emergence to starring roles and she most definitely earned the promotion and, with Powell, went onto to become one of the most dynamic screen teams in movie history. That said, Warner Brothers, the roaring engine it was in the l930s, assembled some of the best screen writers and supporting cast members to decorate this fine movie. It doesn't get any better than this when you are discussing vintage whodunits and, if anything, THE THIN MAN became the mold for many later movie mysteries and, eventually, television. The assembly of all the curious suspects toward the end of the film is now Hollywood lore and often imitated, but never matched in this outstanding series. Perhaps that's what the powers that be had in mind, back in the day. They were a clever bunch, a force not to be reckoned with. Whatever the case, THE THIN MAN has stood the test of time and now a new generation is enjoying this mystery and should. What's the old cliché, \"it's so old it's new again\"? Case in point. Addictive stuff, but who's keeping notes!",
            "review_date": "2020-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent",
            "content": "This is the start of an excellent series of Thin Man movies with William Powell and Myrna Loy as the high class couple Nick and Nora Charles, with their dog Asta. Nick is a \"retired\" cop who has married the rich socialite Nora. Nick is always getting involved in cases the cops can't seem to solve and of course he does solve them. Usually using his old contacts with his old underworld buddies that he had given breaks to over the years. The repartee between the couple is pretty funny at times and Asta is a well trained dog who comes across as cowardly. Both of the Charles's like to drink and party some, my kind of people!! Most of action is fairly low keyed and I think is done to make the audience think.",
            "review_date": "2013-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Crime thriller with lot to Laugh..!!",
            "content": "An Inventor is gone for a planned trip. He promised to attend his daughter's wedding before Christmas. As he didn't show up for a long time, his daughter is suspicious. Coincidentally, she meets a former detective and their family friend, Nick Charles. She asks him to find where her father was. Nick was retired from his job and enjoys the countless wealth of his wife's dead father. he has no interest in returning to his detective job. Suddenly, the came to know that the Investor is back. But, he was suspected for the murder of his secretary. Everyone thinks that the Detective is taken up the case, and everyone bothers him about it. Later, for fun sake, just out of his wife's curiosity, he decides to investigate the case.It's really interesting crime thriller with a lot to laugh. There is nothing slapstick. The characterization and actors performance made it a really enjoyable movie ever. Mr & Mrs Nick makes it a really worth watch movie. Hats off to William Powell and Myrna Loy.The movie was shot just in about two weeks with a very limited budget, but the result was amazing, the movie became a block buster as well as a classic.A must watch movie. Highly recommended.#KiduMovie",
            "review_date": "2017-02-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Accidentally Good",
            "content": "Spoilers herein.There are a few things I really enjoy in thinking about film. One is comparing remakes and sequels to their originals. Its odd how some work and some don't. And those that work often work for completely different reasons. The Alien series are four films as different from each other as any are from this.Another joy is comparing projects that fail that have almost the same recipe as those that succeed, or are thought to succeed. This movie features William Powell in pretty much the same character he had in several projects at about the same time. Many, like this one, had A-list actresses. The writing isn't particularly different from one project to the next.It seems almost that all the others were accidentally good. And this, accidentally good.Ted's Evaluation -- 3 of 3: Worth watching.",
            "review_date": "2004-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thin Man Thin on Specific Detail **1/2",
            "content": "Very dated film where Nick and Nora Charles having come into money thanks to the passing of Nora's father. Of course, this will not prevent Nicky from sleuthing cases as they come by.What was this character Wynant really up to? Why was he passing money over to this moll? There was really no love lost between them.The bodies begin to pile up and Nick does his usual investigation before summoning all the suspects to his dinner party where he will reveal the murderer.William Powell was made for the role of Nick, and a young Myrna Loy is his perfect foil as the ever sarcastic Nora.Problem here is that the picture is now 76 years at this writing and it's showing it accordingly.",
            "review_date": "2010-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My favorite movie; it is hilarious!",
            "content": "The Thin Man was a landmark movie. It introduced modern marriage to the screen, showing that marriage could be a good thing, fun, and not begin at the end of the movie. Nick and Nora Charles were married at the beginning of the film.  William Powell and Myrna Loy were fabulous in their roles as Nick and Nora, and reprised those roles for 5 sequels.  Along with Asta, the couple solved murders, in between, of course some laughs and drinks.  The movie was a little daring, but it is filled with so many jokes and funny situations. The first movie is the best out of all of them, and they get less funny and involve less drinking in every one. All of them are worth seeing, though, just for the partnership of William Powell and Myrna Loy. They were so good as husband and wife that many fans thought they actually were married in real life!",
            "review_date": "2002-04-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Thin Man",
            "content": "This film was based on one book, and because it was so popular it was turned into a six film series, with the lead stars returning for all of them, and this the first film is the one that appeared in the book 1001 Movies You Must See Before You Die, so I was most interested to watch it. Basically retired detective Nick Charles (Oscar nominated William Powell) and his wife Nora (Myrna Loy) are trying to settle down, but a friend of his, Clyde Wynant (Edward Ellis), the \"thin man\" of the title, disappears and may be involved in a murder, so he is pulled back into action to investigate. The man who has vanished is the prime suspect to the murder of his former secretary and girlfriend Julia Wolf (Natalie Moorhead) as all the evidence points to him, but the one who doesn't believe he has any involvement is his daughter Dorothy (Maureen O'Sullivan), and is the one who convinces the former private eye to take the case. This amuses his wife, but Nick does stumble onto some clues and pieces together the facts for an intense investigation, and he eventually comes to conclude who the murderer really is, but he is not telling anybody his findings until an event he is putting on. All the guests he is inviting are the ones he believes are capable of murder, but he knows only one really did the crime, and a classic dinner party scene, and with explanations of each person's involvement in the recent events, including the skeleton body of missing Mynant found who was killed for his money. Also starring Nat Pendleton as Inspector John Guild , Minna Gombell as Mimi Wynant, Porter Hall as Herbert MacCaulay, Henry Wadsworth as Tommy, William Henry as Gilbert Wynant, Harold Huber as Arthur Nunheim, Cesar Romero as Chris Jorgenson, Edward Brophy as Joe Morelli and Cyril Thornton as Tanner. Powell gives a leading performance with his clever theorising and charming wit, Loy is really likable as his wife who is by his side throughout, together they make a great duo, so it is no wonder that sequels followed, if you like mystery mixed with some good laughs then this good entertainment, a fun classic detective comedy. It was nominated the Oscars for Best Director for W.S. Van Dyke, Best Picture and Best Writing, Adaptation. It was number 32 on 100 Years, 100 Laughs. Very good!",
            "review_date": "2013-02-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best of the bunch",
            "content": "Great fun all around here.  The plot revolves around the death of a secretary whose boss goes missing shortly after.  Oh, and of course she had gangster connections as well.  As with other 'Thin Man' movies, many of the characters featured have motives and justifications for the crime, and the ending is genuinely unpredictable.  I don't think that it's the funniest of the series, but the story is superior and compensates for that. And, of course, there's the inimitable chemistry between Powell and Loy.  The perfect marriage, indeed.",
            "review_date": "2003-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "witty dialogue and interesting characters",
            "content": "I am always so happy when the Thin Man movies are shown on AMC or TCM. The witty dialogue doesn't loose it's freshness and the characters are fantastic. I especially like the interaction between Myrna Loy and William Powell. If you want to see a romantic comedy mixed with a murder mystery, I recommend this series.",
            "review_date": "2002-05-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wow.",
            "content": "I hate to gush but this is an incredibly good film. I don't know if I've ever laughed harder at a non-slapstick movie. The characters are intensely believable and yet funnier than anyone I've ever met. The pacing is very modern, the plot is complicated yet very clear, and I felt like only half an hour had gone by when it ended. Other films I've seen from the thirties have felt like curiosities, but besides the decor and a couple of silent film gestures, I felt like I was watching a contemporary film that just happened to be in black and white. Nick and Nora are people you would want to know, although maybe not attend their parties at the risk of your liver. What a show! I'm definitely planning to watch the other five films as soon as possible.",
            "review_date": "1998-11-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Meddling Adults",
            "content": "William Powell and Myrna Loy, will I ever get bored of watching these two? I wish I could possess the wit and charm of William Powell, someone who can still remain classy and have a way with words even when inebriated (which is often). I wish I could be married to a woman like Myrna Loy. For Nick and Nora Charles being married is just one crazy murder mystery solving adventure after another! With so many movies in which marriage is a hindrance, here are two people who revel in being married without the worry of children (for now anyway). I find myself jealous at these two for their existence of seemingly never-ending fun. It's no wonder audiences of the 1930's where attracted to these escapist fantasies in their droves. Sometimes a man and a woman with impeccable chemistry is all you need for cinematic greatness.The Thin Man gave birth to Myrna Loy receiving the label \"the perfect wife\". Loy disliked this label but it's not hard to see why she got such a reputation. She seems too perfect to exist like she was conjured out of the mindsets of what heavenly actress should be. It's not all just Nick and Nora though, there is an entertaining supporting cast including the Wynet family, the classic screwball comedy troupe of the oddball family. It's not My Man Godfrey levels but they are a bunch of nuts, with my favourite being the wannabe criminologist who is the polar opposite of the suave Nick Charles.The Thin Man is a fairly inexpensive feature but shows how you can do so much with so little. The sequels had larger budgets and never captured the feeling or the intimacy of the first film. The scene in which Nick and his dog Asta go sleuthing by themselves in an inventor's laboratory is almost entirely silent, features gorgeous noir cinematography and has me breathless watching the whole thing; setting the stage for the shady noir world of the 1940's. I've seen The Thin Man several times and I still don't understand the plot yet that doesn't make the movie any less engaging. Rather it makes me want to watch the film again in hopes that I eventually will understand the plot.",
            "review_date": "2015-02-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Style for others to beat",
            "content": "Everyone seems to fit in the cast for this movie and it is a pretty large cast. William Powell and Myrna Loy as Mr and Mrs Nick Charles come to New York for a vacation and literally get dragged into a murder case.All the characters that drag them in seem to have problems of their own. What is amazing is how many plots and sub plots are in the script for a relatively short film and yet how things are sorted out by the end.Being the time it is, the plot is about an odd inventor who vanishes and then over 3 months is blamed for killing several people even though no one has seen them. This thin man (Nick Charles) is literally dragged into this and his curious wife Nora keeps getting her nose into it by accident.The ending is the classic dinner party where all the suspects are gathered by Charles and served fish. Things get tense and pretty formal until the solution presents itself. The film is complicated, stylish, and well made for this era. The cast is top notch and the pacing are perfect. For anyone who wants to go back to 1934, this is a great example of how well made a mystery film could be made from Dashiell Hammett's book.",
            "review_date": "2015-11-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One the all time best films ever made",
            "content": "The Thin Man movies, especially this the first one, are a wonderful combination of mystery and comedy, and they take they viewer back to a time when there was nothing to worry about really. We were between World Wars & everything looked rosey. Nick & Nora, & their beloved dog Asta, solve a very odd case of bones in a basement. They do it with class, charm, & a LOT of alcohol. I love the Thin Man movies because of the way life was & the way I wish it could be.Be Sure To See the Entire Series of the Thin Man Movies: The Thin Man, After the Thin Man, Another Thin Man, Shadow of the Thin Man, The Thin Man Goes Home, & Song of the Thin ManOnly the first is on DVD, the rest are on VHS.",
            "review_date": "2004-07-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is a fabulous movie",
            "content": "The cast alone should be enough to entice any fan of black-and-whites to give this film a whirl: William Powell, Myrna Loy, and Maureen O'Sullivan just to name a few. Mystery fans should give this one a whirl, too, as the novel upon which it is based was penned by Dashiell Hammett, the author of \"The Maltese Falcon\". A wonderful set of twists and turns and a story that can be watched over and over again make this a good mystery - even for non-fans like myself. Also, the movie includes a good deal of humor which is featured most prominently in the dialog between Nick and Nora Charles (Powell and Loy). The verbal sparring of these two characters makes this movie, and ultimately the series of films, great fun to watch.",
            "review_date": "2006-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent movie that should be watched by true movie buffs.",
            "content": "I'm glad I didn't wait any longer to see this movie.  Movie rentals are doing away with Classics and it would be a shame to miss this movie. Great acting and script.  Fast pace which makes it entertaining by having both wit and suspense.  I hope to see the rest in the series before they disappear for good. William Powell was almost as good in this as he was in To The Ends of the Earth which had to be his magnum opus.",
            "review_date": "2000-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The first of many \"Thin Man\" films.",
            "content": "Great cast, whose stars appeared in countless other Hollywood films. Most interesting about the film is Hollywood's early fascination with cigarettes and alcohol, both heavily used as props. This film was made shortly after the repeal of Prohibition in 1933, so Americans were free to drink alcohol again legally and did so in a celebratory fashion and to excess, as the film portrays. The use of the dog for added comedy is among the first, if not the first, uses of an animal as a supporting character, though I did not see him billed at the end. The detective genre became immensely popular through Hollywood films such as this one.",
            "review_date": "2001-09-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Thin Man is absolutely amazing.",
            "content": "The Thin Man, starring William Powell and Myrna Loy, is the story of an inventor named Wynant who goes out of town and has not returned. He is reported missing by his daughter Dorothy, played by Maureen O'Sullivan. She reports the disappearance to the police and tries to get an old friend, a retired detective, our old friend Nick Charles, played by Powell, to help find her father. He reluctantly ends up taking the case. The father turns up, Nick Charles meets a variety of likely suspects in a string of murders and then the madness ensues. This film is one of the most entertaining and widely known and popular detective series of the 1930's. my grandmother is responsible for introducing this film series to me and I credit her for generating my interest in the great murder mystery. I have fond memories of sitting down in front of her television with a cup of hot chocolate or a bowl of warm soup and watching as countless detectives investigate, interrogate and decipher clues all on the way to unmasking the killer and bringing them to justice. While the concept and the theme of this timeless genre has been done countless times over, The Thin Man seems to bring a fresh new element to a genre that people have seen so many times over again. The great detective style was not a new item in the 1930's. There were other greats like Charlie Chan, starring mostly Warner Oland and starring in a few Charlie Chan films was Sidney Toler. Charlie Chan was a Chinese detective who could always catch the thief, find the missing item or bring the murderer to justice. Another popular detective was Mr Moto, a Japanese detective who was successful and popular until he was canceled following the bombing of Pearl Harbor during World War II. Even the great Boris Karloff took a turn at playing a detective in 1939 with \"Mr. Wong in China Town.\" The Thin Man follows in with this tradition of \"who-done-its\" by having first, a crime. Initially, there was a missing person but a few murders take place and you can not have a detective story without a crime. Murder is almost always the best crime to solve. Most detective movies have a twist and The Thin Man is no exception. You will have to watch the film to find out what it is. The film also has a few characters meant to lead you down false paths of accusation, also called red herrings. The last major similarity with this film and films like it is they star a brilliant and cunning detective who creates an elaborate plan, or scheme, to unveil and capture the villain. What makes this film stand out so much are a couple of things. First, this is not only a mystery but it is also a comedy. This film has many hilarious lines and bits that are throughout the entire film. The second thing is the fact that the lead detective will take advice and help from others and will talk about the case, if only in small amounts, with his wife. In those days, women were never as equal as men, on any level, in the movies. Men were smarter, faster, more courageous, and funnier while women were almost only the \"damsel in distress\" that needed the saving. Nora Charles, played by Myrna Loy, trades punch-lines with her husband and lead detective Nick Charles, played by William Powell throughout the entire film. In one scene, Nora sets up the joke and Nick executes it and soon after, Nick will set up the joke and Nora will execute it. When she does pull off a very funny joke, possibly at her husband's expense, he never tries to make her look foolish or silly. He also never implies physical harm or damaging words towards her for such insults. They were a loving, happy, and somewhat equal couple on the big screen and as an audience member (although many years later on DVD), I picked up on that and relished that aspect of the film. A few small notes and observations about the film's special effects department are when they believe they know who the murderer is but do not know where the suspect is, they have a montage of newspaper headlines, naming the killer and the third victim's current state. This technique would later appear in the classic Citizen Kane by Orson Wells. The second effect follows directly after the first. It shows what looks like a piece of fishnet stocking type material and is slowly stretched over a tabletop map of the United States, originating in New York and reaching all the way to California. This is supposed to symbolize that the information that the policeman is typing out is being sent all over the country via mail and word of mouth. I personally love this effect and believe it shows creativity, given what little materials they had to work with back then. These effects appear approximately one hour and eleven minutes into the film. To conclude, the Thin Man contains a man who is not only brilliant in what he does but also a man who loves his wife and shows it with everything he does. They had a fantastic relationship together and that was almost unheard of, the women getting as many, if not more, of the big jokes as the man. It also contains priceless memories of my grandmother during her good health and an unforgettable performance by some brilliant actors and actresses for me. As mentioned earlier, whenever I begin thinking of this film, it makes me crave a bowl of Campbell's or a cup of homemade hot chocolate and to get lost in the entertaining and hilarious adventures of Nick and Nora Charles. I would suggest this film to anyone who wants a good CLEAN laugh or any fan of the detective genre.",
            "review_date": "2008-03-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lighthearted Mystery",
            "content": "Eccentric inventor, Clyde Wynant, has overstayed on his vacation and is presumed missing by his daughter, who hires retired detective Nick Charles to go out to look. Nick doesn't really want the case but is insisted by his wife, Nora, and circumstances such as Wynant's secretary/mistress being knocked off, Wynant being suspected off murdering a stool pigeon, and a whole bunch of Damon Runyonesque characters creating more problems en route to a solution. The movie is full of witty dialogue, great chemistry between Powell and Loy, great character acting ( something used in all six movies of this series and something you won't see in movies anymore ), and a nice fast pace. Based on the Dashiell Hammett book ( I felt the movie moved a lot faster and eliminated some senseless subplots never worked out or solved. ). Followed by After the Thin Man. Rating 10 out of 10.",
            "review_date": "2001-01-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Peerless Panache",
            "content": "'It said you were shot six times in the tabloids.''Nonsense.  It never went near my tabloids.'This wonderful exchange takes place between beautiful socialite Nora (Myrna Loy) and her husband, one-time private detective Nick (William Powell) as they lounge in their New York hotel room on Christmas morning.  He is at full stretch on a sofa while popping balloons with his newly opened gift, a child's pellet gun.  She watches coolly, a slight smile on her face.  They are right in the middle of scandal involving the disappearance of an inventor called Wynant, and a series of apparently connected murders.  Nick wants no part of the ensuing police investigation, and tries to avoid involvement for most of the running time of 'The Thin Man'.  Nora is humouring his childish balloon-popping pastime, much as he humours his desire not to be involved in murder mysteries while simultaneously trying to rope him into it whenever she can.  Oh.  And despite the fact that they are still in their pyjamas, they are both drunk.Compared to the rest of 'The Thin Man', in which Nick and Nora continually throw back various alcoholic beverages like so much soda pop, they seem positively sober during this scene, and it is all of, oh, perhaps ninety seconds, before liquor re-emerges to reinvigorate the Charles' Christmas revels.  However, many of the other traits that run through W.S. Van Dyke II's magical 'The Thin Man' are present in force.Verbal wit, delivered with panache by the two stars, punctuates the sequence.  Powell and Loy understand that when one is given a truly witty script, it is unnecessary to mug to the camera or to try and milk more laughs by placing too much emphasis on the punchline.  Many of the comic gems in 'The Thin Man' are delivered as throwaways by the leads, as though they were unwilling to dwell on one line for too long and were keen to get on to the next one.  And one of the joys of 'The Thin Man' is that there is always a next one just around the corner.The scene, and the film, is filled to bursting with sophisticated elegance. The lush sets, courtesy of MGM maestro Cedric Gibbons, evoke a time in Hollywood history when hotel rooms were more luxurious, almost silken, and just plain BIGGER than they are today.  The costumes are all suitably glamorous, and the Charles' certainly make them look classy, as opposed to the decadent hedonism of the other wealthy folk in the film, or the seediness of the lowlives and police detectives that flesh out the cast. This is not to say that the film is pompous or snobbish.  In addition to their verbal sparks, Nick and Nora inject it with a refreshing dose of slapstick, best exemplified during Nora's first scene, a memorable entrance into a nightclub in search of Nick.  Ironically, it is she who ends up flat on her face despite the fact that she hasn't yet commenced catching up on Nick's six martinis.  The Charles' dog, a mischievous mongrel named Asta, deprived of lines of his own, gets most of the movie's physical jokes, including an encounter with one of the aforementioned Christmas balloons.Back to the Christmas morning scene.  Nick, despite his fun and games with his new toy, is a wounded man, shot the night before by one of the hoodlums that swarm through the film like locusts.  The threat of sudden death remains an intrusive presence in the film, even in a 'light' scene such as this.  Nick is continually threatened with bodily harm or worse by numerous characters who figure he must be investigating the murder of Wynant, even though he remains insistent that all he wants to do is have a quiet, liquor-sodden yuletide season.  Of course, it is the insistence of his wife rather than possible ventilation (via a bullet) which convinces him to finally don his detective's hat once more.  That and the knowledge that if dangerous men are bent on hurting him because they think he's sticking his nose into their business, then he might as well stick his nose in and thus perhaps justify his possible sudden expiration.  As the threatening atmosphere picks up in the final third, a tangible sense of darkness begins to descend, aided by wonderful uses of light and shadow, a precursor of the film noir style which would take the next decade by storm.Despite the odd dip into darkness, however, the film's tone remains bright and breezy throughout, and is paced so quickly that more than one reviewer has remarked that it the film feels like it has only been on for half an hour before it is over.  The final scene, in which all of the suspects in the investigation dine with Nick and Nora, is as witty and ingenious as anything that precedes it.  The urbane sophistication of the Charles' remains intact despite the worst efforts of NYPD's finest, who are disguised as waiters and serving the soup without much decorum.  As Nick verbally pokes and prods his guests in an attempt to gode the murderer into showing his hand, he turns to Nora and asks her 'how'm I doing?'  She replies, 'wonderfully.  It's the best meal I ever listened to'.  She's absolutely right.  The verbal gymnastics make 'The Thin Man' one of the best movies I've ever listened to.  Everything else makes it one of the best movies I've ever seen.",
            "review_date": "2002-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Entertaining enough to watch but no way this is a classic.",
            "content": "\"The Thin Man\" surely is a fun enough movie to watch but it sort of annoys me that there are way better same type of movies out there from the same period that are better than this movie but far less known and appreciated.Yes its a good entertaining movie but it's also a very simplistic one in many regards. Simplistic in the way it's made. It's has a very simple look and apparently it also only cost 2 weeks to shoot this movie, which unfortunately really showed on screen for me. It's also very simplistic with its story. Well these type of entertaining '30's comedies are never really about its story but in this case it works sort of distracting since the movie is a detective movie with a murder mystery in it, in which the story always sort of automatically gets pushed toward the foreground.The only thing that can still save these type of simplistic movies are good characters and actors portraying them. This movie really has that. What mostly makes this movie is its main character former detective Nick Charles, played by William Powell and his wife Nora, played by the popular silent movie star Myrna Loy. They are a real odd couple, who perhaps are more best friends than truly lovers. Or perhaps brother and sister would be a better description of it. They love to have fun together and poke fun at each other. It's the most charming aspect of \"The Thin Man\" and at the same time also what makes this movie still an entertaining one to watch.On its own this movie really isn't that comedy filled as you would expect. The movie is lacking some good laughs for a comedy, which just more makes this a fun murder-mystery, rather than a full-blood comedy.The movie is perfectly cast with William Powell and Myrna Loy. They are great but they are even better together in this movie. They share some good screen chemistry together. It's also the movie that sort of re-launched Myrna Loy's career. She was a big actress in the silent era but she was one of those actresses that didn't quite made the step between the silent- and sound movies. She got rediscovered in this movie again and continued to act till the early 80's. Also the other characters and actors are good but you can debate and wonder if there aren't one or two too many characters in the movie, which also makes the movie at times a bit too convincing and tiresome to watch, simply because you don't care- and can't really follow the story, also due to its simplicity it gets brought to the screen with.Really not bad, I just hope that any of its 5(!) sequels is still better and more entertaining.7/10http://bobafett1138.blogspot.com/",
            "review_date": "2008-04-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Some Old Friends Can Tell The Same Jokes Again And It's Fine",
            "content": "It should be unsurprising that I join in the chorus of admiration for this old warhorse of the repertory houses. The suits at MGM did not wish to cast Myrna Loy, whom they viewed as best suited to playing exotic beauties, like French maids and Fu Man Chu's daughter. It didn't matter that she had proven her all-American beauty and comedy chops under Capra's direction, and under director W. S. Van Dyke's too. Van Dyke insisted, and they retaliated with a short budget and shooting schedule; he gave them the razzberry by coming in under schedule and budget, and making a hit.What everyone sees up front is the easy camaraderie between William Powell and Miss Loy. What they don't mention is how cameraman James Wong Howe assisted in this. The scenes with the leads in them are shot with high lights and many of them, yielding the MGM gloss that would become standard in the following decade. Scenes without one or both of them are darker, often back- and low-lit, producing a foreboding air, that makes us long for their comforting presence, as well the the solution to the well constructed mystery.",
            "review_date": "2023-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pass the martinis darling, I need breakfast.",
            "content": "This series must have inspired more tv and movie plots than almost any other.  The married couple, stumbling into one mystery or another.  I believe that William Powell actually drank during most of the filming.  They are still funny and pretty good mysteries all these years later.",
            "review_date": "1999-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "PURE CLASS",
            "content": "A classic romp in so many ways. The cast, writing and performances are fresh and funny as the day they were filmed. Some of the dialogue is a reflection of the era, but will not be lost on 21st century ears. No political correctness here, everyone drinks too much and has fun doing it. \"Nora: How do you feel?\nNick: Terrible. I must have gone to bed sober.\" Young or old film buffs will enjoy the entire Thin Man series, but I think this and the second in the series are the best.",
            "review_date": "2018-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worth the wait and the second viewing.",
            "content": "The problem with looking forward to watching a classic film is that sometimes the film turns out to be disappointing.I watched \"The Thin Man\" too late in the evening and was overwhelmed by the quantity and speed of the dialogue and the complexity of the twists and turns of the plot. I also did the unforgivable and fell asleep and had to keep re-winding the tape. (Yes... the tape.. it's been on the \"need to watch shelf\" a LONG time) and even then it just did not seem \"special\". BUT. I knew it was supposed to be really good so I watched it in the morning. Stayed awake. Had read some of the reviews and message boards and was prepared this time.It's GOOD. Really, really good. Witty dialogue, quirky characters galore, loose ends pretty well woven into each other by the time of the end credits. Chock-a-block filled with all of those wonderful everyday things of 1934 like two part corded telephones, typewriters that make noise, telephone operators, nickels needed for a call, fur trim on just about every woman's garment, running boards ! So Stay awake. Watch it more than once, You won't regret it.",
            "review_date": "2017-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Famous but somewhat disappointing.",
            "content": "I'm a big fan of the great movies of the 1930s, and this is one of the most famous. Its conceit of a hard-drinking husband-and-wife team solving a murder has been endlessly copied, as in TV series HART TO HART and MCMILLAN AND WIFE.Powell, the extraordinarily beautiful and talented Myrna Loy, and even the dog Asta are great, hitting just the right comedy-drama tone. The dialogue is often delightful. But the movie just doesn't grab me.The beginning plods and meanders around way too long before the murders occur, introducing a bewildering array of characters so there will be lots of suspects. The middle of the story is fairly interesting and the end is the usual murder mystery cliché -- the detective brings all the suspects into one room to make them sweat before he dramatically fingers the murderer.The solution to the murders is so complicated, I couldn't even follow it, and the murderer turns out to be a character who has hardly appeared in the story at all.I know this is a beloved film for many, and it was a huge hit at the time, spawning sequels. I wished I liked it better but it's just too loosely structured to work for me. I got bored more than once.",
            "review_date": "2019-08-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not As Good As I Keep Hoping",
            "content": "Am I the only person who doesn't have a Pavlovian reaction to the original \"Thin Man\" film? I speak as a great fan of Powell/Loy, MGM's product, Hunt Stromberg, and Woody VanDyke's work, but there is a huge difference in pace and style between this film and all of the others in the Thin Man series. The best I can figure is clumsy direction, a hasty schedule, or both. Roger Ebert and others comment on the crisp direction, stunning photography, and pace, but I see just the opposite. This film was shot in 12 days. Maybe that explains how harsh, dark and poorly lit the first scenes are the involve Wynan. I'm thinking that they didn't really get proper sets built, and covered it by not lighting properly.Then there's the pace. Most of the Thin Man films flow like a river, always moving forward. In this film, the plot based scenes are like another movie entirely. Wynan is an awful person, hard and ugly. His relatives are daffy without being charming. But then there's the utter joy and delight of Powell and Loy exploring and falling pretty well into their characters. Much of their scenes are superb, but the pace is oddly uneven for any MGM film of the time, and very off for the Thin Man films. It seems that by the last scene, the rhythm is there, but the film is not as good as I want it to be. Maybe the genuinely mean and dirty plot got in the way? I just can't figure out what's wrong with the film. Thank goodness that the MGM execs saw more in it than I do!",
            "review_date": "2009-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Intriguing but absolutely confused",
            "content": "It is difficult to place this movie among comedy or thrillers. Its cast is excellent, but the plot is often confused among a multitude of people who forcibly want to confuse our point of view.In the end the culprit is the one that has been seen least of all... and this is a silly banality.",
            "review_date": "2022-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best comic duos of all time.",
            "content": "Myrna Loy and William Powell team up to solve a mystery. This is the first collaboration between Powell and Loy, but they were to team up 14 more times after this film. She's a fun loving wife and he's an alcoholic detective. Followed by many equally (almost) entertaining sequels.",
            "review_date": "2001-09-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Entertaining start to a great series, but less of the stars than would be ideal",
            "content": "I've seen this movie a bunch of times over the years, perhaps enough times, really. At this point it's perhaps a little overly familiar. But it's still a lot of fun, primarily due to the wonderful bantering of Powell and Loy and because of the amusing Runyonesque tough guys who fill their lives.There is actually less Powell/Loy in this than I recall. Much of the movie is centered around the actual murder mystery, so we spend a lot of time with victims and suspects. Some are more interesting than others, but outside of the oddball son they don't offer as many laughs as the detective duo.Anyway, if you've never seen this, you should. Or at least something in the series, particularly, as I recall, any of the first three.",
            "review_date": "2019-12-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Terrically entertaining",
            "content": "One of the best loved movies of the 30's, and with good reason. Snappy, witty dialog, crisp direction, and the deliriously amusing interplay of Loy and Powell, backed by one of those large ensembles of memorable character actors that make movies of this period so much fun. A pretty good mystery, too. A rare case of a film that is better than the book on which it is based. Not to be missed.",
            "review_date": "2021-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolute Fun and Totally Unforgettable Characters",
            "content": "Based on Dashiell Hammett's novel, this movie brings Nick and Nora Charles to life. In this and in all of their movies, William Powell and Myra Loy have unbelievable chemistry. Filled with many memorable quotes, The Thin Man is hilarious, witty, intelligent, and free-spirited entertainment.Nick is an eloquent and suave detective who uses his intellect and speech to solve crimes. Nora is his equally intelligent wife who can certainly match wits with her husband. Nick and Nora have an equal, loving marriage that is rarely seen today (in movies or in real life).You can see a parody of these two characters in Neil Simon's Murder by Death. Look for Dick and Dora Charleston, played by David Niven and Maggie Smith.The Thin Man is a must see. I also recommend all five Thin Man sequels, Libeled Lady (starring Powell and Loy, plus Spencer Tracy and Jean Harlow!), and Murder by Death.",
            "review_date": "2002-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great film but not the best in the series....",
            "content": "This is a nice little com-mystery. Not quite sure whether it's more comedy or mystery, but enough of both to satisfy most viewers. Keep in mind the comedy is geared towards the tastes of 1930's movie goers, so if you're in the frame of mind of watching a Harold and Kumar, or Dude Where's my car, you'll probably be disappointed. This is a somewhat uneven mystery, it's not really plausible, nor are the details of the case really explained to the effect of a Chrisie novel, or Sherlock Holmes film, but the sheer magnetism of Powell and Loy makes for an enjoyable movie experience. These two are one of the best comedic duos of all time. Laurel and Hardy, Abbot and Costello, Wilder and Pryor, they all share an innate ability to play off of one another perfectly. As if they truly were in a state of life long familiarity. The husband and wife angle here makes for some interesting watching, and despite her sometimes wacky antics, the character of Nora Charles isn't just another ditsy dame. She's intelligent, witty, attractive, and as quick to fire back at Nick, as he is to try to get the sly over on her.",
            "review_date": "2008-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "overrated",
            "content": "This has got to be one of the most overrated films of all time, i had heard that it was one of the best comedies ever. As much as i love william powell and myrna loy, who also played in the terrible manhattan melodrama with clark gable in 34, who were actually quite good in this movie, only the screenplay was very weak. I didn't care who was murdered or who the murderer was. It was hardly even funny.",
            "review_date": "2004-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Classic Dark Comedy...Perfect For Some Needed Escapism",
            "content": "As of July 2020 with movie releases being held back and productions shelved it seemed like a good time to mine some old gold. Even better in that a movie reflects another era far removed from the current world. That was my own set-up for watching The Thin Man. It didn't disappoint and was fantastic for forgetting the current drought. This is a stylish movie with unapologetic wise cracks and raucous behavior. Charles Lawton as Nick is utterly wonderful in the lead role. He's whip-smart and street savvy. He's debonair and his wife is an over-the-top delight. Just watching these two is a hoot. The movie introduces quite a few related characters and never confuses as it builds to a memorable climax. The pace of the movie woven around the assorted characters crackles in a fast pace, never boring and always adding mystery that entertains. A perfect comedic crime thriller. Even if they would have kept releasing movies there would likely be nothing to compare to delights of this one.",
            "review_date": "2020-07-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Does not age well at all....",
            "content": "I found the sequence of four movies woefully inadequate. They seemed awfully dated, awfully thin story line. The dog, Aster, was the best actor. Myrna Loy was pretty in that unusual way we want in pretty woman. But the story lines seemed drawn out for no good reason, making the story lag; and the crimes seemed predictable with predictable solutions. Dialogue was strong and humorous and brought a little sparkle to the films. I was surprised that the films were essentially centered in San Francisco, which I did not realize. Yes, Coit Tower is visible from the Western span of the Bay Bridge. William Powell played the role for laughs and I'm not sure that didn't detract from the movie; Monk found himself in absurd situations of the crime, but played his perplexity straight; William Powell seemed to be playing for laughs. But since there was such thin story line, it really didn't matter. As a matter of film history, they were interesting; as material borrowed from Dashiell Hammet's book--The Thin Man--they were of interest. But they certainly were not 'classic' Hollywood, just 'of interest' Hollywood.",
            "review_date": "2015-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a wickedly funny romp",
            "content": "The Thin Man is everything that today's movies are not.  Sophisticated, witty, and rife with clever reparte. It is a ten-star jewel not to be missed.",
            "review_date": "1999-02-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"The murderer is right in this room. Sitting at this table. You may serve the fish.\"",
            "content": "THE THIN MAN is a highly entertaining crime comedy based on the novel of the same name. The mystery becomes strong comedy dialogue and acting quite unique. This film can be seen as a very good detective story with one hand, and a well thought out and \"healthy\" comedy on the other side. Excitement is present in both parts. Powell and Loy are shared perfection of chemistry on screen. The dialogue between the main actors is simply excellent. The story and scenery are good. Acting is in a good part of the film is excellent.At one point, I was surprised because a serious topic is approached quite frivolous. I've finally realized that the film, in addition to other segments, should be just fun. Couple Charles offered us a great time for a bit of mystery and research and a lot of comedy dialogue. Van Dyke offered us a movie in which we really enjoy.",
            "review_date": "2016-04-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A brilliant start to the movie series!",
            "content": "Nick & Nora Charles (William Powell & Myrna Loy) combine comedy, mystery, highballs, romance, easy bantering and sleuthing into a movie that will keep you on the edge of your seat just to see what happens next.  The movie, which was considered a fresh start for both Powell and Loy (both had made careers out of starring as movie \"heavies\") launched \"The Thin Man\" series of movies for both the co-stars.  In this first movie, an eccentric inventor disappears and, as a favor to the inventor's daughter, Nick Charles investigates the man's whereabouts.  With help from Nora, Asta (their dog), the New York police department, a cast of eccentric characters and some sharp detective work, the culmination of the investigation takes place at the Charles' dinner table.  It's a fun ride to the party - don't miss it!",
            "review_date": "2003-05-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Somewhat hard to follow, but will you care?",
            "content": "Having worn out much of the newer Christmas canon and being in the midst of an Agatha Christie kick, THE THIN MAN seemed like the just what the doctor ordered! After viewing, it definitely wasn't what I was expecting, but I liked it all the same.The pros: Like other reviewers said, the chemistry between Nick and Nora is ELECTRIC. It's rare that old movies like this feature such a relatable, playful, silly couple; and their dynamic felt quite modern - you could tell that they were peas in a pod and really respected one another. The silly faces that they'd make at each other, the little jabs when people weren't watching... these actors must've had a blast working together, and it's wonderful to watch.The cons: I found the mystery quite hard to follow. This was due, in large part, to a mixture of slow pacing and a cast full of (unknown to me) actors who happened to look a lot alike - I often felt confused as to who was who and if I had even seen someone before! This confusion led to the solving of the murder mystery plot being rather unclimactic (who was that person again?).Ultimately, the chemistry of the actors carried this movie for me, and I would recommend it based on those grounds. I'm not sure that I agree that it should be classified as a Christmas movie, since most of the movie takes place after the big day, but if you're looking for a sweet, fun, intriguing classic to watch, this might be just what you're after.",
            "review_date": "2021-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of my favorites",
            "content": "One of the best 30s comedies and one of my top five favorites.  The dialogue is clever, fast-paced and witty, and holds up well on repeat viewing. No matter how many times I see it, I cannot remember who-dun-it until the very end. William Powell and Myrna Loy are brilliant together and really bring the characters to life. One of the only movies I can think of where the fun begins AFTER the main characters get married.",
            "review_date": "1999-07-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny Movie!",
            "content": "Nick and Nora Charles are the funniest characters ever. William Powell and Myrna Loy are excellent. Asta, the dog, is very funny. Everyone should see this movie.",
            "review_date": "1999-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Early Screw-Ball Comedy/Who-Dunnit",
            "content": "Dick Powell and Myrna Loy in their first and best of 6 \"Thin Man\" movies. Never a dull moment in this vintage gem, filled with colorful characters and unexpected scenes. The leads are apparently wealthy socialites who take on detective work as a hobby. The mysterious disappearance of an eccentric professor is immediately followed by two murders, seemingly tied to the elusive professor.The script is filled with clever inuendo and one-liners. Powell and Loy are delicious as the carefree couple, entangled in intrigue all around them. Reminiscent of some Laurel & Hardy shorts, \"The Thin Man\" is entertainment from start to finish. Family pet Asta, the famous terrier, soon became the #1 dog in Hollywood due to the Thin Man success. Enjoy this delicious piece of Hollywood Candy!",
            "review_date": "2006-07-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nick and Nora solve another mystery",
            "content": "Murder and intrigue abound as Nick Charles is asked to come out of retirement to solve another crime. A woman is murdered and the prime suspect disappears. More killings take place leading the police to search even harder for the missing person. But Nick Charles doesn't believe the missing man is the culprit. I liked the Agatha Christie ending where Nick gathered together all the folks involved and explained why each of them could be a suspect. A good mystery with just the right touch of humor.",
            "review_date": "1999-05-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "TheThin Man- Top of the Line 30s Chic",
            "content": "William Powell, Myrna Loy,and Asta the dog make for a perfect combination of 30s detective chic. This is as good as it gets. Powell is the Thin Man, and Loy is his able assistant. Asta provides comic relief, but there is also plenty of comic relief between Powell and Loy, as this series does not take itself too seriously when it comes to solving crimes. This off-handed, leisurely approach works to perfection.The Thin Man quickly introduces the audience to this trio and their general modus of crime-solving. The story or other characters here are not really all that important; only the methods employed by the sleuths solving the crime. Enjoy this and several other follow-up adventures.",
            "review_date": "2022-03-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Boring and Bland Murder Mystery Yet Contains Two of the Best Characters?",
            "content": "Like usual these days, my screening at another movie theater (The Vista this time around) was filled with so many audience members that were laughing at every single line of dialogue that I couldn't even understand what was going on. It was my first 35 mm screening, and while amazing at that, I was ultimately lost. So I went home, watched it again on iTunes, but was still disappointed.Anyways, while I can specifically say that I enjoy the interactions between William Powell and Myrna Loy, The Thin Man was just a very bland and boring film with a murder mystery that was too convoluted and bloated to begin with. To be honest, I felt like the film was far too focused on the murder mystery element because the filmmakers probably thought the audience would be more into that (and maybe they were), but I actually preferred Loy and Powell. Ironically, many people throughout the years have placed the title slogan as Powell's, but it was originally delegated to the subject of the murder mystery in the first film. I feel like that shows where the filmmakers and audience (at least me) were at odds here. While I wanted more of the couple dynamic, the film kept forcing me to indulge in a murder mystery that was really forgettable and bland.I actually have a feeling I will enjoy the sequels much more than this. The Secret Movie Club at The Vista kept going on and on about how Jimmy Stewart plays against type as the villain in the sequel, so I will get around to it.",
            "review_date": "2018-12-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Murder Mystery solved without a single tensed moment, that's scarce.",
            "content": "The Thin Man (1934) :\nBrief Review -Murder Mystery solved without a single tensed moment, that's Scarce. The Thin Man is not a thriller but has plenty of suspense filled in it. A retired detective is pressed back to solve a murder mystery which involves so many characters, so many twists, so many suspects and more than one murder. At one moment when you feel it's over then comes a turn around that main suspect is murdered to put suspense back on track. While telling this fairly written script, The Thin Man doesn't include a single tensed scene or dark theme at all. That's really something rare and unique. Apart from the entertaining plot, the film is blessed with sweet and funny chemistry of William Powell and Myrna Loy. Rest of the artists such as Maureen O'Sullivan, Nat Pendleton, Minna Gombell, Porter Hall and Henry Wadsworth get little to play. Unlike other murder mystries, The Thin Man never carry a burden of strong climax because the narrative is engaging and delightful already. Mostly mystery films run in dark mode to make climax more important than it should be but this film loses the weightage because of comedy and light moments. W S Van Dyke takes the film through different vision and people have acknowledged his vision over the years as The Thin Man has became one of the most popular film for it's own separate genre. It was a box office hit at the time of it's release and recieved positive reviews but the real success of the film lies in its timleass impact. People can still enjoy without caring about the genre and retro style presentations. Overall, The Thin Man is a Fantastic attempt to explore something new in mystery genre.RATING - 7/10*By - #samthebestest",
            "review_date": "2020-05-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Screwball murder mystery",
            "content": "William Powell is a former detective who married richly and has been enjoying a comfortable life for years, until by chance he finds himself involved in mysterious murders. Myrna Loy plays his rich wife who sees the situation as an opportunity for adventure and persuades him to get involved in the investigation. The plot is nothing special, a classic detective murder mystery, but in this film it is just the basis for a romantic screwball comedy. Unusual as this combination may sound, \"The Thin Man\" used it quite effectively. This is one of fourteen films starring Powell and Loy, and the first of six in the series about Nick and Nora Charles. Their mutual chemistry is magical and, aided by smart and classy humor, elevates in other respects a mediocre film into a classic not to be missed.7,5/10",
            "review_date": "2021-03-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": null,
            "content": "A surprisingly fun movie, very funny, and worth the rewatch. A sci-fi, comedy, murder mystery, very unique for today, let alone 1930s.",
            "review_date": "2022-09-15",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "meta_rating": 7.6,
    "meta_summary": "Former detective Nick Charles and his wealthy wife Nora investigate a murder case, mostly for the fun of it.",
    "vibes": [
        "appealing",
        "joyous",
        "mid",
        "tiny",
        "unfussy",
        "visual",
        "romantic",
        "interested",
        "verbal",
        "later",
        "popular",
        "climactic",
        "haired",
        "mysterious",
        "dandyish",
        "introductory",
        "loose",
        "mandatory",
        "peripheral",
        "suave",
        "close",
        "likable",
        "next",
        "outstanding",
        "notable",
        "secondary",
        "vintage",
        "heavy",
        "gritty",
        "apocryphal",
        "emphatic",
        "equal",
        "identical",
        "slender",
        "uncorrupted",
        "surprising",
        "excessive",
        "multiple",
        "attractive",
        "fascinating",
        "smooth",
        "afraid",
        "dear",
        "devoted",
        "tipsy",
        "dazed",
        "deep",
        "elated",
        "explanatory",
        "incidental",
        "alive",
        "armed",
        "incompetent",
        "unfair",
        "grand",
        "penultimate",
        "reminiscent",
        "narrow",
        "unidentified",
        "unregistered",
        "breathless",
        "cinematic",
        "crazy",
        "heavenly",
        "polar",
        "awful",
        "harsh",
        "hasty",
        "mean",
        "utter"
    ]
}