{
    "title": "Django Unchained",
    "rating": 8.6,
    "release_date": "2012-12-25",
    "genre": [
        "Action",
        "Adventure",
        "Drama",
        "Crime",
        "Western"
    ],
    "summary": "Django is a slave whose brutal history with his former owners lands him face-to-face with German-born bounty hunter Dr. King Schultz.  Schultz is on the trail of the murderous Brittle brothers, and only Django can lead him to his bounty.  The unorthodox Schultz acquires Django with a promise to free him upon the capture of the Brittles –Django is a slave whose brutal history with his former owners lands him face-to-face with German-born bounty hunter Dr. King Schultz.  Schultz is on the trail of the murderous Brittle brothers, and only Django can lead him to his bounty.  The unorthodox Schultz acquires Django with a promise to free him upon the capture of the Brittles – dead or alive. (The Weinstein Company)… Expand",
    "critic_reviews": [
        "What Tarantino has is an appreciation for gut-level exploitation film appeal, combined with an artist's desire to transform that gut element with something higher, better, more daring. His films challenge taboos in our society in the most direct possible way, and at the same time add an element of parody or satire.",
        "The film doesn't play it safe, so neither will I. Instead, I'll say that it finds Mr. Tarantino perched improbably but securely on the top of a production that's wildly extravagant, ferociously violent, ludicrously lurid and outrageously entertaining, yet also, remarkably, very much about the pernicious lunacy of racism and, yes, slavery's singular horrors.",
        "With a fearless director and his mighty pen freeing a talented cast to attack a vital theme, Django Unchained is damnation unleashed.",
        "The most consistently entertaining movie of 2012. It's 165 minutes long and shouldn't be a minute shorter, a film of surprises, both in story and in casting, and of moments of agonizing, teased-out tension. The dialogue is dazzling.",
        "In \"Django,\" Tarantino is a man unchained, creating his most articulate, intriguing, provoking, appalling, hilarious, exhilarating, scathing and downright entertaining film yet.",
        "Like \"Inglourious Basterds,\" Django Unchained is crazily entertaining, brazenly irresponsible and also ethically serious in a way that is entirely consistent with its playfulness.",
        "Exactly what you might expect from the fearless, controversial director of \"Pulp Fiction\" - it's overlong, raunchy, shocking, grim, exaggerated, self-indulgently over-the-top and so politically incorrect it demands a new definition of the term. It is also bold, original, mesmerizing, stylish and one hell of a piece of entertainment.",
        "Django Unchained also has the pure, almost meaningless excitement which I found sorely lacking in Tarantino's previous film, Inglourious Basterds, with its misfiring spaghetti-Nazi trope and boring plot. I can only say Django delivers, wholesale, that particular narcotic and delirious pleasure that Tarantino still knows how to confect in the cinema, something to do with the manipulation of surfaces. It's as unwholesome, deplorable and delicious as a forbidden cigarette.",
        "An immensely satisfying taste of antebellum empowerment packaged as spaghetti-Western homage... A bloody hilarious (and hilariously bloody) Christmas counter-programmer.",
        "A sharp shock of a film in an Awards season very full of movies so noble they become immobile. It's wildly unlikely to get much love from the Academy, and that's fine-bluntly, it's too good for them. With its bloody stew of history and hysteria, action taken from movies and atrocities taken from fact, Django isn't just a movie only America could make-it's also a movie only America needs to.",
        "Django doesn't have the razor-sharp chronological complexity of \"Pulp Fiction,\" but it's ably paced.  A very funny scene involving a proto-Ku Klux Klan lynch mob and their poorly made hoods nevertheless seems a bit out of place, but there's plenty of well-timed suspense.",
        "Tarantino simply isn't a good enough performer for his presence to be anything but a distraction in a rip-roaring crowd-pleaser this consistently great.",
        "Django Unchained is by turns exhilarating, hilarious, horrifying and poetic.",
        "Like all of the best pop art, Tarantino's film is both seriously entertaining and seriously thoughtful, rattling the cage of race in America on-screen and off.",
        "The movie Quentin Tarantino has written and directed is corkscrewed, inside-out, upside-down, simultaneously clear-eyed and completely out of its mind.",
        "There's an epic spaghetti Western feel to Quentin Tarantino's latest action/comedy/romance hybrid that is by turns dazzling, daring, gruesome and astonishingly funny.",
        "Despite the occasional brutality of the material, Django Unchained includes some of the best laugh aloud scenes of any 2012 motion picture, regardless of the genre.",
        "Wake up, people. Tarantino lives to cross the line. Is Django Unchained too much? Damn straight. It wouldn't be Tarantino otherwise.",
        "Another strong, sparky and bloody entry in the QT canon. Although, creaking under its running time, it's not quite as uproariously entertaining as his last pseudo-historical adventure, \"Inglourious Basterds.\"",
        "It's that zippy dialog more than anything that moves \"Django\" along and that coaxes such fantastic performances from its actors.",
        "Django Unchained doesn't merely hit its marks; it blows them to bloody chunks. It's manna for mayhem mavens.",
        "Tarantino's three-hour feast of Southern-fried trash cinema might be too much – and too bloody – for certain constitutions, but the rewards are plentiful. Be sure to hunt it down.",
        "Just when we thought Quentin Tarantino had shown us all the cojones he has, in rides Django Unchained.",
        "A pastiche that's nearly as funny as it is long (2hr. 45min.), and quite as politically troubling as it may be liberating, Django Unchained is pure, if not great, Tarantino.",
        "Vibrating with the geekery of a filmmaker off the chain, the movie plays like no other this year. Tarantino, steeped in even the smallest Leonean gesture (what's with the weird terrain shifts?), knows how to satisfy fans of scuzzy Italian horse operas and badass superviolence in equal measure.",
        "Only Tarantino could come up with such a wild cross-cultural mash, a smorgasbord of ingredients stemming from spaghetti Westerns, German legend, historical slavery, modern rap music, proto-Ku Klux Klan fashion, an assembly of '60s and '70s character actors and a leading couple meant to be the distant forebears of blaxploitation hero John Shaft and make it not only digestible but actually pretty delicious.",
        "Despite these quibbles, Django Unchained offers an embarrassment of riches (and actors in tiny cameos).",
        "Will Tarantino, who is more talented than he allows, ever break out of his perpetual adolescence and make a movie that does more than glorify his love of schlock? Will we ever get a \"Tarantino Unchained\"?",
        "Django Unchained is the most brutal film Quentin Tarantino has ever made. Unlike \"Kill Bill\" or \"Inglourious Basterds,\" where the violence was thrilling and carried a visceral kick, the carnage here is often ugly and difficult to watch.",
        "Django Unchained might have been a revelation in 2005. But after Quentin Tarantino and others have spent years spoofing '60s and '70s genre movies, this mock spaghetti Western tastes like it came out of the microwave.",
        "At times more in line with \"Blazing Saddles\" than the grimly bawdy qualities that define many bonafide oaters, Django Unchained erupts with a conceptual brilliance from the outset that never fully meshes with its clumsy storyline. Nevertheless, it's a giddy ride.",
        "DiCaprio, having a blast, makes Candie the equivalent of Waltz's Nazi in \"Inglourious Basterds\": a racist villain who mesmerizes us by elevating his ideology into a puckishly thought-out vision of the world. Yet Django isn't nearly the film that Inglourious was.",
        "Breathes its own refreshing, occasionally demented, life into that time period, albeit in a pulpy, stylized cinematic language more akin to vampire-hunter cartoonishness than \"Lincoln's\" more classical reserve.",
        "Is Django Unchained about race and power and the ugly side of history? Only as much as \"Inglourious Basterds\" was about race and power and the ugly side of history. It's a live-action, heads-exploding, shoot-'em-up cartoon. Sometimes it crackles, and sometimes it merely cracks.",
        "Tarantino's approach is so enamoured of the exploitation cinema he emulates, there is a serious risk that noble intentions get smothered in juvenile comedy and cinematic grandstanding.",
        "While the rush toward a conventional climax is confusing, and more than a little disappointing, there's an undeniable pleasure that emerges in seeing Tarantino juggle the dynamite of his ideas, even when they prematurely pop off in his face.",
        "The film also comes across like a rough cut that was never looked at as a coherent whole, and some segments that start off as promising become interminable while others feel entirely unnecessary. There's no pressure on or expectation for Tarantino to please anyone other than himself, and the film feels overstuffed with ideas that should have been pruned.",
        "By the time Tarantino shows up as a redneck with an unexplained Australian accent, Django Unchained has mislaid its melancholy, and its bitter wit, and become a raucous romp. It is a tribute to the spaghetti Western, cooked al dente, then cooked a while more, and finally sauced to death.",
        "Django Unchained provoked a lot of contradictory feelings in me, including some that don't usually come in pairs: Hilarity and boredom. Aesthetic delight and physical nausea. Fist-pumping righteousness and vague moral unease.",
        "By the two-hour mark the fun had oozed out of the movie for me. It's long. Or feels it.",
        "It's not particularly funny or moving and it's terribly self-indulgent. Flamboyance and cartoonishness rule, there's hardly a moment of genuine emotion, and most overtures in that direction are superficial. As a picture ostensibly about love, revenge and the ugliness of slavery, Django Unchained has almost zero subtext and is a largely soulless bloodbath, in which the history of pain and retribution is coupled carelessly with a cool soundtrack and some verbose dialogue. Though it might just entertain the sh.t out of the less discerning."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Excellent film. I love all of Quentin's movies but they keep getting smarter and more entertaining. While I'm scared to use the word \"realistic\" when talking about this movie, it definitely feels more real than some of his past titles (KillExcellent film. I love all of Quentin's movies but they keep getting smarter and more entertaining. While I'm scared to use the word \"realistic\" when talking about this movie, it definitely feels more real than some of his past titles (Kill Bill, Inglourious Basterds). The characters are, as always, extremely entertaining. Quentin always brings the best out of his actors, and maybe that's because he just writes such great characters for them. The theme for the film is vengeance, which is the usual for Tarantino. He follows the Tarantino style as you can expect, but he doesn't fail to throw in a few surprises. He also isn't afraid to stay true to the times with the word **** being thrown into every other line of dialogue. I'm glad he didn't shy away from this because, as someone familiar with history, it wouldn't have felt right. The dialogue is fantastic, the pacing is terrific, the action is spectacular, and overall it's a very entertaining movie. I can tell already that a few racist or ignorant people are leaving bad reviews because the film pokes fun at them, so be weary about bringing anyone like that to see the movie with you.",
            "review_date": "2012-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Good acting by Leo DiCaprio & Samuel Jackson. In all other respects, this is Tarantino’s worst movie.",
            "review_date": "2018-12-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Django is another movie beautifully directed by Quentin Tarantino. It is astonishing that QT is able to take a subject as sinister as the treatment of many African American slaves during the nineteenth century and turn it into a film not onlyDjango is another movie beautifully directed by Quentin Tarantino. It is astonishing that QT is able to take a subject as sinister as the treatment of many African American slaves during the nineteenth century and turn it into a film not only honorable of the subject matter, but as great of a story as Django is. In the midst of much of the underlying torment in the context of the film, Tarantino is once again still able to deliver a movie that is both riveting and hilarious. The genius of this film is only further cemented by its exemplary cast. Leonardo DiCaprio plays an outstanding role as one of the wealthiest and cruel plantation owners in the South--so believable at times, it is scary. Jamie Fox also plays his role terrifically, giving the film the hero it deserves. Even the role played by Samuel L. Jackson is utilized very well. However, the role played by Christoph Waltz as Dr. King Schultz is simply sublime, and is a shining example of why he is becoming one of my favorite, if not my favorite, actors to date. Django is sure to become another Tarantino classic.",
            "review_date": "2012-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I loved \"Inglourios Basterds\", but I have to say, this movie was so...predictable. This is the first Tarantino film where his formula becomes obvious, and unfortunately, it's not to his credit. There were very few surprises, the humor wasI loved \"Inglourios Basterds\", but I have to say, this movie was so...predictable. This is the first Tarantino film where his formula becomes obvious, and unfortunately, it's not to his credit. There were very few surprises, the humor was weaker than usual, and yeah, the soundtrack was fun, but also kind of obnoxious. What was lacking was the sheer creativity I've come to expect from QT.\rAlso, it must be said, Jaimie Foxx just doesn't cut it -- his was the least interesting character in a movie named after him.\rBy no means was this awful -- the cinematography was gorgeous, the setting was intriguing, and the historical sweep was fun. But wtf is up with having to say the cinematography was good after a QT film! That's not why anyone is supposed to like this. Overall: weak sauce.",
            "review_date": "2012-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you like Kill Bill you will like this movie. That being said, I liken Taratino's filmmaking to a teacher preparing lesson plans for the slow reader group. This movie has the most base elements and is stock full of his trademark violence.If you like Kill Bill you will like this movie. That being said, I liken Taratino's filmmaking to a teacher preparing lesson plans for the slow reader group. This movie has the most base elements and is stock full of his trademark violence. Maybe, I'm the dim bulb but I just don't get this film. Angry black man taking his revenge on the tyrannical white establishment. Beyond that there isn't anything else in the film. It seems to be one long excuse to spew racial epithets, over and over and over and over. The film lacks any real depth and most of its appeal will be to the type of people that watch police chase videos or scan YouTube for someone getting kicked in the groin. If you have a couple of IQ points you can spare, then by all means burn some brain cells watching this entirely uninteresting flop. Enjoy!",
            "review_date": "2012-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The thrill is gone. Tarantino leapt to center stage of American film making with Reservoir Dogs and cemented his reputation with Pulp Fiction, but it's time to face facts; sometimes there's two flashes in the pan before it's over. Tarantino,The thrill is gone. Tarantino leapt to center stage of American film making with Reservoir Dogs and cemented his reputation with Pulp Fiction, but it's time to face facts; sometimes there's two flashes in the pan before it's over. Tarantino, like Coppola, Cameron and Lucas, has lost his creative edge. Viewing a Tarantino film, one must expect violence by the ton and language that would make David Mamet wince. But, unlike the grievously over-rated Mamet, one also expects Tarantino's wit. The only humor here is a rip on Blazing Saddles with the overused racial epithet. I'm not a fool. I'm not expecting this review will stop anyone from wasting their money on this thing. I'm not expecting anyone to wake up to Tarantino's failings because I point them out. The NYC film critics love him as do the majority of those posting on this site. But, personally, I think you should wait to rent this thing or, better yet, pass it up entirely.",
            "review_date": "2012-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Inglourios was much better. Where to begin...parts of Django were good. Leonardo, Jamie, and without a doubt Christoph Waltz. Django was, toooo long. Easily could have done without 30 minutes of it and it would have been better. I foundInglourios was much better. Where to begin...parts of Django were good. Leonardo, Jamie, and without a doubt Christoph Waltz. Django was, toooo long. Easily could have done without 30 minutes of it and it would have been better. I found myself bored. I'd rent it so you can take a break midway :)",
            "review_date": "2013-01-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This a pornographic roll in the gutter full of blood and guts. You will be thrilled by the music, cinematography, acting and sets, but really it says more about the state of mind of a society that thinks a spray of viscera is entertaining. IThis a pornographic roll in the gutter full of blood and guts. You will be thrilled by the music, cinematography, acting and sets, but really it says more about the state of mind of a society that thinks a spray of viscera is entertaining. I got a few laughs but it really is a page torn from a comic and at times seems to play with the viewer as if to say, \"You, stupid viewer are a patsy.\" The characters are stereotypes x 10. Enjoy your Tarantino, I mean your battlefield porn.",
            "review_date": "2015-03-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "There were a lot of things about this movie that I liked. The things that I didn't like, bothered me.... 1) There are an uncomfortable amount of far-fetched moments, in which characters seem to act against their nature in order to serve theThere were a lot of things about this movie that I liked. The things that I didn't like, bothered me.... 1) There are an uncomfortable amount of far-fetched moments, in which characters seem to act against their nature in order to serve the plot better. 2) Tarantino's cameo is extremely awkward  he may as we'll have been on screen wearing a beret and sitting in a director's chair. 3) I'll never agree with the use of modern music in period movies. Are electric guitars and hip-hop necessary in a cowboy movie?\rI think Quentin Tarantino is (maybe was) a great director. I just wish he'd stop making semi-serious, semi-goofball REVENGE flicks a la Kill Bill, Kill Bill Vol. II, Inglorious Basterds, and Django Unchained. That's four, and I believe he's threatened to make another Kill Bill! It's now a great number of years since Tarantino has shown any real range as a filmmaker. He obviously has the talent and imagination to make a serious movie for a change, and he really should.",
            "review_date": "2013-12-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Quentin Tarantino has once again proved why he is one of the greatest and most authentic directors making films today, filled with gut-busting violence, Oscar worthy performances and some much comic relief. Django is one of 2012's best\"Quentin Tarantino has once again proved why he is one of the greatest and most authentic directors making films today, filled with gut-busting violence, Oscar worthy performances and some much comic relief. Django is one of 2012's best movies, by far.\"  A+",
            "review_date": "2013-06-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Another classic from the legend that is Quentin Tarantino. He simply doesn't deliver average films and 'Django Unchained' continues his wonderful work. Set in the Deep South and Old West, a freed slave (Jamie Foxx) embarks on a trail acrossAnother classic from the legend that is Quentin Tarantino. He simply doesn't deliver average films and 'Django Unchained' continues his wonderful work. Set in the Deep South and Old West, a freed slave (Jamie Foxx) embarks on a trail across America with a German bounty hunter (Christoph Waltz) to rescue his wife from a charismatic and cruel plantation owner (Leo DiCaprio.) The sequences are sensational from the very beginning but the key component in making this film so great is the two intriguing characters at the heart of it, Foxx and Waltz. Inglorious Basterds was a marvellous movie and I thought that Waltz was the shining light and once again he steals the show. He really is an actor on top of his game under the stewardship of Tarantino and he excels. Compared to other Tarantino outings the film is much more linear excluding less flashbacks. Some will complain about the elements of racism but it's part of what Tarantino is tackling with Django. Foxx proves to be a hit in the lead role and delivers a solid performance. It was a genius piece of casting having Leo DiCaprio as the villain. He is a supreme talent and possibly the finest actor of this generation and once more he is in flawless form as the villain of the movie. As usual Samuel L. Jackson makes an appearance and he, as always, is ever dependable. There's also cameo's from the Director himself, Tarantino and Jonah Hill. Django Unchained is without a doubt one of the best films you'll likely see all year round. It's a must see film and another masterstroke from Quentin Tarantino! It has everything you'd expect from one of his films. The laughs are their in abundance, the actions sequences are superb but there's also the serious issues of racism and slavery at the heart of the tale. And to top it off, there's a stellar cast as always delivering oustanding performances. It is a bit on the long side coming in at just under 3 hours but it's a journey you just have to take all the way through to it's grand stand finish! Make no mistake Django is another work of magic from the maestro that is Quentin Tarantino.",
            "review_date": "2013-02-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This has much that is good in it, including acting, music and clever dialogue, but typically of Tarantino it is also overlong and totally without a moderating influence.",
            "review_date": "2019-04-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie has moments but does not do it. I thought Waltz, Foxx, and Dicaprio did great work but the script was thin and the plot was not done correctly. To be honest the violence and Language is way to much. This film almost felt like aThis movie has moments but does not do it. I thought Waltz, Foxx, and Dicaprio did great work but the script was thin and the plot was not done correctly. To be honest the violence and Language is way to much. This film almost felt like a parody and with this type of talent it should not happen. I was expecting a Red Dead Redemption which I thought was extremely well done as a story.\r Okay movie",
            "review_date": "2013-06-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I went into this film really wanting to like it, and it does pain me to say it but I was slightly bored...and when I find myself having an internal debate about what I'm going to have for dinner that evening during a film, I have to admitI went into this film really wanting to like it, and it does pain me to say it but I was slightly bored...and when I find myself having an internal debate about what I'm going to have for dinner that evening during a film, I have to admit that it wasn't a particularly captivating experience. The plot was good, but I didn't feel it really stood up to the challenge of providing something entertaining for a time slot that matches Lord of the Rings. The characters were great but I didn't come out of the film thinking 'oh my god that was amazing' by any stretch of the measure. It was alright. Considering what the film is actually about I personally felt compelled to like it, and not in a good way but in a 'well, if you don't like this film you clearly don't understand the concept' sort of way, which I never appreciate. Probably worth a watch so you're not too left out of any conversation regarding films but yeah, maybe bring a Sudoku along or something to pass time in the 'oh look, another shoot em up' scenes.",
            "review_date": "2013-07-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A wild-bloody, live action cartoon with a homicidal vengeance, a reversal of roles, much like \"Inglorious Basterds\"; rewriting history if you will, they way Quinten Tarantino sees it, and the way we enjoy it. Quinten takes his blood-spatteredA wild-bloody, live action cartoon with a homicidal vengeance, a reversal of roles, much like \"Inglorious Basterds\"; rewriting history if you will, they way Quinten Tarantino sees it, and the way we enjoy it. Quinten takes his blood-spattered historical tent show on the road, putting down stakes in Antebellum Dixieland. Not technically a \"Basterds\" prequel, \"Django\" stems from a similar impulse, to reframe and rewrite American history in boldly absurd strokes. \"Inglorious Basterds\" is an exceptional film, but \"Django Unchained\" surpasses its predecessor, and then some.\r The movie opens in 1858 Texas with the unorthodox purchase of a slave, Django (Jamie Foxx), by a dentist-turned-bounty hunter, Dr. King Schultz (Christopher Waltz). Since Schultz doesn't believe in slavery, he soon frees Django and the two become partners in Schultz's business. After a profitable winter, they head to Mississippi where their goal is to locate Django's wife, Broomhilda (Kerry Washington). When they succeed, they find an excuse to be invited to the plantation where she is being held. There, they are guests of the mansion's master, Calvin Candie (Leonardo DiCaprio), where their act bamboozles everyone except Candie's personal slave, Stephen (Samuel L. Jackson), who smells a rat the moment he sets eyes on Django.\r When Tarantino first introduces audiences to the two characters we'll come to embrace and respect, it's while Django (Foxx) is chained up to other slaves as they march slowly in the dark in the middle of nowhere. Dr. Schultz arrives playing the role of a dentist in a scene that's close to being as perfectly written and delivered as Waltz' farmhouse scene from “Basterds,” freeing Django and thus begins a reluctant partnership. What starts as an uneasy alliance in which one side holds all the power, transforms over the course of the movie into one in which the unlikely pair become partners and friends. Delivering this transformation along with character development, Tarantino is at his screenwriting best.\r There is not a single misstep by any of the “Unchained” cast. Led by Foxx as a slave-turned-bounty-hunter, and Waltz as a man with more layers than initially revealed, this ensemble is a perfectly cast with everyone at the top of their games. “Django” is an absolute must-see for Tarantino fans, but it's not necessary to be into either Tarantino or just Westerns to be fully entertained. There are many notable cameos: Don Johnson (small part), Jonah Hill, Amber Tamblyn, Bruce Dern, Tom Savini, Robert Carradine, and Franco Nero (who played the lead character in the unrelated 1966 film, Django).\r Tarantino is one of the few filmmakers that seamlessly and successfully merges style with substance. He is a creature of cinema, unashamedly standing on the shoulders of greats, forging new meaning out of the universal cultural experiences. That is why as far as I'm concerned “Django Unchained” is one of the best of 2012.",
            "review_date": "2013-07-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nDjango Unchained being Quentin Tarantino's latest film is as usual very exciting and violent, but that goes without saying because its a Tarantino film. With the excellent casting he has managed to get together I don't think the film could have been much better. Dango Unchained is based in 1857 nearing the end of slavery. Django (Jamie Foxx) gives a very gentle character  at the beginning but throughout the film he gets very  determined character trying to get his wife back Brumhilda (Kerry Washington) who hasn't got a very big role, with help from Dr. King Shultz (Christof Waltz) who is a dentist but works with Django as a partnership being a bounty hunter, Dr King Shultz asks Django to point out who the Brittle brothers are and in reward he will help Django find his wife. Brumhilda (Django's wife) was found to be at Candy Land (a slave farm) owned by Calvin Candy (leonardo DiCaprio). Django and Dr. King Shultz have to try and shoot their way out of Candie land to survive and rescue Broomhilda. Samuel Jackson also appears in the second half of the film as stephan a black slave trader. This film is funny, violent, exciting and memorable for life.",
            "review_date": "2013-03-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is by far my favorite movie of 2012. I am a HUGE Tarantino fan and he definitely didn't disappoint me with this one. Christoph Waltz and Leonardo Dicaprio were incredible!",
            "review_date": "2013-03-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "IN MY OPINION **MAY CONTAIN SPOIILERS** by CtheTav From the very beginning of the film an old style 50's spaghetti western is given off which in part is what this film is. However this film is so much more than homage to the westerns of old.IN MY OPINION **MAY CONTAIN SPOIILERS** by CtheTav From the very beginning of the film an old style 50's spaghetti western is given off which in part is what this film is. However this film is so much more than homage to the westerns of old. Tarantino has truly outdone himself with this script (a rarity amongst action films these days) with period appropriate racism themes throughout as well as a story that keeps wondering whether the plan will work out in the end. The action in this film is amazingly over the top with blood splattering everywhere and heads exploding left and right. It is almost like Tarantino has used the violence to compliment the style of the film because it looks like good old fashioned special effects. The music in the film is great adding to the atmosphere when playing or purposely omitted. Finally the acting by everyone involved is some of the best performances I have seen from these people and encouraging feelings of hatred towards characters and being pleased to see them suffer. Rating 10 out of 10 The modern western full of style and substance",
            "review_date": "2013-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Simply put, this is Quentin Tarantino's best film. Throughout the movie, he breaks down the formula to a creative film and rewrites it completely. This is a film that starts with title cards, opening credits that aren't merely forgettableSimply put, this is Quentin Tarantino's best film. Throughout the movie, he breaks down the formula to a creative film and rewrites it completely. This is a film that starts with title cards, opening credits that aren't merely forgettable blips on the bottom of the action, a song named after the titular character, and all the other components of the typical spaghetti western. The revenge-fueled plot and the character archetypes also evoke images John Wayne and Clint Eastwood films.\r Strangely enough, however, rap music and sunglasses badassitude trickles into this \"Southern\". Tarantino, of course, writes in his own style. Excessive (almost cartoonish) violence befalls all characters, the dialogue-only scenes are abundant, and depictions of the pre-Civil War South are brilliant and ominous. Tarantino gives the film a unique atmosphere that I haven't seen since Kill Bill. Django Unchained pulls you into the screen and makes you feel like you are living in the cartoonish, wit-smitten world of the film. I truly felt for Django's quest and was intrigued by the story of his German liberator King Schultz.\r Speaking of, the characters in this film are outstanding. Tarantino has always been a character writer, but Django and Schultz may be the best film duo I've ever seen. Each character is interesting on their own level (the introduction of Schultz sparks one of most unexpected and entertaining opening scenes in history), but it's the interaction between Django and Schultz that's most memorable.\r Leonardo DiCaprio's villain Calvin Candie is especially potent, to the point that I hated the actor himself for a time after seeing the movie. A slaver with a excessively playboy demeanor, Candie is essentially a hilarious, despicable character that sets up the pieces to introduce the film's true antagonist: Stephen, the head house slave of Candie's plantation (played by Samuel L. Jackson). I can't say too much about this character without spoiling the movie, but it's definitely one of Jackson's scariest roles.\r The climax is one of Tarantino's best, I was never bored while watching the three-hour long movie, and I'm still thinking about the characters and the plot today. This is a movie that I will want to rewatch again and again. I have pre-ordered it from Amazon, and I rarely buy things from the Internet. I highly recommend this movie to all but the faintest of souls.",
            "review_date": "2013-04-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I recommend Django Unchained. It's funny and brutally violent. Good acting, good story and setting, memorable characters (even the minor ones), memorable scenes, main character has an arc.\rIt holds nothing back. It has personality.\rI alsoI recommend Django Unchained. It's funny and brutally violent. Good acting, good story and setting, memorable characters (even the minor ones), memorable scenes, main character has an arc.\rIt holds nothing back. It has personality.\rI also recommend the original Django (1966).",
            "review_date": "2013-04-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic movie from start to finish\r - Brilliant screenplay\r\n- Excellent acting\r\n- Good choice of music\r\n- Great direction by Quentin Tarantino\r\nDjango unchained is the best move of 2012 and is the best movie Quentin Tarantino has made. ItFantastic movie from start to finish\r - Brilliant screenplay\r- Excellent acting\r- Good choice of music\r- Great direction by Quentin Tarantino\rDjango unchained is the best move of 2012 and is the best movie Quentin Tarantino has made. It is absolutely terrific",
            "review_date": "2013-04-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Charismatic Acting by Waltz and DiCaprio, it effectively reverses the history of slavery with well thought of dark-comedy. Not the masterpiece of Pulp Fiction, but Tarantino stabilizes his position as a respected screenwriter and director",
            "review_date": "2013-08-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Yeeeeeah, pretty mediocre to be honest. Its more Tarantino drivel. I honestly cannot think of a scene memorable for any reason other than gratuitous violence.Its like the screenplay was just an excuse to see how many times Tarantino couldYeeeeeah, pretty mediocre to be honest. Its more Tarantino drivel. I honestly cannot think of a scene memorable for any reason other than gratuitous violence.Its like the screenplay was just an excuse to see how many times Tarantino could use the \"N\" word in a movie script all with Samuel L Jackson's blessing. . .As per Inglorious Basterds the only redeeming feature is Christoph Waltz who absolutely shines.Other than that, its way too long recommended for only the most die-hard Tarantino fan boys",
            "review_date": "2019-11-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolutely FantasticDjango Unchained is one of my favorite Tarantino films with it’s great job of showing a different period in time.",
            "review_date": "2019-07-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Cartoonish, simple-minded piece of pablum. WTF ya'll thinkin'? See Just Mercy for a real film.",
            "review_date": "2020-10-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of the worst Tarantino's movies. It starts well but the second half turns out to be quite bad and I really didn't like the ending with a soundtrack that really seems to be out of place.",
            "review_date": "2021-11-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Excellent film.  My favorite Tarantino movie to date.  Like many Tarantino films, this movie makes you think, but it's a comedy.  Django Unchained invokes a wide variety of emotions.  One moment, you will be sickened.  Then you'll get angry.Excellent film.  My favorite Tarantino movie to date.  Like many Tarantino films, this movie makes you think, but it's a comedy.  Django Unchained invokes a wide variety of emotions.  One moment, you will be sickened.  Then you'll get angry.  And in the middle of those things, and before and after it all, you'll laugh.  Sometimes you'll wonder if you were supposed to laugh, but you'll laugh anyway.  And in the center of it all are interesting, genuine characters.  Christoph Waltz plays Dr. Shultz, a German bounty hunter who is incredibly educated.  Leonardo DiCaprio plays a Southern plantation owner, Calvin Candie, who is just plain sickening.  Samuel L. Jackson plays DiCaprio's slave whose family has served the Candies for generations.  And finally, there's Django, played by Jamie Foxx, a former slave who wishes to save his wife and exact vengeance on those who would keep slaves.  These characters are some of my favorite movie characters of all time.  The movie is worth watching just for them.",
            "review_date": "2013-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the best film I've seen this year. Incredibly entertaining, hilarious and just satisfying to watch. All of the negative reviews seem to be from people who are offended by bad language and violence. Umm, don't go see a QT movie if youThis is the best film I've seen this year. Incredibly entertaining, hilarious and just satisfying to watch. All of the negative reviews seem to be from people who are offended by bad language and violence. Umm, don't go see a QT movie if you are so thin-skinned. For the rest of the adult audience, do not miss this one in the theaters. An amazing experience you will not soon forget.",
            "review_date": "2013-01-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nWith any filmmaker, there are ups and down. This one is definitely up! Christop Waltz (in another winning performance) plays a dentist-turned-bounty-hunter who strikes a deal with a slave (Jamie Foxx in the title role): help him find his bounty and he'll free Django and help him find his wife. They outsmart all the villains until they finally land at the plantation run by Leonardo DiCaprio. Despite the cruel depiction of slavery, this is Tarantino's funniest film yet (the head bag scene is a classic). The violence leans toward comic book broadness with more blood splatter than guts or cuts",
            "review_date": "2012-12-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Quentin Tarantino has served up another politically incorrect, self indulgent, overlong and graphically violent  joy ride of a film as only he can do it.  Django Unchained will likely elicit a myriad of responses from viewers  but it'sQuentin Tarantino has served up another politically incorrect, self indulgent, overlong and graphically violent  joy ride of a film as only he can do it.  Django Unchained will likely elicit a myriad of responses from viewers  but it's certainly not boring.  It's also relentlessly tense and manages to maintain that suspense for its entire running time making it an exhausting endeavor.  Now if Tarantino would just take all of his considerable talents and make a film that adds up to more than a mere mash up of his numerous geek inspirations.",
            "review_date": "2013-01-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "You either love Tarantino or you hate him. If you're an uptight, PC liberal prude who hates Tarantino, this film will do nothing to change your mind. But, if you like your films to be violent and witty, your dialogue brilliant and smart, yourYou either love Tarantino or you hate him. If you're an uptight, PC liberal prude who hates Tarantino, this film will do nothing to change your mind. But, if you like your films to be violent and witty, your dialogue brilliant and smart, your actors sublime and ridiculous, your cinematography sprawling and personal, your soundtrack eclectic and coherent, then \"Django Unchained\" will become, perhaps, not only one of your favorite Tarantino films, but one of your favorite films, period.\r \"Django\" is Quentin Tarantino in true form, at his best, and while it's a very long film, you will never once feel bored. Hilarious, enlightening, shocking, frightening, saddening, ambitious and greatly, greatly enjoyable, \"Django\" is hands-down one of the best films I've ever seen.",
            "review_date": "2013-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While undoubtedly a good film, and not at all crappy holiday filler, I can't hope on the \"this is an incredible film\" train. I liked it, but found it to be not much more than a good way to spend a friday evening. Not bad at all, but notWhile undoubtedly a good film, and not at all crappy holiday filler, I can't hope on the \"this is an incredible film\" train. I liked it, but found it to be not much more than a good way to spend a friday evening. Not bad at all, but not great. Christoph Waltz and Leonardo Dicaprio really shine, but that's really the only stand out incredible part of the film. Overall, just good, not great.",
            "review_date": "2013-01-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Tarantino displayed little, if any restraint at all while filming this movie.   It is ridiculously long and at times it is way over done.  Some of the action scenes are overly obnoxious and some of the other scenes are of such a serious andTarantino displayed little, if any restraint at all while filming this movie.   It is ridiculously long and at times it is way over done.  Some of the action scenes are overly obnoxious and some of the other scenes are of such a serious and delicate matter (brutal slave scenes) to tamper with.  The outstanding performances by Dicaprio and Cristoph Waltz help keep this movie so entertaining.",
            "review_date": "2013-01-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What a great spectacle. This is what going to the movies should feel like. I already loved Inglorious Bastards but this one is even better because it is a little bit more focused. It is not a perfect film because 3 hours are a little tooWhat a great spectacle. This is what going to the movies should feel like. I already loved Inglorious Bastards but this one is even better because it is a little bit more focused. It is not a perfect film because 3 hours are a little too much. With 20 minutes less it would be perfect. But damn I so enjoyed it and the rest of the theatre seemed to enjoy it too. Jokes, amazing scenes, Tarantino´s typical take on things and especially... the performances WoW Everybody is perfect: Jamie Fox, Christoph Waltz and Samuel L. Jackson are so great... but the biggest thing is Leonardo Dicaprio. What a great and different role and villain for him. He´s perfection in here and steals the show: so creepy, funny and effeminate. It´s superb. Nobody would regret seeing this film, a great roller coaster.",
            "review_date": "2013-01-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Quentin Tarantino best film. Some wonderful performances in this film from jamie foxx leo dicaprio   christoph waltz which is now one of my favorite actors is just wonderful in this film and  samuel l jackson one of his most memorableQuentin Tarantino best film. Some wonderful performances in this film from jamie foxx leo dicaprio   christoph waltz which is now one of my favorite actors is just wonderful in this film and  samuel l jackson one of his most memorable performance with quotes like \"who dis n***a on dat neigh\" and  dem MF aren't here to buy no mandingo\". Beautifully written and well directed 10/10.",
            "review_date": "2013-02-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Django Unchained is Quentin Tarantino's homage to the spaghetti westerns of the 60's- with a hefty dollop of marinara on top, in true QT fashion. Jamie Foxx is the title character, a slave rescued from servitude by a German bounty hunter, Dr.Django Unchained is Quentin Tarantino's homage to the spaghetti westerns of the 60's- with a hefty dollop of marinara on top, in true QT fashion. Jamie Foxx is the title character, a slave rescued from servitude by a German bounty hunter, Dr. King Schultz (Christopher Waltz). In exchange for helping him track down and kill various wanted men, Schulz agrees to help Django rescue his enslaved wife (Kerry Washington) from Candyland, a plantation owned by the sadistic Calvin Candie (Leonardo DiCaprio.) Tarantino has a knack for bringing out the best in actors, and DiCaprio in particular shines among a field of diamonds, playing Candie with marvelous antebellum gusto. Samuel L. Jackson said he wanted to play the most hated Negro in cinematic history, and he most certainly gets his wish here. Stephen, Calvin's racist house slave, is a truly despicable character, in a movie filled with them. This is an extremely violent film: fountains of blood erupt onto the screen during gunfights; a runaway slave is torn apart by a pack of dogs; eyes are poked out; skulls are bashed in. None of this should surprise anyone who has seen either of the Kill Bill movies. If gratuitous violence bothers you, do not watch this. I wasn't bothered, though. All the violence is directed towards slave owners and their enablers, and, frankly, they deserve to die. Even if you're an adamant pacifist, you can't deny Tarantino's virtuosity. His style of film making is just so fun to watch. The dialogue is a joy to listen to, as is the music. Even when an anachronistic rap song starts playing, you don't mind because, somehow, it fits right alongside the flamboyant guitar instrumentals and Johnny Cash's god-fearing country. Django Unchained, though simplistic and borderline cartoonish at times, is a supremely satisfying piece of film-making. Movie buffs rejoice: Tarantino is back, and he's not pulling any punches.",
            "review_date": "2012-12-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Certainly an amazing accomplishment of a film. Django Unchained is best described as fun. It had excellent acting and was at all times enjoyable. While it does force you to confront thoughts you rarely acknowledge, it is hilarious much of theCertainly an amazing accomplishment of a film. Django Unchained is best described as fun. It had excellent acting and was at all times enjoyable. While it does force you to confront thoughts you rarely acknowledge, it is hilarious much of the way through. The plot was extremely predictable in a very good way. You can see what's coming a mile away and you want it to arrive. Anyone criticizing the predictability as a bad thing is likely doing so simply to criticize. I would recommend this movie to anyone not disturbed by extreme violence and cruel behavior.",
            "review_date": "2013-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is not \"Pulp Fiction\" nor \"Inglorious Basterds\", but it is as insanely entertaining as you expect. Great performances, crisp and funny dialogue, violent shootouts, cool music, very good camera and cinematography. A spagetti westernThis is not \"Pulp Fiction\" nor \"Inglorious Basterds\", but it is as insanely entertaining as you expect. Great performances, crisp and funny dialogue, violent shootouts, cool music, very good camera and cinematography. A spagetti western revenge epic with a modern look. It's the full Tarantino package, so enjoy!",
            "review_date": "2013-01-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The previews for Django Unchained are misleading because they do this masterpiece no justice. This movie is truly spectacular in nearly every aspect. The dialogue is fantastically written as its both very witty and humorous. Even thoughThe previews for Django Unchained are misleading because they do this masterpiece no justice. This movie is truly spectacular in nearly every aspect. The dialogue is fantastically written as its both very witty and humorous. Even though comedy isn't on the genre list, there's a lot of comedy, mainly dark, in this  - which becomes beneficial for comic relief purposes because the movie has many intense scenes and the movie is pretty long. The acting was superb. Almost everyone gave a strong performance. Samuel L Jackson played the old, bitter man to perfection. Jamie Foxx showcased that he could play a multidimensional character that expressed many different emotions. While I'm not fond of DiCaprio, I must admit his first performance as an antagonist was well-done and really blended into the the character he was portraying. And Christoph Waltz truly deserves an award for his performance. Everything about it was brilliant. The timing, mannerisms, facial expressions, body language, believably, you name it. The only performance I didn't care for was Kerry Washington's. Her performance was lacking emotional investment. In other words, I didn't fall in love with her character. But still, her character didn't overshadow the movie's brilliance or even stand out like a sore thumb. It was just mediocre. Like many Tarantino movies, this had a lot of blood, violence, gore, and all that good stuff. That said, the movie isn't for people who have a weak stomach, but it is indeed for anyone who's a sucker for realistic  blood and gore. In fact, it will make blood seekers go berserk. After all, let's just say it will make many of his films look peaceful in comparison. The plot and narrating  were both crafted well, too. They both keep you guessing what direction the movie is going. An the directing, of course, is just superb. The camera shots, the timing, the choice (plus timing) for the music, the envision of how scenes should look like....... everything was choreograph extremely well. Ultimately, Django Chain is a front runner for movie of the year and in my eyes has surpassed everything that's happened this year by a mile.",
            "review_date": "2012-12-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Quentin Tarantino has given us the best Christmas present, another one of his \"Epic\" cinematic accomplishments. Not only one of the best but my favorite movie of the year. Underneath the bloody, revenge, slavery theme of Django Unchained isQuentin Tarantino has given us the best Christmas present, another one of his \"Epic\" cinematic accomplishments. Not only one of the best but my favorite movie of the year. Underneath the bloody, revenge, slavery theme of Django Unchained is also a love story. Django's only priority in this story is rescuing his beloved wife from the \"evil\" hands of Calvin Candie (Dicaprio) and his loyal black land owner Stephen (Sam L. Jackson). The Western genre is one of my, if not the most, favorite genre of all movie genres. Spaghetti westerns are even superior, in my opinion. So I knew all the little homages Tarantino placed in this film. Including the original Django, Frank Nero, in the same scene with Jaime Fox's Django. These small features of the film just added more fun to my experience not to mention how well the comedy blended while in this portrayal of a dark horrific time in America. The songs used in this movie, MY GOD! Every song fitted so well into the scene it was introduced. The soundtrack is just another reason why Quentin is so unique when it come to film making. From Ennio Morricone to Rick Ross to Jim Croce everything was blended spectacularly to its southern setting.\rTo say the acting is great is a bit of an understatement. Jamie Foxx plays such a fantastic lead as his character develops from a shy slave to the fastest, ballsy, gunslinger in the south. Christoph Waltz, like in Inglourious Basterds, steals every scene he's in with his witty charm and his lovable character's way of escaping out of a tight spot very unexpected. Leonardo Dicaprio gives another great performances and probably one of his best. A very flamboyant evil character at that. Now Samuel L. Jackson just blows it out of the park by a long shot. He gives such an astonishing performance as great as on the level of Jules in Pulp Fiction. He steals the scenes from the scenes Christoph Waltz is in. He was by far the most evil and outrageously funny character in the entire movie. He deserves an Oscar nomination for this role. Kerry Washington is great but is not the usual strong female performance you usually get in a Tarantino film. Probably because of the plot and its setting in history. All the secondary characters were flawless as well, including Jonah Hill's comedic small role. I adored everything from the stylized beginning to the showdown in the end. Even the small little details to the actors Quentin uses in his movies like Charles Parks or himself. I honestly found more humor than any comedy I've seen this year. The heavy use of gore and buckets of blood is exactly my taste in movies. Does it drag on? Of course, in the second act it tends to drag on a bit which is probably the set up of Dicaprio's character development. As a fan I wouldn't mind it being five hours long but as a reviewer perspective it could have been trimmed just a tad bid. The death scenes were a spectacle to experience. I was in awe from every death scene. I have to give this masterpiece a 10/10",
            "review_date": "2012-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Aside from the obvious Tarantino dialogue, camerawork, and soundtrack, all of which are excellent, the film has an excellent meta-commentary on the blacksploitation genre by contrasting the idea of \"Mandingo fighting\" with the structure andAside from the obvious Tarantino dialogue, camerawork, and soundtrack, all of which are excellent, the film has an excellent meta-commentary on the blacksploitation genre by contrasting the idea of \"Mandingo fighting\" with the structure and outcome of the film itself. Characters, though not at snappily witty as in Tarantino's other films, are more complex, thought-out people than in Tarantino's other films. Samuel L. Jackson's character, who on a surface reading is a thin parody of the house slave stock character, becomes a much more rich and complex character when you look not only at his actions towards Django in the film, but consider his motivations and his general role at Candyland. I can't decide if he is ultimately a villain, is stealthily mitigating the abuses of the plantation, is simply spiteful, or if some of his more villainous-seeming actions are a poorly-executed attempt to aid Django, in his way.",
            "review_date": "2012-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "So. DJANGO UNCHAINED. It was, well, pretty good. Not \"Oh my GOD\" good. Great fun out of the gate; Christopher Waltz is tremendous, Jamie Foxx too (and as ever, great fun spotting all the terrific actors that Tarantino clearly reveres poppingSo. DJANGO UNCHAINED. It was, well, pretty good. Not \"Oh my GOD\" good. Great fun out of the gate; Christopher Waltz is tremendous, Jamie Foxx too (and as ever, great fun spotting all the terrific actors that Tarantino clearly reveres popping up in cameos throughout . And it continues being a blast for about... 2 hrs. Don't want to give anything away, but it all falls apart, and didn't need to be anywhere NEAR as long as it is. I mean, I'm willing to forego plot holes if I'm enjoying the ride (TAKEN, as well as any number of other movies, but that's the first that comes to mind), but the latter 1/3 of this thing just feels like Tarantino lost interest. It's sloppy. No where near what, in my humble estimation is still his masterpiece, the great KILL BILL, Vol. 1. Oh, and as an actor, Tarantino continues to have a bright future as a director.",
            "review_date": "2012-12-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pros of the film: performances by Waltz and DiCaprio, dialogue, and certain action sequences. Cons: length, overzealous use of gore and dramatic spectacle. \"Django Unchained\" seems catered to Tarantino's \"Kill Bill\" fans, which is unfortunatePros of the film: performances by Waltz and DiCaprio, dialogue, and certain action sequences. Cons: length, overzealous use of gore and dramatic spectacle. \"Django Unchained\" seems catered to Tarantino's \"Kill Bill\" fans, which is unfortunate if you thought \"Inglorious Basterds\" displayed the director heading in a better direction.",
            "review_date": "2012-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Q.T. has made a career of taking a genre and spoofing it by upping the volume and violence and placing tongue firmly in cheek. In this latest one the tongue is placed in a nether cheek. The older I get the less humor I find in his work and itQ.T. has made a career of taking a genre and spoofing it by upping the volume and violence and placing tongue firmly in cheek. In this latest one the tongue is placed in a nether cheek. The older I get the less humor I find in his work and it is replaced more by \"ludicrous.\" So why go? Grand-sons must be catered too and I found he got the humor in the violence and badinage to carry on Q.T.'s reign as king of Pulp. I do wonder how this will play in the deep south and the inner city.",
            "review_date": "2012-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Tarantino's take on the spaghetti western is a fun but uneven film that film fans will enjoy.  Great performance by both Waltz and DiCaprio, but a surprisingly disappointing turn by Jamie Foxx by the lead.  It too has pacing issues due to itsTarantino's take on the spaghetti western is a fun but uneven film that film fans will enjoy.  Great performance by both Waltz and DiCaprio, but a surprisingly disappointing turn by Jamie Foxx by the lead.  It too has pacing issues due to its length; Django starts of strongly but got significantly weaker  near the end.  However, despite its seemingly 'low' ambition as a blaxpotation / western hybrid flick, Django Unchained is the first film I have seen to address the issue of slavery in manner that is believable.  It's casual attitude towards maybe the first 'true' portrayal of this 'dark part' of American history.  This interesting perspective on this issue raise a lot of the audiences' interests in flipping (or browsing) the historical books, and maybe that's what Tarantino is aiming at.  Still one of the better films of this year.",
            "review_date": "2013-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As a native of Mississippi, I have to say that this movie is...Fantastic. It really brings to light the absurdity of slavery and the rampant ignorance found across the country on such an issue. Whites, blacks, Asians, Latinos--ALL ethnicitiesAs a native of Mississippi, I have to say that this movie is...Fantastic. It really brings to light the absurdity of slavery and the rampant ignorance found across the country on such an issue. Whites, blacks, Asians, Latinos--ALL ethnicities sat in the theater together laughing and cringing collectively. It's over-the-top Tarantino at his best. In comparison to Inglourious Basterds, Django Unchained is much more balanced, maintaining sharp dialogue and awesome action that audiences have come to love. If this were a truly offensive flick, as critics seem to point out, Django would not have had such excellent actors play lead roles, and the NAACP Image Awards would not have recognized it with such acclaim. Note: Greenville, MS, doesn't look anything like that, but who really cares.",
            "review_date": "2013-02-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Drags on. The plot comes to a clear finish, then drags on for another half an hour. Other than that fine. Not wonderful. Tarantino movies are starting to show their age. What would be \"edgy-silly\" --is more just silly. Django sorta teeters onDrags on. The plot comes to a clear finish, then drags on for another half an hour. Other than that fine. Not wonderful. Tarantino movies are starting to show their age. What would be \"edgy-silly\" --is more just silly. Django sorta teeters on being a kids movie.",
            "review_date": "2013-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A Cool Western Spaghetti rather than saying classic western.Tarantino's trademark are much less except for the bloody mash.Even one could doubt if it is a tarantino flick(until you see his cameo somewhere at the end) .TheA Cool Western Spaghetti rather than saying classic western.Tarantino's trademark are much less except for the bloody mash.Even one could doubt if it is a tarantino flick(until you see his cameo somewhere at the end) .The Characters,especially the one played by christoph waltz tends to be intriguing but doesn't match up with the film.Leonardo DiCaprio occupies less space but a powerful one.No wonder if the title character doesn't get any award nominations.All i can say is the film is more lengthy and less creative.And yes..it is behind death proof.I can give Death proof 8 rating.As a fan i received some kind of disappointment.",
            "review_date": "2013-01-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie started out strong on all fronts, but begins to descend into a long-winded story that never really grasped my attention. Still, the movie manages to bring plenty of comedic gore and drama which is unique.",
            "review_date": "2013-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Probably the greatest movie ever created. Incredible while watching it, cinematography and everything. Great to reflect upon as well. Perfect. Quentin Tarantino.",
            "review_date": "2013-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The critics review for this movie are all right. The negatives that they point out are true, it is long, ridiculously bloody, and personally, the editing is awful (specifically the first half). However the acting, writing, and directing wereThe critics review for this movie are all right. The negatives that they point out are true, it is long, ridiculously bloody, and personally, the editing is awful (specifically the first half). However the acting, writing, and directing were great attributes that led this movie to glorious endings and beautiful scenes. It is DiCaprio's best acting since Blood Diamond, and the script makes you feel the hatred and revenge that this movie exhibits. Go see it, I would understand if you don't like it as much as me but you will get your moneys worth in the gunfight scenes alone.",
            "review_date": "2013-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of Quentin Tarantino's greatest movies and in my opinion his best film with the exception of Pulp Fiction. Jaime Foxx does a terrific job in the lead role, however it is the two supporting actors, Christoph Waltz and Leonardo Di Caprio,One of Quentin Tarantino's greatest movies and in my opinion his best film with the exception of Pulp Fiction. Jaime Foxx does a terrific job in the lead role, however it is the two supporting actors, Christoph Waltz and Leonardo Di Caprio, who truly steal the show. Di Caprio's riveting portrayal of the sinister plantation owner Mr. Candie is perhaps his best acting job so far. If you are a Tarantino fan this is a must see, it is one of the great movies of the 2000's and through Tarantino's signature directing and witty writing will become a classic in no time.",
            "review_date": "2012-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Yes the story is predictable, but name a Tarantino film outside of Pulp Fiction that isn't predictable. What makes this film great is how he can get away with the in your face subject matter, while still leaving the audience laughing at everyYes the story is predictable, but name a Tarantino film outside of Pulp Fiction that isn't predictable. What makes this film great is how he can get away with the in your face subject matter, while still leaving the audience laughing at every comical moment. Like a lot of QT films it starts to feel a little long midway, but it picks back up in phenomenal fashion. People who go see this flick and not expect over the top gore are fooling themselves. This isn't a heavily dramatic depiction of the evils of slavery, if you want that you should go see Lincoln instead. Instead it assumes your already aware of how evil slavery was and creates a comedic action satire story of the good angry black guy out to get revenge against a horde of evil white slavers. This isn't his greatest flick, but its the best he has done in a long time. Well worth going to go see, even for people not that into Tarantino flicks. Expect to find a fun and enjoyable action movie with a lot of laughs.",
            "review_date": "2012-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Another triumph and masterpiece from QT. His use of a linear structure made it one of his most satisfying accomplishments if not one of his most emotional. The love story completely worked for me as well as the typical QT trademarks andAnother triumph and masterpiece from QT. His use of a linear structure made it one of his most satisfying accomplishments if not one of his most emotional. The love story completely worked for me as well as the typical QT trademarks and explosive violence. A true American classic.",
            "review_date": "2012-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Man, what a movie, WHAT AN AMAZING MOVIE !!! It was like a roller coater ride. I was pumped the entire time. I could feel the adrenaline. Everybody delivered a great performance, especially Jamie Foxx. I hope, for once, the academy willMan, what a movie, WHAT AN AMAZING MOVIE !!! It was like a roller coater ride. I was pumped the entire time. I could feel the adrenaline. Everybody delivered a great performance, especially Jamie Foxx. I hope, for once, the academy will considered a good movie like this.",
            "review_date": "2013-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As someone who appreciates Quentin Tarantino's films, I had high hopes for this film, despite its running time (2:45). There were many great things about this film, Christopher Waltz's performance as a fearless bounty hunter, Samuel L.As someone who appreciates Quentin Tarantino's films, I had high hopes for this film, despite its running time (2:45). There were many great things about this film, Christopher Waltz's performance as a fearless bounty hunter, Samuel L. Jackson and Leo Dicaprio both were very strong, but the film just felt overlong. Not to mention excessively gratuitous. Slavery is not a topic to be handled lightly, but there are many scenes in this film that are excessive in their brutality, and in hindsight, simply add to the film's run time without contributing too much in terms of plot development. Enjoyable, while being on Tarantino's lower totem pole of films.",
            "review_date": "2012-12-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's safe to say this was one of my (and many people's) most anticipated films of the year. And does it deliver? Ehhh. Look it's filled with the snappy QT dialogue and signature violence but the pacing was all over the place. Much like PeterIt's safe to say this was one of my (and many people's) most anticipated films of the year. And does it deliver? Ehhh. Look it's filled with the snappy QT dialogue and signature violence but the pacing was all over the place. Much like Peter Jackson's Hobbit I think Tarantino doesn't like editing. It's really entertaining but it just takes a while to get there. Still one of the year's best films though.",
            "review_date": "2012-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I just saw this epic movie in the theaters, and wow is amazing!  Quentin Tarantino is by far my favorite director after this movie.  He doesnt do anything wrong esspecially in this master piece.  The final shootout is insane to say the least!I just saw this epic movie in the theaters, and wow is amazing!  Quentin Tarantino is by far my favorite director after this movie.  He doesnt do anything wrong esspecially in this master piece.  The final shootout is insane to say the least!  From begining to finish, this film does not dissapoint!  Just see this non stop action movie and you will be blown away! 10 out of 10 definetly",
            "review_date": "2012-12-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Classic Tarantino movie. Awesome action scenes, great characters, interesting story, hard to find something bad about it. Interesting spin on slavery. Great movie.",
            "review_date": "2012-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Don't listen to the ridiculous, amateurish critics here. The majority of the users giving this film poor views just LOVE films like Wreck it Ralph and The Bourne Legacy. Talk about artistic taste. This film is, without a doubt, one of theDon't listen to the ridiculous, amateurish critics here. The majority of the users giving this film poor views just LOVE films like Wreck it Ralph and The Bourne Legacy. Talk about artistic taste. This film is, without a doubt, one of the best (if not THE best) films of 2012. Since I was a bit late to the punch, there are plenty of reviews out, and I know that most enthusiasts would have planned to see it already... So if you haven't, just see it. Then you can either recognize its gritty brilliance and heart for what it is, or deplore it, and proceed to glorify the latest Michael Bay film instead.",
            "review_date": "2012-12-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This might get preachy. First things first, anyone who gives this movie a one out of ten either lacks taste or is just being plain sour. I am not here to rate the director, however I AM here to rate the film. I do not care one bit about howThis might get preachy. First things first, anyone who gives this movie a one out of ten either lacks taste or is just being plain sour. I am not here to rate the director, however I AM here to rate the film. I do not care one bit about how this may or may not stack up to QT's past films. Truthfully, this is one of the most entertaining movies I've seen all year. The cinematography is vibrant, creative, and brilliant, and QT never fails to tell the story exceptionally well via visuals. The dialogue was witty and fantastic, it exceeded my expectations. (sarcasm ahead) WHY IS THE PLOT SO SIMPLE?! IT SHOULD HAVE A THOUSAND TWISTS AND THE COMPLEXITY OF A 10,000 PIECE PUZZLE! Not. I see nothing wrong with a simple plot that does the job, to simply entertain the audience. This film was amazing. It kept me captivated, laughing, and gritting my teeth from time to time from the marvelously-placed suspense.",
            "review_date": "2012-12-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The best Tarantino movie in my opinion, Django is a thrill ride full of laughs, tension and action that enthralls for all of it's nearly 3 hours. I hate needless violence and swearing in movies, but the gore and cussing never feel unnecessaryThe best Tarantino movie in my opinion, Django is a thrill ride full of laughs, tension and action that enthralls for all of it's nearly 3 hours. I hate needless violence and swearing in movies, but the gore and cussing never feel unnecessary due to the context, and in fact add to the immersion. A must-see.",
            "review_date": "2012-12-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I saw this on Christmas day in a packed theater.  Even though the film was 2 hrs 40 minutes time never dragged and people clapped at the end of the film.  I'm docking 1 point for excessive violence which at times was WAY over the top.  I knowI saw this on Christmas day in a packed theater.  Even though the film was 2 hrs 40 minutes time never dragged and people clapped at the end of the film.  I'm docking 1 point for excessive violence which at times was WAY over the top.  I know QT loves violence in his films but really, I couldn't watch the scene with the dogs or the Mandingo fight.  There is also a scene discussing KKK hoods that seems right out of a Mel Brooks movie rather than Tarantino but it was hilarious.  For me, Christoph Waltz was the best thing about the whole movie.  I hope he and Tarantino continue to do more films together - it's a perfect match.  The film may have been written for Waltz as he is a German actor, and speaking German is a key component of the film.  There are strong performances from DiCaprio and Jackson as well.  Great directors get great performances from their cast.  All in all, a great combination of humor and violence, plus a strong depiction of slavery and its atrocities.",
            "review_date": "2012-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Quentin Tarantino is a great director, he can make the most meaningless scene in a movie interesting and memorable, which is sort of how the film starts off.",
            "review_date": "2012-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not  everything in Tarantino's filmography can be as good as Pulp Fiction or Basterds. For me Django falls a little short of those lofty expectations, but a pretty good Tarantino film is better than most movies in any given year. Django isNot  everything in Tarantino's filmography can be as good as Pulp Fiction or Basterds. For me Django falls a little short of those lofty expectations, but a pretty good Tarantino film is better than most movies in any given year. Django is gonna get a lot of comparisons to Basterds because they are both revenge fantasies at their core. While that may not be fair it is natural given the very similar plot arcs. While I still think I would have preferred Bastreds if it had been made second because of two of the best scenes ever put into  film, it is hard to say because Django did feel familiar while Basterds felt like something you had never seen before. There is still plenty to love about the movie. As usual this film is very dialogue driven with biting humor and some dark overtones. Nobody in film ever uses dialogue to build tension like Tarantino and there is plenty of that at work here. Performances are great almost across the board, especially Waltz and Dicaprio. Foxx gives a nice, understated performance as Django. My only beef with the performances was surprisingly Jackson. Although I think that is more a product of the character than his performance. If the usual Tarantino stylized violence is your cup of tea, there is enough of it on display here to get your fill. For me this movie goes off the rails just a bit in the final third. I never felt like Tarantino knew how to end this film and it ended uo being the weak link in another very good Tarantino vehicle.",
            "review_date": "2012-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's been a couple of weeks since I've seen it, but the 3 aspects of the film that stick out the most are (1) the length - about 30 minutes could have been shaved out from it - though I do love the extended dialogue sequences featuringIt's been a couple of weeks since I've seen it, but the 3 aspects of the film that stick out the most are (1) the length - about 30 minutes could have been shaved out from it - though I do love the extended dialogue sequences featuring Christoph Waltz, and it's a treat to be able to root for him after loving to hate him in Basterds; (2) the humor - the homage to Blazing Saddles with the hood scene is worth the price of admission alone;  and (3) a slightly missed opportunity with DiCaprio - for some reason, I felt like I should have despised him more.  Yes, he's a scoundrel who does horrible things, but I didn't want him to burn as much as I wanted other Tarantino villains to meet their demise.  It's an excellent film, but it doesn't compare to Pulp Fiction, which is also long, but extremely tight in its sequencing.",
            "review_date": "2013-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am not a Leonardo DiCaprio fan. But, I thought he gave one helluva performance. I agree with Roger Ebert's review of the movie. In addition to DiCaprio's performance, I really enjoyed Christoph Waltz's performance as well. QT smacks youI am not a Leonardo DiCaprio fan. But, I thought he gave one helluva performance. I agree with Roger Ebert's review of the movie. In addition to DiCaprio's performance, I really enjoyed Christoph Waltz's performance as well. QT smacks you rwight in the face w/this movie. You will go through a lot of emotions while watching this movie. But, if you are a fan of QT, you should be fine. Don't worry about Spike Lee with all his money. See the movie, then make your own judgement call. It was a very long movie, but that's cool. I thought the last half hour or so moved slowly along.",
            "review_date": "2013-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Just as he struck the Nazis in Inglourious Basterds, Tarantino takes his aim in Django Unchained at Southern slave owners before the Civil War, etching their moral defects into a brutal tale of freedom and intrigue. After the first scene setJust as he struck the Nazis in Inglourious Basterds, Tarantino takes his aim in Django Unchained at Southern slave owners before the Civil War, etching their moral defects into a brutal tale of freedom and intrigue. After the first scene set in an isolated forest where wily German bounty hunter \"Dr. Schultz\" finds and frees Django in order to lead him to a bounty, the teamed duo embark on a killing odyssey, jumping bounties, getting rich and facing all of the vile and ingrained implications involved with racist Southern slavery into a series of action-packed vignettes. Some might say Tarantino has offered us just another violent-frenzied exploitation film, but he does so in the best way possible, knowing when and where to tug to make the audience laugh and cringe, and does so with great characters, dialogue and tension. He knows how to do what every great director should know how to do.",
            "review_date": "2013-01-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Well, I was ready for nothing less than a masterpiece, got it in spades... I am amazed at the quackery in the world of critiquing movies professionally. Anyone that has any idea as to what they were in for when they decided to go see thisWell, I was ready for nothing less than a masterpiece, got it in spades... I am amazed at the quackery in the world of critiquing movies professionally. Anyone that has any idea as to what they were in for when they decided to go see this movie, would leave a very happy movie goer. This is classic QT, and as predictable as it may be for some, I sure as hell did not see certain plot twists coming, and I am damn good at reading plot. Anyhow. This deserves all 10's, it will delight you if you are indeed an individual that can understand and appreciate what it is and why it is so important as a work of art. Otherwise, go back to your Bridesmaids and Twilight flicks. What a joy of a horror it was.",
            "review_date": "2013-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Django is a beautiful production with perfect acting, cinematography, and sound. I enjoyed myself to a large extent watching it. My only criticism would be the length is a bit much considering how linear the content is. I cannot see aDjango is a beautiful production with perfect acting, cinematography, and sound. I enjoyed myself to a large extent watching it. My only criticism would be the length is a bit much considering how linear the content is. I cannot see a Tarantino movie without amazingly high expectations so he did well, considering.",
            "review_date": "2012-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Just everything you wait from a QT movie. Blood, guns, violence, deep and long dialogs, humor and stuff - everything entertains you, unless you don't accept the cruel, but still realistic perspective of one of the most nonconformistJust everything you wait from a QT movie. Blood, guns, violence, deep and long dialogs, humor and stuff - everything entertains you, unless you don't accept the cruel, but still realistic perspective of one of the most nonconformist directors. This movie is like taking a breath of fresh air, it's something really new  that pops-up among all the mainstream occasional stuff.",
            "review_date": "2013-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was expecting this to be an overrated film riding on the Tarantino hype. But make no mistake, Django Unchained is a great movie in its own right and one of Tarantino's greatest works. It just about nails everything. The scenes are lengthyI was expecting this to be an overrated film riding on the Tarantino hype. But make no mistake, Django Unchained is a great movie in its own right and one of Tarantino's greatest works. It just about nails everything. The scenes are lengthy but very tense and with amazing direction as you would expect. The trademark \"no holds barred\" violence and intelligently crafted dialogue are present, along with a great deal of comical moments. The story and direction as well as the characters all deserve praise of the highest order. Even if you're not a Tarantino fan, you should definitely give Django a try.",
            "review_date": "2013-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I may be biased since i adored every movie Tarantino puts out (except for Jackie brown, it was just too long for its own good) but seriously, its a fantastic movie. It has a faster pace than most of his movies, and when I say that, there'sI may be biased since i adored every movie Tarantino puts out (except for Jackie brown, it was just too long for its own good) but seriously, its a fantastic movie. It has a faster pace than most of his movies, and when I say that, there's really only one scene that has a normal amount of Tarantino dialogue. (Tarantino likes to have VERY long scenes of just dialogue, but builds a lot of personality) There was some great  laughs in the movie. The real kicker was that, yes Jamie Fox was the star, but he is certainly not the one to be watching. Leonardo DiCaprio and Christoph Waltz stole the show and played their characters perfectly. Overall, if you like Tarantino, you should defiantly see this movie, if you don't or haven't seen or heard of Tarantino, its still worth seeing, even if its only once.",
            "review_date": "2013-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "First of all: For you guys who complain about Tarantino using slavery in the west, pay attention to the movie before talking The movie DOES NOT pass in the west! Texas and Mississippi are on the south, that's it, the movie doesn't take placeFirst of all: For you guys who complain about Tarantino using slavery in the west, pay attention to the movie before talking The movie DOES NOT pass in the west! Texas and Mississippi are on the south, that's it, the movie doesn't take place anywhere else. You really think Tarantino would make such a mistake?\rI loved the movie, the acting, the story (that is quite different from the style of any other Tarantino movie), the way he mixes all kinds of genre (comedy, drama, action, etc) and makes the movie get so interesting you want to watch it again, and again and again. Besides i didn't like the fact Django turned out to be the Cowboy image (come on, it would be awesome if he was just the free slave getting his vengence without this whole american western cowboy hero thing), Tarantino made an impressive screenplay with an impressive acting work. For the violence, some people complain about the absurd amount. For me, Tarantino can ude it the way he wants, that at the end, it's going to be good, more then any other violence movie.",
            "review_date": "2013-07-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Waltz, as always, is amazing and Foxx is solid as well. DiCaprio is a solid villain as well. While it is an enjoyable movie, It is far too long (nearly 3 hours). It did get to the point where I simply felt I was grinding out the movie insteadWaltz, as always, is amazing and Foxx is solid as well. DiCaprio is a solid villain as well. While it is an enjoyable movie, It is far too long (nearly 3 hours). It did get to the point where I simply felt I was grinding out the movie instead of enjoying it. I think it would have been more enjoyable if it was shorter. Aside from that, It was a solid movie.",
            "review_date": "2013-02-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of Tarantino's best films. The pacing is good throughout, but seems to be artificially quickened in a couple parts of the movie. Even so, there's enough here to keep fans entertained for the duration.",
            "review_date": "2013-01-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Django Unchained is all about Quentin Tarantino celebrating how cool he is. It has everything you expect from him: cheesy gore, dialogue self-aware of its stupidity, memorable characters and excellent performances. Leonardo DiCaprio, SamuelDjango Unchained is all about Quentin Tarantino celebrating how cool he is. It has everything you expect from him: cheesy gore, dialogue self-aware of its stupidity, memorable characters and excellent performances. Leonardo DiCaprio, Samuel L. Jackson and Christoph Waltz are incredible and make you laugh all the time. Unfortunately it's not the case for Jamie Foxx, who lacks charisma and doesn't create a solid character like his scene-stealing co-stars. Of course, Tarantino's self-indulgence gets in the way and the movie ends up being 30 minutes too long. But in the end, Django Unchained is a very enjoyable ride. Just not Tarantino's best.",
            "review_date": "2013-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Tarantino new movie is great he is funny bloody and intresting so let me tell you first why is it funny:all tarantino movies are funny to me becuase that all the killing is so crazy that is very funny.the story is 2 years before the civil warTarantino new movie is great he is funny bloody and intresting so let me tell you first why is it funny:all tarantino movies are funny to me becuase that all the killing is so crazy that is very funny.the story is 2 years before the civil war whan django meets with dr king schultz.and schultz make with django a deal that django will help him with is hunting and in the winter they will rescue is wife.so i am very reccomending django unchained",
            "review_date": "2013-02-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Tarantino could really have made \"Django\" something rare in which stylish performances could meet an alluring script in the middle of the hard-core Western environments that stay true to its time. Unfortunately, for as much as it pulls you inTarantino could really have made \"Django\" something rare in which stylish performances could meet an alluring script in the middle of the hard-core Western environments that stay true to its time. Unfortunately, for as much as it pulls you in during its impeccable first half, it takes away in the next with its glacial pacing and its overly-brutal actions sequences. While the performances remain strong throughout, Tarantino's direction does nothing to hold on to what kept my interest in the first place, which was Foxx's transformation from a born slave into a natural bounty hunter. Watching Foxx share the screen with Waltz as they outsmart, outmaneuver and obliterate their targets in the most entertaining way they know how is stunning in its amusement. This is perhaps why I am so disappointed with Tarantino's change of heart somewhere half way through the movie. The lighthearted tone assigned to the characters takes an ultimately darker turn which takes away what made \"Django\" tremendously fun in the first place. The fight scenes also become downright disturbing half way in as Tarantino strains up the gore to such an extent that the scenes themselves no long seem to be enjoyable. I realize that hardcore Tarantino fans would prefer nothing else, but I am just saying make sure you have a decent stomach. Despite the fact that \"Django Unchained\" loses a lot of its steam early on, I simply refuse to dislike it because of its robust insight towards the time period, DiCaprio and Waltz's powerful performances and for Tarantino's ability to write an energetic script even if his direction doesn't suit it perfectly.",
            "review_date": "2013-01-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As a lover of Spaghetti Westerns (Once Upon a Time in the West is my favorite) and Tarentino films (Death Proof is my favorite), it was a no-brainer that I would enjoy this film. I was only a little surprised at how thoroughly I enjoyed it.As a lover of Spaghetti Westerns (Once Upon a Time in the West is my favorite) and Tarentino films (Death Proof is my favorite), it was a no-brainer that I would enjoy this film. I was only a little surprised at how thoroughly I enjoyed it. From start to finish I was captivated. Do I think this is an absolutely great film that everyone must go see before they die? Nope. I can see where a lot of people would not enjoy it. It is not a heavy thinkpiece or a soulless action flick. It is a character driven film with great moments of high tension (I do not believe anyone does it better today than Quentin) done by someone who has a great appreciation for the art - the way he makes pouring a beer pop with sound and image is one of the few things that earn him the right as a master. I left the theater wondering when I would have the chance to go see it again.",
            "review_date": "2013-01-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Its one of Tarantino's best work, Django provides an exhilirating and brutal plot that pleases Tarantino fans and other fans alot.",
            "review_date": "2013-03-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm not going to waste my time in defending this brilliant film because it didn't reach a handful of viewers who simply didn't get what Tarantino delivered. Django Unchained is quite simply one of the best movies in a number of years, andI'm not going to waste my time in defending this brilliant film because it didn't reach a handful of viewers who simply didn't get what Tarantino delivered. Django Unchained is quite simply one of the best movies in a number of years, and might be recognized as one of the director's finest. From it's trademark QT dialogue to it's cinematography, editing, choreography and over the top slayings, D.U. addresses a gruesome era with zeal, humour and relevance, much like it did with Inglorious Basterds. If you're new to the director's brand, yes, you're in for quite a ride and may not be able to stomach much of what happens. If you're a fan, you're in for another type of ride, one that is blissful, highly entertaining and leaves you replaying a number of it's moments long after the credits roll. There should be many Oscar opportunities here and like his other films, I can't wait to see it again. Retribution has never been so wonderfully refreshing. Brilliant!!",
            "review_date": "2013-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film is incredible.It's Tarantino at his best.The soundtack is so cool, the quotes are hilarious and the acting is compelling.I had an overdose of joy watching this.Tarantino is a movie nerd and it shows in his films. People can say whatThis film is incredible.It's Tarantino at his best.The soundtack is so cool, the quotes are hilarious and the acting is compelling.I had an overdose of joy watching this.Tarantino is a movie nerd and it shows in his films. People can say what they like, find tiny faults here and there, but that's what makes it great.The rawness makes it feel more real.Anybody who likes cult B movies will be blown away.Not everybody has the same taste, just like we don't all have the same IQ,so no surprise to see some negative reviews.",
            "review_date": "2013-01-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Maybe it's just the fact I find most of Tarantino's work to be amazing, but this dude knows what he is doing most of the time. Aside from the organization of this film and its over-editing, Django was one of those movies you want to see moreMaybe it's just the fact I find most of Tarantino's work to be amazing, but this dude knows what he is doing most of the time. Aside from the organization of this film and its over-editing, Django was one of those movies you want to see more than once. DiCaprio gives one of his best performances, and the trademark gore of a Tarantino film was taken to the next level, which I found to be incredibly entertaining.",
            "review_date": "2013-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The film is amazing. It contains everything you'd expect from Quentin and much more. dark humour, violence, great action, one liners and most of all its **** cool. Anyone one that marks this lower than ten doesn't know **** all aboutThe film is amazing. It contains everything you'd expect from Quentin and much more. dark humour, violence, great action, one liners and most of all its **** cool. Anyone one that marks this lower than ten doesn't know **** all about films...... and should be shot in the face!",
            "review_date": "2013-01-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Django unchained could in my opinion be Tarantino's best movie.  It's unrestrained, vicious, and at times very funny.  It should have beat Argo for best picture.  Just watch it.  Unless you can't stand violence in movies.  In that case youDjango unchained could in my opinion be Tarantino's best movie.  It's unrestrained, vicious, and at times very funny.  It should have beat Argo for best picture.  Just watch it.  Unless you can't stand violence in movies.  In that case you might not like it, but it's screenplay, acting, and directing are all masterful.",
            "review_date": "2013-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Django Unchained is quintessential Quentin and it delivers in a way only Tarantino can deliver. \u2028As with all of his directorial endeavours, Tarantino fittingly adopted a shackles are off, anything goes mentality. This mentality in theDjango Unchained is quintessential Quentin and it delivers in a way only Tarantino can deliver. \u2028As with all of his directorial endeavours, Tarantino fittingly adopted a shackles are off, anything goes mentality. This mentality in the case of Django Unchained effectively translated on-screen to a gripping, extravagant, bloodthirsty, perfectly paced, often-humourous escapade with a serious political undercurrent that is thoroughly enjoyable. It is most definitely history altering, indulgent, audacious and continually outrageous, but it does make for spectacular viewing.\r Django Unchained is a Spaghetti Western genre mash-up written and directed by Quentin Tarantino set in America",
            "review_date": "2013-01-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A film with no flaw. Django Unchained gave me everything I want from a Tarantino film and more. Christoph Waltz in his \"supporting\" role (Although I, and I think many people would say he stole the show) as Dr Schultz did a fantastic job ofA film with no flaw. Django Unchained gave me everything I want from a Tarantino film and more. Christoph Waltz in his \"supporting\" role (Although I, and I think many people would say he stole the show) as Dr Schultz did a fantastic job of keeping us all entertained. I cannot go without saying that the casting of the film was impeccable, and watch out for Quentin's cameo, because it's a good one. The costume and set designs as always are beautifully done. The gore is, although over-the-top, is very fun to watch and will have you squirming in your seats. All in all, I am very pleased that Mr Waltz and Mr Tarantino came home happy from the Oscars on Sunday Night.",
            "review_date": "2013-02-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film is simply epic, the directing is extraordinary  the acting is brilliant and the script plays up to the actors perfectly. So far this film is number 1 on my list for 2013, all i can say is you shouldn't miss it!",
            "review_date": "2013-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Tarantino does it again.  The man has never made a bad movie and with Django Unchained we get a well written and acted film.  Jamie Fox and Leonardo DiCaprio are fabulous, but Christolph Waltz is the stand out here.  He and Tarantino are justTarantino does it again.  The man has never made a bad movie and with Django Unchained we get a well written and acted film.  Jamie Fox and Leonardo DiCaprio are fabulous, but Christolph Waltz is the stand out here.  He and Tarantino are just a perfect combination.",
            "review_date": "2013-04-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Django Unchained is an example for awesome western movie! I think it's near perfect, but the only thing i hated was that the real action started at the end and the first gangs died too easy! Everything else was great!",
            "review_date": "2013-08-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was once a real Tarantino fan. He reinvented old style movies and it\rwas fun and well made. Problem is, that's all he can do (or is wanting\rto show). His movies got weaker and weaker and even fans could only\r\nreply to critic with \"It isI was once a real Tarantino fan. He reinvented old style movies and it\rwas fun and well made. Problem is, that's all he can do (or is wanting\rto show). His movies got weaker and weaker and even fans could only\rreply to critic with \"It is intentionally bad! It just makes fun of old\rmovies.\"\r Same with this one. Most funny thing her is, that very young people are\rtalking like this. People that never have seen an Italian western\rbefore but now defend this movie as an obeisance, a critical\rexamination or an ironic view. It feels just like Tarantino has thrown\rsome episodes together and found no way to combine them. Acting is\rreally bad (yes yes, it's for sure intentionally bad like everything in\rthis movie) except of Jamie Foxx and Leonardo Di Caprio and. Which is\rkind of funny, because normally I can't stand him and like Christoph\rWaltz. But Waltz' character was most times completely overacted like in\rsome school play. Tarantions own small role stood out in relation to\rthe rest: like a completely talent less actor. Man, do I miss the\rTarantino of \"From Dusk till Dawn\" or \"Pulp Fiction\"...\r So: Story is a mess, acting is crap... what is there else to say? Well.\rThe music score is a mixture of cinematic themes, pop music and hip\rhop. Does not fit as good as anywhere in the movie. Cutting was a mess\rtoo. Some cuts where extremely hard and just done badly.\r Only cam was quite good, there were some really nice pictures. And the\roverall theme of slavery and how everyone took their side in this dark\rtimes (yes, even the white \"missus\" did take their role of shame) let\rme give a 6.\r This movie is neither a obeisance to the old Italien western nor is it\ra critical examination nor an ironic view. It's just took some elements\rand mixed them up quite bad. If it really was intentional it does not\rmake a better movie. It's like making a gross hamburger to make fun of\rfast food and then expecting people to eat it with pleasure. Which will\rbe done by all the Tarantino fans out there. No matter how bad their\ridol cooks, how bad the burger tastes or how messy it looks: they will\rlove it because it's made by their idol. For the rest of us: good there\rare much better restaurants our there. Including the old traditional\rItalian Pizzeria where you can get a real \"Django\" if you want to.\rWithout any erupting blood fountains, they are nowhere to be seen in\rthis movie from 1966.",
            "review_date": "2013-04-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Historically, it’s clearly off.  But you see the plight of slaves in that era and can’t not say this movie is one of the boldest that’s ever been done. It’s phenomenal, and while it is 165 minutes long, those minutes will fly by.  It’s raw,Historically, it’s clearly off.  But you see the plight of slaves in that era and can’t not say this movie is one of the boldest that’s ever been done. It’s phenomenal, and while it is 165 minutes long, those minutes will fly by.  It’s raw, crazy, and just one damn good time.",
            "review_date": "2013-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is by far one of my favorite movies.  I love everything western and this movie followed the journey of a slave turned bounty hunter named Django in his search to find and free his wife.  This movie has a good story, tons of action, andThis is by far one of my favorite movies.  I love everything western and this movie followed the journey of a slave turned bounty hunter named Django in his search to find and free his wife.  This movie has a good story, tons of action, and some comedy.  This movie was also made by Quentin Tarantino so you know its good already.",
            "review_date": "2013-10-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "EASILY my favorite of Tarantino's films and it's not even close. With over-the-top gut busting violence and a legendary performance from Leonardo DiCaprio, Django Unchained represents Tarantino at his most unhinged",
            "review_date": "2019-10-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wow is all I could just say about this movie after watching it I've never seen a western like this if you are used to Clint Eastwood westerns they will not prepare you for this although this movie is not based on an actual story I feelWow is all I could just say about this movie after watching it I've never seen a western like this if you are used to Clint Eastwood westerns they will not prepare you for this although this movie is not based on an actual story I feel without a doubt that the actions that took place in this film were not irregular practices which makes this movie have an early feel to it this movie was gritty and bloody although I'm fine with and action packed scene or shootout there's parts of this movie that made me cringe and almost brought tears to my eyes something not many movies do and all the actors performances in this movie were amazing especially the villain never have I seen such a despicable character in a movie and it was executed perfectly by Leonardo DiCaprio.",
            "review_date": "2014-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If Mel Brooks had directed it might have worked, because this can only be approached as a work of satire. But it's not funny, it's not sad, it's a dud on every level, a milk dud has more flavor.\r Tarantino cannot write romance, what aIf Mel Brooks had directed it might have worked, because this can only be approached as a work of satire. But it's not funny, it's not sad, it's a dud on every level, a milk dud has more flavor.\r Tarantino cannot write romance, what a shock, right. But a romance is the center of the story and ( Jamie Foxx, Kerry Washington) were both a total miscast. Will Smith would have elevated the love story playing opposite say perhaps Keke Palmer who owns an edge and inherent sadness in her eyes at times but shares the attractive personality of Will Smith, whereas Foxx and Washington were both dull and artificially stoic.\r What's more Tarantino did not even come close to depicting the misery of enslavement, which was key in lending any emotional involvement for the audience.\r A lazy outing at the typewriter for Tarantino....if you wanna write slavery, shackle yourself to the desk next time because you clearly do not know what it means and failed even to imagine it.\r Christoph Waltz and Leonardo Di Caprio both shined per usual and the death of their characters were felt but as for the rest of the cast you can throw them all to the dogs...\r Tarantino has proven twice now he can't write historical.",
            "review_date": "2014-07-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Legendary Movie, Is the Best western movie in the last 30 years, a Great job from the Cast .. Leo Di Caprio, Christoph Waltz and Samuel l Jackson they do a good performances .. and Quentin make something will be remembered for many years",
            "review_date": "2016-01-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Change the name of Tarantino's new movie to the Hateful 9 because I also hated it. Looking to give him a fresh look, I watched Django Unchained on Netflix. Better than Hateful 8…but not by much. QT has psychological hang ups;Change the name of Tarantino's new movie to the Hateful 9 because I also hated it. Looking to give him a fresh look, I watched Django Unchained on Netflix. Better than Hateful 8…but not by much. QT has psychological hang ups; African-Americans and the history of blacks , the word **** and Samuel Jackson. The latter is a really good actor but really .. every film ? As always , DiCaprio is a treasure. Bad,bad man. Deliciously played. The acting overall was solid as was the story line but the problem is QT excess and self indulgence. Since Pulp Fiction , the first 1/3 of his movies are really good, often comical , the middle 1/3 o.k. and the last part excessively violent and senseless. My new slogan is \"just say no to Tarantino\" .",
            "review_date": "2016-01-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Django Unchained - the D is silent.\r My point: a perfect western racist film. Made perfect for the whole \"slavery\" concept, using modern legal talk so the audience can perfectly understand. Great acting, great voices, great surroundings,Django Unchained - the D is silent.\r My point: a perfect western racist film. Made perfect for the whole \"slavery\" concept, using modern legal talk so the audience can perfectly understand. Great acting, great voices, great surroundings, great climax, badass action scenes. You get the idea, it's the best Quentin Tarantino I've ever seen (my opinion).\r It also has some decent humor, and some okay slow moments. But the action truly stands out. Samuel L. Jackson really casted his role brilliantly, being that racist, old, brown chap. 10/10, y'all.",
            "review_date": "2016-01-14",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 141
}