{
  "title": "Once Upon a Time in Anatolia",
  "rating": 8.1,
  "release_date": "2012-01-04",
  "summary": "Life in a small town is akin to journeying in the middle of the steppes: the sense that \"something new and different\" will spring up behind every hill, but always unerringly similar, tapering, vanishing or lingering monotonous roads. (NBC Film)",
  "critic_reviews": [
    "With his two early features, \"Distant\" (2002) and \"Climates\" (2006), Ceylan has showed himself a superb film-maker. This is his greatest so far.",
    "The wondrous cinematography is by Gokhan Tiryaki. It is not an easy picture. Not many masterpieces are.",
    "If the word masterpiece has any use these days, it must apply to the film Once Upon a Time in Anatolia, a mature, philosophically resonant work from Turkey's leading director, 53-year-old Nuri Bilge Ceylan (Climates, Distance, Three Monkeys).",
    "The body means different things for each of them, and Ceylan's mesmerizing existential drama takes its time establishing the players and bringing their inner lives into focus. It's cinema as autopsy.",
    "Nuri Bilge Ceylan's mesmerizing Once Upon a Time in Anatolia plays like \"Zodiac\" meets \"Police, Adjective.\"",
    "What a handful of patient moviegoers may find in Once Upon a Time in Anatolia, however, is a subtle, gorgeous and mysterious allegory that may be Ceylan's masterwork to date.",
    "A metaphysical road movie about life, death and the limits of knowledge, Once Upon a Time in Anatolia has arrived just in time to cure the adult filmgoer blues.",
    "Eerily tragic and chillingly hard to come to terms with.",
    "Nuri Bilge Ceylan, one of Turkey's best directors, has a deep understanding of human nature. He loves his characters and empathizes with them. They deserve better than to be shuttled around in a facile plot. They deserve empathy. So do we all.",
    "Tectonic pacing builds to a series of imperceptible and yet earth-moving moments in Nuri Bilge Ceylan's Once Upon a Time in Anatolia, a habeas corpus procedural stretched across two and a half discursive hours.",
    "With its wide-open setting and taciturn, macho characters, it's a film that earns the right to use the \"Once Upon a Time\" title that Sergio Leone made so perversely famous.",
    "Closer in metaphysical spirit to Kiarostami than to Leone, it lingers thanks to beautifully lit widescreen images of lived-in faces and barren, beautiful landscapes.",
    "Complex and sophisticated, this genre-defying crime story is spellbinding viewing.",
    "A 157-minute police procedural at once sensuous and cerebral, profane and metaphysical, \"empty\" and abundant, Once Upon a Time in Anatolia is closer to the Antonioni of \"L'Avventura,\" and it elevates the 52-year-old director to a new level of achievement.",
    "Though its glacial pacing will represent a significant hurdle for many viewers, the film grows steadily more involving as dawn breaks and the men make their way back home, and its unflinching observations of the legal and medical establishment at work frequently rivet. Visually, it's as gorgeous a film as Ceylan has made.",
    "Patient viewers will be rewarded, as long as they pay attention. Lots of what at first seems inconsequential is actually of great import - but Ceylan isn't letting on. And yes, the cinematography is impressive.",
    "For those willing to take the plunge, it is a deep and haunting work that lingers in the memory.",
    "Acclaimed director Nuri Bilge Ceylan's meditative, at times maddening expression of human mystery and barren landscapes is gorgeous to look at, intriguing to think about and, at times, hard to sit through.",
    "There's too much beauty and ballast in the movie's early stages to dismiss Ceylan's cerebral cop drama, and too much genuine banality in its latter acts to justify a sluggish slouch into the shallow end.",
    "Once Upon a Time in Anatolia is boring, but not in the usual way of boring movies. It is colossally, memorably and audaciously boring.",
    "Nuri Bilge Ceylan has to be the least kinetic of working filmmakers - and not simply in the sense of static camerawork or lack of narrative momentum."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This movie confirms Ceylan as my favorite contemporary director and yet another award at Cannes (co-winner of the Grand Prix) is justly deserved.  As with his previous films \"Distant,\" \"Climates,\" and \"Three Monkeys,\" his first career as aThis movie confirms Ceylan as my favorite contemporary director and yet another award at Cannes (co-winner of the Grand Prix) is justly deserved.  As with his previous films \"Distant,\" \"Climates,\" and \"Three Monkeys,\" his first career as a photographer is reflected in each scene.  He is a master of creating mood and in this film, his technical skills are on full display.  What he does with lighting brings to mind the work of Kubrik who also started out as a photographer.  Not a movie for people seeking typical Hollywood fare.  Ceylan unfolds the story slowly and the \"action\" is in the characters, their lives, and their stories.  By the the last scene fades, you are immersed in the inside emotional world of the characters.  Ceylan is not one to hit you over the head to bring attention to a point but gives you  credit for being intelligent enough to discover things on your own.  The discovery, contemplation and interpretation of the film experience continues long after the last scene fades.  What refuses to fade are the indelible images Ceylan has painted on the celluloid canvas.  I highly recommend this film to everyone looking for meaning behind the superficial.",
      "review_date": "2012-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My idea of a film that is worth watching,  one that is consistent with our experiences of the way life really is, and devoid of script writer hyperbole of what they think is required to be engaging. The characters are 3 dimensional, the plotMy idea of a film that is worth watching,  one that is consistent with our experiences of the way life really is, and devoid of script writer hyperbole of what they think is required to be engaging. The characters are 3 dimensional, the plot subtle and surprising, and at the end of it I felt I had learned something about a culture unknown to me. Cinematography superb and evocative. Every minute watched an absolute treasure.",
      "review_date": "2015-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "quite possibly the dullest and most boring waste of time. the first 10 minutes of the movie is the exact same as every minute that comes after, senseless and dispassionate. undeserving of any consideration and evidence that critics are morons.",
      "review_date": "2012-09-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "For those that can sit through a 157 minute film of slow pace they will be greatly rewarded with impressive cinematography across some stunning landscapes, superb actors,  and a profound, understated script.  A subtle allegory from anFor those that can sit through a 157 minute film of slow pace they will be greatly rewarded with impressive cinematography across some stunning landscapes, superb actors,  and a profound, understated script.  A subtle allegory from an accomplished filmmaker well worthy of his Cannes award for Best Director.",
      "review_date": "2012-05-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I first have to say that the film is beautifully shot with some really great imagery showing the bleakness of the landscape and allusions to many of the characters. Even the scenes at night had such great atmosphere; something that doesn’tI first have to say that the film is beautifully shot with some really great imagery showing the bleakness of the landscape and allusions to many of the characters. Even the scenes at night had such great atmosphere; something that doesn’t always come across in film. The only downside was that I had to keep switching to the bottom of the screen to read the subtitles! I found the plot quite unconventional; rather than featuring the procedural investigation; the focus is on the doctor and the prosecutor who stand aside and talk as the search proceeds. This ends up giving an unexpected insight into these two men (I don’t want to say any more  spoilers). Even though I found it very long, I also found it quite engrossing and I’m sure if I watched it again at some point I’d find even more to like about it. It does have an extremely slow pace about it, but that’s one of the things I liked; it gives the audience more time to absorb the story and decide for themselves just what it’s about. I enjoyed it very much.\r SteelMonster’s verdict: RECOMMENDED My score: 8.0/10",
      "review_date": "2013-02-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Most of the movie is very weird, many absurd moments, especially the various topics with are discussed by the people throughout the film. The main story itself is quite simple.",
      "review_date": "2012-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After his latest feature WINTER SLEEP (2014) won Palme d’Or this year, there is no better timing to assess Nuri Bilge Ceylan’s previous works, personally I was daunted by my first experience with his film, THREE MONKEYS (2008, 6/10), so untilAfter his latest feature WINTER SLEEP (2014) won Palme d’Or this year, there is no better timing to assess Nuri Bilge Ceylan’s previous works, personally I was daunted by my first experience with his film, THREE MONKEYS (2008, 6/10), so until now I dare to stride a second step, here comes his 2011 crime-drama.\r continue to read my review on my blog, google cinema omnivore, thanks.",
      "review_date": "2014-05-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A beautiful, atmospheric film. I was not surprised to find out that this director started as a photographer. This film is gorgeous and his framed shots are absolutely amazing. This is the epitome of a character driven film, so if you needA beautiful, atmospheric film. I was not surprised to find out that this director started as a photographer. This film is gorgeous and his framed shots are absolutely amazing. This is the epitome of a character driven film, so if you need your loose ends tied up neatly, flashy action, or an over obvious script, stay away. This film centers around three main characters who all have different responsibilities in a murder investigation. That investigation remains secondary however and the intrigue comes from the three main characters and the revelations they make about themselves as they interact with each other over the course of less than 24 hours. Each one has an interesting story arc and are as unique as they are different. So why did I give this movie an 8 instead of a 10. In the end the movie is just a little bit too ambiguous for me. I don't fault the film and am not even sure how I would change it. However for me to give a movie a perfect score, it needs to resonate perfectly with me on every level. While this film was close it fell just short of hooking me emotionally the way I needed it to.",
      "review_date": "2012-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A haunting existential tale, gorgeously photographed, and full of slow burning, vivid scenes that hint at characters inner secrets. It's cynical and beautiful, the director Ceylon lets the atmosphere drive the story.",
      "review_date": "2014-07-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A beautiful, memorizing film. The cinematography is spectacular! The story unfolds deliberately (some may say slowly, but it never felt that way to me). The mood and the atmosphere created is magnificent. A well constructed story, told in aA beautiful, memorizing film. The cinematography is spectacular! The story unfolds deliberately (some may say slowly, but it never felt that way to me). The mood and the atmosphere created is magnificent. A well constructed story, told in a less than conventional manner with excellent acting. Partake of this movie!",
      "review_date": "2013-10-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This exceptional movie has an original and new cinematic language to criticize a social phenomenon via an epic and realistic story. Photography is in a total balance with the story in such an intrinsic structure that the text of the movie canThis exceptional movie has an original and new cinematic language to criticize a social phenomenon via an epic and realistic story. Photography is in a total balance with the story in such an intrinsic structure that the text of the movie can not be written. Most probably text and scenes are created simultaneously.",
      "review_date": "2015-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "To enjoy Once Upon A Time In Anatolia, the viewer must enjoy policework, in a sense: reading people, making observations, drawing inferences. It is not a film for the passive viewer that wants to be stimulated, entertained. The work isTo enjoy Once Upon A Time In Anatolia, the viewer must enjoy policework, in a sense: reading people, making observations, drawing inferences. It is not a film for the passive viewer that wants to be stimulated, entertained. The work is masterful and deserves the acclaim.",
      "review_date": "2015-10-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The shadow of death is all over the place. It is reaching out from top of a hill and from a valley to the characters’ soul. This is how I found the first part of the Once Upon A Time In Anatolia: Cold as death, Calm as death, and Dark asThe shadow of death is all over the place. It is reaching out from top of a hill and from a valley to the characters’ soul. This is how I found the first part of the Once Upon A Time In Anatolia: Cold as death, Calm as death, and Dark as death. The cinematic references of Ceylan’s work to the works of Abbas Kiarostami and Andrei Tarkovsky made that “shadow of death” fly over our heads.The second half of the film is a clear struggle between what we are seeing on the screen and what we are perceiving from the narrative: There’s no visual sign of death as such but its meaning still lingers on such that the night is not over yet, or in other words: death does not need you to see it with your eyes, it can make its presence deep down your existence. Ceylan’s work is a masterly directed exhibition of death, weather we are aware of it, weather it is the night dark or the day light.",
      "review_date": "2017-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This Turkish film, as films go, is long. But when it ended I was left with the wistful \"But what comes next?\" concerning numerous characters I had come to care about. Virtually every actor in the great ensemble cast was distinctly limned withThis Turkish film, as films go, is long. But when it ended I was left with the wistful \"But what comes next?\" concerning numerous characters I had come to care about. Virtually every actor in the great ensemble cast was distinctly limned with depth so that they were clearly the centers of their own dramas, and not merely bit players in the protagonist's. The film is effortlessly atmospheric, in its use of natural light and darkness, in the sounds of the wind, the cars, the birds. No special effects needed here. It reminds me of my favorite scene from Spielberg's \"Jaws,\" where Captain Quint (played by Robert Shaw) recounts the sinking of the battleship Indianapolis and its aftermath. Lit by a single, swinging, bare bulb, with listeners spellbound, mouths agape. Much of this film has that feel. For a movie with virtually no music, the soundtrack was nonetheless powerful and haunting. Based on only this film, director Nuri Bilge Ceylan has vaulted onto my list of great artists, and I cannot wait to see more of his work.",
      "review_date": "2021-10-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What are the first words that come to our minds when we hear a murder mystery story? Puzzles? A very charismatic detective and his incredible talent to solve the case and find the murderer? What if we company a real murder suspect to a sceneWhat are the first words that come to our minds when we hear a murder mystery story? Puzzles? A very charismatic detective and his incredible talent to solve the case and find the murderer? What if we company a real murder suspect to a scene of a crime with a  group of experts? This movie will do that for us.A group of people(the suspect named Kenan, his mentally challenged brother Ramazan, doctor Cemal, Prosecutor Nusret, commissar Naci, drivers, soldiers, two diggers) are after the exact place that the suspect claims he buried the corp.  It is impossible to locate it because of the vastness of the region. The suspect cannot remember it, or he can't pay attention and recognizes it immediately. Eighter, it gives us time to company them and see how the reality is shockingly different from fiction.In each part, we become familiar with the characters. They reveal themselves to each other, mainly because they are exhausted during the infinitive search, which seems without a result. They talk about lots of things. The commissar's concern is mostly his sick kid. One of the young soldiers worries that they are far away from his service location, and it may cause a problem for him. But here, the main focus is on the doctor, suspect, and prosecutor.Kenan is in great misery. He isn't a genius criminal as usual in the movies. Kenan is not sinister. He is a man who killed another man, and he is afraid. some times he listens to people talking about good dairy, sometimes he falls asleep or dares to ask for a cigarette(because everyone is on edge and frustrated by him)The prosecutor is physically troubled with his constant need to reveal himself and at mind struggling with one of his older cases about a woman's suicide who predicted the day of her death. He is half present, and he won't interfere until it is inevitable.The doctor is an observer. He has gone through a divorce, and it seems that he does not simply care that much to be involved more than necessity. After the commissar loses his temper and bits Kenan, they go to a village to take a rest. In that simple house of Mukhtar, the village's mayor, when the power goes off mayor's younger daughter brings light and beverages. In this scene, she enters as a symbol of innocent. She is a pure aspect of life. She is beautiful, and the light of the lantern on her face in that cruel darkness makes a lively scene. It is so pure that Kenan confesses the main reason for his murder and leads them to the correct location.   Two parts in this movie demonstrate the reality of these situations in real life. First is when they recognize that they forgot a body bag for the corp, and they don't wait for an ambulance. They put the corp the way that Kenan brought it to the location. In the trunk of a car. The second is in forensic medicine when even the sound effect of the autopsy is plain. It becomes so disturbing to watch and continue because even the color of body parts is life-like. We won't get the mystery or mind-blowing dialogues. We feel the cruelty of the jobs and how people deal with them. It creates questions like it does every time, but we won't get a direct answer like life that doesn't gift us with solutions. No one is a hero, just human beings. They open up, and they break down, and in the end, they go back to their routine life. They can involve just to a certain level and not more.  It is Ceylan's art to bring life to the frame. So simple yet so meaningful and deep.",
      "review_date": "2021-04-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A realistic and gripping work. He never bored while watching the plot. It is one of the works in which Nuri Bilge Ceylan fully reflects his style. We are facing the pale countryside again. Although the film contains details, it does notA realistic and gripping work. He never bored while watching the plot. It is one of the works in which Nuri Bilge Ceylan fully reflects his style. We are facing the pale countryside again. Although the film contains details, it does not connect to an ending. It was again left to the audience what kind of meaning to attach and what lessons to learn.",
      "review_date": "2023-01-12",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 38,
  "genres": [
    "Drama"
  ]
}