{
    "title": "The Intouchables",
    "rating": 8.2,
    "release_date": "2012-05-25",
    "genre": [
        "Drama",
        "Comedy"
    ],
    "summary": "The Intouchables tells the true story of a wealthy, physically disabled risk taker, the picture of established French nobility, who lost his wife in an accident and whose world is turned upside down when he hires a young, good-humored, black Muslim ex-con as his caretaker. Their bond proves the power and omniscience that love and friendshipThe Intouchables tells the true story of a wealthy, physically disabled risk taker, the picture of established French nobility, who lost his wife in an accident and whose world is turned upside down when he hires a young, good-humored, black Muslim ex-con as his caretaker. Their bond proves the power and omniscience that love and friendship can hold over all social and economic differences. (The Weinstein Company)… Expand",
    "critic_reviews": [
        "Enjoy this movie for what it is - the kind of motion picture that can cause Champaign-like giddiness - and don't obsess over how true-to-life this work of fiction is.",
        "Let me come clean right now and tell you that I enjoyed The Intouchables quite a bit. If you're looking for a lightweight summer change of pace, with just a smidgen of Continental flair, here it is.",
        "It's the kind of movie that inspires word-of-mouth recommendations by speaking the international language of culture clash.",
        "The Intouchables works as a crowd-pleaser not because it's true, but because it's a plausible enchantment.",
        "The Intouchables is an exuberantly charming French buddy comedy that proves an audience will suspend disbelief and follow an unlikely story as long as it's superbly crafted.",
        "It has warmth, humor and an understated sweetness that is not to be taken for granted.",
        "What it provides (instead of the thematically clever dialogue of typically subtle French comedy) is biting wit, poignancy and, forsaking some structural nuisances, the summer's best bromance.",
        "There are plenty of reasons not to like The Intouchables, but Omar Sy's terrific performance blows right past them.",
        "Not a great film but a warm one that pushes the viewer's emotional buttons so deftly it feels like a massage. My guess is that you will laugh and cry at all appropriate moments. Resistance is futile.",
        "The film fulfills its feel-good promise, as long as it's seen as the fairy tale it was meant to be.",
        "Take from the film's racial commingling what you want. Much of this may be old hat, even corny, and potentially offensive, but I haven't laughed out loud this often at a movie in ages.",
        "It's worth noting that this movie is loosely based on actual people – except the real-life Driss character is, in fact, an Arab. If Driss had been an Arab, The Intouchables would have waded into less navigable waters, but it might have made for a tougher movie.",
        "The power dynamic may charm the French, but it's likely to push the cringe buttons of local moviegoers in Obama's post-\"The Green Mile America.\" Apart from the wince-inducing moments, The Intouchables is often a pleasant buddy picture.",
        "It's the classic odd-couple buddy movie setup, only it'll pull at your heartstrings, whether you want it too or not. And you won't want it to, because it's sap.",
        "This is a story that has been told time and again in the movies, and sometimes the performances overcome the condescension of the formula.",
        "Sy and Cluzet are superb actors who demolish stereotypes about race and social class by finding a common humanity in their characters. Acting this good forgives a lot of sins.",
        "A box office phenomenon in France, this crowd-pleasing drama is based on a true story but sticks closely to the template for a Hollywood buddy movie.",
        "It is possible to summarize the experience of watching The Intouchables in nine words: You will laugh; you will cry; you will cringe.",
        "In this sentimental feel-good saga of an ultra-wealthy quadriplegic and the petty criminal who becomes his caretaker, the chemistry between the two lead actors goes a considerable way toward elevating the broad-strokes culture clash. That's crucial to a film that is, in essence, a love story.",
        "Actually, The Intouchables isn't bad - its merely shameless, but at least it's overtly so.",
        "Sy and Cluzet give their parts more conviction than they deserve, even when the former is forced to re-enact the falsetto-singing-in-the-bubblebath bit from Pretty Woman. But even their energy can't revive a corpse this dead.",
        "The lens through which the The Intouchables was filmed may be too rose-colored for some people's taste, but the window that these talented performers throw open -- a window onto the strange and touching friendship between two very different men -- is crystal clear.",
        "Some of the elements in the film are inexplicable and some are undeveloped, but there are a handful of nicely crafted set pieces.",
        "This tired little movie got on my last nerve. If Driss is so charismatic and so full of ingenuity, why isn't he using any of that skill to help lift up his family?",
        "\"Driving Miss Daisy\" this ain't. Except that it sort of is.",
        "This essentially good-natured movie, a massive hit in France, is more likely to strike American audiences as trite than offensive.",
        "Corny, calculating and commercial...Their slickly executed culture-clash character piece is stuffed chock full of hard-knock life lessons that owe much more to the conventions of the screen than the tough realities of social deprivation and of the severely handicapped.",
        "Cluzet and Sy nonetheless make for ingratiating foils; the extended opening sequence in which the duo outwits a pair of cops like a hell-raising Laurel and Hardy could be a stellar short comedy if it weren't married to the deadly self-serious shtick that follows.",
        "A cheeky dream-drama about the friendship between a rich, white quadriplegic and a penurious black job-seeker, the premise of The Intouchables alone nearly renders analysis redundant.",
        "Though never known for their subtlety, French co-helmers/scripters Eric Toledano and Olivier Nakache have never delivered a film as offensive as \"Untouchable,\" which flings about the kind of Uncle Tom racism one hopes has permanently exited American screens."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "I don't see how anyone could not like this movie. The acting is good, the story reaches out to you, at times it is genuinely touching, and a moment later you will find yourself laughing in your chair. If you get the chance, see this movie.I don't see how anyone could not like this movie. The acting is good, the story reaches out to you, at times it is genuinely touching, and a moment later you will find yourself laughing in your chair. If you get the chance, see this movie. The great feeling you're left with alone is worth the money.I went to see this film with six or so friends, and while we're usually quite divided on whether a film was good or bad, we all agreed that this is one of the best movies you can go see this year.",
            "review_date": "2012-05-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Amazing movie, although this film is about 2011, I just watched it last week, you can laugh, you can cry, but is inspirer, that kind of movies that change your life. Great music, Omar Sy was very well,  François Cluzet too. I can't understandAmazing movie, although this film is about 2011, I just watched it last week, you can laugh, you can cry, but is inspirer, that kind of movies that change your life. Great music, Omar Sy was very well,  François Cluzet too. I can't understand how anyone couldn't like this film.",
            "review_date": "2014-08-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "We need more movies like 'The Intouchables' that touch you, probably make you cry, but for sure make you laugh. Inspiring movie actually, from one side to be more open-minded, not so boring within the limits of normal and on the other side toWe need more movies like 'The Intouchables' that touch you, probably make you cry, but for sure make you laugh. Inspiring movie actually, from one side to be more open-minded, not so boring within the limits of normal and on the other side to fight no matter in what situation you are in. Honestly, I cannot see flaws in that charming in this charming dramatic comedy.",
            "review_date": "2018-02-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When  a snapshot in the life of a tetraplegic is the feel good movie of the year for me, I know I have found a gem.  Interestingly enough the main reason for this is the performance of the unknown to me Oman Sy, playing the role of theWhen  a snapshot in the life of a tetraplegic is the feel good movie of the year for me, I know I have found a gem.  Interestingly enough the main reason for this is the performance of the unknown to me Oman Sy, playing the role of the caretaker, oozing with innocence, charm and energy.   The always excellent François Cluzet managing to express himself without lifting a finger, the solid direction of the two film directors and screenwriters, who based their movie on a true story, only made the whole project one that you'd want to watch again and again.",
            "review_date": "2013-04-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is an absolute masterpiece. \"Professional\" critics, get over yourselves and watch it again instead of rating boring turds like Civil War and 10 Cloverfield Lane at 100.",
            "review_date": "2016-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The reason so many critics didn't like this movie is because it makes fun of being a self important prick and a snob who's willing to pay 11 000 euros for a painting because they see a meaning in it no one else does.\r Honestly can'tThe reason so many critics didn't like this movie is because it makes fun of being a self important prick and a snob who's willing to pay 11 000 euros for a painting because they see a meaning in it no one else does.\r Honestly can't understand how anyone can't have a smile on their lips and a tear in the corner of the eye after having watched this movie. Absolutely fantastic, heartfelt and funny, and maybe most importantly: It felt real.",
            "review_date": "2014-11-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The interaction between Driss and Philip is light-hearted, thought provoking and meaningful. The story is human and plays on current issues that we are facing with today. I really liked it as it was able to relate to me  to my real lifeThe interaction between Driss and Philip is light-hearted, thought provoking and meaningful. The story is human and plays on current issues that we are facing with today. I really liked it as it was able to relate to me  to my real life situations and the different ways I can approach them.",
            "review_date": "2014-12-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The best films I have ever seen is «The Untouchables», starring Francois Cluzet and Omar Sy. Film won more than 10 awards around world. The box office is more than $440 million. It is one of the most high-rated film and worldwide total ofThe best films I have ever seen is «The Untouchables», starring Francois Cluzet and Omar Sy. Film won more than 10 awards around world. The box office is more than $440 million. It is one of the most high-rated film and worldwide total of sold tickets is 50 million.\rThis is the story about rich person Philippe and his servant Driss. Philippe is disabled and cannot do anything without help. Driss is poor emigrant, who is looking for good and easy way to earn money for his huge family. The film sets in Paris and beautiful views of the French capital contribute to show a glorious atmosphere of the narrative and take viewers from the first minute. The excellent acting skills perfectly show emotions and feelings of the characters.\rIt is not so easy to find a kind film for the whole family with deep meaning and morality about real life, not cartoon’s imaginary world. In my opinion, The Untouchables is exactly this type of films. People of all ages will find something interesting and funny for themselves.\rI strongly advise you to go and see the film.",
            "review_date": "2015-02-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Intouchables\" is a fantastic movie filled with humour, surprise, depth and character. The incredible music and cinematography help to drive home this unique story that impressed at almost every step.",
            "review_date": "2020-06-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This popular French import (last year's most viewed film) will likely prove a hit here. It's about a rich invalid who hires a black ex-con from the \"hood\" as caretaker. The seemingly incompatible combo turns out to be perfect partnership ofThis popular French import (last year's most viewed film) will likely prove a hit here. It's about a rich invalid who hires a black ex-con from the \"hood\" as caretaker. The seemingly incompatible combo turns out to be perfect partnership of support, humor and friendship. Both of the leads are endearing and the story moves with a lively attitude and plenty of laughs. Expect to be charmed, touched and entertained.",
            "review_date": "2012-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the feel good movie of the year for me. To think that it was based on a true story. There are a few bright spots still on the horizon, it seems. Improbable pairing of the two principals, but it worked.",
            "review_date": "2012-07-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Definitely worth of watching, with a great sense of humor, reality and a little bit of magic! After all Intouchables make me feel as good as main characters in the movie.",
            "review_date": "2012-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is great and the actors too the storyline is very good and i hope it became a episode 2 then this is actually the best movie sorry for my bad english im german :D",
            "review_date": "2012-05-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's a freakin classic. Great movie, unless you are a jaded cynic. This is probably the first movie I gave a ten. And even though I am kind of a film expert, I based this rating solely on how I felt while watching it.",
            "review_date": "2012-10-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a must see!  Everyone I've recommended it to has thoroughly enjoyed it.  Unless you are a total cynic or movie snob that has to have dark twist or inexplicable plot, this is a movie to be enjoyed",
            "review_date": "2012-06-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Thanks to all strong cast and smooth direction, Intouchables was crowd pleaser. Never stop laughing during the movie, Intouchables was really that good. Although it is super hilarious, the subject is serious.",
            "review_date": "2012-12-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As a friend said, it is the depressing serious films about death and suicide that get the high critical praise. she will no longer seeing anything rated over 70 for fear that it'll be a downer. This one  is delightful, funny, suspensefulAs a friend said, it is the depressing serious films about death and suicide that get the high critical praise. she will no longer seeing anything rated over 70 for fear that it'll be a downer. This one  is delightful, funny, suspenseful ...and slightly fluffy. I'd recommend it to anyone.",
            "review_date": "2012-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Intouchables is a peculiar film, because is so different from what we have seen, speaking only about the way that the plot is developed, however the plot itself is not original. This picture treats topics such as humanity and feelingIntouchables is a peculiar film, because is so different from what we have seen, speaking only about the way that the plot is developed, however the plot itself is not original. This picture treats topics such as humanity and feeling humanized. Philippe is a quadriplegic millionaire and everyone treats him like someone with a condition, until he meets Driss, a black man who had been recently in jail. The thing that captivates the protagonist is that Driss forget about his condition and treats him as an equal; Philippe finally could feel like a real human being.\rAnother interesting thing of the movie is the title Intouchables, referring to Philippe and Driss, because they both are marginalized from the society, the first one have a condition and the other is an ex-convict. All this can be notice in the relation that this both men have with their families. Ones go to the birthday of the millionaire just to see if he is still alive, and the others kicked out Driss from his home.\rDespite the film is very slowly, the humor is great and sophisticated. Plus a mix of classical-disco soundtrack, good direction and unexpected performances, highlighting the one of Omar Sy, this is a pleasant feature, not intouchable at all.",
            "review_date": "2013-01-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Amazing movie! Really funny and really touching. A very well-spend 2 hour trip into the lives of these two interesting men. Omar Sy is really funny, also the second or even third time you're watching the movie and I really enjoyed the cameraAmazing movie! Really funny and really touching. A very well-spend 2 hour trip into the lives of these two interesting men. Omar Sy is really funny, also the second or even third time you're watching the movie and I really enjoyed the camera angles as well. Rightly the most successful French film in years: a must-see movie!",
            "review_date": "2012-09-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am uncertain as to what I can find to criticise about this movie. It is a joy from beginning to end. The subtle emotional piano music in the background lends it an emotional edge that only enhances the stunning performances of the twoI am uncertain as to what I can find to criticise about this movie. It is a joy from beginning to end. The subtle emotional piano music in the background lends it an emotional edge that only enhances the stunning performances of the two leading actors. The comic timing is wonderful as well as the mix of poignant reality and cruel fate.\rThis is so refreshingly different from the pappy Hollywood stories of brotherhood we see that it genuinely made me think seriously about moving back to Europe. It deserves all the accolades it will receive. Most of all it is a seriously funny movie I laughed and cried.",
            "review_date": "2012-08-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Excellent drama with a little comedy.",
            "review_date": "2012-12-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is cliche, yes. But it is also an incredibly pleasing, well-acted, often times hilarious, and heartfelt drama. Ludovico Einaudi's contribution to the score is phenomenal.",
            "review_date": "2012-11-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ok, so I went into this movie not knowing anything about the actors, director, or story so that I could give the movie an unbiased review so YOU could make an educated decision about seeing this film: and here we go. This movie isn't withoutOk, so I went into this movie not knowing anything about the actors, director, or story so that I could give the movie an unbiased review so YOU could make an educated decision about seeing this film: and here we go. This movie isn't without its charms, believe you me, it will have you giggling one moment and dead silent the next, but its just that. You'll share no huge laughs or be truly concerned for the main characters and the way their lives intertwine. Don't get me wrong, both lead actors play their roles very well, but not enough to draw you truly in to this brief slice of their lives. Some parts of this movie felt like they were thrown in just to fill time and serve no other purpose. I cant give this movie a higher review but it does have its audience: those who need to know their are people out there who have it just a little worse than you do. But you still might not come away with that.",
            "review_date": "2012-07-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "For the second week in a row I saw a winner of a movie when I picked to go and see, â",
            "review_date": "2012-06-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Shredding box office records in Europe, and shedding histrionics to tell a tale of dependence explored by an improbable friendship, 'Intouchables' confirms the enduring appetite filmgoers of all sorts can have for the simplest of stories;Shredding box office records in Europe, and shedding histrionics to tell a tale of dependence explored by an improbable friendship, 'Intouchables' confirms the enduring appetite filmgoers of all sorts can have for the simplest of stories; ones that aren't fake with bank-breaking void, but full with real shades of humanity. Directed by Eric Toledano and Olivier Nakache, the film revolves around two very different men, each looking for someone or something to mitigate their current situations; circumstances that are far from favorable. The first is a Senegalese immigrant named Driss (Omar Sy) who lives anyway he can. He resides in the crime-ridden projects outside Paris, France, where he commutes by foot, and is in the process of recovering from his stint in prison that's lasted six months. Looking to find a solid line of employment, one that will limit his time off the streets, Driss lands a job as a caregiver to an affluent quadriplegic Phillipe (Francois Cluzet). This premise provides the framework for the evolving relationship of two very different people, joined together by means of business. While the film does make certain of its \"based on a true story\" visage, it, in reality, is far more fictionalized than true (the real-life Driss, for example, was an Arab named Abdel). When asked why the filmmakers opted to make the casting change to include a black aide, they made the case they wanted Omar Sy. That's fine, he is more than qualified; he did beat out Jean Dujardin's role in \"The Artist\" for last years French Cesar Award. However, some of the scenes he's in, feel overly cliche, corny, and forced; think \"Earth, Wind, and Fire.\" Moreover, as a whole, 'Intouchables' also contains a great many plot twists and character developments that seem to come from nowhere at unspecified times. Even more, and vexing of all, is the amount of exaggeration and lingering sense of insincerity that is never quite lifted from the film's intended \"feel-good\" aura; the film tries to offer something so absurdly inconceivable while not explaining how it all could be considered plausible. Instead, one is left to contemplate what might have been if the holey script would have placed more focus on developing the characters, and the situations that surround them. Notwithstanding its continuation of subterfuge, 'Intouchables' is held together by an earnest devotion to humanity, with its writers paying careful attention to delineating stability from adversity, and the persevering will by each man to accept the other, turning what would otherwise be constant cliche into an affecting camaraderie that is brought to form by Sy and Cluzet who possess a surprising chemistry to the screen. Further, while the copious subplots flirt with vapidity, often detailing personal despair, the film remains apt with the frequent gauging and testing of the men's representative comfort levels that the audience can see and feel teetertotter before their very eyes. Ultimately, 'Intouchables' liege disposition to value interpersonal affection over flattering dishonesty solidifies its connection with audience, and almost compensates for its few-too-many moments of self-inflicted abashment. It's the leads who salvage this lightly-intense European-pop-culture-phenomenon. Don't like it...you can blame the French.",
            "review_date": "2012-05-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The film has been officially crowned as the most successful film in French domestic market (Frenchâ",
            "review_date": "2012-06-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Movies based on true stories are often the best. this is a very emotional story that makes me whine as much as it makes me laugh. When there's only good people you're gonna see a wonderment.",
            "review_date": "2013-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A soulful and near-to-perfect French language drama film written and directed by Olivier Nakache and Eric Toledano, The Intouchables is one of the most genuine surprises of this year. I had no idea how great this film would be and I am very,A soulful and near-to-perfect French language drama film written and directed by Olivier Nakache and Eric Toledano, The Intouchables is one of the most genuine surprises of this year. I had no idea how great this film would be and I am very, very glad that I had been waiting to watch this for a long time. The excellent incorporation of drama, slight humor, good song selection, delicacy of the intense joyful/saddening moments and those silly jokes are what make this film so great. The direction is so superb at times that even the saddening moments can make you laugh at times with the inclusion of those silly jokes.\rOf course, the review would be incomplete without mentioning the wonderful performances by Omar Sy and Francois Cluzet, that are totally worth appreciating. They are the souls of this film, they generate that fantastic charisma which is enough to keep you interested in the film. The storyline is fresh, as it is also based on a true story and it moves you emotionally and what's best about it that it doesn't deviate from the true purpose of the movie despite the fact that it covers almost every aspect of drama in a single plot. I'm not going to spoil it for you by discussing the plot of the film.\rThis film has done much business on Box Office in France and it may also be the biggest blockbuster because it is that great, people are really loving it. I LOVED IT. It has also been shortlisted in the Best Foreign Language Film category of 85th Academy Awards. This is an honor for a film to be selected out of more than 70 films submitted for Best Foreign Language Film Oscar. Additionally, it is also nominated for Best Foreign Language Film category of 70th Golden Globe Awards. Don't read critics' reviews and take a pass on this one, this movie has much to offer once you are ready to accept it.\rLong story short, The Intouchables is one of my top favorite films of 2012.",
            "review_date": "2012-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "great movie,this is a must see!!!so positive and great sense of humor,also the storyline is great,i recommend it to everybody,hope they make the episode 2",
            "review_date": "2012-09-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A very beautiful movie. One of of the best movie it's based on a true story. The actors are good and some times it is funny. I like this movie a lot. This is just an awesome movie.",
            "review_date": "2013-01-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Brilliantly acted, and thoroughly enjoyable film.  It's quite a simple idea, bastardised from a true situation. You can also enjoy the outraged US reviewers, one of whom says that the film will need a big re-write before being unleashed as aBrilliantly acted, and thoroughly enjoyable film.  It's quite a simple idea, bastardised from a true situation. You can also enjoy the outraged US reviewers, one of whom says that the film will need a big re-write before being unleashed as a US release, because Americans are so much more sophisticated and class-conscious than those simplistic, crass Europeans.  Priceless.",
            "review_date": "2013-01-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The inouchables is the best french movie i've ver seen. It dark humor shines through the cracks made by the drama. The intouchables goes where other comedies do not dare to come and bring the \"really wrong\" humor at perfect moments. TheThe inouchables is the best french movie i've ver seen. It dark humor shines through the cracks made by the drama. The intouchables goes where other comedies do not dare to come and bring the \"really wrong\" humor at perfect moments. The comedy parts would probably get a 10 in my opinion however the drama parts are sometimes a bit sloppy. Furthermore I didn't like the ending, however it stil was acceptable. My compliments go to the two main actors and the writer of those dark jokes, really loved those !",
            "review_date": "2013-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I enjoyed this movie very much, I don't understand the negative reviews given by the critics. Yes perhaps the movie was a bit predictable and unrealistic but overall the story was  touching, funny and made me smile the whole time. It was aI enjoyed this movie very much, I don't understand the negative reviews given by the critics. Yes perhaps the movie was a bit predictable and unrealistic but overall the story was  touching, funny and made me smile the whole time. It was a nice change from the regular Hollywood slapstick.",
            "review_date": "2013-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A simple story you soon forget. I was surprised over the buzz around this movie, and could not really understand why it got so much credibility. This is a shallow film. Feel good? Not really. Anti intellectual movie, a really simple storyA simple story you soon forget. I was surprised over the buzz around this movie, and could not really understand why it got so much credibility. This is a shallow film. Feel good? Not really. Anti intellectual movie, a really simple story about two men in Paris. Things like art, classical music & opera are boring! Drugs, tobacco and soul are good! Come on!",
            "review_date": "2018-09-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "White guilt: the movie. There is something very exploitative about this film, from the music to the casting choices to the plot itself. Obviously Europe loved it, since they have a white guilt complex.",
            "review_date": "2018-11-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Two mens' lives are changed forever once they realize how much they discover about each other's qualities and lifestyles. With 'The Intouchables', a movie based on a true story which focuses on a wealthy man named Philippe (Francois Cluzet)Two mens' lives are changed forever once they realize how much they discover about each other's qualities and lifestyles. With 'The Intouchables', a movie based on a true story which focuses on a wealthy man named Philippe (Francois Cluzet) who has been paralyzed from the neck down, and his journey with his friendship with a street man named Driss (Omar Sy). They start out with their different lives where Philippe is looking for carers, but none of them seem to fit Philippe's standards in what he looks for in a carer. Driss decides to apply for being Philippe's carer believing that this could be his fresh start in life. Many of Philippe's friends are concerned given Driss's tough past, but Philippe prefers the not-so-sentimental attitude he brings to his life. \"No pity\" he claims he prefers. We see their relationship grow as they become more fond of each other as time goes on. They also start to get to know each other better, and it seems that their friendship will never be broken. I admired the good nature and cheerful tone that this film brings. It will warm even the most cynical movie-goer, and the performances by the two lead actors are fantastic. It goes without saying that 'The Intouchables' is one of the best movies about friendship.",
            "review_date": "2017-02-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you have seen enough movies or series you will quickly figure out the only way \"The Intouchables\" can unfold. Surprisingly, it's still very enjoyable to watch it.",
            "review_date": "2016-01-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As a former carer to a quadriplegic worst off than Philippe physically, I can identify with this movie...these situations do occur and ultimately 2 people from different worlds can and do come together like this and often form a bond that canAs a former carer to a quadriplegic worst off than Philippe physically, I can identify with this movie...these situations do occur and ultimately 2 people from different worlds can and do come together like this and often form a bond that can last forever, so I don't really see it as being far fetched at all. As for the way the movie communicated the story, I think it does a great job, sure it may gloss over the realities of such a relationship but I don't see how else this story could have been told...both became better men, and when that happens, the world becomes a better place...",
            "review_date": "2016-06-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Well, it's no \"Un Coeur en Hiver,\" but this French film is fun and heart-warming. I think most of us can relate to the satisfaction of two people who somehow find in each other exactly what they needed at that point in their lives. Have toWell, it's no \"Un Coeur en Hiver,\" but this French film is fun and heart-warming. I think most of us can relate to the satisfaction of two people who somehow find in each other exactly what they needed at that point in their lives. Have to say I felt discomfort at times at the minstrel-like role of the African character (perhaps less than some of the pious reviewers). But art and music are enjoyable motifs as the two men learn to appreciate each other  and despite leaving no cliche unturned, the film leaves you happy.",
            "review_date": "2013-07-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie. It made me laugh it made me cry and overall I had a great time watching it. In fact I watched it several times and I suggest you do the same. It is based on a true story which makes the story much more interesting. The chemistryGreat movie. It made me laugh it made me cry and overall I had a great time watching it. In fact I watched it several times and I suggest you do the same. It is based on a true story which makes the story much more interesting. The chemistry of the main duo is great the actors are amazing and the choice of music is epic...\rPlease do watch it!",
            "review_date": "2014-05-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A very good movie, feels like the movies filmed back in 90s, nice actors, based on the true story. There is no drama, there is no story twists, but there are some good jokes. And the best thing that the movie is touching.",
            "review_date": "2013-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Adorable true story about love and friendship! Such a great example of two completely different people being together! This movie deserves to be watched at least once",
            "review_date": "2018-02-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Intouchables is an outstanding French movie, one of a few witch makes me cry, the movie is beautiful, shows that sometimes the most simple person is the greatest one, a real axiom for life, just beautiful, one movie that everyones need toThe Intouchables is an outstanding French movie, one of a few witch makes me cry, the movie is beautiful, shows that sometimes the most simple person is the greatest one, a real axiom for life, just beautiful, one movie that everyones need to see and think long and hard about it.",
            "review_date": "2014-03-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Honest, true and heart-touching, The Intouchables tells the story of an incredible friendship between two persons with very different origins: one is rich yet while the other is poor; one is an invalid while the other is ordinary. Above all,Honest, true and heart-touching, The Intouchables tells the story of an incredible friendship between two persons with very different origins: one is rich yet while the other is poor; one is an invalid while the other is ordinary. Above all, however, what makes this movie worth watching is the way they manage turn from the initial employer-employee relationship to a close friendship, which makes is so strong that everyone may cry after watching the movie. With strong, solid, convincing performances from the two leading actors,  The Intouchables deserves a ten without question.",
            "review_date": "2014-01-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A real yin-yang relationship. I instantly bought the chemistry and haven't felt this drawn in to a developing relationship in a while. A charming, funny and refreshing take on quite a daring concept.",
            "review_date": "2014-03-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Underrated on Metacritic. Variety is absolutely wrong.\r Interesting and well acted,  \"The Intouchables\" is a remarkably french film that handles its subject carefully.",
            "review_date": "2014-08-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A masterpiece! What else? This movie inspired from a true story will emotionally touch you and leave you thoughtful! The actors are perfectly playing their roles, the music very well selected and the story brings you to another level! SomeA masterpiece! What else? This movie inspired from a true story will emotionally touch you and leave you thoughtful! The actors are perfectly playing their roles, the music very well selected and the story brings you to another level! Some scenes will make you laugh and others will make you want to cry! Definitely one of the best dramatic-comedy movie I have seen in a while! Bravo à la France!",
            "review_date": "2014-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hello everyone! I don't want to read anyone's review, just if you live in multicultural country like I do, you can not not like this movie. Smart, funny, professional play, nothing false or pretend, pure piece of art. Movie about people andHello everyone! I don't want to read anyone's review, just if you live in multicultural country like I do, you can not not like this movie. Smart, funny, professional play, nothing false or pretend, pure piece of art. Movie about people and for people. Watched it for three times and will do it again/ My 11 y.o. son watched it with me and than by himself and made a grown up comments! Please, watch it, talk about it, and watch it again! :)",
            "review_date": "2014-09-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film teaches us to love life, to enjoy the little things, hope for the best, to appreciate what we have.\r In the film the life confronts  two seemingly very different people: a nobleman Philip, (who was confined to a wheelchair  as aThis film teaches us to love life, to enjoy the little things, hope for the best, to appreciate what we have.\r In the film the life confronts  two seemingly very different people: a nobleman Philip, (who was confined to a wheelchair  as a result of the accident)  and just escaped from prison Drissa , who was searching for a job.\rBetween the representatives of different worlds magnetism appears, the cause of which is the ability to perceive each other as equals, and, of course, one thing in common - the need to help and take care of each other.\rThis is what lays to the start of their extraordinary friendship. Driss brings to Philip`s life the spirit of adventure and spontaneity. Due to the fact that Driss perceives it as a full-fledged person, gives a hard moral impetus, inspires a very different view of the order of things, Philip finds the will to live.\rPhilip trusts his new employee, sees it as a positive character traits. All this transforms life of  Driss and opens its full potential.\rThis history, in spite of the tragedy, perceives easily and doesn`t leave a negative. On the contrary - thanks to the perfect combination of drama and comedy is this film leaves a feeling of kindness touched to the core. The actors are great, they want to believe. Camerawork shows  a lot of  beautiful landscape scenes; and music leads to a complete delight.\rI strongly advise people of different age categories to see this movie. This is one of the best I've ever seen :-)",
            "review_date": "2014-09-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is one of the best movies, now I tell you why: there is a perfect music, real-life story, perfect actors, and it is just perfect. I love this movie because it change my life. And one think for the \"critics\" who don't like this movie, IIt is one of the best movies, now I tell you why: there is a perfect music, real-life story, perfect actors, and it is just perfect. I love this movie because it change my life. And one think for the \"critics\" who don't like this movie, I don't now what you don't like on this movie.",
            "review_date": "2014-10-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best movies i have ever seen. Its on my top 5 best movies ever just below Forrest Gump.\rThis movie is as heart warming and serious as it is funny. Really a movie that brought tears to my eyes not only because of all the funnyOne of the best movies i have ever seen. Its on my top 5 best movies ever just below Forrest Gump.\rThis movie is as heart warming and serious as it is funny. Really a movie that brought tears to my eyes not only because of all the funny scenes but also the sad ones. A truly inspiring movie i would recommend to everyone.",
            "review_date": "2015-02-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "more physical than spiritual..The Intouchables\n\nThe Intouchables is a character driven feature about a poised handicapped middle aged man that gets a fresher perspective in his life after he hires a living-the-life-to-the-full young man tomore physical than spiritual..The IntouchablesThe Intouchables is a character driven feature about a poised handicapped middle aged man that gets a fresher perspective in his life after he hires a living-the-life-to-the-full young man to take care of him. The structure of the premise is simple and familiar to the audience with an appealing details of the characteristics of the characters and the analysis of the relationship among them, which fortunately in here is in plethora of it. The chemistry between the lead cast is the heart of the feature that keeps the audience tangled in its sensitive bubble despite of having ups and downs. It also is flawed and cheesy at times that shucks away the somewhat credibility it gains with tiny genuinely moving notions. It is short on technical aspects like background score, cinematography, sound department and editing although the camera work is appreciative as it manually handled that offers the viewers the aspiring personal experience. As mentioned earlier, Cluzet and Sy has invested all their chips in, and it pays more than well enough to keep the audience rooting for their friendship. As much as compelling the storytelling is, in its primary track, the rest of the plot and characters are left undercooked and chalky that aches you till the last frame of the feature. Ticking for almost two hours, it easily stretches its way down the road to offer a moot and expected point with a familiar zeal that actually ignited the whole concept. The husbandry gags that are imputed in order to make the relationship more rich that enhances it to a more sensible ground and the gripping screenplay that enfolds guilty pleasures for the viewers are the high points of the feature. The Intouchables may not be accurately titled if considered its existence, that is more physical than spiritual, contrary to what makers claims it to be.",
            "review_date": "2018-09-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When I watched this movie in the theater I did it almost by chance, for the film that I really wanted to see has already left that theater. She did not know anything about him or read any of them. It was a shot in the dark. And I'm glad I didWhen I watched this movie in the theater I did it almost by chance, for the film that I really wanted to see has already left that theater. She did not know anything about him or read any of them. It was a shot in the dark. And I'm glad I did it. I loved the movie when I saw it and now, reviewing it at home, I continued to feel happy about the time I gave to this work. It is a film based on real facts that occurred from the relationship between a rich French aristocrat and his trusted servant, an Algerian who lived in the suburbs. Here, however, the African origin of the servant is reinforced by the intentional choice of a black actor, Omar Sy, while the other role was given to veteran François Cluzet. Both actors were capable of exceptional chemistry and look fantastic when they split the screen. Sy's jokes, in his character, are laughing to tears. The cinematography and the scenery are very good and the soundtrack, Ludovico Einaudi's responsibility, is simply a masterpiece of \"contemporary\" classical music. It is certainly the best French film I have seen in many years, and one of the best films that European cinema has given us during this decade, until now.",
            "review_date": "2018-08-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Intouchables' story could be familiar to anybody, even to those who haven't seen a lot of movies. Almost every phase, and every point in this movie is so conventional and unoriginal. However, this movie is very remarkable! That's becauseThe Intouchables' story could be familiar to anybody, even to those who haven't seen a lot of movies. Almost every phase, and every point in this movie is so conventional and unoriginal. However, this movie is very remarkable! That's because it surpasses all the feel-good movies of its kind.Needless to mention the high-class direction from Olivier Nakache and Eric Toledano that made this movie exceptional. Thanks to this superb direction, The Intouchables delivers broad laughs and tugs at the heartstrings without delving too deep, or present anything new. Sometimes the movie becomes so hilarious, and other times you couldn't help shedding some tears, often, of joy! The best thing about this movie that it kept its lighter tone throughout its runtime. The tonal shift when the movie moves from its second to its third act wasn't smooth, though. That being said, you will never find any movie of this kind that has half its magical moments.The friendship between Philippe and Driss is simply unparalleled. That's, of course, due to the insanely magnetic chemistry between Omar Sy and François Cluzet. I bet you can find such chemistry in any other movie of the same kind.The soundtrack is perfectly utilized to match the movie's bright tone. And the cinematography is beautiful, but what I think made the movie looks spectacular is its fancy production design.The third act is definitely a bit rushed but I feel like the ending more than makes up for it. This ending could be the sweetest and most charming ending ever. You couldn't decide if you should cry or laugh, but don't worry because you would do both.(8/10)",
            "review_date": "2018-08-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film is amazing. A beautiful story of friendship and all negative reviews have been by snowflakes hell bent on negative political correctness. Everyone is up a height because one half of the two leads has been cast as a poor, black drugThis film is amazing. A beautiful story of friendship and all negative reviews have been by snowflakes hell bent on negative political correctness. Everyone is up a height because one half of the two leads has been cast as a poor, black drug user and God forbid this fits with some stereo type that drug users be young black men.If you aren't some little poncey PC do gooder that whines at every little slightly inappropriate thing then you'll likely be in the upper score card on this film.It's funny, with for a change some great acting and a lovely little piano song in with the OST. It's a very moving film too.Ignore the low reviews that are there on some sort of political stance.The person the lead role was portraying, was apparently a career criminal in real life but not black, black. Just slightly dark skin, so if this offends you having a full black man, smoking a bit of weed playing the lead, then take a hike.",
            "review_date": "2021-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I rarely see a perfect movie. This is that. It has beautiful and touching story. Absolutely great actors. And fantastic music. When I saw this first time, I thought that this was going to be some action movie by the name \"the intouchables\" II rarely see a perfect movie. This is that. It has beautiful and touching story. Absolutely great actors. And fantastic music. When I saw this first time, I thought that this was going to be some action movie by the name \"the intouchables\" I have never been so wrong and I'm glad.",
            "review_date": "2019-03-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "There is something more to The Intouchables. While the movie doesn't have a huge buildup towards the ends, and it contains movie clichés, The Intouchables makes it work. I would even argue that the somewhat uneventful plot makes this movie soThere is something more to The Intouchables. While the movie doesn't have a huge buildup towards the ends, and it contains movie clichés, The Intouchables makes it work. I would even argue that the somewhat uneventful plot makes this movie so enjoyable. The movie is not about the events in Philippe's or Driss' lives, it's about how they grow as persons. For me, this movie is mostly about inner growth and how we can be brothers and sisters to each other despite our twisted minds.The Intouchables has become one of my favourite movies because of its uniqueness. But I understand why this is not the movie for everybody. Where the movie really shines is the character development, the beautiful shots and scenery and of course the humor.",
            "review_date": "2019-09-03",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 95
}