{
  "title": "The Hobbit: An Unexpected Journey",
  "rating": 8.0,
  "release_date": "2012-12-14",
  "genre": [
    "Adventure",
    "Fantasy"
  ],
  "summary": "The adventure follows the journey of title character Bilbo Baggins, who is swept into an epic quest to reclaim the lost Dwarf Kingdom of Erebor from the fearsome dragon Smaug. Approached out of the blue by the wizard Gandalf the Grey, Bilbo finds himself joining a company of thirteen dwarves led by the legendary warrior, Thorin Oakenshield.The adventure follows the journey of title character Bilbo Baggins, who is swept into an epic quest to reclaim the lost Dwarf Kingdom of Erebor from the fearsome dragon Smaug. Approached out of the blue by the wizard Gandalf the Grey, Bilbo finds himself joining a company of thirteen dwarves led by the legendary warrior, Thorin Oakenshield. Their journey will take them into the Wild; through treacherous lands swarming with Goblins and Orcs, deadly Wargs and Sorcerers. Although their goal lies to the East and the wastelands of the Lonely Mountain, first they must escape the goblin tunnels, where Bilbo meets the creature that will change his life forever…Gollum. Here, alone with Gollum, on the shores of an underground lake, the unassuming Bilbo Baggins not only discovers depths of ingenuity and courage that surprise even him, he also gains possession of Gollum’s “precious” ring that holds unexpected and useful qualities… A simple, gold ring that is tied to the fate of all Middle-earth in ways Bilbo cannot begin to know. [Warner Bros.]… Expand",
  "critic_reviews": [
    "Charming, spectacular, technically audacious… in short, everything you expect from a Peter Jackson movie. A feeling of familiarity does take hold in places, but this is an epically entertaining first course.",
    "I'm holding the filmmaker responsible for getting us all back again - to feelings of excitement and delight. Vital as they are, Gollum and Bilbo can only do so much to keep us enchanted. Is Jackson able to sustain the magic in two more installments? I peer into Tolkien's Misty Mountains and embrace the journey.",
    "As epic, grandiose, and emotionally appealing as the previous pictures, The Hobbit doesn't stray far from the mold, but it's a thrilling ride that's one of the most enjoyable, exciting and engaging tentpoles of the year.",
    "A mesmerizing study in excess, Peter Jackson and company's long-awaited prequel to the Lord of the Rings saga is bursting with surplus characters, wall-to-wall special effects, unapologetically drawn-out story tangents and double the frame rate (48 over 24) of the average movie.",
    "The Hobbit plays younger and lighter than Fellowship and its follow-ups, but does right by the faithful and has a strength in Martin Freeman's Bilbo that may yet see this trilogy measure up to the last one. There is treasure here.",
    "The Hobbit: An Unexpected Journey isn't \"unexpected\" at all, though between its lighter tone and a decade's worth of improvements in digital film techniques, there should be enough of a novelty factor to delight most fans.",
    "Jackson imposes a sense of grandeur but mostly loses Tolkien's sense of fun.",
    "At nearly three hours long, \"An Unexpected Journey\" has moments when the caravan seems both overstuffed and out of balance, but it's such a scenic trip that only a stubborn homebody could complain.",
    "There will be opportunities to see the picture in regular 24 frames per second, but I recommend going the whole hog and sampling what Jackson has come up with - a new way to watch movies and a new take on a universe that seemed to have exhausted its narrative possibilities.",
    "Piles on enough eye candy and action sequences to please fans, plus more humor than the three \"Rings\" films - even if it only occasionally achieves the trio's grandeur.",
    "It isn't as delirious a journey as we experienced a decade ago, but it's still filled with wonder, monsters, and thrills.",
    "The film, still only clearing its throat, hints at a wellspring of emotional riches to come.",
    "If you're willing to just go with it, An Unexpected Journey is a competent ride, but as a whole it lacks purpose, giving the impression of a television program in its later seasons still chugging along while full aware that it has peaked. Needless to say, \"Hobbit\" fans will find plenty to soak in; others may get the feeling of being bludgeoned by deja vu.",
    "An overlong adventure enlivened by wonders.",
    "By comparison with the other Rings movies - the extremely high bar Jackson has already set for himself - Unexpected Journey falls short and feels muddled, yet too eager to please its fan base with an obligatory swordfight every few scenes.",
    "In this fitfully engaging, but often patience-straining preamble to Hobbit adventures to come, there is one transporting 10 minutes of screen time. It happens when Bilbo meets the freakish, ring-obsessed creature Gollum.",
    "What saves the day is the spidery, schizoid Gollum, again performed by the great Andy Serkis through the craft of motion capture.",
    "Extracting three generously proportioned films from Tolkien's books made sense. But turning the relatively slim 1937 volume 'The Hobbit' into a trilogy, peddling seven or eight hours of cine-mythology, suggests a better deal for the producers than for audiences.",
    "While the production design is impeccable and the journey intermittently involving, The Hobbit is overlong and lacks the enchantment of the Lord of the Rings films.",
    "The downside is that \"The Hobbit\" no longer looks like a movie at all. It looks like a video.",
    "An Unexpected Journey also proves that it is, indeed, possible to get too much of a good thing.",
    "It's one thing to sit on your couch watching football in HD. It's another to view one of literature's most enduring fantasies in the same manner. The experience that felt so breathtakingly cinematic in Jackson's \"Lord of the Rings\" series now seems frustratingly fake.",
    "After 170 minutes I felt that I had had enough of a pretty good thing. The trilogy will test the stamina of the non-believers, and many might feel, in their secret heart of hearts, that the traditional filmic look of Lord of the Rings was better.",
    "\"All good stories deserve embellishment,\" Gandalf says to Bilbo before they set off, and one has to ask whether the weight of embellishment, on this occasion, makes the journey drag, and why it leaves us more astounded than moved. And yet, on balance, honor has been done to Tolkien, not least in the famous riddle game between Bilbo and Gollum.",
    "A purist's delight, something the millions of die-hard fans of his Lord of the Rings trilogy will gorge upon. In pure movie terms, however, it's also a bit of a slog, with an inordinate amount of exposition and lack of strong forward movement...There are elements in this new film that are as spectacular as much of the Rings trilogy was, but there is much that is flat-footed and tedious as well, especially in the early going.",
    "Jackson and his team seem compelled to flesh out the world of their earlier trilogy in scenes that would be better left to extended-edition DVDs (or omitted entirely), all but failing to set up a compelling reason for fans to return for the second installment.",
    "My first thought in watching The Hobbit was: Do we really need this movie? It was my last thought, too.",
    "Tolkien's inventive, episodic tale of a modest homebody on a dangerous journey has been turned into an overscale and plodding spectacle.",
    "This is not about a reluctant hero drawing courage from some deep personal well. It's not about dread and danger. It's about visual effects.",
    "I'm afraid that whoever it was in the New York Film Critics Circle who voted for The Hobbit as best animated film had a point. And so did the people who suspected that this whole thing was a bad idea.",
    "To sum it up, there is little that is unexpected in The Hobbit: An Unexpected Journey. Rather than an epic continuation of Jackson's Middle-earth obsession, the film seems more like the work of a man driving around a multilevel parking garage without being able to find the exit.",
    "The result is a film that is solid and acceptable instead of soaring and exceptional, one unnecessarily hampered in its quest to reach the magical heights of the trilogy.",
    "You shouldn't be able to read a book faster than you can see it play out on-screen.",
    "The grandeur of the Lord of the Rings trilogy [has] been replaced by something that resembles tatty summer-stock theater.",
    "At any speed, the movie only springs to full life late in the day, during the first meeting of Bilbo and the tragic creature who will come to be known as Gollum (once again played by the sublime Andy Serkis).",
    "The movie lacks majesty. Grand in parts, the movie is too often grandiose or grandiloquent; and the running time is indefensible.",
    "More time in Middle Earth is exactly what The Hobbit: An Unexpected Journey provides - so much more that the movie starts to feel like some Buddhist exercise in deliberately inflicted tedium.",
    "The Hobbit is just good enough to make you aware of how it could have been much, much better. If you take your kids-while shielding them from various nonhuman bad guys getting decapitated both repeatedly and, worse, bloodlessly-they'll have a good time. Bilbo Baggins' quest for adventure and Warner Bros' quest for cash will take him through three films. But your quest for epic, truly entertaining filmmaking will be more successful if you just stay home.",
    "It's a bloated, shockingly tedious trudge that manages to look both overproduced and unforgivably cheesy.",
    "If you loved the earlier films, these are moments you will hold on to, but they're very few, and they're not enough."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I quite liked this movie, but it could have been better. The original Lord of the Rings movies did not use CGI unless it was necessary. The orcs were men in costume and makeup, which made Jackson's depiction of middle earth seem more realI quite liked this movie, but it could have been better. The original Lord of the Rings movies did not use CGI unless it was necessary. The orcs were men in costume and makeup, which made Jackson's depiction of middle earth seem more real somehow. In this new film, Jackson uses CGI as a crutch (nearly every creature is computer generated), and it hurts the continuity and flow of the story. This movie is pretty sweet in its own way, but if the creators had stuck with their original pattern (more make up and costumes, and less CGI) I would have thought it flawless. It's certainly enjoyable, and I'm looking forward to the next two installments, but I don't feel like this can be categorized as a classic.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Going into the theater for the midnight showing I was eager to see the film but afraid. I had been burned by Star Wars Episode 1 some 13 years ago and was worried I would once again feel the harsh sting of disappointment by high expectations.Going into the theater for the midnight showing I was eager to see the film but afraid. I had been burned by Star Wars Episode 1 some 13 years ago and was worried I would once again feel the harsh sting of disappointment by high expectations. I was pleasantly surprised.\r First off, I must say that it's a miracle that this film was even made, never mind by Peter Jackson and the crew responsible for the Lord of the Rings Trilogy. After being in \"Production Hell\" for what felt like years, word got out it was finally being made. I was excited but weary of the director who I have had the misfortune of not seeing any of his films which I hear are great. Then said director bailed on the project completely. All hope seemed lost, but like the great wizard Gandalf, Peter Jackson himself stepped in to save the day and my expectations went through the roof.\r So what happened between that, the trailers, and opening night that got me so worried? Reviews. What did I read? \"The CGI makes all the creatures look fake, the cameos are pointless, the movie is too long, too childish etc. So the point being is that this movie is Episode 1 all over again, Peter Jackson has lost his edge and Middle-Earth as we know it has be scared beyond recognition. After seeing the film I can tell you that while I can see the critics points ultimately they are nitpicking an otherwise great film. Never mind unfairly comparing this lone film to an entire trilogy.\r So lets get down to the meat of this review. The Hobbit: An Unexpected Journey is a great film. It's fun, exciting, emotional, and all the things I expected from the first installment of a new trilogy set in the LOTR universe. Gandalf the Grey is the old wizard you remember from the Fellowship of the Ring and I found him to be as likable as ever, the same goes for other returning characters such as Old Bilbo, Frodo, Elrond, and even Saruman. Somehow age has not slowed these actors down a bit and aside from a few easily overlooked extra wrinkles these are the exact same characters we met in the original LOTR trilogy.\r As for the new characters, the 13 dwarfs are surprisingly fun to watch. I was so afraid we would have 13 Gimlis on screen at all times and the movie would be crippled by this but instead we get a band of likable characters reminiscent of the fellowship from the first LOTR film. A few dwarves stand out while the rest feel second-tier but that's to be expected with such a large cast and doesn't detract from the film as a whole.\r It wouldn't be Middle-Earth without a few notable bad guys to talk about and this movie has a few. From the dragon Smaug who we only get a glimpse of in the film to the lead dwarf Thorins arch nemesis Azog. This character looks the most artificial of all the CGI creatures in the movie but when I think about it I'm not sure they could convey such emotion (raw hatred) in the wretch any other way. Either way he is the main villain for the first part of this story and is as menacing as any enemy the fellowship came face to face with in LOTR. Speaking of menacing CGI villains I have to talk about Gollum. He is the same creature we all know from The Two Towers and Return of the King but this time he is better portrayed as an evil monster that we should fear rather than the menacing, sometimes comical, creature he was in LOTR. I'm trying to keep this review spoiler free so all Ill say is the movie wastes no time in reminding you that Gollum is not there for a comic relief cameo. He was part of The Hobbit to begin with and is treated as such.\r The movie is around 3 hours long and while any unengaged viewer might find that too long to sit still, any fan will tell you that the film isn't long enough. It's pacing is extremely similar to the extended version of The Fellowship of the Ring. Again, not spoiling things, but if you can sit though and enjoy that film you will have no problem with An Unexpected Journey. The adventure proper doesn't start until nearly 45 minutes into the film, leaving plenty of time to introduce you to the characters and the nature of the the main character Bilbo Baggins. Speaking a which...\r Martin Freeman plays him perfectly and not once to you feel like he is either playing a young Ian Holm, playing Bilbo or trying to make the character his own unique entity. Ultimately Freeman's Bilbo is the character we saw in LOTR, read about in the books, and is the ideal image of Bilbo Baggins. If you didn't care for him in LOTR you will develop a new appreciation for him through this new trilogy.\r The Hobbit finally has a proper representation on film and fits almost seamlessly with the LOTR Trilogy. I can easily recommend this film to any fan of the books, movies, or anyone looking for a great action adventure film. I can't wait to see the next two films and plan on seeing The Hobbit: An Unexpected Journey again.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Can't believe the critic score, what the hell is this 58? It is an excellent and brilliant movie, technically and brilliantly directed. The first thing that we need to do is to see this movie without the idea that we are seeing Lord of theCan't believe the critic score, what the hell is this 58? It is an excellent and brilliant movie, technically and brilliantly directed. The first thing that we need to do is to see this movie without the idea that we are seeing Lord of the Rings because it is based in a novel that was made for child. Evidently it is not a movie for child but it has points of humor and a different essence from the las triology. Personally, I found this film one of the best of the year and I don't understand how films that are completely bullshi* has good punctuations and this one no.",
      "review_date": "2012-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "People will always be buthurt about things, that is beyond doubt. Sometimes the buthurt has a good reason to be there like the prequels to starwars or all of mass effect 3 but in the case of the Hobbit the buthurt has credible stance to takePeople will always be buthurt about things, that is beyond doubt. Sometimes the buthurt has a good reason to be there like the prequels to starwars or all of mass effect 3 but in the case of the Hobbit the buthurt has credible stance to take in the bashing of this glorious film.  The Hobbit is made from an earlier book of Tolkien's, a lighthearted approach to Lotr, it is not a carbon copy of the original trilogy nor is it a movie made for children. The film has more concentration over visuals then the previous films yet it does not sacrifice the plot in any way, the actors blend in with the CGI very organically. The film may drag on for a bit but so did the fellowship, two towers and return of the king. The 40 fps looks good and the criticism for it seems a bit unfounded.\r I don't want to sound like I am praising this film too much because it had some minor issues of pacing at the start and the ending made me wish that I would not have to wait a year to get to part 2 of the trilogy.\r Over all its a great film, I think peter Jackson just forgot to bribe the reviewers, To put it into some context the \"critic\" score for this film is only 2 points higher then that of the first twilight which is very very strange to me.",
      "review_date": "2012-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nHonestly I had doubts about this movie, I thought Peter Jackson could lose the \"touch\" after all this years, but The Hobbit: An unexpected journey\" it's an amazing movie! It brings that nostalgic feeling watching the same actors from ten years ago, the 48fps seems quite nice and easy to adapt to it, good soundtracks from Howard Shore, good acting & setting, they included parts (and will keep including parts) from other Tolkien stories for example The White Council, the investigation of Dol Guldur, etc etc..I LOVED this movie.\r But yes, its not perfect, it have flaws...very slow paced movie (at the first half of the movie) some details were irrelevant and could have been omitted until the Extended Edition release, Radagast felt weak portrayed, there were more-than-necessary cheesy quotes that I hope they avoid in the next films..\rI understand if people didnt like this movie but after reading some reviews most of them have biased \"facts\" and a 0 score, really? Anyways...it is a great movie, I expected less but it surpassed my expectations, I recommend it.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "First of all, the professional critics who gave this movie below a 65, you are shortsighted whining idiots. I've seen The Hobbit in IMAX 3D HFR and it was awesome. Okay the HFR is something to get used to, especially when the camera is movingFirst of all, the professional critics who gave this movie below a 65, you are shortsighted whining idiots. I've seen The Hobbit in IMAX 3D HFR and it was awesome. Okay the HFR is something to get used to, especially when the camera is moving it looks like it is played in fast forward. But the images itself look beautiful sharp. The CG looked pitch perfect, so i don't know if i wanna see every movie in HFR but i can see a bright future for all high end CG movies like Avatar in 48fps. A lot of critics are complaining about the slow pace in the beginning, but that is exaggerated, it is entertaining from start to finish. After 25 minutes you are thrown in the adventure and it doesn't let go of you, foregoing from the funny scene's with the drarves in the beginning.The story is great and characters are all very good and very likeable. Martin Freeman as Jong Bilbo is the more then perfect person for the role. The cinematography is top notch, Andrew Lesnie you are legend. The scène riddles in the dark was awesome and Gollum OMG does CG ever gonna get better. Everyone go see this film and Peter Jackson and crew thank you for letting us visit beautiful Middle Earth again.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The long beginning the critics oucked on is obviously there to introduce us to the family of dwarves, something peter jackson couldnt do once the action kicks in and without it we wouldn't care for the characters. After repeated viewingsThe long beginning the critics oucked on is obviously there to introduce us to the family of dwarves, something peter jackson couldnt do once the action kicks in and without it we wouldn't care for the characters. After repeated viewings nearly all the dwarves get their moment except one or two, plus the beginning isn't as long as lord if the rings which was universally praised for doing the same thing and introducing us to the hobbits.\r Anyway this is a great thrill ride, the added bits add greatly to the story, I loved the rivendell scenes, which tied in lovely with the LOTR and azog was a good character.\r There's a couple of instances that stumble, the last bit of dialogue from the goblin king was a touch too much and radaghast whilst you warm to him on repeated viewings was a bit silly when he first meets up with the gang.\r Anyway these minor quibbles don't stop this being a full marks movie and I can't wait for the second one.",
      "review_date": "2013-06-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm certainly not going to tell you to not see this movie. Peter Jackson proves that he's at a higher caliber of production than most filmmakers these days. However, compared to his previous works, especially The Lord of the Rings trilogy,I'm certainly not going to tell you to not see this movie. Peter Jackson proves that he's at a higher caliber of production than most filmmakers these days. However, compared to his previous works, especially The Lord of the Rings trilogy, The Hobbit is lacking. The pacing is jagged, and flip-flops between fast jumping thst rips you out of the plot and drags in many combat scenes. Beyond that, the writers have taken plenty of liberties with the plot that only weigh it down; keeping track of all the extra info can be frustrating. However, the acting is superb, and it's hard not to invest yourself in the characters as they trek through Middle Earth. It's definitely worth seeing, but don't expect to be blown away like the first three.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I've read the books, both The Hobbit and The Lord of the Ring long years before they started to make movies about them, and I just got at the cinema what i was waiting for. The two books were completely different, so not a great suprise thatI've read the books, both The Hobbit and The Lord of the Ring long years before they started to make movies about them, and I just got at the cinema what i was waiting for. The two books were completely different, so not a great suprise that the films have a different feeling as well.  It's not a LOTR 2. The Hobbit is basicly a fairy tale, which was originally written as a fairy tale, for the kids of Tolkien. The movie is following this history, and does it well, in my oppinion. It is entertaining, and a much more lighter aproach on Middle Earth, in a time when peace and prosperity are common things, even if evil is not so far away either. It's a simple, linear story, lovable and rich of fantasy - in a fairy tail way.",
      "review_date": "2012-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"The Hobbit\" was a children's book that has served as a key cornerstone in the fantasy genre and a story held close to many reader's hearts. I felt that Peter Jackson's interpretation of the book has been an extraordinary cinematic experience\"The Hobbit\" was a children's book that has served as a key cornerstone in the fantasy genre and a story held close to many reader's hearts. I felt that Peter Jackson's interpretation of the book has been an extraordinary cinematic experience that reminds me of the magic found in those books of old. The tone of the original novel was translated brilliantly onto the big screen, while some may find this 'journey' to be slightly trivial or child-like to the grand battle scenes of LOTR, I enjoyed the translation regardless. Technically, I enjoyed the new technology a lot (having watched it in 48 frames and 3D) while it does require a slight getting used to, the 48 frames helped create a magnificent 3D viewing that would put other epic films to shame. Another thing that should be pointed out is that the relation to LOTR was immaculately added into the plot, there are plenty nostalgic moments that will fuel the delights of old fans but is computed on a level that will not likely to isolate new ones.  There are a couple stranger moments here and there, but overall I feel confident that such a magical story is in the the tender hands of such gifted film makers. I for one, is eagerly waiting for the next segment to Bilbo's tale. (I don't know if this consists of a 'spoiler')",
      "review_date": "2012-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe Hobbit is based around Bilbo Baggins in his prime, where he goes, well, on an unexpected journey. After watching the enitre LoTR series, i found myself to despise Bilbo for his distasteful obsession with the ring. But after watching The Hobbit, i no longer disliked him, but actually began to like him, even more so than Frodo. The whole 48FPS deal was in my opinion, completely brilliant, although not much technical work has to be put into it to bring up the frame rate, it made the movie look much more realistic, and at times I had trouble depicting whether something was CGI or real. The 48fps makes everything much smoother and makes the cgi have life-like movements. The story for The Hobbit was not as strong as the story in the LoTR series, but i felt that it came pretty close, the movie does not contain nearly as much dialogue as the LoTR series but it definitely fulfills why we all love these movies, the fantasy aspect. Overall, i'd have to say that i enjoyed this movie slightly more than the LoTR series, In most aspects. If you are a LoTR fan, GO SEE THIS MOVIE, if you have never seen any of the LoTR movies, GO WATCH THEM, and then GO SEE THIS MOVIE.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Truly awesome, on par with fellowship! Brilliant acting from all cast members. Bilbo, Gollum, Gandalf and Thorin and absolutely perfect. The ending will have you leaning forward out of your screen as Tolkein's Novel and Jackson's new materialTruly awesome, on par with fellowship! Brilliant acting from all cast members. Bilbo, Gollum, Gandalf and Thorin and absolutely perfect. The ending will have you leaning forward out of your screen as Tolkein's Novel and Jackson's new material come crashing together in an awesome finale!",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Simply put, this was an amazing movie to look at.  Like anything else it had it's flaws, but the 48FPS is visually stunning.  Like Avatar and 3D, this movie sets a new standard for movie making.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "First and foremost, I did not, will not and don't suggest you see this film in 3D in any form. Watch it as it was intended. That being said, this was a HELL of a kickoff for the upcoming movies and was just downright great to watch. TheFirst and foremost, I did not, will not and don't suggest you see this film in 3D in any form. Watch it as it was intended. That being said, this was a HELL of a kickoff for the upcoming movies and was just downright great to watch. The beginning prologue with the Fellowship tie-in was a nice addition, and the acting at all levels was superb. I will admit, there were moments where I had to keep myself awake (I'm not a midnight person at all), but that's to be expected in a film that is the first of multiple. It's a pity the Metascore is so low, somewhat shocking; this was a great film and any LOTR fan will recognize every single location in this movie - Jackson did an incredible job recreating Gollum's Cave, Goblin Town, Dale, Hobbiton, Rivendell, etc., etc.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Is it just my impression or have these critics been drinking a lot lately? Cmon, their low knowledge about the middle earth and Tolkien's works almost freightened everyone i know away from the movie. It's an amazing movie, with plausiveIs it just my impression or have these critics been drinking a lot lately? Cmon, their low knowledge about the middle earth and Tolkien's works almost freightened everyone i know away from the movie. It's an amazing movie, with plausive adaptions from the book, and just as LOTR it looks like it will get even better on the next movie. Dont you waste your time reading 'noobs' reviews, just go watch the movie. Its worth the money. A lot.",
      "review_date": "2012-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a beautiful film. The 3D is the best I have seen, the 48fps help this by reducing blur and making the whole thing appear much more crisp. The little references to the trilogy and the book itself (ie chapter names in the script) showThis is a beautiful film. The 3D is the best I have seen, the 48fps help this by reducing blur and making the whole thing appear much more crisp. The little references to the trilogy and the book itself (ie chapter names in the script) show that this was a labour of love and further proof of the respect Peter Jackson has for the source material. Although I would not say it surpasses the Lord of the Rings trilogy this was an incredible film with some truly inspired scene. Needless to say Riddles in the Dark is a joy to behold.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Just Excellent! Pure Brilliance... Definitely movie of the year! The cast are just spot on [Gotta love Radagast the Brown] and music is as ethereal as ever; simply pure genius.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I loved every minute of this movie. I wouldn't have changed a thing. I read the hobbit 20 years ago and I am very happy with the result of this movie.",
      "review_date": "2012-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "People need to stop thinking about The Lord of the Rings when they go to watch this film. The Hobbit wasn't even written the same way as LotR by Tolkien. It's not a dark, epic drama that portends the end of an age, ultimate evil, and thePeople need to stop thinking about The Lord of the Rings when they go to watch this film. The Hobbit wasn't even written the same way as LotR by Tolkien. It's not a dark, epic drama that portends the end of an age, ultimate evil, and the tragedy of life lost: not just in battle, but of those who's souls are never the same after the grand journey (Frodo).\r It's a fun adventure featuring the races and monsters that birthed contemporary fantasy. If you go in expecting that, you will be MORE than satisfied by this film. It gets better as it goes along. It was accurate to the book, and gave us just enough of a LotR tie-in without overshadowing the main quest of The Hobbit.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing film, what the critics say is sort of right: bloated story, slow beginning, cartoony, silly action and special effects, but it is minor and you will not notice it as the exciting story and beautiful world keeps coming. Some scenesAmazing film, what the critics say is sort of right: bloated story, slow beginning, cartoony, silly action and special effects, but it is minor and you will not notice it as the exciting story and beautiful world keeps coming. Some scenes such as the spectacular Riddles in the dark are straight out of the book, but Jackson has made a few changes and added new material which on a large is also great. perfect acting all round. Everything is pretty much amazing. Just don't listen to the critics and watch it!",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "WOW. This movie is amazing. I went into the movie theatre quite worried due to critic scores, but after seeing it myself, I really would like to know what film they watched, because it wasn't The Hobbit. I'm an avid fan of J.R.R Tolkien andWOW. This movie is amazing. I went into the movie theatre quite worried due to critic scores, but after seeing it myself, I really would like to know what film they watched, because it wasn't The Hobbit. I'm an avid fan of J.R.R Tolkien and have all his books, and thoroughly enjoyed Peter Jacksons LOTR Trilogy. The Hobbit is simply stunning, and will be joining my collection once it comes out on DVD.\r Now onto the movie. A lot of critics have given this low scores due to its higher framerate, or complaining about the slow start. Seriously, they have never been so wrong. Although I saw it in 3D 24fps (just to be safe) I cannot understand why people are rating the movie DOWN due to the 48fps framerate. Easy option - go see it in 24fps first. The movie is NOT slow. We spend 40 minutes or so in the shire (10 minutes of that we actually enjoy an epic prologue set in Erebor) which is no different to the first LOTR. It gives us a chance to develop some of the characters and understand their motivation. There's not one part of this film which I thought 'this is slow'. It is beautifully paced. The acting is superb, especially Martin Freeman as Bilbo. The first time you see him as Bilbo, you can understand why Peter Jackson chose him. There is so many events in this film that blew me away. The stone giants, the goblin tunnels, Rivendell, the scene with Gollum (which deserves an oscar), the Prologue in Erebor, the white council with gandalf, saruman, galadriel and elrond, dol goldur, and the EAGLES. The eagles look better than ever and really blew me away. This is a lighter and more humoured middle earth, but that's what Tolkien wrote. There is peace in middle earth, so of course the world is a happier place. Thankfully though, it's not as overdosed as I thought it would be. There are maybe 1 or 2 lines which made me cringe, but that is the only downfall to this movie. Everything else is perfect.\r All of the actors do a superb job as I said previously. Radagast the brown, a slightly deranged wizard, also worried me before seeing the film. He is brilliant. He helps move the story along and also sees something I did not expect... fans of LOTR will be happy once they understand who and what he saw. The action pieces and CGI are fantastic also. The ending couldn't have been any better, with a brilliant piece of character development between Thorin and Bilbo (both of which develop brilliantly throughout the entire film) coming to a final climax, and also... I wont spoil the last shot, just go see it yourself. I can not recommend this film enough. I am so happy to have visited middle earth again and couldn't be any happier with what I saw. Do yourself a favour, ignore the critics, and go and enjoy middle earth again, because The Hobbit is one hell of a ride.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "the hobbit is a great movie the story of the movie,the affects,and the 3d for me was good a great movie but i will say that movie was very long 3 hours.so i will give the hobbit an unexpected journey 9/10 and i will recommend to you to seethe hobbit is a great movie the story of the movie,the affects,and the 3d for me was good a great movie but i will say that movie was very long 3 hours.so i will give the hobbit an unexpected journey 9/10 and i will recommend to you to see the movie.and i forgot to remind golum(my precious). you know what i regret about the 3 hours i will give it 10/10",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "awsome a great prequel to lord of the ring.very funny,awsome fights,a good story,golum,and amazing 3d.so i think that a great prequel to lord of the rings and i will give it 10/10.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "So, I've just seen the Hobbit. And I can honestly say that I am blown away by how good it was. I can see why the long introduction would be a problem for some people, but if you are a fan, you will appreciate it very much. Its verySo, I've just seen the Hobbit. And I can honestly say that I am blown away by how good it was. I can see why the long introduction would be a problem for some people, but if you are a fan, you will appreciate it very much. Its very descriptive and atmospheric. Once you are past the 40 minute introductory mark, the fun begins, and since then, its pretty much action packed. The humor is excellent, and the actors put an awesome performance. Not to mention how beautiful the landscapes and effects are. The music is another strong side of the movie, and does not fail to bring you closer to Middle Earth.\r My final verdict 10/10.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I hate how the reviewers base their reviews on comparisons between The Lord of the Rings and The Hobbit.\r Next time you write a review, focus on the movie itself and not the elements outside of it.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"The Hobbit: An Unexpected Journey\" is a great movie. The modern 3D - technology let us enter the world of Tolkien in a new dimension. Peter Jackson made a movie, which shows once again that the small ones are able to be great heroes. The\"The Hobbit: An Unexpected Journey\" is a great movie. The modern 3D - technology let us enter the world of Tolkien in a new dimension. Peter Jackson made a movie, which shows once again that the small ones are able to be great heroes. The soundtrack fits perfectly to the movie. I recommend you to watch this masterpiece.\rI also will watch it at least once again.\r P.S.: Please excuse my bad english, i'm from Germany ;)",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I sometimes wonder whether or not the critics watch the same movies we do.\r The Hobbit is the first in a 3 part story based on the novel of the same name.   For those who have read the story we know that The Hobbit is a movie of greatI sometimes wonder whether or not the critics watch the same movies we do.\r The Hobbit is the first in a 3 part story based on the novel of the same name.   For those who have read the story we know that The Hobbit is a movie of great grandeur and true to the story it retells.    The acting, the script, the visuals, the music... all create a whole that is greater than the sum of their parts, delivering to use a great beginning to an unfolding epic story.   Don't miss the movie, you'll ask yourself \"did I really just sit for nearly 3 hours?  It went by so quickly!\"",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The film is one of the best movie of the last 5 years. The 3D effect is the most wonderful 3d effect i've ever seen. The story is just perfect, it feels like reading the book. Bilbo is amazing, Thorin, Gandalf, Balin, Dwalin Bifur, Bofur,The film is one of the best movie of the last 5 years. The 3D effect is the most wonderful 3d effect i've ever seen. The story is just perfect, it feels like reading the book. Bilbo is amazing, Thorin, Gandalf, Balin, Dwalin Bifur, Bofur, Bombur, Dori, Nori, Ori, Oin Gloin, Fili, KIli. ALL perfect.\rAlso Azog and the king of the goblins are just perfect. Andy Serkis (Gollum) did a marvellous work on gollum and the scene of riddles in the dark made me cry.\rGo watching for it, you'll never be sorry for that!",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best movie since Lord of the Rings: Return of the King! And thats for sure it is so brilliant! Peter Jackson is really the only man to do this! I really look forward to the next chapter!",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wow, i almost didn't go to watch this film, what with all the bad reviews!  I'm so glad, i did now! To be honest it was a fantastic film! Welcome back to middle earth, only a year to wait for part 2! :( :(",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It has angered me critics are disgusted at the films drawn out length in terms of being a part of the lord of the rings franchise. But at the end of the day the story telling ability in this film and the beauty you find in the scenes makes itIt has angered me critics are disgusted at the films drawn out length in terms of being a part of the lord of the rings franchise. But at the end of the day the story telling ability in this film and the beauty you find in the scenes makes it a fantastic film which definitely deserves a 10. This is a film review not a business case review!",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Movies are done for FANS not for critics journalists! This is a amzing movie, if you are a Lord Of Rings fan you will fall in love with this one. Peter Jackson is a great director.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Hobbit: A Relatively Expected Journey\r Peter Jackson has submitted his first installment to the highly anticipated Hobbit Trilogy. Though i was not a huge fan of his previous work LOTR included, i was particularly interested in TheThe Hobbit: A Relatively Expected Journey\r Peter Jackson has submitted his first installment to the highly anticipated Hobbit Trilogy. Though i was not a huge fan of his previous work LOTR included, i was particularly interested in The Hobbit due to its resonance with me as a child. The book is sublime but the film lacked a certain depth that we have seen Jackson produce before. The acting is fantastic with Martin Freeman's performance being fulfilling and most certainly understated yet the other characters were simply unable to recreate the same level of interest and intrigue as those in the book. One can only hope that these characters are explored further in the sequels. As for the 48 FPS it was beautiful with scenery exploding vividly onto the screen and yet i cannot help but think it was just too much as if looking into an oil painting, thus some of the dialogue and action was lost amongst the various stunning backdrops. Finally and most annoyingly i must mention the length. For what is only a relatively short children's book, i cannot see how 3 films of such considerable length will be able to keep the focus of the audience whilst remaining true to the book throughout. So far so good but i expect more can come from this series and i hope that The Hobbit: The Desolation of Smaug will not be the unwanted middle child of the trilogy and emulate The Two Towers.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hey guys how can we make as much money as possible?, well we could release three films from the Hobbit. But there's not enough in the book to fill three films, .....don't worry we'll just buff it out with lord of the rings style content. NoHey guys how can we make as much money as possible?, well we could release three films from the Hobbit. But there's not enough in the book to fill three films, .....don't worry we'll just buff it out with lord of the rings style content. No one will complain, as its Peter Jackson and Lord of the rings.\r And judging by the 9 and 10's I guess its worked.\r The film isn't terrible, its just not great either. Whats completely frustrating about it, is that the parts that follow the book are very good, its just all the filler stuff that ruins it. Seemingly filled with cliche comedy moments and bits that just didn't seem middle earth at all, its kind of insulting to the source material.\r If at some point they heavily edit the movie and leave just the relevant book content in, i think you would have a very good movie, but as it stands at the moment, the hobbit is an overly bloated average film that had potential to be much better ( and less drawn out and boring).",
      "review_date": "2012-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Hobbit is extremely disappointing coming from a director who has accomplished so much, and knows the material so well. It is still has great moments, and for the most part is easy going adventure to watch, but come on.",
      "review_date": "2013-11-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nFor those who have seen the film...Why it reeked. I was hugely disappointed in \"The Hobbit: An Unexpected Journey\". Instead of sticking to the children's story, which is very short compared to LOTR, Peter Jackson has added a ton of unnecessary bloat. Many of the scenes were just added to connect it with LOTR, which was not needed, such as all the scenes with Frodo. The movie starts with a huge back story, which would have been better told as the movie progressed. Thorin has a new adversary (he was mentioned in the book, but the party had no interaction with him) ...the strange white orc that slew his father. One of the changes that bothered me the most was that Bilbo is looked down upon throughout the movie, and he has to be a savior in almost every instance to prove he is worthy of the party. In the book the animosity is not nearly as bad. Bilbo does enough in the book without having to, for instance, save Thorin from the white orc. If I remember right the first thing that Bilbo kills with his new short sword in the book is a spider, and Bilbo names the sword Sting. Shouldn't Bilbo have named the sword Fang or Claw in the movie? One of the scenes that doesn't work is when Bilbo escapes from Golum, and Golum just screams instead of running after Bilbo. Why didn't Golum go after Biblo you ask? Well, in the book the goblins are guarding the way out of the mountain, and Golum didn't want to get caught. I was looking forward to see the whole party stuck up in the trees, and the goblins making fun of them with song, but this was not included. Instead of the party being almost burnt up in the trees, the problem is the trees are collapsing. After the long intro, the movie turns into a roller coaster ride. A lot of people compare it to Pirates of the Caribbean, and they are right on. This movie is more Pirate of the Caribbean, than Pirate of the Caribbean could ever be. THREE different instances of having to jump from one place to another to stay alive...The stone giants, the collapsing walkways in the mountain, and the collapsing trees! Speaking of the stone giants, hasn't Peter Jackson learned that some things are better off left for the imagination? In the book the stone giants are mentioned, almost in passing, while in the movie they ride them! It would have been great, if during the storm rocks were falling, you could hear the noise of huge rocks getting smashed...and then through the storm a slight glimpse of something made of rock moves.... Thorin, Thorin, Thorin. He does not hate the elves, he was thankful for their hospitality, and the thing he loves most is gold. In the movie they try to make him a bleeding heart for his homeland, when all he wants is the gold! He IS a dwarf for goodness sake! A new (uneeded) comedy relief was added...Radagast the wizard. Poop. Another new twist is Gandalf hearing about the necromancer. I was almost intrested in this, I think it comes straight from Tokien's notes. However, it does make the movie longer, and is the main reason we have to deal with Radagast the Gastly. The troll incident is changed, for the worst.  In the book Biblo is trying to steal something from the trolls, instead of saving the horses.  Everyone in the party gets captured except Thorin, who puts up a fight.  In the movie, everyone gives up their weapons to save Biblo from getting ripped apart...one person ripped apart, or everyone gets eaten hmmm....This is another time where Biblo basically saves the day, instead of Gandalf.  Bilbo keeps the Trolls arguing in the movie, but in the book Gandalf throws his voice, making the Trolls think that they are disagreeing on how to cook the party.  The visuals of the movie are descent. More CGI was used, and less animatronics than in LOTR and it shows. I could continue to nitpick very easily, but I think I will leave it there. To sum it up, this is not a movie about a Hobbit, as the book was. It is a movie about the whole of the goings on in middle earth during the story of the Hobbit, and it doesn't work. It tries to be too much like LOTR, instead of the childrens book it was intended to be.",
      "review_date": "2012-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If what you crave is a Lord of the Rings sequel featuring a sight gag wizard with bird poop in his hair who rides a rabbit sleigh, orcs (or like creatures) who deliver one-liners after being disemboweled, humorous beheading sequences playedIf what you crave is a Lord of the Rings sequel featuring a sight gag wizard with bird poop in his hair who rides a rabbit sleigh, orcs (or like creatures) who deliver one-liners after being disemboweled, humorous beheading sequences played for cheap laughs, extended dish-cleaning footage, and lots of fight-scene ideas lifted straight out of Pirates of the Caribbean...this is your movie.",
      "review_date": "2012-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dreadful film.  I saw the HFR presentation and I could not believe how terrible the live action elements looked.  The look of the characters were like a bad BBC Shakespeare television program.   The film, dragged on and on, while the CG wasDreadful film.  I saw the HFR presentation and I could not believe how terrible the live action elements looked.  The look of the characters were like a bad BBC Shakespeare television program.   The film, dragged on and on, while the CG was done very well (Weta is great) Golum was terrific, the rest of the picture as a whole was awful.  Think Phantom Menace.  Peter Jackson has lost it.  Sorry, it is sad but true,  Dreadful, waste of 3 hours.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I wanted something closer to Pan's Labyrinth and instead got another Jackson turd. If only del Toro had stayed on to do this properly. The more time that passes since the LOTR the more I grow to dislike them. Randall Graves had it right inI wanted something closer to Pan's Labyrinth and instead got another Jackson turd. If only del Toro had stayed on to do this properly. The more time that passes since the LOTR the more I grow to dislike them. Randall Graves had it right in Clerks II.  http://www.youtube.com/watch?gl=CA&v=aSB03lr69iU",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I went to see the movie with my 8 year old son and he seemed to adore all the action. If you're looking for something like LotR then you'll be in for quite the disappointment. Still, if you forget about the book, then the movie is enjoyableI went to see the movie with my 8 year old son and he seemed to adore all the action. If you're looking for something like LotR then you'll be in for quite the disappointment. Still, if you forget about the book, then the movie is enjoyable in a way, but seeing that this one book is going to be stretched out over 3 movies, you don't need to leave much to the imagination as to why.\rThe kid loved it, and it wasn't too bad, but don't expect too much. Not much LotR like epic moments, but action and slapstick like silliness, except for the encounter with Gollum, which is the only part really worth watching.",
      "review_date": "2012-12-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie all around! I have no  idea why the critic score is so low but this movie is fantastic! This is just as good to me as tlotr. I cant wait to see the other two that Jackson puts out. If you can watch the movie in 3d its some of theGreat movie all around! I have no  idea why the critic score is so low but this movie is fantastic! This is just as good to me as tlotr. I cant wait to see the other two that Jackson puts out. If you can watch the movie in 3d its some of the best 3d that you will see in movies!",
      "review_date": "2013-03-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie, great acting and great directing the hobbit once again shows why Peter Jackson is one of the best directors around. I have to admit that I was a little sceptical about splitting the hobbit into three movies, but all I can sayGreat movie, great acting and great directing the hobbit once again shows why Peter Jackson is one of the best directors around. I have to admit that I was a little sceptical about splitting the hobbit into three movies, but all I can say that if the next two follow in the footsteps of the first it will be well worth the long three year wait.",
      "review_date": "2013-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nMonotonous, dry, bland, unimaginative story telling, as much fun as a trip to the dentist, please deliver us from Peter Jackson.  The visuals have been overplayed in the Lord of the Rings and the screen play lands flat and robotic.  None of the characters resonate and Richard Armitage looks and acts more like a poor copy of Viggo Mortensen's Aragon than a dwarf royal or not.  Huge waste of time and money, this telling lends nothing to Tolkien and appears lifeless even next to the cheesy 1977 animated Hobbit.  Jackson only has 2 tools in his tool box, endless sweeps across the landscape of New Zealand and excessive CGI.  Both are used to great effect to kill pacing, distract from the story and swallow the characters, not that another whiny hobbit or a band of forgettable dwarves that cannot sing would be missed.  The ending is also disappointing, not that I expected any kind of resolution in a film from Jackson, but I really wanted to see Smaug kill off the cast, turn on Jackson and leave us to all live happily ever after in a world free of crappy directors and pretentious film making.",
      "review_date": "2013-03-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love LOTR and the movies, and I understand that different mediums cannot translate to one another perfectly, but many of my issues arise from the technical and storytelling elements. The CG in the film ranges from beautiful to just silly,I love LOTR and the movies, and I understand that different mediums cannot translate to one another perfectly, but many of my issues arise from the technical and storytelling elements. The CG in the film ranges from beautiful to just silly, every single ork and goblin are CG, while most of the time this is not too big of a deal, in combat it is clear that the actors are not swinging at or connecting with a real being. The entire portion with the trolls is difficult to watch, with odd CG, poor \"combat\", the dialogue can be forgiven (i.e. gross jokes), and a set that clearly looks like a set. Peter Jackson added portions of other Tolkien books and expanded certain sections not covered in The Hobbit, but almost all of them are in odd places, and do not really fit with the story (this could just be bad editing), this is especially so concerning everything revolving around Radagast the Brown. Pacing is very slow, which does not  always equal bad, but it takes roughly 45mins for anything to happen in the film. Shooting in 3D was a big mistake, mostly because the lighting has to be so bright that many of the scenes looked odd, especially in Golem's cave, many scenes that should have been dark were oddly bright. I saw both the regular and 3D,48 fps. I did not enjoy the 3D, 48fps version of the film, it made the movie look like one of those 3D films at a theme park, i.e. somewhat cheesy. While there are many continuity issues many viewers will only catch a few. It seems that many of the qualities that Peter Jackson brought to LOTR (which made them great) disappeared in the hobbit. Many other issues include the pointless cameos from old Bilbo and Frodo (who has a 5 o'clock shadow), the long beginning narrative, cliched lines/characters, and odd makeup and props. I hope the next two films are better, but The Hobbit could have been better if Peter Jackson had gone simpler, in the scope and special effects of the movie.",
      "review_date": "2013-03-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Even the extended version leaves me wanting more. This movie could have been so much better. It relied far too heavy on CGI and special effects and not enough on establishing the story and the characters.",
      "review_date": "2015-01-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is a grotesque frankenstien monster of an adaptation. The sections of this movie which follow the book are entertaining and (barely) decently done, however the remaining half is a butchered and chunky concoction, incorporatingThis film is a grotesque frankenstien monster of an adaptation. The sections of this movie which follow the book are entertaining and (barely) decently done, however the remaining half is a butchered and chunky concoction, incorporating elements of Tolkien's other works, 'Adam Sandler' style slapstick stupidity (such as a dismembered Goblin-King fat enough to appear on 'The Biggest Loser' falling on top of our gang of dwarfs, much to the delight of my 7yr old brother I should add) and an extra large portion of Peter Jackson's inflated ego. The resulting plot is a grotesque and thinly veiled carbon copy of Jackson's excellent 'The Fellowship of the Ring' to which The Hobbit's plot has been brutally affixed, even going so far as to tediously extrapolate a non-existent prologue to mimic the fellowship's opening scene. The worst part is that there are still two more films to come, and I wouldn't be surprised, given the quality of this one, if the last part were to rival the last film in the Twilight series for its extreme tediousness and fetal-position mind-numbingness.",
      "review_date": "2013-03-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fails to capture the epicness of the Trilogy. Also, way too much CGI. What happened? Why is everything CGI in this movie? Im not too excited about the other two now. I just love the Trilogy so much.",
      "review_date": "2013-07-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Let me begin by saying that I had high hopes for this film.\r With that out of the way, let's get to the meat of the thing:\r\n\r\n\"The Hobbit: An Unexpected Journey\" certainly starts off on the right track; a hobbit, knowing nothing of theLet me begin by saying that I had high hopes for this film.\r With that out of the way, let's get to the meat of the thing:\r \"The Hobbit: An Unexpected Journey\" certainly starts off on the right track; a hobbit, knowing nothing of the world at large, is chosen by a wandering wizard as the prime candidate for a great adventure.\r While this beginning is quite faithful to the book, that is where the similarities end.\r I can truthfully say that just moments after the introduction, my facial expression changed from one of joy to one of disappointment and scorn.\r While it is true that Bilbo Baggins was a somewhat 'reluctant' burglar, the dwarves and wizard did not simply cast him off as if he were not needed. They knew the importance of having a burglar to steal inside the Lonely Mountain, and Gandalf had very high hopes for Bilbo. In the Jackson adaption, we are shown that, while the company would prefer to have Bilbo be a part of their quest, they could do fine without him.\r After Bilbo chases the dwarves down and convinces them that he wants to accompany them, Jackson strays further off the beaten path; he actually ruins two chapters at once.\r Instead of sending Bilbo to scout the troll camp and possibly hone his burgling skills, he is sent to retrieve the company's ponies, which the trolls have captured. Now, this is a very important deviation from the book, as it changes the motivation of the goblins' capture of the dwarves and hobbit.\r After the episode with the trolls and a quick stay at Rivendell, the dwarves begin their way through the Misty Mountains. After nearly being killed in a fight between Stone Giants, they make camp in a small cave. Instead of attempting to steal the dwarves' ponies, the goblins steal the dwarves.\r This is where the worst deviation from the book occurs; instead of capturing the dwarves as they struggled to free their ponies, the goblins capture the dwarves because an ancient Orc named Azog has put out a bounty on them.\r Now, according to both \"The Hobbit\" and the appendices of the \"Lord of the Rings\", Azog was killed by Dain Ironfoot years before the events of \"The Hobbit\" took place. Now, this may not seem like a serious problem, as Azog was a minor character, but in bringing him back as the main antagonist Jackson has derailed the entire film series. Instead of the quest being \"reclaim the treasure of Lonely Mountain\", the quest is now \"defeat an ancient Orc and reclaim the Lonely Mountain itself\". Jackson, in an attempt to stretch the story, has destroyed the original premise of the dwarves' journey. In making Azog a main antagonist, he takes the focus away from Smaug the Great, a much more deadly adversary, and changes the dwarves from artisans to warriors.\r The feel of the book is gone. Instead of crafting sequences around the events of the book, Jackson creates a jigsaw puzzle, half book/half script.\r While many may argue that this is a plot device to build Bilbo's character, that can be disputed.\r In the original book, Bilbo Baggins gradually changed into a stronger person. In the films, he is portrayed as always being of a strong will, and just never having the chance to show it. By going this route, much of Bilbo's ongoing growth is lost, and his character suffers for it.\r Jackson obviously did not trust this film to register with audiences familiar with the source material, and, with that in mind, changed the story to suit those only familiar with his previous films. By inserting Galadriel, Frodo, Radagast, and the 'cute' Sméagol, he gains the support of Trilogy fans, but at what cost?\r Answer: Faithfulness to the original book.\r While the scene with Galadriel could be seen as an adaptation of events from the LOTR appendices, the 'cute' Sméagol cannot. Gollum/Sméagol is meant to be seen as a frightening, wretched creature; the book again and again explains that Bilbo feared for his life during the riddle competition. Why then did Jackson include the 'tame' Sméagol from the LOTR Trilogy? Because he knew it would register with fans of those films.\r In conclusion, I see this adaptation of \"The Hobbit\" as a way for Peter Jackson and New Line to profit from the LOTR Trilogy all over again. By grafting certain parts of the Trilogy onto \"The Hobbit\", New Line and Jackson are ensured that at least some of those fans will fork out money to watch three more films. I see this film not as an artistic exercise but as a cash cow. That is all.",
      "review_date": "2013-12-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Hobbit :An unexpected journey is a made for children. It has no plot, the actors are not good and the added comedy makes what might have been a okay movie even worse. I sat through the DVD hoping I would end up liking it. But wasThe Hobbit :An unexpected journey is a made for children. It has no plot, the actors are not good and the added comedy makes what might have been a okay movie even worse. I sat through the DVD hoping I would end up liking it. But was disappointed . I hated it.",
      "review_date": "2014-04-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first Hobbit movie in the franchise is not only exciting, it takes you on a thrill ride with not only some new creatures, but some old memorable character such as Gollum. At times, the story is distracted some cheesy humor, mostly causedThe first Hobbit movie in the franchise is not only exciting, it takes you on a thrill ride with not only some new creatures, but some old memorable character such as Gollum. At times, the story is distracted some cheesy humor, mostly caused by the dwarfs. But other than that it's a great start to the Hobbit trilogy.",
      "review_date": "2013-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is not bad. At least, no where near as bad as critics and some of my friends are making it out to be. If you have read the book, you will notice a lot of changes, some probably unnecessary (I'll never understand why they madeThis film is not bad. At least, no where near as bad as critics and some of my friends are making it out to be. If you have read the book, you will notice a lot of changes, some probably unnecessary (I'll never understand why they made Radagast the way they did, let alone include him at all) but you have to consider it in the way that it was intended and originally written; as both a prequel to The Lord Of The Rings and more importantly, a stand-alone story. If you go into the cinema expecting a continuation of the Lord Of The Rings movies, you would be best to change your attitude, because The Hobbit is a completely different animal.",
      "review_date": "2012-12-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was just horrible! I loved the Lord of the Rings movies, but this left me with a feeling of a quick cash grab and the more childish tone of the movie did not appeal to me..",
      "review_date": "2013-05-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beautifully done movie that was filled with goodies from the book, and goodies from dear ol' Peter Jackson. Many people complain that it is not as dark as LOTR and that is true, because the book isn't either. The humor was a nice change ofBeautifully done movie that was filled with goodies from the book, and goodies from dear ol' Peter Jackson. Many people complain that it is not as dark as LOTR and that is true, because the book isn't either. The humor was a nice change of pace for Middle Earth and I couldn't stop laughing during some parts. I loved the scene with the trolls by the camp fire as it was my favorite scene in the whole movie. I also loved the intelligent goblin king who was designed quite well, but his voice and personality felt more like a Harry Potter character than an LOTR one. The music, once again, sweeps you away like it did before almost 10yrs ago; I do believe is was the same composer so expect excellence. Others complain about the use of CGI... well how else do you get hundreds of trolls, orcs, dwarves into the same scene or get a man into a giant troll costume? LOTR had hundreds of animations and it was great! and so was this movie.",
      "review_date": "2012-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Its a masterpiece. No sinister \"LotR-mood\", but that wasnt to expect. It takes as much time, as it needs and all the time is awesome. I just cant believe, that the Metascore is below 60....",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Hobbit is a great movie.The story it told,the battles, even the way it showed thing that explain more of the lord of the rings. For a prequel(and the first book) it was pretty good. some parts did start to slow things down but with aThe Hobbit is a great movie.The story it told,the battles, even the way it showed thing that explain more of the lord of the rings. For a prequel(and the first book) it was pretty good. some parts did start to slow things down but with a story this big things have to be mentioned in the first movie.If you have seen the lord of the rings or read any of the books,see this movie.If you haven't then you can still go see this movie.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe Hobbit: An Unexpected Journey was is a great film. Not a perfect film mind you, but a damn great one. I have a feeling my admiration of the fim comes from the fact that I love everything Tolkien, and the fact that I went into the theater last night with low expectations, because I knew it would be hard for Peter Jackson to match the perfection of the Lord of the Rings trilogy. In any case, I was impressed by the level of detail in the film (and I didn't even see it in 48fps!) and the beauty of every shot. I was equally impressed by the writer's ability to incorporate material from the appendices into the story and fashion the film to not only stay fairly faithful to Tolkien, but to also make the film exciting, breathtaking, funny, and magical. I thoroughly enjoyed the flashbacks to Dale and the destruction of Erebor, the fight between the orcs and the dwarves, and the inclusion of Radagast the Brown and the White Council (though as I said before, I am a Tolkien aficionado so more detail and more Middle Earth in general is better for me). While I did like the addition of Azog and the vendetta between him and Thorin, I didn't like the fact that the orc was completely CGI; it detracted from the personal feeling of the relationship between himself and Thorin. I think it would have been entirely possible to have an actual person play the role, which would have given the chase and vengeance a more intimate feel (ex: Witch King and Lurtz). Ultimately though, the film was amazing. The acting was top notch, especially from Martin Freeman, Andy Serkis, and Ian McKellen. I have yet to see the film in its intended format, 48 fps, so I don't anything to gripe about in that department yet. I strongly encourage everyone to see this great piece of cinema, and yes, its seems long at parts and slightly bloated, but if you're a fan of Lord of the Rings and Tolkien like myself, then it shouldn't be a deterrent.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Peter Jackson has brought Middle-Earth back. Absolutely brilliant, I cannot wait to see it again. I was a little worried about some of the reviews out there, but after seeing it came to the conclusion that they are 100% bull. Don't trust aPeter Jackson has brought Middle-Earth back. Absolutely brilliant, I cannot wait to see it again. I was a little worried about some of the reviews out there, but after seeing it came to the conclusion that they are 100% bull. Don't trust a single one until you have seen this yourself. Absolutely fantastic.",
      "review_date": "2012-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is an awesome FAN movie made by a true fan; If you didn't like the Lord of the Rings previous movies... Then this movie is NOT for you. 10/10 The image, the music, the characters everything  is great!!",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After I finished watching The Hobbit, I was positively surprised and I really loved the movie. 58 out of 100? Even 68 is too low. The movie stayed at the level of Lord of the Rings and deserves the title of a Tolkien based movie. It's aAfter I finished watching The Hobbit, I was positively surprised and I really loved the movie. 58 out of 100? Even 68 is too low. The movie stayed at the level of Lord of the Rings and deserves the title of a Tolkien based movie. It's a little more cartoonish and less dark than the LotR trilogy, but that doesn't change the epic atmosphere and the overall epicness of Middle-Earth. I'm waiting for the second and third movie and want to see more Jackson's epicness.",
      "review_date": "2012-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Way better movie than the Fellowship of the Rings. The only complaint I have is it is a prequel so you have a rough idea what happens. Moved reasonably quickly when you consider the 2 1/2 hour length. Ignore the major critics ratings. TheWay better movie than the Fellowship of the Rings. The only complaint I have is it is a prequel so you have a rough idea what happens. Moved reasonably quickly when you consider the 2 1/2 hour length. Ignore the major critics ratings. The major critics like gay cowboys, southern racists (apparently the only racists who ever lived), and environmentalist heroes and could not care less about a good story or interesting characters.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is easily one of my favourite films of all time. Great story telling, great balance between humour and adventure, and great acting throughout, especially from Andy Serkis. I have no idea how critics have given it such a low score, otherThis is easily one of my favourite films of all time. Great story telling, great balance between humour and adventure, and great acting throughout, especially from Andy Serkis. I have no idea how critics have given it such a low score, other than to appear against the grain and not enjoy a phenomenal piece of cinema, but Empire gave it an 8/10 which should speak volumes compared with other less credited critics. I am tempted to see this film in the cinemas multiple times which I have never done for any other movie. Absolutely Incredible.",
      "review_date": "2012-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A decent film but one which feels far too drawn out, with far too many elements added on top of the book's content. The film feels like a cluttered mess towards the middle, with non-stop action scenes growing tiring and distracting from theA decent film but one which feels far too drawn out, with far too many elements added on top of the book's content. The film feels like a cluttered mess towards the middle, with non-stop action scenes growing tiring and distracting from the film's true purpose. The 3D is good, and HFR is an interesting experience if you get the opportunity to experience the film in that format. The acting and effects are also both fantastic, with a late entry from a beloved character being the best of both worlds. Overall, a film with great potential squandered with meandering added storyline and a tiring run-time.",
      "review_date": "2013-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Hobbit was a fantastic movie that hit all the right notes, while perhaps hitting a couple of bum ones. First things first, the majority of critics did not know what they were on about: the only reason it got as bad reviews as it did wasThe Hobbit was a fantastic movie that hit all the right notes, while perhaps hitting a couple of bum ones. First things first, the majority of critics did not know what they were on about: the only reason it got as bad reviews as it did was because of the reason that it's a prequel (although the book actually came a long while before) that is split into three parts. I must admit, I was very dubious of this film, I was when I heard it was going to be two parts all those moons ago, even more so when I heard it would be three; the film exceeded my expectations by quite a margin. Let's get this out of the way straight away, the acting is great from all involved, with Martin Freeman making quite the splash as Bilbo. At times I felt the film strayed a little too much from the source material, but not enough to not love every second of the (around) three hours of run time, but this was necessary (and interesting enough) to spread the relatively small book over three long films. If you are expecting a very dark tone like the Lord of the Rings trilogy, be warned, this is a lot more light-hearted, Peter Jackson has done a great job at making the Hobbit feel unique at the same time as definitely a part of the Lord of the Rings series. The film is very special effects heavy, perhaps too special effects heavy for some (it was at times), but not to the point of being overly distracting or unnecessary. The film felt nostalgic, new, and magical all at the same time, helped overwhelmingly by the soundtrack, cinematography and acting. It was fantastic to see Middle-Earh again on the big screen, putting a smile on my face for pretty much the whole film. The negatives though, characters returning from the Lord of the Rings trilogy did feel a little forced and unnecessary, as all of their respective scenes lasted too long, old Bilbo and Frodo were there for too long! But, no way near long enough to ruin the film on any level, overall, I'm very pleased the film turned out as well as it did and am very much looking forward to parts two and three. Wonderful: 94/100.",
      "review_date": "2013-01-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Purists to the original Hobbit will hate this. Fans of the Lord of the Rings will love this. The Hobbit story is there but is little more than 15% of the movie. Peter Jackson (et al.) have successfully expanded the original book by weaving itPurists to the original Hobbit will hate this. Fans of the Lord of the Rings will love this. The Hobbit story is there but is little more than 15% of the movie. Peter Jackson (et al.) have successfully expanded the original book by weaving it through a far larger, more epic story that warrants being a trilogy. Good new characters + good action + laced with humor = a thoroughly enjoyable film!",
      "review_date": "2012-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Saw this in 2D/24FPS. I enjoyed myself. The movie doles out the quirky charm like nothing else. I would say the cuts against it would be it's somewhat bloated, which causes some repetition (very frequent fights/chases). I believe two movies,Saw this in 2D/24FPS. I enjoyed myself. The movie doles out the quirky charm like nothing else. I would say the cuts against it would be it's somewhat bloated, which causes some repetition (very frequent fights/chases). I believe two movies, rather than three, was the way to go and would have trimmed down some of the fat but what we got is still pretty good.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you're going to put this a 0 just because this was not return of the king in epicness you will get a no this review was not helpful from me. I really enjoyed this movie I think it was my favorite movie of this year. I have seen all the bigIf you're going to put this a 0 just because this was not return of the king in epicness you will get a no this review was not helpful from me. I really enjoyed this movie I think it was my favorite movie of this year. I have seen all the big hit movies and this type of movie just spoke to me. Yes this is not LotR but this is a separate story that collides with LotR. There really was nothing I can say that was wrong with this movie.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film has a different feel than the Lord of the Rings trilogy but you have to remember it IS a different trilogy and the source material has a different feel too. The story was fleshed out nicely with several tie-ins to the Lord of theThis film has a different feel than the Lord of the Rings trilogy but you have to remember it IS a different trilogy and the source material has a different feel too. The story was fleshed out nicely with several tie-ins to the Lord of the Rings that made it truly feel like part of the same world from another time. The story is much lighter with a lot more humor and a bit less intensity/impending doom. Remember, the heroes are only trying to recover something, not save the world as in LOTR. The action sequences are mind bogglingly epic. Though I found myself enjoying the dialog more than the action. Yes the sets are computer generated instead of models but this gave the creators more freedom. I would rate the CG as the best I have seen and the way they blended it with the live actors was very atmospheric and mostly felt natural. Non-fans will have a hard time sitting through the entire movie. It IS long, but if you aren't a fan what are you doing at the movie? Really. Wait for the DVD and fast forward if it's too slow for you. Even when it comes to movies I don't enjoy I hate it when people complain about a movie being too long. I never understood that mindset. Books are never too long, neither are video games; no one is making you finish a movie you are bored of. I say create as much content as possible and let people watch if they enjoy it.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Once again the critics get it wrong. When was the last time a critic called a good movie right. I read this book many times growing up and the movie was everything I could have wanted and more. Faithful to the book and translated well ontoOnce again the critics get it wrong. When was the last time a critic called a good movie right. I read this book many times growing up and the movie was everything I could have wanted and more. Faithful to the book and translated well onto the screen. You won't be disappointed.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was hesitant because of some of the negative reviews, but they were easily set aside within the first half hour. This is a fantastic film. I sincerely think the \"professional' reviewers are seeing a different film than I saw, because theI was hesitant because of some of the negative reviews, but they were easily set aside within the first half hour. This is a fantastic film. I sincerely think the \"professional' reviewers are seeing a different film than I saw, because the one I saw kept me glued in my seat from beginning to end. It was surpassed Fellowship in a lot of ways: better pacing, tighter story, more action, a bit more whimsical, and the characters! I'm a huge LOTR fan, but the dwarves, Bilbo, and Gandalf all really shine here. They have much more personality than was presented in Fellowship (and I do love Fellowship).\r Overall, don't listen to the negative reviews a lot of sites are posting. This is one of the best fantasy movies I've ever seen.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Better than the book, again. While many purist fans do not agree, I must say Peter Jackson did a wonderful job. To those who say it's different from the book, well, I must say that it's the closest a movie can get to it. The main differenceBetter than the book, again. While many purist fans do not agree, I must say Peter Jackson did a wonderful job. To those who say it's different from the book, well, I must say that it's the closest a movie can get to it. The main difference is that Peter Jackson tied The Hobbit well with The Lord of the Rings. It is already a challenge to transport the book to the movie but it's even harder if you want to tie something that was written for children with something darker. Why do I give it a 10? Because this time Peter Jackson explored things not even present in the book, it's a plus you get. Do yourself a favor and enjoy this movie. If you liked The Lord of The Rings trilogy, you will definitely love The Hobbit.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing movie. I don't see why it's getting bad reviews , the story is great the characters are great the locations are great.  If your a fan of lord of the rings you will love it as I did!!",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you are a fan of \"The Lord of the Rings\" or just a fan of good movies in general, then this is a must see. Critics need to stop comparing it to the original trilogy and take  it for what it is, a fun adventure with lots of humor that setsIf you are a fan of \"The Lord of the Rings\" or just a fan of good movies in general, then this is a must see. Critics need to stop comparing it to the original trilogy and take  it for what it is, a fun adventure with lots of humor that sets the stage for the ring and the shadow growing in Mordor.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The film was truly spectacular in many cases, it brought many of the scenes that I had imagined in the book to life, and even refined my perspective on them. Initially the 48 fps was very strange, especially when Bilbo was pottering aroundThe film was truly spectacular in many cases, it brought many of the scenes that I had imagined in the book to life, and even refined my perspective on them. Initially the 48 fps was very strange, especially when Bilbo was pottering around his hole, but you got accustomed to it by the end of the film, and it worked really well, especially in the battle of Moria scene between Orks and Dwarves. I was disappointed that the Orks were done entirely in CGI, because it'd be great to see them make a return from the LOTR trilogy, and I felt Radagast the Brown's subplot was detracting to the immersion with the main journey. But these were petty complaints to a film I enjoyed greatly, the atmosphere was spot on, and the acting was excellent, Bilbo was done excellently by Martin Freeman. The Riddles in the Dark was easily the best part of the film and done pretty much perfectly (Extra credit to Andy Serkis for getting back into Gollum without trying to imitate how he played Gollum in LOTR). Peter Jackson has done a great job in capturing the soul of the Hobbit. The only worrying element is how exactly they are going to do the next two films, considering that the second one will almost definitely centre around the trip through the Mirkwood, which is basically, in JRR Tolkien fashion, pages of walking.",
      "review_date": "2012-12-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I couldn't agree less with the critics on this one. I'm usually on their side, with the exception of Looper (disliked it). I enjoyed absolutely every second of this film. You can almost fall in love with it.",
      "review_date": "2012-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As a long time Lord of the Rings fan, this movie was absolutely perfect. They spent so much time explaining the bits and pieces of where things came from. The acting was extraordinary, and I am so glad this time around, villains and heros areAs a long time Lord of the Rings fan, this movie was absolutely perfect. They spent so much time explaining the bits and pieces of where things came from. The acting was extraordinary, and I am so glad this time around, villains and heros are not dead within a matter of minutes, instead they explain the background behind everyone. The Witch King and the Mouth of Sauron for instance in the other movies were completely rushed, and died with feeling of little importance. Don't expect that in this movie. To compare this movie to any others of the series, it is much alike the Fellowship. The armies are not as big, and it is not fight after fight the entire time. It is about the story, and the politics of Middle Earth. I was honestly scared to see this movie because I thought they would mess up the series, and goodness was I pleasantly surprised! Please do not make the next movie biased on the fact that critics are naysaying this one. It was so well done.",
      "review_date": "2012-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "extremely confused by the critics response to this, i would completely disregard most reviews as this is an excellent film. More lighthearted than LOTR, but then if jackson had given it exactly the same approach people would have criticisedextremely confused by the critics response to this, i would completely disregard most reviews as this is an excellent film. More lighthearted than LOTR, but then if jackson had given it exactly the same approach people would have criticised him for it. The length seems appropriate, as i didn't notice any sections dragging on and was interested throughout. overall it's an excellent film. IGNORE REVIEWS",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Lord of the Rings is one of the best sagas in all time of movies bout the Hobbit its not Lord of the Rings you have to understand this and its different but its very good too.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After reading mixed critics I begun to worry.\r You shouldn't. Critics do not like it because they keep comparing it with LOTR, and it is not. This is an adventure written on a kids book. The story is lighter, and the only thing that LOTRAfter reading mixed critics I begun to worry.\r You shouldn't. Critics do not like it because they keep comparing it with LOTR, and it is not. This is an adventure written on a kids book. The story is lighter, and the only thing that LOTR and this have in common is the place and the ring.\r I watched it on 48fps and I really liked it. It made 3d more appealing and everything beautiful. The only problem of 48fps was that it was so real, that sometimes you could notice cgi.\r But the technology is not the film, just the media and I am reviewing the film (although I liked 48fps)\r The story is faithful to the book and brought me back to a place I thought I would never visit again. Just being back in middle earth is amazing.\r Martin as Bilbo, Richard as Thorin and Ian as Gandalf reprise their roles with excellence. And thanks to the division into three films we get to know more about the other dwarfs and care about them.\r The riddles in the dark scene is outstanding. And Howard Shore's composition is brilliant as ever.\r I could not have wanted more from this film. A fun, and amazing comeback to a great adventure to come.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Hobbit what I heard about it is it was suppose to be long and boring. The Hobbit was not a let but gives us a hell of a ride and is worth your money for 3 hours of your life. I haven't seen such a good movie in a long time. All I can sayThe Hobbit what I heard about it is it was suppose to be long and boring. The Hobbit was not a let but gives us a hell of a ride and is worth your money for 3 hours of your life. I haven't seen such a good movie in a long time. All I can say now is well done Peter Jackson and looking forward to the next chapter. The Hobbit 9.1/10",
      "review_date": "2012-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I waited long and hard for this movie, and boy did they deliver! I had chills as I watched this grand adventure unfold, and this is only the beginning! They couldn't have picked a better Bilbo, very charming. The only minor things thatI waited long and hard for this movie, and boy did they deliver! I had chills as I watched this grand adventure unfold, and this is only the beginning! They couldn't have picked a better Bilbo, very charming. The only minor things that bothered me were trying to remember the names of the dwarfs, and the fact that when ever their was a different language being spoken, they used subtitles. Other than those very minor things, great movie, and i simply can't wait for the next two, and it can only get better.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Hobbit: An Unexpected Journey manages to maintain the feeling that you are watching a film set in Middle Earth while being different enough to stand on it's own.  The main difference is that the story is much lighter than The Lord of theThe Hobbit: An Unexpected Journey manages to maintain the feeling that you are watching a film set in Middle Earth while being different enough to stand on it's own.  The main difference is that the story is much lighter than The Lord of the Rings, much like the book.  This allows for a more humourous tone throughout the film and a little more free rein for the writers to adapt it to a full feature length movie(s).\r Yes, it is a long movie which could be shorter.  Does it need to be shorter? For me the answer is no.  I've always loved the world that Tolkien created and I was a little worried before watching it as to whether it would be too long or, more importantly, lose the magic of the first three films.  If anything, it has reinvigorated my love for it.  Have you ever watched something you loved and wish you could see it again as if you've never seen it before?  Well if you felt that way about The Lord of the Rings then this is the closest you'll come to that experience.  It is a wonderful film.  Fans will love it and if those who are a little skeptical just approach it with an open mind, they'll love it too.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I've seen it twice, both in 3D and 48 FPS.\rSo, let's get this out of the way, there is nothing wrong with it, this is but the beginning of a new era of HD in cinema, critics are being way too harsh on this, and this is the first movieI've seen it twice, both in 3D and 48 FPS.\rSo, let's get this out of the way, there is nothing wrong with it, this is but the beginning of a new era of HD in cinema, critics are being way too harsh on this, and this is the first movie actually worth watching in 3D in a long time.\rSecond: yes, it takes a while to get used to 48fPS but if you are a gamer/PC gamer, you should be used to 30+ FPS (60FPS if you're a PC gamers) so you won't have any problems, like myself\r3-the pacing is sloppy? yes, but then again, a few scenes make the movie way too long, but they are't bad. I mean, the beginning is perfect, as it describes Bilbo's ways and how he's gonna change\r4-a few cliche moments but nohing major enough to make it a 6/10, after all, Gandalf always does this things in the books\r5-Overall the movie is crazy good, and as far as I understand, the movie could've been a bit shorter, but aside from the length and the pacing, I have no problems with this film.\r I say: watch it and ignore the critics, this is one of the moments in which the critics all say one thing while the crowd will say something different, judge it on your own.",
      "review_date": "2012-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Any fan of the book will be pleased by the perfection Peter Jackson has recreated again. Don't be fooled by the critics, this is not LOTR4 It's The Hobbit. 10/10 going to go see it again.",
      "review_date": "2012-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Hobbit is an amazing movie that serves as a prequel to the Lord of the Rings. I can write pages dedicated towards a summary, strengths, and personal thoughts but they all add up to one sentence: \"The Hobbit is the best film to come out inThe Hobbit is an amazing movie that serves as a prequel to the Lord of the Rings. I can write pages dedicated towards a summary, strengths, and personal thoughts but they all add up to one sentence: \"The Hobbit is the best film to come out in 2012 for any fan of fantasy or Tolkien's novels.\" The film looks beautiful, characters are fun and memorable, and the special effects look amazing. The Hobbit has everything that made the Lord of the Rings great. If you enjoyed entering Middle Earth over a decade ago, then I highly suggest watching the Hobbit.\r 10/10 Great movie.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is easily as good as any of the films in The Lord of the Rings trilogy. It is a little different in tone, though the difference feels entirely appropriate.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Freaking awesome movie.  Saw it in 3D and thought it was beautifully filmed.  The story was very tight and you are left wanting more and more.  I found the scenes with Bilbo and Gollum chilling.  I got goosebumps for the last hour.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Writing this at 4 in the morning after sitting in line for 7 hours isn't easy but I can assure you it was worth the wait. Ignore the critics if you're a fan of the books or at least the movies you'll love every second.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI am a Tolkien fan since I was 9 when I read The Hobbit. After I read The Lord of the Rings couple of years later I was forever hooked to the great storytelling of Tolkien. Then came The Silmarillion and all the other books related to the lore. I couldn't get enough. I'm a Tolkien lore nut, not elvish speaking but a nut none the less. I heard complaints about the first hour of the movie, too long, unnecessary and whatnot, but for me it was grand, seeing how Thorin gets his last name, Bilbo's pantry getting ravaged and the dwarfs singing. Also the appearance of Radagast the Brown (I heard someone wrote that he's like Jar Jar Binks, I mean really?) and mention of the Blue wizards works well. Not to mention the Golum creature and the riddle game displayed in full. Peter Jackson draws from other sources not just The Hobbit but from all of the Tolkien lore and, as in the first trilogy he takes liberties to get us closer to the story and he is on the spot. If you are a fan of Tolkien you will see this movie, Jackson doesn't destroy anything of the Tolkien's vision, if I'm allowed to say (and may the Valar forgive me) he improves it in parts.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best movie of this year. Martin born to Bilbo like Ian McKellen born to Gandalf. 48fps are awesome and CGI effect are masterpiece. This movie is great!",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I am giving this film a perfect score.  Because I have read LOTR and the Hobbit, I knew I should have different expectations (not lower expectations).  The move impressed me most with its creativity in presenting something I had only imaginedI am giving this film a perfect score.  Because I have read LOTR and the Hobbit, I knew I should have different expectations (not lower expectations).  The move impressed me most with its creativity in presenting something I had only imagined from reading the book.  Peter Jackson is great with making long films for 2 reasons. Firstly, I am never wondering why something is being filmed because there is always subject matter being presented (I can never imagine the actors in a scene asking for his lines). Secondly, the attention to detail not just visual but also with overall feeling in mind, because the Hobbit seemed more childish to me as a book I expected the movie to be less serious and more lighthearted, without losing the middle earth action style. I saw this film in IMAX 3D, and I was amazed by how I was able to focus so well even though general 3D makes me feel ill and upset. I have seen other critics saying the most harsh things about this film but I can't help but wonder what they are actually saying about the film that is \"bad\". I give the movie two thumbs up and the negative critics two thumbs down.",
      "review_date": "2012-12-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I enjoyed it, not as much as any of the LOTR but it's hard to recreated the majesty of the first trilogy. I was hoping we would see more of the spiders and maybe even a peek at Beorn, but it will make it worth the wait for the second movie.",
      "review_date": "2013-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Though not quite as good as the Lord of the Rings films, the first installment of the planned Hobbit trilogy was engaging, fun, and beautiful.  Some may argue that it takes to long to start but the beginning is filled with fun moments thatThough not quite as good as the Lord of the Rings films, the first installment of the planned Hobbit trilogy was engaging, fun, and beautiful.  Some may argue that it takes to long to start but the beginning is filled with fun moments that introduce the characters as well as the quest that will occupy these three films.  It does a fantastic job conveying that the Hobbit is more of a bit less serious than the Lord of the Rings and kids will be sure to get a few laughs.  Peter Jackson is once again able to show the beauty of Middle Earth with stunning shots of the land and is able to convey the grand scope of the quest effectively.  The performances were absolutely fantastic.  Sir Ian McKellen delivers once again as the wizard Gandalf and Martin Freeman was incredibly charming as Bilbo Baggins.  Though there are a lot of dwarves to keep track of and some of them are more forgettable than others, all performances are solid and Jackson allows pretty much all of them at least some dialogue.  I am sure they will get more notice in the next two films.  The only downside is that at times there is a feel of overuse of CGI.  Part of what made the LotR films great was the mix of real with CGI.  Most of the orcs are completely CGI and therefore the combat seems to be lacking.  But seeing as this is a happier movie series that isn't combat driven like the LotR films it is forgivable. For those wondering how such a relatively short book will span three films, Jackson adapts many of Tolkien's other writings to the film as to provide background and context.  To people who read The Hobbit that may recall something in the film not happening in the book, don't worry it is nothing that Tolkien didn't already write. Overall The Hobbit: An Unexpected Journey is a fantastic film that is tons of fun and does a great job introducing characters and kicking of the beloved epic tale that will take two more installments.  Any fan of Tolkien will love it... unless your just a dick.",
      "review_date": "2012-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Don't let the mixed reviews and preconceived notions of critics and purists deter you from one of the top films of the year: \"The Hobbit: An Unexpected Journey\" is an incredibly fun fantasy adventure that is filled with humor and charm. TheDon't let the mixed reviews and preconceived notions of critics and purists deter you from one of the top films of the year: \"The Hobbit: An Unexpected Journey\" is an incredibly fun fantasy adventure that is filled with humor and charm. The first of the three prequels to Tolkien's Lord of the Rings trilogy, this film focuses on the beginning of Bilbo Baggins (Martin Freeman) in his adventure with the dwarven company of Thorin Oakenshield (Richard Armitage). There are several returning cast members from Jackson's prior Lord of the Rings films, but Sir Ian McKellan is front and center as Gandalf the Gray, and Andy Serkis easily makes Gollum one of the film's most enjoyable characters despite the limited screentime. Some of the dwarves outshine the others, but with a total of thirteen dwarves it's understandably difficult to let them shine as individuals. Remember, in \"The Fellowship of the Ring,\" many of the characters were established by the film's midway point, which let the trilogy's other characters develop naturally. I've seen the film twice now, and not once did I find myself wishing that any particular dwarf had more spoken dialogue. The story unfolding on the screen kept my focus on what was occuring, not what could've been.\r The high frame rate (HFR) worked well for me, but it's definately not for everyone. My HDTV is capable of replicating HFR due to its ability to refresh its screenrates at 120 MHz per second, which equals to about 60 HFR. This film was shot at a rate of 48 frames per second (standard cinema is 24 frames per second), which means that each frame has more information encoded. Being a pioneer in this bold venture does mean that there will be issues, as evidenced by a sensation that the film is moving too fast near the beginning prologue. However, I grew used to it pretty quickly, and never really noticed any other issues throughout the film. I don't see how anyone in their right mind can equate the HFR look to a soap opera, as there wasn't a single moment that \"soap opera\" or anything similar flashed across my mind as I watched the film. Again, it boils down to personal taste, but it's highly recommended if you plan to see the film multiple times to at least try the HFR once. I can only view the HFR in 3D, as there are no HFR 2D showings around me (I live in Columbus, Ohio), so I can't tell you how much of a difference there is between those versions. I did see it in standard 2D and didn't really notice the film looking much better in that version. The 3D is just OK, nothing mind-blowing like \"Avatar,\" but I can say it's the best live action 3D movie I've personally seen since \"Avatar,\" although that's not a tough achievement since the film was shot with 3D cameras. The HFR does add a nice element to the 3D, but it's more about depth perception that stuff popping out at you. Finally, let's get to the plot and storyline itself: if you're a fan of the book, or if you're a fan of \"The Lord of the Rings\" books and/or films, or if you just happen to like good ol' fantasy adventure films like \"Willow,\" than you' shouldn't have any worries about not enjoying this film. It's a great adventure flick that really encompasses a \"journey\" quite well. Freeman is absolutely perfect in his role, and the addition of all the new characters really makes this feel less like a nostalgic follow-up to the \"Lord of the Rings\" than what it really is: a brand new fantasy adventure that proves that faith in Peter Jackson and his team is well-placed. Go see \"The Hobbit: An Unexpected Journey.\" See it twice even. The early comparisons to \"Star Wars Episode 1: The Phantom Menace\" are utterly ridiculous with no real basis. People are also complaining about the addition of a 3rd movie, and how it affects the film's pacing. Unlike the \"Lord of the Ring\" films, there is no dire sense of urgency in the overall plotline, so there's no need to rush what is meant to be more of a lighthearted adventure (despite the admittedly gory fight scenes). There isn't many \"prequel\" films to beloved franchises that are good, but this film is beyond the exception. Ignore the hate, this film lives up to the hype in terms of acting, story, and fun. If there's one negative thing to consider, it's the fact that December 2013 feels that much further away.",
      "review_date": "2012-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing movie! It perfectly sets the pace for the next two movies and ties it with The Lord of the Rings Trilogy. Great sets, beautiful soundtrack and spot on script. Peter Jackson brings us back to Middle Earth! Technically is even betterAmazing movie! It perfectly sets the pace for the next two movies and ties it with The Lord of the Rings Trilogy. Great sets, beautiful soundtrack and spot on script. Peter Jackson brings us back to Middle Earth! Technically is even better than the LOTR.",
      "review_date": "2012-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Hobbit is amazing. A perfect adventure. Through excellent characters such as Bilbo, Gollum (very good), Gandalf, among others, the film reveals extremely fun. Do not believe the notes of specialized critics, the film is monumental.",
      "review_date": "2012-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I watched this movie without looking at any reviews before hand, but afterwards I was shocked at how low they were. The movie wasn't perfect but I would say it is just as good as the fellowship, if not better. If you liked the Lord of theI watched this movie without looking at any reviews before hand, but afterwards I was shocked at how low they were. The movie wasn't perfect but I would say it is just as good as the fellowship, if not better. If you liked the Lord of the Rings, then this is a must see. You won't be disappointed unless you are expecting an exact replica of the Lord of the Rings Trilogy.",
      "review_date": "2012-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I have read a fair amount of other's reviews on this movie before writing my own.  Most of them were negative reviews because I wanted to see why their opinions differed so much from my own.  It seems to me that those writing the moreI have read a fair amount of other's reviews on this movie before writing my own.  Most of them were negative reviews because I wanted to see why their opinions differed so much from my own.  It seems to me that those writing the more negative reviews tend to analyze things on a far deeper level than I ever do.  Some talk about how they notice prosthetics on actors, painted scenes, or even even how they thought someone hanging onto the edge of a cliff about ready to fall before being pulled back up was dumb because too many other movies use that.  I'm bringing this up because I usually never even notice such things while I am watching movies and I want to set up my perspective.   I thought the movie was exciting and humorous.   I loved seeing the dwarves story and their history that led to the point of the movie as well as Thorin's personal history.  The humor that the dwarves had constantly brought  a smile to my face while watching the movie.  I also loved seeing Bilbo's own struggle to find his place within the company throughout the movie as he was mostly looked on as a burden by the others. I also saw the movie in the new 48fps HFR format, which many of the preliminary reviews were negative.  Almost all of the negativity, that read at least, on this was that the picture looked either too good or weird.  I  completely don't understand the looking too good part of those reviews so I'm not going into that.  As for the weird part I can understand somewhat.  For the first 15-20 minutes of the film it almost looked like everyone was moving at a slightly faster speed than normal, such as 1.1x or 1.2x the normal speed reminded me of the creepy jerking motion that is used in scary movies.  I think my eyes just had to adjust to it, however, because after that 15-20 minute time frame I didn't notice it anymore and the picture seemed normal to me.",
      "review_date": "2012-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Most of the writers of negative and mixed reviews must be hopped up.\rI can't understand how people can say this movie is too slow paced or too long. I was kinda sad when the film ended, I could have sit for 3 hours more in the cinemas andMost of the writers of negative and mixed reviews must be hopped up.\rI can't understand how people can say this movie is too slow paced or too long. I was kinda sad when the film ended, I could have sit for 3 hours more in the cinemas and that's always a good sign.\rOf course, \"The Hobbit\" has its weaknesses, but I am gladly willing to accept these if I get brilliant scenes like \"Riddles in the Dark\" on the other hand.\rCan't wait for the next part.",
      "review_date": "2012-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another masterful movie from Peter Jackson that fans of Tolken will fall in love with. Some have said it was to long, i only wished it lasted longer. This is a masterpiece that does the book proud. I look forward to the second and third parts.",
      "review_date": "2012-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Personally, I don't understand why the critics were so harsh with this one. The story is captivating, the acting is very good and the art is stunning. Some complained about compugraphics that were too apparent, but to me, telling a storyPersonally, I don't understand why the critics were so harsh with this one. The story is captivating, the acting is very good and the art is stunning. Some complained about compugraphics that were too apparent, but to me, telling a story successfully is more important than perfectly credible  an utopia  compugraphics.\rI read the book very long ago, and from what I remember, the movie seems to captivate the spirit of the story.\rIn addition, to my pleasure, I did not find some of the annoying weeping scenes (hobbits), the ridiculous comic reliefs (e.g. Legolas skating the shield down the stairs), abusive slow-motion dramas, and fuzzy fight scenes of the LOTR.\rThe only complain I have, and that is a major one, is that Jackson decided to make this a movie trilogy, only to make more money with it.\rIn addition to unnecessarily making each movie longer, it forces us to wait for the rest year after year.",
      "review_date": "2013-04-07",
      "source": "metacritic"
    }
  ],
  "num_reviews": 140
}