{
  "title": "The Father",
  "rating": 8.6,
  "release_date": "2021-02-26",
  "summary": "Anthony is 80, mischievous, living defiantly alone and rejecting the carers that his daughter, Anne, encouragingly introduces. Yet help is also becoming a necessity for Anne; she can’t make daily visits anymore and Anthony's grip on reality is unravelling. As we experience the ebb and flow of his memory, how much of his own identity andAnthony is 80, mischievous, living defiantly alone and rejecting the carers that his daughter, Anne, encouragingly introduces. Yet help is also becoming a necessity for Anne; she can’t make daily visits anymore and Anthony's grip on reality is unravelling. As we experience the ebb and flow of his memory, how much of his own identity and past can Anthony cling to? How does Anne cope as she grieves the loss of her father, while he still lives and breathes before her? … Expand",
  "critic_reviews": [
    "Hopkins is extraordinary as a man flailing against a condition that’s taking everything from him. And Zeller proves he’s a natural filmmaker, orchestrating a Wagnerian opera of emotion based entirely around an old man in a flat.",
    "Its effects are essentially theatrical – but they are powerfully achieved, and the performances from Hopkins and Colman are superb. It is a film about grief and what it means to grieve for someone who is still alive.",
    "Yes, The Father is a familiar story and a universal one. Yet Zeller has been uniquely inventive in the way he evokes the unreliability of memory and the subjectivity of experience in the senile – and the healthy.",
    "The Father is a devastating masterwork by first-time director Florian Zeller.",
    "In his astonishingly assured debut feature, French playwright-turned-director Florian Zeller handles the mental decline of an elderly man with sensitivity and insight.",
    "The Father is a compelling, illusionary story about aging's disorienting symptoms. It is a masterpiece of structure, narrative, editing, and performance.",
    "As Anthony, a blustery London widower whose grip on reality slowly comes unglued over the course of the film, Hopkins does it again. This is a magnificent and harrowing performance: A lion in winter slowly coming to ground.",
    "The Father, ultimately, is a paradox: as nuanced as it is bluntly direct, as tough as it is tender. In its own elegant, confounding, chimerical and compassionate way, it’s a lot like life.",
    "Masterful and agonizing, The Father is a gorgeously crafted film about a doomed arrangement entered into with love, even though it can only end in tragedy.",
    "At once stupendously effective and profoundly upsetting, The Father might be the first movie about dementia to give me actual chills.",
    "Hopkins makes himself transparent. He lets us see both who this man was and what he is now. There’s dignity in the crumbling facade and child-like terror in the eyes — and a warning to those who’ll be lucky enough to live so long.",
    "Sneakily utilizing production design and uncanny good editing, The Father fascinatingly puts the viewer in the same state of distress as its main character. And in adapting his own play, the director’s carried over an intimate quality of a staged chamber drama to not just show a man dealing with dementia but also offer a way into his mind with a haunting, deeply affecting and quite memorable narrative.",
    "Another powerful, mesmerizing and downright heartbreaking performance by the great Anthony Hopkins enhances The Father.",
    "The Father is about the suffering of old age, the importance of connection, the sick encroaching of an affliction, and ultimately, death. It doesn’t sugarcoat things, despite its sugarcoated exterior. Like its French counterpart, Michael Haneke’s Amour, it’s not an easy watch, but it’s a necessary one, a film that examines the very essence of our humanity.",
    "The best film about the wages of aging since Amour eight years ago, The Father takes a bracingly insightful, subtle and nuanced look at encroaching dementia and the toll it takes on those in close proximity to the afflicted.",
    "This bleak and profound meditation on diminishing faculties results in a shattering work of cinema. I was left shaking with the results, drawn in completely to the film’s shifts in tone and character, anchored throughout by Hopkin’s impeccable performance.",
    "Anthony Hopkins delivers a master class in acting as a once-brilliant man losing his mental faculties to the plague of dementia. First-time director Florian Zeller turns his modern “King Lear” of a play into essential cinema.",
    "What might have been predictable or sentimental in other hands becomes startling in the film’s approach, as well as beguiling, unsparing, terribly moving and occasionally very funny.",
    "The Father is an unsettling film, but it’s also a compassionate one; family members of those suffering with dementia can turn to it for an empathetic portrait of how that disorientation must feel on the inside. It’s one of the most disturbing films in recent memory, but it’s both understanding and unforgettable.",
    "The moment-to-moment pleasures of trying to decipher the plot give way to crushing futility; you’re left sifting through the pieces of a puzzle that’s almost too painful to solve.",
    "The Father is an act of understanding, radical in its toughness and its generous artistry.",
    "The Father is a chamber piece, but it has the artistic verve to keep twisting the reality it shows us without becoming a stunt.",
    "Only those who have been through this experience – who have cared for a loved one who has dementia – can speak to the accuracy of this approach. For the rest of us, The Father will serve as welcome humanization of those suffering from a most alien disease.",
    "This is one of the most painfully realistic depictions of dementia in recent film history, and yes, that means The Father can be a tough viewing experience at times — but how can one be anything but grateful for the chance to see one of the world’s greatest actors doing such enormously moving work past his 80th birthday?",
    "It’s some of the absolute best work of Hopkins’ lengthy and storied career.",
    "The Father is an excellent movie but it’s not a lot of fun to watch, especially for those with first-hand experience in this area.",
    "As for Hopkins, he gives a precisely observed performance, capturing Anthony’s confusion without limiting the character to that single quality. He’s dazzling, for example, when turning on the charm for a potential new caregiver.",
    "Hopkins, Colman, Williams, Sewell and Poots give us an eyeful and and earful of a fate awaiting far too many of us in this quietly gripping and intimate drama.",
    "The skillfulness of the telling, paradoxically, can make The Father feel at times almost too painful to sit through; as the story shifts elliptically in and out of time, Anthony's losses become our own.",
    "Hopkins methodically strips away every quality we’ve come to expect from him—the refinement, the silver tongue, the imposing intensity he lent Lecter and Nixon and Titus—until there’s nothing left but frailty and distress. In doing so, he helps convey the full tragedy and horror of dementia: the way it can make someone almost unrecognizable to themselves and their loved ones.",
    "For a movie that follows a character’s perspective while remaining aware of his shortcomings, The Father marks a modest and involved debut from Zeller.",
    "The Father exists for no discernible reason other than to render an inexplicably cruel element of the human condition in a recognizable way, and to do so in a way that only good art can.",
    "Much of the project’s power is derived from Anthony Hopkins’s Oscar-winning central performance.",
    "For the many people impacted by dementia, it won’t be an easy watch – and for those who have experienced it in the past, it may feel like a gentle pressure on an old wound. But it’s a real window into an affliction that is both commonplace and unfathomable. And in that sense, it’s a gift.",
    "Childlike vulnerability hasn’t been something Hopkins has opened up to show us in a long, long while, but he seems ready for this role, hungry to do it, and you may not be prepared for how deep he goes. Zeller’s writing, and his shockingly naked acting, peak at the bitter end.",
    "The Father is a horror movie with not a single supernatural element: All of its terrors are implied, drawn from the tricks the human mind plays on itself, even more so in old age.",
    "The Father dives deep into the mind, delivering an engaging film that is unsettling, achingly sad, and is strengthened by Zeller’s assured narrative.",
    "The Father has occasional splashes of humor, but, by design, it’s tough to watch at times. Hopkins’ performance makes it impossible not to.",
    "Let’s be honest: the mainspring of The Father, onscreen, is the presence of Hopkins—an actor at the frightening summit of his powers, portraying a man brought pitifully low. The irony is too rare to resist.",
    "The Father isn't a picnic to watch, but it is -- somewhat ironically, given Anthony's condition -- a movie, and performance, that's hard to forget.",
    "The chance to see the 83-year-old Hopkins in a role that forces him to confront the tragic fact of human mortality, and his own eventual demise, with such rigor, curiosity, and vulnerability would have been reason enough to send audiences to see The Father, even if we weren’t also witnessing the birth of a major film director in Florian Zeller.",
    "Similar to how the characters are there to serve Anthony, Colman, Gatiss, Sewell and Poots are there to serve Hopkins. The stage belongs to him. What he does with it is something special, an unmissable performance from an actor with a filmography loaded with them.",
    "On the whole, The Father incorporates what could have just been a storytelling gimmick and infuses it with such sorrow, grace and even the occasional dark joke that it becomes a profound exploration of how we say goodbye to someone dear to us — even though they have not yet really gone.",
    "It’s a difficult, often quite brutal, viewing experience, as it needs to be given the subject matter, not only because of the fractured storytelling but because of the devastating lead performance from Hopkins.",
    "Keeping logical track of all the comings and goings is like trying to focus on a single bird in a flock. The details, names and faces blur a little more every time a character rounds a corner, just as they would for the ailing Anthony. With its narrative boldness, however, The Father never stirs or fully satiates.",
    "The film approximates the dislocation of its main character’s mind with a frighteningly slippery ease.",
    "Despite the efforts of Hopkins and an outstanding ensemble, Zeller can’t divorce his feature directorial debut from its theatrical origins.",
    "A clever concept, not a profound film. Terrifically acted and finely crafted though it is, it’s a brilliant but hollow exercise in perspective that calls more attention to its artful orchestration than it does life or loss.",
    "For all its apparent structural complexities, The Father is not quite as mysterious as its creators would have us believe.",
    "The ending, depending on you, may come off as either too neat or appropriately revelatory. But the film’s emotions have a stark, memorable sheen.",
    "The Father is brilliantly structured and executed, but in the end it’s just a cleverly constructed way to depict the mundane. It never finds that level of the fantastic or allows for the kind of magical thinking necessary to escape its dreary reality. Ultimately it wallows in the pathetic. Who needs this?"
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "has an excelent acting, great plot and could be sadly relatable to someone that has had a relative with alzheimers disease. Very deep meaning and requires attention to get it.",
      "review_date": "2021-05-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Blown away. Truly. Hopkins gives one of the best performances I have ever seen. The depiction of memory loss is terrifying but brilliant. A hard film to watch but important.",
      "review_date": "2021-02-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I’m simultaneously in awe and devastated by this film. I was fortunate to see this twice and it was even better on the 2nd viewing. Every aspect from the direction, pov story-telling, clever production design and especially the performancesI’m simultaneously in awe and devastated by this film. I was fortunate to see this twice and it was even better on the 2nd viewing. Every aspect from the direction, pov story-telling, clever production design and especially the performances are outstanding.  Anthony Hopkins and Olivia Colman, what a combination!  Hopkins gives a masterful performance for the ages. His last scene is stunning and will stay with me long after. While Hopkins is the soul of the film, Colman is the heart and emotion.  She conveys the anguish and frustration with the slightest change in her eyes and expression. You can’t help but empathize with her. Don’t hesitate to see this film. Yes, the subject matter is depressing but it’s a universal story that should not be missed.",
      "review_date": "2021-02-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Anthony Hopkins gives one of the greatest screen performances of all time. He manages to elevate the film and demonstrates why he is an all time great actor.",
      "review_date": "2021-02-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hopkins is spectacular and Colman complements him well. Masterful direction by Zeller.",
      "review_date": "2021-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best film about growing old since “Amour”, Florian Zeller’s outstanding directorial debut “The Father” expertly puts you in the shoes of Anthony as his mind and reality trick him and slowly crumble. Olivia Colman is phenomenal asThe best film about growing old since “Amour”, Florian Zeller’s outstanding directorial debut “The Father” expertly puts you in the shoes of Anthony as his mind and reality trick him and slowly crumble. Olivia Colman is phenomenal as Anthony’s daughter. But the true highlight is Anthony Hopkins, who gives one of the best performances of the century. Chadwick Boseman did an excellent job in “Ma Rainey’s Black Bottom”, but if we’re being honest, Anthony deserves the Oscar. This is easily one of the best movies of the year and one that will resonate deeply with anyone who has seen a loved one struggle during the last phase of their lives.",
      "review_date": "2021-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Anthony Hopkins gives one of the all time greatest performances of all time in this film and this is not even an exaggeration. I have no idea why he isn't just sweeping every award going right now as anybody who sees what he achieves in thisAnthony Hopkins gives one of the all time greatest performances of all time in this film and this is not even an exaggeration. I have no idea why he isn't just sweeping every award going right now as anybody who sees what he achieves in this cannot possibly deny how absolutely outstanding his work here is.",
      "review_date": "2021-03-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Father is not an easy watch and that's putting it mildly. You could even call it a horror movie of sorts only the horrors are the very real effects of dementia on the sufferer and their loved ones. Fantastic performances all round andThe Father is not an easy watch and that's putting it mildly. You could even call it a horror movie of sorts only the horrors are the very real effects of dementia on the sufferer and their loved ones. Fantastic performances all round and highly recommended if you can deal with the subject matter.",
      "review_date": "2021-04-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Why do you keep looking as if there's something wrong? Everything's fine.\"I’ve haven’t cried this hard at a movie since 'I'm Thinking of Ending Things'. This is one of those films that just thinking about it or thinking about a specific\"Why do you keep looking as if there's something wrong? Everything's fine.\"I’ve haven’t cried this hard at a movie since 'I'm Thinking of Ending Things'. This is one of those films that just thinking about it or thinking about a specific scene will get my eyes teary. I’m honestly blown away by how moved I was by it. One of the best movies of 2020. Anthony Hopkins gives one of the best performance since ‘Silence of the Lambs’. You may think that you've seen everything the veteran actor has to offer, but he continues to surprise and amaze us. He broke my heart a thousand times, especially the last five minutes which was some of the most powerful pieces of acting on screen. On the other hand, he’s also incredibly charming and funny as his character that it made him so mesmerizing to watch. I usually don’t care when it comes to awards, but I genuinely hope he gets some recognition at the Oscars with at least a nomination or maybe a win, because he is truly brilliant in this movie.Olivia Colman, who plays Anthony's daughter, Anne, was also fantastic in the movie. Her facial expressions solid every emotion that the character was feeling and Colman is an expert at it. The pain, frustration, and the overwhelming love she has for her father, as she tries to find ways of helping him. I can’t imagine a more dreadful sight than watching your loved one decay away before your eyes and there’s nothing you can do about it. While there have been other movies in the past that tackled the topic of dementia and old age on a surface level, where it mainly focuses on how friends and family coop with a significant others condition. However, this movie makes those films look flat in comparison. What makes this movie so different and yet more effective is that it’s told from the perspective of the sufferer. So, his confusion becomes ours. Simple things like switching Olivia Colman with a different actor can have a huge and scary impact, because when this first happened I was stunned, but I quickly realise this is the devastating reality of the disease where people you once knew start to look alienating to you.Director Florian Zeller dose an excellent job of placing you in the shoes of someone going through dementia and have a better understanding of how the disease can affect you. Any other film marker would’ve done the predictable approach, which is to go over the top with the possibilities of presenting a surreal nightmare with flashy visuals, as a way to show off crazy camera work and digital effects, but Zeller instead keeps things grounded enough while in the imaginary world inside the characters head. It’s true what they say, less is more.The movie is purposely structured and edited in a disorganised lucid dream-like manner, where certain elements such as the mention of names and the appearance of faces are a mystery to us just like the main character. Who are these people? Why is everything so mysterious? When you try to piece things together with the collection of scattered memories of events, it then gets shuffled around. Although, the movie isn’t as complicated as it may sound, it's just not straight forward narrative wise. It was like watching a horror movie at times with the horrific effects of dementia. Your brain, metaphorically, is like a tree branch filled with leaves, but eventually with the slow effect of the disease, you will lose your leaves. Overall rating: A magnificent movie that helps us understand the struggle and experience of dementia that was executed with extra care. It also goes beyond that in many different ways that I have yet to unlock in my first viewing. It’s a movie that I will never forget.",
      "review_date": "2021-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Moving from non-diegetic sound to diegetic sound of classical music the dementia-afflicted titular father is listening to while relaxing, we right away found ourselves slipping into his mind and, subsequently, descending into hisMoving from non-diegetic sound to diegetic sound of classical music the dementia-afflicted titular father is listening to while relaxing, we right away found ourselves slipping into his mind and, subsequently, descending into his deteriorating mental state. Thus, we're instantly warned that what we're going to witness of events are, by and large, untrustworthy. Adopting such narration technique isn't the easiest to pull off, never mind when applied to a character-driven story doubting \"the fabric of his reality.\" For in case it failed, the story would be in total shambles (Capone is a case in point, assuming that was its intent in first place); and if it paid off, the story would offer us a sympathetic look at its main character. Florian Zeller managed to do the near-impossible, generating empathy towards a character we're not suffering from what it suffers by tapping on the truth we relentlessly evade each time we see our grandparents, for instance, fail to recall words, our names or even to recognise who we are while they're doing their utmost to convince us otherwise. This film embraces this fear to a disturbingly horrifying degree. We found ourselves pondering over what we see as an impending condition so much so we're simultaneously letting the uneasiness dominates our thoughts while we're sitting watching the movie.Zeller also managed here to give The Father a clinical quality reminiscent of psychological horror films to keep us always on the verge of being painfully unsettled at any time. High pitched sharp sounds and disquietingly cozy furniture(s) are here to accentuate this feeling so that a little boundary-pushing moment would send a shiver down the spine along with some suppressed tears begging to be shed. And then we have Hopkins delivering a tour de force performance that will soon or later be regarded as one of his best. Through his character, we see him in an utter bewilderment, incessantly trying to figure out what's happening around him and make sense of all that \"nonsense\" in such manner that force you to do so along with him. That's the definition of an engaging performance. Another thing I noticed through his facial expressions is the that he seems to be constantly processing his surroundings as well as every words he hears. A truly brilliant performance that dictates how similar characters should be played. I'm really hoping Riz Ahmed wins since it would be his first Oscar but, truth be told, Sir Hopkins is more worthy of it. Olivia Colman is absolutely amazing as always, but it's Imogen Poots as the nurse (Laura) that caught me off guard with the scenes she shares with Anthony. The spontaneity of elderly people that can be inadvertently offensive and their fear of being mocked at or at least of being treated rather as children collide here in way that made me continuously switch back and forth between sympathising towards each of them. This is a unique, unprecedented cinematic achievement, and definitely my favourite movie of 2020.(10/10)~Spoiler Alert~A spoiler warning here as I'm talking about a certain motif in this movie, that is the \"watch\". Besides the \"apples\" in Pieces of a Woman, this is yet another deft use of motifs in movies from the last year. The watch here indicates Anthony's grasp of the sense of time and age. His watch is first mentioned as being snatched by Laura. Later on, we see Anthony suspects Paul to be wearing his watch. In both occasions, it was the first time for him to be introduced to these characters, and the fact he failed to recognise them made them sources of intimidation that threaten his supposed control over his memory. In the soul-crushing ending scene where he's with his nurse, Catherine, he says that he wants his mom but his nurse corrects that he means his daughter. However, he insists that it's his mom, then he mentions that he wants her and that he's losing his leaves. Then, in a last desperate attempt to convince himself of his sanity, he says that he knows that his watch is on his wrist. From all this we may gather that his last monologue seems to sum up all his life, and his aging to be precise. His life went in full circle and now he's a child again in a pressing need of his mom.",
      "review_date": "2021-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If Olivia Colman and Anthony Hopkins are cast as father/daughter, the outcome is bound to be special. He plays a man whose reality is racked by dementia, while she copes with declining condition, while struggling with his care. AlthoughIf Olivia Colman and Anthony Hopkins are cast as father/daughter, the outcome is bound to be special. He plays a man whose reality is racked by dementia, while she copes with declining condition, while struggling with his care. Although Colman is resplendent with love in her eyes and desperation in her heart, it’s Hopkins’ movie. This isn’t the traditionally pitiful old man suffering from confusion, but a plucky, sometimes angry character, who we witness slowly deteriorate. The nuanced direction by Florian Zeller, who also wrote the play on which the film is based, is somewhat objective. He relies on his superior cast to give this sensitive study its power.",
      "review_date": "2021-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sir Anthony Hopkins and Olivia Colman are sublime in \"The Father,\" co-written and directed by Florian Zeller based on his Play. Oscar-winner Anthony Hopkins is simply masterful as an aging man suffering memory loss and Academy Award winnerSir Anthony Hopkins and Olivia Colman are sublime in \"The Father,\" co-written and directed by Florian Zeller based on his Play. Oscar-winner Anthony Hopkins is simply masterful as an aging man suffering memory loss and Academy Award winner Olivia Colman (\"The Favourite\") is his daughter and caretaker Anne, equally skillful in her supporting role. The moments of quiet in this film, particularly at the end, are as powerful and significant to the story as the heart-wrenching, emotionally effective performances from the cast.",
      "review_date": "2021-03-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great but hard to watch. The screenplay is amazing, and Zeller does an outstanding job. And regarding Hopkins, there's really nothing to say that hasn't been said before.",
      "review_date": "2021-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don’t think the term movie does this justice, it’s art but not artsy. A bittersweet reflection of life. Anthony Hopkins is a master.",
      "review_date": "2021-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Haven't seen a better movie then THE FATHER since Inception, what a beast is ANTHONY HOPKINS!",
      "review_date": "2021-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What Florian Zeller has achieved in his film debut is astounding. Through a fragmented narrative, the director puts us in the protagonist's shoes — a man who has dementia and refusing to accept the help provided by his daughter.I couldn'tWhat Florian Zeller has achieved in his film debut is astounding. Through a fragmented narrative, the director puts us in the protagonist's shoes — a man who has dementia and refusing to accept the help provided by his daughter.I couldn't help to feel lost and confused as I was watching this, but that's exactly to the point: to get an approximation of what this disease is like. The screenplay succeeds in every way by doing this.Anthony Hopkins, of course, gives the performance of a lifetime. It sure was hard for someone like him to assimilate a situation as his character faces, but the result is just great. Sometimes it feels like you're watching a little kid afraid of getting scolded, and others, he's just like a grumpy and mean older man. Again, a performance with so much nuance.Shout out to the production design department for the meticulous effort of building the apartment set. The place is another character in this story, and the way it resonates with Anthony is significant. All in all, a very original film that deserves all its praise.",
      "review_date": "2021-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie \"The Father\" could be easily one of the very best this year. An incredibly talented actor Anthony Hopkins plays an elderly man Anthony suffering from dementia. Not any less talented actress Olivia Colman plays his daughter Anne.The movie \"The Father\" could be easily one of the very best this year. An incredibly talented actor Anthony Hopkins plays an elderly man Anthony suffering from dementia. Not any less talented actress Olivia Colman plays his daughter Anne. Their performances are just outstanding.The subject of dementia or Alzheimer disease is definitely not new in movies but rarely it comes out so realistic, disturbing and emotional. What differs this movie from others on the same topic is that we see it from Anthony's perspective. Which *reality* is real and which is not? This film gut-wrenchingly depicts a man who not only forgot who people around him were, but he forgot who he was. We can see how infuriating it gets when your brain plays games with you. And how painful it is for loving ones to watch this process of mental deterioration. The movie is a \"must see\".",
      "review_date": "2021-04-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Anthony Hopkins gives another extraordinary performance. Great screenplay and masterfully directed film.",
      "review_date": "2021-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Breathtaking, devastating, quite possibly the best directorial debut I've ever seen and an unmitigated masterpiece in nearly every facet, Florian Zeller's \"The Father\" represents the best sort of surprise you can encounter at the movieBreathtaking, devastating, quite possibly the best directorial debut I've ever seen and an unmitigated masterpiece in nearly every facet, Florian Zeller's \"The Father\" represents the best sort of surprise you can encounter at the movie theater. Take a movie that you've heard very little about, from a director you've heard virtually nothing about and screen it at a rate of what feels one theater for every five hundred miles (in my area, at least) and you've got quite a long shot in the making. Man, oh, man does this defy the odds. Short of strapping a GoPro to Anthony Hopkins's head, there's no other way this movie could've better portrayed dealing with dementia from a first person perspective. From the manipulation of time, to the malleability of space, to the transience of matter, all of it is utilized for the sole purpose of making you feel as helpless and as confused as our ailing protagonist. God, it's all so genius and perfect in its execution. This is also probably the best performance from Anthony Hopkins since \"The Silence Of The Lambs\" and that's saying A LOT (the man WORKS). Olivia Colman -- as always -- is a damn treasure. Damn it, this was sublime. Easy perfect score.",
      "review_date": "2021-04-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In this subtle yet tender and heartfelt drama, Anthony Hopkins stars as a man suffering from dementia as his daughter (Olivia Colman) and several others around him try to help him in the face of his stubbornness and unwillingness to acceptIn this subtle yet tender and heartfelt drama, Anthony Hopkins stars as a man suffering from dementia as his daughter (Olivia Colman) and several others around him try to help him in the face of his stubbornness and unwillingness to accept his state. In addition, his mind and sense of reality begin to deteriorate as his memories and ability to identify those around him start to fade away. First off, this film does an incredible job of immersing us in Anthony's state of mind and helping us understand his pov. Several other random and unfamiliar characters pop in and out throughout the film, and their true names and identities are never truly established, so like Anthony, even we, the audience, are also confused and never truly certain of what's going on around us or who these other characters are. If this is the closest some of us can come to experiencing what it's like to suffer from dementia, then the film brilliantly succeeds at giving us a glimpse at what it must feel and be like, and it's rather quite heartbreaking to say the least. Furthermore, Hopkins delivers the most deeply felt and personal-feeling performance of his career. His struggle was sincerely felt by me in every moment. Olivia Colman, who also never fails to impress, gives an equally sincere performance as Anthony's daughter Anne. As far as the overall execution of the film goes, it was adapted for the screen and based off director Florian Zeller's French play 'Le Pere', and since much of the film takes place in an apartment flat, it's easy to see that it was originally meant to be a play. However, this hardly detracts from the rest of the film, as the film's strengths easily outweigh this. Overall, the all-too-real feeling and experience of dementia this film portrays, coupled with a pair of tearjerking performances from Hopkins and Colman help this film shine, even if it does prove ultimately sad and difficult to get through, given the subject matter.",
      "review_date": "2021-04-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despite a stellar performance by Anthony Hopkins and director Florian Zeller's creative and unconventional treatment of his movie's subject matter, this look at the progression of dementia as seen from the inside tends to become somewhatDespite a stellar performance by Anthony Hopkins and director Florian Zeller's creative and unconventional treatment of his movie's subject matter, this look at the progression of dementia as seen from the inside tends to become somewhat repetitive over time, prompting viewers to wonder where it's all headed. That aside, however, the most likely conclusion to come out of such speculation is not, in fact, at all difficult to decipher before its somewhat uneventful arrival. The film takes a little too long to reach that point, providing audiences with a payoff that's not as unexpected to see coming as the filmmaker seems to think it is. To be sure, the emotions the picture stirs are indeed genuine, but the process through which they're generated could have used less redundancy, despite the twists and turns that arise throughout the course of the film. The picture is indeed a solid effort but not one that's as outstanding as it's being made out to be.",
      "review_date": "2021-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Frustrating, confusing movie. While the performances are good , especially Hopkins, it can’t carry this film.  If you watch it, you will know what I mean.",
      "review_date": "2021-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Analytical but lacking in compassion. Why is mental illness considered entertainment when mental health care only available to super rich? How is the writer profiting from this setup?",
      "review_date": "2021-05-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Based on the play of the same name and in a minimalist setting, Anthony Hopkins is poignant in the role of a father who has not realized that he needs help to support himself. A reflection of the inevitable: old age. If you were able to seeBased on the play of the same name and in a minimalist setting, Anthony Hopkins is poignant in the role of a father who has not realized that he needs help to support himself. A reflection of the inevitable: old age. If you were able to see her without crying, don't celebrate. You may need to see a doctor.",
      "review_date": "2021-04-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An audience will generally accept whatever happens in the first 15 or 20 minutes of a movie to be true to the reality of the story no matter the genre or subject matter. This is when we are being introduced to the characters and their world.An audience will generally accept whatever happens in the first 15 or 20 minutes of a movie to be true to the reality of the story no matter the genre or subject matter. This is when we are being introduced to the characters and their world. Even if a movie begins with a dream or a fantasy, it has told us what is real and what is not. The Father takes full advantage of this to put the audience in the mindset of Anthony, an elderly man with dementia. As you might imagine given the subject matter, this makes for a heavy viewing experience. The Father is that kind of movie that is well made and well-acted but cannot exactly be described as entertainment. The film begins with Anne (Olvia Coleman) meeting her father, Anthony (Anthony Hopkins), at his large, posh London apartment to tell him that she has met a man and will be moving to Paris soon, so she will not be able to look after him anymore. In the next scene Anthony finds a man in his apartment who he (and we) has never seen before claiming to be Anne’s husband. Anne returns from the market but Anthony does not recognize her. Neither do we. Now Anne is played by Olivia Williams and says she is not and never was moving to Paris. Director Florian Zeller, who, along with Chistopher Hampton, adapted The Father from his play, has us share in Anthony’s disorientation and confusion with very effective but simple techniques.Scenes repeat and loop back on themselves. It seems like this movie takes place over the same few days again and again. The Oscar nominated production design makes different apartments look the same but also different. The cinematography finds ways to shoot a room from different angles so we aren’t sure if we are in Anthony’s apartment or his daughter’s apartment. There is a general sense of a timeline (the editing also received an Oscar nomination), but we are never really sure where we are in the timeline. Anthony often points to a painting done by his other daughter, Lucy, but then one time it isn’t there anymore. We see the faint outline that something once hung there. Was the painting removed? Is he in a different apartment that never had the painting and hung something else there?    It will come as no surprise that Anthony Hopkins gives not just a good or very good performance but a great one. His Best Actor Oscar nomination isn’t just a lifetime achievement placeholder. Anthony’s ever-changing mood and perspective requires Hopkins to be agitated, charming, confused, calm, lucid, frightened; often in the same scene. Yet, Hopkins does not use the role just to showcase his talents. Even in the most dramatic scenes his performance is still full of sympathy; we see Anthony the character first and the work of Anthony the actor later. Olivia Coleman is a great scene partner for Hopkins and does a great job conveying her emotions while trying to hold them back. The rest of the small cast is an impressive lineup of great performers: Olivia Williams, Rufus Sewell, Mark Gatiss, and Imogen Poots.  The doubling and repetition of scenes and dialogue are indeed a clever approach to dramatizing the muddled perspective of a dementia sufferer. However, with this effect having been achieved so quickly and completely at the beginning of the film, after a while these techniques lose their power and even become annoying. The movie never gives us an objective reality even in scenes of Anne alone or with her husband. I understand the filmmaker wanting to keep us off kilter to fully convey Anthony’s perspective but there are moments where the film is not from his perspective, including Anne’s dream/nightmare.The final scene is what we presume it will be and is emotionally powerful. While appreciating The Father from an artistic and technical view, I kept wondering who this movie is for. I cannot imagine people who have really had Anne’s experience wanting to relive such devastating experiences. It is not especially grim or dour or mawkish, but it would still be a difficult watch for a movie night (definitely have something light queued up to watch afterward). There are other works of fiction and non-fiction about the effects of dementia and Alzheimer’s disease and the emotional toll it has on everyone involved, but I suppose this is the only one with an incredible performance from Anthony Hopkins.",
      "review_date": "2021-04-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "(Mauro Lanari)Bastard son of \"Memento\" (Nolan 2000) and \"Amour\" (Haneke 2012), from the 1st it takes the cinematographic transposition of psychopathologies version 2.0, that is from a point of view no longer external to the patient. They(Mauro Lanari)Bastard son of \"Memento\" (Nolan 2000) and \"Amour\" (Haneke 2012), from the 1st it takes the cinematographic transposition of psychopathologies version 2.0, that is from a point of view no longer external to the patient. They tell the lie that this would induce greater empathic understanding; actually it is often only an expedient for an unnecessarily different diegesis: style, not substance. From the 2nd it takes that sweetening so dear to the hypersensitive palates of the Academy, do not accustomed to the real routine of organic sewage well known to any carer not invented for artistic success purposes as in the case of this debut.",
      "review_date": "2021-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think this might be a film I remember for a long time. The Father is a film that will slowly, emotionally collapse you from the beginning to end. It really makes you feel like you're inside the mind of someone with dementia, and it's trulyI think this might be a film I remember for a long time. The Father is a film that will slowly, emotionally collapse you from the beginning to end. It really makes you feel like you're inside the mind of someone with dementia, and it's truly heartbreaking. In many ways you could compare The Father to a psychological thriller.",
      "review_date": "2021-04-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Here we are, Streamers, just a few days before the 2020/2021 Academy Awards ceremony, which is on Sunday. I have seen all of the films nominated for Best Picture; and, this is the review of The Father, which is the last one I was able catchHere we are, Streamers, just a few days before the 2020/2021 Academy Awards ceremony, which is on Sunday. I have seen all of the films nominated for Best Picture; and, this is the review of The Father, which is the last one I was able catch up on. It's nominated for 6 awards on Sunday, including: Best Picture, Actor and Adapted Screenplay. Let's see if this movie is worthy of all the accolades.The Father is an adaption of a play of the same name directed by Florian Zeller, who is both the playwright and screenwriter. It tells the story of a man in the throes of dementia and the struggles endured by his worried daughter as she navigates the decline of his mental faculties. The man's mind is unreliable, which makes it more difficult for him to determine what is really happening as his world transforms around him. Anthony Hopkins plays the titular Father, who is named Anthony; and Olivia Colman plays his daughter, Anne.Streamers, I'll be honest - I got a little sleepy watching The Father. I'm actually surprised that it is 1 hour and 32 minutes because it feels longer than that. Now, I don't think that means it is bad, or boring, maybe I was just tired. I will say that The Father can be repetitious and confusing. It seems like that is the point though. Zeller seems to be exploring from both sides of dementia in the two characters of Anthony and Anne. All of the technical aspects of the movie enhance his objective, including the editing and production design. The thing about an adaptation of a play is that it can feel static and claustrophobic. Both are true here, but again, Anthony's emerging dementia lends itself to being depicted in a static, repetitious and claustrophobic way. The filmmakers have used these things and other clever devices to their advantage. The problem is that a casual viewer may get lost and distracted by it all. I think that happened to me.On the upside, Anthony Hopkins is really good in his portrayal. His accolades are well-deserved. Hopkins provides the glimpse into the terror and confusion of losing oneself. Ultimately, it is a deeply affecting and heartbreaking performance.If you are an Oscars completist and feel like you have to see all of the films nominated for Best Picture, then The Father is not a waste of time. Plus, it is short - although it may not at times feel that way. There are interesting ideas about mental health and the care of our parents that permeate throughout; but, if you are not invested, you may get as lost and confused as Anthony - or sleepy like me. Nevertheless, it's definitely worthy of a bowl of popcorn - at least if you rent it from the comfort of your couch.",
      "review_date": "2021-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fantastic performances, especially by Hopkins. The narrative drive of the movie creates a kind of dysphoria I found wholly satisfying, and I wish they would have sustained it through to the end of the movie. Still, very well done.",
      "review_date": "2021-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An award-winning play is being made for the big screen - and by its director, who had no previous film experience. Can that work? Florian Zeller proves that it can. Dementia-stricken and proud Anthony learns from his daughter Anne that sheAn award-winning play is being made for the big screen - and by its director, who had no previous film experience. Can that work? Florian Zeller proves that it can. Dementia-stricken and proud Anthony learns from his daughter Anne that she will soon be moving to Paris. From then on, Zeller narrates the successive decline of Anthony's mind in complex but highly emotional and, above all, human ways.Anthony Hopkins is ideally cast for the lead role of Anthony. On the one hand, he is an empathetic father who means well for his daughter, but on the other, his pride and one-dimensionality make him sullen and critical of her decisions. Hopkins has never been seen in this simplicity. His character does not want to accept that his illness is getting the upper hand and is sure that he can manage without the help of care. At the same time, the increasing memory loss is told exclusively from his point of view, which automatically leads you to sympathise with the protagonist despite his often impossible deeds. This sympathy factor that Hopkins permanently carries with him makes it much easier to relate to him. It is arguably his best performance since his legendary one as Dr Hannibal Lecter in The Silence of the Lambs, albeit much more nuanced and realistic. While the strong female role at his side then was Jodie Foster, this time it is Olivia Colman as Anthony's daughter Anne. She logically disagrees with her father and does everything possible to organise the help he needs before she leaves for Paris. Colman is the heart of the film. She is heartbreaking in this role and often cannot emotionally withstand the pain that the sight of her suffering father causes her. Her chemistry with Hopkins is also very deep and often one would think that the two actually share this kind of father-daughter relationship. Colman is fragile in her individual scenes, but also forcefully strong and always torn about her father's treatment. Rounding out the great cast are Imogen Poots, Rufus Sewell and Olivia Williams, all constantly taking on different roles due to the confusion in Anthony's head. Williams in particular adds an enormous amount of vulnerability to her few moments, especially the final scene.Zeller has succeeded in a very particular kind of filmmaking with The Father. In its simplicity, the film is nevertheless very complexly constructed, especially in the first hour, and one cannot believe that dementia can apparently really trigger this process in a person's head. Because Hopkins does such a fantastic job of translating this and the editing also relies very effectively on surprise and suddenness, it never becomes too much to bear. Zeller also manages not to make the film seem exclusively sad, but also enriches the plot with thoroughly funny interludes. Basically, however, The Father is a sentimental drama that continuously makes hearts beat faster and that you can hardly get through without shedding a tear. An instructive, authentic and fascinating piece of filmmaking that is an absolute hit for a directorial debut and should be seen by everyone despite the vehemence of its subject matter.",
      "review_date": "2021-04-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I always thought 'Silence of the Lambs' would be Anthony Hopkins best movie and best performance until he was done acting, I was wrong. 'The Father' is the best movie Anthony Hopkins has been in and his best performance.",
      "review_date": "2021-05-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sir Anthony Hopkins and the rest of the cast of The Father give engaging and important performances. But it is incredibly sad, and a tough movie to watch. My heart goes out to the millions of people that have gone through, are now goingSir Anthony Hopkins and the rest of the cast of The Father give engaging and important performances. But it is incredibly sad, and a tough movie to watch. My heart goes out to the millions of people that have gone through, are now going through, and may very well go through this life changing occurance with a loved one.  It's not fair, and I wouldn't wish this disease on anyone.",
      "review_date": "2021-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this movie is just a vehicle for sir hopkins to play out his hobbies. whole range of his signature moves can be seen, from the menacing silence of the lambs to his early BBC movie dramas.very theatrical. Olivia did a more convincing job ofthis movie is just a vehicle for sir hopkins to play out his hobbies. whole range of his signature moves can be seen, from the menacing silence of the lambs to his early BBC movie dramas.very theatrical. Olivia did a more convincing job of an obedient introvert daughter. so different from her lesbian queen role in 'the favourite'.the star of the movie should be the director ( sadly not nominated), the beautiful apartment setting ( remember 'Amour', the tight editing that compartmentalize the minds of a progressive alzheimer patient.",
      "review_date": "2021-03-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best films I've ever seen... Hats to watch at times, but necessary.",
      "review_date": "2021-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a great movie which made me have a new appreciation of dementia. Anthony Hopkins performance was awesome.",
      "review_date": "2021-03-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Terrific screenplay and editing. Acting all around top notch. But Hopkins' performance here will be studied and shown in acting classes for years to come.",
      "review_date": "2021-05-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent pacing and exquisite performances. This film is captivating throughout as you get very invested in Anthony Hopkins’ journey. They did a wonderful job of showing you both perspectives",
      "review_date": "2021-05-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "So yes the movie is shot pretty well, it has always this sort of slow camera movement which makes it seem more professional  but i personally dislike this. It makes everything look and feel just like a play in theatre. Acting is pretty goodSo yes the movie is shot pretty well, it has always this sort of slow camera movement which makes it seem more professional  but i personally dislike this. It makes everything look and feel just like a play in theatre. Acting is pretty good that is nice. Music is very mediocre and forgettable in my opinion. It also serves sometimes not as a background music but as a main focus which i also dislike. Story is very confusing and all over the place which is intended feature because he has dementia and all of that but i think there are better ways to present dementia sick people in a movie, in a way that does not confuse the viewers. It is just a story about old man with dementia. Despite few emotional moments, overall very boring experience.",
      "review_date": "2021-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The story revolves around an elderly man suffering from dementia, played to perfection by Hopkins, while his daughter, played by Coleman, deals with the burden of having to care for him while witnessing the decline in his mental health. It isThe story revolves around an elderly man suffering from dementia, played to perfection by Hopkins, while his daughter, played by Coleman, deals with the burden of having to care for him while witnessing the decline in his mental health. It is based on a play and it shows as scenes are dialogue-heavy, often set in a single room, and don't feature much camera movement. Regardless of its minor flaws, The Father is still a good movie that features an amazing performance by Hopkins, which alone makes the movie worth checking out.",
      "review_date": "2021-10-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow, what a movie. First of all it makes you confusing as if you were the father with Alzheimer, so they mix faces, information, time and even places. It is hard to understand everything, as it is for the father. And secondly what aWow, what a movie. First of all it makes you confusing as if you were the father with Alzheimer, so they mix faces, information, time and even places. It is hard to understand everything, as it is for the father. And secondly what a performance by Anthony Hopkins, incredible.",
      "review_date": "2022-01-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Potent drama with superb performances from the AAA cast. The screenplay is excellent with a pacing that drives home the painful onset of dementia as Anthony loses his grasp on reality. Compelling to watch.",
      "review_date": "2022-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film will tug at your heart strings.  Anthony Hopkins takes us on a ride that many of us will deal with someday, dementia.  With every emotion he acts out you feel that emotion deep in your soul.  After the movie it took awhile forThis film will tug at your heart strings.  Anthony Hopkins takes us on a ride that many of us will deal with someday, dementia.  With every emotion he acts out you feel that emotion deep in your soul.  After the movie it took awhile for myself to disengage from it.",
      "review_date": "2021-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's ok, a bit too long for the concept maybe.The acting from the 2 main characters is really good.And the way they portrait what Anthony is living is cleaver.",
      "review_date": "2021-08-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Firstly, Anthony Hopkins won an Oscar for playing himself. This performance wasn't much of a stretch.The story itself is intriguing in that you are left just as confused as the main character and the confusion is never resolved.",
      "review_date": "2021-11-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The sense of disorientation evoked by this film made it a compelling and stunning watch. Antony (Hopkins) lives in a strange, revolving door of moments whereby we have no idea whether he is in the past or present. The filmmaker, also theThe sense of disorientation evoked by this film made it a compelling and stunning watch. Antony (Hopkins) lives in a strange, revolving door of moments whereby we have no idea whether he is in the past or present. The filmmaker, also the writer, Florian Zeller has taken his French play, La Père and brought it to the screen, perhaps giving the most realistic portraying of senility slowly emerging in an aging person. Thankfully, he knows when to ground the viewer's perspective, orient them for awhile before bringing back the confusion. A fine balancing act. I will admit, I was hesitant, and for a while, resistant to watching this one, afraid it would be a gloomy trek. It turns out, this movie not only shows you Antony's frustration with his dementia but the plight and frustration of loved ones around him, namely his daughter (Colman) and her husband (Sewell). It is a compassionate film, and it deeply respects its characters and world without dunking its audience into a heavy morass of depression. By the film's end, there is a sense of hope and yet resignation. Life continues, no matter the pain and the confusion. Beautiful, meaningful. Highly recommended.",
      "review_date": "2021-12-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a tough watch for anyone who has had personal experience of dealing with or caring for a relative with dementia. I thought Hopkins gave a very convincing performance (as does Olivia Colman) and the way the timeline works is quiteThis is a tough watch for anyone who has had personal experience of dealing with or caring for a relative with dementia. I thought Hopkins gave a very convincing performance (as does Olivia Colman) and the way the timeline works is quite clever - it leaves the viewer perhaps questioning what the titular father questions (I'll say no more so as not to provide full blown spoilers). It isn't what I'd regard an unnecessarily over exploitative sentimental type film, I'm glad to say.  It seemed very true to life, for what little I know. Yes I'd recommend it.",
      "review_date": "2022-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Incredible performances from Anthony Hopkins and Olivia Colman!'The Father' makes for a rather heart-breaking watch, it's very clear from the get-go where the film is heading but that doesn't stop it hitting directly in the feels. I'veIncredible performances from Anthony Hopkins and Olivia Colman!'The Father' makes for a rather heart-breaking watch, it's very clear from the get-go where the film is heading but that doesn't stop it hitting directly in the feels. I've fortunately never been around someone with what this film depicts, yet it still came across as very realistic - based on what I have heard about the condition.Hopkins is utterly superb in the lead role, which is what I expected given I had heard about this 2020 flick back when it won the big gongs. Something I hadn't heard about, though, was Colman's performance - which is absolutely fantastic, particularly in one emotional scene alongside Hopkins and Imogen Poots.A very saddening but brilliant film, cleverly portrayed too.",
      "review_date": "2022-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis movie is hard to watch, In a good way. This utterly realistic depiction of a man losing his mind is one that goes to really emotional depths. All of the movie's emotion is expressed through Hopkin's acting and a screenplay that shows its premise through the writing. This movie is told in mostly first person, and that at times causes scenes to have shockingly horrific moments in the idea of a man's mind attacking him. You as an audience cannot follow the events of the movie without having to piece nuggets of information that other characters mention. Be ready for heartbreaking scenes that make you want to reach out and save our main character. Bring tissues.",
      "review_date": "2021-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is so good. I will break something if Anthony Hopkins doesn't get an oscar.",
      "review_date": "2021-03-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A masterclass in acting from Anthony Hopkins; and a captivating and raw look at dementia from the point of view of the sufferer. It will twist and turn you as things slowly begin to unravel.",
      "review_date": "2021-07-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not bad for a movie that shows for old people being treated by young people.",
      "review_date": "2021-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Truly a work of art, with a sense of horror that no horror film could ever approach. Hopkins, at his absolutely finest, plays the role of a lifetime. The directing is pitch-perfect, with transitions that deceive you and force you to reassessTruly a work of art, with a sense of horror that no horror film could ever approach. Hopkins, at his absolutely finest, plays the role of a lifetime. The directing is pitch-perfect, with transitions that deceive you and force you to reassess the concept of empathy in relation to this troubling disease. An extremely uncomfortable yet necessary gift to cinema.",
      "review_date": "2021-10-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "On the residential streets of affluent London, Anne visits her father Anthony in his apartment. The 80-year-old man is saddened when his daughter announces an imminent move to Paris to join the man she loves and asks him what will become ofOn the residential streets of affluent London, Anne visits her father Anthony in his apartment. The 80-year-old man is saddened when his daughter announces an imminent move to Paris to join the man she loves and asks him what will become of him. Shortly thereafter, still in his home, Anthony finds a man sitting reading the newspaper, who claims to be Anne's host and husband. Although lively and at times very lucid, Anthony shows the symptoms of Alzheimer's disease, forgetting facts, places and people. In his relationship with his family and young caregiver Laura, the latest in a long series, Anthony's life continues in confused fragments that his mind is no longer able to piece together. Lifetime performance for Anthony Hopkins who at 84 offers his best performance. Director Florian Zeller stars in an impressive debut with this masterfully shot and edited original drama.",
      "review_date": "2022-04-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was amazing in the most sadness way, how the mode of the editing in this movie form the most important thing.",
      "review_date": "2021-12-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Father tells an emotional and heartbreaking story, and it's one hell of an example of brilliant filmmaking",
      "review_date": "2022-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Father is an exhausting, beautifully haunting experience.  A small glimpse into the tragic reality of what it could feel like to lose yourself to dementia and the devastation it brings to one's life, loved ones, and caregivers.  A movieThe Father is an exhausting, beautifully haunting experience.  A small glimpse into the tragic reality of what it could feel like to lose yourself to dementia and the devastation it brings to one's life, loved ones, and caregivers.  A movie everyone should see once.",
      "review_date": "2022-02-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Honestly, I was expecting more since it has such a high score. All the movie does it is to make you feel with demmencia. It is very confusing.",
      "review_date": "2022-11-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An absolutely devastating film. Anthony Hopkins gives maybe his best performance ever here.",
      "review_date": "2022-11-24",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 112,
  "genres": [
    "Drama"
  ]
}