{
    "title": "The Mitchells vs the Machines",
    "rating": 8.0,
    "release_date": "2021-04-30",
    "genre": [
        "Adventure",
        "Sci-Fi",
        "Comedy",
        "Animation",
        "Family"
    ],
    "summary": "It all starts when creative outsider Katie Mitchell is accepted into the film school of her dreams and is eager to leave home and find “her people,” when her nature-loving dad insists on having the whole family drive her to school and bond during one last totally-not-awkward-or-forced road trip. But just when the trip can’t get any worse,It all starts when creative outsider Katie Mitchell is accepted into the film school of her dreams and is eager to leave home and find “her people,” when her nature-loving dad insists on having the whole family drive her to school and bond during one last totally-not-awkward-or-forced road trip. But just when the trip can’t get any worse, the family suddenly finds itself in the middle of the robot uprising! Everything from smart phones, to roombas, to evil Furbys are employed to capture every human on the planet. Now it’s up to the Mitchells, including upbeat mom Linda, quirky little brother Aaron, their squishy pug, Monchi, and two friendly, but simple-minded robots to save humanity. [Netflix]… Expand",
    "critic_reviews": [
        "The Mitchells vs the Machines is like an encounter with a sentient doodle pad, crammed with ideas that might be the cleverest things anyone’s ever thought of, or the most ludicrous, or probably a jumble of both.",
        "Both a thrilling, giddy family adventure, and the solidification of a radical new visual language in feature animation.",
        "It’s a movie that commands attention, with everything going on across the screen and in the script. The action plot augments the family conflict and vice versa, with every moment of the story pushing those plots forward. It’s an utter delight from start to finish that brings the best of animation and the internet to life.",
        "Colourful and crazy paced road trip animation, The Mitchells vs. The Machines is the goofy-smart and entertaining family fare we’ve been needing in these fun-challenged times.",
        "The Mitchells vs. the Machines not only has laughably eccentric characters but also a script packed with bonkers, fast-paced action — with elaborate, wild visuals to match.",
        "The laughs come at a clip few movies can sustain, stacked so dense, repeat viewing (and in some cases, strategic freeze-framing) is required to catch them all.",
        "It’s an unbeatable combination of humor and heart.",
        "While The Mitchells vs. the Machines has its points to make, it’s also deftly funny, and never didactic. You’ll care about the message because you’ll care about – and probably identify with – the Mitchells.",
        "The producers include Phil Lord and Chris Miller, the inspired duo behind The Lego Movie and Spider-Man: Into the Spider-verse, and The Mitchells vs. the Machines has the same breakneck gift for comic timing and a willingness to throw anything at the screen if it’ll get a laugh, including an angry Furby the size of an office tower.",
        "It’s easy to feel as lost or overwhelmed by the flashing lights and exhilarating sights as the central family fighting on one side of the title’s grudge match, but it’s equally easy to come away with the exhausted glee of a long, weary theme park outing’s aftermath.",
        "The jokes arrive fast and plentifully, knowing just what will tickle both younger viewers and adults.",
        "Whether through experience or intuition, Rianda and Rowe clearly understand animated comedy from the inside out; the gags stretch and snap as readily as the family tensions.",
        "However you slice it, this is the rare CGI movie that radiates its own kind of inventive beauty, slick without feeling plastic, and the artistry that made it possible deserves to be celebrated on its own merits.",
        "Take away the serrated satirical edges of this showdown between suburbanites and self-aware smart devices, and you’re still left with a surprisingly delightful, moving story about a dysfunctional family learning how to connect again.",
        "Purposefully aggravating yet still beautiful, The Mitchells vs. the Machines is both a takedown and a celebration of our dissonant, tech-obsessed world. It gets us.",
        "The film retains a warm sense of humour about technology’s grip on society.",
        "The Mitchells vs the Machines feels, even without the benefits of a theatrical run, just like summer.",
        "The Mitchells vs. the Machines is a charming blend of heartfelt family connection with a wildly fun action comedy twist in its robot apocalypse.",
        "And after Into the Spider-Verse and a handful of Lego Movies, it’s further proof that producers Phil Lord and Christopher Miller are an animation brand as reliable as Disney or Pixar, and a good deal more likely to provide something that’s not only sturdy but genuinely surprising.",
        "The Mitchells vs. The Machines is a ridiculous, riotous, and relevant adventure fill with great humor and winning sentiment.",
        "The Mitchells Vs. The Machines is as irreverently funny as 21 Jump Street and The Lego Movie. And, like Spider-Verse, it has a unique visual style that rewards close inspection.",
        "On paper, The Mitchells appears to be a disjointed mashup of genres — the road movie, the father-daughter drama and the man-versus-machine sci-fi thriller — but the filmmakers nicely integrate all the elements with consistently funny jokes and the careful development of the Mitchell family members.",
        "While some of the in-your-face attempts to combine YouTube videos with animation are jarring at best and annoying at worst, the cautionary stabs about unregulated big tech that come alongside are no bad thing, nestled within the framework of a brightly coloured kids movie.  It’s also genuinely funny, a credit not only to the hit-a-minute script but also to a finely picked cast of comic actors",
        "A weird and joyful flick, brought to life with the help of the masterminds behind Spider-Man: Into The Spider-Verse.",
        "The beautifully animated road comedy The Mitchells vs. The Machines manages to take the genre and, while admittedly dipping its toes in the murky waters of cliché more than a few times, offers enough of a fresh take to provide a breezy escape during the near-two hour journey that unfolds.",
        "The film’s overall aesthetic is a pleasing blend of naturalistic drawings, cartoonier designs and Heavy Metal magazine futurism.",
        "But for all its fast-paced zaniness, The Mitchells vs. the Machines, scripted by Rianda and his writing partner Jeff Rowe (also co-director), is basically a good old-fashioned family road trip movie, and the Mitchells slide in somewhere between the Griswolds and a more accident-prone Incredibles.",
        "It sometimes succumbs to that animated problem of choosing hyperactivity over all other storytelling options, but it’s also a whip-smart action film, a movie with nearly “Fury Road”-esque momentum in its asking of the question, “What if the only family that could save the world was as dysfunctional as yours?”",
        "With a colorful blend of biting absurdity and copious dad jokes to offset the commonplace narrative, Rianda and Rowe optimize their dysfunctional family road trip for high-functioning enjoyment.",
        "Frenetic scenes over-stuffed with pop art/comic-bookish visuals, politically-savvy “tech is taking over” messaging and a handful of seriously silly and over-the-top moments give The Mitchells vs. the Machines its fizz and buzz.",
        "While the film certainly lays out the dangers of technology run amok, it also sees its power to connect people.",
        "Ultimately, this is an original adventure that feels stitched together out of a hundred familiar film plots, often freely acknowledging its pop-cultural plundering, as in the family's obligatory slo-mo power strut away from a building exploding in flames. But for audiences content with rapid-fire juvenilia, the busy patchwork of prefab elements will be entertaining enough.",
        "Lacking a precise balance of amiable entertainment and intense thrills, the director and producers fail to rein in violent fantasies that spoil what could’ve been a heartfelt and clever romp exploring family dysfunction."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Not bad, not great, it's a fun ride with some original elements and some pretty vanilla ones - in particular in the third act. I did Like the pace and lightness of it all. The animation itself too is on point. Pretty amazing what's possibleNot bad, not great, it's a fun ride with some original elements and some pretty vanilla ones - in particular in the third act. I did Like the pace and lightness of it all. The animation itself too is on point. Pretty amazing what's possible nowadays. The animations inside an animation was a small, but original mentionable. The humor however never got close to edgy, all the same I was never bored. But it's all equally easily forgotten as well.",
            "review_date": "2021-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When my daughter asked to watch this, I begrudgingly agreed expecting yet another brainless, lazy fart-joke kids' movie. But I was very pleasantly surprised by the wonderful mixture of clever humor and heart.I actually LOLed at multipleWhen my daughter asked to watch this, I begrudgingly agreed expecting yet another brainless, lazy fart-joke kids' movie. But I was very pleasantly surprised by the wonderful mixture of clever humor and heart.I actually LOLed at multiple jokes, and appreciated the acknowledgement that tech is neither inherently good nor bad (big tech ignoring your privacy and taking over your life: bad -- daughter using tech to make movies that express her creativity and emotions: good).This is one of those rare movies where I'm totally happy to let my kids watch it, and I'm totally happy to watch it with them.",
            "review_date": "2021-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If I had been in a different mood, I might have appreciated the humor more.  As it is, “The Mitchells vs. The Machines” was an adequate movie that tries really hard, so that is worth something.  I give it a C, if you've already seen the best,If I had been in a different mood, I might have appreciated the humor more.  As it is, “The Mitchells vs. The Machines” was an adequate movie that tries really hard, so that is worth something.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out.",
            "review_date": "2021-05-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Zero expectations while watching, and I was pleasantly surprised. Don't expect a life-changing film, or anything like that, after all The Mitchells vs. The Machines only seeks to make you have a pleasant and fun time that never gets heavy orZero expectations while watching, and I was pleasantly surprised. Don't expect a life-changing film, or anything like that, after all The Mitchells vs. The Machines only seeks to make you have a pleasant and fun time that never gets heavy or silly despite the predictability of its humor and narrative.If you're looking for something unpretentious, here's a good option.",
            "review_date": "2021-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a very fun movie with a lot of heart and good humor overall. Would definitely recommend.",
            "review_date": "2021-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThe Mitchells vs The Machines is not as good as many said it is. Sure, the animation is outstanding (and that must be admitted), and in the end the movie tries to convey a very good message. And that's all the good honestly, now I will say why I have not enjoyed it so much.The film is full of plot holes, many of them some people could justify it by saying that it is a comedy film, but being comedy does not justify that there is no internal logic. Examples: The Mitchell family dog ​​is supposed to cause robot failures by not being able to distinguish between whether it is a dog or a cow ... Are you telling me that the Mitchell family is the only family that has a dog? The invasion could not have been successful. That already leaves the plot inconsistent from the beginning!Another may be when Linda fights with the robots at the end of the movie. Many situations like these are super forced just to complete the plot and force comedy situations into it. If comedy were the core of the film, and there was only that, AND comedy was GOOD, it would be more or less forgivable. But not! The film as I said before, tries to convey a message, and there are several serious situations to reflect this. Personally, the film does not have a good balance between comedy and story, and both elements end up falling, since both the comedy and the story itself is super cliche, forced and predictable. The best way to describe this movie would be: a festival of memes. Because it is what it is, a humor that is no longer funny (and I think it never was imo). This movie doesn't know what it wants to be in that sense! They constantly expose you to a serious situation, and then a cliche joke, and so on for most of the plot.Don't get me wrong, not everything is bad in this movie. But is far from being a masterpiece. I think is mediocre at worst and ok at best.",
            "review_date": "2021-05-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An absolute blast of a film. I went in with moderate expectations but came out thoroughly impressed. This has a great visual style provided by the same people behind The Lego Movie and Spider-Man: Into the Spiderverse. The animation styleAn absolute blast of a film. I went in with moderate expectations but came out thoroughly impressed. This has a great visual style provided by the same people behind The Lego Movie and Spider-Man: Into the Spiderverse. The animation style pops and feels unique compared to other animated films which I liked. I also love how the animation was used to incorporate comedy because the film is pretty hilarious. If you don’t enjoy subtle pop culture references then you might not like the comedy but I think the set up and punchline of almost every joke worked. They even pause the film at times to make a joke which worked sometimes and other times it kinda deflated the tension but it didn’t bother me that much. A lot of these story beats feel very similar which is a common complain I hear and I do kinda agree with it. There really wasn’t a lot story and thematically wise that surprised me but I still like it because the writing is great. While the basic story threads are predictable, the circumstances are nice and refreshing with a take over the world kind of story. It was a fun take on a story that can be seen as predictable. I thought the emotional beats the film laid out hit a lot and some of it hit different for me as I am also going away to film school just like the main character. The characters all feel very fun and refreshing and I liked their little arcs that they went through and the voice cast did a great job as well with it. If you are a fan of animation then you will love this film. I would highly recommend checking it out.",
            "review_date": "2021-05-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is a really good movie for people who have a creative mind and for children, I m a teen and this is my fav movie ever!! Family is first forever!!--",
            "review_date": "2021-07-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Overall a mediocre movie, it has a good background but cringey memes of 2012 spoiled the good parts of the movie.",
            "review_date": "2021-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is going to win the Academy Award for Best Animated Feature next year. Calling it now.",
            "review_date": "2021-05-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Like what many already said, it can be at times over-the-top, cliché, and occasionally cringe. It's not very deep either. The movie exagerates how \"bad\" the parents are supposed to be percieved. This can be hard to relate to for people whoLike what many already said, it can be at times over-the-top, cliché, and occasionally cringe. It's not very deep either. The movie exagerates how \"bad\" the parents are supposed to be percieved. This can be hard to relate to for people who actually come from real toxic families. Much of the \"comedy\" relies on exagerated animations and dialogue. Anytime a moment is truly funny, it is immediately followed by a cringe/stupid moment that completely cancels it out. So much potential, but ends up being one of the many mediocre animation films released each year.Oh, and I still can't get over the voice acting for the little brother.",
            "review_date": "2021-05-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I HATE this film at times, and then I LOVE this at times... THEN I HATE IT AGAIN, THEN I LOVE IT AGAIN! The film flip flops between being good and bad for me so much it's jarring. This is one of the most mixed feelings I've had for any recentI HATE this film at times, and then I LOVE this at times... THEN I HATE IT AGAIN, THEN I LOVE IT AGAIN! The film flip flops between being good and bad for me so much it's jarring. This is one of the most mixed feelings I've had for any recent movie. I can tell there was clearly passion put into the making of this film, and the art direction and camera work is good and really professional. But then the voice over work is shawty; where characters sound like they're in a bubble and then sound perfectly normal. If it was a story decision, then moments like the rooftop scene wouldn't sound like they were recorded in a house room.The biggest problem I have with this movie, and I'll get this out of the way now, is that for all the amount of times the characters SAY they're the \"most dysfunctional family ever\", the Mitchells are probably the most functional, understanding, and communicative family I have ever seen put on screen... The mother cares for everybody in the family, the son is supportive of his sister, the dog gets along with everyone, and the father, for all his flaws, literally wants nothing more than to connect with his family through nature and family bonding. I think the one who I like out of all the Mitchells is the dad, he catches a lot of heat from his family but literally just wants to do the right thing by them. But, for all this seem good on the surface, it's bad for establishing character conflict. We are only ever told that their's conflict between Katie and her father, Rick, but the closest we ever get to seeing it are several very mild instances of arguments that, quite honestly, felt so minuscule to get worked up over, they didn't even feel like character conflicts. Katie tries to show him something cool, and Rick tries to show her something cool about nature, and she walks away miserably. Another time, Rick gets gives his opinion on Katie's future and how he feels that she needs a backup plan if things go south, which he APOLOGIZES FOR IMMEDIATELY, he knows what he's saying is stupid, but no, instead of trying to understand him, Katie takes this as a sign of aggression. All this leads to an accident, where in the heat of the moment, Rick tries to take Katies laptop to see her full video, and he accidentally breaks it. Notice that I said \"ACCIDENTALLY\", because he meant well but caused an accident. If the accident was caused by, lets say - for instance - Rick being more of an a-hole, and then arguing with his daughter about how she spends way too much time on her phone and calls her selfish, and she fires back calling him a deadbeat father who doesn't understand her. Then it evolves into an even more serious argument - her being lgbt - she tells him she's never understood him, and he tells her he doesn't want her to change. Then, he takes the laptop because he says he thinks it'll be good for her to not have it, then the tug of war between the two of them happens... and then... like before, the laptop gets broken.To me, this is a much more interesting way of establishing conflict in the characters. She want's to be herself, but he wants her to be who she was before, then the tug of war with the laptop symbolizes their broken bond as father and daughter. With the previous scene, all we have is a father and daughter not agreeing on the OPINIONS about what life direction she should take, and the father is a blubbering idiot. And that's all establishes in this scene, that the father is an idiot. But with this new scene, it adds more weight to the film, bringing up some serious topics that are relatable and, when done right, makes the audience more engaged than ever before.The reason I wanted to bring her being lgbt to the forefront is because it was such an insignificant thing to the movie. And what I mean by that is that having that be basically/kinda/sort of revealed at the end of the movie (with obvious hints at the beginning) does little to effect the plot, which I feel is missed potential. It's much more relatable to have that aspect of her be a plot point the dad needs to get over in addition to the already established \"Katie needs to get along with her dad\" plot point.Wish I could say more, but can't because of Metacritic's max word limit. I'll say that I hated the tone flip flopping from comedy to seriousness rapidly in scenes, the serious and comic parts need to be cut, and need room to breathe. But the serious moments that land, land very very well. I love the dynamics between the family on the road trip, even if it feels forced that Katie is just \"fine\" with the road trip, and still uses her phone. The product placement is jarring, cut most of it out. And cut down compilation score, use more classic score and keep some pop music.This film is a huge mixed bag(5), almost a 4 actually, a lot of missed potential and a lot to be desired. But their is clearly passion put into this, and that is admirable.",
            "review_date": "2021-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nI just watched this movie today, and I love it. From the 3D animation and effects, To the story and the effort, this movie is such a good representation of how a disconnected family can come together again and survive in the harshest problems.That is why I think it deserves this 10.",
            "review_date": "2021-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "No amount of behind-the-scenes cinematic team-ups in recent years can compare to the overwhelming power that the guys behind Gravity Falls (Michael Rianda and Jeff Rowe) and Spider-Verse (Phil Lord and Chris Miller) have when you put theirNo amount of behind-the-scenes cinematic team-ups in recent years can compare to the overwhelming power that the guys behind Gravity Falls (Michael Rianda and Jeff Rowe) and Spider-Verse (Phil Lord and Chris Miller) have when you put their creative minds together on a singular project. This is an amazingly fun movie from start to finish, benefited by some brilliantly stylized CGI that continues the trend that Spider-Verse started but taken a few steps further with some added medium blending that very much blew my mind. It also helps that 92% of the jokes land right on target. Did I mention that it also has a disarmingly astute emotional core?Honestly, at this rate Sony Pictures Animation may be beating Pixar at its own game.",
            "review_date": "2021-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I had my worries about this movie from the trailer but all of those concerns were blown away within the first 15 minutes. No movie looks anything like it. If you like creative, funny movies with great characters then I highly recommend this film.",
            "review_date": "2021-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Every time I see an animation, I tell myself that they can't do better than this, but surprisingly, the next animation is made with a completely new and impressive theme and style. It is very interesting to me that an animation arouses theEvery time I see an animation, I tell myself that they can't do better than this, but surprisingly, the next animation is made with a completely new and impressive theme and style. It is very interesting to me that an animation arouses the feeling of a person in this way and brings tears to my eyes. Even better than a movie.",
            "review_date": "2021-05-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was absolutely hilarious, I think they captured awkward family moments amazingly without getting too dark. I think the family dynamic in this movie is very realistic. I did think that the villian was kind of one sided but I enjoyedThis movie was absolutely hilarious, I think they captured awkward family moments amazingly without getting too dark. I think the family dynamic in this movie is very realistic. I did think that the villian was kind of one sided but I enjoyed her character so that wasn't a big complaint, I think the voice acting was really good as well, the pug jokes never really got annoying for me either. Overall I loved this movie and would totally watch it again. DEFINITELY RECOMMEND. I don't think there will be a better animated movie this year.",
            "review_date": "2021-05-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Sony Pictures Animation has been behind a number of critical misfires over the years and are responsible for one of the greatest cinematic travesties of all time with The Emoji Movie. So even as someone who has enjoyed the likes of Hop andSony Pictures Animation has been behind a number of critical misfires over the years and are responsible for one of the greatest cinematic travesties of all time with The Emoji Movie. So even as someone who has enjoyed the likes of Hop and the first Smurfs, I myself am blown away by the fact that they just managed to release something that rivals the best works from the likes of Disney and Pixar. Make no mistake, The Mitchells vs. The Machines is one the freshest, most inventive, and highest quality animated films across the board to come out over the past few years.What's remarkable is that it's not even doing anything that new thematically. The premise involving a dysfunctional family coming together to stop a robot apocalypse is certainly novel and the whole thing is backed by a one-of-a-kind sense of visual flair, but the real heart of the story centered around the strained relationship of a father and daughter who simply don't \"get\" each other is nothing we haven't seen before. It even makes use of the old cliché plot device where the dad forces his family into an impromptu road trip in an effort to try and repair things.What allows the movie to achieve some emotional resonance despite this are the characters themselves. The Mitchells are a lovable group of oddball outcasts. As someone who himself has always been a bit different from everyone else and experiences his own familial woes, I related to them and their non-machine related plight in my own way. Something that was made easier by the fact that, while over-the-top, their idiosyncrasies weren't so ridiculous that I couldn't see something of myself inside each one of them.When it's not tugging on the ol' heartstrings, The Mitchells is tickling your funny bone with maximum efficiency. It fires a near-constant volley of jokes almost always hit their target without going outside the realm of family-friendly, and poke fun at things like the always plugged in nature of modern day life while critiquing the kind of problematic behavior tech companies often engage in, such as Zuckerbergian data harvesting. This is on top of providing a number of exciting setpieces that help ensure the entire experience is a zany, touching, and hilarious blast for the whole family all the way through. Unless you're among the super conservative type, in which case the presence of a gay main character will likely be a turn off.It's something of a minor tragedy that due to covid this ended up having to release on Netflix. While a huge win for the streaming service and its subscribers, this was honestly worthy of a theater ticket and I would have recommended it be seen on the big screen if only to better appreciate all of the little details in the animation itself. So if you need another reason to sign up for that monthly fee look no further. In all seriousness this may have dethroned Stranger Things as the best content on the platform.9.4/10",
            "review_date": "2021-05-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am really glad we get to see films with this much charm in mainstream media done by a big film producer, it's brilliantly written, gorgeously animated, charming and fun, one of the best things Netlfix has to offer in their catalogue, myI am really glad we get to see films with this much charm in mainstream media done by a big film producer, it's brilliantly written, gorgeously animated, charming and fun, one of the best things Netlfix has to offer in their catalogue, my main concern would be the obviously little-kid oriented jokes and skits, but apart from that is the closest thing this generation will have to their own Shrek 2.",
            "review_date": "2021-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Was waiting for this show to drop on Netflix. Funny and delightful characters. The climax gives the \"Incredibles\" vibe but it was good as a ridiculous comical ending.",
            "review_date": "2021-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Amazing movie. If you love animations, go watch this movie! This is what we expect from new animations!",
            "review_date": "2021-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was an absolutely adorable and amazing movie. I laughed, I cried, and I loved the animation and the characters were funny and they kept me entertained. I am definitely gonna recommend this for those with netflix.",
            "review_date": "2021-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Can the most dysfunctional family in the world, and an indefinable pug dog be the heroes of the day, right in the uprising of the machines? Ask the Mitchell family. This experience is a rare bird of clever animation, in which she fearlesslyCan the most dysfunctional family in the world, and an indefinable pug dog be the heroes of the day, right in the uprising of the machines? Ask the Mitchell family. This experience is a rare bird of clever animation, in which she fearlessly satirizes overuse of technology. Of the best of the genre.",
            "review_date": "2021-05-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Mitchells vs. the Machines was perfect, my favorite movie of the year so far. The animation was exceptional, just gorgeously done and I loved all the pop up things. The character designs were terrific specifically the Mitchells, Monchi,The Mitchells vs. the Machines was perfect, my favorite movie of the year so far. The animation was exceptional, just gorgeously done and I loved all the pop up things. The character designs were terrific specifically the Mitchells, Monchi, and the robots. The writing was phenomenal, the story was such a beautiful and touching story about family with a really cool twist and loved the themes of family and how we probably rely on technology to much and also the representation in the movie was superb with having the lead character, Katie, being openly a member of the LGBTQ+ community in a family-oriented movie was just refreshing to see plus the screenplay was hilarious the jokes and humor were so damm funny. Mike Rianda, Maya Rudolph, Danny McBride, Abbi Jacobson, Beck Bennett, Fred Armisen, Olivia Colman, Eric Andre, Charlyne Yi, Blake Griffin, and Chrissy Teigen gave outstanding performances also love that Doug the Pug voices Monchi. The music and music choices were excellent. This was a definite A+ movie.",
            "review_date": "2021-05-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I feel relieved when they change the title from \"Connected\" to \"The Mitchells vs. The Machines\". The older title feels like another Pixar rip-off, tbh. While, the current title suits perfectly with this movie. It is quirky and hilarious, alsoI feel relieved when they change the title from \"Connected\" to \"The Mitchells vs. The Machines\". The older title feels like another Pixar rip-off, tbh. While, the current title suits perfectly with this movie. It is quirky and hilarious, also brings back the energy from \"Cloudy with a Chance of Meatball\", which I loved.And damn the animation was awesome tho. The stylized animation and 2D-3D integration was brilliant. That was a bold move, since another studio trying to make their animation looks as real as possible.",
            "review_date": "2021-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThis movie it's a animated drama-comedy from Netflix. And this is one of best animated movies of this year. The music, the art. And the final battle. It's so epic.",
            "review_date": "2021-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThis is one of the best, creative, entertaining, hilariously animated movies I've seen in a long time.  A great movie night.",
            "review_date": "2021-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Crazy fun. Ace art. Poorly promoted and advertised but a real animation hit! Great for all the family",
            "review_date": "2021-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As dumb as it looks, as unfunny as expected.The art style is cool... kudos for that, i guess.",
            "review_date": "2021-06-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is an amazing movie with great use of modern tools! The movie is full of comedy and does not take itself seriously, and that’s what makes it great!",
            "review_date": "2021-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Story cliché and predictable. Acting over the top. Character development not thought thru or researched at all. Voice acting of the boy, worse voice acting ever been done on this earth. It was really difficult to be able to watch fromStory cliché and predictable. Acting over the top. Character development not thought thru or researched at all. Voice acting of the boy, worse voice acting ever been done on this earth. It was really difficult to be able to watch from beginning to end. I can not believe these are the same people who did spider man into the multi verse. It was a movie I wish to never see again.",
            "review_date": "2021-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "i could go on for hours how stupid, forced, cringe and cliché this movie is, but after watching this piece of **** i dont have the energy to do it.",
            "review_date": "2021-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie has great animation, a great story, and great characters. It is very funny and I highly recommend watching this movie if you liked movies such as Spider-Man: Into The Spider-Verse.",
            "review_date": "2021-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is made for kids around 12-18 that have their standard rebellious puberty against their parents, whom are portrayed as absolute dummies, hah-hah parents can't understand modern technologies like a tablet or social media, and theirThis movie is made for kids around 12-18 that have their standard rebellious puberty against their parents, whom are portrayed as absolute dummies, hah-hah parents can't understand modern technologies like a tablet or social media, and their kids are so very good at it and get characterized like they are super-smart just by knowing how to post a tweet.So many boring, standard and even sad platitudes made me quit watching it after 20 minutes.The constant stream of emoji's thrown on screen after a character's \"reaction\" also didn't help, which were absolutely dumb.I didn't laugh, smile, or even smirked during the time that i wasted on this piece of crap before i hit the exit button.The only reason this movie gets so many positive reviews is because Sony and Netflix is behind it, and they want to push it with their marketing machine.",
            "review_date": "2021-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nCreative/Modern/Hilarious and Likeable to It's main audience. Sony hasn't made the best family films of all time, but this is their crowning achievement",
            "review_date": "2021-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was amazing!! Definitely a must see!! It's great to experience a legendary movie as this one! A movie that I can recommend any of you guys!",
            "review_date": "2021-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nthis is a good movie the stop motions here is superb and the 2d is eye popping , i highly recomend this movie to watch",
            "review_date": "2021-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Love it!!!! One of the best family comedy movie I've ever watched A bigh thank you to everyone who worked on this masterpiece",
            "review_date": "2021-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wasn't able to get past the first 25 minutes. Very poorly-cast, with dialogue that has no resemblance to any sort of reality, and a super slow-moving story. Not funny and not recommended.",
            "review_date": "2021-05-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "the outdated jokes, questionable messages, unappealing animation in some scenes, and one-dimensional characters make an all-around unpleasing experience.",
            "review_date": "2021-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Mitchells vs. the Machines came up with an interesting idea and in my opinion the authors managed to squeeze this idea very well and definitely used the potential that this film had. What immediately struck me was the wonderful (I reallyThe Mitchells vs. the Machines came up with an interesting idea and in my opinion the authors managed to squeeze this idea very well and definitely used the potential that this film had. What immediately struck me was the wonderful (I really like) the animation, which is in the style of Spider-Man: Into the Spider-Verse. But it doesn't end with animation and I think the story is really nice. A family that is a bit crazy, but each character has something and each of them gets their time, which is great. I liked the main heroine the most, but the others will also get space. There's a joke here and there and the world wondered, I liked it and I laughed a few times and I'm telling you, I really don't have to do comedy. In all this, great music also appears in the film, and imagine when you have a beautiful stylization, a perfect story and even great music. That must be great, right? I would also like to say that it is and that it is a great film that I can recommend, with the family.",
            "review_date": "2021-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Amazing movie with great animation and voice actors.  Really funny and fun for the whole family.",
            "review_date": "2021-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hate that self-centered perspective of the film. Already tired of this **** from the internet.",
            "review_date": "2021-05-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "perfect[ adjective, noun pur-fikt; verb per-fekt ]adjectiveconforming absolutely to the description or definition of an ideal type:a perfect sphere;a perfect gentleman.",
            "review_date": "2021-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The most fun and laughs my family has had watching a movie together in years!  Extremely funny and very well done!",
            "review_date": "2021-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Recommended. Funny as hell than all Disney movies combined. Well made by my favorite directors.",
            "review_date": "2021-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "MasterpieceAbsolutely Worth Watching , It's Funny , emotional , action packed full blast just go for it",
            "review_date": "2021-06-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the worst movie I have ever seen it is so cringy and not funny at all. The only good thing in the movie was the dog. This was literal torture to watch, I would never put someone through the pain of watching this terrible movie. I hateThis is the worst movie I have ever seen it is so cringy and not funny at all. The only good thing in the movie was the dog. This was literal torture to watch, I would never put someone through the pain of watching this terrible movie. I hate this movie with all of my heart!!!!",
            "review_date": "2021-06-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I laughed 'till I cried!I laughed 'till I cried!I laughed 'till I cried!",
            "review_date": "2022-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A great movie. Feels like a whole movie in the first half. The only aspect I didn't like was  making a dysfunctional family funny. Mine wasn't funny, not funny at all",
            "review_date": "2021-08-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The superb writing and cast had me chuckling throughout. The animation quality is very high with a great art style to it. Fun to watch from start to finish.",
            "review_date": "2022-10-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A heartwarming, charming, and hilarious lens into a \"dysfunctional\" family surviving a robotic apocalypse from a film student's perspective. All characters deserve it own series especially those two robots.",
            "review_date": "2021-06-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Really fun movie with TONS of laughs. Seriously. Ending a bit stretched but totally watchable for fun. Villain is a bit boring.",
            "review_date": "2021-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was planning on watching this movie last year but I, unfortunately, had a lot of things and other movies that I prioritised over it. Thankfully I have finally been able to watch it this year and I am absolutely glad I did. Phenomenal andI was planning on watching this movie last year but I, unfortunately, had a lot of things and other movies that I prioritised over it. Thankfully I have finally been able to watch it this year and I am absolutely glad I did. Phenomenal and stylistic animation with eye-popping visuals. Quirky and unique characters. A meaningful and heart-warming message with wonderful characters arcs. A great music score with good utilization of songs. Excellent writing with quips and jokes that actually made me laugh.The Mitchells vs the Machines is an amazing animation film that is great for the whole family. We all heard of Pixar, Disney Animation and Dreamworks but Sony Picture Animation is showing that they are just as, or even more so, capable in the animation film market.",
            "review_date": "2022-01-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nIt has great moments and I liked the characters, but this switching styles thing just made the movie unenjoyable and hard to follow.",
            "review_date": "2022-08-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Throughly enjoyed the movie, a great kids movie that keeps you laughing and makes an enjoyable movie night for parents and kids",
            "review_date": "2021-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nI like this film a lot; quite possibly one of the most quality replayable films I have viewed in my life. Now considering myself, this is a rather unorthodox say, especially coming from me, who despises any entertainment made by 20th century people that attempts to adapt to 21st century culture. However, this film is a certain exception to that rule.Since this film is primarily comedy and more uses family relationships as a secondary plot element, that much should be very clear to absolutely any film critic who sees this, I will not be speaking from the perspective of that and instead take it in the form of a comedy, as it was intended to be during its 'Connected' era.First of all, the plot and characters are more special than one would assume, and are absolutely not 1-dimensional beings like they have been claimed as. I predicted certain events based on CWACOM 2, one of Columbia Pictures' other iconic films released in 2013, 8 years prior. Turns out I was correct in certain regards, starting off with an idol being betrayed and a protagonist turning out an outsider that is ridiculed due to public misunderstanding. Columbia Pictures likes to be subversive and inventive with whatever they come across, so typically, certain predictions were inaccurate. The basic plot is that a dysfunctional family cancels their daughter's trip to college for film in order to go on a road trip around America, then interfered by the tech uprising by proxy of a single tech company taking priority over absolutely anything technological in the universe known as PAL Labs, the obvious insincere tech company CEO-parody Mark Bowman's betrayal of PAL, the cellphone that uses the company's name, being the prime cause of the uprising in question, of which the cellphone then claims that a reason will cause her to stop exterminating humanity only to reveal later on that she is a misanthrope who overall doesn't care, forcing the family to embark on a quest to save the planet and experiencing countless, then-unresolved social conflicts along the way.Considering that, this is a very effective use and parody of all media companies and all 2000s nuclear families in general, though there are some very particular moments where the technology is basically physically impossible in function, making the film difficult to watch is a technology nerd. There may be some awkward moments featuring those parodies of the media including the filters, but in reality, that is more of an attempt to mock those filters and the people who use them than it is to act in agreement with them. This film isn't conforming to 2000s culture the same way The Emoji Movie did so by placing obvious product placements constantly, trying to remain humble in its message of corporate corruption and potential commentary of corporate intentions, only using the PAL concept for anything corporate.As for the title characters who make the film in the first place, the screenplay definitely knew the direction it was going in regards to them as well. They're definitely better than most Western characters I have seen, and my Western fiction culture count goes into the thousands. They are intended to represent a dysfunctional family, but not so much that they can't be rooted for, in that they have altruistic intentions in their actions unlike a realistic dysfunctional family, of which would likely be as misanthropic as they are chaotic. That makes them entertaining, and gives them entertaining running gags too. But the one who strikes the most interest is the outsider main protagonist, who stands out in both appearance and personality by being the rebellious teenage girl, who is also a genius film director, producer, and publisher altogether since she was an elementary school student. The one blatant lie she tells in the whole film is the one where Rick tells the family to play it safe by remaining in Dino Stop, and she motivates him with a lie after getting an idea that she believes will allow her to be able to go to college like she initially planned to do before the road trip, of course naively telling her true intentions to her brother. Later on in the film, she tries to prevent Rick from seeing this due to PAL's constant attempts to expose the Mitchells among the PALs, to no avail, and as a result, she temporarily becomes the hated among the family before reforming by saving them all with her own genius. Overall, this is one of the best modern films I have watched to this day.",
            "review_date": "2021-05-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is an almost perfect example of the digital-media-savvy movie making. Its clever writing, wonderfully knowing modern meme appreciation, and sylized art - combined with an almost counter-modern depiction of a progressive family strugglingThis is an almost perfect example of the digital-media-savvy movie making. Its clever writing, wonderfully knowing modern meme appreciation, and sylized art - combined with an almost counter-modern depiction of a progressive family struggling with the post-GFC realism. There are some truly memorable comedic moments, alongside some true heart-warming pathos. Yet at its heart is a funny road-trip movie. Sony is hitting it out of the park recently with its animated movies.",
            "review_date": "2021-10-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What we all need is some good, old-fashioned escapist fare! Right?!? What could be better than a nice, family-friend animated movie? How about an animated action-comedy about the robot apocalypse - Robocalypse? Enter Netflix with TheWhat we all need is some good, old-fashioned escapist fare! Right?!? What could be better than a nice, family-friend animated movie? How about an animated action-comedy about the robot apocalypse - Robocalypse? Enter Netflix with The Mitchells vs. The Machines. Is this just watch the therapist ordered? Here goes...The Mitchells vs. The Machines is an animated action-comedy about a typical middle-American family that embarks on a road trip to take the oldest child, Katie Mitchell, to film school in California. As it so happens, the robot apocalypse arrives in the middle of their trip. Here, Katie Mitchell is an aspiring filmmaker, always behind her camera and struggling to find her community through her artistic expression. Rick Mitchell, the father, doesn't understand Katie or anything about technology, really. The brewing tension between father and daughter bubbles over as Katie desperately wants to escape home and find her place at film school. In a bid to recapture their old bond, Rick packs up the family and plans to drive Katie to school across country as last minute family outing. As most cross-country family adventures go, the Mitchells are suffering through disappointing roadside attractions and general claustrophobia until the machines come and force the family to work together to save the world. It all happens in the way only an animated movie can do.There's a lot to recommend in this movie. First, the visual style is amazing. There is a lot of kinetic energy to the animation. You won't know where to look and the detail is inspiring. It is clever how there seems to be a mixed-media quality to the animation. It could get overwhelming at times, but it is never boring. Moreover, all of the various visual styles complement the story. Second, the writing hit the marks you would want from an action-adventure-comedy animated movie. There are sight gags that reference technology and social media. Fred Armisen and Beck Bennett play dim-witted robots, who team up with the Mitchells, and they add to the humor. Olivia Colman give a great voice-performance as the A. I. villain, who set the robot apocalypse in motion. She has the wit and mischievousness that these animated villains need. While there are some apocalypse tropes that pop up throughout, there is a lot more that feels fresh that what could be cliched does not completely derail the good time.My biggest gripe about The Mitchells vs. The Machines is that it takes a long time to get to the \"vs. The Machines\" part of the movie. There is a lot of set up. Obviously, the goal of the set up is so that the audience invests in the success of the family, particularly the rekindling of the father-daughter relationship; but, I felt that it took too long. Further, once the movie does get to the \"vs. The Machines\" part, while it is satisfying and entertaining, it also becomes too much of a good thing. At an hour and 49 minutes, the movie is too long and could have hit all of the action-comedy marks, including the emotional climax, if some extraneous things had been cut.Netflix certainly delivered with this one. The Mitchells vs. The Machines is a great family film that has nice themes about both individuality and family togetherness. There is humor and heart throughout. The action is entertaining and the animation is visually intriguing. Gather the family with a big box of popcorn and enjoy the Robocalypse.",
            "review_date": "2021-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was a truly fantastic movie. It didn't do anything new or groundbreaking, but it was whole-heartedly great all the way through. I watched it with my family and had an amazing time!",
            "review_date": "2021-05-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie itself is great with a few flaws. It’s like the directors of the movie were changed every 10 minutes. Sometimes the movie is absolutely amazing, and sometimes it’s just… well, too much of the good stuff. My main complaints is thatThe movie itself is great with a few flaws. It’s like the directors of the movie were changed every 10 minutes. Sometimes the movie is absolutely amazing, and sometimes it’s just… well, too much of the good stuff. My main complaints is that they’re trying to make it look like it’s through the eyes of Katie, the photoshop girl, but 90% of the time they do it it heavily interferes with the movie because a 2D drawing looks very out of place in a 3D animated movie. Not to mention that when they try to do that heavily, it just looks more like it was made by an amateur instead of someone trying to capture the feeling of how Katie sees the world. For example, during the “screaming monkey” joke, wich happens twice, they have it on screen for WAY too long. Its like the joke was directed by the people behind Family Guy. And although there are only a few of those out-of-place lengthy jokes, it’s almost as if they were engineered to be included in the scenes where they are most out of place. They’re trying to make it look like it’s through the eyes of Katie, but they just end up looking like someone used KineMaster to put stock-free effects over it.My other main complaint is the “family bondage in a robot apocalypse” style they’re going with. I’m not saying it was a bad choice, in fact, I think it’s amazing and a lot of times it mixes together extremely well, but a few times it’s just, well, out of place.Although, there aren’t only negative aspects of this movie. In fact, it was a pretty good movie. It’s got a great animation style, attention to detail, and although like I’ve just ranted about, the jokes are most of the time very well pulled off. The plot is good, although it’s got a lot of “why didn’t the antagonist just do this if it can do that” and “that’s almost impossibly lucky” parts, it’s not a big deal.Overall, I’d give this movie a 7. It’s like it was on path to become one of the best movies of all time, but then due to a shortage of time before the deadline they had to round some things up quickly.I’d definitely recommend this movie: although it is not a masterpiece, it’s still pretty good and worth watching.",
            "review_date": "2021-07-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Generally a pretty good family film. Story was kind of average but the humor and art style were fantastic, so I give it an 8 out of 10",
            "review_date": "2021-05-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "With it's energetic animation and a script that has the jokes flowing, this is one of the best animated movies of 2021.",
            "review_date": "2021-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautiful and hilarious, this movie is a masterpiece and I highly recommend it. Great recovery from The Emoji Movie, Sony!",
            "review_date": "2021-07-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Extremely entertaining and funny animation that creates happy moments ... This animation has a good balance between comedy and drama",
            "review_date": "2021-06-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie makes the basic daughter doesn't want to spend time with dad concept very fun and entertaining. Yeah its kinda predictable but still enjoyable. This movie is actually really funny but there are also lots of heartfelt moments. TheThis movie makes the basic daughter doesn't want to spend time with dad concept very fun and entertaining. Yeah its kinda predictable but still enjoyable. This movie is actually really funny but there are also lots of heartfelt moments. The movie includes random hand drawn type effects which look like something Katie, the main character, would add if she was making the movie herself which is really nice. All main characters are all interesting too. I definitely recommend this movie. Not sure if I should put it at 9 or 10. Probably a 9.",
            "review_date": "2021-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "AMAZING, never laughed so much in a animated movie like this, every gag is phenomenal and the graphic design is brilliant.",
            "review_date": "2021-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nfresh and fun. beautiful art style and funny af while also being sweet enough to make my dad and i cry lmao. wonderful and casual representation with no negativity in sight (other than robots being against humans lol) definitely my favorite movie now",
            "review_date": "2021-05-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is very funny, the characters are deep and they are funny, a movie that made me laugh a lot",
            "review_date": "2021-06-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Though not the best movie in the world, this movie is a really enjoyable and fun animatic that is good for all ages. Viewers can actually relate to this movie instead of the terrible Emoji Movie that was sent down from Hell to torment us intoThough not the best movie in the world, this movie is a really enjoyable and fun animatic that is good for all ages. Viewers can actually relate to this movie instead of the terrible Emoji Movie that was sent down from Hell to torment us into insanity. I definitely recommend you watch this movie if you like/love the action and comedy genre.",
            "review_date": "2021-06-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Easily, the best animated movie of this year. Another victory from the Lord and Miller duo, and for Sony Pictures Animation. They're on their right path of making animated movies.",
            "review_date": "2021-07-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Although the humor of The Mitchells vs The Machines is not for everyone, a good story, impeccable music and perfect animation are enough to enjoy this movie.",
            "review_date": "2022-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was an absolute delight and I was definitely pleasantly surprised when I watched it. A fun family movie full of heart and connection, sometimes without too many words. It was all in the feelings which was carried beautifully. Also,This movie was an absolute delight and I was definitely pleasantly surprised when I watched it. A fun family movie full of heart and connection, sometimes without too many words. It was all in the feelings which was carried beautifully. Also, had some subtext if you're willing to pay enough attention.The animation was brilliant, bright and exciting. The characters were sweet and relatable but sometimes just annoying, which makes them even more relatable because that's kind of how people are. A thoroughly pleasing and enjoyable experience and with a whole lot of re-watch value. Plus, the music was perfect.This movie surely made me question how underrated Sony movies are because I think they do a lot of good work - especially by taking risks. This movie was off an original script with no franchise backing but was pulled-off beautifully.",
            "review_date": "2021-12-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great art style (spiderverse) and a fun story about rogue AI. Since it is a netflix original animation I wasn't expecting much; but, this film could have easily be released on theaters and be worth it.",
            "review_date": "2021-12-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Considering, still left the Pixar's movies, this will be the best animated movie of the year.",
            "review_date": "2021-12-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Just a good-ass and very funny film. Nothing much else I need to say. But sometimes it can be predictable and the jokes in the second half of the film can be hit or miss.",
            "review_date": "2022-01-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is a close ten (and it's my second favorite movie of all time). Let's start off with the things I love about this movie. The animation is brilliant, the characters are hilarious, the jokes are funny, the story is good, most scenesThis movie is a close ten (and it's my second favorite movie of all time). Let's start off with the things I love about this movie. The animation is brilliant, the characters are hilarious, the jokes are funny, the story is good, most scenes are really heartwarming, the furby scene made me laugh out loud, the villain is good, the message is nice and I could go on and on about how many good things I love about this movie. And the only problem I had with this movie was that one of the effects got a bit annoying. But its understandable why they were in the movie, because the movie revolved around Katie (she likes putting annoying effects into the movies she makes). And that's the only problem. Nothing else. This movie is brilliant, and I actually preferred this than into the spiderverse, but that's my opinion. Anyways watch this movie, it's beautiful.",
            "review_date": "2022-03-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A fun, different movie, too bad it didn't get the oscars, that it deserved based on the others movies.. yeah it wasn't a really great year for animation",
            "review_date": "2022-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "There Are Some Mature Themes Like Many Other Phil Lord And Chris Miller  Movies But It's Still Fun For Families",
            "review_date": "2022-05-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I love animated movies anyway, and this movie is perfect, the main characters are very funny and have their own personalities.",
            "review_date": "2022-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Has some really strong moments but is ruined by some extremely annoying attention seeking characters. The creators are begging to keep your attention with loud noises, wacky colours, and quirky characters.",
            "review_date": "2022-07-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was very pleasantly surprised by the wonderful mixture of clever humor and heart.$1 to buy a Netflix account, Google search: vtvshare",
            "review_date": "2022-08-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Another hit from Lord and Miller. Great animation, story, and some very relatable and likable characters.",
            "review_date": "2022-11-24",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 120
}