{
  "title": "Zack Snyder's Justice League",
  "rating": 8.4,
  "release_date": "2021-03-18",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi",
    "Fantasy"
  ],
  "summary": "Determined to ensure Superman’s (Henry Cavill) ultimate sacrifice was not in vain, Bruce Wayne (Ben Affleck) aligns forces with Diana Prince (Gal Gadot) with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions. The task proves more difficult than Bruce imagined, as each of theDetermined to ensure Superman’s (Henry Cavill) ultimate sacrifice was not in vain, Bruce Wayne (Ben Affleck) aligns forces with Diana Prince (Gal Gadot) with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions. The task proves more difficult than Bruce imagined, as each of the recruits must face the demons of their own pasts to transcend that which has held them back, allowing them to come together, finally forming an unprecedented league of heroes. Now united, Batman (Affleck), Wonder Woman (Gadot), Aquaman (Jason Momoa), Cyborg (Ray Fisher) and The Flash (Ezra Miller) may be too late to save the planet from Steppenwolf, DeSaad and Darkseid and their dreadful intentions.… Expand",
  "critic_reviews": [
    "It shares a vague shape and a handful of specific, linchpin scenes with its predecessor, but everything about it lands differently: characters that were previously empty or ludicrous now have real grit and depth, while action sequences that were once incoherent, lightweight and garish now number among the most thunderously spectacular in the genre.",
    "This film is gorgeous, massive in scope, well-written, and superbly acted. It goes beyond being a Michael Bay-explosion fest and definitively transcends action and destruction porn. This is a real movie. Every single issue I had with the original release is fixed—everything from pacing, cinematography, acting, characterization, and even the film’s score.",
    "The new movie — and make no mistake, it really is a new movie — is more than a vindication of Snyder’s original vision. It’s a grand, nimble, and immersive entertainment, a team-of-heroes origin story that, at heart, is classically conventional, yet it’s now told with such an intoxicating childlike sincerity and ominous fairy-tale wonder that it takes you back to what comic books, at their best, have always sought to do: make you feel like you’re seeing gods at play on Earth.",
    "It's so bombastic that it makes \"Batman v. Superman: Dawn of Justice\" seem modest.",
    "Snyder’s Justice League is more, more, more in a way that most films wouldn’t dare, and, after a year of no theaters at all, a movie that makes me long to return to a multiplex—to see more movies that commit so completely to a vision that it’s impossible not to be swept away.",
    "It's a fascinating exercise and superior to its predecessor, but clocking in at four hours, the operatic highs are somewhat offset by the lack of any pressure to say \"cut.\"",
    "Zack Snyder’s Justice League is a surprise vindication for the director and the fans that believed in his vision. With a mature approach to its superhero drama, better-realized antagonists, and improved action, Snyder’s version of Justice League saves the movie from the dustbin of history.",
    "Snyder’s film may be exhausting but it is engaging. Justice is served.",
    "Like Superman when he’s first brought back to life, the new Justice League isn’t necessarily better than the original, but it’s different and darker, markedly so.",
    "Is all the sound and fury worthwhile, the four years of championing, the four hours up on the screen? To the fans who’ve been in it for the long haul, of course. To HBO Max executives, you bet. To casual moviegoers, probably not.",
    "Zack Snyder’s Justice League may not be a great film, but it has the madness, strangeness and obsessiveness of a real work of art.",
    "It is still by no means a great film, even compared against the standards of contemporary superhero cinema, which is bleeding any sense of individual artistry and purpose each passing year. But it is a wild, invigorating experiment to experience.",
    "As a gift to those who’ve stuck with him through changing trends in the genre, the director’s vision gets its freest reign in this four-hour director’s cut, boldly titled Zack Snyder’s Justice League and thus asserting authorship under what’s become not so much a genre of cinema as it as an entire mode of production, corporately controlled and split over hundreds of FX artisans in post. And while still bearing a few unfortunate marks of industrial cinema (like almost all of The Flash’s painfully lame jokes from the studio-bungled theatrical cut being kept intact), this title is earned.",
    "The film isn’t without its pleasures; it’s fun to see Aquaman and Wonder Woman beat people up and smirk afterward. I didn’t realize that watching Superman blow on stuff and freeze it with this super breath was something that would bring me immense happiness. And I’ve sunk an afternoon or more into video games in the past. But it would’ve been nice to see Snyder knock this out of the park and supplement his eye for visuals and his unique style with a story that had a bit more soul, especially with his very rare $70 million second chance.",
    "God willing, this will be the last ever superhero team-up movie. I wouldn’t count on it though. Even when it’s a relative improvement over its predecessor, it’s still pop-culture slurry for babies.",
    "It’s rough, messy, and overlong, but may well capture the well-intentioned spirit of what it’s trying to do better than the compromised version we got at release. It may even be something I revisit in the future — just maybe not all in one sitting.",
    "Zack Snyder’s Justice League is excessive and overlong to the point that trimming anywhere up to an hour would have elevated it significantly, but it’s still a triumph of circumstance, style and execution.",
    "The Snyder Cut has its share of problems — when you get the best of Snyder, you also get the worst — but it’s an undeniably passionate and moving work. It earns its self-importance.",
    "Though suffering from its own shortcomings, Zack Snyder’s gargantuan Justice League is a commendable improvement on the widely derided original. Stock up on snacks.",
    "For long stretches, Zack Snyder’s Justice League feels more like a rough assembly than a director’s cut. It appears to include every single shred of footage Snyder shot, no matter how superfluous to the story. It will absolutely delight the hardest of hardcore Snyder heads. I’m not sure how more casual viewers will react to a longer and bleaker version of the same movie they already saw and dislike.",
    "In fact, “very dumb and very enchanting” could sum up Zack Snyder’s Justice League as a whole. There was never a single moment where I bought the story Snyder was selling, but I did enjoy his attempt to create a superhero movie that rises above the din.",
    "Snyder’s Justice League is an entertaining if overlong superhero flick in its own right. If this is the last DC film Snyder directs, it’s a satisfactory exit.",
    "Watching Snyder’s intermittently rewarding epic—if nothing else a spectacle of completed vision—stirred up surprising emotions. Not about what happens to the people (and aliens) in the film, but about what happened to its maker, and to the course of human events while Justice League 2.0 wrestled its way into being.",
    "Zack Snyder superhero movies are the black licorice of cinema: Those who like the taste can’t understand why everyone doesn’t, and those who don’t like the taste grimace at the thought. And now the streaming wars and online clamor have brought us Zack Snyder’s Justice League. It’s four hours of black licorice.",
    "The bottom line: If you know what the Anti-Life Equation is, this movie was made for you and you might enjoy it. If that sounds like comic book gobbledygook to you, it’s safe to say you won’t be missing anything by not giving up four hours of your life to sit through this.",
    "Ultimately, Zack Snyder’s Justice League feels like just another name for a Special Edition Blu-ray that contains all the scenes.",
    "I’d love to say it isn’t half-bad, but I can’t, because it is. It’s roughly 50 percent bad.  The other 50 percent is better than that, even with a running time that threatens to never stop not stopping.",
    "All of which add up to a “movie” that’s a lot closer to “content” than to cinematic art, or even a movie that inspires, thrills, touches or moves.",
    "This often absorbing opus can be as mighty as Superman himself, but a lack of restraint proves to be its Kryptonite.",
    "If you’re looking for a brisk, compelling story, maybe not. It’s as if there is a third version of this film, something in between the two in terms of tone and fan service, that would be the best way to tell this story. That’s unlikely to happen, of course. How many “Justice League” movies do we really need, anyway?",
    "ZSJL is a fan cut as much as it is a director’s cut, with all the indulgence that the notion applies. As for any continuation of the story, as the fans hope, that seems gravely unlikely considering the direction Warner Bros is headed. But for a director who had to abandon his grand superhero project because of a family tragedy and because a big movie studio tried to wrestle control of the film, which was too much to bear at the time, one supposes, this postmortem collectible for die-hard, is about as good as an outcome as one could get.",
    "Despite everything, it has its fair of shining moments. There's a clear direction Snyder's Justice League has that the 2017 version of the film does not, and for that alone viewers can appreciate this film a whole lot more because of it.",
    "The reality is that Justice League’s problems go beyond who was behind the camera. The villain is still generic and silly-looking. The plot is still assemble-the-team boilerplate, hinging on the hunt for glowing MacGuffins with a goofy name.",
    "The overall arc of this “Justice League” coheres throughout, providing occasional dashes of intrigue and inspired visual conceits, and sometimes it’s even fun. Re-centering the drama around ostracized actor Ray Fisher as Cyborg, and drawing out some of the ostentatious fight sequences to their breaking point, Zack Snyder’s Justice League displays genuine effort to make this impossible gamble click.",
    "It’s just a really long, more coherent version of that story. I certainly didn’t hate it like I hate the prior version – and, admittedly, I do like it more than Batman v Superman – but all the character motivation in the world still doesn’t help the foundation the whole thing is built on.",
    "Yet even compared to the glacial Marvel-Netflix Dramas, Zack Snyder's Justice League is a chore. At the end of the rainbow, viewers are left with the promise that the actual cool things will happen next time. This cut is no worse than the theatrical edition, but it sure is longer. \"So begins the end,\" Steppenwolf declares. When he says that, there is one hour left.",
    "If you’re not a #ReleasetheSnyderCut signee, you’re still better off watching the original, patchy as it is. At least it’s short.",
    "This cut isn’t going to win anyone over — it’s a self-serious sermon to the converted that isn’t terribly concerned with getting the audience to like its characters — but it all goes down much smoother than the theatrical cut, which feels garish and jagged by comparison.",
    "What Snyder has contrived here feels less like a vital re-energization of the form than a ponderous guided tour through a museum’s worth of familiar superhero-movie tropes and conventions: Look at this, look at that, try not to look at your watch. Like the Flash himself, Snyder wants to slow time to a crawl, to deconstruct every gesture, to make his obsessions your own. He wants the movie to go on forever. Mission accomplished.",
    "Zack Snyder’s Justice League may feature altered scenes from its chopped-up counterpart, but it’s unlikely to play any differently to general audiences — apart from feeling like more of a slog. Its mere existence guarantees that someone, somewhere will be satisfied, but the film’s improvements are hardly enough to fix what was, now quite apparently, a flawed endeavor from the start.",
    "The Snyder Cut: Still a mess, now a million years long.",
    "Hope isn’t manufactured. It can’t be limited to a shadow of a gesture or shouldered by one man whose extraordinary abilities are heralded in the “super” of his name. And it’s definitely not in the cinematic equivalent of a four-hour-long cut scene.",
    "The movie's soul, such as it is, remains unimproved, and at 242 minutes, very few of them offering much pleasure, it's nearly unendurable as a single-sitting experience. If it were watched in parts — title cards identify six chapters and an epilogue, and some rumors suggested it would be released as a series — those segments would fail to deliver the shapely balance of energies and pacing that one expects these days from even a merely competent TV show.",
    "How would “Slightly less terrible!” look on a poster? That is my approved quote for Zack Snyder’s Justice League, a perverse exercise in fanboydom on HBO Max that tacks on two extra hours of footage to a maligned 2017 DC Comics movie to create a kind of new, still-bad movie.",
    "The film could be taken as an intentional travesty of the superhero genre, if only it weren’t so tortuously tedious.",
    "It is a grind, it is a slog, it is a bore—it’s a mental toothache of a movie, whose ending grants not so much resolution as relief."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "What a long road to get this cut of the justice league. And boy, oh boy does it improve on the teatrical version. Story, main villain it's so much better it provides lots more clarity & cohesion to these beloved heroes and their struggle,What a long road to get this cut of the justice league. And boy, oh boy does it improve on the teatrical version. Story, main villain it's so much better it provides lots more clarity & cohesion to these beloved heroes and their struggle, rooting the action in intense stakes. My friends still can't believe that WB said no to this version. This project has taken the blood, sweat & tears of millions of fans & people associated with it. Celebrate my friends!!!",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "How the Joss Whedon theatrical version was approved by WB is beyond me.  Zack Snyder gave us 4 hours of what will be known as the best comic book movie. Looking forward to seeing more DC from Zack!  Make it happen WB!!",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Thank you Zack Snyder!",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Worth the wait. Years of wanting it to come out, we were rewarded. Masterpiece.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "First of all this movie is not for the kids who only expect action and comedy from movies.. this movie is for the mature audience who expect drama and plot twist from a movie!Gotta say that this is the best DC Movie I ever seen. CharacterFirst of all this movie is not for the kids who only expect action and comedy from movies.. this movie is for the mature audience who expect drama and plot twist from a movie!Gotta say that this is the best DC Movie I ever seen. Character development at the highest peak!And shows emotional level of every each character! The plot is very interesting. One of the best story driven comic book movies of all time! Can't believe Snyder directed this masterpiece even he's not getting paid! #ForAutumn #AFSP",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excelente película la disfrute mucho un algo excesivo de escenas slowmotion pero todo bien",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Epic movie an absolute must see far better than the 2017 version and one of the best comic book movies ever",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An absolute masterpiece. Years from now Snyder Cut will be celebrate as cult and a turning point in movies history and its industry!! A must see event, a lesson on how to bring comic books to the screen (big or small)!!! Thank you Zack forAn absolute masterpiece. Years from now Snyder Cut will be celebrate as cult and a turning point in movies history and its industry!! A must see event, a lesson on how to bring comic books to the screen (big or small)!!! Thank you Zack for not giving up!",
      "review_date": "2021-03-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you love Snyder's movies you'll definitely love this one. If you want something light hearted and fun, it could also work for you but I'm not sure as tastes vary from people to people. All in all it was worth the wait.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dream fulfilled. Watching the full 4-hour movie without pausing, so excited that this version is finally released.",
      "review_date": "2021-03-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely astonishing! This movie is everything it was supposed to be and more, completely blows away Josstice League out of the water and keep in mind that this movie is its own thing.The storytelling is coherent, the build-up to the grandAbsolutely astonishing! This movie is everything it was supposed to be and more, completely blows away Josstice League out of the water and keep in mind that this movie is its own thing.The storytelling is coherent, the build-up to the grand scheme of things is excellent, the score is hopeful and heart-warming, every character has their own arc and the character development between the team is handled masterfully. The 4 hrs. will just dissappear that in the end you will yearn for more!",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A masterpiece from start to finish, all of it is EPIC!#RestoreTheSnyderVerse",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely MasterpieceZack's Vision  is better and superior to JL 2017Best DCEU MOVIE till date #restorethesnyderverse",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I really like this movie because it has to be what it is and thanks to Zack Snyder.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The one of the best superhero movies ever period. It shows what true director's vision can do",
      "review_date": "2021-03-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Everything the DC stands for, is this movie. I'm glad it happend. Also, I'm happy for Zack Snyder, he deserved this, after Warner played him. This is a GOOD superhero movie.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "#ZackSnydersJusticeLeague is the culmination of passion, vision, and dedication. Every bit the mythological narrative deserving of DC characters, yet somehow grounded and poignant. From the music to the cinematography, the #SnyderCut lives up#ZackSnydersJusticeLeague is the culmination of passion, vision, and dedication. Every bit the mythological narrative deserving of DC characters, yet somehow grounded and poignant. From the music to the cinematography, the #SnyderCut lives up to, and exceeds the hype. It's is Snyder's magnum opus, with the maturation expected of a seasoned director, palatable to even the most finicky tastes. 5⭐",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is better than previous movie. It was good to watch this movie. There are a lot of new things to watch.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Всем бобра! Я человек простой, вижу фильм без навязывания меньшинств - ставлю высокую оценку.Миру нужно творчество, а не проблемы отдельных индивидов которые считают что им все и всё должны.Всем бобра! Я человек простой, вижу фильм без навязывания меньшинств - ставлю высокую оценку.Миру нужно творчество, а не проблемы отдельных индивидов которые считают что им все и всё должны.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Such an epic journey from start to the end in the completely story driven epicness which doesn't get you bored for a second. A four hour worth it experience where every thing is explained completely with amazing back story explanations and aSuch an epic journey from start to the end in the completely story driven epicness which doesn't get you bored for a second. A four hour worth it experience where every thing is explained completely with amazing back story explanations and a villan who has a purpose. Please do watch cause it's totally worth it.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the movie we should have had in 2017! It's 4 hours of Justice served! #RestoreTheSnyderVerse",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This cut is 1000% better than Whedon's. No cheesy lines, no mustache-gate, no non-sense. I can watch 40 more hours of this. This movie is so good!!! I NEED A SNYDERVERSE!!!",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Zack snyders justice league is a fantastic movie with a compelling story. Its everything a dc fan could ever want. Let's hope the snyderverse gets restored so we can see snyders whole vision reborn",
      "review_date": "2021-03-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Major improvement from Whedon's version of the Justice League. The story was much better and tightly written. The villain Steppenwolf was much better and well fleshed out. The soundtrack was much better and the action scenes were betterMajor improvement from Whedon's version of the Justice League. The story was much better and tightly written. The villain Steppenwolf was much better and well fleshed out. The soundtrack was much better and the action scenes were better directed and were more creative.",
      "review_date": "2021-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Let’s say this straight... this is an epic. Don’t go by negative reviews...just experience this movie and you will definitely enjoy it. #Restore the Snyderverse",
      "review_date": "2021-03-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I loved it, best version of justice league.  unfortunately it was not the one that made a big debut in cinema.  I just wanted John as a green bar",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Filme épico, na medida em que prepara o 3⁰ ato de maneira singular com cada personagem. Personagens estes que têm seu desenvolvimento garantido de maneira mais eficaz e aprimorada.Trilha peca em algumas cenas por não acompanhar o ritmo, foraFilme épico, na medida em que prepara o 3⁰ ato de maneira singular com cada personagem. Personagens estes que têm seu desenvolvimento garantido de maneira mais eficaz e aprimorada.Trilha peca em algumas cenas por não acompanhar o ritmo, fora isso temos um excelente e executado filme que se propõe a ditar a que veio: super heróis em ação!",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "La mejor película de super héroes de la historia, es simplemente fantástica y épica, muchas gracias Zack Snyder.",
      "review_date": "2021-03-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Finally. Haven't enjoyed a super hero film that much in years. A real story, that feels authentic and intriguing.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Haters, Snyder se ha sacado la chorra y se las ha metido con todo y bolas :))))",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A 4 hour long superhero epic that is so entertaining and so well paced it feels like it lasts 1 hour. This is what 2017's Justice League should have been like.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Esse é um dos melhores filmes e herói. Snyder entregou tudo que os fãs queriam, um filme muito bom comparado com o 2017. Vemos um filme mais coeso, que busca nos mostrar tudo até chegarmos ao final. O final tem um gancho para uma continuação,Esse é um dos melhores filmes e herói. Snyder entregou tudo que os fãs queriam, um filme muito bom comparado com o 2017. Vemos um filme mais coeso, que busca nos mostrar tudo até chegarmos ao final. O final tem um gancho para uma continuação, mas pelo que tudo indica, não teremos. O bom do filme é que ele é divido em partes, algo que pessoas que não gostam de filmes muito grandes adoraram. Muito obrigado Zack, vou entregou tudo que nós fã queríamos.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "MIND BLOWN ! I never really cared for a DC team up until this ... so many threads to pull .. a lot of complex interactions and EVERY character matters .. just brilliant!",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Best Movie. Snyder. You are the man. É muito bom ver cada detalhe desse filme, a cada cena uma lágrima escorria e não era de tristeza, e nem de felicidade, era uma coisa que eu não consegui identificar, é uma obra de arte, e isso meThe Best Movie. Snyder. You are the man. É muito bom ver cada detalhe desse filme, a cada cena uma lágrima escorria e não era de tristeza, e nem de felicidade, era uma coisa que eu não consegui identificar, é uma obra de arte, e isso me emocionou.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Muito bom. Deixa no chinelo a primeira versão. Obrigsdo Zack. Uma nova leitura, um pouco longo, mas vale a a pena experiência, apesar de no Brasil o filme estar muito caro.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"I'm a fan and I want fan service\" - Erico Bordo. And this movie DELIVERS it! As a long time DC fan, this movie is a masterpiece. THANK YOU ZACK SNYDER! I hope we get a sequel.",
      "review_date": "2021-03-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAs for me, the last 20 minutes are superfluous, except for the scenes with the Joker and Deathstroke.  And the scenes with Batman's nightmare, the future with the seizure of land and the killing of almost all members of the league are masterpiece.  That and all of Darkseid's stills are nearly the best in the movie.",
      "review_date": "2021-03-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was a totally different movie, that should have originally came out. I didn’t expect it to be this good all of the character where fleshed out, and you cared about them. Mean while the 2017 justice league I did not care about anyone,This was a totally different movie, that should have originally came out. I didn’t expect it to be this good all of the character where fleshed out, and you cared about them. Mean while the 2017 justice league I did not care about anyone, because they all felt dull, and the movie felt rushed. I really hope Warner Bros. Brings back Zack to make the sequel, honestly Warner bros needs to give zack full authority over the DCEU, make him the Kevin feige of the DCEU.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Epic!  10x better than the original.  Much better character and story development , incredible action but with much stronger buildup.   The original was just a quick hit action flick.   This is much more true of an epic comic series.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is an amazing movie and clearly shows that WB **** up. Given full creative control Snyder can make an amazing movie. The saddest part of the movie is knowing that his plan won't ever come and I see it as one hell of a waste.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a completely different movie than the abomination that was released in theaters. In the theatrical release, Cyborg barely has 6 lines and the Flash has no purpose besides comedic relief. Whereas in Snyder's cut they are fully fleshedThis is a completely different movie than the abomination that was released in theaters. In the theatrical release, Cyborg barely has 6 lines and the Flash has no purpose besides comedic relief. Whereas in Snyder's cut they are fully fleshed out and interesting characters. If Warner Brothers had half a brain they would let Snyder continue his trilogy and stay the hell out of his way.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quedó muy buena la wea!!. Deberían continuar. Aguante la liga de la justicia wn!.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSnyder cut reviewHalfway through, at chapter 4So this part of my review halfway through. The characters are all improved and better. All the arcs have been taken great care of by snyder. The only exceptions would be the Lois Lane arc and the Commissioner Gordon character. Seeing the back story Cyborg was amazing and really puts him front and center to set up an amazing arc. Having Barry's arc more fleshed out and developed was good but not too much to save more for his feature film. There are alot of scenes I would have preferred been cut, and alot Iike in the movie that really should have been in the 2017 one. I feel like more of the scenes added are likable than unlikable, and really there aren't alot of unlikeable scenes just unnecessary ones. I also feel that the intro scenes and cgi are at times tacky but not to the point where it drastically ruins the film just something to cringe or laugh at. Chapter 3 so far has been my favorite one because we can see all the characters start to come together and blend into each other's arcs. Steppenwolf isn't a major improvement but the motives and reasons for him to be there along with the overall realization that darkseid might be the main villain is really interesting and draws you closer to being interested in the villains. I am now starting chapter 4 at exactly 1:51:35.Part 2. The final battle was the exact opposite of the 2017 cut version. It utilizes every character to have a role. What flash did at the end opens a whole realm of possibilities not possible with the 2017 cut and if this is made the cannon cut then the flash film will have so much more to build on. Darkseid needs to return as well. And Jared Leto can play the joker when given a good script and he **** did it. The joker he played here was **** amazing. Batman and superman mirroring each other in the battle was amazing and the way they lead this team was awesome. Diana and Aquaman's ass kicking boss fight was **** great, cyborg has had the greatest role in this film and Ray Fisher needs to return to this character. This movie is the greatest comic book movie of all time. Zack Snyder took these characters and ran with them. He blended in the most surreal dark aspects of the DC universe possible and he created a wonderful film that really makes you appreciate both the original 2017 cut, and the entire DC extended universe even more. Yes this movie has unnecessarily long drawn out sequences yes it some bad cgi here and there yes there are a few cringe lines of dialogue, but this is honest to God the best super hero movie I have ever seen. Snyder cut needs to be cannon and we need a sequel.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best superhero movie ever. Beautiful spectacle with meaningful mythological characters instead of the brain washing comedy WB insists on making",
      "review_date": "2021-04-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing movie. Don't listen to the stuck up critics, this was made for the fans and Zack Snyder hasn't let them down.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing!! All people who watched JL must see this movie!! The real JL, better than any other DC movie!!",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a masterpiece. I loved every single minute of it, four hours gone like it was seconds. I end up craving for more. Thank you Zack Snyder!",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Un Poco larga pero vale la pena ver está película bque culmina una excelente historia",
      "review_date": "2021-03-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you're a fan of comics and dc this is for you. Is it dark? Yes. Is it long? Yes but it adds much more depth. 2 things that are slight off is some of the music \"pick of songs and volume level\" and potentially no sequel after falling in loveIf you're a fan of comics and dc this is for you. Is it dark? Yes. Is it long? Yes but it adds much more depth. 2 things that are slight off is some of the music \"pick of songs and volume level\" and potentially no sequel after falling in love with movie.  Don't trust critics some are mcu fan boys and some just hate this was made for fans. It has 6 points you can stop and pick up later if need be. If you can give it a shot.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Superior a la versión original, si es larga pero todo vale la pena aun asi esto necesita mas entregar para responder preguntas",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I recognize that while we have been treated to a new level of excellence in the genre over the past decade, the majority of what is released, especially by DC comics, is simply another comic book movie.  While this film is largely the sameI recognize that while we have been treated to a new level of excellence in the genre over the past decade, the majority of what is released, especially by DC comics, is simply another comic book movie.  While this film is largely the same story as the original theatrical release only at twice the duration make no mistake; this is not just another superhero film.  The additional footage is seamlessly added to the original journey of Bruce Wayne to recruit more heroes to face an imminent threat from an ancient, interstellar threat.  True humanity, global stakes and high drama contribute to the scope of what can only be described as a proper epic.    Justice League was written by Chris Terrio, Will Beall, and Zack Snyder and directed by Snyder.  It stars Ben Affleck, Henry Cavill, Gal Gadot, Ray Fisher, Jason Momoa, and Ezra Miller as the heroes of the Justice League.  Supporting characters include Amy Adams as Lois, Jeremy Irons as Alfred, Connie Nielson as Queen Hippolyta, Joe Morton as Silas Stone, and Amber Heard as Mera.  Jesse Eisenberg and Jared Leto reprise their villainous roles of Lex Luthor and the Joker in brief.   Again, the story opens with a world in mourning over the death of Superman, and Bruce Wayne’s impossible quest to find more super-powered beings to protect the planet in the absence of Kal-El.  Diana has also returned to her life as a simple museum researcher, only occasionally appearing as Wonder Woman to battle pockets of terror as they appear.  Unknown to them both, the threat to Earth is beyond imminent, and the need to build a team of strength and number is already at hand.  Steppenwolf, a warrior of immense power from outside our galaxy has come to the island of Themiscyra to pry from the Amazons a “Mother Box.”   This is an ancient item of mystical strength that when paired with two other boxes in the possession of Atlantis and surface humans, will foretell the return of world-conqueror Darkseid.  Steppenwolf does indeed procure the first box from the Amazons and quickly turns his attention to Atlantis, and the surface world, to obtain the final two, and bring sure destruction to the planet.   The additional time is not wasted in this film.  Yes, it feels like a four-hour movie, and you will sometimes wonder if the new material is what you have seen before, for the genius of editing.  Great care is given to the introductions and origins of Flash, Cyborg, and Aquaman.  The additional footage of these characters becomes absolutely critical to the film and one will not be able to view the origins presented in the first film without knowing so much is missing.  The family and romantic ties of these three newest Justice Leaguers is often tender, and sometimes enraged.  These become not only characters in a film, but flawed and frightened human beings uncertain of their roles in the larger world nevertheless a superhero team.  Supporting characters such as Lois Lane, Alfred, Gordon, Martha Kent and Mera are also expanded to connect them to the larger epic.  One can sympathize with Ray Fisher’s displeasure when the true level of how much his character had been abridged in the theatrical release is realized. The new movie no longer begins with the low droning “Hallelujah” of the original release, although a variation of the song appears in the end credits.  Instead, the earlier scenes revealing the many characters are beautifully framed by the haunting chords of lovely folk-style music in full harmony.  This is one of the most remarkable soundtracks in recent memory, both mellow and intense, and leading to a powerful score toward the later battles.  We are treated to more respectful effects, from the appearance of Steppenwolf, to the vast apocalyptic landscapes created slowly, branching out to much larger visions.  The extra time given to cinematography is not wasted.  The saga of Superman and his rebirth is also given the time it deserves, simplified by a more thorough explanation, and given much higher drama as a result.   The love of Zack Snyder for this world and these heroes, however, is the heart of the story.  Zack is responsible for the cinematic entry of 300 of course, as well as many of the contemporary entries of the DC Cinematic Universe.  Justice League, this cut, the Snyder Cut, is very clearly his opus.  Epic in its scale, this is a superhero movie that takes itself seriously, even more so than the Infinity Saga and Endgame with all of their death and despair.  Even Dark Knight wasn’t “so serious” after all.  Snyder’s triumph isn’t in just making a better Justice League movie, but in making the one we deserved all along.  It's not only his obvious love for the humanity of these characters he plays with that endures, but his clear love for the humanity of the audience.  I think I would like to see many more superhero films taken this seriously.  Hopefully Warner Brothers, and even Disney, is paying attention.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was a hell of a lot better than the original. It was long, but a lot of fun. This 4-hour movie kept my attention better than the 2-hour one. That's a great achievement. I hope this will be an example going forward where the movieThis was a hell of a lot better than the original. It was long, but a lot of fun. This 4-hour movie kept my attention better than the 2-hour one. That's a great achievement. I hope this will be an example going forward where the movie companies should listen to the director's vision.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great visualization / sets / color / story / character dev / build up / cinematography Hollywood execs should take risks and stay out of the creative aspects of movies.Snyder captured a powerful 4 hour film. So many great moments for eachGreat visualization / sets / color / story / character dev / build up / cinematography Hollywood execs should take risks and stay out of the creative aspects of movies.Snyder captured a powerful 4 hour film. So many great moments for each character. No cheesy oversaturated scenes. It was mature and brutal. Amazing",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While I had hoped this movie's 4 hour runtime would mean a little bit more character development and setup than we got, It still is a really fun ride. I do not think its necessarily as thematically strong as something like BvS, which wasWhile I had hoped this movie's 4 hour runtime would mean a little bit more character development and setup than we got, It still is a really fun ride. I do not think its necessarily as thematically strong as something like BvS, which was already an overstuffed story, but here it is excusable given the sheer amount of characters needing introductions in this story. Given those constraints, the movie does a pretty good job. The first half can feel rather sluggish given the many slow motion scenes and the sequences of scenes may seem choppy, but once the movie starts to pick up, it REALLY picks up. Some of the coolest comic book movie moments occur with these beloved characters as the movie continues. Despite all of its flaws, I think this movie is guaranteed to entertain you, put a smile on your face, and make you feel for these characters. The runtime is a big deterrent to most people, and I do think there is probably a three hour version of this movie that is really well paced and still as strong in its character development and themes, but if you are on the fence, definitely give this movie a watch.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The critics are either high or getting a pay off from Disney or both.  This is much better than the original and even though it was four hours, it was four hours of very captivating story arcs. Very well written, directed, and acted movie.The critics are either high or getting a pay off from Disney or both.  This is much better than the original and even though it was four hours, it was four hours of very captivating story arcs. Very well written, directed, and acted movie.  Best DC movie yet.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This Movie Is Masterpiece, Forget The Theatrical Cut And Enjoy The Best Superhero Movie Ever Made!",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "So many times better than the original in every single way! Well done, Snyder.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Four hours of pure awesomeness! This is the shortest four hours I have invested in watching a movie! Zack Snyder should have his chance to complete his DC vision!",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There has to be sequels of this movie, it's just mind boggling I don't have much words to describe how good it was, not only the Justice League is restored but it's Reunited. Cyborg, The Flash and Aquaman aren't there just to fill up theThere has to be sequels of this movie, it's just mind boggling I don't have much words to describe how good it was, not only the Justice League is restored but it's Reunited. Cyborg, The Flash and Aquaman aren't there just to fill up the team. The Zack Snyder's Justice League is a must watch and it's Outstanding and I'm proud to be a DC Fan as for all the support we gave and petitions we signed was worth it.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Besides a little continuity error in one line of dialogue between Aquaman and Mera with regards to the later Aquaman movie, this is the movie we were promised so long ago that everyone really wanted to see. I'm happy I finally got to see it.Besides a little continuity error in one line of dialogue between Aquaman and Mera with regards to the later Aquaman movie, this is the movie we were promised so long ago that everyone really wanted to see. I'm happy I finally got to see it. I enjoyed it. Though doubtful, here is hoping we get to see a sequel.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Love it! Way way better than theater version; specially what Snyder did with all the hero’s was amazing better introductions and my beloved Batman ain’t getting a @ss whooping all the time, in this one he’s the @ss kicker!",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I remember being depressed after seeing the effed up version back in 2017, after finally seeing this movie, its like a part of life has been restored.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is awesome. You really need to see this movie!!!!this film can give me goosebumps,and for sure this film has good film elements and an epic storyline",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIt one of the best movie that I've seen in a long time with great character development for cyborg and batman the special effects were unbelievable for Stephen wolf and darkseid and overall Zack Snyder did an amazing job on this move.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBest movie ever.Zack Snyder did a great work.I really want a Sequel #restorethesnyderverse",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In fact, everything is very simple. If you are a fan of Zach Snyder this is a great movie for you. If you didn't like Snyder before, then you won't like this version either.Personally, I enjoyed every minute of these 4 hours. And it was amazing.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Zack Snyder's Justice League will join the ranks of one of the best superhero films of all time. This is the film I was waiting for back in 2017, a heartfelt, exciting epic that showcase the Justice League. It made the Theatrical VersionZack Snyder's Justice League will join the ranks of one of the best superhero films of all time. This is the film I was waiting for back in 2017, a heartfelt, exciting epic that showcase the Justice League. It made the Theatrical Version completely obsolete. No wonder its cast and crew rejected that version, you can see that this is a labor of love. Supporting actors, such as Diane Lane even functioning at their 'A' levels. And it bogles me how the he@# that WB executives saw this 'initial cut' as a failure? Yes, it is not the MCU, but a different variety of it and dare I say, comparable in quality. Alas, the Snyder verse may have reached an end and all these great potential are laid to waste.  Yet, we still have this version to savor for years to come.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Director Zack Snyder's Justice League is the movie we should have seen in 2017 and not that stupid, ridiculous version of Joss Whedon.This film ends up being an epic narrative and visual spectacle. Each character has their time and space toDirector Zack Snyder's Justice League is the movie we should have seen in 2017 and not that stupid, ridiculous version of Joss Whedon.This film ends up being an epic narrative and visual spectacle. Each character has their time and space to shine and tell their story. The 4 hour duration is not even felt, and this is the result of a good film project. Bravo!!!",
      "review_date": "2021-04-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Знаете поговорку: \"Поспешишь - людей насмешишь\"? Вот Снайдер и не спешит. 4 часовая версия которая отвечает на все вопросы о том, что такое Лига Справедливости. Практически безупречное раскрытие героев, цельное повествование сюжета и никакихЗнаете поговорку: \"Поспешишь - людей насмешишь\"? Вот Снайдер и не спешит. 4 часовая версия которая отвечает на все вопросы о том, что такое Лига Справедливости. Практически безупречное раскрытие героев, цельное повествование сюжета и никаких дурацких шуток. Хотя слоумо могло бы быть и поменьше.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best super-hero movies that I have ever seen. Unique identity, refuses to follow the popcorn-movie formula. Zack Snyder delivers a real piece of art with this movie.#RestoreTheSnyderVerse",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mind Blasting, Mind Blowing, Heart touching, Lovely, Fantastic movie.Far more better than Avenger heros.We want remaining 2 parts which Zack Snyder wanted to make.DC and WB must support him as we loves Vision of Zack sir.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Expectativas superadas !Minha experiência com o filme foi totalmente satisfatória.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Decent enough to justify a new version. Not the best and not the worst. Worth a watch if you like superhero movies.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "So much better than 2017, intense action, impressive CGI and real depth to side characters",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Pros: The Ultimate superhero experience! From Jawdropping visual's to memorable score, this movie is 4 hours of action packed epicness.. Zack really served justice with this movie to the characters, whereas superman and batman are the face ofPros: The Ultimate superhero experience! From Jawdropping visual's to memorable score, this movie is 4 hours of action packed epicness.. Zack really served justice with this movie to the characters, whereas superman and batman are the face of DC, Flash, Cyborg and Wonder Woman steal every scene they're in. Keeping it Spoiler free, Zack's wonder woman is the best version of wonder woman ever, and Junkie literally filled Zimmers shoes for this movie. Flash is awesome as hell is this movie, so is Cyborg, but man oh man, that nightmare sequence is absolutely phenomenal especially the dialogue between joker and batman, I can proudly say that Leto has redeemed himself this time and I'm can't wait to see him in Joker's role again, he's that good.Cons: The one and only problem with this movie was the Cgi in some parts, it felt a bit cartoonish, but not enough to ruin the experience, and the movie had one or two cheesy lines, but they are not that much of a great deal.... In the end, best comic book experience since the Joker! Go watch it right now, play it , and you'll be forgetting all your problems for 4 hours straight glued to the screen.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Completely different movie than the original theatrical release. Why Warner Bros thought this wouldn't be the better version is beyond me. I'm only sad that we won't be getting to see more stories in this world. I really wanted to see whereCompletely different movie than the original theatrical release. Why Warner Bros thought this wouldn't be the better version is beyond me. I'm only sad that we won't be getting to see more stories in this world. I really wanted to see where the story was taking us from here. Some shreds of injustice vibes in there that would have translated great to live action. Surpassed my expectations.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great film from Great Snyder. Thank you! Can't wait for a sequel. Let Zack Snyder to build DC-Verse, please.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Brings out the childhood memories, every action every character detail as imagined by Snyder is straight out of the comics world. Missed Green Lantern appearance in the movie but all in all it was a super watch. Never felt like I am investingBrings out the childhood memories, every action every character detail as imagined by Snyder is straight out of the comics world. Missed Green Lantern appearance in the movie but all in all it was a super watch. Never felt like I am investing 4 hours to watch the movie, it feels complete, emotionally, action wise, the scenes, screenplay everything about it is just aw8esome. I am not sure why others are rating the movie so low while it is one of the best superhero movies ever made in existence with the universe. Thank you Snyder for making me remember what it was like o be a child again in my late 20's.Thank you Warner Bros for allowing Mr. SNYDER TO release this under your banner. Waiting for a theatre release soon and will watch it again and again and again.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Thank you Zack Snyder for this masterpiece I really hope WB will think right and make you continue Your great work",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best movie ever! Melhor filme do DCEU, Warner pecou em não levar esse universo adiante?",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the movie the fans deserved. What WB and Joss Whedon did was insulting after watching Zack's version. The execs wanted a pay bonus so they rushed it and wanted it to be \"lighter\". Zack's version had more heart and comedy then theThis is the movie the fans deserved. What WB and Joss Whedon did was insulting after watching Zack's version. The execs wanted a pay bonus so they rushed it and wanted it to be \"lighter\". Zack's version had more heart and comedy then the Josstice League. This is art. A proper third of the Man of Steel trilogy. #RestoreTheSnyderVerse #ReleaseTheAyerCut #ZackSnyder #ForAutumn",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is what the fans demanded for years, and was it worth it? Yes, it absolutely was.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One word... EPIC....!This movie would have to be the best DC superhero movie of all time..........\nI EVEN FEEL IT TAKES ON AND GOES PAST MOST MARVEL MOVIES.\n\nMy only two pet hates is I don’t like the bars on the sides (4:3) I get them IOne word... EPIC....!This movie would have to be the best DC superhero movie of all time..........I EVEN FEEL IT TAKES ON AND GOES PAST MOST MARVEL MOVIES.My only two pet hates is I don’t like the bars on the sides (4:3) I get them I just don’t like them and the music was a little weird however with that said they’re the only two problems in my opinion I think the story is better, the character deepness and connection is heaps better I feel everything just ran so much smoother and more deeper understanding, completely different from the original movie. This is definitely what the movie needed to be. It shows that the Warner Bros. executives had no idea when they said this was not good because I completely disagree thank you for an amazing movie but next time please make it WIDE screen....The 4 hours is long but I get it. We need that to indepth the characters background. Thanks #zacksnyder #justiceleague #dc #warnerbros #snydercut",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Лучший фильм DC, Снайдер Бог! Жду вторую часть.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "That movie was **** awesome. I respect everything about it. The story behind it's conception, it's originality, and it's character designs. Snyder's vision was Frankensteined into an unrecognizable beast by others. His fans cared so much,That movie was **** awesome. I respect everything about it. The story behind it's conception, it's originality, and it's character designs. Snyder's vision was Frankensteined into an unrecognizable beast by others. His fans cared so much, that he got a 4 hour cut of his original vision to release. I think this movie is a perfect example for studios of what happens when you respect the director's vision. Not just this, but  the movie felt unlike any other superhero movie that I'd ever seen. That's surprising considering that the original felt like a rushed attempt to follow the Avengers movies. Also, the character designs were awesome. Specifically Steppenwolf's design was amazing",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA much needed DC movie after ages. Every scenes would give you a goosebumps, it was really nice of them to incorporate all the previous released  DC so that the non DC fans could understand   better and probably would make more sense to them about the characters n their role.Literally its a treat for every  DC fans out their i hope WB understands the potential  of this universe  and carries  on with it hope for the best.Forever  DC fan❤",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Just an amazing movie. I have regained belief in the DCEU! Jack Snyder really got this right!",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Nothing to do with the other Justice League. The Snyder's cut is superb. Four hours without ever getting bored.The story is told very well. The life of the various super heroes is told giving meaning to the whole film. A final not at allNothing to do with the other Justice League. The Snyder's cut is superb. Four hours without ever getting bored.The story is told very well. The life of the various super heroes is told giving meaning to the whole film. A final not at all obvious and why not, a sequel would not be a bad idea.Great job, Zack Snyder.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The wait was definitely worth it. Action, music, character development, tone....all a massive improvement from the 2017 version. A satisfying conclusion (if this really is the end of the Snyderverse) but also a film that leaves you wantingThe wait was definitely worth it. Action, music, character development, tone....all a massive improvement from the 2017 version. A satisfying conclusion (if this really is the end of the Snyderverse) but also a film that leaves you wanting more of this world and these characters.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Epic is small word for this movie great vision from zack snyder the movie should have sequel",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I liked this version much better than the 2017 Justice League. The movie is just too long. There are several parts in the movie, that if they changed just a couple things, would make it much better, and maybe even great. I'm glad that ZackI liked this version much better than the 2017 Justice League. The movie is just too long. There are several parts in the movie, that if they changed just a couple things, would make it much better, and maybe even great. I'm glad that Zack Snyder got to make his version of the movie, and the fans got to see it. Steppenwolf was much improved, but still never came close to the impact that Thanos did in the Avengers Infinity movie. But, he looked better, for sure. All in all, I think it is solid, but too long. I can't see myself ever watching it again. That's a shame too. DC deserves much better than what they've been given as a whole.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "First off;  I am one of the few who enjoyed the original release but I always felt it was...lacking. It seemed “pieced together”. It was “entertaining” but I always felt there were too many cutesy, Marvel wanna be scenes that it detractedFirst off;  I am one of the few who enjoyed the original release but I always felt it was...lacking. It seemed “pieced together”. It was “entertaining” but I always felt there were too many cutesy, Marvel wanna be scenes that it detracted from the depth that was available in these rich characters.Not so, with the Snyder Cut.There was so much in it that was, obviously, cut from the first version as a consequence of bad editing. I am not going to go into explicit detail. It would take too long. Suffice it to say; this is an entirely different movie from the theatrical release. There was a depth of background detail, character building and motivation that is unmatched in “comic-book” movies. The story development felt organic and well thought out. (Zack nailed it.)Plus; the ending was completely, and wonderfully, modified, (ergo; different).{I absolutely adored the Black Super suit!}I was happy to see that Ray Fisher’s Victor Stone/Cyborg was incredibly (beautifully) fleshed out as a person and character.The minor changes and myriad additions only added to the wonder that is the Snyder Cut. All of the actors are perfectly suited to their roles. A stand out, as in the theatrical release, was Ezra Miller as Barry Allen/The Flash. He brings just enough humor to the team without being the “class clown” they turned him into in the original version. Gal Gadot is so great as Wonder Woman, I love Jason Momoa’s Aquaman, Henry Cavill does make me “believe a man can fly” and Ben Affleck...what can I say? He  IS the Batman. I could watch his Bruce Wayne in a dozen films. (Jeremy Irons is a wonderful addition to the Pennyworth legacy as well.) The cameos/revelations were great and well placed in the story.My final word is; this is the way it should have been released the first time around. At 4 hours/2 minutes it is long but worth every minute. Not a piecemeal film trying to emulate a cartoon from the 70’s but a film that stands on its own merits as a drama first, a character study second and an action movie/superhero movie third.",
      "review_date": "2021-03-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's really a different movie compared to the original . Snyder did a very good job creating the new Justice League",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love that there is actually backstory. Also the 4 hour runtime is great, it allows for so much more content. I want more movies like this and I want more justice league!",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There's not much to say about it really. I've waited more than 2 years to see this 4 hours of beauty and enjoyed every second of it",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first 30 minutes was kinda boring but what after was such brilliant i liked speed force scene it was a masterpiece. Jared leto  did a good work very good scene. I didn't like cgi at some scenes was pretty lame. I think it's better thanThe first 30 minutes was kinda boring but what after was such brilliant i liked speed force scene it was a masterpiece. Jared leto  did a good work very good scene. I didn't like cgi at some scenes was pretty lame. I think it's better than infinity war.",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love it! Finally I just watched original story and I hope it isn’t over! Restore Snyder’s Verse! Yessssss",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Finished watching #ZackSnydersJusticeLeague.Tears of joy, I never experienced feelings like this watching a movie.It isn't a film, it's just something more.\nI won't say anything else about this masterpiece, let's enjoy it with your lovedFinished watching #ZackSnydersJusticeLeague.Tears of joy, I never experienced feelings like this watching a movie.It isn't a film, it's just something more.I won't say anything else about this masterpiece, let's enjoy it with your loved ones.I held my gf as first reaction during the end credits indeed, 'cause love is what Zack Snyder inspires with his Justice League.I want to thank him for being such a special human being and for changing our lives with his powerful art.I can't be more proud of being part of the #releasethesnydercut extended family.And I can't imagine a future without the sequels.#RestoreTheSnyderverse#ForAutumnThank you Zack ❤️",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best f***king movie ever!!! Avengers who?!  Justice was so good I didn’t realized it was 4 hours !! This move explained everything and I want a Justice League 2 !!! DC forever !!",
      "review_date": "2021-03-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I just really love this movie more than I love myself. Definitelly movie of the year.",
      "review_date": "2021-03-19",
      "source": "metacritic"
    }
  ],
  "num_reviews": 146
}