{
  "title": "Amores Perros",
  "rating": 5.5,
  "release_date": "2001-03-30",
  "genre": [
    "Drama",
    "Thriller"
  ],
  "summary": "A bold, intensely emotional, and ambitious story of lives that collide in a Mexico City car crash.  (Lion Gate Films)",
  "critic_reviews": [
    "A stunner: a fiercely brilliant film of such wrenching impact, nonstop drive and unpredictability that watching it becomes an exhilarating ride.",
    "Fierce, loving, and electric, this movie's got bite as well as bark.",
    "There's a seething moral core in Amores Perros that uses the canine savagery as an entre to human brutality.",
    "The most enthralling movie of the year.",
    "The titillating sense of out-of-controlness provoked by the camera is echoed in the film's narrative situations, and you simply, and deliciously, haven't a clue as to what he's going to throw at you next.",
    "A film of tremendous complexity and depth, a galvanic force that sends the mind reeling.",
    "It's a truly prodigious piece of work, resembling a career summation far more than a maiden voyage.",
    "Anguish ranges from gritty and realistic to the tragicomic soap opera found in Pedro Almodovar's films.",
    "It's a film of high energy, punctuated by rock music and a dark wit, yet it is capable of profound reflection and tragic irony.",
    "For those willing to submit to its terrible charms, it may be the single most important debut to come out of the Americas in years.",
    "The gritty, Oscar-nominated \"Traffic\" is a limo ride compared with the bloodletting in this year's foreign-film nominee from Mexico.",
    "Amores Perros will be too much for some filmgoers, just as \"Pulp Fiction\" was and \"Santa Sangre\" certainly was, but it contains the spark of inspiration.",
    "A headlong pastiche of lower-depth melodrama and absurd black comedy.",
    "Strong stuff, compelling drama.",
    "A feverish, breathtaking tour through Mexico City high and low, an explosive, mosaic-style portrait of our continent's largest city.",
    "A film in which nothing is what it seems, this is the kind of genre touch that Mr. González Iñárritu expands into something far more haunting.",
    "Though unflinching in its savagery, Amores Perros is always compulsive viewing.",
    "Sometimes enticing, frequently savage.",
    "He (Gonzalez Inarritu) handles a complex plot with clarity and precision while keeping audience members on the edge of their seats.",
    "Solidly engaging.",
    "There's something overly studied, almost clinical, in how it all pulls together.",
    "Often thrilling, if overwhelmingly brutal, trio of interconnected short stories.",
    "Undeniably high-powered. At 153 minutes, it's also punishingly overlong.",
    "This isn't a cheerful movie. But director Alejandro Gonzalez Iñarritu and writer Guillermo Arriaga tell these stories with authority and verve, making 2½ hours zip by."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Touching story. Brilliant idea of the three stories. The accident episode is the key of the movie. It keeps you alert till the end. The third story was the most beautiful to me.",
      "review_date": "2011-01-07"
    },
    {
      "review_title": null,
      "content": "Certainly, a very good movie! Although one of the stories (the one of the model and the dog) was not very credible and seemed a bit forced; as a whole, the movie works well. The first time I watched this film  the impression I got from it wasCertainly, a very good movie! Although one of the stories (the one of the model and the dog) was not very credible and seemed a bit forced; as a whole, the movie works well. The first time I watched this film  the impression I got from it was not very positive; however, I am happy I watched it again, because I understood if from a totally different perspective, while the first time I did, I was perhaps overly critical. I do recommend the movie! It is intense, endearing, powerful, and at times, brutal...but watching is was  a rewarding experience, just the same!...Amores Perros  definitely had a huge potential to be even more than what it was...",
      "review_date": "2012-03-31"
    },
    {
      "review_title": null,
      "content": "Amores Perros es perfecta, una obra de culto increíble y visualmente espectacular y con una historia y unos personajes muy bien desarrollados, la obra maestra que le dio el reconocimiento mundial a Alejandro Gonzalez Iñarritu es perfecta,Amores Perros es perfecta, una obra de culto increíble y visualmente espectacular y con una historia y unos personajes muy bien desarrollados, la obra maestra que le dio el reconocimiento mundial a Alejandro Gonzalez Iñarritu es perfecta, única y original. Es como Pulp Fiction, pero en México.",
      "review_date": "2015-10-20"
    },
    {
      "review_title": null,
      "content": "Amores perros debut Alejandro Iñárritu in the big movie. Immediately turned out a masterpiece. The simplest story, a perfectly twisted plot of several character lines. Characters go through the path of development through difficult lifeAmores perros debut Alejandro Iñárritu in the big movie. Immediately turned out a masterpiece. The simplest story, a perfectly twisted plot of several character lines. Characters go through the path of development through difficult life situations. Probably the most realistic movie about Mexico. And most importantly, a very correct ending. A heavy film for perception, after it there is only a lump in the throat. A cult movie that not many will like.",
      "review_date": "2021-11-02"
    },
    {
      "review_title": null,
      "content": "Gruesome truth said if full and loud. It's well evident that Alejandro González Iñárritu has replaced the king of surrealism Luis Bunuel out from the helm.",
      "review_date": "2018-04-06"
    },
    {
      "review_title": null,
      "content": "A great movie that catches your attention for all the two-and-a-half hours that it's long. It captures the three sad stories in such a beautiful, melancholic, aesthetic way For me, all the blood and violence is part of that A great movie that catches your attention for all the two-and-a-half hours that it's long. It captures the three sad stories in such a beautiful, melancholic, aesthetic way For me, all the blood and violence is part of that aestheticness. The movie seems to breathe the town, the atmosphere is conveyed great with, the people, upper class and lower. One of the best movies I've ever seen.",
      "review_date": "2006-07-06"
    },
    {
      "review_title": null,
      "content": "Although I still feel this movie is great, it's a movie best appreciated when you're watching it for the very first time. On repeated viewings, although it is still great, it just isn't as rewarding. Still, great performances Although I still feel this movie is great, it's a movie best appreciated when you're watching it for the very first time. On repeated viewings, although it is still great, it just isn't as rewarding. Still, great performances from the cast and brutally realistic.",
      "review_date": "2007-06-05"
    },
    {
      "review_title": null,
      "content": "THE best movie I have seen this year, truly my vote for best foreing film. A work of art that is truly magnificent.",
      "review_date": "2001-07-08"
    },
    {
      "review_title": null,
      "content": "Writer speaks from essential to embrace absurd. Never saw movie that perfect.",
      "review_date": "2006-01-19"
    },
    {
      "review_title": null,
      "content": "Easily the best film of 2001, and, as some critics have indicated, one of the finest films of all time. The performances, writing, direction, and choice of music are all flawless. It was sad to see this same filmmaker try to create a similar Easily the best film of 2001, and, as some critics have indicated, one of the finest films of all time. The performances, writing, direction, and choice of music are all flawless. It was sad to see this same filmmaker try to create a similar masterpiece with 21 Grams, and mostly fail. If you didn't like that film, still give this one a chance. It truly is amazing.",
      "review_date": "2006-08-24"
    },
    {
      "review_title": null,
      "content": "This film is a serious take on the hyperlink genre, focusing more on social disparity than the titular love: although the three episodes take place in the same city, we see three essentially unrelated stories that could well have been set inThis film is a serious take on the hyperlink genre, focusing more on social disparity than the titular love: although the three episodes take place in the same city, we see three essentially unrelated stories that could well have been set in three different countries. There are snippets of great cinema, with influences clearly ranging from 50s-60s neorealism to 90's heist films - technically, the film is a great one: camera work, cinematography, writing, editing and soundtrack are all spot on. The only downfall, I found, was the fact that although yes, it is hyperlink, and yes, the episodes are somewhat connected, Amores perros still feels very distinctly trifold.\r Apart from this, the movie is good and is certainly one of the best in its genre. Also, comparisons to Pulp Fiction don't really make sense, since Pulp Fiction was written with a humorous intent, while Amores perros is extremely serious and doesn't ever provide comedy at all.",
      "review_date": "2015-04-06"
    },
    {
      "review_title": null,
      "content": "Una de las películas que pusieron un antes y después en el cine mexicano. La película que puso en el radar a González Iñarritu, Gael García Bernal y Rodrigo Prieto. Una historia absorbente de causa y efecto de cómo un accidente unió de maneraUna de las películas que pusieron un antes y después en el cine mexicano. La película que puso en el radar a González Iñarritu, Gael García Bernal y Rodrigo Prieto. Una historia absorbente de causa y efecto de cómo un accidente unió de manera cortante la vida de tres perfectos desconocidos, a través de la tragedia y el perdón.",
      "review_date": "2019-04-14"
    },
    {
      "review_title": null,
      "content": "Three connected stories show the 3 different social classes in Mexico, the film feels very real and very impressive, this is undoubtedly the best movie that my country (Mexico) has given to the world.",
      "review_date": "2018-08-01"
    },
    {
      "review_title": null,
      "content": "An amazing first feature film for the brilliant director. meanings and symbols and stories altogether put in a well-reasoned pace with some incredibly awesome actings as well",
      "review_date": "2020-03-23"
    },
    {
      "review_title": null,
      "content": "Una grandiosa película sobre historias cruzadas, es cruda, tensa y emocional.¡¡¡TOTALMENTE RECOMENDADA!!!",
      "review_date": "2020-09-13"
    },
    {
      "review_title": null,
      "content": "This film remains, to date, the best film among those directed by Inarritu. He creates a nice parallelism in the four stories told: love between couples and love between dogs and their owners. The film is masterfully directed and has aThis film remains, to date, the best film among those directed by Inarritu. He creates a nice parallelism in the four stories told: love between couples and love between dogs and their owners. The film is masterfully directed and has a beautiful cinematography. .",
      "review_date": "2022-04-01"
    },
    {
      "review_title": null,
      "content": "It is Pulp Fiction but it beams México in every way, but it's a real version of our country that we won't accept ever, the animal abuse. The best movie of Alejandro González Iñárritu, this kind of editing gets a lot of intrigue and tension.It is Pulp Fiction but it beams México in every way, but it's a real version of our country that we won't accept ever, the animal abuse. The best movie of Alejandro González Iñárritu, this kind of editing gets a lot of intrigue and tension. The first story was so uncomfortable and tense, the second one was interesting, but nothing more and the last one was the heart of the movie. Everybody did their best in everyway.",
      "review_date": "2021-12-13"
    }
  ],
  "num_reviews": 41
}