{
    "rating": 9.1,
    "release_date": "1960-11-01",
    "num_reviews": 90,
    "genres": [
        "English"
    ],
    "summary": "In the 1920s, Tennessee schoolteacher Bertram Cates (Dick York) is put on trial for violating the Butler Act, a state law that prohibits public school teachers from teaching evolution instead of creationism. Drawing intense national attention in the media with writer E. K. Hornbeck (Gene Kelly) reporting, two of the nation's leading lawyers go head to head: Matthew Harrison Brady (Fredric March) for the prosecution, and Henry Drummond (Spencer Tracy) for the defense.",
    "reviews": [
        {
            "content": "What a great movie. As an atheist, I can't believe I've never heard of this movie till now. It's sad that almost 100 years later and people still don't accept evolution.",
            "review_date": "2022-07-28",
            "source": "rt"
        },
        {
            "content": "At a time when blind faith, willful ignorance and superstition continue to try to trump science and logic, Stanley Kramer's Inherit the Wind proves to be as timely today as it was when originally released over sixty years ago.  Inspired by the Scopes Monkey Trial, the film tells the story of a grade school teacher charged for violating state law when he introduces his class to evolution.  The film wastes no time getting to the meat of the matter and remains a compelling courtroom drama.  While Gene Kelly's portrayal of a smug news reporter seems unnecessary and distracting, the rest of the cast is spot on, most notably Spencer Tracy in what could be his most compelling performance as the defense attorney.",
            "review_date": "2021-11-16",
            "source": "rt"
        },
        {
            "content": "A classic courtroom drama which pits human intellect against faith and two of the greatest screen icons - Spencer Tracy and Fredric March against each other in truly masterful performances. Inherit the Wind is a thinly veiled fictionalisation of the \"Scopes Monkey Trial\" which had the country on the edge of its seat in 1925 deciding on a teacher, John T. Scopes', ability to teach Darwin's Theory of Evolution in his Tennessee classroom which employed the real life giants of the day - leading civil rights' attorney Clarence Darrow (encouraged to serve by journalist H. L. Mencken) and \"The Great Commoner\" and 3 time presidential candidate William Jennings Bryan. In the film, Bertram Cates (played by a pre-Bewitched Dick York) is defended by Henry Drummond  (Darrow/Tracy) as Matthew Harrison Brady (Bryan/March) attempts to drive the devil out of the sleepy town. Tracy and March give two of the most electrifying tandem performances - they truly feed off of each other while also vying to shine brighter than the other. This production is legendary for the fact that spectators would come from all over the studio to watch these stars shine in their performances. In spite of all that, Gene Kelly, really stands out for me in this film - one of his first dramatic roles to battle his singing and dancing type casting. Kelly plays E. K. Hornbeck (Mencken), a journalist who is the voice of the outside world looking in and the cynical newsman cutting through the bravado. He delivers one of my favourite ever lines \"Mr. Brady, it is the duty of a newspaper to comfort the afflicted and afflict the comfortable.\" The dialogue throughout is appropriately snappy, heady, or sentimental. Helped, in part, by writer Nedrick Young who director Stanley Kramer bravely hired despite his blacklisting. Which brings us to the other underlining message of the film, made in the shadow of McCarthyism, is a parable of the Senator Joseph McCarthy's long tirade against intellectual discourse. Inherit the Wind beautifully compares this to the acceptance of the proven truth of science over the fantastical religious beliefs of The Book of Genesis. Tracy's closing speech about the simple sweet wonder we give up when we learn the truth or accept technological advancements can still be viewed today with dear appreciation for \"good ol' days\" and is prescient in regards to our advancing world's privacy concerns. Inherit the Wind continues to offer so much to viewers on many levels. Only a true classic can say that.",
            "review_date": "2021-04-28",
            "source": "rt"
        },
        {
            "content": "Brings to life the Scopes Monkey Trial and that time in American history when the evangelical, rural way of life clashed with science and modernity. That battle has yet to end.",
            "review_date": "2021-04-18",
            "source": "rt"
        },
        {
            "content": "Really good. Tracy and Kelly are excellent. Well worth watching. Would have given it fives stars but for a few historical inaccuracies although they are understandable as the film was not only pointing out the lunacy of creationism but pointing a finger a McCarthyism as well.",
            "review_date": "2020-11-21",
            "source": "rt"
        },
        {
            "content": "Razor sharp writing and towering performances make for a terrific courtroom drama, and a timeless parable for the dangers of dogmatism.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "Great acting all around, but Spencer Tracy's performance just might be the best of his career.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "One of my all time favorites. A great adaptation with powerful performances.",
            "review_date": "2020-07-20",
            "source": "rt"
        },
        {
            "content": "With towering performances across the board, trenchant dialogue that proves Gene Kelly can dance just as well with words as he does with music, and tack-sharp camerawork from Kramer in what is perhaps the storied director's best film, it is as much a story about the moral and scientific evolution of mankind as it is about the evolution of the human animal as it is about the inherent danger of men who refuse to allow their thinking to evolve with the times.",
            "review_date": "2020-04-19",
            "source": "rt"
        },
        {
            "content": "Cinematic titans, Spencer Tracy and Frederick March square off as semi-fictionalized Clarence Darrow and William Jennings Bryan in Stanley Kramer's adaptation of the stage play about the infamous Scopes Monkey Trial. Great screen writing, directing and performances. Still powerful and, perhaps, sadly, necessary. ",
            "review_date": "2020-01-09",
            "source": "rt"
        },
        {
            "content": "Remembered this from high school and wanted to give it a second watch. Old Time Religion reverberates throughout the film. This is an excellent \"southern, small town, fans waving in the courthouse with a LOT of gavel\" movie. Darker than I remember concerning Brady's downfall. The trial is wildly unrealistic, but extremely entertaining. Loved the final scene and remembered why I enjoyed it so much to begin with: Henry Drummond (based-on the very real attorney, Clarence Darrow).",
            "review_date": "2019-12-26",
            "source": "rt"
        },
        {
            "content": "A too preachy screenplay adaptation; it should have stuck closer to the play;  director Stanley Kramer seems to have a penchant for being didactic.  Too bad.  If the rest of the movie treatment was less blatant, the fireworks between Spencer Tracy and Fredric March would have had more power and shone all the brighter.",
            "review_date": "2019-11-23",
            "source": "rt"
        },
        {
            "content": "Right to think is on trial",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "This film is not good.  It hardly merits review, save for the high and mighty Hollywood actors who come to engage in its roles.  An invention of Dayton, Tennessee, to publicize the town, the Broadway play came at the time of the real Russian (Communist) witch hunt, executed by Sen. Joseph McCarthy and his henchman Roy Cohn, the man who started Donald Trump on the road to irascible pride, obsequiousness to oligarchy, and the idea that permeated his life: that he was above the law.  The play mixed anti-McCarthyism with the Scopes trial, making a jumbled mess out of the screenplay.  Almost nothing is accurate.  This is a mistake that modern day films have corrected.  Most writers and actors seek accuracy in what they do and what they portray.  This film is characterized by emotional speeches from windbags -- no one really believes what they are spouting.  As with most films which deliberately lie and obfuscate the truth, the film comes off as screeching and wailing to little effect.  It is much ado about nothing.",
            "review_date": "2019-02-21",
            "source": "rt"
        },
        {
            "content": "The best courtroom movie ever made!",
            "review_date": "2019-02-01",
            "source": "rt"
        },
        {
            "content": "I was not impressed with how much this movie made christians look dumb.",
            "review_date": "2018-07-18",
            "source": "rt"
        },
        {
            "content": "Stanley Kramer's 1960 film is a searing indictment of religious fundamentalism and anti-intellectualism. Inherit the Wind's relevance continues beyond its immediate parallels with McCarthyism.",
            "review_date": "2018-03-25",
            "source": "rt"
        },
        {
            "content": "Watching these actors act was a pleasure.Fine courtroom drama.",
            "review_date": "2017-10-20",
            "source": "rt"
        },
        {
            "content": "The cast of Inherit the WInd is the kind of thing that instantly makes me smile. I mean, of course I want to see a defendant played by Dick York, whose lawyer is Spencer Tracy, and the case is covered on the news by Gene Kelly, while Harry Morgan presides over it all. So many iconic actors who I love to see on screen, and they all gave me something to enjoy while watching. Of course, any time I see Gene Kelly Id rather see him singing and dancing, but this isnt that type of film. The cocky character who spends most of the movie delivering sarcastic lines was something I didnt expect from him, but he was probably the one with my favorite performance in the whole movie. I wasnt as familiar with Fredric March, but he is the zealous prosecutor the film needed to counterbalance the understated Spencer Tracy.\n\nA good troupe of actors only gets you so far, and at some point I have to talk about the plot of Inherit the Wind. To say I was frustrated by this movie is a major understatement. Its more interesting to tell a story like this where you see even a small amount of validity on each side. But here we are treated to only the most extreme and horrid of fundamentalist christians. It made me want to pull my hair out, and there were very few moments of relief from this theme. Aside from Donna Anderson who actually went through some conflict, everyone else in the movie is just painted as 100% right and good or 100% wrong and evil. I know there are people like this in the world, Im not trying to be naive, but the lack of perspective and variety of opinions felt artificial. I shouldnt want to punch 90% of the characters in a movie.\n\nHowever, my frustration with the characters in Inherit the Wind was nothing compared to how angry I got with the courtroom scenes. Im willing to give some leeway to movies so they can dramatize trials to make them more entertaining than they are in real life. But it turns out theres a limit to how far my suspension of disbelief is willing to go. The excessive way that these lawyers just start pontificating while barely talking to witnesses is ridiculous. They constantly go off on rabbit trails that have nothing to do with the case being tried. It all culminates in the most absurd back and forth when one lawyer calls the other lawyer to the stand. I havent done the research to see how closely they tried to mirror the actual trial, but Id be shocked if it was as dopey as this in the way testimony was given. This didnt feel like an actual court, but like elementary kids having a mock trial. Inherit the Wind has that great list of actors, but doesnt give them a good script to utilize their talent, so I failed to appreciate it.",
            "review_date": "2017-10-03",
            "source": "rt"
        },
        {
            "content": "One of the best movies I have ever seen.",
            "review_date": "2017-08-27",
            "source": "rt"
        },
        {
            "content": "The only weakness in this film is Gene Kelley. His voice is so smooth that it's almost like he's about to break into a song & dance. But then this film was only done because of his involvement - both he & March were friends of Tracy and lured him back out of retirement.",
            "review_date": "2017-08-06",
            "source": "rt"
        },
        {
            "content": "A very interesting story. Great acting and at times it got funny.  This is a great classic.\n\n9.2/10",
            "review_date": "2017-06-26",
            "source": "rt"
        },
        {
            "content": "One of the 10 best movies ever made.",
            "review_date": "2017-02-13",
            "source": "rt"
        },
        {
            "content": "Film loses impact because it doesn't spell out till an hour in that Cates is liable to imprisonment if he loses the case.  Also, the judge is very passive and plays a minor role. Extraordinary of course that Darwin's Theory is on trial before a jury!\nBeautifully acted by both leads. Claude Akins though miscast as minister Brown. But shows how religion can be used by fundamentalist zealots to manipulate people to the point of cruelty.\nGreat re-creation of courtroom. I could feel every degree of the 97 degree heat. Those fans never stopped waving.",
            "review_date": "2016-09-25",
            "source": "rt"
        },
        {
            "content": "92%\nViewed this on 24/5/16\nStanley Kramer is the most underaprreciated and overlooked director of the 20th Century, even Ed Wood got his laurels after his death, sadly not Kramer. Inherit the Wind is as explosive as Kramer's Judgement at Nuremberg. Kramer is also the best director of the 20th Century. Kramer's films are rich in themes, themes that most of the directors in his era choose to ignore and hence Kramer produces his own films despite incurring heavy financial losses. Like all his works, Inherit the wind is also morally ambiguous, even when its taking sides, it doesn't try to be too judgemental or narrow sighted, the friendship of the two lawyers show this effectively. Actor Spencer Tracy gives a powerhouse performance.",
            "review_date": "2016-05-24",
            "source": "rt"
        },
        {
            "content": "Excellent and enjoyable movie with a great cast and solid acting. Problem with movie is that it portrays those who oppose the teaching of evolution as mean, close-minded people. It's an unfair portrayal and a better director would have presented a more accurate picture of both sides of the debate.",
            "review_date": "2016-04-24",
            "source": "rt"
        },
        {
            "content": "A immensely riveting drama with amazing dialogue, Inherit The Wind is both important in it's message as it is clever in it's execution. Heavy handed? Yes. Engaging as all hell? You betcha.",
            "review_date": "2016-03-26",
            "source": "rt"
        },
        {
            "content": "If there is a perfect movie, it's got to be 'Inherit The Wind'.",
            "review_date": "2016-02-12",
            "source": "rt"
        },
        {
            "content": "Heredarás el viento es una película que se centra en comunicar un mensaje muy claro: El fanatismo nos hace daño. En esa misión, la película exhibe cómo ignorancia y la violencia van de la mano con el fanatismo. \n\nBasada en el famoso \"monkey trail\" de 1925 en EEUU, en el cual, un profesor fue juzgado por enseñar la teoría evolucionista, cuando la ley prohibía enseñar cualquier otra teoría que no fuese la creacionista. \n\nNos encontramos con una película rica en diálogos y que deja como mensaje la importancia de la tolerancia en una so\nciedad que necesita de la diversidad de ideas para lograr el desarrollo.",
            "review_date": "2016-02-02",
            "source": "rt"
        },
        {
            "content": "This wonderfully-written film was daring for the time it came out and remains relevant in our times, as it exposes religion and bigotry as a hindrance to human thinking and impresses us with Fredric March's three-dimensional character, even though it ends with a terrible last scene.",
            "review_date": "2016-01-30",
            "source": "rt"
        },
        {
            "content": "A really excellent movie with amazing writing, wonderful performances from Spencer Tracy, Fredric March, Dick York, Florence Eldridge and Donna Anderson. The cinematography is great, the music is really well done, and great direction. It's based on a play yet never feels claustrophobic or awkward for the screen like some do. One of the best court room movies of all time",
            "review_date": "2015-11-22",
            "source": "rt"
        },
        {
            "content": "Inherit the Wind is very powerful and relevant in its subject matter, it is very well acted and it has its dramatic and great moments, but it is poorly executed with not that good character development, overreliance on melodrama and it uses too much music and is never particularly memorable or energetic. It could have been a much better movie had it had better approach and better executed first half.",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "Classic and intriguing, a courtroom drama that lets you get behind the arguments to see how things come together and later how they fall apart.\nTour De force performances ring true, and watching the passionate fireworks display will make the whole thing worth your while.\n\n4.5 out of 5",
            "review_date": "2015-06-07",
            "source": "rt"
        },
        {
            "content": "Starring Spencer Tracy, Fredric March and Gene Kelly. Stagey but still effective film version of the play which itself is based on the Scopes Trial of 1925. Teacher Bertram Cates (Dick York, soon to be the first Darrin on TV's \"Bewitched\") is arrested after discussing evolution with his class. A media frenzy occurs when two high-profile lawyers are enlisted to represent both sides in the case. The highlights are the courtroom showdowns between Tracy's Henry Drummond (based on Clarence Darrow) and March's Matthew Harrison Brady (based on William Jennings Bryan). Kelly is fine in a rare non-musical role as the sarcastic reporter covering the trial; his character is based on H.L. Menken. Directed by Stanley Kramer.",
            "review_date": "2015-04-07",
            "source": "rt"
        },
        {
            "content": "A very good courtroom drama made even more intriguing by its subject matter. The message of the film, to both religious people and atheists, is to keep an open-mind. At the the end of the film both sides have a little more tolerance for the other and I think that's a very positive message. Even the preacher learns this lesson, but he doesn't take it too well. No matter what you believe you can feel his frustration because at times all of us can be stubborn with our ideas.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": ".....\n\n\n\n\nThe interaction of Tracy and March is what really makes the film. Both are such wonderful actors that they are able to make the positions of their characters sound convincing. Both manage to develop a little set of mannerisms that serve to distract the audience while each other is speaking. March continually plays to the courtroom audience with rolls of his eyes, rubbing his head, or agitated fanning of his face. Tracy's efforts are less obvious, but just as effective-lengthy pauses, contemptuous expressions.. Also of interest in Inherit the Wind is a rare dramatic role for Gene Kelly. He plays the newspaperman E.K. Hornbeck, who is actually H.L. Mencken who wrote for the Baltimore Sun. Kramer saw Mencken as an American original. Kelly was too and he was able to convey the intelligence and occasional humour that the part required quite effectively. A number of other small roles in the film are well handled by familiar character actors (Harry Morgan as the judge, Claude Akins as Reverend Brown, Dick York as Cates, Florence Eldridge [Fredric March's wife in real life] as Brady's wife, and in unbilled roles-Norman Fell, Ray Teal, and Earle Hodgins).\nFidelity to the facts aside, Inherit the Wind is a powerful, well-made film. Spencer Tracy, Fredric March and Gene Kelly all create indelible performances worthy of the larger-than-life figures that inspired them.\n\n the performances are outstanding across the board. Through this ensemble, they make one of the most singularly exciting courtroom dramas I've ever seen. The group is timeless. Spencer Tracy and Fredric March lead the show, of course, but Dick York is just as strong in a smaller role. Additionally, Gene Kelly (An American in Paris) is great even with feet not aflame as journalist and atheist E.K. Hornbeck and Harry Morgan (Dragnet) is surprising good in his role as Judge Mel Coffey, who's right in the mix with the religion over justice crowd.  Claude Akins does a good job playing the town's fundamentalist preacher with a hate-filled, sanctimonious air that is frankly revolting.\n\nInherit the Wind is the fictionalized story of the real life Scopes Monkey Trial of 1925 where Scopes, a school teacher, was prosecuted for teaching Darwin's Theory of Evolution in a Dayton, Tennessee school. \nThe lawyers who work the case do a fabulous acting job; Fredric March as the bible-thumping fundamentalist Bryan and Spencer Tracy as the reasonable-sounding atheist Darrow. There are many great soliloquys by each actor and a rousing debate when they lock horns with Bryan called as an expert witness on the Bible, itself. Again, Kramer has stacked the deck; giving Spencer Tracy all the good reasonable-sounding ripostes and making Fredric March look fairly silly in comparison. However, each of the two principals do a good job with the material they are given to work with. Harry Morgan plays the judge. \n\n Camera work and editing were good in this drama, particularly in the courtroom scenes. I would like to see the same material played without the liberal slant, however, Inherit the Wind is about as good as it gets for a courtroom drama. \n\nOne very memorable scene has Drummond and Brady sitting in rocking chairs on the porch of the hotel where they are both staying, talking about the old days, when Drummond tells an anecdote about a rocking horse that he wanted as a child.\n\nGene Kelly is very good as E. K. Hornbeck, the cynical, sarcastic reporter for the Baltimore Sun.  Claude Akins makes a departure from his usual tough-guy roles as the fiery, white-haired Reverend Jeremiah Brown  Other notable actors include Harry Morgan, of MASH, who portrays Judge Mel Coffey. The scene in which Coffey is introduced begins with his back to the camera, but upon hearing the distinctive voice of the actor, anyone who has seen Morgan in anything will immediately recognize him.\n\nNot only is the acting outstanding but the exchange between the actors is inspiring. The play on words is most intriguing. Skillfully crafted and masterfully performed, this movie deals with the conflict between evolution and the biblical account of creation. Certainly a controversial issue. \n\nI can highly recommend this film to anyone who loves great films and great performances. Inherit the Wind is one of the best films of all times.",
            "review_date": "2015-02-26",
            "source": "rt"
        },
        {
            "content": "It is disconcerting to say the least to watch this 55 year old movie presenting a fictionalized version of the 1925 Snopes Monkey Trial and to realize that in 2015 the same controversy over evolutionary theory still exists in America.  Check this recent poll:  http://www.theguardian.com/science/2015/jan/29/evolution-gm-food-climate-change-us-survey?CMP=ema_632   Unfortunately, the movie is rather ham-fisted, painting the fundamentalist Christians in a particularly unsubtle light - although there are certainly continuing examples of true stupidity among their ranks (I'm thinking Westboro Baptist Church, for example).  So, perhaps the target is too easy and Frederic March makes things worse by playing the zealous prosecuting attorney as a buffoon who seeks to scapegoat the young man (Dick York from Bewitched) who teaches evolution when it has been declared illegal perhaps to enhance his own image as well as his god's.  Spencer Tracy is fine as the defense attorney, even charming in his gruff way, but his courtroom tactics seem weak.  The script and much of the acting (for example, Gene Kelly as a cynical reporter) are subpar.  However, I'll admit that it is rousing to see science championed publicly like this and I'm glad to think that this film has achieved classic status for some, even if it isn't a stellar film.",
            "review_date": "2015-02-04",
            "source": "rt"
        },
        {
            "content": "Spectacular performances, particularly by March, carry this otherwise sober and very political courtroom drama",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "Not quite the masterpiece I was expecting. The film has some interesting ideas and some well chosen moments (plus a wonderful opening camera shot) but the trial itself isn't much. It doesn't say anything new (although maybe it did at the time) and the case itself is less a trial than a chance for two people to stand on a stage and give speeches at each other. It's not very dramatic because there's nothing at stake. Plus, I don't much like the guy playing Bryan. I mean Brady. Silly me, mixing those up. He's not nearly charismatic enough and his fake bald patch looks...fake. Spencer Tracy is better than I expected as not Darrow. And hey, Darren from Bewitched showed up as not Scopes. It's not a bad film, it's just not a really good one.",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "This film is great. Pity me that I cannot help but feel myself rather close to the character of that cynical journalist (based on H.L. Mencken) -non-believer in every sense, unlike the other two protagonists, and the director, of course.",
            "review_date": "2015-01-11",
            "source": "rt"
        },
        {
            "content": "Powerful and gripping. And one of the best things in this film is Gene Kelly's performance.",
            "review_date": "2014-11-09",
            "source": "rt"
        },
        {
            "content": "Over-wrought and lacking even the most basic subtlety or nuance. Still, Spencer Tracy's good in it and the fact that topic (teaching evolution!) is relevant still today is quite depressing.",
            "review_date": "2014-10-18",
            "source": "rt"
        },
        {
            "content": "Absolutely stunning tension and presence from both Tracy and March, and their scenes together blew me away.",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "Well adapted from the play which it is better than. At least scriptwise.",
            "review_date": "2014-07-11",
            "source": "rt"
        },
        {
            "content": "EXTRAORDINARIA PELICULA GRANDES ACTUACIONES DE SPENCER Y MARCH",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "Inherit the Wind is a pretty good movie. It has a nice, flowing screenplay, and it stays pretty true to the play. I particularly enjoyed the Reverend Jeremiah Brown's outlandish and over-exaggerated performance.",
            "review_date": "2014-05-07",
            "source": "rt"
        },
        {
            "content": "An exhilarating courtroom classic.",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "I've heard about this movie for years but didn't see it until recently.  A great film. It has powerful performances by famous actors like Spencer Tracy, Fredric March and Gene Kelly.  I've always thought of Gene Kelly as just a song and dance man but here he shows he's also an excellent actor.",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "Saw this for perhaps the fourth time, this time part of a DVD binge during a snowed in winter.  Amazing how little has changed since 1925 when the \"Monkey Trial\" was held.  I think this is the kind of thought provoking movie that is interesting to revisit at various times of your life.  When I originally saw (as a kid) I had a real pro-science bias and just saw the white and black--creationists black, evolutionists white--of the argument.  This time I saw much more nuance and the question that intrigued me most was:  what do you stand for?  If you go through life taking the safe middle--\"I am not political\"--or the sophomoric stance of everything is worthy of sneering contempt--at the end of the day, what are you?  You have to take a definite position in life or you are just taking up space.",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "Simple, A MUST SEE. It's probably one of the most important movies about evolution and creationism.",
            "review_date": "2014-01-29",
            "source": "rt"
        },
        {
            "content": "Kramer takes his unflinching source material and brings it to the big-screen faithfully and without compromise and Tracy moves mountains with his fiery performance defending a Darwinist schoolteacher.\n*3.5/4*",
            "review_date": "2013-12-31",
            "source": "rt"
        },
        {
            "content": "Excellent 1960\"s drama whose topic has not (unfortunately) gone by the wayside of history.  This is one of those \"all-star cast\" dramas that is impressive, even today.  Spenser Tracy, Fredric March, Gene Kelly, Harry Morgan, Dick York, etc.  Even many of the bit parts are played by people we recognize today.   It's directed by the great Stanley Kramer (High Noon, Guess Who's Coming to Dinner), and it's a very good film.",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "Inherit the Wind proves that Stanley Kramer can take the most interesting of themes - religion versus reason - and make a bad, stagey, sententious film, one loaded with caricatures and cliches.",
            "review_date": "2013-11-07",
            "source": "rt"
        },
        {
            "content": "Slightly creaky now, Inherit the Wind remains a great Sunday classic to curl up with. Fredric March and Spencer Tracy give it their all as competing interests in the create Scopes monkey trial. Gene Kelly has a great \"commentator\" role as well.",
            "review_date": "2013-11-04",
            "source": "rt"
        },
        {
            "content": "Thought provoking with some great acting.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "Classic film.  One of the best films ever made.  What else can I say?",
            "review_date": "2013-09-30",
            "source": "rt"
        },
        {
            "content": "Amazing dialogue and an impeccable argument against bigotry and ignorance with science versus religion.",
            "review_date": "2013-06-15",
            "source": "rt"
        },
        {
            "content": "A film that illustrates America's greatest courtroom drama with a great magnitude of philosophical insight.",
            "review_date": "2013-06-01",
            "source": "rt"
        },
        {
            "content": "An interesting court drama about the largest of all debates Evolution vs Creation.\n\nSpencer Tracey truly owns this film with his subtle yet powerful performance as the Lawyer defending Evolution. \n\nThe story is structured around a young man who decides to teach Evolution & uproar starts in the local community.\n\nAlthough a little over the top in parts this film shows interesting perspectives of both, an insightful thought provoking film...",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "One of my most favorite movies of all time. \nThank you Ms. Crockett,(U.S.History Honors. freshman year)",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Amazing Great movie, enjoyed every moment of it.",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "Based on the famous Scopes 'monkey trial\" of 1925 (\"the good ol'days!  man, i wish we could go back!\") this serious work suffers from the heavy hand of liberalism weighty throughout.  Of course, when it was made, 1960, things were decidedly different which can explain the overdoing of things.  Anyhow, though it's lost some of its urgency none of its poetry has gone.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "Starring two battling greats in Spencer Tracy and Frederic March, with Gene Kelly as well, the film chronicles a fictitious version of the controversial Scopes Monkey Trial which acted as an allegory for the McCarthy era. March is the prestigious prosecutor on the side of Creationism and Tracy is the famed defense attorney fighting for a young schoolteacher (Dick York). The two spar back and forth on the touchy subject while staying friends outside the courtroom. The whole town backs Brady, condemning Cates and Drummond as evil. However, despite all that is against them, Drumond saves the case by bringing Brady to the stand. The two stars have commendable performances if not their best. Gene Kelly proves he can be a serious actor, playing the cynical newspaper man. The cast is rounded out nicely by Harry Morgan and Claude Akins. Here Stanley Kramer puts together a respectable movie version of the stage play.",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "The dialogue is absolutely magnificent in this classic film.",
            "review_date": "2013-01-25",
            "source": "rt"
        },
        {
            "content": "Well acted, and has great courtroom scenes. Thought it definitely could have been better.",
            "review_date": "2013-01-15",
            "source": "rt"
        },
        {
            "content": "As an atheist viewer, it was hard to make myself care about film. I found that the characters were arguing about a frivolous topic. However, someone really passionate about the value of religion in education should consider watching this film. Personally, what made me not walk out of the theater was the Kelly character (based on Mencken).",
            "review_date": "2013-01-13",
            "source": "rt"
        },
        {
            "content": "Despite being culturally significant and known for its great dialogue, I found this film to be extremely boring and quite dull. As well as having quite possibly the most annoying soundtrack ever.",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "\"Inherit the Wind\" is an awesome courtroom drama that brings to life (and fictionalizes) the events of the Scopes Monkey Trial.  While much of the truth from the actual trial is lost, the spirit in which this trial-turned-religious-debate was conducted is captured through the townspeople of this small southern town, the press, and the argumentative banter between Spencer Tracy and Fredric March.  The film is a bit frustrating as it represents Christians as a bunch of imbeciles but I suppose that's what this parabolic play needed to do to create its defense for intellectual freedom.  Regardless of the creation vs. evolution theme, the acting is fabulous in the overheated courtroom.  Comedy is occasionally interjected throughout the film but the majority is dramatic.  March speaks with passion and progresses from overconfidence to fumbling for words through dynamic (though sometimes annoying) acting.  Tracy is his standard wise-cracking self weaves together a convincing defense.  Gene Kelly adds a rare dramatic performance, stirring up trouble as the manipulative newspaperman while Dick York (the original Darrin) doesn't add much of anything to the film.  It may take a lot of flack for its historical inaccuracy, but there is no denying that Stanley Kramer's film adaptation of \"Inherit the Wind\" creates some of the most memorable court moments in film history.",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "The story of the \"Scopes Monkey Trial\" in 1920s Tennessee, about a schoolteacher who tells his students about evolution, only to have the religious leaders violently object.  Starring Spencer Tracy (as the Clarence Darrow character), Fredric March (as the William Jennings Bryan character), and Gene Kelly, with Harry Morgan.  A unique movie full of heated argument and drama, about a topic that is still relevant in modern politics.",
            "review_date": "2012-12-13",
            "source": "rt"
        },
        {
            "content": "Though bias, neither side in this movie comes off as perfect. I love this film because we see the timeless battle between Liberal and Conservative. The men and women in this film experience pride and experience joy, a longing to hurt others and a longing to keep those around them safe, a desire to progress and a desire to hold to what they know is right despite the changing pressures. The performances are heartfelt; I can't help but tear up.",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "Based on the real life 1925 \"Monkey Trial\" in which school teacher John Scopes was arrested and prosecuted for violating Tennessee State law by teaching Darwin's Theory of Evolution. From the very start of the film, as four man march through town - to the sounds of the traditional Gospel song \"(Give Me That) Old-Time Religion\" in conjunction with Ernest Gold's dramatic score - to arrest school teacher Bertrand Cates the tension starts to mount and we know we're going to be in for one hell of a fight. \n\nThe Creationism vs Evolution debate is at the centre of this trial but its the excellent performances of two heavyweights - Spencer Tracy and Frederic March (as the defense and prosecution counsel, respectively)  - going at it that really elevates this as one of the finest courtroom dramas in Hollywood history. The fact that actual dialogue was lifted from the actual trial only adds to the already upped stakes.",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "great drama seeing tracy & march go t it like 2 fighters in a boxing ring.",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "I love black and white, it brings a certain level of sophistry to movies.... Now that that's over. Inherit the Wind has some great performances and it's pretty good looking, but the lawyers don't look like lawyers and the story is not executed well enough to be great.",
            "review_date": "2012-09-11",
            "source": "rt"
        },
        {
            "content": "Science vs. Religion and with Spencer Tracey and Fredric March, along with Gene Kelly leading the fight, it makes for one intense and still talked about courtroom dramas of all time. \n\nGrade: A",
            "review_date": "2012-09-04",
            "source": "rt"
        },
        {
            "content": "No one does righteous indignation better than Stanley Kramer and Spencer Tracey. What his films lack in subtlety or even a pretense of being \"fair and balanced,\" Staney Kramer was somewhat the Aaron Sorkin of his time (and that's a good thing). This fictionalized version of the Scopes Trial is still frighteningly relevant today. This film and play it was based upon were done as a comment on McCarthyism and the communist witch hunts of the time, but it's still erily relevant when you hear the same right-wing condemnations of the media, invocations of the bible and unrelenting badgering still being done today to vilify most every progressive idea.  A great film all around!",
            "review_date": "2012-09-02",
            "source": "rt"
        },
        {
            "content": "This movie came out in 1960. The actual trial happened in 1925. It scares me how relevant this story still is.",
            "review_date": "2012-08-09",
            "source": "rt"
        },
        {
            "content": "Drummond for the win.",
            "review_date": "2012-08-03",
            "source": "rt"
        },
        {
            "content": "Just doesn't get any better than this.",
            "review_date": "2012-07-28",
            "source": "rt"
        },
        {
            "content": "Clear the decks giants are about to clash--Tracy at his zenith!!",
            "review_date": "2012-07-15",
            "source": "rt"
        },
        {
            "content": "Inherit the Wind contained much of Stanley Kramer's masterful styles, especially his use of overlapping, witty dialogue. However, I consider this as being his finest ever production, and not just because it was based on an equally serious play. For starters, the play was revolutionary for its time: few wonder whether the film was any the more or less so. Even with Kramer's usual wit and flowered debates, it still remained a memorable viewing for me. The acting was superb - there could hardly have been a more apt actor for the role of Clarence Darrow than Spencer Tracy, or H. L. Mencken than Gene Kelly (with, of course, Kelly's tilted ribbon hat reminding all of us of his previous musical film days!). In all, this is a must-watch film for all audiences, and it reminds us all the primitivism which the Western world took in response to the growing (and secular) tide of scientism. In short, it's a film I never expected to be in so much depth, and a film I will never forget.",
            "review_date": "2012-07-12",
            "source": "rt"
        },
        {
            "content": "Solid film, but suffers a little from a lack of subtlety, perhaps reflecting the era in which it was made. Fredric March (as Brady) is a ridiculous caricature, as are some of the other characters on the conservative side. Clearly the film has an agendum, but it seem unnecessarily hyperbolic at times. Nevertheless, there are some good moments, mostly from Spencer Tracy's character (as Drummond). The dialogue is quite excellent too.",
            "review_date": "2012-06-13",
            "source": "rt"
        },
        {
            "content": "It was the first movie of Frederic March I ever saw and I was completely surprised how good actor he was , Spencer Tracy and Gene Kelly was not far behind too .",
            "review_date": "2012-06-11",
            "source": "rt"
        },
        {
            "content": "Truly one of a kind.",
            "review_date": "2012-05-24",
            "source": "rt"
        },
        {
            "content": "Stanley Kramer directs Spencer Tracey in this great courtroom drama about the teacher who taught evolution in class. Spencer plays the lawyer from the North sent to defend the teacher played by Dick York. This movies theme is as relevant today as when this movie was made. Religion verses Science, it does not get any better than that.",
            "review_date": "2012-02-23",
            "source": "rt"
        },
        {
            "content": "What's most surprising is that, 50 years later, this sort of religiosity still very  much exists in America: ignorance really is bliss, but only for those who choose to remain so. Spencer Tracy's performance is perfect here: I adore his character, as well as Clarence Darrow, the attorney he was based upon.",
            "review_date": "2012-02-23",
            "source": "rt"
        },
        {
            "content": "A boisterous courtroom drama that examines the Scopes Monkey trial with aplomb.",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "One of the more thought-provoking plays to have come out of the transition between modernist writing and postmodernism, the classic satire \"Inherit the Wind\" analyses McCarthyism from all sides, from the popular opinion to the opposition. However, unlike most critiques of McCarthyism, it took a side nobody wanted to pick: the median that states that both warring sides are right in one way, but deadly wrong in another. In many ways, with all of those court cases in the South about the teaching of Darwinian evolution, it's still extremely relevant to this day. At the same time, with the rise of a progressive, more aware and open-minded version of Christianity, the play is looked at as a transitional work marking the transformation of America from a fundamentalist, unshaking ground to a country hellbent on progress and equality.\n\nIn that sense, the film is very similar to that. Save for some off-putting sappy moments, Stanley Kramer's \"Inherit the Wind\" marked another transition in Hollywood - that the film industry could take big steps towards depicting anything. In that sense, a lot of the things that make the play both relevant and merely a transitional figure are in place here - relevant in the fact that Ray Comfort, Kirk Cameron, and a few Hollywood select have attempted to \"reform\" it by turning it back towards the all-ages studio system, but transitional in the idea that Hollywood would be inspired to make edgier films (both by greed and by boredom) like \"The Pawnbroker,\" \"The Graduate,\" \"Easy Rider,\" and so on. However, it's not the historical value that makes this film so powerful. It's the acting and the dry wit prevalent throughout. Same as the play.\n\nThe acting is good. Like, scary good. Especially with Spencer Tracy as the agnostic Henry Drummond and Fredric March as the crazy Fundamentalist Matthew Brady, I get an idea on how this film works. Both of these guys are their characters - they rarely, if ever, display any of their trademark personas found in the bulk of their resume. They don't play as Spencer Tracy and Fredric March acting for a paycheck - they actually have passion in these roles. This isn't the tired, proselytizing \"acting\" that plagues Sherwood Baptist's pictures - this is true passion. True life.\n\nSo, thanks to high school, most of you know what this play is about: a fictionalized Scopes trial. Something that nobody should care about, but in the South, it was a big deal. Of course, the Scopes trial was made as a publicity stunt in order to show the unconstitutionality of a law banning the teaching of evolution (as in, \"this thing can potentially destroy freedom of the press\" unconstitutionality), but here, it's purely serious business. A town driven by religion wants this trial to affirm their faith - they don't want anything that could drastically alter the way they live, even if it's something as trivial as the theory of evolution. With that, we get three sides:\n\n1. Matthew Harrison Brady, the fundamentalist who thinks that everything in the Bible is 100% true. Like, the whole \"Cain's wife\" controversy, the fallacy of the fall of man (in a nutshell, how can Adam and Eve knowingly do bad if they had no knowledge of what is good or bad?), Joshua making the sun stand still for 7 days (a violation of physics), and the exact time of the days in the Genesis accounts.\n\n2. E.K. Hornbeck, the newspaper writer who is desperate to be so progressive that he disowns anything he considers \"antiquated,\" especially religion. He sees nothing positive in humanity, especially the things they make. He is the \"genius liberal atheist communist Democratic\" of the group - the Amazing Atheist, so to speak. He is similarly fundamentalist as Brady, but on a different topic: human pessimism.\n\n3. Henry Drummond, the straight man of the group. He's the defense attorney of the teacher arrested for giving some of his students a few pointers on evolution. He considers Brady a friend, so he can't fully throw away religion, but he knows that it is increasingly being superseded by new evidence in science, so he can't live by blind faith alone. He is the agnostic - the awkward middle ground between faith and pessimism. And he needs to prove a point to everybody - that neither faith nor solely looking forward will help us, but looking back at what we do and accepting change at the same time will.\n\nSo, why is this film a 4-star for me? Sappiness during a few dramatic sequences, the obvious \"let's trim out stuff in order to make our film more one-sided\" thing, and obvious symbolism. However, as a message film, it's original, it's bold, and it fights for something that it thinks is right: faith and science co-existing together, working for different aspects of humanity. Shame most people don't learn that when they look at the film.",
            "review_date": "2012-02-19",
            "source": "rt"
        },
        {
            "content": "Gene Kelly obviously could do more than just sing and dance. Despite co-starring in a movie with Spencer Tracy and Fredric Marsh, he absolutely stole the show.\n\n\"Inherit the Wind\" is a classic courtroom drama based on the famous Scopes Monkey Trial. When a young teacher (played by Dick York of Bewitched fame) is caught teaching Darwinism in a Tennessee classroom, he is arrested and put on trial. \n\nThe dialog in this movie is nothing short of brilliant. The theme of the movie, especially considering when it was made (1960), was provocative and powerful. The lone downside is that it can be somewhat slow at times.\n\nAnd then there was Kelly. March and Tracy were great as always playing rival lawyers both passionate about winning the trial ... but Kelly makes this movie go 'round. The famed song and dance man showed that he was more than capable of a dramatic role playing a sarcastic and cynical reporter who seems to smirk and make a mockery of the entire trial while sitting alongside the accused. The movie would have been merely good without him, but with him and his amazing screen presence the movie is an instant classic in my mind.\n\n10 Scale Rating: 8.0 ...",
            "review_date": "2012-02-07",
            "source": "rt"
        },
        {
            "content": "Gotta love a good courtroom drama.",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "78%\r\n\r\n\"Give me that old time religion!\"-Town's people of Hillsboro\r\n\r\nThe subject matter is still relevant today. Should Darwinism be taught in schools?",
            "review_date": "2012-01-31",
            "source": "rt"
        }
    ]
}