{
    "rating": 9.0,
    "release_date": "1960-04-19",
    "num_reviews": 190,
    "genres": [
        "English"
    ],
    "summary": "In Federico Fellini's lauded Italian film, restless reporter Marcello Rubini (Marcello Mastroianni) drifts through life in Rome. While Marcello contends with the overdose taken by his girlfriend, Emma (Yvonne Furneaux), he also pursues heiress Maddalena (Anouk Aimée) and movie star Sylvia (Anita Ekberg), embracing a carefree approach to living. Despite his hedonistic attitude, Marcello does have moments of quiet reflection, resulting in an intriguing cinematic character study.",
    "reviews": [
        {
            "content": "This film has two stories inside it - one of life and the other of death, each plays its half and by the end of the film you feel you have lived through so much revealed at the pace of the film. A film of astounding images and freedoms but reveals the ugliness and destruction of beauty it seeks to chase. A poignant and affecting film which is a masterpiece of cinema (now also in a restored version). Its opening scene is full of life and spirit and iv'e never forgotten it or the sadness of the final scene on the beach. It's a film about living to the full and in doing so exposes us to the excess that comes from hedonism but it draws us along for the whole ride and so we feel implicated in its resolution somehow. It's also a great piece of filmmaking art.",
            "review_date": "2023-03-28",
            "source": "rt"
        },
        {
            "content": "An unsettling but fascinating view of the rich and the lifestyles they have and how they cover it up so they don't reveal their unhappiness. Fellini masterfully divides audiences on the meaning of the film and Marcello M. is absolutely fantastic in this.",
            "review_date": "2023-01-18",
            "source": "rt"
        },
        {
            "content": "Brilliant but quite sad, ironically. Between this one and 8 1/2, we have two semi-autobiographical films that are pretty hard on the protagonist and his failures and faults. Beautifully filmed of course, and the soundtrack is perfect, just like in 8 1/2.",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "This is a fairly laidback and stylish film. I can understand it's appeal, it does have a bit of a classy feel to it I suppose, although it was a bit slow and somewhat bland at times for my tastes, at about 2 hours and 40 minutes long. Some of the dialogue is good, with thoughtful observations made, although you could also argue its a bit cheesy. It's worth a watch but it isn't a film I'd choose to watch again. I liked seeing the scenes with the characters in the soft top car. I also thought it was amusing at times how Marcello dealt with the photographers who hounded Sylvia (one in particular being called Paparazzo - I wonder if the term paparazzi was named after him? having looked it up online, it seems so). This is very much a film about the lifestyle of the 'haves' in the time its set (i.e. the 1960s). Yes I'd recommend this film, although I wouldn't go too far out of your way to see it, it's worth a watch if you get the chance to see it.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "A continuous form of Italian neorealism with an interpretive poetic structure that discusses the highs and low of pursuing happiness towards life's meaning, gorgeously filmed under a unique degree towards the epic descriptive genre being more humanely grounded while charismatically riveted by impeccable performances. (B+)",
            "review_date": "2022-07-08",
            "source": "rt"
        },
        {
            "content": "The thing about La dolce vita is that although it is a great film, it's definitely not a pleasant one, and quite frankly it doesn't happen everyday to encounter an unpleasant film that's extraordinary. it's quite noticeable at how the events of the film are disconnected, the entire film is separated into different episodes and each episode is a step closer to the downhill of Marcello. you start to feel suffocated and presume that the plot is all over the place, except that you miss the point which is that Marcello's own life was all over the place and there were no other way to authentically depict a miserable man's life than the one Fellini did.",
            "review_date": "2022-06-07",
            "source": "rt"
        },
        {
            "content": "The best movie ever made. \n\nThis time what really struck me was Steiner and the consequences your actions have on the people around you. \n\nMarcello starts off annoyed by his wife, but with enough decency to care for her. He slowly gets more impatient and angry until he loses all caring for her. This is when the most desperate and sad version of himself comes out in the last chapter. \n\nSteiners philosophy really struck me this watch. Marcello was surrounded by prophets giving him life advice that he would proceed to do the opposite of, perhaps he didn't understand or perhaps be didn't care. Steiner did understand and he did care, but he was too old by then, he was already Marcello and had no way out any longer. His children would be raised in a world he thought so little of and himself that to combat this struggle he killed his children and himself. Was this the right thing to do? Naturally we would say no because it's murder, but what we're Steiners other options.\n\nThe biblical imagery was very prevalent too, of course the Jesus statue at the start where the girls can't here Marcello and the disgusting creature at the end where Marcello can't hear the girl. I also found it very disturbing that this castle once lived in by popes was no occupied with sluts and almost any kind of sin imaginable. How could anyone have the heart to play the ouji board in a place once lived in by popes. The maddona sighting is also scandalous, children taking advantage of the media by faking something so meaninglfull and symbolic is something only someone as bold as Fellini could do.\n\nMarcello's father is still a heartbreaking representation of Marcellos future, Steiner is the version that acknowledged his mistakes, and Sylvia is Marcellos past. And the girl across the river is the hopeful version of what could have been, ending the film on a surprisingly happy tone.\n\nTechnically, the film was shot beautifully, the shots are less about what looks best and more about what achieves the mood and tone best, but there are plenty of painting like shots too. Every shot is subtley beautiful with great depth and black and white is used to its highest potential, its surprisingly more white then black. The music was fantastic and contradicting, another aspect of the movie is that it is extremely hypocritical, especially in the fourth chapter, a personal favorite of mine. Marcello meets with very wise poets and writers, this is where we see Steiners true feelings very subtley. That sense of hope mixed with dread is incredible in this film. \n\nThe screenplay is one of the all time best. Every action is so precise and every part of it had great meaning towards the whole film. Not a single scene is wasted and it is so smart in how it handles its subject matter.\n\n10/10\n\n\nMy Chapter Ranking - the reviews will be shorter because I've already gone in detail with many segments in my overall review.\n\n1. Chapter 4 - the chapter that most exposes the beliefs of our characters and the themes of the film with an incredible first shot, pure pointless dialougue in a single room that is so interesting is beyond impressive. Steiner's situation is enthralling and this is definitely a segment you have to watch twice.\n\n2. Chapter 7 - The chapter where everything breaks down around Marcello. Steiners incredible payoff is something that really makes you think. Marcellos pitiful actions at the party are disturbing, but unbelievable human. The great dialougue segment where Marcello and Emma express their feelings with incredible writing and performances. The symbolism at the end mirroring the start of the subtle hope in the girl offer great payoff for the building emotions you feel throughout the three hour runtime.\n\n3. Chapter 5 - The story of Marcellos father is heartbreaking while also being a cautionary tale for the not so distant future of Marcello. His father has fallen into desperation that he can't handle. More great character traits bleed through the very dialougue heavy segment, especially Marcellos embarrassment of his father's actions and the whole scene is very uncomfortable in the way his father presents himself to Fanny.\n\n4. Chapter 2 - The beautiful Sylvia represents fresh fame and the soon to come turmoil. The trevi fountain is one of the most magical and unexplainably amazing scenes in all of cinema. The language gap is so realistically painful to watch and the lack of payoff is really the most payoff this segment could actually achieve.\n\n5. Chapter 6 - The most disturbing and fantastical chapter of them all. The actions done in this once holy and sacred castle are the most disturbing and uncomfortable of the entire film. The perfect chapter to have before everything went to disaster. \n\n6. Chapter 1 - A statue of Jesus being carried by helicopters feels wrong while also feeling within good intentions. The actions that follow offer a new and constantly changing angle at what this represents. The rest is more set up for the rest of the movie and really just offers a great entrance to the film without particularly doing much.\n\n7. Chapter 3 - If I could remove any chapter it would be this one. I appreciate the bold move to have children exploit such a meaninglfull thing, but feel this chapter lacks the most in the bigger picture. This one is all about the media and while the media is a huge part of this movie, it's not exactly a prevalent part to its plot and themes.\n\n\n\n\n\n\nHow come the best movies always start off seeming the opposite, I found this movie boring, confusing, and uninteresting the first time around, the same for 2001, a thought Bonnie and Clyde was very flawed but nonetheless enjoyable, and I disliked many of the choices in The Godfather and had a personally terrible experience watching it.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMy other reviews...\n\n\n\n\nFirst Fellini Movie\n\nApril 25th\n\nI didn't get this one, some movies are so legendary that it's more that you didn't like it personally than it not being a very good movie. I love to think of its themes, but find the movie much more boring. None of the characters had much character and it never seemed to have plot. Most of the time I had no idea what was going on. The main reason why I even wanted to watch this movie was for Sylvia and she's only in it for about 15 minutes. I really enjoyed the last 25 minutes as I started to piece together what this whole movie was about, I'll have to watch the rest of the movie agian with more knowledge and maybe more patience. If this movie came out today it would be a sex filled surrealistic nightmare and it kind of already is as close to that as you can get in 1960. It was much more disturbing than I thought.\n\nThis will be my favorite movie, someday.\n\nThis might be the first movie that I was too young for, I was very confused by the characters actions likely because I have never felt their emotions, Roger Ebert wrote a great review showing how his feelings on this movie changed as he got older. 7/10\n\nApril 26th\nIt's trying to juggle so many themes, but it doesn't fall apart because of the way it's structured, the question is what does it all mean for Marcello.\n\n\n\n\nMy Analysis\n\nWatching this is like watching an entire lifetime, its a plotless set of short stories across seven days destroying Marcello into desperation, the good life can be seen in many ways. The good life can be before the movie starts or it can be the sin throughout the movie. Marcello seems like a detached character, but he is what we all have fantasies of being, intelligent, well liked, rich friends, and lots of sex. The moments that really expose this supposed \"good life\" are the uncomfortable actions of Marcellos aging father trying to get with a woman half his age only to feel ill and leave Rome and Steiners death. Steiner was different, he saw the flaws of the lifestyle, he said subtle things his friends didn't catch. Sylvia represents the start of fame, the glamorous parts of the lifestyle, and something just out of reach for Marcello. Literally, he wants to have sex with her but feels so detached from the language gap that he doesn't know how to. Figuratively, it represents what he has now left, he used be like her, but now he is broken and things only get worse. I found it interesting how the last we see of Sylvia is her being beaten, I first found it dumb that there was no resolution. This movie is as first person as it gets and as realistic as it gets. It takes the basic screenwriting technique of a character running in to other characters that teach him something to the extreme like a fairy tale, only he doesn't learn and ends the movie hopeless. I now realize that the last moment of Sylvia represents that she too will end up like Marcello. Marcello runs into many things, but he doesn't stop them or think much of them, something not so out of the ordinary for someone living this supposed good life. It starts with men holding up a statue of Jesus happily feeding into their desires and ends with them broken after a failed and desperate attempt of happiness, they are on the other side of opportunity symbolized by the gap between Marcello and the young aspiring girl.\n\nPaparazzo is a metaphor for what triggers these characters feelings, at first they love it when he takes their pictures, later they see him as a nuisance they can not possibly get away from. The Maddona sighting represents greed and messing with people's emotions for their benefit, just like the paparazzi. The paparazzi use it being their job as the reason they are aloud to do it and the children are innocent children brought on by parents who raised them this way.\n\nWhile being such a sad, miserable, and uncomfortable film, La Dolce Vita has many small bits of hope throughout its three hour runtime and it really depends on your mood whether you will see them or not. It's genius, this is really a movie you could watch multiple times and always find something new or experience different emotions.\n\n\nFor now I'll give it an 8/10 or a 9/10 because I was not very entertained and was extremely thrown off, next time it will probably be a 10/10, maybe even the greatest movie I have ever seen.\n\nI won't say your wrong if you critizice this movie for feeling like it's a film students homework, but I personally love analyzing films.\n\nI believe that if you know what your in for, this can be one of the most immersive films that really plays with your emotions, I think that the people that didn't enjoy it were not expecting this to be such a tough film to watch. It's very Lynchian before Lynch even made films, but when you go to a David Lynch movie you have a certain mindset, this movie doesn't advertise that mindset and achieves it much more subtley and uncomfortably. 9/10\n\nIt seems like a movie that could be directed by Gaspar Noe,but then it would be ruined by his empathetic point of view.\n\nThere are hardly any analysis out there and I'm glad, this is one where you have to look inside yourself for meaning.\n\nLike The Graduate, this movie will always be a beautiful painting, but your opinion of the art will change as you grow older, and an even more extreme and worldwide example would be The Birth of a Nation.\n\nThis movie gave me a whole new look on surrealism and how it's actually more effective for the events to be in reality.\n\n\nApril 26th, review from alt account\n\nThe greatest movie of all time, immersive in a whole new way, incredibly disturbing and real in a way never seen before, rich in meaning, and beautiful.\n\nAnita Ekberg is the most beautiful woman ever and was originally the only reason I wanted to watch this movie. 10/10",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "The movie is best understood from the context of existentialism. There are so many scenes that illustrate the absurd and irrational in life. Marcello is grappling with his own life - career, love, perhaps a dream to write. I believe this is the best film ever made.\n\nThe opening scene with the flying Jesus statue on cables suspended from the helicopter signifies atheism which is rather common for existentialists, and perhaps life's mixture of religious with mundane. But the scene is surreal. The statue shadow rises on the apartment building like Jesus ascending to heaven. Also, in the opening scene the photographer and helicopter crew want the girls sunbathing on the rooftop pool to remove their tops, but they misunderstand they want their phone number, etc. Across the impassable gulf between any two people there is often no understanding. Closing scene likewise has Marcello and the pretty girl from the cafe (where he was trying to write with the Lettera) failing to communicate across an expanse of water.\n\nThe woman he first meets and spends the night with, Maddalena, has beautiful large eyes with sensuously curving eyelashes at the outer corners. The only thing keeping her going she says is love. Toward the end at the vacant mansion she admits her love to Marcello and asks him to marry her while admitting she would just whore around. He would, but she has already turned to another lover at hand. Meanwhile his fiance thinks only of bed and food, but Marcello says, \"I don't believe in your aggressive clinging maternal love.\" The fiance is clutching, crazy, jealous and possessive. They have a bad breakup, but, nevertheless, they are together again at the end. It doesn't make sense, but that's life.\n\nA couple kids claim they saw the Madonna on a tree in a remote area on the school bus. So a crowd gathers along with lights and media. Sick people come to pray for healing. The kids shout \"There she is\" and run toward the spot a couple times exciting the crowd. It rains. People tear pieces off the sacred tree.\n\nHis father couldn't make love to the French dancer girl, so he was \"ill.\" Notice him tidying up the wrinkled bed before he goes.\n\nHis friend Steiner shot himself and his two daughters. Marcello had greatly admired him. He was sensitive, reserved, had a beautiful wife, family, large house and smart friends all gathered together. It seemed absurd and random and without reason. But Steiner had said he felt trapped by convention, family, success.\n\nThe woman on the divan asks what people wanted. Steiner wanted to live beyond passion and emotion. The woman wanted to live in the moment. The fiance didn't know what she wanted (simple-minded). Marcello says he is wandering through life.\n\nAt end of the movie fishermen drag in by net a huge fish (ray?) excitedly talking of such a profound animal and the fortune it may be worth then just leave it abandoned on the shore to rot.\n\nThe nun's hat (at the hospital) was ridiculous - like a gigantic origami on her head with gull-wing tips and a huge crown.\n\nShot in black & white with crisp whites and blacks not too dark - very well done.\n\nNotice the large spaces, deep views of halls, colonnade, etc.\n\nThat's what it means to me, but in art as in life you have to make your own meaning, your own way.",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "What can words do when you have such images?",
            "review_date": "2022-03-24",
            "source": "rt"
        },
        {
            "content": "A film that is superficial even though it is truly totally empty. Fellini's best film yet. 8/10",
            "review_date": "2022-01-18",
            "source": "rt"
        },
        {
            "content": "An absolutely glorious film in every way. I cannot truly do it justice myself so would simply advise anyone to read Roger Ebert's review, in my opinion his best ever, it says everything I would want to and more and says it beautifully.",
            "review_date": "2021-08-17",
            "source": "rt"
        },
        {
            "content": "An influential and stylish masterpiece that, even with the years have passed by is still -and probably will always be- an unforgettable and everlasting piece of art about all the noise in the world.\nMarcello Mastroianni is on fire!",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "I think that writing a review of this movie is quite impossible. In 3 hours Fellini touches so many points that any comprehensive review would become a dissertation (and I'm quite confident that many have been produced). What struck me the most is the paradox of man: we became so intelligent and introspective that depression is always lurking behind the deepest doubts and fears we have the privilege to feel. So much that we might need to become animals again to live carefree lives, just like Marcello.\nNeedless to say, the movie is masterfully directed and acted: the legendary status of this movie speaks volumes, just behold!",
            "review_date": "2021-05-13",
            "source": "rt"
        },
        {
            "content": "A beautiful depiction of struggles an intellectual face when the basic needs are satisfied. Great screenplay, excellent performance by Mastroianni, magnificent camera work result in a warm summer atmosphere of Rome and its inhabitants.",
            "review_date": "2021-02-14",
            "source": "rt"
        },
        {
            "content": "With 1960's La dolce vita (The sweet life), Fellini truly hits the sweet spot of his career.  The rapid economic turnaround happening in Rome and elsewhere leads the by-now supernova-hot filmmaker to deep-dive into the decadent malaise that is indeed infecting the soul of The Eternal City.  For gossip journalist Marcello (played by Fellini surrogate-among-surrogates Marcello Mastroianni), the existence of party after party and woman after woman is a soul-eater.  A simple boy from humble Rimini, Rome has become his… but was never his.  Certainly, it's not now, what with soulless postwar constructions sapping the character out of the landscape, newly flanked in utilitarian blankness.  He too is built up thusly but devoid of what should be there.\n\nFellini has spoken of how La dolce vita is a rumination on what happens when the notion of sin exits a culture.  It's not the first time Rome has danced with the Devil in this particular way, though Fellini's exploration, for all its moral and ethical weight, is as secular as could be.  Nevertheless, the cost of a life lived amid consequence-free everything is laid bare in the film's final minutes.  There are no answers, only an indelible acknowledgment.  And for this, that's more than enough.  La dolce vita itself is something beyond a masterpiece.  It is an eternal paean and forever-echoing lament of both the human condition in the second half of the twentieth century, and a vital cinematic statement of its own time.  We may never be able to resist Anita Ekberg as she wades into Trevi Fountain, though Fellini makes it clear that the seduction towards the high life is, in the end, anything but sweet.",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "Great movie, with awesome photography, nice actors, and very joyful plot.",
            "review_date": "2020-11-06",
            "source": "rt"
        },
        {
            "content": "Another of Fellini's incredibly distinctive, entirely remarkable films, La Dolce Vita combines an effortless style with profound and thought-provoking analyses of modern culture and the choices that influence one's lifestyle. Following a single individual (Mastroianni's Marcello) through a rotation of vaguely interlinked scenes and a host of unique characters, the film is at once superficially engaging while simultaneously building up a complex portrait of an individual caught between two worlds - the surface-level glamor of the pulp newspaper entertainer, where he can indulge in delights but never belong, and the spartan but fulfilling position of the intellectual; his decision takes place in a kaleidoscope of lust, disinterest, ruminations on one's place in the world, and a desire for personal attainment. Ultimately, he ends up isolated and dulled to any sensation, a kind of mortal purgatory a la Dante, in which those who fail to choose suffer the most of all. A masterpiece of world cinema, less dreamlike (and less self-fellating in its treatment of the director's art and filmmaking in general) than Fellini's own 8 1/2, but every bit as interesting and engaging. (5/5)",
            "review_date": "2020-10-28",
            "source": "rt"
        },
        {
            "content": "A long exercise in misogyny, albeit nicely shot.",
            "review_date": "2020-09-15",
            "source": "rt"
        },
        {
            "content": "Parts of this film are 8 or 9 out of 10 but the final half hour in particular are a sprawling boring mess. I don't really know, nor can I be bothered to figure out the meaning to it all. Fun, irreverent and almost trippy at times, Fellini explores his favourite themes as always, multiple women, relationships, marriage, sex all through the lens of a misogynistic eye. It has his typical flair and style, not to mention the staggering Anita Ekberg who basically steals every guy's lust in her all too short appearance. She's probably going to be my lasting memory of the film as well as the love confession via a hidden fountain which was slightly genius. Overall though, it's about an hour too long which is unforgivable.",
            "review_date": "2020-08-22",
            "source": "rt"
        },
        {
            "content": "Fellini's dreamy celebration of life and critique of excess.\n\nFederico Fellini's Italian arthouse comedy-drama La Dolce Vita (1960) is a phenomenal testament to life's joys like love, friendship, parties, drives, food, music, dance, art, films, poetry, and philosophy. However, Fellini cleverly satirizes the wealthy elite class who live exclusively with excess as they make love and cheat on their spouses, drink until they blackout, party all night, and consume with reckless abandon in dark rooms with shallow conversations.\n\nFellini's direction is fascinating as he genuinely displays Rome of the 1960's as a beautiful, lively city, while also portraying its shallow rich with a careful lackadaisical attitude. Fellini's cinematography is lovely using long panning shot and striking wide shots everywhere, only allowing close-ups on the miserable few wallowing in their own sadness as they drink and sleep their sorrows away.\n\nFellini and Pier Paolo Pasolini's script is lush with witty social commentary, funny observational jokes, and shockingly real relationship drama. Nino Rota's Italian score is interesting as he composes lavish Italian symphonies alongside worldly sounds for a massive variety of acute sonic awareness of each scene's atmosphere. The pleasant party music is all 60's camp fare that feels as fun as these ridiculous parties on screen.\n\nMarcello Mastroianni's lead acting performance is an intriguing and entertaining combination of charming womanizer cheating on his adoring lady, lazy tabloid journalist getting seedy and salacious stories, party fiend seizing the day until he's not fun anymore, and drunken fool who becomes mean the more faded he gets. He is a handsome Italian actor who is charismatic and compelling. His silly antics are fun to watch with his whimsical frivolity, while his dramatic flourishes of rage and frustration are convincingly intense as he hits women and screams in anger. No wonder he remains Italy's most beloved actor of all time.\n\nYvonne Furneaux is lovely and endearing as Marcello's upset jealous fiance Emma. She is very relatable since she simply wants someone to love her and be just hers. You sympathize with her plight, especially compared to the cruelty and selfishness of Marcello.\n\nI must mention the sexy Swedish actress Anita Ekberg, who is charming and voluptuous, but only present in La Dolce Vita for a brief entertaining segment. Her fun loving wildness is alluring, but you also feel empathy as all these shallow Italian men treat her like meat and her cruel alcoholic husband beats her. Miss Ekberg sure was a femme fatale like Jayne Mansfield or Marilyn Monroe. Likewise, I enjoyed Anouk Aimee's mature Italian socialite character Magdalene with her enticing flirtations and endearing ennui.\n\nIn short, La Dolce Vita is a very entertaining watch that will take an entire afternoon out of your day, but I'm sure you'll appreciate the things that matter in life more after seeing Fellini's comedic masterpiece of cinema.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "Regularly cited as one of the greatest films of all time. Would not be my personal favourite, but can see the reason this accolade exists with its interesting characters, critique of celebrity worship and frenetic energy. I preferred the old school classics 'Citizen Kane' and 'Casablanca' to this piece, which was perhaps due to 'La Dolce Vita' feeling a bit more challenging. Its meandering plot was potentially a reason for my lesser engagement - a counter argument could be this loose narrative being used as a tool to successfully portray the hectic and childlike lives of the upper echelons of society whose search for fulfilment across numerous parties is never truly satisfied. The sound being dubbed post-filming was noticeable at points, with some sections feeling out of sync. Able to get used to this after some time, but it does make it seem disconnected in places. Although memorable and important to watch, the messages and statements made registered with me more strongly than the overall enjoyment of the film itself. That being said, there were still amazing moments scattered throughout. The hustle and bustle of Rome was an excellent setting, including its various oddities and quirky nightlife. Flawed and broken characters were a major strong point, with the fountain and dancing scenes being a sight to behold. I also enjoyed a part where two children said to have seen the Madonna were followed by a manic crowd and had their story covered by various news outlets, alluding to needless sensationalism and hysteria that can ripple throughout society. Tragic moments being photographed and reported upon for means of producing news stories to please the masses was thought-provoking. Popularising the term 'papparazzi' based upon one of the photographer characters (paparazzo) makes for an interesting bit of trivia. The idolatry of fame and status was well-perceived, where we witness photographers and journalists surrounding the celebrities of this world (with multiple cameras snapping away) feeding their expanding egos. This central idea towards viewing and watching the lives of others for entertainment is greatly captured, and perhaps ever more prescient in our modern social media age.",
            "review_date": "2020-06-21",
            "source": "rt"
        },
        {
            "content": "Federico Fellini's magnum opus features a great performance by Marcello Mastroianni in one of the greatest foreign language films ever made.",
            "review_date": "2020-06-01",
            "source": "rt"
        },
        {
            "content": "Fellini enchants the audience and draws into a labyrinth which is all at once alluring, hysterical and hypnotic; the viewer may find it difficult to find their way out afterwards.",
            "review_date": "2020-05-27",
            "source": "rt"
        },
        {
            "content": "undoubtedly a great film for 1960. today laudable but difficult to enjoy",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "First off, I know this movie is old but as I was watching it I so desperately wanted to go to Rome. The beautiful Black and white cinematography done by Ontello Martelli of the city was amazing since it all took place in Rome. It just looks amazing, for the time this film was shot the camera angles and the acting in my opinion was very well done and I love romance between the movies leads. It's like a love triangle in the sense they are two very beautiful women. One thing the movie does is capture post war Europe in a nutshell and how many things aren't the same afterwards kinda like the Corona Virus is doing to our modern day society. It oddly is a world that I would like to live in.",
            "review_date": "2020-05-12",
            "source": "rt"
        },
        {
            "content": "Non ho colto il significato profondo del film. Molta estetica, molta superficialità, esposizione dell'agiatezza dell'alta borghesia. Sorprendente la moderata tolleranza della diversità sessuale, possibile solo laddove presente l'abbondanza (bonazzo il travestito bruno). Per il resto non sono stato granché colpito. Steiner è l'unico personaggio che dice qualcosa di interessante, ossia che ci vorrebbe distacco dalle cose per viverle serenamente. Infatti lui si ammazza non prima di aver compiuto una strage. Tragica contraddizione. \nForse un giorno mi ricrederò, ma \"La dolce vita\" non mi è parso niente di eccezionale.\n\nEdit: ignoravo che il film è stato uno dei primi a mostrare le gioie del libertinaggio e il dramma del suicidio, Fellini fu ostracizzato dal mondo cattolico, censurato dal perbenismo dilagante dell'epoca. Un vero e proprio scandalo, ma la gente si accalcò per vederlo. Io non ci ho visto niente di che perché proprio grazie a La Dolce Vita le scene libertine e il suicidio sono diventati accettabili. Questo film è stato l'inizio della apertura mentale di cui godiamo oggi.\n\nEdit 2: Okay, okay, piú si scava piú si trovano cose pazzesche. L'omosessuale è Giò Stajano, prima icona gay e trans italiana. Fu lei a ispirare la scena della fontana di Trevi! Fellini vide una foto di Stajano nella fontana con delle amiche. Insomma è merito di Stajano se al mondo esiste una scena cosí famosa ed evocativa.\nNel film traspare anche la forza dirompente del rock and roll. Il fatto che il film non sortisca scandalo nel 2020 è segno della conquista di molta piú libertà individuale.\n\nEdit 3: Okay, dopo aver scoperto che per quelle scene con i travestiti Dominot e Carlo Musto la polizia e i democristiani si allearono per impedire ai gay di vivere non posso che apprezzare La Dolce Vita. Grazie a Fellini ho scoperto dello scandalo dei balletti verdi, ho conosciuto meglio il personaggio di Dominot e il fatto che i sedicenti eterosessuali prima del '68 andavano volentieri con i femminielli. La pansessualità è insita in tutti noi.",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "La Dolce Vita composes an epic mosaic of passions and tragedies with a steady grip that shows Felini at his peak alongside a charming performance from Marcello Mastroianni.",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "Follows a paparazzi journalist around for several days and mainly nights through the cafes, bars and homes of the fashionable and wealthy, the stars and the aristocracy of 1960 Rome. It's a journey of philosophising, drunkeness, womanising, contemplation... And the cinematography is absolutely brilliant.",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "A terribly dull film. I have no idea why it is rated so high, the only section of interest are the short scenes which stars Anita Ekberg. Everything else IMHO has aged extremely badly.",
            "review_date": "2020-01-03",
            "source": "rt"
        },
        {
            "content": "Amazing experience. A must-see movie that you'll want to watch over and over again.",
            "review_date": "2020-01-02",
            "source": "rt"
        },
        {
            "content": "The biggest load of nonsense I've seen in a while. If I didn't have a translator at the time, I would have thought the video, audio and subtitles were completely disjointed.",
            "review_date": "2019-12-25",
            "source": "rt"
        },
        {
            "content": "Yes it is a beautiful movie but it really doesnt go anywhere, and three hours of this is just too much.",
            "review_date": "2019-06-21",
            "source": "rt"
        },
        {
            "content": "A three hour adventure with memorable characters.",
            "review_date": "2018-10-30",
            "source": "rt"
        },
        {
            "content": "Grazie Federico, Grazie Marcello.",
            "review_date": "2018-04-25",
            "source": "rt"
        },
        {
            "content": "Another lost Flixster rating.  1001 movies to see before you die.",
            "review_date": "2018-02-11",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 6.0\n\nSin una trama fija, La Dolce Vita puede resultar un profundo viaje introspectivo hacia los anhelos humanos y requiere de un fino sentido de apreciación.",
            "review_date": "2018-01-18",
            "source": "rt"
        },
        {
            "content": "If you asked me what this movie was about I couldn't tell you, but it was so fun to watch anyways. It was very beautiful and so iconic with some of the scenes in the movie, I really loved it.",
            "review_date": "2017-12-15",
            "source": "rt"
        },
        {
            "content": "Mastroianni es genial. Fellini relata la historia (sin historia) de la vida, la \"pasión de la vida\". La belleza inalcanzable de Sylvia, la inocencia inalcanzable de Paola. El vacío del  mundo modernos; la esperanza del calor familar de Steiner.",
            "review_date": "2017-11-18",
            "source": "rt"
        },
        {
            "content": "Not a fan of this Fellini movie. Didn't care about any of it.",
            "review_date": "2017-10-24",
            "source": "rt"
        },
        {
            "content": "A delicious, European treat, suffused with melancholy, beauty, and complexity.",
            "review_date": "2017-08-28",
            "source": "rt"
        },
        {
            "content": "'La Dolce Vita' is an extraordinary film, a grand and long fresco of episodes (its length, that's true can exhaust some - though every moment of it is completely justified).  It's an apotheosis of artistry and style, an ecstasy of beautiful, sensual and sculptural images which once gathered deliver their true bitterness, the bitterness of the easy pleasures  and the debauchery experienced  by cheap journalist Marcello (Mastroianni), a man who dreamed of literature and art and who falls in the softness of its bright - yet aimless life. Remarkably structured, 'La Dolce Vita' alternates sequences of day and night, following Marcello and its encounters in a starry, elegant and surreal Roma, an open theatre showing sparkling monuments shot in a stunning modern manner.",
            "review_date": "2017-08-24",
            "source": "rt"
        },
        {
            "content": "Much like its contemporary, L'Avventura, La Dolve Vita perfectly captures the ennui and amoral listlessness of the idle rich. Fellini is captivating at his best.",
            "review_date": "2017-08-05",
            "source": "rt"
        },
        {
            "content": "Fellini manages to put together in \"La Doce Vita\" an impeccable feat. It suggests in parallel and through the fable, a trajectory of the journalist Marcello Rubini that unites and builds the story at the same time, does not present and does not pretend to be a concise narrative. A film structured from the perspective of a chronicler of life, with reflections, criticisms and comments elaborated through a poetic language, where Fellini wisely uses the symbolism, and presents clear references to German expressionism and \"noir\" cinema.\n\nIn the credits that begin this work realized in 1960, already deserves attention the group responsible for the script, besides Federico Fellini himself who directed and co-written \"La Dolce Vita\", there are expressive names in the construction and expressivity of the Italian cinematography, such as: Ennio Flaiano, Tullio Pinelli, Brunello Rondi and Pier Paolo Pasolini. Told with such a diverse group of writers who were also thinkers, critics, directors, philosophers, teachers and journalists, the option of dividing the film in a prologue, seven episodes with subdivisions, and an epilogue becomes more noticeable. Still, we have a whole, that is, all divisions and subdivisions are consolidated into a homogeneous whole and yet separate and conscious and necessary for the construction of this social critique, full of metaphors and symbologies for a future local (Rome), but Which is a microcosm of a global situation, an emptying of our lives, where we act more like puppets shaped by the influences of great powers, especially the American, and by institutions (religion, society, politics, family, education ...) that , At the same time, suck the original sweetness of life and dictate an artificially sweetened form, which leave a bitter taste in the way of life.\n\nBy accompanying for seven days and nights the trajectory of Marcello Rubini (played by the excellent Marcello Mastroianni), a celebrity journalist living in Rome who self-questions his craft and his life, mainly because he does not have the sensation of happiness , Nor so much of realization, who both (life and profession), projected or promised. So we have a protagonist who is basically driven by emptiness and the search to fill it, moreover, his search is crossed by the contact with several people, who basically only express the same feeling of Marcello, and when we have a figure of apparently life full , So we can visualize the facade of this appearance, as in the life of the millionaire, father and intellectual Steiner (Alain Cuny), a figure at first glance enviable, but who intimately lives under the despair and anguish of not being able to stand out, produce and Keep yourself in the position and level that arouses such admiration.\n\nBetween the initial scene of the film, a helicopter carrying the image of Christ, flying over the city of Rome to its destination that is the Vatican, and during the journey we have Marcello trying to communicate and conquer some girls who were sunbathing on the roof Of a residence. The attempt of communication is metaphorically weakened, not only by the noise of the helicopter, but by various conditions and situations that reflect in the incommunicability of modern life. And this character of non-communication is something present and consequently characteristic of La Dolce Vita. I can cite another striking example of this, the relationship between Marcello and the millionaire Maddalena (Anouk Aimée), with all the differences of social class and life styles, these two figures complement each other in the void and in the search to understand and fill these gaps , But at the same time they resemble the sense of emptiness, they individuate themselves in such a way that they are not heard, they are not able to perceive the similarities of needs, and end up having one for the other as a temporary object for Fun and punctual use.\n\nFellini's choice to perform this production using the black-and-white image of a life that, conversely, propagates to the title is limited in two tones, and that among so many goals, such as criticizing the archetypal form of American influence Especially the American films), in short, collaborate (merit for the work done by Otello Martellina), in the metaphor and narrative of the story. Using a photograph of thick contrasts between light and shadow, providing the game of a life between appearances, mainly indoors, versus the solar of external life that presents the hardness and urban mass, and that camouflages again in the dark night that Is illuminated by the artificiality of lights, bars and party houses that reflect neon and the insatiable flash of the cameras when recording the various moments of famous figures, celebrities, who between so many moments capture even the idleness and banality common to any being , And yet a target of interest and curiosity of non-famous people, mainly because of the desire to deceive an enviable or objective lifestyle, in the face of the insignificance of ordinary life.\n\nThis deceiving tone is very well represented in the various performances, as well as in the work of art direction and costume, which have in common the dimension of openness artificial and that tries to veil reality, as in large houses and even castles with beautiful facades, But inside that are real ruins, such as the very identity of its owners, who hide in makeup, lights and costumes of external and fragile beauty in the face of the decadent interiority of these people, this difference of exterior and interior was a stimulating motor for the Creation of Fellini, since the dress worn by the ladies of that time, whose fashion was dressed in bag style or \"dress bag\", aroused the curiosity of the director by its frame that can present and pretend the body, and a very beautiful woman, But it can also hide a skeletal being of misery and loneliness. Something that we can identify as common to all the characters, always attached to a beautiful façade, highlighting the character of Marcello Rubini in another majestic work of Marcello Mastroianni, who can establish very well the subtleties and dramatic curve of the character, As well as the clear trace of graphic oscillations of a life that oscillates in times of peaks of a doubtful origin of both happiness and anguish and sadness.\n\nCuriously, the figure of the photographers of celebrities, that later and because of this film, happened to be called worldwide of \"paparazzi\", due to the personage \"Paparazzo\", interpreted by Walter Santesso, in fact, this group of photographers of the film, seem more occupy A position of parasite of the life of others, there are no reflections on their work, so little about their attitudes, only reveal themselves in the thirsty desire to invade the privacy of others and get the best photo, the best moment that arouses the curiosity of the public that will consume The printed or television newspapers, something that as a public of \"La Doce Vita\", we are in part, equal, since we are placed in a point of view that tries to deepen in the curiosity of those lives, and by the cutback realized by Fellini , Since in this film, his approach is dimensioned in the lives of a class in position and much more favorable condition, compared with the common life, even the photographer M Arcello Rubini, is in an economically privileged situation, which often appears to be a crisis that oscillates between the discourse of a privileged class who experiences dull moments in having their lives as material of interest by placing them in a model place or Another crisis of the age of the journalist in dreams and promises of life as a young man, and now, at maturity, they are unreachable. With this we have in the proposal made by Fellini, the registration and the use of a (privileged) form, which confuses and generates moments that makes his speech unfeasible.\n\nHaving only this caveat, \"La Dolce Vita\" is a timeless film, of pertinent considerations to contemporary life and a flawless style narrative, which are true legacies for the history of world cinema, and that will be for generations, like forgetting the Famous scene in which Marcello Mastroianni and Anita Ekberg bathe in the Fontana di Trevi or the children who parody and criticize the history of the children of Fatima, fed by the search of adults for a way out, a solution to the harshness of life. \"La doce Vida\" is an exceptional film in every respect, but mainly because it confronts the spectator with the emptiness of our uncertainties regarding life.",
            "review_date": "2017-06-30",
            "source": "rt"
        },
        {
            "content": "It feels immense, but at the end of the day this is simply about a scared and insecure man's efforts to project false confidence. He keeps his eyes locked on what he believes will satisfy him, only to find that all paths have trials.",
            "review_date": "2017-04-09",
            "source": "rt"
        },
        {
            "content": "Damn, this is one very long and boring as hell movie. As I've said before, if your movie is going to be over 2 and a half hours, it better be interesting. This was far from it as you can possibly be. The only thing I took from this was that the blonde in the first part of the movie, who was like a Marilyn Monroe lite(very sexy and curvy), was damn fine and it'd be cool to learn Italian someday. That is all. Zzzzzz.....",
            "review_date": "2017-03-10",
            "source": "rt"
        },
        {
            "content": "Journalists: they're flying above the world, ascended over the women they flirt with, the Lord protecting them.\n\nBy the closing moments of the film, we're wondering just how far Marcello will go, how much of a sleezy \"worm\" he really is.  Here his good friend has just murdered his children and committed suicide, and now he's out partying, wrecking his friend's home, and trying to push the boundaries of the party into stripping and even sex.  When he doesn't quite get his way, he resorts to humiliating another girl at the party, turning her into a chicken by drenching her in water and sticking feathers ripped from a pillow onto her.  The party ends with each person given a grand exit to dance and music as Marcello throws feathers in the air - it feels like we're going to end it here, and the sense that this film will have many unanswered questions, loose ends, and possibly leave us unsatisfied, creeps over.  The film keeps going, but why?  What is this little epilogue at the beach where they find a dead sting ray and he sees the young girl from the cafe?  My take is that she's the embodiment of what the film will define as \"too far,\" since we're wondering what depths Marcello will stoop to.  She is unquestionably underage, but there is a loving glance between the two.  He wants her to come along, but she interprets his gesture as  a wave goodbye - they can't see each other clearly.  Happenstance keeps them apart, perhaps for the better.  His appetite would never be satisfied with her, she'd only be as good as her youth, which will eventually go away.  Marcello does not learn how to love in this film, he is bound to hedonism, alcoholism, and disgracing others.  The question isn't so much would he or wouldn't he with the young girl - he most certainly would - it's will he or won't he, and it turns out he doesn't.  That's just how it happens.\n\nLike Jordan Belfort in Wolf of Wall Street, we're drawn in and entertained by Marcello's antics.  We're equally satisfied and frustrated with his losses, like when his reunion with his first encounter turns into a serious love talk, only to be flipped on him as she falls into another man's arms right amidst his admitting he loves her.  But like a Fellini film usually does, we drift into the next scenario and away from that one - that world now exists solely in the imagination as we watch a wonderfully bizarre ghost hunt in an old beaten down house that's part of this family's wealthy estate.  Here, a woman will simulate sex with a ghost, and Marcello will find himself in another sexcapade.",
            "review_date": "2017-02-18",
            "source": "rt"
        },
        {
            "content": "Fellini's greatest film, and possibly the most important film of the 1960s. A vignette-laden film that runs three hours, La Dolce Vita runs the risk of being formless, but instead its fluid and universal, with its themes surrounding media and class being more relevant than ever. Filled with unforgettable imagery, lavish sequences, and featuring a broad cast of nationalities in the cast, the movie firmly began Fellini's years as an international artist, yet didn't sacrifice an iota of the beauty and humanism of his earlier work. It also pulls off that brilliant feat of being just as sublime a comedy as it is a drama, and not even 8 1/2 would blend the two to such a delicate degree. A stunning picture for anyone's taste, La Dolce Vita is cinema at its finest, and most unsullied.",
            "review_date": "2016-12-20",
            "source": "rt"
        },
        {
            "content": "A nearly 3-hour movie with the most ridiculously silly, unheroic hero.  Not uninteresting, particularly with its gorgeous cinematography and depiction of Rome's still-developing outskirts in 1960.  But not sure if it's worth its length.",
            "review_date": "2016-08-11",
            "source": "rt"
        },
        {
            "content": "The most pretentious movie I have ever seen in my life.",
            "review_date": "2016-07-19",
            "source": "rt"
        },
        {
            "content": "Caricature in everywhere, Steiner is the only interesting character in La dolce vita (and in Fellini's oeuvre), his appearances are far the strongest and most effective. The famous Trevi Fountain scene is probably the weakest. This is not the italian Sunset Blvd., but the italian The Ten Commandments and as much entertainer.",
            "review_date": "2016-07-16",
            "source": "rt"
        },
        {
            "content": "Rome, 1959/60.  Marcello Rubini (played by Marcello Mastroianni) is a writer and journalist, the worst kind of journalist - a tabloid journalist, or paparazzo.  His job involves him trying to catch celebrities in compromising or embarrassing situations.  He tends to get quite close to his subject, especially when they're beautiful women.  Two such subjects are a local heiress, Maddalena (Anouk Aimee), and a Swedish superstar-actress, Sylvia (Anita Ekberg), both of whom he has affairs with.  This is despite being engaged to Emma (Yvonne Furneaux), a rather clingy, insecure, nagging, melodramatic woman (this explains his affairs!).  Despite his extravagant, pleasure-filled lifestyle, he is wondering if maybe a simpler life wouldn't be better.\n\nExplores some interesting themes, but is a bit hit-and-miss.  The examination of the intrusiveness and fabrication of the news by the media was good, highlighted by a few powerful scenes (the Virgin Mary kids and the bus stop scenes especially).  There is also the idea of longing for a simpler life.  However, these themes aren't explored very thoroughly, and there is no profound conclusion to them.\n\nThe main problem is that the powerful scenes get diluted by some pretty dull, pointless ones.  Too much time is spent on random stuff that has no bearing on the plot.  Not only does this make the movie unnecessarily longer, but minimises the impact of the more profound sub-plots.  Too many powerful scenes followed up by meaningless scenes.\n\nOn the plus side, there's Anita Ekberg.  She is stunningly beautiful and provides the movie's iconic moment - the fountain scene.  Her role did not require much acting talent but she makes up for this by having great...presence.  Unfortunately, she only appears for about 1/6th of the movie.  Once she is out of the picture, the energy level of the movie reduces significantly.\n\nInteresting to note that the supporting cast includes Nico, later of The Velvet Underground and Nico fame.  She appears as herself, sort of.",
            "review_date": "2016-06-13",
            "source": "rt"
        },
        {
            "content": "La Dolce Vita is a 1960 Italian drama film directed and co-written by Federico Fellini. \nThis comedy drama does contain some intriguing scenes and themes, based around the lead character Marcello. But at nearly 3 hours it is way too long, being more of a series of events rather than a structured cohesive unit. There is simply not enough substance in the film to keep the viewer's interest and focus.\n Considered to be one of the best movies of all time. \nPdO 1001",
            "review_date": "2016-06-02",
            "source": "rt"
        },
        {
            "content": "A pretty grim and oddly surreal look at the emptiness of wealth and hedonism.  Fellini is great as usual here, and I can't help feeling it is a major influence on one of my favorite films, The Great Beauty.",
            "review_date": "2016-03-30",
            "source": "rt"
        },
        {
            "content": "A crítica de Fellini ao modo de viver da burguesia italiana no pós-Guerra é duro e claro. E as inovações narrativas só se enriquecem com a fotografia e os figurinos espetaculares.",
            "review_date": "2016-02-14",
            "source": "rt"
        },
        {
            "content": "La Dolce Vita exposes that the \"sweet life\" isn't so sweet after all. Marcello's life is empty because he is looking for meaning in a hollow social context. Through his escapades with Maddalena, Sylvia, and Steiner, he realizes that people in high society seem fulfilled, but they're actually miserable and adrift; the image is the only thing that matters not only to the public but to Marcello as well. Caught in an idealistic fantasy, Marcello fails to recognize the importance of looking deep into the human spirit and beyond the façade played out by the stars, ultimately leading to a life of loneliness.\n\nThe first instance of imagery overpowering substance occurs during the first night when Marcello meets Maddalena, a beautiful heiress, in a nightclub. After being seduced by Maddalena, Marcello has trouble resisting temptation and eventually submits to his desires. Surprisingly, Marcello feels no shame. In fact, his lust for Maddalena becomes stronger. The noncommittal relationship and desire highlights the superficial nature of both characters.\n\nShortly thereafter, Marcello meets Sylvia, the Swedish-American actress, and begins to pursue her. However, what he is really chasing down is her image, that of a free-spirited, beautiful, and lively woman. True to her superficial character, the only things that matter in her life are pleasure, attention, and wealth. Because of this, she completely ignores Marcello when he tries to woo her. Infatuated with her public persona, Marcello fails to step back and question what is in front of him. Because of the reliance on this image, Marcello ultimately never gets her and furthers himself into the meaningless misconception of fame and fortune.\n\nSimilar to the encounter with Sylvia, Marcello once again finds himself a victim of a meaningless narrative. He travels to the site where two children claim to have seen the Virgin Mary. When he arrives, however, it is completely different than what he expected. Instead of a reserved landscape with humble followers of Christ seeking peacefulness, it is a gigantic theatrical operation. The cameras are there only to capture the false image of the Madonna. Consequently, the viewers of this event try to convince themselves that what they see is true. In reality, it is just an illusion.\n\nFollowing this night is the party at Steiner's rich, ornate apartment. Once again, similar to his experiences with Maddalena and Sylvia, Marcello is caught in a situation perceiving someone as an ideal image. Marcello admires the \"sophistication\" and \"happiness\" of Steiner, idolizing him as the perfect man with a perfect life. Both inspirational and admiring to Marcello, Steiner represents the hollowness of the aristocracy. A seemingly happy married man, Steiner is wealthy and powerful. However, his materialism does not conceal his lack of depth and character. Although he has all these material possessions, Steiner is clearly missing something spiritually. Tragically, Steiner takes his life as well as his children's. This symbolically represents a loss hope in the dreams of Marcello, but, more importantly, it signifies the bleakness and fruitlessness of the luxurious lifestyle, something Marcello thought was so great. His suicide shows that his life has become meaningless, for he cannot cope with the disenchantment and loneliness.\n\nBy affiliating himself with members of high social status, Marcello tries to discover meaning. However, he cannot find what he is looking for because his search is characterized by people with hollow lives. The elite are seemingly content and are looked upon as exhibiting an ideal life. In actuality, these individuals are emotionally lost with no purpose. Maddalena is bored with her money and, despite being a beautiful heiress, cannot find meaning. Sylvia is only an image and turns out to be a simpleminded fool. The faking of the Virgin Mary turns out to be a sham. Oblivious to the meaningless social context, Marcello does not look past the persona of Steiner and finds himself disillusioned. In the end, his reliance on the facades of his acquaintances dooms him to a life of emptiness.",
            "review_date": "2016-02-03",
            "source": "rt"
        },
        {
            "content": "Pretty unorganized movie. I couldn't tell what the theme of the movie was, because it just seemed like a bunch of short stories. The acting was great though, and it was mildly entertaining. But, I didn't get the point.",
            "review_date": "2015-11-04",
            "source": "rt"
        },
        {
            "content": "Fellini brings you to a place which is physically impossible, and he creates this with characters you either love or hate, but you feel from them. The most fun I have ever had in one film in my entire life",
            "review_date": "2015-11-01",
            "source": "rt"
        },
        {
            "content": "A large statue of Christ is being carried to the vatican via helicopter. It flies over the late 1950's Rome. As God seems to be symbolically blessing the ancient city over which he files, we soon find the workers, players, sunbathing beauties and our protagonist watching from below. This is a Rome in transition. WWII has been over for almost 15 years and the city is changing quickly. It is fairly obvious that the religious icon flying over has very little to do without what is going on below. Thus begins one of the greatest films of all time. \n\nAs Marcello Mastroianni's hedonistic and conflicted popular celebrity lifestyle journalist makes his way across Rome's terrain he guides us into what become scenes or mini-episodes that form \"The Sweet Life\" to which the Italian title refers. \n\nFederico Fellini is just starting to his his new cinematic style. Cinematographer, Otello Martelli, and composer, Nino Rota, along with his leading man are the key artists who help to turn this loosely-constructed film into one of the most lavishly beautiful, romantic, glam, insightful and most influential works in cinematic history. \n\nDespite the satire and cultural commentary, this film retains it's power thanks to the iconic moments and scenes Fellini creates. Everyone has at least two favorite scenes. Though, for me, this is a movie of espisodes. Each one more or less fitting together to form a sort of salute and farewell. More than just Rome is changing. So is the culture and all those who live in and around it. \n\nMy favorite episodes are the beginning with The Christ hanging by a rope on his way to the Vatican . The other is one of the film's longer episodes in which a hot and famous Hollywood movie star, The Legendary Anita Ekberg, arrives in a self-absorbed glee as the \"paparazzi\" dangle on her every fake move and turn of phrase. When she is asked what she most enjoys about life, she delivers one of the best lines I've ever heard in a movie: \" \"I like lots of things.  But there are three things I like most.  Love, love and love.\"  Later, near the end of all-too brief time on the screen she will saunter into that fountain and inspire a glam imprint on our collective brain.\n\nLike a lot of the characters in this film -- She isn't particularly \"likable.\" But she is \"here\" to stay. Fellini not only captured this era, he ended up helping to form it. \n\nThis is an epic with an epic-like running time. But the screen is filled with so much to see and so many things to say -- it is hard to imagine not loving it. \n\nIt actually doesn't matter if we love it or hate it. Fellini's s La Dolce Vita is true cinematic masterpiece that is both modern and old-fashioned.",
            "review_date": "2015-08-04",
            "source": "rt"
        },
        {
            "content": "Three lush hours of near perfect and existential filmmaking that also happens to be radically different from anything else, even still today. I was in a trance for pretty much the entire run time, so hypnotic and surreal was it's beauty. The number of classic scenes in this movie is staggering. In fact, the entire movie is made up of one groundbreaking scene after another. Fellini captures empty people doing empty things and makes it's somehow deep, engaging, and altogether brilliant. Suffice to say I loved it.",
            "review_date": "2015-06-19",
            "source": "rt"
        },
        {
            "content": "From its surreal opening shot of a flying statue of Jesus Christ, to the iconic dance in Rome's Trevi Fountain La Dolce Vita reveals how cinema, celebrity,& Christianity collaborate to create the illusion of \"The Sweet Life\".  It was and still is my favorite Italian film.",
            "review_date": "2015-06-16",
            "source": "rt"
        },
        {
            "content": "Super artsy and strangely compelling. It kept me watching. Plus the women are so glamourous, even the prostitute! What confused me was that I didn't realize years go by in the film.",
            "review_date": "2015-06-08",
            "source": "rt"
        },
        {
            "content": "Wow, that was a lot to sit through. i bet it was pretty avante garde in 1960.  Now, it just rambles. The Rotten Tomatoes summary, below, makes it seem more interesting than the movie really is. It's a great glimpse into 1960 Euro culture, but as far as sheer entertainment, that's several hours I will never get back!",
            "review_date": "2015-04-17",
            "source": "rt"
        },
        {
            "content": "Beautiful to look at but the story told is sometime very stupid, peppered with enough wisdom to appear deep. Its episodic format allows for a wide panning portrait though, but im not sure if its so much a critique of modernities triteness or a disguised glamorification of it. On a funny note, I will never forget ''should we give her the flowers or the pizza first''... So it has some unforgetable images and a perfect cinematography, but to me it is not fellini's best.",
            "review_date": "2015-04-12",
            "source": "rt"
        },
        {
            "content": "It could have a claim on the title of greatest film ever, had Fellini not made 8 1/2 a few years later.",
            "review_date": "2015-03-29",
            "source": "rt"
        },
        {
            "content": "Told in a brilliant episodic structure, this fascinating character study is the truest definition of Felliniesque: an exceptional film that is magical in its fanciful depiction of glamour in Roman aristocracy and depressing in the way it shows the decadence of a society and of man himself.",
            "review_date": "2015-03-21",
            "source": "rt"
        },
        {
            "content": "De las esenciales del cine italiano.La secuencia del baile en la Fuente de Trevi es de antologia",
            "review_date": "2015-02-01",
            "source": "rt"
        },
        {
            "content": "Cada fotograma en esta pelicula es perfecto, es una maravilla, empezando por la escena inicial  del Cristo trasladÃ ndose por un helicÃ²ptero, Anita Ekberg en la fuente de Trevi, para verla mÃ s de una vez.Excelente banda sonora.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "Marcello (Marcello Mastroianni) wants to be a writer, but he's stuck in the role of a tabloid journalist. Instead of exploring his character in a traditional three act structure, La Dolce Vita spends its 179 minutes on a series of loosely-connected episodes that each reveal new fragments and themes. A scathing indictment of the idle rich and the vapidity of celebrity gossip, La Dolce Vita is both prescient and ambitious. While it probably won't shock modern audiences in the same way it offended sensibilities in 1960, this film still feels vibrant and emotionally resonant thanks to Federico Fellini's beautiful direction, a powerful (and impeccably dressed) cast, and one of Nino Rota's most iconic scores.",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "The movie is a brilliant classic reflecting the polished life of Rome so well. Also Rome is so picturesque that any movie depicting scenes from Rome would be so beautiful!!",
            "review_date": "2014-12-11",
            "source": "rt"
        },
        {
            "content": "This is the third movie of Fellini's that I've seen so far.  It's also (somewhat) tame compared to 8 1/2 and and especially Amarcord.  Gorgeous photography.  Lots of laughs in this one, too.  I have about 4 more on my list and can't wait to see them.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "I may be the odd man out but i thought this movie was rubbish. The point of it i guess is to have the most loathsome, bourgeoisie characters which has been done in other films-la'vventura and rules of the game and i never like it. How r u supposed to like a film when u cant connect with any character? Altho it was rather long film it did move fast among locations, characters, and plots. That was the only good thing going for it. Despite its fast pace and so much ploy i found it rather empty. I particularly hated the main character who was such a womanizing, lazy, unsuccessful soulless piece of shit. The men were all wife-beaters, alcoholics, and cheaters. All the women in this movie were codependent, insecure, and weak, or slutty and immoral-all very shallow. Ugh just awful characters. Also parts were confusing like i wasnt sure what had happened to his father-a heart attack, a panic attack, what? I couldnt make out what Robert said to Sylvia to make her mad. Why did that guy kill himself and kids? What happened to kill that child at the Madonna citing? How long was it in the future when Marcello is at the party at end? With so much going on and so many characters- scene details get muddled. It was a lot of little frustrating indecipherable moments that also irritated me.  Originally i thought this movie was going to be good, but it was bad. Disappointing considering how much this movie is referenced and critically acclaimed.",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "The film has an excellent, timeless, and still very relevant thematic pursuit \"what is best way to live life?\" but, because its central character never feels (or at the very least shows us) his escapades,  makes the entire endeavor feel colder and more distant than it should. That aside, its narrative style hasn't aged well leaving audiences struggling for empathy and coherence. Still, its amazing production and insightful subplots are interesting if for themselves.",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "I found this a very disappointing film actually.  None of the scenes really connected with each other and none of the characters had depth, except Steiner, who was summarily disposed of without a lot of explanation, except that there is no god and everything is a nihilistic mess.  The strongest point about the whole movie was Marcello's lack of a relationship with his father and through this one could understand his attachment to Steiner...but once Steiner killed not just himself but his children it was tedious to while away the rest of the movie.  The last scene seems to be almost totally ad-libbed and was like a mad frat party.  I'm not sure how old Fellini was when he made this film, maybe in his early thirties, but it just made me feel very very old because of its lack of maturity, its inability to stick with the characters and its total lack of cohesion.",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "\"Listen...\"\n\nLeia mais: http://cinema-mon-amour31.webnode.com/news/a-doce-vida-la-dolce-vita-de-federico-fellini-italia-1960-/",
            "review_date": "2014-09-26",
            "source": "rt"
        },
        {
            "content": "La Dolce Vita was filmed with style and energy, presented on an epic scale, and it is as fascinating and astonishing a cinematic milestone as ever.",
            "review_date": "2014-09-17",
            "source": "rt"
        },
        {
            "content": "la dolce Vita sits in the midst of Fellini's works. Following a non-linear approach unlike his earlier films, the film is void of any dream sequences like in his follow up 8 1/2, but is episodic more than anything. It marks the end of one phase of his career but the start of a new one- his dreams and fantasy films.",
            "review_date": "2014-09-12",
            "source": "rt"
        },
        {
            "content": "A classic feature but not for my generation",
            "review_date": "2014-09-12",
            "source": "rt"
        },
        {
            "content": "A sorrowful film about a gossip writer longing to be a novelist, while partying with models & actresses in 1960 Rome.",
            "review_date": "2014-09-07",
            "source": "rt"
        },
        {
            "content": "As beautiful as it is sprawling, La Dolce Vita is Fellini's deconstruction of the myth of blissful affluence, an episodic masterpiece utilizing a series of mini-stories to tell universal truths about Italian culture, the artificial nature of religion, age, and love, all filtered through a lens of celebrity, commenting on the ways in which people fill these idealistic vessels up with projections of their inner-passions. It's all an extended musing on the idealized vs. the real, the ugliness that hides under the beautiful facades we create to feel superior (and who better to represent this contradiction than the paparazzi, who's cameras are a near constant-presence). To get lost in this facade means death, even if the popular perception of this lifestyle points to the contrary, and while this idea has been touched on before, it's never been done quite with half the style or intelligence that Fellini deals with here.",
            "review_date": "2014-09-03",
            "source": "rt"
        },
        {
            "content": "Artistic and thoughtful.   Memorable scenes and shots.  The only drawback is that it doesn't hold together very well as a whole.  Marcello is really just a very loose thread to tie together each scene.",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "The storyline and array of characters are sprawling to a fault. And yet the fine craftsmanship and poetic yearnings manage to completely sink in, amid the whirling cars and playboy parties and untimely deaths.",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "The characters are well-developed, and the various social scenes are immersive and convincing, but in the end it doesn't have much of a plot. It's more of a long string of various scenes that, while they reveal a lot about human nature, they don't tell much of a story.",
            "review_date": "2014-08-01",
            "source": "rt"
        },
        {
            "content": "Roger Ebert's favourite movie of all time - the Italian master Fellini's finest - and a classic which must surely be seen by so much more.",
            "review_date": "2014-06-07",
            "source": "rt"
        },
        {
            "content": "Fellini's decadent epic is a portrait of a place and time that perfectly captures the style and attitudes of Rome's upper class party culture, all the while condemning them and attacking a world whose excesses are beyond satire. Mastroianni defined a generation of cool and the film is full of spectacularly stylish cinematography.",
            "review_date": "2014-05-27",
            "source": "rt"
        },
        {
            "content": "Too long (3 hrs) to be fascinating the whole way through but the good parts (and there are many) rank among Fellini's most unforgettable and emotionally powerful.",
            "review_date": "2014-05-20",
            "source": "rt"
        },
        {
            "content": "Turns out, I'm just not at all into Fellini. Let the cries of heresy ensue.",
            "review_date": "2014-05-02",
            "source": "rt"
        },
        {
            "content": "Fellini's eye for breathtaking visuals makes La Dolce Vita a must-see for any film scholar.",
            "review_date": "2014-04-27",
            "source": "rt"
        },
        {
            "content": "Maybe the finest Italian film that I ever saw.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-04-04",
            "source": "rt"
        },
        {
            "content": "Roger Ebert's review nails it: \"I have heard theories that Federico Fellini's \"La Dolce Vita\" catalogs the seven deadly sins, takes place on the seven hills of Rome, and involves seven nights and seven dawns, but I have never looked into them, because that would reduce the movie to a crossword puzzle. I prefer it as an allegory, a cautionary tale of a man without a center.\"",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "I think I missed a trick. Bored when not annoyed at depiction of women. I like the little girl in the bar and on the beach, though.",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "Approachable, relatively speaking.",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "Somehow I didn't enjoy this much celebrated classic. Nothing wrong with the story about the hedonistic Rome in all of its vanity, but maybe the script, the over-acting, the dialogue of a different time that I just couldn't connect.",
            "review_date": "2014-02-03",
            "source": "rt"
        },
        {
            "content": "This is all about beautiful girls and living the fancy life. It features the ultimate playboy and that part is pretty solid.\n\n50 years ago I'm sure it was a very different flick, but it's not as special today.It's lost most of it's power. At least for me. It can be discribed as a film that tends from beautiful to boring.\n\nStill, this remains a neat film. It got some great dialogue, especially in the middle part.\nFellini also gets his crasyness trough at times. A great fountain scene among several others, but I could not help but waiting for the end - it was way too long for me.\n\nI'm glad I saw it, though. It is a big film. It will grow on me just like 8 and a half, but right then and there, when it ended, it was not all that. \n\nMostly I saw it to prepare for Sorrentino's newest one. A film that's very similiar to this one, naturally.\n\n7 out of 10 paparazzis.",
            "review_date": "2014-01-31",
            "source": "rt"
        },
        {
            "content": "A film that is deeply poetic, delightful and elegiac. You would waver on what seems to be the best things if it will stay or will soon be gone.",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "Sick and perverted and incredibly boring, La Dolce Vita is one hell of an overrated film which is entirely made of scenes showing rich people and, not only does it not contain involving story and characters, it also doesn't have a point or a message that Fellini obviously didn't even try to convey. It is an excruciatingly long and tiresome film which does not make sense and which, god damn it, somehow managed to get away with it.",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "Slow, but beautifully directed.",
            "review_date": "2013-11-16",
            "source": "rt"
        },
        {
            "content": "A wonderful film but very long. Its so surreal and beautiful as it jumps through scenes as if they were days of our lives. Characters pop in and out as they do in our life. You watch it the way you would read a good novel. Fellini is not like most american directors I grew up with. He is something different entirely and his films are something very special. I cannot wrap my mind around them so well after a single viewing. This one for example. I loved it but how will i feel on a second viewing? Is it too long? Too self indulgent? I dont think so. Its filled with incredible woman and the relationships Marcello has with everyone are very fun to watch. I look forward to sitting down and watching this one again some day.",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "Can drag, takes too long to latch on to the protagonist, but I love the portrayal of the paparazzi and upper class decadence in general, and the last scene, a naked metaphor that works.",
            "review_date": "2013-10-11",
            "source": "rt"
        },
        {
            "content": "\"We need to live in a state of suspended animation like a work of art, in a state of enchantment. We have to succeed in loving so greatly that we live outside of time, detached.\" - Steiner. Naalala ko tuloy si Dali. :I",
            "review_date": "2013-09-25",
            "source": "rt"
        },
        {
            "content": "The kind of pure art you only get from a true film legend.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "A womanizer who is never satisfied Marcello searches for love in numerous types of women. Some foreign and naturalistic, nymphomaniacs, adulterers and some truly monogamous. As Marcello wanders through love and dissatisfaction his pessimism grows and a dramatic change in his closest friend Steiner--one whose love and family he idolized takes a dramatic turn and Marcello realizes like the audience we never truly know a person, it's all fiction and pageantry. Fellini's fine but massive film for its time still holds up over 50 years after its debut and is mandatory viewing for lovers of foreign cinema, the 1960s and Fellini's work. First time rating: 9.7/10",
            "review_date": "2013-07-31",
            "source": "rt"
        },
        {
            "content": "Marcello, o protagonista de «La Dolce Vita», uma das obras imortais da História do Cinema e um dos expoentes máximos do seu realizador, Federico Fellini, é um indivíduo que leva uma vida desprezível, ao pé de gente igualmente desprezível. Esta foi a ideia inicial com que fiquei da personagem-protagonista deste épico italiano de quase três horas, interpretada por Marcello Mastroianni (que viria a colaborar com Fellini em mais quatro filmes - este foi o primeiro), que venceu a Palma de Ouro no Festival de Cinema de Cannes e hoje em dia é um filme amado por esse mundo fora. E fiquei com essa impressão precisamente até ao final do filme, só que fui acrescentando mais coisas, mais detalhes psicológicos ao que percecionei deste homem. Marcello é um jornalista italiano da imprensa cor-de-rosa que leva uma vida boémia e descontraída, saltitando de mulher em mulher e de lugar em lugar (desde um cabaré nas imediações de Roma, onde se encontram muitas figuras do jet-set da cidade e onde ele consegue grande parte do seu trabalho, até a uma Igreja, onde reencontra o seu amigo Steiner), mas que nunca consegue estar satisfeito consigo próprio e com a sua existência, com a sua profissão e com a sua maneira despreocupada e preguiçosa de ver tudo o que o rodeia. Com «La Dolce Vita» e com as múltiplas observações que fazemos dos ambientes, das situações, e das pessoas que se cruzam com Marcello (e da forma como ele se deixa influenciar ou não pelas mesmas), conseguimos perceber como a vida é feita de zangas e de dissabores, e que depende unica e exclusivamente de nós próprios a forma como a queremos tornar mais ou menos \"doce\". Ou seja, nós é que temos de decidir a nossa própria vida, e escolher quais os modelos que queremos seguir para nos tornarmos quem somos na vida quotidiana, sem nos conformarmos com tudo o que está à nossa volta e não tendo razões, como diversas personagens do filme, para viver numa fachada onde se finge ser feliz quando a vida está completamente arruinada, adocicando-a de uma forma ficcional para agradar às aparências e à opinião dos outros, a que damos demasiada importância. \n\n\n\nFederico Fellini aproveita a complexidade de episódios e de narrativas de «La Dolce Vita» para retratar uma perspetiva de vida de uma forma que, para a época, foi completamente nova, desinibida e provocadora. Mas além de todas as filosofias e reflexões existenciais, existe uma forte componente crítica em relação à supremacia do Cinema americano em todo o Globo, com toda a história da atriz americana que chega a Roma para trabalhar num filme - tanta coisinha, tanta confusão e tanto entusiasmo por uma pessoa sem interesse algum a não ser, obviamente, a sua beleza exterior. Todo um manancial de paparazzi (termo que ficou popularizado por causa deste filme), do qual Marcello faz parte, segue incessantemente, e de uma forma quase selvagem, todos os passos da atriz e todas as coisas que ela diz, mesmo as mais insignificantes (tal como as perguntas que muitos jornalistas lhe fazem: \"Usa pijama ou camisa de noite?\" é uma dessas muitas pérolas). Marcello vai ter uma das suas muitas paixonetas por esta dita atriz, algo burra e ingénua, que ao viver na sua própria redoma, pensa que é o centro do Universo, e além disso, revela não ter muita cultura sobre o país e a cidade em que vai filmar (a cena em que estão dentro de um monumento histórico e ela diz: \"Posso escrever o meu nome aqui?\"). Mas não é só ela: os seus compinchas americanos também não são muito respeitadores do que lhes é desconhecido e quase que \"destroem\" a cultura italiana, em benefício das tradições e formas de vida do povo dos \"states\". Talvez Fellini pretendesse alertar para a forma como as pessoas olham o Cinema não como Arte e forma de expressão, mas por todo o recheio desnecessário que a ele ficou associado, muito por \"culpa\" dos grandes sucessos americanos exportados para os quatro cantos da Terra: o glamour, os famosos, as suas histórias de vida como pouco significado, as fofoquices que à volta deles são facilmente criados, etc. E ao seguir a atriz (e vivendo um curioso episódio na Fonte de Trevi, uma das cenas mais emblemáticas de «La Dolce Vita»), Marcello acaba por viver com ela momentos que para ele são de \"viragem\", pois ao cair nas ilusões do amor e/ou da paixão, para ele é como se tivesse sido atingido por um tornado que lhe mudou, momentaneamente, a sua existência e o seu papel na sociedade. É aí que pensa pela primeira vez, e de uma forma séria, que tem de mudar de vida, ao dar de caras com esta diva que lhe desperta o coração de uma maneira fulminante. Mas será que conseguirá passar das palavras aos atos? Bem, isso fica na opinião de cada um. Mas Marcello continua a deambular pelas ruas de Roma, depois de ter de se \"despedir\", de maneira forçada, da lindíssima (mas superficial) atriz, e aí compreendemos, a pouco e pouco, a forma como ele vive o quotidiano e a sua profissão: de uma forma desgastada, deprimida, e sem grande vontade de ir para a frente com os seus projetos. Envolve-se em muitas festas para se tornar cada vez mais deprimido e derrotado consigo mesmo. Marcello está ali, mas ao mesmo tempo é como se não estivesse em parte alguma, nem mesmo neste planeta. Está confuso ao que realmente quer na sua vida, e muda de ideias frequentemente sobre as suas ambições, os seus sonhos e os seus verdadeiros ideais de vida.\n\n\n\nCom uma banda sonora divinal do compositor Nino Rota (um dos Grandes nomes da Música Cinematográfica: «O Padrinho» e «O Leopardo» tornaram-se imortais, em parte, por causa das partituras da sua autoria),  «La Dolce Vita» mostra-nos a cidade de Roma e todas as suas figuras, todos os personagens que habitam neste universo que tanto tem de romântico e de encantador, como de triste e de depressivo. A magia da cidade é pisada pelos seus múltiplos problemas e situações, como as andanças dos paparazzi, sempre em busca de qualquer escândalo, polémica ou tragédia para meterem mais uns tostões ao bolso (a normalidade com que encaram os problemas graves e as situações que fotografam é impressionante - como no caso das crianças que \"viram\" a Virgem Maria, que causam o caos numa pequena localidade repleta de membros da comunicação social de vários países), mas também é ambientada por reencontros, como Marcello que está uma noite com o Pai, que mal conhece e que não deram tempo suficiente um ao outro para se poderem conhecer melhor antes. «La Dolce Vita» é um filme que é quase um guia completo para a existência humana e para todos os defeitos que o ser humano possui, as suas fraquezas e as suas frequentes desistências perante as oportunidades que lhe surgem para poder mudar a sua vida. Com uma belíssima cinematografia e um elenco de luxo, encabeçado por um espetacular Marcello Mastroianni (um dos mais icónicos atores do Cinema Italiano), «La Dolce Vita» é um filme sobre o descontentamento com a nossa própria vida e sobre o pouco que fazemos para a mudar (como diz uma música recente da banda portuguesa Virgem Suta, que passo agora a citar: \"andamos furiosos/Entre dentes a resmungar/Mas quando há chance de algo mudar/Chutamos para canto/Preferimos nem lhe tocar\"). Falamos, falamos, falamos, mas depois não fazemos nada e preferimos reduzir-nos à nossa \"insignificância\". Procuramos a felicidade, mas no final desistimos porque achamos que não passa de uma utopia. Mas podemos, ao menos, encontrar alguma dignidade e alegria para a nossa existência, para não acabarmos como Marcello, na sua desilusão permanente e constante e na forma como desiste de tudo o que sempre sonhou. Nada é impossível neste Mundo. Se quisermos e agirmos, não há impossíveis.",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "I really enjoyed the first hour, but after that it becomes a little tiresome.",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "Thanks to stunning costume design, sumptuous set pieces and a sensational Roman setting, Federico Fellini's most notorious picture is a film fanatic's dream. Under Hollywood's direction, seven days and seven nights in the life of a philandering playboy journalist could make for either tiresome tragedy, cringy comedy, downbeat drama, or madcap musical. Here, however, Fellini's episodic, non-didactic approach to filmmaking offers us something completely unfamiliar: a portrait of life that's all at once human, unpredictable, evocative and glistening with charm. The film isn't flawless, but it is a true Italian classic.",
            "review_date": "2013-06-25",
            "source": "rt"
        },
        {
            "content": "Absolutely mad and addictive film about a journalist following a string of stories and lady friends. It's debauched, highly atmospheric and utterly brilliant.",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "La Dolce vita e' un film diviso in episodi, alcuni di questi funzionano altri molto meno. Il primo, con la famosa scena della fontana di Trevi, funziona, cosi' come l'ultimo malinconico capitolo. Nel mezzo ci sono altri spezzoni piu' o meno riusciti. E' un film che vuole fotografare un'epoca e probabilmente ce la fa, ma nel suo immenso lavoro un po' si perde e le tre ore non aiutano a smaltire il film. Se i film fosse stato piu' corto, un po' piu' focalizzato su un aspetto, allora (a mio avviso) avremmo avuto un film decisamente superiore.",
            "review_date": "2013-06-02",
            "source": "rt"
        },
        {
            "content": "La Dolce Vita portrays blissful ignorance as the truth of tragedy. Elegant and suggestive cinematography, some of Fellini's greatest ideas, and a length not ever overblown or tiresome. La Dolce Vita is definitely an Italian masterpiece.",
            "review_date": "2013-05-21",
            "source": "rt"
        },
        {
            "content": "I found the movie too self indulgent and one not caring about the characters",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "the sweet life? the bleak life, more like. \ncannot decide after my first fellini if he was just an overindulgent, overrated film maker or deserving of his cult status but he certainly touched on themes that are still so relevant,if not more so, in 2013 than in the 60s when the film was made.  \nthe more things change, the more they stay the same(?) \n\nanouk aimee was more stunning than the blonde bombshell who frolicked in trevi fountain, no?",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "One of the top ten best movies I've ever seen. It's beautiful, funny, and thought provoking. A masterpiece of artwork and a profound meditation on the human condition. What every film ought to be.",
            "review_date": "2013-04-17",
            "source": "rt"
        },
        {
            "content": "Another wonderful collaboration between Fellini and Mastroianni. Once again a slice of life of Rome in the 50s. One does not even notice the significant run time.",
            "review_date": "2013-04-16",
            "source": "rt"
        },
        {
            "content": "I get what it was doing, I get that it started many trends and cultural terms. What I don't get is how it was entertaining. At the end of the day a movie should entertain you and it didn't do it for me.",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "Nachdem was ich bisher von Fellini gesehen habe, war ich auf eine Fortsetzung nicht sehr erpicht. Meine Meinung über ihn hat sich auch nach La Dolce Vita\" kaum geändert.\nDies ist der vierte Film des italienischen Meisters, den ich gesehen habe, und er gilt als Übergangswerk zwischen Neo-Realismus und Avantgarde. Zu unser beider Nachteil, zählen beide Stile nicht zu meinen Favoriten.\n\nLa Dolce Vita\" ist ein langer Film. Fast drei Stunden lang verfolgen wir das Leben von Marcello, einem Boulevardjournalisten. Marcello wird gespielt von Marcello Mastroianni, und es ist ein Traum ihm bei der Arbeit zuzusehen. Mastroianni ist einer der begabtesten Schauspieler aller Zeiten.\nDie Menschen, auf die er trifft variieren jedoch sehr stark an Charisma und so sind manche der Episoden echt fesselnd, spannend und unterhaltend, und andere scheinen unendlich zäh und uninteressant.\n\nIch habe Verständnis dafür. Es ist sicherlich schwierig einen Dreistundenfilm mit lauter interessanten Charakteren wie Marcellos Vater oder dem Literaten Steiner zu füllen, und nicht einmal Fellini gelingt es, die Frage ist eher warum er es überhaupt versucht und nicht etwa die Länge des Films auf die Hälfte reduziert.\n\nDie Essenz dessen, was Fellini an Kritik anbringt hätte auch über weniger Episoden geklappt.\nIm Gegensatz zu 8  1/2\" (den ich als Fellinis besten Film betrachte) habe ich die Botschaft von La Dolce Vita\" zwar verstanden, kann jedoch mit dem Zwiespalt aus professionellem/künstlerischem Anspruch und Hedonismus in dem Marcello gefangen ist, wenig anfangen.\nEr schämt sich für die Art und Weise, wie er seine Brötchen verdient, verehrt seinen Freund Steiner, der ein echter Künstler ist, ändert allerdings so gar nichts an seiner Lebensweise, nicht nur weil er nicht kann, sondern auch weil er gar nicht will. Das Ideal seiner Selbst und seine tatsächlichen Bedürfnissen gehen weit auseinander, und bis zum Ende des Films hat Marcello das nie verstanden.",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "La Dolce Vita is an artist's magnum opus. It is Federico Fellini's defining statement on the truth behind Hollywood, told in vivid detail, highly symbolic and powerful religious themes and passion towards Fellini's characters.",
            "review_date": "2013-03-20",
            "source": "rt"
        },
        {
            "content": "The story of human search for happiness and meaning of life.\nThe story is formed through Marcello (the protagonist) interaction with Sex, Church, Literature (he tries to become a writer) as well as the depiction of different characters, for instance women of different characters, his father, Steiner (intellectual character who \"just seem to be high\"), orgy of hypocrite old people and so on and so forth. Fellini attains this road-map through the episodic structure of La Dolce Vita.\nMarcello, seeking love through Sex with different people, becomes so degraded such that he cannot even see the simplicity of life, recognize his primal search for meaning of life, when he simply turns back to the the simple country girl tries to communicate with him on the beach because he is so absorbed by the masses.\n\nI found the following (from somewhere in internet) useful:\n-----------------------------------------------------------------\nConsidering that Aristotle's function also deals with parts and wholes of an idea, perhaps it would be fitting to apply it to Marcello's life and his ultimate descent. Even from the onset of the movie, we can be clear that Marcello does not have a specific function, which has also been considered to be an occupation, and that he does not enjoy doing it. Therefore, we can understand that happiness is, essentially, an unattainable idea for him. Aristotle states that the function of something is what gives it meaning, it must be unique, and cannot be done by another object just as easily. Keeping that in mind, by analyzing Marcello's actions and his continued, but failed, attempts to find meaning, we can easily see, by relating Aristotle's ideas, that he is not a being with a specific function or meaning, a direct relation to his inability to find happiness. Marcello, despite his aspirations, does not serve a function which sets him apart or gives him meaning. Throughout the movie, he is constantly unsatisfied by his life, his job gives him no satisfaction, nor does his home life or girlfriend.\n\nWe can see Marcello take on a variety of degrading tasks to attempt to find this meaning however. His attempts to write meaningful works, such as the book he starts, and the random parties and sex he engages in, can be viewed as mere attempts to find meaning, although nothing of what he does throughout the movie give him any more meaning or function than he begins with. Therefore, it seems only like a natural course of events that he comes to degrade even further, having lost his primary functions in life. Aristotle states that the ultimate function of humans is to live a life according to reason. It becomes very clear throughout the movie that Marcello is simply not capable of doing such a thing. Marcello's life is not rational, nor is it reasonable. It is chaotic, it is unorganized, and it is a search with so many lose ends that it becomes impossible to follow or control.\n\nThis lack of function and reasoning is ultimately destroyed with the death of his idol and mentor Steiner, the one man whom he idealized and who succeeded somewhat in giving him a rational order and sequence, which is symbolized by his book, which, interestingly enough, he is incapable, at least in the course of the movie, in putting down so much as a single word. Also interesting is that in the time when he attempts to write his book, he is introduced to the purest character of the movie, the young waitress, who represents purity and reason, therefore, according to Aristotle, the meaning of life and of the soul. After Steiner's suicide, Marcello comes to believe that nothing can ever bring happiness. He cannot be complete in the life that he has been living, and it seems that even the promise of a \"better\" or more complete life only brings it own unhappiness. Somewhat counter to Aristotle's argument, it seems that even perfect reason and function cannot always bring happiness of their own accordance. After the death of Steiner, Marcello seems to lose any of the possible reason or function that his life might have held, which was largely focused on betterment and future possibility. Following that, his complete degradation as viewed at the end of the film does not so much come as a surprise, but more a perfect following of Aristotle's argument of the functional soul, that which has no rationality, and no function (Marcello has abandoned even journalism by the conculsion), can never be complete, and thus never achieve happiness. At the very end of the film, Marcello is incapable of even recognized the purity and reason of life, as symbolized by the his loss of identity with the waitress who attempts to waive at him across the beach.\n\nOf course, none of this is to say that Marcello did not have potential or at least the possibility to attain more in his life. It is important, to truly understand the film, that the steps which lead to his loss of potential and his disintegration of his psyche and collapse of his higher self are made clear. There is no easy answer as to what exactly creates the confusion and disillusion within Marcello. Of course, it becomes apparent within the opening moments of the movie that Marcello has little respect either for himself or for those around him. Perhaps this is really the first step in his complete disintegration by the end of the movie. Even from the few opening minutes, Marcello shows no respect for himself or the people that he is attempting to write a story about or photograph. From there, the path that Marcello takes seems set out before him, he cheats endlessly on his girlfriend, has no respect for women, and reacts with anger more than sympathy after his girlfriend overdoses.",
            "review_date": "2013-02-25",
            "source": "rt"
        },
        {
            "content": "A movie that is superb, Fellini's surreal and artistic imagery only adds to the movie and it's greatness. Though it is three hours long it always remains interesting and you find yourself immersed in this fantasy like world.",
            "review_date": "2013-02-14",
            "source": "rt"
        },
        {
            "content": "One of Fellini's masterpieces, as well as one of the greatest cinematic experiences of all time. Fellini turns a portrait of the sweet life of shamelessness into an epic, with its majestic cinematography and successions of adventures of a journalist played by Marcello Mastroianni for whom every night is a new adventure with a new girl to fall helplessly in love with, new delirious parties filled with lots of different interesting people, and yet every morning waking up feeling disoriented and empty. Set in a Rome on the verge of an economic boom, this representation of wealthy and thoughtless debauchery is filled with images and symbolisms of religion hinting at salvation contrasting with the attraction and sinful lust of the vivid nightlife. Everything about this film is striking from the gorgeous sets, to the gripping and unpredictable stories with a timeless and prophetic appeal. Some scenes are particularly memorable, like the Trevi Fountain scene, and Mastroianni plays iconically and with great charisma the part of Federico Fellini's very own alter ego.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "The world renowned italian film about vanity was a lot more vain than it was entertaining.\n\nFedirico Fellini is a one of a kind film maker but this film was so uneventful & flat, gorgeous lush look to it but ultimately pointless overlong viewing.\n\nIn many ways this is a must see by critics & historians but I found it very difficult to sit through.",
            "review_date": "2013-01-15",
            "source": "rt"
        },
        {
            "content": "Italian Movie about a player that in 1960 must have raised eyebrows, I didnt enjoy it 1 star",
            "review_date": "2013-01-13",
            "source": "rt"
        },
        {
            "content": "Starring Marcello Mastroianni and directed by Federico Fellini, this Italian film set in Rome follows a tabloid reporter named Marcello. If he is not finding a scoop with other ravenous reporters, he spends time with his wary girlfriend, falls for an American bombshell, talks with a cultured family man, or spends time with his good natured father who he does not really know. All the while he witnesses the lives of the rich and has many romantic relations. The underlining theme of it all is boredom,  unhappiness, and superficial lifestyles. This film is not really about a main plot but rather Marcello's many different episodes and experiences. Some are funny and others maddening, but he muddles his way through. This film, much like Breathless, is international and chic. The cinematography and score are both effective in helping to create this feel.",
            "review_date": "2012-11-21",
            "source": "rt"
        },
        {
            "content": "This film is a world into itself. The offer of happiness is always there, if he can risk it.",
            "review_date": "2012-11-16",
            "source": "rt"
        },
        {
            "content": "La dolce vita  [1960]",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "La Dolce Vita typifies quintessential film-making.",
            "review_date": "2012-10-30",
            "source": "rt"
        },
        {
            "content": "An essential viewing.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "must say i was not in the mood for this movie,especially the high life they represented but i got the idea and the black and white image always gets me",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "Beautifully shot and brilliant. It's, as Godard would say, more real than real life. And that makes it one of the saddest pictures I've seen, not just when tragedy strikes but the day to day life of a man who is fundamentally lazy and scared of commitment. Neither joy nor tragedy strikes him hard and he never changes.",
            "review_date": "2012-09-27",
            "source": "rt"
        },
        {
            "content": "Classic Art House Cinema",
            "review_date": "2012-09-24",
            "source": "rt"
        },
        {
            "content": "One of my favourite going-downhill-fast-and-ends-up-sad-and-lonely-bastard film.",
            "review_date": "2012-09-18",
            "source": "rt"
        },
        {
            "content": "Nothing of consequence happens.  Ever.",
            "review_date": "2012-09-07",
            "source": "rt"
        },
        {
            "content": "The surrealism of this film will leave you wondering after you have watched it whether you liked it or not. And it will plague you for ages, which is probably a good sign. I think. But I'm not sure.",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "revisited. kallÃ³dÃ³ ember akarok lenni.",
            "review_date": "2012-08-26",
            "source": "rt"
        },
        {
            "content": "For films that contain a three hour run-time, the viewer has to become immersed in it's atmosphere. 'La Dolce Vita' is completely aware of these factors, as the film evokes such an intoxicating premise over a subtle subject. Films with such a run-time are usually considered to contain 'epic' concepts, however 'La Dolce vita' simply films the moments of the protagonist life, portraying the parasites of the media, society hopes in false idealizations and a man searching for a sense of reason through the streets of Rome, we follow Marcello through his endless nights and his continues parties that displays a road to no where. Furthermore, Fellini imagination is amazing, continual presenting scene after scene that is forever encapsulated, in particular, the symbolic introduction of the statue of the Madonna being displayed over Rome from a helicopter.",
            "review_date": "2012-08-25",
            "source": "rt"
        },
        {
            "content": "Don't have time for my thoughts, but this one could really grow on me, though I didn't absolutely love it this first time.",
            "review_date": "2012-08-04",
            "source": "rt"
        },
        {
            "content": "Essential surrealist film, La Dolce Vita is an early critique to press photography, bourgeois society, special attention to stars and social decadence.",
            "review_date": "2012-08-02",
            "source": "rt"
        },
        {
            "content": "Here is a black and white film that literally oozes color. It is such an epic sumptuous, bleakly sweaty cinematic experience that when Fin flashes on the screen I want to watch it again. I never ever tire of returning to the God-Damn thing and Nino Rota's now classic soundtrack helps. One of the greatest films ever made.",
            "review_date": "2012-07-31",
            "source": "rt"
        },
        {
            "content": "Another classic from Fellini!!! It's really like several mini movies in one as Marcella experiences the seven deadly sins. Anouk Aimee radiates as usual...and the trevi fountain scene is indeed wonderful. Fellini was nominated for an Oscar but lost out to Billy Wilder and the apartment which is another all time favorite of mine so it's ok. Still...what an amazing work of art!",
            "review_date": "2012-07-30",
            "source": "rt"
        },
        {
            "content": "Philosophical. Many open ended questions. But that's life, isnt it",
            "review_date": "2012-07-29",
            "source": "rt"
        },
        {
            "content": "This Is My Favorite Federico Fellini Film.",
            "review_date": "2012-07-19",
            "source": "rt"
        },
        {
            "content": "I liked how this was written, filmed and performed. But honestly, there is far too much hype over this film that I think has just generated with age. Otherwise, it's a solid pic.",
            "review_date": "2012-07-13",
            "source": "rt"
        },
        {
            "content": "The stand out moment for me was when the two kids came down stairs after hearing the sounds of a storm, as hey come down the father explains that, the boy he sees beauty, he examines every pedal of a flower, while the daughter she's fascinated by combinations of words. I think this was what explained this movie, it was colorful despite being B&W and it had great dialogue. While at 2 hr 47 mins some episodes felt slow, but that was made up by the scenes of \"The Madonna\" and \"The Orge\". It was a mix of neo-realism and artistic filming. It showed how cruel and vulgar the lives of the upper class are, an how careless of human emotion the reporters were. They didn't give a damn how they get that photo, they'll capture that moment. Great film",
            "review_date": "2012-06-29",
            "source": "rt"
        },
        {
            "content": "Nearly as good as 8 1/2, but we begin to feel it's length towards the end. However it is still an amazing film, from one of the great directors.",
            "review_date": "2012-06-26",
            "source": "rt"
        },
        {
            "content": "C'est avec déception que Fellini fait son entrée dans mon historique cinématographique. Ai-je réellement dépensé 3h à regarder un ramassis d'âneries? Certes, certains clâmeront haut et fort que c'est une critique du fascisme, mais je n'y vois rien. Je n'ai eu aucun plaisir à me perdre dans les recoins de Dolce vita et je n'ai pas été en mesure de me laisser bercer par Fellini dans les recoins les plus affreux de la mondiosité. Une oeuvre décousue et hermétique dans laquelle il ne fait bon que bailler.",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "Undeniably brilliant from a technical level, though as a visceral experience it can drag a lot in it's length, especially for the first hour or so. That said the second half is loaded with brilliant scenes and it's pretty spot-on in terms of satire, not to mention the usual stunning performance from Marcello.",
            "review_date": "2012-06-02",
            "source": "rt"
        },
        {
            "content": "Traditional morality has given way to godless decadence in Federico Fellini's groundbreaking \"La Dolce Vita\", his first major art film which liberated him from the conventions of neo-realism and allowed him to indulge in the fiercely stylish aesthetic that would come to define his career.\nBy juxtaposing symbols of Christianity against the \"cafe society\" which Rome built upon economic prosperity following WWII, Fellini delivers a thesis on the shameless amorality of modern civilization, which is more concerned with materialism and vicarious cheap thrills than a more spiritually fulfilling existence. The opening image in particular - a statue of Christ being flown over Rome by helicopter, seemingly blessing the city before we encounter bikini-clad women flirting with one of the helicopter passengers from their rooftop tanning perch - enforces this theme rather pointedly. Several such images and situations are explored in an episodic narrative which follows a journalist (terrifically played by Marcello Mastroiammi) on a Dantesque pilgrimage through society's downward spiral into sin, ending with a virtual leviathan at the gates of Hell (represented by stingray washed up on the beach).\nIronically, the film encouraged the very cultural cliches it condemned, further popularizing the appeal of  the glitzy European high life with its uber-chic sets and costumes (all designed by Peiro Gherardi). At the same time, it also inspired absurdist trailblazers like Luis Bunuel and Jean-Luc Godard, so I suppose you have to take the good with the bad.",
            "review_date": "2012-06-01",
            "source": "rt"
        },
        {
            "content": "Long & ultimately futile.",
            "review_date": "2012-05-28",
            "source": "rt"
        },
        {
            "content": "Stopped after an hour. Couldn't take no more.",
            "review_date": "2012-05-28",
            "source": "rt"
        },
        {
            "content": "If there is such a thing as a 'best film of all time', then this could be it.",
            "review_date": "2012-05-28",
            "source": "rt"
        },
        {
            "content": "Muestra una Italia diferente y difÃ­cil no soÃ±ar con la escena en la fontana de Trevi.",
            "review_date": "2012-04-29",
            "source": "rt"
        },
        {
            "content": "A devastating, flawless work of art.",
            "review_date": "2012-04-29",
            "source": "rt"
        },
        {
            "content": "The emptiness of Roman hedonism in the sixties is the subject of this landmark movie featuring a minor character by the name of Paparazzo, so-called because he flits about like a sparrow taking celebrity photographs. The term paparazzi was coined by this Italian groundbreaker with much still relevant to say about emotional vacuity.",
            "review_date": "2012-04-14",
            "source": "rt"
        },
        {
            "content": "Three hours long and not a single dull moment. Pure Fellini magic!",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "HorrÃ­vel mas perfeito.",
            "review_date": "2012-03-29",
            "source": "rt"
        },
        {
            "content": "Here is a remarkable creation. I have never come away from a movie feeling so simultaneously fulfilled yet empty. It refracts then reflects the viewers' emotional extremes back onto them in ever-changing ways.",
            "review_date": "2012-03-27",
            "source": "rt"
        },
        {
            "content": "A classic. Style and full of life.",
            "review_date": "2012-03-25",
            "source": "rt"
        },
        {
            "content": "It took me about half of the movie before I was really into it, but once it got into what I like best about Fellini (how he handles large crowds/chaotic scenes and parties/gatherings) then I got more into it. More of a series of vignettes than an actual storyline, La Dolce Vita is interesting because you don't often see movies about meandering life from the 50's or 60's on A. a large scale and B. nearly as often as you do now. Paved the way for a lot of introspective cinema.",
            "review_date": "2012-03-24",
            "source": "rt"
        },
        {
            "content": "Fellini's annoucement that he was leaving neo-realism beyond.  Mastroianni is great here, keeping us interested in the episodic moments that make up his life.",
            "review_date": "2012-03-21",
            "source": "rt"
        },
        {
            "content": "This film is a timeless masterpiece. \r\n\r\nMany eons ago, on my first viewing, I originally found the film to be difficult to delve into. It's admittedly a challenge where its greatness is more easily appreciated by the post-viewing reflections rather than the ideas and themes that impound the viewer during the initial viewing; therefore, a second viewing where one tries to engage their own theories, taken from a first viewing, is imperative and essential to fully experience this film's percolating greatness. \r\n\r\nThe film itself is uncompromising in its unorthodox narrative and storytelling structure; it might leave impressions of pretension or the illusion of bloviating as it introduces another seemingly dissonant episodic entry of Marcello's life. Then again, people usually vilify or trivialize that which they do not comprehend. \r\n\r\nSurely it's a terribly daunting task, and a hard one, to quantify a character study of a man's life into a week, which is then compressed into 3 hours of film. \"The Sweet/Good Life\" achieves just that, and is a film unafraid to use the analysis of that man's life to provide a lengthy, complex, and cold reflection on the nature of how we live and the vices we should confront. Let's be thankful we were able to watch this film in our lifetimes.\r\n\r\nThe way the film so pithily and ambiguously portrays Marcello aimlessly cruising through his life and experiencing the meaningless pleasures of incessant late-night parties, spontaneous hedonism, and other ubiquitous debaucheries in search of satisfaction is just so well done in giving the viewer substance to work with. Here is one such message I've gleefully constructed: If we do not rise to the feat of going \"beyond passions, like a great work of art\" and to love and live \"outside of time,\" then perhaps we will all end up as a hapless fool trapped in a hopeless cycle of empty hedonism, blinded by our own debauchery and self-righteousness that when an Umbrian angel attempts to save us from the outside, all we can do is wave in ignorance and turn back. \r\n\r\nSurely I, too, wouldn't want to find myself so myopic in the future, blinded by my unslakable instincts, that I end up failing my own potential for finding a greater, illuminating, transcendent purpose in life. The \"dolce vita,\" the life of \"heedless pleasures and luxury,\" is inexorably unfulfilling and a carrot on a stick. \r\n\r\nThere are many other arbitrarily interpreted messages the film contains between its rich and intrepid lines. Finding more and more content in these lines with every viewing (whether it be from the ruthless on-payroll Paparazzo and his gang of cameras, the pitifully washed up state of Marcello Sr., the midnight strolls full of wonder and awe, the potent tragedy of Steiner, etc) is only part of the film's indefinite magic and fun.\r\n\r\nThis movie isn't just a cerebral celebration, though. It's absolutely beautiful. Rarely while watching another film will you feel so transported; watching this film was, and is still, like booking a full trip to Rome with friends and breathing the air of a novel land. Rome just looks fantastic in this film, and the way it takes you through the late-night streets and entertainment establishments of the city is breathtaking. Not much else should be said of the movie's mise-en-scene or cinematography, because if I were to start now I would never be able to stop. Even if you don't like to be challenged by films, by simply being a neophile, which everybody is to some extent, you will enjoy this film.\r\n\r\nIn hindsight, \"La Dolce Vita\"s format, method of storytelling, and very dense content would have also worked, perhaps better, as a book. Then again, only more for us lovers of cinema.",
            "review_date": "2012-03-11",
            "source": "rt"
        },
        {
            "content": "LA Dolce Vita is an interesting film about a tabloid journalist Marcello and his journey of self-discovery. Through out the picture we follow Marcello as he struggles with being a novelist and the women of his desire. With one shocking scene involving his friend Steiner, Marcello sinks in to despair and gives up any dreams he had of being a novelist.",
            "review_date": "2012-02-23",
            "source": "rt"
        },
        {
            "content": "La Dolce Vita's  status as a masterpiece of world cinema, and its now almost sacred cinematic status, make the modern viewer approach with apprehension...Fellini's picture may have seemed daring and original in 1960, but it has aged badly...The narrative is uninteresting, the concoctions of sounds and images are never breathtaking, and the acting by many of the supporting actors is second rate...",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "Anyone can make a film about a shallow and empty life, but only Fellini can make it great.",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "Clocking in at 2hrs and 53 minutes, La Dolce Vita (1960) is Federico Fellini's most distinct film as of yet (just for this sake of this commentary, I will write as if the movie is still relevant and current today). I have just started watching Federico Fellini's work and I noticed that you can compartmentalize all of his early seven films starting from his first feature Variety Lights (1950) to La Dolce Vita, into three separate categories:\n\n1. Variety Lights (1950) and The White Sheik (1952), I vitelloni (1953)\n2. La strada (1954), Il bidone (1955), and Nights of Cabiria (1957\n3. La Dolce Vita (1960)\n\n*Note: Federico Fellini goes on to make fifteen more films, ending his career in 1990. \n\nFellini's first and second feature, Variety Lights and The White Sheik (1952) are two films from the early master. Although the films are comedies with goofy lead characters, the backbone of his style is already evident. That is, creating very sympathetic characters who are victims of circumstance.  \n\nIn Variety Lights, the story is about a group of traveling theatrical performers on tour. The circus group goes from town to town performing for would be audiences. Although far from being a number one hit, the tour is content with their lives. However everything begins to change when the manager meets a young beautiful girl on the train and decides to add her to his team. Her presence brings envy from the much older women and most of all brings in tension and distress to the manager's marriage. With the insistence and encouragement from the manager, the group goes over and beyond to make the beautiful girl a star by making her the primary attraction. Even at the cost of his friends and wife, the manager will not do anything to upset his new muse. \nEventually he loses all his friends, wife and most importantly he loses the beautiful girl to a more successful theatrical group. Miraculously though the manager is given a second chance by his loved ones and the story revolves around in a circle to the same situation the manager found himself on the train before he met the beautiful girl. Except that he has learned nothing and attempts to sweet talk another beautiful girl he meets on the train.\n\nAfter the wide acclaim from Variety Lights, Fellini made his second picture, The White Sheik. To put it shortly, the film is about a newly wed couple who arrives in Rome for their honeymoon. The young wife is devoted to her uptight and bourgeois older husband, but discovers that her soap opera hero, the White Sheik is filming in the area. She runs off to meet him to satisfy her fantasizes. The husband becomes stricken with panic when she disappears. More so because he does not want to disrespect his powerful uncle who has yet to meet his new bride. Of course when the bride finally gets to meet her hero, he is nothing like what she expected. Instead of the strong and masculine type of character she wanted the White Sheik to be, in real life he is nothing but a coward who is afraid of his wife. She leaves her fantasy and rejoins her husband. \n\nThe second film was not widely acclaimed because of its lack of direction and \ninconsistent tone. \nAs you can see, Variety Lights and The White Sheik are very light hearted films. Although the characters do evoke a sense of sadness and sympathy from the viewers, the overall tone is still light. It is not until I vitelloni that Fellini evolves and changes his direction from light hearted stories into more heavier subjects. \n\nI vitelloni is a coming of age story among a group of twenty something year old men who have a difficult time transitioning into adulthood. It is known that this is a semi-autobiographical film of Fellini as a young man. I vitelloni marks a new beginning for the film director. It can be argued that this is the film that begun his neorealism period. Meaning that, the characters and story imitates reality. The ending is open-ended and leaves a sense of uncertainty, just like life. After the completion of this film, Fellini evolves and enters into his second stage of filmmaking.\n\nUnlike the four films that have already been mentioned, the next three films in Fellini's work: La strada, Il bidone, and Nights of Cabiria are character driven stories. Whereas the first three films drove the story from multiple point of views, these next three films focus on one character's point of view. \n\nRight off the bat, each of the characters in the three films Zampano (La strada), Augusto (Il bidone), and Cabiria (Nights of Cabiria) all are tragic figures with major flaws that eventually leads them to their downfall. \n\nZampano is a traveling strongman making his earnings by wrapping and locking a chain around his chest and breaking free from the chain by using his own sheer strength. Zampano is a manly man. He is prideful, reserved, and a womanizer. When his assistant dies, Zampano delivers the unfortunate news back to her mother. Distraught and shattered, the mother must offer her younger daughter, Gelsomina to join Zampano's company to bring in extra income. Gelsomina is the anthesis of her new master. She is naive, curious, and warm. Throughout their travels together, Gelsomina wants nothing in life but to impress or even crack Zampano a smile. Although he threatens and insults her for pestering him, she continues on with her desires. \n\nIt is not until, the two meet another traveling performer, The Fool that Zampano and Gelsomina's relationship begins to change. Unlike Gelsomina, The Fool has no desire to impress the chain breaking attraction. On the contrary, The Fool delights in teasing him. \"He hasn't done anything to me, but I don't know why, I just can't help it.\"? he innocently admits. Gelsomina begins to see a major flaw in Zampano: he takes himself too seriously. After The Fool continues to insult him in jest, Zampano finally snaps and beats him to death. This shatters Gelsomina's spirit for life. From here on out, she becomes a zombie, walking in a state of shock. He didn't have to kill him (The Fool), she mutters, he was a nice man. Sick and tired of her mopping, Zampano abandons her when she is asleep. Five years later, Zampano hears of Gelsomina's slow erosion and is stricken with guilt. \n\nAugusto is a middle aged man who makes his living by swindling innocent and naive people from their fortunes. His way of life has estranged him from his wife and daughter. By a chance encounter, Augusto bumps into his daughter on the streets. They agree to meet on Sunday for lunch and a movie. At this point in the story, Augusto and his team of swindlers have already ripped off two families who were naive enough to give their entire fortune to his scam. By a chance encounter, a victim who recognizes Augusto at the theater immediately approaches him and turns him into the police. The daughter is mortified and stunned that her father could continue on to take advantage of innocent people. His way of life and greed eventually tears his relationship apart from his daughter.\n\nCabiria is a prostitute who is desperate to find love. When the film opens, she is walking alongside with a man by the river. She is in love and happy to be in love. Suddenly the man pushes her into the water and steals her purse. After the incident she does not accept that her \"lover\" would do that to her. She makes herself believe that it was only a practical joke. \"How can he do this to me? After all that I have done for him. Look at the clothes that I bought him!\" Her desperation to be loved and to give love paralyzes her from ever achieving happiness. But the ending leaves on an optimistic and hopeful tone. Perhaps one day she will be happy. \n\nIn 1960, Federico Fellini made La Dolce Vita. In a sense, the film is an epic master piece. Everything about that film seems perfect: the acting, the pacing of the story, the believability of the characters, the underlying messages, the themes, the symbolic meanings, and everything I fail to see. \n\nJust to elaborate on one of the points made, the film opens with a power symbolism. The story follows the life of a gossip columnist, Marchello as he navigates through Rome to find the next scoop for his magazine column. Along the way he meets and rubs elbows with Hollywood movie stars, intellectuals, party can-can girls, a princess, socialites and other distinct looking characters that can only be found in a Fellini film. When the film opens, it is a shot of a helicopter hoisting up a statue of Jesus Christ. The statue flies all over Rome. When several women sunbathers on the roof asks, Ã¢Where are you taking the statue?Ã¢? The men in the helicopter (one of them Marchello) responds, Ã¢to the Pope.Ã¢? What is symbolic about this opening is that the Jesus statue flies over Rome as if he is purifying the city of its sins. As the viewer will see, the city is full of adulterers and violent behaviors. \n\nMy only regret when I am watching a Fellini film is that I wish I had discovered him when I was much younger. There is still so much more of his films that I need to watch and understand. My analysis here was hopefully insightful to you, but I feel that I did not even come close to uncovering any of his underlying messages, themes, and basic understanding of his movies. The beautiful thing about film is that film never ages. We age however, but as we age, when we watch a film again we are able to pick up new things we had not seen before and understand an extra layer of the film we never noticed from the previous viewing. I know with Fellini films, I will be admiring them until the day I die.",
            "review_date": "2012-02-03",
            "source": "rt"
        },
        {
            "content": "Review coming to themoviefreakblog.com",
            "review_date": "2012-01-25",
            "source": "rt"
        },
        {
            "content": "After reading about this one, I may rewatch it someday.  It had it's moments for me but overall it was pretty dialouge heavy. That isn't neccesarily a bad thing, it was just hard to concentrate on the visuals when your reading subtitles.  Maybe i could find an english dub.  Also this movie was all over the place.  I didn't know what was going on until afterward when i read some interpretations on wikipedia.  Overall, i would say it was pretty interesting.",
            "review_date": "2012-01-20",
            "source": "rt"
        },
        {
            "content": "Watch the girl at the end of the movie who is trying to communicate with Marcello. That gesture contains the entire message of the film.",
            "review_date": "2012-01-13",
            "source": "rt"
        },
        {
            "content": "This has to be the first Fellini film that I had seen, and the one that I return to the most often, as it is just a delight from start to finish.  I really enjoy Marcello Mastrioanni's somewhat detached, bemused journey through the entourages of various celebrity figures, drifting in and out of their circles while still reporting on them to earn his living.\n\nAnd then there's the iconic imagery of Anita Ekberg frolicking in the Trevi Fountain.  Sigh.\n\nRecommended.",
            "review_date": "2012-01-09",
            "source": "rt"
        },
        {
            "content": "A classic, this film showcases the beauty of black and white camera work. It has a slow start that seemingly last for a very long time. We almost gave up watching it as there didn't appear to be a plot, but hung on and glad we stayed until the end. This movie is has inspired many other movie scenes. Having just seen My Week with Marilyn we saw influences of this film in it. The acting is a little over the top so as to be campy and not believable. But all in all it is a worthy piece of work. I give it a 70% on my tomatometer.",
            "review_date": "2012-01-08",
            "source": "rt"
        },
        {
            "content": "To quote a RYM-User: \"Who needs plot when you have Fellini?\"",
            "review_date": "2012-01-01",
            "source": "rt"
        },
        {
            "content": "I've seen somewhere between six & eight thousand movies in my life and yet I only saw this masterpiece for the first time last night.  There's probably an easy few hundred classic movies that people would be shocked to learn that I haven't seen. At least this is no longer one of them.",
            "review_date": "2011-12-31",
            "source": "rt"
        },
        {
            "content": "FINALLY watched this classic and get what all the hubbub is about.  Beautiful set pieces of Marcello Mastrianni cavorting with the rich, famous and terminally bored while his soul slowly decays.",
            "review_date": "2011-12-30",
            "source": "rt"
        },
        {
            "content": "It's not so much that I see more of the same in Fellini movies, It's that I'm starting to see identical events and themes, and it's starting to get boring.",
            "review_date": "2011-12-22",
            "source": "rt"
        },
        {
            "content": "Weird. Just weird. This was supposed to be such an amazing classic, but really...I felt like a lot of it was somewhat unnecessary. I felt like \"artistic liberty\" was taken too far at times. I did very much enjoy the famous fountain scene, though. Seeing the original scene for the first time was amazing, especially after watching \"Under the Tuscan Sun\" first.",
            "review_date": "2011-12-05",
            "source": "rt"
        },
        {
            "content": "Good film, more agony than comedy.",
            "review_date": "2011-12-01",
            "source": "rt"
        },
        {
            "content": "It looks nice, but there's not much to it. It's just a whole lot of scenes that really don't amount to anything or feel related somehow. Also, it's way too long. For a film around 2 hours and 45  minutes, it really doesn't hold your attention at all. Even if something interesting does happen, you've probably already checked out and don't care anyway.",
            "review_date": "2011-11-30",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful movies i've ever seen.",
            "review_date": "2011-11-20",
            "source": "rt"
        },
        {
            "content": "For three hours, Director Federico Fellini depicted Rome as a modern-day Sodom or Gomorrah, stringing together fictional episodes (some allegedly based on fact) designed to expose sin and corruption among the middle and upper classes.\r\n\r\nAs a unifying device. Fellini used a newspaper gossip columnist who either  observed or participated in the various events, from staging of a \"miracle,\" in which two children fasely claimed they saw a vision of the Madonna, to an orgy in an ancient castle peopled with prostitutes, transvestites, decadent aristocrats and other sordid types.\r\n\r\nThe gifted Marcello Mastroianni portrayed the columnist -- a man who did not feel deeply, had guilt feelings because he could not, and finally realized he had become immune to  emotion.\r\n\r\nWhatever one's reservations about the philosophical profundity or lack thereof in the film, there was no denying the technical skill with which it was made. Fellini's images were rich and brilliant  and edited so fluidly and diveresely that they fairly swirled across the screen, as well as Nino Rota's score, which has become a classic in its own right.",
            "review_date": "2011-11-15",
            "source": "rt"
        },
        {
            "content": "Some very iconic moments, stretched too much over a three hour running time. Well made, but has stretches where not much of interest is happening. I must say Anita Ekberg in that dress is breathtakingly gorgeous. A very influential movie, and I can see why.",
            "review_date": "2011-11-15",
            "source": "rt"
        },
        {
            "content": "This is an all-time classic.  It's so different from how films are made today.  It's also responsible for the creation of the term Paparazzi.  It's a MUST for any cinema lover...such a great film, and a fantastic score.\n\n- An all-time classic that I decided to re-watch after seeing 8 1/2 again.  This was very good, but I preferred 8 1/2. I am finding that I am enjoying Fellini's work more on the 2nd go around.",
            "review_date": "2011-11-13",
            "source": "rt"
        },
        {
            "content": "At the moment, this is my all time favourite film. Federico Fellini's arthouse extravaganza is a film which gives another, more amazing experience every time you see it. Marcello Mastroianni plays perfectly the role of Marcello Rubini, a gossip columnist who yearns to follow his ambitions of more serious writing, yet cannot resist the lustful temptations of his current chaotic, showbiz-filled life. It begins impressively. A statue of Jesus Christ hangs from a helicopter, being transported to the Pope, as we learn from the men in the news helicopter in tight pursuit, including Marcello and his photographer, Paparazzo (the now widely used term is derived from this character). Then we enter the life of Marcello, starting with him leaving an exclusive nightclub with a famous actress, giving a bisexual prostitute a ride home and eventually sleeping with the actress in the hooker's spare bedroom. This is an ordinary night for Marcello, and it only takes up the first few minutes. The film has no traditional plot structure, being more of a cautionary tale than a narrative story and, without spoiling anything, an ending that doesn't tie everything up in a neat little bow. This is far from a complaint, as the ending is in my opinion perfect, just like every other detail in this film. It's an epic masterpiece, and I adore every frame of it.",
            "review_date": "2011-11-12",
            "source": "rt"
        },
        {
            "content": "Anita Ekberg y su gatico, bella mujer.",
            "review_date": "2011-11-12",
            "source": "rt"
        },
        {
            "content": "This film is a hollow tragedy that leaves the viewer, together with several of the characters, looking with pity on Marcello. We watch as his frivolity and complete lack of integrity degrade and debase him, until, at the end of the film, he is little more than a shell of a man. \nMarcello is an apparently gifted writer that has chosen to wastefully dedicate his talents to the tabloids. He claims that he is writing a novel, but his time and life are lost in a pointless and relentless pursuit for sex. All things in his life are sacrificed to his empty romantic pursuits, which ultimately destroy him. His flattery, which might have once had a sort of youthful wistfulness or charm, wrecks his ambition, his morality, and ultimately leaves him drifting through a nihilistic life dedicated to little more than the superficialities and shenanigans of the wasting upper classes.\nIn certain brief moments we can see the depth of the character, but the moments of honesty and reflection are only chimerical, always overshadowed by his lust. An interesting revelation strikes Marcello in his time at the home of the Steiners. He looks upon their home as a \"sanctuary,\" and he listens enraptured to Mr. Steiner's thoughts about the world facing his children. He is amazed by Mr. Steiner's thoughts and the depth of his love and concern for his children. Yet, it is apparent that Marcello sees only the thin veneer of safety in the family's home, not comprehending Mr. Steiner's obvious torment when Mr. Steiner describes his feelings of belittlement and oblivion to the guests at the party. Furthermore, this is an interesting dichotomy at the party: while most of the guests are obsessed with the flatteries of meaningless poetry, art, and hedonism, Mr. Steiner records the sounds of nature, revealing a passion for reality that is only shared by Emma. However, Emma proves the stronger, attempting to love (albeit fruitlessly) the decaying Marcello, his Mr. Steiner takes the lives of his children and himself in despair. Both, it seems, feel true love and compassion, but while Emma manifests her love in single-minded, even obsessive devotion to a man that refuses to love and respect her, Mr. Steiner becomes lost and sees death as the only escape from a painful and senseless existence. \nAfter the party we see Marcello vanishing off to a beach to sit before his typewriter and attempt to put his thoughts and talents to work. However, after a brief interruption he gives up and begins to flatter an innocent young girl from the countryside. There is a sense that this is one of million small moments in which he caves in to his environment and relinquishes his efforts to create, and the sum of each small concession to the world is the loss of his soul. \nMarcello's interactions with his father reveal a deep source of his confusion. His father is a festive, free-spirited man that is a greater flatterer than Marcello. He leaves his wife at home to spend the night in Rome pursuing a dancer at a cabaret, then, near dawn, breaks down, both physically and emotionally, closes off to the world, and demands to return home to the safety of the countryside, his home and his wife. Marcello reveals the degree of distance that separates his family from himself, telling that his father was often gone for long periods during Marcello's childhood, leaving the boy with his crying mother at home while he undoubtedly tramped around the cities of Italy. In speaking of home, the old man reveals what drives himself (and his son): at home he feels old and lifeless, and he mistakes lust and drink for life and vivacity. Marcello is clearly terrified of the simplicity of \"home,\" and his fear of the calm and peaceful life that Emma fervently longs for drives his reckless pursuit of sexual gratification. \nBy the end of the film we see Marcello as a broken man. He degrades himself by degrading the drunken fools around him, and even they see the depth of his demise. The party itself, a celebration of the Mrs. Steiner's annulment by the Church, is a disgusting celebration of the \"freedom\" Mrs. Steiner has gained by the loss of her husband and children. Marcello looks dishevelled and worn, and upon seeing the innocent girl that spoke to him on the beach as he sat before his typewriter, he fails to recognize her, revealing that he has lost all recognition of the simple goodness and hope that she represents. Nonetheless, a glimmer of the depth of the character is still seen as he looks into the eyes of the dying sea creature lying hopelessly on the sand, surrounded by revellers and fishermen that feel nothing for the creature's agony, and asks why the creature insists on continuing to stare. However, as Marcello walks away from the young innocent girl calling to him from across the shallow waters (which he could have easily crossed), he stumbles across the sand with some drunken gal that represents nothing more than the senseless life that he has chosen to pursue. \nMarcello's relationship with Emma reveals the conflict inside the man: to Emma, Marcello is a cheat and a liar, but she is chained by her love and compassion to remain by his side, in spite of his constant abuse and infidelity. Marcello, on the other hand, continually belittles and ignores Emma, even telling his father that she is not his fiancé or even his girlfriend, but only the cleaning woman. Even when Emma attempts suicide, Marcello oscillates between love for Emma and his disgust for her, revealing his complete selfishness and egoism as he scolds her in rage for actions even as he carries her to the hospital. Later, as the two bitterly fight in the car on a dark, abandoned road, Marcello screams at her with bitter hatred, only to return for her and sleep in her arms. Marcello is scared of losing her, but despises the life that Emma represents. \nAt the end of the film we are left with one great impression: the meaningless, frivolous and empty life of the aristocracy, spent in pointless pursuit of hedonistic pleasure that demeans their lives and leaves their existence devoid of any true meaning, juxtaposed with the vision of the innocent, young girl from the provinces, who smiles as we recall her singing happily to the music on the radio as she works. It is apparent that she takes joy in the simple pleasures of her life, she is faithful to her home and her love, and her innocence separates her from the degradation of the life Marcello pursues.",
            "review_date": "2011-11-08",
            "source": "rt"
        },
        {
            "content": "alright fellini you win i don't get your movies",
            "review_date": "2011-10-25",
            "source": "rt"
        },
        {
            "content": "and now ...everybody will hate me...over rated... :)",
            "review_date": "2011-10-19",
            "source": "rt"
        },
        {
            "content": "Fellini provides all sorts of ways (political, mythic) to read his opus, but eschews term paper theses for a soulful and melancholy rendering of a person and a people in ethical and existential distress.",
            "review_date": "2011-10-11",
            "source": "rt"
        },
        {
            "content": "wow . . . looks good . . . another buddy of mine recommended it, so; it must be good!!!!  and my buddy is a GENIUS and a LITERARY WUNDERKIND, therefore you (Constant Reader) and I will trust my buddy's recommendations as being 100 Percent Fresh even when we are too preoccupied with other things and don't have a lot of time to sit down and watch movies.",
            "review_date": "2011-10-11",
            "source": "rt"
        },
        {
            "content": "Another Fellini masterpiece, although in my opinion not his best movie - I keep thinking Amacord and La Strada are better. La Dolce Vita tells the story of journalist and playboy Marcello who writes about the wonderful but rather empty (party)lives of the rich and famous in Rome. Meanwhile Marcello's life is not much different from theirs. The classic scene is the one with Anita Ekberg in the Trevi Fountain, but I personally thought the best shots were the opening ones, with the statue of Jesus flying under a helicopter.",
            "review_date": "2011-10-09",
            "source": "rt"
        },
        {
            "content": "I've seen somewhere between six & eight thousand movies in my life and yet I only saw this masterpiece for the first time last night.  There's probably an easy few hundred classic movies that people would be shocked to learn that I haven't seen. At least this is no longer one of them.",
            "review_date": "2011-10-01",
            "source": "rt"
        },
        {
            "content": "Comedy-drama film written and directed by the critically acclaimed director Federico Fellini. The film is a story of a passive journalist's week in Rome, and his search for both happiness and love that will never come. Generally cited as the film that marks the transition between Fellini's earlier neo-realist films and his later art films.Too much \"cerebral\" with a lot of disconected moments/scenes and too long.Maybe in a second view i change my mind...",
            "review_date": "2011-09-24",
            "source": "rt"
        },
        {
            "content": "Fellini made the first masterpiece of the 60's, sorry Hitchcock, with this film! It is a wonderfully made piece of art and still holds up as one of the great European films of all time!",
            "review_date": "2011-09-09",
            "source": "rt"
        },
        {
            "content": "Fellini creates a beautiful and tragic film about high society in Rome.  In many ways it seems like a 1960s Italian version of Fitzgerald's Great Gatsby.  A classic.",
            "review_date": "2011-09-03",
            "source": "rt"
        },
        {
            "content": "La Dolce Vita is a film that dissects and explores the meaning of art, transitioning between various unconnected scenes that defy all sense of a coherent story and come together to form a film that is very much a piece of art itself. But the components of this particular piece of art remain incomparable to any film made in the last 50 years: the sounds, the wonder, the love, the musicâ\"the breaking point of humanity. And as much as we aspire to disassociate our deepest passions from our deepest fears, the two sometimes unavoidably collide. To capture such as aesthetic on filmâ\"the aesthetic of hope in the face of despairâ\"is a monumental achievement. But director Federico Fellini took it one step further, integrating the all-too-relatable desire for understanding into an incredibly entertaining film full of dancing, singing and music, all of which tug at the very meaning of art.\n\nWhile each and every scene of La Dolce Vita features the burnt-out journalist Marcello Rubini (Marcello Mastroianni), and each and every scene sends him deeper into the pits of melancholy and incomprehension, there's very little traditional connectivity. But if you've seen a Fellini film, you've probably experienced such a strange, successful process. 8 Â 1/2 comes to mind, with the story shifting between dream sequences and Fellini's dream-like reality. But La Dolce Vita's unstructured story doesn't delve into the fantastical like 8 Â 1/2 or Juliet of the Spirits; it's much more like Amarcord in the way it treats its quirky characters and random events as part of reality. Instead of abandoning the film's eccentricity, we hum along to the unpredictable singing monologues and we tap our feet to the playful dancing. Dancing itself, much like it does in 8 Â 1/2, becomes a natural movement, with characters easily stepping into a dance or randomly busting a move that doesn't misguide them from their destination.\n\nThe scenes of full-on dance sequences and musical numbers are a wonder to witness, from the trumpeter who has a connection with balloons to Fellini's masterful tracking of Sylvia (Anita Ekberg) and her entourage's dance routine, but you don't need me to tell you that. Like very many of the characters convey throughout the film, the music and dancing in the film become pieces of art to appreciate for their beauty. For many, what lies on the surface suffices as captivating art. The intricacies of dancingâ\"the steps, the hips, the flow, the movementâ\"bypass all those people simply content with witnessing something beyond the ordinary. Some, however, fail to every make such a connection.\n\nSteiner (Alain Cuny), one of Marcello's good friends, is an intellectual that's lost any and all child-like appreciation for art. Reaching an old age, Steiner managed to completely disengage himself from any ignorant or blissful infatuation of art, instead resorting to the dull, detailed components, rendering art a sterile and academic affair. âOne should live outside of passions, beyond emotions,â? Steiner says. âIn that harmony you find in completed artworks, in that enchanted order.â? But does Steiner know true harmony? The answer comes within his own party, where he accidentally plays some nature sounds through an old recording. Embarrassed, he quickly turns it off, only to be pestered by Emma (Yvonne Furneaux) to play the sounds. Emma is impressed by them, and relishes in their beautiful simplicity, with no distracting images to cloud the sounds of trickling water, birds chirping or a gentle breeze. Steiner, on the other hand, seems detached, attaching the sounds to nothing more than a recording that belongs in a library of recordings.\n\nEven more discouraging is Marcello's numbness to the recordings, or any real form of art whatsoever. He shows no enthusiasm for his profession; he mocks Emma for finding the pathetic trumpeter to be tear-worthy; he stands back as Sylvia begins a dance party; he's unable to write his novel. He treads from person to person, night after night, looking for a sign that will deliver him some meaning. But in true Fellini fashion, the answer lies within the character himself. We see it in Nights of Cabiria, when Cabiria discovers happiness by realizing the simple joys around her, not searching for a grander picture; we see it in Juliet of the Spirits, when Juliet finally lets her husband go, thus releasing the spirits that haunted her mind; we even see it in La Strada, where Zampano's infamous breakdown sends him down the road of realization and self-forgiveness. Fellini, at the end of his career, said the only character he still worried about was Cabiria. If I were Fellini, I'd be more worried about Marcello, who receives so many conflicting views on art and its purpose that he eventually abandons attempt for understanding. He is pushed over the edge when Steiner commits suicide, just after murdering his two children. Earlier we see the two children smiling and dancing along to the party music, a true contrast between their content and Steiner's lack of passion. Burdened with such an image, Marcello says to himself, âI don't know anything...anything at all.â?\n\nMaybe Fellini isn't worried about Marcello because of his complete lack of artistry. Unlike Steiner, who had studied art so concisely that it lead to a deep, suicidal depression, Marcello's abandonment of finding deeper meaning sets him free. In the final scene, Marcello is happier than ever, prancing about and laughing during an orgy at a mansion. But it's tragic at the same time. The guests mock him and call him names during his drunken rant. Nobody gets excited for the striptease, instead criticizing the woman for her technique. Marcello covers a girl in feathers, only to look down on her with no emotion when she pathetically crawls away. The party that should be filled with the most lifeâ\"a fucking orgyâ\"is unfortunately stuffed with a group to which Marcello now belongs: people who have dismissed any sort of fulfillment for the sake of living in the moment. It's not the most respectably way to live, but it gets you from day to day.\n\nIn terms of story, âday to dayâ? is exactly how the story moves. And while its no phenomenon to shift a character through different settings each day, Fellini's use of symmetry to convey the disastrous cycle Marcello experiences is uncanny. The opening scene features a Jesus statue being lifted over the city of Rome, while the closing scene features a giant, ugly fishing being pulled to shore. The contrast between the images is as vast as the irony. What the statue (and religion for that matter) comes to represent, much like it did in Nights of Cabiria, is society's desire to find meaning through a filter. Incapable of looking deep into ourselves to find answers, we share a strong attraction for spiritual figures that speak to our deepest fears and hopes. One scene features a crowd of people who follow two children claiming to see the Madonna. It ends with the mass tearing away at a tree, trying to retrieve its branches solely because the children pointed towards it. Emma herself, who believes Marcello's love is the only thing worth living for, scrambles for branches herself. Since she cannot win his love, she feels the need for such distractions. Marcello, on the other hand, is incapable of feeling love and feels no desire to teach himself how, which is why he never ventures into the crowd. Come back to the dead fish, and you see the irony: the statue is fake, misleading and contrives an image of beauty, while the fish is real and obtrusively ugly. One sells an image, while the simply exists, not tip-toeing the lines of reality. One brings ignorant satisfaction, while the other tests your stomach's strength. Which would you rather have?\n\nThe review discusses the ideas challenged by Fellini himself, but those ideas actually play into the character and story guidelines we've set and come to expect from masterpieces. Marcello's troubles and questions harp on larger issues that plague humanity and push its own morals to the very core. Aren't we all capable of not loving? Or committing suicide and murdering our children? Does art carry meaning beyond a painting or a drawing? Does it live and breathe within dance, music and movies? Is it safe to attach yourself to such an idea? I say: yes. Of course art owns no universal meaning, and few films display that better than La Dolce Vita, which translates to âthe sweet life.â? Although it digs at the horrors and drawbacks of too much understanding, Fellini's masterpiece also balances it out with unforgettable images and scenes that tug at our heartstrings for simply being beautiful. \n\nNo scene speaks larger volumes than the film's quietest one, which features a young girl Marcello spoke with earlier while writing his novel. She yells to him across the beach, making typing motions with her hand. Just like the opening scene (more symmetry), Marcello finds himself unable to understand the girl in the film's closing moments. It's a communication breakdown that goes nowhere, yet leaves both parties blissfully happy. Marcello has abandoned writing and is no longer worried about becoming an artist, while the girl goes on believing Marcello to be a poet, reminiscing about his compliments on her beauty. And then, for no explicable reason, the girl turns to the camera and smiles, just like Cabiria did three years earlier. And once again you're caught off guard, but once again an unabashed smile spreads across your face, because you know that although we don't always understand everything going on around us, life goes on. And if you can't find comfort in that, then you've spent too much time looking for the sweet life.\n\nRead more reviews at http://cinemabeans.blogspot.com/",
            "review_date": "2011-08-31",
            "source": "rt"
        }
    ]
}