{
    "rating": 8.7,
    "release_date": "1960-10-07",
    "num_reviews": 370,
    "genres": [
        "History",
        "Drama",
        "Action"
    ],
    "summary": "The rebellious Thracian Spartacus, born and raised a slave, is sold to Gladiator trainer Batiatus. After weeks of being trained to kill for the arena, Spartacus turns on his owners and leads the other slaves in rebellion. As the rebels move from town to town, their numbers swell as escaped slaves join their ranks. Under the leadership of Spartacus, they make their way to southern Italy, where they will cross the sea and return to their homes.",
    "reviews": [
        {
            "content": "Great movie about arguably the greatest Bulgario to ever live. \n\nI may have been a victim of over-stoke, but still a heck of a picture.",
            "review_date": "2023-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie ended differently than I thought it would for a bit (in a very good and powerful way) and I liked the battle scene with the Romans and how it started, plus the famous \"I'm Spartacus!\" scene. The acting and dialogue were a bit outdated but it was very good for the time, and I can now finally see how so many films copied the material from this one (such as Gladiator and Braveheart). While I liked the 10 Commandments more and while this was an overly lengthy movie to watch, it remained impressive and I was hooked from the very beginning. It's important to watch older films that are actually original for the time that they came out, and Stanley Kubrick will always be the ultimate king of directing movies! RIP and RIP to everyone else who participated in this production.",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Spartacus\" has that old-school epic feel that few films of today have. This is undoubtedly a long movie, but it tells a complete story. The production value is so impressive and even more so considering when it was made. I enjoyed the film's big moments and felt a bit hit or miss with its dialogue-heavy and talky moments. Sometimes I felt completely engaged and other times a bit bored. Nonetheless, the movie has plenty of entertainment value, particularly at the beginning and near the end which makes it a worthwhile experience. I also think the performances and characters are well thought out here and I really did feel immersed in the world it was wanting to create. Kirk Douglas gave a really memorable lead performance here and it carries the movie in any areas it may lack or feel dated. Overall, this is one of Kubrick's earliest big movies and it is a solid part of his diverse film library.",
            "review_date": "2022-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An instant classic film that had the opportunity to have one of the greatest movie endings of all time. They should have ended at I'M SPARTACUS.",
            "review_date": "2022-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a much underrated classic.\nFirst, the writing. It is excellent throughout. Yes, there is a lot of controversy as to whether Ustinov wrote his own dialogue and what role Kirk Douglas played in changing lines on set - that's all trivia. Dalton Trumbo wrote a great script. From the very outset, he knew he had to write a script where the title character was crucified at the end  - and yet the movie had to 'uplifting.' He succeeded. The dynamic between the characters is always electrifying. And the love story - well, it is one of the best ever put on screen. \nNext, the acting - again, it doesn't get any better. From Douglas' teeth-grinding action scenes to Olivier's smooth but uncompromising Roman dictator-in-waiting to Jean Simmonds masterful performance of a slave woman searching for a way to be free, there are few movies that can boast the kind of top to bottom great acting that htis movie has. \nThen, the other parts that make a movie rise above the rest - starting with its director, Stanley Kubrick. This is an epic movie told at a persoanl level. Some of the scenes are so well staged ans hot that they take your breath away. Russell Metty doesn't have the reputation that some cinematographers have, but this movie shows what he could do when given the chance. Alex North's score is heralded as one of if the greatest score ever written for a film. Saul Bass did the credits and they are outstanding - yes, the credits are worth watching! \nSee this movie - on a big screen if you can, but see it. It's one of the greatest movies evewr made. It's Spartacus!",
            "review_date": "2022-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film with a cast of thousands . One of kirk douglas greatest films . Good costumes , battle scenes , and a brilliant supporting cast.",
            "review_date": "2022-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Putting the word \"epic\" into an epic.",
            "review_date": "2022-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Released soon after Ben-Hur and telling a similar story, Spartacus is also a terrific movie whose action and cinematography have stood the test of time. Since this was the only Stanley Kubric movie where he didn't have complete control, he later disowned it - but it's a mark of his ridiculous levels that his discard bin contains a film like this.",
            "review_date": "2022-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This classic war movie was spectacular. Kirk Douglas, Lawrence Olivier, Jean Simmons, Tony Curtis, Charles Laughton, Peter Ustinov, and the rest of the cast did a spectacular job in this movie. This true story about Spartacus, the man who fought against the Roman Empire was dramatic, intense, and inspirational. Spartacus was a very courageous man that wanted what is right for his people and do whatever it takes to get it. That's a true warrior. If you haven't seen this classic movie yet, check it out sometime. It's a definite must see.",
            "review_date": "2021-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply one of the greatest movies ever made.",
            "review_date": "2021-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only people who like this film were alive during the war in Vietnam.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ages 13+ only; full of action & humor!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With an astonishing cinematography, a remarkable costume design, beautiful performances and an epic story, ‘Spartacus' will remain as a must-see classic forever.",
            "review_date": "2021-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This would likely be my least favorite of Kubrick's films personally, despite also being his most accessible work. This felt similar to a lot of the grand studio epics being produced at this time with the straight forward plot and the breathtaking immensity, making the ambition one must possess to even undertake a project this large in scope quite admirable. Kirk Douglas was surely memorable but the supporting cast was excellent as well and as always Kubrick makes everything look absolutely stunning to the point where I could put headphones on for most of his films and still have an enjoyable experience with the visuals alone.\n\n*I was going to wait and watch this upon starting the AFI ten year anniversary list with the new year, but as a lover of stats and metrics I saw this not only was the last Kubrick film I havent seen, but would also be the 1000th film I've logged since joining Letterboxd, as well as the 200th film I've watched from the NY Times 1000 Essential Films list I began a little over a year ago.",
            "review_date": "2021-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus is a true epic in every sense of the word. The action choreography and violence is actually quite intense for a movie released in 1960. The scale of the locations and the thousands of extras grounds it in realism while feeling truly massive. In many ways this movie feels ahead of its time, it features some graphic violence not seen in movies of this era. **SPOILER** The tragic ending is really sad, and it shows how much they make you care about these characters that it hits as hard as it does without crossing into melodrama",
            "review_date": "2020-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the very best.\nSuperb acting all around\nCharles Laughton is magnificent. Jean Simmons utterly beautiful",
            "review_date": "2020-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the most famous \"old epic\", made by probably the most acclaimed director ever (even though this movie doesn't give Kubrick vibes except in a few scenes). However, I wouldn't consider this movie a must see any longer: the action and the romance have noticeably aged and don't work as good as in the 60s, and this makes the 3 hours a little harder to withstand. Despite that Spartacus remains a comfortable movie to watch and return to, with a strong morale that will never grow old and some brilliant performances, especially by the supporting actors that create deep and complex characters, sometimes witty, sometimes funny, sometimes sly.",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good super long movie starring Kirk Douglas.",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the greatest historical dramas ever made. It was directed by Stanley Kubrick, written by Dalton Trumbo and stars Kurt Douglas and Lawrence Olivier in iconic performances. Behind the scenes, Douglas insisted on Dalton Trumbo despite the fact that he was on a McCarthy era blacklist. That determination to do the right thing regardless of the risk was essentially the theme of the movie.",
            "review_date": "2020-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding picture, great screenplay by Dalton Trumbo, great direction by Stanley Kubrick but, most of all, outstanding lead by Kirk Douglas, Laurence Olivier, Charles Laughton, Peter Ustinov in an Oscar-winning role, Woody Strode in a small, important role, and Tony Curtis.",
            "review_date": "2020-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far to long but emotional and effective.",
            "review_date": "2020-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic. Great cast ! ",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Less a personal odyssey than a political commentary cast through a historical lens, Spartacus may be the least \"Kubrick\" of the great films put out by the director, who took over another filmmaker's half-finished project and was still bound by many of the restrictions of conventional Hollywood, and it shows. Most of the director's touch is evident in the battle scenes, where his flair for wide shots and meticulously crafted choreography is immediately evident. The themes are relatively simplistic, but timeless, and the performances are great all around. It is certainly a strong film among the many mid-century epics, but doesn't topple such greats as Lawrence of Arabia, nor does it match the entertainment value of Ben-Hur. (4/5)",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "60 years later, I finally decide to give it a whirl and am genuinely surprised by just how much I enjoyed it.  Extra .25 star for holding up so well.",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus is a typical example of big budget, 3 1/2+ hour, historical epics that populated its time and it is a fine one at that. There are so many great decisions though it is hard to know who to credit them to. Apparently, Kubrick himself did much of the work that was credited to Cinematographer Russell Metty and there were many alterations made to Dalton Trumbo's script by actors who desired changes to their parts. The whole thing comes together to deliver a tale of epic proportions and intimate emotions. The best moments don't really come from the huge battles pitting thousands of extras against each other(though they are very impressive). Instead it is the small moments of human connection – the brush of hands against each other or an embrace of brothers in arms- that truly gives the film its gravitas. It's courage to deal with some grotesque issues head on and its lack of squeamishness with the violence and sex it portrays sets it apart from some other films of its time. The film loses momentum slightly every time it has to cut from Spartacus and his army back to the political drama of the Senators in Rome for more of Trumbo's not-so-thinly-veiled messages about persecutions made by those in government. With the exception of some California plant life that doesn't quite fit into the Roman country side and some lazily used day-for-night filters, the whole production was quite something to behold. The late great Kirk Douglass delivers every impassioned speech of freedom with a deep and moving sense of conviction. All of this is underscored by Alex North's wonderful score.—————–Overall: A superb swords and sandals epic that delivers an emotionally satisfying piece of cinema in both large and small scale ways.———Highlight: The scene when Spartacus and Antoninus fight over who dies quickly and who will be crucified(both of course want the other to get the painless death) is so compelling in its portrayal of human love.",
            "review_date": "2020-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was well acted and had a great & compelling story to it, unfortunately it was too long. It could have easily shaved off 30 - 60 minutes and been a better movie.",
            "review_date": "2020-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus may look like an average movie that has the similar 1950s look, but Stanley Kubrick still call all the shots on this movie. I love Kirk Douglas' performance as Spartacus, the action sequences, the story, and the camera shots. There is nothing bad about this bad except that Kubrick didn't have any creative control. At least this movie helped Kubrick put himself into Hollywood. Overall, Spartacus showed his bravery in front of my eyes.",
            "review_date": "2020-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is an epic but shave off a lot of staring at each other and about and hour and it goes up a star. As it is the acting is good, the sets and the scope beautiful. The fight scenes are few and far between and really not done well. For me it was pretty boring at times . It is ok",
            "review_date": "2020-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was decent. A few moments did feel a bit dull, but this movie had a story line and characters that got me interested in this movie",
            "review_date": "2020-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While slightly long winded and some timely cliche romantic elements, it delivers an epic story of rebellion against the most powerful empire of ancient history. Really outstanding acting throughout the cast! The music is also fittingly epic and intense. Easily one of the best movies regarding ancient Roman times.",
            "review_date": "2020-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful but not always engaging. Kirk Douglas plays a deep, stirring soul; a particularly wonderful scene when alone with his first love and fellow freed slave where he allows his pent up and maybe never felt emotions to run free is a glorious scene of relief. And Peter Ustinov as the slave owner is just dynamite, an effortless performance that will take me deep into his filmography.\nThe picture is terrific, beautiful and there are moments of brilliance in the set design, set extensions, staging and fight scenes. The quiet moments draw you in with the tension of an expert craftsman filmmaker and the music is as superb and subtle a tapestry as Kirk Douglas' portrayal of the titular Spartacus.\nI'm definitely spoilt on modern blockbuster epics; Gladiator being the ultimate distillation and modernisation of the genre, managing to do twice as much in half the time and set a trend with its fresh tone instead of looking backwards like many swords and sandals did.\nHowever, Spartacus is more interested in giving us poetry and the ensemble, not the singular journey (encapsulated perhaps perfectly in the \"I'm Spartacus\" scene), and the oppression and stoicism of the first hour masterfully offsets the richness and colour and humanity of the subsequent two.\nSpartacus evolves into a rich, classy, confident movie with a tremendous cast and something to say.",
            "review_date": "2020-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional , it was a believable rendition of the life of slaves by the Roman Empire. The saga of this man Spartacus by Kirk Douglas was well done. Jeanne Simmons's role was true to the love she had for him. All of the cast showed their talent as actors. Hope to see it again.",
            "review_date": "2020-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched in honor of Kirk's passing. \nEnjoyable epic.",
            "review_date": "2020-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is one of the many masterpieces of Stanley Kubrick. Definitely fresh",
            "review_date": "2020-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best of the epic movies of the time, and great starring performances by Kirk Douglas, Tony Curtis and Jean Simmons",
            "review_date": "2020-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although is well set and screened, I find it empty and well... not so epic",
            "review_date": "2019-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kirk Douglas is terrific as the iron-jawed slave fueled by righteous fury.\nKirk Douglas, Laurence Olivier, Jean Simmons, Tony Curtis, Charles Laughton, Peter Ustinov, John Gavin, Nina Foch, Herbert Lom, John Ireland, Charles McGraw, Woody Strode, Joanna Barnes.\nEpic-scale saga with Douglas as a rebellious slave who leads a crusade for freedom against the forces of the Roman Empire. Rousing battle scenes, great costumes and art direction, never been better cinematography and screenplay by Trumbo. WWII Navy vet Kirk Douglas gave Trumbo the screenplay credit.\nMost of the film is historically accurate. It made Kubrick's reputation, freeing him to become one of the most influential directors of the last half of the 20th century. It's the only film the British masters Olivier and Laughton ever acted in together. The only Kubrick film yielding an actor's Oscar, for Peter Ustinov. When combat veteran President-elect Kennedy crossed Legion picket lines to see it, the film broke the Hollywood blacklist. Multi layered film and absolutely a must see masterpiece.",
            "review_date": "2019-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever........They can't make them like this anymore ",
            "review_date": "2019-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So historical epics aren't really my thing and the only reason that I watched this film was because Stanley Kubrick directed it. Unfortunately the brilliance of 2001: A Space Odyssey (1968) and A Clockwork Orange (1971) isn't present in this very generic Ben-Hur (1959) rip-off. I was mostly bored during the three hours and four minutes I spent watching this film and I failed to see what made the film so popular and acclaimed. It's not the fault of the film's lead as Kirk Douglas is fantastic in Paths of Glory (1957) and Champion (1949) but he doesn't hold the attention of a viewer for that long. There were no real spectacles to marvel at unlike in Ben-Hur and the characters felt inert and lacking in personality. If you want to see a great epic watch Gone With the Wind (1939) or Out of Africa (1985) because this isn't worth your time.\n\nThracian warrior Spartacus, Kirk Douglas, is bought by a slaveholder and trained to become a gladiator against his will, during this time he falls in love with Varinia, Jean Simmons. He is eventually freed due to the sacrifice of fellow slave Draba, Woody Strode, as he and the other gladiators lead a revolt against the guards and escape but Varinia is bought by evil dictator Crassus, Laurence Olivier, who vows to destroy Spartacus. Spartacus' success continues as he frees slaves from around the country and builds up his army to fight the Roman Empire while infighting in the Roman court continues. In the end Spartacus and his army are defeated but Varinia and his baby get to see him one last time as he is being crucified.\n\nI suppose the part of the film that was meant to appeal to me most was the romance but much like in other epics of this type it felt underdeveloped. When we first see Varinia we understand that she is beautiful and virtuous because she largely doesn't speak, a shorthand in films from this area, but we never really learn anything about her beyond this. Why are she and Spartacus attracted to one another beyond the fact that they are both good looking? This plot element is ostensibly the emotional center of the film as the sight of him dying while his wife and son watch him is clearly meant to wring tears out of us. The dialogue during the scenes where they get to know one another is flat and dull and the two actors are trying too hard to inject some excitement into these scenes. If this were a more modern film I am sure that Varinia would have something more to her character but expecting her to be Jimena from El Cid (1961) was unrealistic.\n\nThis was also one of the few films where I was desperate for them to get to the fighting instead of spending so much time with the politicians arguing. Their conflicts weren't particularly interesting although I'm not going to complain about the scene set in a spa. If they had delved deeper into the psyche of a young Caesar or made the rivalry between Gracchus and Crassus more intense I would have been more invested but it just felt stale after a while as we kept cutting back to old white men in robes speaking in hushed tones. Even Gladiator (2000) does the political intrigue better than this film and that says something because Gladiator's screenplay is heavily derivative of The Robe (1953) and Cleopatra (1963). Obviously Dalton Trumbo is capable of doing great work as shown by You Belong to Me (1941) and Hawaii (1966) but this screenplay could have used a bit of editing down.\n\nThis is definitely a dip in Kubrick's filmography as it comes between the brilliance of Paths of Glory and Lolita (1962) which boasts great performances from Shelley Winters and James Mason. He obviously produced some of his best work in the 1960s and 1970s and this film would have been even worse without his talents behind the camera but this isn't one of his classics and I hope that Barry Lyndon (1975) and Full Metal Jacket (1987), equally acclaimed productions, do not disappoint me as this film has.",
            "review_date": "2019-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus shows that you don't need buckets of blood to portray good battle scenes",
            "review_date": "2019-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "boring old hollywood style epic with that canned elevator music. still it was the best of its kind",
            "review_date": "2019-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus: With terrific preformances, epic action, grandiose storytelling and Kubricks masterful touch, Spartacus is as an epic sword and scandal classic masterpiece of epic movies, one thats bold cinematic entertainment.",
            "review_date": "2019-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece that has one of the most memorable scenes in cinematic history. Kids who don't even know who Kirk Douglas is might be able to quote it too. There was also a stage presence by leading men back then that is seldom rivaled today.",
            "review_date": "2019-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although the film may suffer from comparison with the rest of Kubrick's oeuvre, on its own SPARTACUS stands as one of the great cinematic epics, and among the best of the sword and sandal genre, often more memorable and engrossing than modern semi-digital analogues like GLADIATOR. The excitement of the latter is also its downfall: It is a movie about spectacle, about carnal violence, which it partakes in as much it critiques, the story of a virtuous individual who must regain his rightful position of dignity, the spiritually true heir set against the corruption of the undignified usurper-a classic tale of riches to rags to riches, of the prodigal hero returned to his rightful position of power. On the other hand, the story of SPARTACUS is as much about those he inspires as it is about the man himself, a person born into slavery and who flatly rejects claims of hierarchy and power-when given the opportunity, he denies any royal bloodline and, like Cincinnatus or Washington, refuses authority beyond that which is necessary and thrust upon him, breaking the system of violence and inequity rather than trying to beat by playing the gladiatorial games. The titles illustrate this dichotomy perfectly: GLADIATOR looms large and threateningly, a role for Maximus to step into a fill as the true, Platonic, paradigmatic warrior; SPARTACUS, instead, is not only the name of the historical figure who led a slave revolt, but becomes a signifier for all who join that cause, for all of righteous heart, a name we might even claim as our own: \"I am Spartacus.\"\n\nIn this way, the epic continues to speak to our times: It is easy to see the scenes of the Senate and recognize the backstabbing, the corruption, the hypocrisy of our own political system; and when Crassus speaks of using his wealth to return Rome to its former glory, it is hard not to recognize the terrible parallel avant la lettre: MRGA might be the new SPQR. In its best moments, SPARTACUS achieves a brilliant synthesis of the ancient and the modern-whether America during the creeping fascism of the Red Scare and the Black List, or during the creepy fascism of the Red Caps against BLM-the epic and the personal (in its love story), the heroic and the tragic. For a story set two millennia ago and made a half-century ago, SPARTACUS still feels fresh and alive even without the benefit of added computer graphics or action choreography, because the film doesn't just put the viewer on the edge of her seat, but asks you to rise up and join the chorus in your own voice: I, too, am Spartacus.",
            "review_date": "2018-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not exactly a Kubrick's film, but still an enjoyable experience.",
            "review_date": "2018-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While gaining no points for HISTORICAL accuracy, Kubrick delivers a VIBRANT SPECTACLE with mans eternal quest for freedom at its center. \n\nHelped by an amazing cast, with Jean Simmons and Charles Laughton deserving special mention, showing (yet again) that CGI runs second to giving great actors space to perform in.",
            "review_date": "2018-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I simply don't understand the appeal of this film. Epics were a dime a dozen during this era and, for the most part, I can respect what was accomplished, although hearing and watching Shakespearean actors portray foreign roles is immensely annoying. However, \"Spartacus\" is in a class by itself. Kirk Douglas is too American, too old and too wrong for this part in every way. Sir Laurence Olivier and Peter Ustinov save it from being a complete disaster, but attributing this snoozefest to Stanley Kubrick is just a shame. The gladiator training scenes were boring and poorly choreographed. The big battle scene is too long and anti-climactic. Compared to \"Ben-Hur,\" released the year prior, \"Spartacus\" is a bore. I never care about Spartacus' hatred toward slavery. I never quite see the transformation from slave to revolutionary. It just happens. As a result, character development is mixed and, in some cases, completely lost.",
            "review_date": "2018-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They just don't make em like this anymore. Spartacus impresses on multiple levels from acting, writing and action. It's a must see classic.",
            "review_date": "2018-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stanley Kubrick directed an epic masterpiece of cinema with his 1960 classic Spartacus. Every shot shows the massive scope or the most intimate emotion. He recreates ancient Rome with painstaking detail from architecture, costumes, language, colors, and hundreds of extras. Creative cinematography reveal Kubrick to be a brilliant director early on in his career.\n\nDalton Trumbo's writing is what makes Spartacus shine! Spartacus is a timeless film that demonstrates the inhumanity of slavery and heart of a an ambitious slave. You get villainous monologues that decipher the motivations of even the most heinous of men, long accounts of Roman history, battle rally speeches to bolster morale, to loving conversations that develop the adorably sincere romance. Spartacus persists as a cinema classic for its harrowing tale of freedom and undying love. It is a genius story told in a careful manner.\n\nKirk Douglas delivers his most  well rounded performance of his career as the titular hero Spartacus. He is quiet as the defeated slave, fierce as the brave gladiator, kind as the devoted lover, clever as the military general, and mindful in his curiosity. He is so subtle showing Spartacus' pain and longing hardly without words. It is a wonderful display of acting.\n\nSpartacus boasts one of the most exhilarating ensembles in cinema. Sir Laurence Olivier is devastatingly cruel and clever as the egotistical and ambitious Crassus who devotion to Rome leads to atrocity. Jean Simmons is delightful and so strong as the female lead Varinia. Tony Curtis is so sweet and charming as the faithful Antoninus. Charles Laughton is so deviously clever is his political scheming as Gracchus. Finally, Peter Ustinov is hilarious as the opportunistic slave merchant Batiatus. Everyone plays their part to perfection.\n\nThe music is very fitting and Spartacus remains as having one of the most lovely romance themes in film history. Every time you see Kirk Douglas on screen with Jean Simmons, the strings swell into this heavenly symphony you will love.\n\nWatch Spartacus and behold a true masterwork of film.",
            "review_date": "2018-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus may be dated, but its fleshed-out lead and sweeping scope help craft a terrific historical drama.",
            "review_date": "2018-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, but not a very creative Kubrick movie due to his limitations during production.",
            "review_date": "2017-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus is probably the best historical epic film I\u0092ve seen. It tells a powerful tale of a man who inspired slaves to fight for freedom and who almost took down Rome in the process. Kirk Douglas is great despite the fact that he doesn\u0092t have a ton of lines throughout the movie. They make Spartacus rather soft-spoken most of the time, and only occasionally does he break out into big speeches. On the flip side there are superb actors as the Roman leaders who seemingly never stop talking including Laurence Olivier, Charles Laughton, and Peter Ustinov. They all provide a great contrast to Douglas, and deliver something special. The visuals in this movie are also remarkable, including some battle scenes that are nothing short of miraculous, considering they had to do it all without special effects back in those days. I thought the story had a nice build to it, and the movie never felt like it was overstaying its welcome, even if it was a bit overlong. Occasionally there were elements that were added to the story as subplots that didn\u0092t need to be there, or should have been added in a way that would flow better with the main narrative. However, despite any little missteps, Spartacus was a wonderful story with a number of great moments. It also pushed the boundaries of what was considered acceptable in the early 1960s, and possibly challenged audiences back in 1960. The conclusion was a marvelous mix of happy and sad that fit the tone of the entire film perfectly. I\u0092ll gladly watch Spartacus again any time, and certainly over most other sword-and-sandals movies I\u0092ve seen.",
            "review_date": "2017-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion, this should have been the most successful film ever at the academy Awards. It should have won almost all of the awards. One of the best films ever made.",
            "review_date": "2017-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jaw-droppingly choreographed and genre-pushing for its time, this imperial epic presents strong actors and an engaging sense of rebellion, but not entirely a respectable tone.",
            "review_date": "2017-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great, powerful, important, classic and beautiful, \"Spartacus\" is one of the most important epic movies of the 20th Century and of All Time! The partnership director-actor between Stanley Kubrick and Kirk Douglas once again delivered a fantastic movie. Alongside 1959 Ben-Hur and 1962 Lawrence of Arabia, \"Spartacus\" restored the taste for epic action and huge battle sequences that the audience was looking for and defined a whole generation of moviegoers!",
            "review_date": "2017-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With freedom at it's heart, this film tells the story of a slave who would not be broken and in so doing created the spiral of events that made Julius Caesar emperor of Rome. The world would not be shaped as it is today without the actions of this man, and his story is inspiring to all who feel bondage in their life. If we can just somehow bring liberty to our children, all of our efforts are worth it. This film shows that even in loss, we can win.",
            "review_date": "2017-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a powerful classic with many remarkable scenes and strong Kubrick direction (watch the final battle scene that brings to mind 'Braveheart') about the Roman Empire. But it feels somewhat dated, or maybe it's just me.",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smooth and stylish direction, superb production and a delightful script makes of Spartacus an instant classic among the best Hollywood epics, and another impecable entry in Kubrick's unbeatable filmography.",
            "review_date": "2017-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of essential of epic roman movies. Kirk Douglas is astonishing so unforgetable as the iconic hero and liberator.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kubrick's most underrated film, (which is curiously one of the best) presents us with the great vision of the director of the history of Spartacus.\nThe performance of Kirk Douglas along with the handling of the story make this film a jewel of epic cinema, to the caliber of Ben-Hur or Quo-Vadis.",
            "review_date": "2017-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Location, location ,location. You can really tell that they scouted low and high to find these amazing places around the world. They're beautiful.\n\nThe beginning sequence with the slaves arriving to the palace reminds of the beginning of Skyrim. The lighting in this movie is marvelous. And the tune that plays when Varinia goes into Spartacus' cell, is the same sample used in one of Nujabes' songs. I thought that was really cool.\n\nHow absolutely outlandish to see how slaves are bought and then trained to fight just for a couple of rich shit heads to come and demand that they fight each other, when they're not supposed to. Seeing how ruthless Crassus really is when he stabbed the Ethiopian, sent a shiver down my spine. I knew at that moment that he was no good.",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another classic from Mr. Kubrick.",
            "review_date": "2017-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic gladiator tale, long before Gladiator or Braveheart copied this film. Great performances, intense action for its time, an overall classic tale. Too bad it was so long and sometimes boring and had mixed tones and a somewhat uneven story. Maybe it was just me but I could get full invested.",
            "review_date": "2016-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Spartacus' is a classic that will rouse you with its epic tale of fighting for freedom, regardless of whether you like oysters or snails.",
            "review_date": "2016-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting, costuming, eye-popping action scenes, and character interplay in Spartacus is wonderful, but there is a lot of politicking that fills up the lengthy runtime and I found myself losing focus often whenever scenes switched over to the senate.\n\nIs this how my friends felt when they watched the first season of The Wire?",
            "review_date": "2016-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I forgot how great the acting is in this movie. Even though Kubrick later disowned the movie, I still consider it to be one of his bests.",
            "review_date": "2016-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "neither beautiful bodies, nor blood!!!! I'm too gory to be so soft, as spartacus seems to be in this movie!!!",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If anything, Kubrick's SPARTACUS is about its excellent performances.",
            "review_date": "2016-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 plus hours long and it wasn't a pain to sit through. The story felt like a mix of Gladiator and Ten Commandments(minus the religious aspect) and what an ending here..  good stuff out of Kirk Douglas as well as the supporting cast.",
            "review_date": "2016-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic in spectacles set in antiquity and a wonderful performances.",
            "review_date": "2016-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Kirk Douglas vanity project and plagued by production woes, this ambitious cinematic feat turns out to be stirring of epic proportions with no small aid from the writing by Dalton Trumbo, the sweeping score by Alex North and its cinematographic grandeur.",
            "review_date": "2016-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really great film from an amazing director.",
            "review_date": "2016-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus, Spartacus is not one of Stanley Kubrick's favorite that he intended to be. As for the general audience of the world they think it is a true beautiful masterpiece by Stanley Kubrick. First time seeing it in myself when you're in high school in a world history class we witnessed the controversy of  communism and the struggles of the poor and the gladiators. Written by dalton Trumbo, as I think is one of the best screenplay is ever been written and cinema history. Every single practical scenery of this film is very eye-opening and yet so telling at the same time. Stanley Kubrick is never a lazy director when he does not want to do a project that he really does not want to do. Yet it is so magnificent to see this every single time when I have a chance to see it. Again it is very artsy and yet so meaningful at the same time. It did a lot of cinema challenges that never been done. One of the  most I would to seeing movie cinemas history to see. I highly recommend saying this film yet is not Stanley Kubrick favorite but yet to all.\n\nGrade \nA perfect 10\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI",
            "review_date": "2016-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's too long, but it is an epic, so it's forgivable.",
            "review_date": "2016-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My only real issue with Spartacus is its length. The filmmakers could have easily shaved off an hour of this movie, but they wanted to show off their sets, their costumes and their extras. However, it's obvious how influential this movie was. This is an impressive epic drama that is definitely worth a watch.",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sword and sandal grandpa of Gladiator this film has some heart wrenching moments, a bittersweet ending (rare for classic Hollywood) and Kubrick's masterful direction. Only thing to say is \"I'm Spartacus!\"",
            "review_date": "2016-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not strictly 100% a Kubrick film there is still plenty to enjoy here from the movie that would go on to influence so many others not least 'Gladiator' and 'Braveheart'.  The first half is the best, it gets a little bogged down in the second half with protracted drawn out battles.  Douglas simmers throughout though and Olivier tears up the scenery as the boo-hiss villain.",
            "review_date": "2016-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus never has anything unique about it that would differentiate it from other epics of the time and it is uneven at times, but it is mostly such a good and very entertaining film filled with great visuals, some excellent performances, solid dialogue and many great scenes. It isn't great, but it is pretty good and such an entertaining, always engaging flick which is admirable given its long running time.",
            "review_date": "2016-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus has some of the greatest scenes I've ever seen, but it's so long and so boring, it's a good movie, but I'll never watch it again.",
            "review_date": "2016-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This epic historical drama contains a plethora of Hollywood's golden actors, and the direction by Kubric is an added plus. Featuring some classic battle scenes and a solid screenplay, this film is in some ways ahead of its time, and is considered to be one of the greatest epics of all time. 1001",
            "review_date": "2016-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story telling at its finest also the cinematography is on point. The battling scene would not happen today you would need CGI effects because it's heart impossible to get that much people !",
            "review_date": "2016-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm Spartacus\nI'm Spartacus\nI\"M SPARTACUS\nLove that scene.",
            "review_date": "2016-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's been written by many that Spartacus was more the baby of Kirk Douglas than Stanley Kubrick, and whether that's true or not, it's easy to see why such an opinion still persists decades later. Despite featuring many touches that can only be described as Kubrickian, the film is formulaic to a fault. If you've seen one sword-and-sandals epic, you've seen them all, as far as I'm concerned, and despite being directed by one of cinema's great innovators, Spartacus doesn't feature much that's new and different.\n\nThat doesn't mean it's not a quality film, however. The production values are top-notch, it contains a handful of rousing action sequences, and the aforementioned Kubrickian touches always come as welcome surprises. It just doesn't do a ton to overcome the trappings of a somewhat silly genre. Douglas stars as Spartacus, a slave of the mighty Roman Empire who works in the salt mines of Libya. Early in the film, he is sold to Batiatus (Peter Ustinov), a sniveling bureaucrat with a moderate level of wealth and importance, who trains him to become a gladiator. With dozens of other angry gladiators at his side, Spartacus revolts and leads his men into the Roman countryside to recruit other slaves to join their ranks. Meanwhile, in Rome, Senator Gracchus (Charles Laughton) and General Crassus (Laurence Olivier) wage a mostly private war against each other for influence and power, while the rest of the Senate disputes what to do about the Empire's fastest-growing threat-Spartacus.\n\nSpartacus' plan for his men-to move south and meet up with Silesian pirates with whom Spartacus has brokered a deal-follows the historical record, at least as far as it's known. The rest of the story appears to be a mixture of fact and fiction. A man named Spartacus did, in fact, lead one of the biggest slave revolts in Roman history. He was trained at a camp belonging to Batiatus. And Crassus was the general who ultimately led the opposition against him. Much of the rest of the film, it seems, is more based on the novel Spartacus by Howard Fast, which was published about a decade before the 1960 release of this film.\n\nIt's a very dense story, which leads me to believe the novel is equally dense and the adaptation very literal. It's hard to argue the film doesn't feel a little bloated, with side character after side character getting more than his fair share of development. That's not a bad thing, per se, but when your film is already running at three hours, I don't have any objections with skipping the tenth-billed actor's denoument. But this is the era for big, bombastic historical epics. Douglas reportedly jumped on this project out of anger for being turned down the titular role in Ben-Hur, and with such a heavy involvement in the production, one has to expect he'd want this film to be as epic as possible. Mission accomplished.\n\nKubrick's tendency toward darker character details isn't lost, thankfully. The film's best scene is one between Crassus and his servant, Antoninus (Tony Curtis), during which Crassus asks his servant about morality and his taste for \"oysters\". It's a thinly veiled attempt to paint the general as a nervously closeted homosexual, and it was reportedly cut from the original theatrical version of Spartacus-only resurrected for the DVD release years later. Besides being a brilliantly written scene, it also serves as the kind of seemingly inconsequential character detail that just makes you smile. Kubrick is having fun with his film's villain-showing that though he might be the richest man and baddest general around, he's afraid to be himself, even around a lowly slave.\n\nDouglas serves as a great hero. He's not quite working on the same level he did in Paths of Glory, his other Kubrick-directed film. The problem, of course, is that there's no such thing as subtlety in ancient Rome. Still, Douglas gives him a good dose of personality, which makes Spartacus an easy hero to root for. Among the film's stellar supporting cast, Peter Ustinov stands out as Batiatus, a sort of sniveling ass-kisser who just lurks in the background waiting to pounce where he sees potential for a quick buck.\n\nSpartacus isn't likely to find its way atop many Kubrick lovers' best lists-it certainly won't be on mine-but that shouldn't take away too much from one's enjoyment of the film itself. Despite being super long and a little too \"old-fashioned epic\" for my taste, there's enough greatness to make this mighty time investment worthwhile.\n\nhttp://www.johnlikesmovies.com/spartacus-review/",
            "review_date": "2016-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Hollywood Epic I have had forever on my To-Watch List & finally sat through it. It's an epic in every sense & despite exceeding 3 hours it's quite engaging.\n\nThe story of a Slave basically taking on Rome & the Roman Empire. The behind the scenes stories are just as epic as the film itself the notorious tension between Stanley Kubrick (Director) & Kirk Douglas is a legend in cinema.\n\nThe true success of the film lies in the spectacle & visuals such large images on the screen. It's an enduring classic & must see.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect film. Love every second of it!",
            "review_date": "2016-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the classic 1950s-1960s \"Swords and Sandals\" epics, Spartacus is a firm favourite for Bank Holiday viewings. It has a terrific cast headed by Kirk Douglas in a career defining role with strong support from Peter Ustinov, Charles Laughton, Lawrence Olivier, Jean Simmons and Tony Curtis. The script by Dalton Trumbo shines and, while it is not his best film, Stanley Kubrick directs the action well, showing early promise of his real genius. It is the the smaller, more intimate scenes where Kubrick really does well, such as the now infamous bath scene where Olivier and Curtis speak of culinary delights while meaning something very different. The larger battlefield scenes are well done but fairly standard for the era. Ustinov and Laughton really steal the show here and make Olivier look somewhat hammy compared to their own naturalistic delivery. Despite being 3 hours long, the pace is maintained well and the plot is interesting, keeping the viewer hooked. The story of the rebellious slave, Spartacus, who lead an army against the might of Rome is exciting and intriguing and the movie really does the tale justice. It of course contains the climactic scene where the defeated rebels all claim to be Spartacus and so seal their own fates. However, this point doesn't actually come quite as close to the end as I remembered from when I saw it as a child. At points, it may appear to be somewhat overly bright and gaudy to modern audiences with Rome being a touch too shiny and the  Kensington Gore rather too vivid but Spartacus remains a great movie from a bygone era of cinematic art.",
            "review_date": "2016-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Kirk Douglas and Stanley Kubrick pairing, this telling of the 3rd Servile War of Ancient Rome led by Spartacus.  This was an early historical project that elevated Kubrick to master film-maker status in Hollywood.\n\nA little dated for today, but still highly moving and dramatic.  Particularly notable is the homo-erotic bath scene with Tony Curtis, censored in its day.  The final scene as Varinia passes Spartacus and shows him his son is particularly moving. This is nothing short of an epic.",
            "review_date": "2016-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent addition to Kubricks catalog, and sword and sandals alike. Great acting, great screenplay, and epic soundtrack",
            "review_date": "2016-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anyone who still holds to the lie that Stanley Kubrick was an unemotional director owes it to themselves to see Spartacus. Not only is it blessed with a truly great screenplay by the blacklisted Dalton Trumbo, finding in the slaves' uprising a cathartic metaphor, but Kubrick - hired at very short notice by producer-star Kirk Douglas - elicits superlative performances from his entire cast and a sublime score by Alex North. A movie that has improved with age.",
            "review_date": "2016-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A blockbuster of Stanley Kubrick, a young Kirk Douglas, which is already almost a century old, with a large decorated in battle, especially in the end, thanks to the dimensions of the field, and with many nominations oscar.",
            "review_date": "2015-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seen this again just recently. Superb:",
            "review_date": "2015-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Indeed a classic, Kirk Douglas best film and performance. Kubrick's first real hit, though his trademarks are hard to find in Spartacus.",
            "review_date": "2015-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's long, gloriously long and decadent in mostly historically accurate splendor, with amazing production design, laudable performances, and action that doesn't feel too anachronistic today.",
            "review_date": "2015-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With some action scenes and performances it serves to be a fine epic movie.",
            "review_date": "2015-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth watching.  Can't believe Stanley Kubrick was the replacement director.  Jean Simmons was really beautiful.",
            "review_date": "2015-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic in scale, maybe a bit to \"epic\". So it has some boring parts, but its mostly entertaining. Also more of a Kirk Douglas movie than a Kubrick.",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An historically accurate masterpiece by one of the medium's best directors.  It's a love story, a morality tale, and a war epic all in one without being cheesy or giving into clichÃ (C)s.  Great acting, great script, and of course great directing by Stanley Kubrick. One complaint, the movie fades to black too many times.  Other than that, if you love movies, I'd highly recommend this.",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Comparing the classical epics is hard, but adding the brilliance of Kubrick to one pushes Spartacus over the top in a big way.",
            "review_date": "2015-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "spartacus is basically stanley kubricks foray into the big blockbuster business and i can see why. this film has such an epic feel to it that many sword and sandal epics have tried after yet couldnt. spartacus has great characters, a timeless story, and powerful lessons that have been ripped off so many times afterwards. yes kubrick would go on to make movies better, movies far darker and more sophisticated but spartacus is still a worthy entry in the kubrick filmography and a great watch for anyone into classic films.",
            "review_date": "2015-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An underappreciated Kubrick effort. This is the epic that you just want to keep going and keep going and keep going. The entire cast is tremendous especially Kirk Douglas in his \"career role\".",
            "review_date": "2015-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though being a little dragged at some points, it is a true epic retelling of one of Rome's greatest figures. A portrait of effort, determination and loyalty that shall remain forever in the minds of history geeks.",
            "review_date": "2015-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sick film with an intermission in the middle for when ya bladder is busting. I love old films but they do drag them out for ages. I wanted to watch this after watching the TV show (which was amazing) I saw it ages ago but was too young and couldn't remember what happened apart from the sad ending. I liked how the TV show focused on the gladiators and slaves in this film I would be able to tell who is who when it came to the slave/gladiators there wasn't that character development. There wasn't even that much dialog to be honest. I enjoyed it but I think it's because I'm a big Spartacus fan. Love the idea of slave starting an revolution. Should happen soon in 2015.",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One wonders if this film would have been better if Anthony Mann stayed on as director rather than being replaced by Kubrick (by instigation of Kirk Douglas).  Of course, Mann might not have been able to withstand Douglas's behind-the-scenes control of the production either (although apparently he was fired for suggesting that Kirk was over-acting).  The acting may be generally fine (particularly Peter Ustinov, Charles Laughton, and Laurence Olivier) but the film is just too long and too dull - even the widescreen shots of massive armies (reminiscent of Birth of a Nation) .  The Senate intrigues providing a political backstory to the film are not without interest (as scripted by previously black-listed screenwriter Dalton Trumbo) but everything just seems so distended as the army of escaped slaves (and gladiators) trudges slowly from one side of Italy to the other with points of interest few and far between.  I'm not sure I can really see Kubrick's hand at work.",
            "review_date": "2014-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bowing to the demands of a big budget and a Hollywood studio, Stanley Kubrick delivers that rarity for him - a decent film.",
            "review_date": "2014-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "***Due to the recent RT changes that have basically ruined my past reviews, I am mostly only giving a rating rather than a full review.***",
            "review_date": "2014-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good super long movie starring Kirk Douglas.",
            "review_date": "2014-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(85%) One of Kubrick's non-surreal historic classics which has become the cornerstone of all ancient Roman based epics. And it really is an epic at just over three hours long, but its length does suit the subject matter so it's not really a big issue. Kirk Douglas fits the role of a true hero very well, and the strong supporting cast who actually get a good majority of the screen time add a large layer of clout to the production thanks to the ability of Laurence Olivier, Jean Simmons, Tony Curtis and Peter Ustinov just to name a few, as well as a very well written, richly constructed script. The pacing at times is a little too sluggish though for what is a pretty simple overall plot, but if there's a movie worth putting in the effort in to watch from beginning to end and really focus on, then this is it.",
            "review_date": "2014-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably way too gung hoe on the whole \"WE HAVE SO MUCH MONEY LET'S MAKE IT TEN HOURS LONG AND HIRE TEN MILLION PEOPLE\" thing from this Era but who gives a crap this story is emotional gold.",
            "review_date": "2014-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I simply don't understand the appeal of this film. Epics were a dime a dozen during this era and, for the most part, I can respect what was accomplished, although hearing and watching Shakespearean actors portray foreign roles is immensely annoying.  However, \"Spartacus\" is in a class by itself.  Kirk Douglas is too American, too old and too wrong for this part in every way. Sir Laurence Olivier and Peter Ustinov save it from being a complete disaster, but attributing this snoozefest to Stanley Kubrick is just a shame.  The gladiator training scenes were boring and poorly choreographed.  The big battle scene is too long and anti-climactic.  Compared to \"Ben-Hur,\" released the year prior, \"Spartacus\" is a bore. I never care about Spartacus' hatred toward slavery. I never quite see the transformation from slave to revolutionary.  It just happens.  As a result, character development is mixed and, in some cases, completely lost.",
            "review_date": "2014-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kubrick's first epic and possibly his most straight-forward film still holds up today with it's excellent cast and high production values! Kirk Douglas leads a slave revolt against the evil Romans and commands the screen with his charisma and stature. The battle scenes are staged immaculately (especially for 1960) and it is damn impressive that the final battle contained 8,500 extras performing dangerous stunts! The story is fairly common with one man vs. a system, but the grand scope and length of the film flesh out the characters well, and you too would join in the famous scene yelling, \"I'M SPARTACUS!\"",
            "review_date": "2014-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you want to see 3 hours of Jews sweating, this movie is for you.",
            "review_date": "2014-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "76%\nSaw this on 23/8/2014\nI prefer the 2004 film of the same name and the TV series over this Kubrick version. Unlike the other Kubrick films, it didn't bore me out. It has good dialogues, performances( especially from the actor playing Batiatus) and some good cinematography. What I really didn't like is the way it actually ended and the way lack of seriousness in the portrayal of it's central hero. The battle strategies of Spartacus and his combat skills are not properly exhibited. The battle scenes are too short and they seem to have a lack of coordination since it's all just a few men running here and there. I expected a lot more in combat from this film. Spartacus could have been more glorified, even with the 3 hours + running time, it doesn't provide much of a character development to any characters, even the lead. Kubrick must be appreciated for carrying out such a great idea in the form of a film during such a time. This cannot be compared to films like Brave Heart and other films of the genre.",
            "review_date": "2014-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though not as brilliant as Lawrence of Arabia (but then again, what is?), this is still an iImpressive epic, majestically filmed, with gorgeous sets. And a fantastic cast: Ustinov is hilarious in this, Laughton is always a joy to watch and Olivier is doing his Olivier thing. It's just a shame Kirk Douglas knows only two expressions: Kirk angry, Kirk happy.",
            "review_date": "2014-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Round 3 with Stanley Kubrick, for me, and it seems that my initial judgment on Kubrick might have been initially wrong, considering my extreme hatred for 2001. Though Kubrick did not have 100% control on Spartacus (he was asked to direct after its initial director backed down from the project), it still remains one of the finest epics, not only from its era, but of all-time.\n\nKirk Douglas plays Spartacus, a rebellious slave trained to fight as a gladiator. When his female companion Varinia (Jean Simmons) is sold to corrupt Roman senator Marcus Licinius Crassus (Laurence Olivier), Spartacus and 78 other gladiators start a revolt, which eventually spreads to hundreds, including Varinia and Crassus' servant Antoninus (Tony Curtis). As Spartacus leads the fight for freedom, the political struggle for balance in Rome tightens up between Crassus and a veteran politician called Gracchus (Charles Laughton).\n\nThough Kubrick did not have complete control on the film (much of it benefits from producer Kirk Douglas, who wanted to collaborate with Kubrick again after the success of Paths of Glory), we still get some very unique camera shots that feels like your traditional Kubrick film with 100% creative control. The revolutionary angles from Paths of Glory makes its way into this, and only Kubrick can pull off a shot where a gladiator throws a spear at Laurence Oliver that also aims at the camera. Kubrick may just as well be one of the few directors I know that can take a crucifixion scene that doesn't involve Jesus and make it just as haunting and a battle scene where the audience gets a birds-eye view of each army a stunning spectacle of epic proportions. It's Oscar win for Best Cinematography was a smart choice.\n\nAs far as story goes, Kubrick does a great job at making the historical aspect as authentic as possible, which includes getting around the Hay's Code in a few scenes (mainly some of the sexual scenes where Jean Simmons in the nude and a crucial scene with Tony Curtis and Olivier in a bathtub that was cut from the rereleases but eventually restored). The action is about as grand as your typical epic and the political subplots are engaging. And in every scene he's in, Kirk Douglas nails his role as Spartacus, to the point where you're wondering why he wasn't Oscar-nominated. Whether it's the raw grit he shows in his fight for freedom or his powerful chemistry with Jean Simmons, along with Paths of Glory, Douglas it at one of his career best. \n\nThe rest of the acting impresses as well, though Tony Curtis is a little too wooden in his part (his accent doesn't really help in a picture as Spartacus). As said earlier, the dynamic between Kirk Douglas and Jean Simmons really sine, particularly the emotional final scene. Peter Ustinov, who won an Oscar for his supporting role as Lentulus Batiatus, owner of the gladiator school, does fine in the role, but nothing Oscar-worthy in my book (KIRK DOUGLAS SHOULD HAVE WON, FOR CRYING OUT LOUD!!!). The dynamic between acting legends Laurence Olivier and Charles Laughton is absolutely fantastic, especially in the intense political scenes. Especially Olivier, who makes an intense and awesome villain.\n\nAlex North (best known as the composer that initially scored music for 2001 but was cut by Kubrick behind his back in favor of classical music) scores Spartacus, and it's awesome. North's extensive research of Roman instruments paid off, and it's authentic and one of the more unique scores of the 1960's.\n\nKubrick may have disowned the film later in his life (only because he didn't have complete control of the picture) and the controversial aspects have long vanished compared to Kubrick's other films (only huge controversy involved the reveal of a blacklisted screenwriter; JFK famously crossed picket lines to see the film in theaters), but Spartacus is another strong epic from its time. Released the same year as revolutionary thriller Psycho, the onscreen violence changes the way violence was portrayed in cinema forever (and was an inspiration to later epics including Gladiator), and it still entertains in today's time. Kirk Douglas' powerhouse performance is dynamite, and it's unique cinematography and score rocks. It seems that I'm able to appreciate Kubrick as a filmmaker more after enjoying two out of three films of his. Hopefully the streak will continue to the end.\n\n\"I am Spartacus.\"",
            "review_date": "2014-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Spartacus\" is one of the the better sword and sandle epics, but most of it is a snooze fest. Like the boot camp sequence Kubrick's better film, \"Full Metal Jacket,\" this movie peaks during the gladiator training sequence. The battle toward the end is classic Kubrick. Kirk Douglas hired Kubrick to be the director of the film he was leading/producing because he thought the 31-year-old director would be a pushover, and not enough of Kubrick's style comes across here, to the detriment of the entire film.",
            "review_date": "2014-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My least favorite Stanley Kubrick film (apparently even Kubrick himself didn't like it). It doesn't even come close to revealing Kubrick's full potential as a director like his latter films would, but it's still worth watching, especially if you love the old epic films such as Ben-Hur and Lawrence of Arabia. If you're not familiar with the acting chops of Lawrence Olivier, then that's another reason to watch this film, because he is brilliant in it.",
            "review_date": "2014-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though Kubrick is credited as director, the denial of full creative control is visible, so the film doesn't have that much of the Kubrick touch like any of his other films. Still, it has a grand scale and scope, music score and characters that make Spartacus a powerful entertaining film.",
            "review_date": "2014-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the set up and overall first act was superbly done, the second half proved to be surprisingly flat.",
            "review_date": "2014-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IT MAY BE FLAWED IN PRODUCTION DESIGN. BUT IS FLAWLESS WHEN IT COMES TO ACTING AND ACTION. A TRUE MASTERPIECE!",
            "review_date": "2014-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember seeing this movie as a kid and it's just as great today as it was then.",
            "review_date": "2014-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I simply don't understand the appeal of this film. Epics were a dime a dozen during this era and, for the most part, I can respect what was accomplished, although hearing and watching Shakespearean actors portray foreign roles is immensely annoying.  However, \"Spartacus\" is in a class by itself.  Kirk Douglas is too American, too old and too wrong for this part in every way. Sir Laurence Olivier and Peter Ustinov save it from being a complete disaster, but attributing this snoozefest to Stanley Kubrick is just a shame.  The gladiator training scenes were boring and poorly choreographed.  The big battle scene is too long and anti-climactic.  Compared to \"Ben-Hur,\" released the year prior, \"Spartacus\" is a bore. I never care about Spartacus' hatred toward slavery. I never quite see the transformation from slave to revolutionary.  It just happens.  As a result, character development is mixed and, in some cases, completely lost.",
            "review_date": "2014-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only real problem is its duration. That's all I can complain about. Possibly Kubrick's weakest film aside from Fear and Desire.",
            "review_date": "2014-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was based on an historical novel based on the life of Spartacus.  Historical novels are fictionalized accounts of historical events.  We don't know all that much about Spartacus except what the Romans wrote about him.  The Romans always made the enemies they defeated seem superhuman to build up the reputation of the Roman Army.  The movie played fast and lose with the real history.  The script was written by a known Communist who had been blacklisted in the 1950's.  Kirk Douglas hired him to write this movie because he knew he was a good writer.  The theme of the movie was anti-slavery.  The United States was in the middle of the Civil Rights struggle when this movie was made.  The irony is that in 1960 the real slavery was Communism.  When the real Spartacus rebelled against the Roman Republic he was a gladiator and recruited a huge army of escaped slaves.  The Romans got their slaves from either prisoners of war or from people sold into slavery to pay off debts.  Although the movie was about escaped gladiators there was not a single gladiator helmet in the entire movie.  I guess they didn't want to hide Kirk Douglas's dimpled chin.  He also had a 1960's crew cut with plenty of Brill-Crème.  I didn't know the Roman's had Brill-Crème.  They say in some of the battle scenes the Roman Soldiers wore tennis shoes.  The real Spartacus was killed in the final battle.  In the movie they had him crucified.  Crucifixion was not originally a Roman form of execution.  They picked it up from the Carthaginians during Rome's war with Carthage.  The movie didn't show the real size of the Spartacus war.  Spartacus's army built a World War I style trench system across the toe of the Italian boot to keep the Romans out.  When Spartacus defeated the first Roman army sent against him, the Legion that ran was decimated.  The entire Legion had to draw lots and every tenth man was executed by the other nine men in his squad.  We don't know if the real Spartacus was fighting against slavery since every culture in ancient time had slaves.  The anti-slavery theme fit the modern politics of 1960.  During the Roman Republic and Empire a third of the population of Italy were slaves.  Spartacus's army came from many nations.  Their motive was probably more a continuation of their home countries war against Rome.  In the end Spartacus lost control of his army and the Germans split off and were defeated in a separate battle not shown in the movie.  Spartacus marched on Rome because his army insisted on it, not because he was trapped.  After the final battle the surviving prisoners were crucified along the Apian Way.  The Romans did this because the rebels had crucified some of the Roman prisoners and the Romans wanted to send a message to their slaves not to rebel.  From then on crucifixion became the standard form of execution for anyone who challenged the authority of Rome which led to the crucifixion of Christ.  I first saw this movie on ABC's Sunday Night Movie of the week.  They split it over two days but it was so good I made sure I saw the second half.  Of course the great quote from the movie is \"I am Spartacus\".",
            "review_date": "2014-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More of an epic than a character drama that we expect from Kubrick, not that the characters are bad, they are just generic, but likeable. The highlight for me was Olivier's performance.",
            "review_date": "2014-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this movie once in high school. I've had no interest in rewatching it.",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "epic in scale, its power and personal underpinnings outweigh its flaws.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of all the old school Hollywood Golden Age Roman Era epics, this one is probably my favorite of them (with Ben-Hur coming in closely behind) and one of my favorite films of all time.   While not particularly showered with complete and utter praise on original release (still contending with the wrath of the McCarthy Era whist having a script credit openly attributed to a blacklisted screenwriter and Anti-McCarthy subtext) it today is held up as an all time classic.  And has been particularly influential on many other films of the genre ever since.  Essentially being a father of sorts to films like the critically acclaimed modern favorites \"Braveheart\" and \"Gladiator\" for instance both taking a good deal of guidance from it.  It's one of the ultimate underdog stories, as slaves fight back to try and win their freedom.  Spartacus himself willing to die with his men and send his message to the world.  \n\nIt is often hailed as the \"Thinking Man's Epic\" given all of its serpentine political intrigue and close look into the Roman Senate with the displaly of Crassus/Julius Ceaser's rise to power and such.  With it also being notable at the time for being one of the first films of its kind not to be a Bible story or center heavily around Christianity. (Like say \"Ben-Hur\", \"The Ten Commandments\", and \"Quo Vadis\") Though there are two references to it (The opening narration talks about Christianity helping to bring down the empire, and it's no coincidence that are self-sacrifcing messianic hero dies via crucifixion) But whilst having something of a spiritual edge to it, it's not the forefront of the film.  (not that I have an issue with that at all, but it's interesting to see things get shaken up)",
            "review_date": "2014-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John F. Kennedy's favorite film of all time was Spartacus. I can understand this watching the film, but stripped of its luxurious art-direction, breath-taking cinematography, and original costume design; Spartacus is only a delightful sword and sandal epic. In reality, Spartacus was never a Kubrick film - he wasn't even the first director to work on it! However, it's truly extraordinary how Kirk Douglas got blacklisted screenwriter Dalton Trumbo to come-up with a script about a revolution against democracy. Peter Ustinov's Oscar-winning performance is the only one that was nominated, and it is fairly tame. Lawrence Olivier plays Crassus: an intimidating antagonist to Spartacus who the audience can easily dislike, but never hate. Kirk Douglas feels in a sense awkward in the role. He was cast since he was the producer, but frankly, there really should have been a greater actor to play-off of Olivier. The action sequences are exhilarating and the crucifixion of all the gladiators at the end has a deep impact on anyone who knows of Jesus Christ's suffering. Additionally, Spartacus was very unconventional for its times; the hero does not survive; the ending is a sad one; Julius Caesar is merely a secondary character at best; and the corruption of the democratic system is clearly shown. Spartacus may not seem as daring for our times, but I would recommend anyone who is interested in historical epics to take 3 hours and 16 minutes to see this film.",
            "review_date": "2014-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some classic movie stands the tide of times.  \"Sparcatus\" viewed today, seems out of date. Firstly it is too long and it drags at times. It's good enough to watch but once is enough. \nPs : I want the hairspray that Sparcatus was using. After years in prison and war, the hair style remained perfectly combed and in place.",
            "review_date": "2014-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a very stirring and courageous Roman epic",
            "review_date": "2014-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kubrick's unforgettable masterpiece that stands today as the source of all gladiator films, and one of the greatest holywood epics of all time.",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nHistory is a cruel and terrifying painting, there never seems to be a time where slaughter, tyranny, and slavery aren't a prominent role in the most significant times. There always seems to be a hero that tries to change society for the better, but up until now, changes have been made but madness and destruction still persists. I do not think there will ever be a time where harmony and love is the only thing that defines our world; there will always be pain and suffering in order to achieve the selfish dreams of individuals, or to create a wonderful story to be told, despite contemporary society claiming to move forward.\n\nSpartacus begins covering the difficult conditions in the past, where the lower class is abundant, present to serve the luxuries of the rich and powerful, with Spartacus and many others working at a salt mine. It is there we immediately feel pity for the slaves, working in such extreme heat and effort, and through an act of kindness by Spartacus, he is punished; establishing him as the hero of the film. Impressed by a slave dealer, he purchases Spartacus and trains him in his gladiator school, regaining his health and strength, and from there it begins his rise to freedom. It is during this first act, that relationships and character development are pushed, understanding the elements and events that propelled him in leading an army of slaves; here we see slaves at their worst, a product for the entertainment of the fortunate, simply present to die in their \"honour\". In disgust, the slaves eventually retaliate and end the metaphorical shackle that restrains them.\n\nBetween Spartacus' rise to freedom is the exploration of Roman politics, the corruption and deception that runs the veins in some members of the Senate; two members of the Senate are most important to the film's story, Gracchus and Crassus, both at conflict with one another due to different political views. Exploring their actions and agenda plays a significant role to the central story, but I personally felt it could have been more detailed and darker. Stanley Kubrick during its production, had very little to no creative control over the screenplay, and because of that the film lack a sense of balance in its characterisation; in all of Kubrick's other films, contains characters that are present to push the film's thematic concerns, ergo identifying their moral place, but all were treated with a sense of balance in their development, ensuring that not only they could act as a symbol but also grounded human beings that contains flaws. Gracchus, Crassus, Spartacus, and even Batiatus all seem to have a thematic purpose, but screenwriter Dalton Trumbo and Executive Producer, and star, Kirk Douglas prevents the film from being too grounded, ensuring that the story and its characters are larger than life. At the same time it is this relentless cushion on the Spartacus character that made him such an appealing character, it is a person incapable of corruption, acting as a symbol for the future, hoping his defying acts would act as inspiration for the end of human slavery.\n\nThe intention of Spartacus is to free the slaves, ensure that no more bloodshed will be faced by his brothers and sisters, but Crassus' egotistical drive for dictatorship has forced Spartacus and his people to confront the Roman army. It is a vision that demonstrates the scope of Kubrick's mind, proving that he too can deliver such spectacle if the material demands for it; if he entirely had the film his way, it would have probably been more ambitious, surpassing the iconic moments that he brought in his previous film, Paths of Glory. The film no doubt has the Hollywood stamp on it, and Kubrick did the best he can to make it his own; it is a stand-alone piece in his dark and intelligent body of work, but its isolation does not represent a sense of failure.\n\nAlex North's epic score captures its sword and sandal atmosphere perfectly, matching the film's wide scope through gravitated emotions and over-emphasising the film's themes. North's musical score rarely ever reach a sense of intimacy that is common in Kubrick's films, which is a bit of a bummer at times, but thankfully North does create a particular composition during intimate and romantic moments in the film, conjuring up emotions of sadness and affection.\n\nSpartacus, judging from the way it is being marketed, feels like a solo-effort, but experiencing it, one could easily see the brilliant performances that even surpass what Kirk Douglas brought to the role. This was meant to be a personal film for Douglas, a film that would prove to the world that he was deserving of the central role in Ben-Hur, but it is this large sense of ego that hurt his performance slightly; here is a story that requires multiple elements in reaching to its impacting conclusion, but Douglas seems so obsessed with himself that he must stand out from the overall cast, displaying moments that felt overly-forced into winning the audience's hearts. The performance isn't as painful as I seem to describe it, but like I said it sticks out like a thumb, at times hurting the overall film in the process. Laurence Olivier, whom back then I thought was a major flaw in this film, finally grew on me, delivering a performance filled with character depth that I want to explore. Olivier is not as showy here as compared to the Shakespearean films that I have seen him in, and through this subtlety, I was able to appreciate him more as an actor. The rest of the supporting cast were equally effective within their respective roles, and particular combinations work well together, notably Peter Ustinov and Charles Laughton; both helping one another to achieve their own selfish ambitions.\n\nSpartacus is one of the greatest epic films of all time, but it is far from being the director's greatest work. Despite its troubled production, the film manages to come together strongly with an interesting premise, strong performances, and breathtaking scope in both its music and visuals.",
            "review_date": "2014-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sweeping, visionary epic",
            "review_date": "2013-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I am Spartacus!\" \n\nAlluring and captivating, Kubrick's Spartacus, proves to be the finest Epic ever made.\n\nKeeping an audience entertained and enthralled for an hour and a half is not easy. With an exciting story, great filming, and an apparent all-star cast Spartacus never dwindles but keeps the viewer thoroughly invested in the Rebellion and movement that is literally Spartacus.",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyed this one. It was super long, of course, but Douglas was great. Really good movie.",
            "review_date": "2013-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true epic in every sense, Spartacus has some obvious flaws about, but in the whole grand scheme of things works exceptionally well. Particularly it's ending, which forgoes the tradition happy ending for a more thoughtful, impacting one.",
            "review_date": "2013-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's odd witnessing Kubrickean technique with the swords-and-sandals epic genre, but Spartacus is one graceful portrayal of leadership and defiance accompanied by the depth of Roman politics.",
            "review_date": "2013-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly, I have not seen this movie previously, even though it was recommended to me years ago by my father. The only huge hollywood epic i have seen was Ben-Hur, so i came into watching this movie with that might set, and I'm glad I did. This movie is so shocking with it's sexuality, and violence. Kubrick does a great job of not shying away from each controversial shot. I also love the acting from Douglas, Oliver, and Ustinov, who play their characters with passion.",
            "review_date": "2013-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kubrick is flawless in every aspect and Douglas owns his role as the legendary Spartacus. Classics like this just can't get any better.",
            "review_date": "2013-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie instantly reminds you of Mel Gibson's 'Apocalypse'. Reasons - Perfect r&d, set design, casting, costumes, picturization of ancient life and warfare etc. You find it hard to believe that such extensive movie was made in 1960! It is primarily based on a book 'Spartacus' by Howard Fast.\n\nSet in the 1st century BC, the film is about a slave named Spartacus, who is born in slavery, sold to be trained as a Gladiator (they were made to fight in twosome wherein one had to die), rebels against slavery, forms a group to facilitate departure of slaves to their home grounds as free men, is made to fight against the imperial Roman army, fights them again and again bravely, is ultimately crucified with hundreds of others, thereby condemning the age old system of slavery which ultimately got abolished 2000 years later.\n\nIt is needless to say that the direction as well as acting is simply superb. The movie is more of an edutainment since it covers in detail the hardships of ancient slavery system focusing more on how slaves (read gladiators) were kept and controlled rather than how they were captured. It is fascinating to witness the early teaching methods. There is a scene wherein the to-be-gladiators are taught wounding which body areas causes the following - death, impairing of limbs and slow death respectively. Today, we employ extensive lectures and audio-video lessons to teach anything similar and still cannot be sure of students grabbing the essence of the matter. But in the movie, the teacher simply used three colors - red (for death), blue (for impairing) and yellow (for slow death) to teach the same. In six swift strokes (two strokes for each color) wherein red was applied on a student's throat and heart region, blue was applied on one set of his limbs and yellow was applied on left and right sides of the front region of his upper torso, the important lesson was taught effectively!\n\nIt is a must watch movie for serious movie enthusiasts.",
            "review_date": "2013-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stanley Kubrick's Spartacus is, in many ways, a remarkable achievement. Centered on the slave rebellion that threatened Rome, Spartacus is a true swords-and-sandals epic. The performances, the script, the set design, the costumes, everything comes together to make a finely executed period piece.\n\nWhat makes Spartacus work the most is the exceptional cast, all of whom inject the film with an undeniable sense of life, charm, and even whit. Especially impressive was Laurence Olivier, whose nuanced portrayal gave us a sort of antagonist that was ahead of his time, complex in his machinations. He was matched well by Kirk Douglas, but also Charles Laughton, whose grounded presence and affable nature contrast against Olivier's dark intensity, making for an especially interesting dynamic.\n\nThe script is also intelligently written, penned by one of the famed Hollywood 10 (writers blacklisted during the McCarthy-era). It provides us with great dialogue, and fills the story with interesting characters. This is not to say there's no clichés to be found, I found the romance rather contrived (as was very common for this time period), but its overall tone and end note represent a notable departure from other films of that era.\n\nSpartacus has largely aged well. The action scenes are still impressive to today, and its world building more than rivals films of today, with an un-paralleled scope. The film's romantic elements are a bit dated, and the film does get dragged down from time to time in its own melodrama, but all-in-all, it more than holds its own to any epic of today.\n\n4/5 Stars",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This truly is an epic movie, and very similar to Ben-Hur. I think Kubrick, even at this time, was a great director, but his movies got better and better after this when he started managing the scripts.",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the less Kubrick-ish of the Stanley Kubrick films. The spectacular Spartacus lacks many of Kubrick's film methods; it barely has any of his traditional cinematography, but even so, that doesn't stop this movie from being one big spectacle from the classic era when epics came out like Pokémon games today. This film doesn't feel the necessity of having either a happy ending or a backstory for our main character; oddly enough, it does bother a lot often.\r\n\r\nFirst off, I felt this movie was more Kirk Douglas than Kubrick. Sure, he produced it and hired Kubrick to direct it, but I felt he wanted to use this to show himself-off, doing extremely amazing stuff and having literally no faults. It redeems itself a bit because of the sad ending, but the damage was done. I also thought the character Spartacus itself had not much development. We didn't know why he was who he was; we just had to assume \"He's that\". Well, he is anything BUT a character. My other problem where some politics scenes, most of them being boring. Sure it's part of the plot, but, it's still boring. With those problems out, this would have been a perfect epic. But the rest it's just in the expected high Kubrick quality level; my personal favorite scene was the battle with God knows how many extras playing three to four whole armies. Epic as hell.\r\n\r\nSpartacus is another Kubrick success and being a fan of epics, I enjoyed this, even with all its flaws. Not perfect, but still spectacular, Spartacus is an eternal cry for freedom even today.",
            "review_date": "2013-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing more than great a+++++++",
            "review_date": "2013-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "that was awesome .. the slave who fought for freedom died seeing his free wife with his free son .. the end can summarize this amazing film",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Freedom is worth dying for\n\nSpartacus is about a group of slaves rebelling for their freedom and ending up crushed, crucified and used as a political tool for a Roman senator to seize dictatorship. The main external plot, the slave rebellion, falls to a failure. The failure tries to convey the point of the story: that freedom is worth dying for, and the failure leaves us with a hint of hope for the future as a baby of a slave has been born free.\n\nThe external plot is pulled to a failure because of another external plot's rise: that of a Senator abusing the slaves cause to capture dictatorship powers. This adds another dimension to the futility of the slaves' cause: that all their lives added together is worth no more than a politician's expediency.\n\nThe external plot's hope at the end is given by an internal arc of another senator who turns moral and saves the newborn baby of the slave.\n\nThe main plot of the story is powerful mainly because it unexpectedly fails when you expect it to succeed: the hero is spared by a \"Negro\" fighter instead of winning as we expect, thus showing him the compassion that he would bring to his army of slaves in fighting for their freedom. The ultimate failure and crucifiction of all the slaves is also quite powerful in that you expect a journey like this to end positively (I didn't read the wikipedia article on Spartucus until afterwards).\n\nThe supporting plots that involve the power struggle in the Senate are also surprisingly engaging.\n\nThe story mainly falls flat on the arc (or lack thereof) of the main protagonist. Spartacus has no arc: he is a rebellious slave from beginning to end. Sure his rebellious nature gains greater purpose as he seeks to bring freedom to all the slaves, but that is established in Act 1 (the first hour). So for the next two Acts (the next two hours), the story's energy is sapped and stalled every second we spend watching Spartacus alone: building his army, getting a wife, building a bigger army, the slaves getting along harmoniusly, Spartacus and the slaves dancing in the sunset etc... These scenes are a complete waste of time since it doesn't come with any turning point on any plot. Maybe audiences in the 60s expect these filler moments to go to the bathroom during this 3 hour marathon, or maybe the female lead demanded Kubrick shoot her with fuzzy focus to make her look good and had a contractual limit on the amount of screentime she got, but it does no service to the story. With these scenes cut you can probably have a powerful film in a compact 90 minutes.\n\nTangential thoughts below...\n\nMy theory is since the story was produced by and starred Kirk Douglas, who brought Kubrick in after a disagreement with the previous director (see wikipedia), maybe the actor had too much say in the storytelling. So much so that the director and editor couldn't leave the boring bits on the cutting room floor. Or maybe the producers wouldn't let army marching scenes be cut since they paid so much money for so many extras to fill the screen. Reminds me of the big boring fight at the end of the first Pirates of the Caribbean that ruined a great movie: no way the producers would shorten those scenes after millions were already spent on the computer graphics. Maybe that's why the Pixar films are so great and tightly cut: its all computer graphics anyway and they all cost the same amount of money to render so cut away. So this leads me to think its a good thing for Director's to have final cut. But then again, a lot of these extended director's cut versions basically put a lot of boring filler back in. So I guess its only a good thing for \"good\" Director's to have final cut, and they should only be allowed to make one cut, not a short one and (guaranteed worse) long one.\n\nhttp://www.storycharts.ca/story/5898536285634560/5772779643207680/Film/Spartacus",
            "review_date": "2013-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic epic but a serious bore for the first hour. The music was so distracting. It over powered very moment. The dramatic acting scenes with no score are the best part of this picture. The epic scenes are great but the music killed them. After the first hour I was prepared to say that Ben-Hur is far far better than Sparacus, but after 3 hours I'll say Ben-Hur is only slightly better. Would have been five stars if not for the music.",
            "review_date": "2013-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I guess Stanley Kubrik was quite new on the scene when he made this as none of his excentricities are very evident yet however, what an epic ambitious project for him to undertake as a fairly young director. It's a very entertaining film. Quite long and does get a bit slow at times but generally the 3 hours is justified.",
            "review_date": "2013-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you choose to watch Spartacus, you better be in it for the long haul.  With a length of over 3 hours Spartacus manages to fill that enormous time slot with a thoughtful and sprawling adventure. It never really has any stand-out moments of brilliance, but it manages to remain consistently sophisticated and well acted, with a brief battle of enormous scale for its time.  Spartacus may have been better had it been filmed a few decades later, but the result is still an great effort that was ahead of its time in many ways.",
            "review_date": "2013-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dazzling and ambitious with epic action sequences, Spartacus ranks up there among the greatest Hollywood epics!",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heavily spirited classic. The only thing missing is Kubrick's full control.",
            "review_date": "2013-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The least Kubrick Kubrick film.",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't get why Stanley Kubrick puts on blank screens for more than 2 minutes long. Besides that this is a good battle movie with good performances, but not a classic in my opinion. It suffers from pacing issues due to the overlong running time and the movie is not all that memorable.",
            "review_date": "2013-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spoiler Alert: Some plot elements may be revealed\nReader Alert: Don't believe everything you read\n\nIn 1960, Stanley Kubrick released his colossal, towering, gargantuan, monumental, epic blockbuster SPARTACUS!!!! Okay, it isn't that spectacular, but it is a pretty dang good flick.\n\nSpartacus stars Kirk Douglas as an impudent Thracian slave. Thracians, as depicted in the film, were a race of people known for a particular physical characteristic - they had chin dimples the size of walnuts.\n\nBecause Spartacus is such an uppity wisenheimer, he is sentenced to a life as a gladiator. Not that it's all bad. He gets to work out a lot and is \"whipped\" into incredible physical shape. Also, he receives occasional visits from another slave who also happens to be a tasty dish named Varinia (played as a genteel aristocrat by Jean Simmons).\n\nDouglas does a fine job as the brooding gladiator. Other standouts include Charles Laughton as Gracchus; not to be confused with Crassus, a gourmet who likes both escargot and shellfish, played by Laurence Olivier. Peter Ustinov provides some Oscar-winning semi-comic relief as the sniveling sycophant Batiatus.\n\nAnother major character in the film is Antoninus, played by Tony Curtis. Tony (which is short for Antoninus) is a \"singer\" of \"songs\". His \"songs\" are just poems spoken in a Bronx accent.\n\nDuring the course of the movie, Spartacus escapes from gladiator school and assembles a considerable army of fellow undergraduates. Spartacus is well-loved by his men, and this is illustrated in one particularly moving scene.\n\nWhen the Romans capture Spartacus and his men, Crassus threatens to kill them all unless someone betrays their leader (who Crassus believes is a communist). Spartacus - in a heroic effort to spare his men - stands up to reveal himself, but Antoninus beats him to the punch. He jumps to his sandaled feet and yells out, \"I'm Spartacus.\"\nThis sets off a chain reaction. Another guy stands up and shouts, \"I'm Spartacus.\"\nAnd another, \"I'm Spartacus.\"\nAnother, \"I'm Spartacus.\"\nAnd so on.\n\nThe Romans were very frustrated by this, because now instead of one pesky Spartacus, they found that they had to deal with a whole slew of Spartaci.\n\nLegend has it that this event spawned an entire generation of scofflaws. Whenever a centurion confronted a non-Roman for some infraction - say a speeding chariot - the inevitable happened:\n\"Name?\"\n\"Spartacus.\"\n\"All right wise guy. Thirty days in the dungeon.\"\n\nAnyway, this is a very good film that I highly recommend. And, if I may, I'd like to close out this \"review\" with one of Antoninus' \"songs\":\n\n\"When the blazing wind hangs low in the western sky\nwhen the sun flies away to the mountain\nwhen the \"song\" of the crow scares the locusts from the fields\nand maidens sleep in the sea foam\nat last at twilight time...\"\n\nOr something like that.",
            "review_date": "2013-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i enjoyed it 'cause it's Kubrick, not because of the bath scene. grow up everyone!!",
            "review_date": "2013-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although not fully directed by Kubrick, this epic is soft on spots, but strong on points.",
            "review_date": "2013-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best swords and sandals films of all time.",
            "review_date": "2013-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the least Kubrickian Kubrick film I've seen, as the director often seems uncomfortable and uncharacteristically restrained throughout (For example, the early gladiator fights are well-staged, but the choreography suffers greatly in the big army battle sequence). It's not a damning fault; \"Spartacus\" merely lacks the directorial distinction and brilliance of Kubrick's other works.\n\nThis is classic Hollywood melodrama-- Douglas as the manly never-wavering hero, Jean Simmons as the swooning love interest, Laurence Oliver is the nasty villain. The most interesting character in the film is played by the Oscar-winning Peter Ustinov, who is both funnier and more complex than everyone else. The pacing is really slow and there's plenty that could be trimmed (particularly stuff in the last 45 minutes or so), but this is an emotional, rousing epic. The ending is a brave and somber affair.",
            "review_date": "2013-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't go looking for Kubrick here, for you'll find a Kirk Douglas production, where Stan was merely called upon at the last minute. But, despite Kubrick's open claims that this is no film of his, the latent style of the great director is still discernible; and mostly so, methinks, at the final battle scene. And in all its Kubrick-less-ness, it had indeed some clichéd, rather tiring moments, but overall it is a huge and very impressive production, with excellent performances -most notably Charles Laughton as Gracchus- and a very well-written and witty script. It is an epic, and one of the best of its kind.",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As an old-school Hollywood historical epic, the film works well, with plenty of fun action scenes, ambitious sets and a sweeping plot. Considered in the context of Kubrick's larger cannon, though, 'Spartacus' easily ranks as one of his weakest efforts, due in no small part to the well-documented studio and actor interference that lead Kubrick himself to (mostly) disown the film.",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long and often boring, Kubrick's sword-and-sandals biopic feels like a small picture painted on a large scale, though some scenes are thrilling and Douglas turns in a fine performance.",
            "review_date": "2013-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More than 50 years later Spartacus is still an impressive piece of story telling and entertainment despite is alienating running time.",
            "review_date": "2013-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as powerful as Kubrick usually is, due to Kirk Douglas' influence behind the screen, but still excellently made.",
            "review_date": "2013-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I good movie to take a nap in the middle of and then imitate \"I'm Spartacus\" for weeks at a time after. If someone were telling this story to me, it would start with me asking \"Oh? and then what happened?\" but as it progressed I would say \"Ya, but what happens after all of that?\" and then I would be saddened by no definite conclusion.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had to graciously push and shove my way to the end of this movie, constantly saying to myself \"yeah but it's Stanley Kubrick. You have to watch it\". At the end of the day, this is more of a respect rating than anything. It didn't give me a feel of how powerful of an uprising Spartacus truly brought to the table in history and the acting (even in the 60s) wasn't impressive to me. It's definitely not Kubricks best work, but still a decent movies for when it came out.",
            "review_date": "2013-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riveting! The music is exceptional which adds up to the passion of the film. Cinematography is great.",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic, gods work!",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Season three is finally here...... about dam time!",
            "review_date": "2013-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I used to think this was my favorite film, but...well I see more flaws than I remember in Spartacus.  Okay maybe just one flaw, but a significant one: Compared to other Stanley Kubrick films, which can get through a LOT in a limited time, Spartacus goes on for over three hours and tends to get a bit tedious.  Still excellent as a sword-and-sandal film, with a great story, great acting, great scenes, great pretty much everything.",
            "review_date": "2013-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only good film with Kubrick's name on it.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie when I was a kid.  Can't wait to watch it with my kids.  It is a great story, masterfully executed in a manner that stands the test of time.",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great classic By Stanley Kbrick",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This felt prolonged, with many flaws and boring at times...",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As always, Kubrick did a fabulous piece of work that passed the time and still a classic today.",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aside from his first few films, this is Kubrick's worst, but it's still pretty good if you don't mind the length. It gets a little melodramatic sometimes and Kubrick's style is not as prominent as it is in his other pictures, but as far as grand sweeping epics, this one is really good.",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably Kirk Douglas' finest proformance.  I true classic!",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK FINE BE THAT WAY INTERNET DONT MAKE ME WRITE A GREAT REVIEW! The movie is not as good as Ben Hur or like Lawrence of Arabia but it has some amazing landscapes and great battle scenes but some of the actors like John Gavin are disapointing. Its great because its Kubrick, whatever he makes is genius.\n\n92/100 A-",
            "review_date": "2012-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Classic Film Spartacus later learns that Varinia has been sold to Crassus, he leads 78 fellow gladiators in revolt. Word of the rebellion spreads like wildfire, and soon Spartacus' army numbers in the hundreds. Escaping to join his cause is Varinia, who has fallen in love with Spartacus, and another of Crassus' house slaves, the sensitive Antoninus (Tony Curtis). The revolt becomes the principal cog in the wheel of a political struggle",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "cool movie,if only filmmakers would stick to this plotline,,we would have less ring2 3 ect",
            "review_date": "2012-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without this, I wonder if we would have ever been given the gift of Gladiator.",
            "review_date": "2012-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may be the least Kubrick of all his films, but that's not a criticism, it's just an observation of what Douglas and Trumbo had for a vision and Kubrick just helped them realize it.  Trumbo was on the Blacklist of Hollywood after McCarthy's House on Un-American Activities, so Kirk Douglas hiring him and having his name on it instead of a pseudonym practically ended the blacklist period, and if Douglas never did another thing, he'd be remembered for that. The strength in this movie are the performances by people not named Kirk Douglas. It's no knock on him, but when you are acting across from Sir Laurence Olivier,  Charles Laughton, and Sir Peter Ustinov, it's hard to outshine them. What's most memorable for me, is just how funny Ustinov is as a character who we should despise, the Slave Trader Batiatus.  Yet we should remember, that Batiatus is the one who saves Spartacus from death, and is also the one who saves Varinia. It's also impressive just how risque this film was with the bisexual Crassus coming on to Tony Curtis' Antoninus. An impressive film for it's many parts, but somehow is missing some of the greatness that is associated with other Epics of the time. Still worth watching for the performances, but does show it's age in places.",
            "review_date": "2012-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacularly epic ,so potent ,Stanley Kubrick creates an astonishing motion picture featuring a spectacular performance by Kirk Douglas ,a true classic and unforgettable",
            "review_date": "2012-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this epic film starring Kirk Douglas and directed by Stanley Kubrick, a slave turned gladiator leads a revolt against the Roman empire. Spartacus leads his fellow plebeians in a sacking and burning of the countryside while slowly gaining followers. Along the way he is reunited with his love (Jean Simmons). However, soon all hope of triumph or escape is gone and Spartacus must face the Roman legions in one final battle. Utterly overwhelmed by the other forces, his followers are slaughtered and taken prisoner. With all hope gone he must kill his friend (Tony Curtis) and then face death himself by crucifixion. But all is not lost because his wife and child do get away allowing his legacy to remain. Overall this film is good but it does have flaws, one of them being the casting of Tony Curtis with his New York accent. Laurence Olivier, Charles Laughton, and Peter Ustinov all have important roles in this film as well.",
            "review_date": "2012-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Spartacus is well acted and beautifully staged, it's overly long running time and mediocre supporting characters make it more of a solid epic than a classic film.",
            "review_date": "2012-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film, but the STARZ tv show kicks ass!",
            "review_date": "2012-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kubrick did not have complete control over this, and the effects can be felt.",
            "review_date": "2012-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great epic film that combines everything that I love about movies,romance drama and great acting and performances by everyone in this film. Spartacus is well directed by the no other Legend Stanley Kubric. And cinematicley Spartacus looks beautiful and stunning for its time, espicially with the cinematic epic battle sequences. The only nitpick I have with the movie that it gets a little slow at some scenes and the movie is overlong and some parts of the movie could of been cut out, but that's just a nitpick because with out doubt I was immersed in the story and the characters.",
            "review_date": "2012-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "REBELLION-The first of the 9 favorite subjects of Stanley Kubrick, as told by the DVD booklet. \n\nPLOT:Spartacus (Kirk Douglas) is a Thracian slave that is bought by Lentulus Batiatus (Peter Ustinov) to teach to be a gladiator, but Spartacus is rebellious, and eventually starts a rebellion against Rome's slave opression with the other gladiators and takes a wife, a Brittanian slave named Varinia (Jean Simmons) and a friend named Antoninus (Tony Curtis). The slaves revolt against the corrupt Russian senator Marcus Licinius Crassus (Laurence Olivier). It is the classic story of Spartacus executed nearly perfect.\n\nACTING:The acting is truly brilliant. No one did a bad job! Douglas was perfect as Spartacus, Simmons does brilliant as Barinia, and Curtis does wonderful as Antoninus. Olivier and Ustinov also did a great job, considering this was Ustinov's Academy Award-winning role for Best Supporting Actor.\n\nSCORE:The score here is like a Babylonian John Williams. I loved it. Though I wouldn't call it beautiful or unque, it was still great.\n\nEFFECTS:The blood effects are purely spectacular for the time being. They weren't damn CG and they actually made it look like real blood instead of strawberry cough syrup shit.\n\nCAMERAWORK:Yes, the famous Kubrikian, angled camerawork is here for the best shots ever the grace the screen, as usual. \n\nOTHER CONTENT:Now, this film is purely brilliant, but it has a couple minor flaws that I could find. Firstly, I believe (as well as some other tight-fisted critics) that the plot execution is a bit uneven. It is very well executed, but you can tell that it's a little too freewilling and loose than it needs to be. Secondly, I wouldn't count this one as much of a flaw than a directorial characteristic, but I also believe this doesn't have the 100% true feeling of a Stanley Kubrick film. I mean, I can feel in some scenes more than others Kubrick's presence, but I can't feel it throughout as I could with his other films I've seen. But let's stop with the flaws for a minute and glorify any other good things about this film. The script is very well-written; so much that it is almost poetry than a script. Also, the movie's pretty accurate to the tale of Spartacus if I might say so based on what I learned in 7th grade. \n\nOVERALL,an awesome Kubrick film with a near-perfectly executed plot, brilliant acting, great score, realistic effects, Kubrickian camerawork, well-written script, and \"historically\" accurate, but the plot's execution, though near-perfect, is uneven and the presence of Kubrick in this film isn't as strong as in some of his other works.",
            "review_date": "2012-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I find this to still be a good movie today, so it must have been fantastic in 1960.",
            "review_date": "2012-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Douglas, Ustinov, Olivier, and Simmons...great acting...\"big theme movie\"...they don't make them like this anymore...must see",
            "review_date": "2012-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's fair to say that movies like Braveheart and Gladiator wouldn't exist without this flick.",
            "review_date": "2012-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus is the most impersonal film of  Kubrick. Does that make it bad? .. Of course not, because it is an epic, exciting, technically impressive and very well acted. This film gave him the teacher more liberty in future projects.",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true epic in every sense. Just like Braveheart, it isnt totally historically accurate but who cares. No one can say the scene wear all the slaves stand up as Spartacus doesnt bring a tear to their eye.",
            "review_date": "2012-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the classics. Great historic piece as well. Kirk Douglas' best movie in my mind.",
            "review_date": "2012-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the true swords-and-sandals classics. Ustinov shines, and even Douglas's chin is not distracting. And every time I see it I can't believe that Kubrick made it.",
            "review_date": "2012-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true epic classic without happy ending.",
            "review_date": "2012-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic...I love this move.",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably Stanley Kubrick's most conventional film, \"Spartacus\" lacks the intensity and creativity that usually characterize his work. His and star Kirk Douglas's earlier collaboration, \"Paths of Glory\" (1957), has these elements in abundance, so the fact that they are absent from \"Spartacus\" feels like a regression. Co-star Tony Curtis's accent is not quite as bad as reputation would have it, but his character is largely extraneous. Douglas gives an almost too understated performance as the reluctant rebel leader, while Charles Laughton and Laurence Olivier are compelling as classical patricians in their classical, patrician way. As if to mirror the reserved acting, Dalton Trumbo's script is thin, with little of the deep character analysis, historical insight, or contemporary commentary that writers like Gore Vidal brought to 1959's \"Ben-Hur.\" The production is effective enough, but its visuals and pacing are staid, conservative, and unchallenging. Most of the movie may as well have been made by an old-school sword-and-sandal auteur like Cecil B. DeMille rather than a New Hollywood experimentalist like Kubrick. The film's battlefield sequences, so stunningly executed in \"Paths of Glory,\" suffer the most from a failure to cut loose or try fresh approaches. They are ponderous, more so even than the rather obvious dialogue that takes place in the Senate chambers and baths.",
            "review_date": "2012-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kubrick still manages to push his blatantly atheist ideas and homosexual scenes in a movie he didn't even want to make, but regardless, and enjoyable \"epic\" flick with a dark turn at the end.",
            "review_date": "2012-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stanley's worst movie, however it is not entirely bad.",
            "review_date": "2012-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This swords and sandals epic might not be a testament to Stanley Kubrick's trademark storytelling methods as a filmmaker (the vision belongs to star/executive producer Kirk Douglas), but there's no denying that 'Spartacus' is a powerhouse of a production. Exceptionally well made with a memorable battle sequence, this riveting masterstroke showcases a slew of exceptional performances (including Peter Ustinov in an Oscar-winning role) who bring to life the emotional gravity of the script. The courtship and blossoming romance between Douglas' Spartacus and slave girl Varinia (the delicately stunning Jean Simmons) is quite touching, and provides the catalyst for the ensuing rebellion against the Roman Empire, whose obsession with power and overindulgence serves as one of the film's key messages, as does the spirit of camaraderie, which is best expressed in Draba's (Woody Strode) refusal to kill a fellow gladiator and the signature (and much parodied and referenced) \"I'm Spartacus!\" scene. But the film isn't without its flaws. So multilayered is this particular tale, that Tony Curtis' Antoninus, though vital to the plot, isn't given as much time to develop as others. Thankfully, a restoration in 1991 of the film allowed the inclusion of the previously-cut \"oysters and snails\" bath sequence involving himself and the brilliant Laurence Olivier, which not only fleshes out their characters (and adds to the power of Crassus' decision to seal Antoninus' fate in the final act) but provides some incredibly well-written dialogue (dubbed by Curtis and Olivier impersonator Anthony Hopkins after the original audio was lost). With solid support from Charles Laughton (as senator Gracchus) and the stunning, square-jawed John Gavin as a young Julius Caesar, this character-driven drama is a must-see.",
            "review_date": "2012-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly wonderful epic.",
            "review_date": "2012-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An early Stanley Kubrick masterpiece. Dispite doesn't present very much the style of the filmmaker. Fresh.",
            "review_date": "2012-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a massive sword and sandle 1960 epic, of course it's got enough corn for an office picnic. Who cares, it's got the greatest battle scene in film history. And, hey, Kubrick. Don't miss it.",
            "review_date": "2012-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Modern godfather of the unhappy ending.",
            "review_date": "2012-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really didn't like this one.  I had put it off for a long time, and it seems I was right.  I found it long and boring with a hammy performance from Kirk Douglas whom i normally like.  I didn't like any of the performances. even Olivier.  this one is dated, not the classic it is touted to be.  Skip it!",
            "review_date": "2012-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story of Spartacus has been told countless times, but what all other versions lack are Kirk Douglas' engaging performance in the title role and Stanley Kubrick's innovative direction.",
            "review_date": "2012-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2/19/01 - Seeing as how I like Braveheart and Gladiator so much, I thought I would rent Spartacus. Spartacus is based on a true story about a Roman slave/gladiator who starts a slave revolt to fight for freedom. You can definitely see where Braveheart and Gladiator both borrow a lot from Spartacus. The movie itself is good, though not as good as the two more recent ones. And there is a bit of 60's cheesiness thrown in, but not too much.",
            "review_date": "2012-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Spartacus\" isn't necessarily a Kubrick essential, seeing how it lacks many of his trademarks and signatures that are famous today, but it is still a fantastic sword-and-sandals epic made for a mainstream audience (even though its blacklisted screenwriter, Dalton Trumbo, caused many of the post-McCarthy period to discourage people from seeing the film.)\r\n\r\nClocking in at just over 3 hours, the film beautifully chronicles the rise and efforts of gladiator/slave Spartacus to bring the value of freedom and morality to a Rome full of spoiled politicians and aristocrats. However, the film does have some noteworthy layers of moralizing that elevate it beyond your average epic. \r\n\r\nThough the film ends on a rather bleak (and realistic) note, it delivers its messages of the importance of values such as dignity or honor, especially by concentrating its sights on two snobby members of the privileged Roman elite, Senator Gracchus and slave trader Batiatus, making two remarkable and rather unexpected character archs. All the while this serves as a great allegory on the actual state of the US during McCarthyism (the famous \"I'm Spartacus!\" scene) and offers plenty of religious symbolism with crucifixion and martyrdom.\r\n\r\nThe cinematography does its job even if it will occasionally seem a bit stifled, considering Kubrick shot most of this film in a studio. The music itself was very forgettable; I can't understand why North was given so much acclaim for his score. It's just standard \"epic\" noises being cranked out by an orchestra, and the only leitmotif that was moderately touching, the romance between Spartacus and his lover, is run to the ground. \r\n\r\nDespite these quirks \"Spartacus\" still emerges as an extraordinary 1960 epic film given to us by the master Stanley Kubrick. Since his identity as a rising great director was marked by the commercial success of this film, it's definitely worth watching even if you're not into 3-hour long epics.",
            "review_date": "2012-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may not be Kubrick's best, but it's definitely one his most audacious.",
            "review_date": "2012-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hated how long this was, but it was worth watching most def.",
            "review_date": "2012-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic that drawls on, but I still love it. 1001 movies to see before you die.\n\nWhat a cast!",
            "review_date": "2012-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My third and final attempt to love this movie. Spartacus and I will be causal acquaintances, but never friends.",
            "review_date": "2012-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stanley Kubrick's sword & sandal epic, Spartacus, is a film that should not be ignored as it holds an importance place in the director's catalog. This was not one of the films that introduced me to Kubrick's works and I came into this thinking it may surprise or immerse me that it would rise at the same level as my opinion on Kubrick's masterpieces. Sadly, it did not hit me with much force as I wanted it to.\n\nThe plot of Spartacus is the rise of Spartacus from the shackles of Rome's slavery. It is a story that I indeed enjoy but since the film, at times, drifts away from Spartacus (Kirk Douglas) and focuses on Crassus' (Laurence Olivier) goal for power and dictatorship of Rome, it took me out as that half doesn't hold up to the strength in Spartacus' story. It doesn't get to the point that the film becomes dull, so it is still tolerable. I felt Dalton Trumbo's script lacked interesting dialogue and sometimes doesn't create that sense of importance in what they are saying. I believe in a film like this, it is dialogue that should keep the audience invested, as it serves in supporting the plot and intentions of the characters on screen. The rivalry between Gracchus (Charles Laughton) and Crassus is very entertaining as it explores the paths of what Rome can become. It is the screenplay that holds most of the issues I have with this film and if it have been maybe revised or spent a little more time on it, this film would have been a masterpiece.\n\n2001: A Space Odyssey, A Clockwork Orange, The Shining, Eyes Wide Shut, Full Metal Jacket, Lolita and Barry Lyndon, are films of Kubrick that I felt were all daring as they have imposed either controversy, antagonizing characters, exploratory themes and risk for low financial gain. Spartacus on the other hand was something of an epic which had extremely high expectations and was easy to market to the public. This film in his catalog definitely seems like an oddball. I felt that Kubrick did not have that creative control in this production as compared to his other projects but he did the best he could with what he had. Kubrick understood the material enough to convey what is needed to tell this tale. He also knew that this film had to be big as the story's themes of hope and freedom had tremendous weight.\n\nAs I said, this film is large and to convey that, you need to have a cinematographer who can deliver. Russell Metty showed he could handle a project this big. Metty's photography showed the scale of film and, along with Alex North's score, carried significant weight. The battle scenes are example that shows just how big the production is. Metty did not only create beautiful and large long shots but also handled the intimate moments between characters delicately. Scenes with Spartacus and Varinia (Jean SImmons) are captured with such elegance that it is at par with Metty's large ambitious shots. Metty is an important aspect in making Spartacus an epic film that rivals classics like Lawrence of Arabia and Ben-Hur.\n\nThe film's length, 3 hours and 17 minutes, is a stretch and some scenes could have been a bit trimmed. I felt that the pacing was a little on the slow side for me and with the issues of the film's script, it made it a bit more of a chore. To me, the length of a film is not the issue but rather the content within that length is what determines the necessity of longer running time. If the film explored a little more with the Senate and make it very entertaining and smartly executed then I would satisfied with the running time, maybe even longer.\n\nThe score of the film is conducted and composed by Alex North, who I recall also did the score for Cleopatra. North's score definitely has a presence in the film and screams out to be noticed but it isn't the grand moments like the battles that gets me listening but rather the intricate moments between Spartacus and Varinia that shows off a memorable tune that creates the element of romance between the two. His score definitely goes hand in hand with Russell Metty's photography and delivers something that will be remembered in the long run.\n\nFor a character to become believable, the actor must be deeply attached and understand the role that they are embodying. Kirk Douglas definitely shows that here and is one of the big reasons that makes Spartacus' cause all the more believable. While Douglas is the strongest aspect of this cast, it is not without the help of fantastic supporting actors like Charles Laughton, Jean Simmons, Peter Ustinov and Tony Curtis. They really connected with their characters and brought their A-game to the film. The downside of the cast is sadly, Laurence Olivier. Olivier brought as much as he could with the character Crassus but the character is written so thinly that it Olivier couldn't show off his abilities. There is one seen which I thought explored the character Crassus for a bit, and that was the restored scene of him in the bath being washed by Antonius (Tony Curtis).\n\nThe film has it's weak point but it doesn't place the film as the weakest of Kubrick's films or even within that decade or genre as it is solidified it's classic status with it's iconic score and photography, strong story, and a powerful cast.",
            "review_date": "2012-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stanley Kubrick does a good job with this epic feature. Almost remade as Gladiator, but it's a little different.",
            "review_date": "2012-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of meandering storylines, including romance, friendships and politics, are given rather short thrift as the slave revolt tries to gather steam.  The balance isn't there in the script to satisfy anyone,  Perhaps the only way to do this story right is with two separate movies?  Otherwise, too clean and sanitized...but par for the era.",
            "review_date": "2012-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this one leaves u rootin' 4 the underdog!",
            "review_date": "2012-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, so slave girls probably didn't look like Jean Simmons stepping out of a beauty salon, but this remains an incredible film. Triumphant and tragic, hopeful and cautionary. If you don't get teary eyed when Simmons shows the crucified Spartacus his son at the end, you may not be human.",
            "review_date": "2012-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No where near Gladiator but still great movie",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kubrick's lavishly produced swords-and-sandals epic \"Spartacus\", about a slave revolt in ancient Rome, was born partly out of executive producer and star Kirk Douglas' embitterment at not being cast as the title character in William Wyler's lavishly produced swords-and-sandals epic \"Ben-Hur\". Douglas' film is not quite equal to Wyler's, although it does flirt with greatness at moments. Highlights include Spartacus' first gladiatorial combat and subsequent break-out, the signature \"I am Spartacus!\" scene, and the moving finale. While boasting expensive sets, costumes, and sweeping dramatic photography (shot mostly by Kubrick himself, although Russell Metty gladly collected the Oscar), the script's intellectual aim-taking lacks focus, clearly the byproduct of conflicting artistic intentions and political philosophies from Douglas, Kubrick, and blacklisted writer Dalton Trumbo. The pace is a tad uneven as well, mired by an arduous second act that indulges in too much political wheelings and dealings. Still, it's hard not to be impressed by the grand scale of the production, and when concentrating on Spartacus' story, it's compelling stuff.",
            "review_date": "2012-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who needs 2001, The Shining, Full Metal Jacket, or even Eyes Open Shut when you got a really fantastic epic that was actually well-written?",
            "review_date": "2012-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this historical drama epic is one epic historical drama. Again, Stanley Kubrick amazes me. The setting and costumes in this film makes it seem like the events are actually happening just before your eyes. The acting is astounding. The film is so incredible that i cried, and the fact that the film runs for so long is enough time for you to hear the whole story without getting bored. Definetly one of the greatest films i have ever seen, and thats the 3rd Stanley Kubrick film to land that list.",
            "review_date": "2012-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen this a long time ago, but it was a great movie to watch again.  Great film!!",
            "review_date": "2012-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kirk Duglass classic",
            "review_date": "2012-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stanley kubrick was able to tackle just about any genre, and that rings true with his film \"spartacus\". it's quite long, but never dull, always entertaining, action packed and isn't at all moronic, like many other battle period pieces.",
            "review_date": "2012-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus is a good film by today's standards, perhaps if I was alive to see it in 1960 I would have loved it. It achieves an adventurous atmosphere through it's scenery and parallel music, and Douglas is every bit convincing as Spartacus. Despite it's massive running time, it doesn't get boring but there are certainly superfluous moments. My main concern with Spartacus is the lack of the suspense, it's an epic movie but aside from the battle sequences, nothing else feels epic. Maybe because I'm so in-tuned to the films of high standard to technicalities set by modern films I couldn't appreciate the 50 year old craftsmanship of Spartacus.",
            "review_date": "2012-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film definitely worthy of a watch. Its end is tragic but its story is grand. The story of the slaves uniting against the enslaver is always a joy to see play out. That and the surprisingly well choreographed fight scenes with some remarkable special effects make it a must see. What else can be said other than \"I AM SPARTACUS\".",
            "review_date": "2012-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus is like most Kirk Douglas vanity projects, only this time, it's longer, more overwrought, and wholly self-righteous. Douglas didn't get the lead in Ben-Hur, he pouted, and bought the film rights to Howard Fast's novel himself so he can be in an epic too. What a petulant child -- excuse me, what a petulant child, who's a horrible actor. The only redeeming quality is the strong supporting cast (Olivier, Ustinov, and Laughton, most notably). Kubrick's imprint is nowhere to be found, and really, can you blame him for wanting to distance himself from this film? If I wanted to watch a bloated lead character performance with broadly-drawn altruism and inane inspirational speeches, I'd go to a community theater production.",
            "review_date": "2012-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is surprising that hardly anyone realizes that this is a Kubrick film. It does have his style, it is just hard to pick up because the film was very much like the epics released at the time (I.E. El Cid, Ben-Hur, The Ten Commandments).",
            "review_date": "2012-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Great movie star studded cast",
            "review_date": "2012-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What \"Titanic\" wanted to be, but couldn't.  I don't care who one the most awards...we all know who's better.",
            "review_date": "2012-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Man The Myth The Thracian!!!!!!!!!!!!!",
            "review_date": "2012-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great performance by Kirk Douglas in this sandal classic which is, however, not as perfect as other Kubrick productions.",
            "review_date": "2012-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first thing that stood out to me when I watched Spartacus was 'man Kirk Douglas looks like Marv from Sin City.' And for the time this film was made, he was equally as bad-ass. This movie was really intense and violent for it's age and has obvious influence on many modern favorites (ie. Gladiator). If it wasn't for a forced and somewhat unbelievable romance, between Douglas and Simmons than this might have been close to 5 stars. The one other thing I wasn't fond of was the score of this film, which (maybe it was the low quality sound on the dvd) wasn't pleasing at all. The battle scenes and the intensity that Douglas attacks the screen with mostly over-shadowed that though, and the story was compelling (if not very much historically inaccurate). I was a little disappointed by the very ordinary cinematography from Kubrick, but nothing is perfect, I suppose.",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's overlong but it's a thrill.  Kirk Douglas, again teaming with Stanley Kubrick following Paths of Glory, delievers a solid performance as the hero-slave Spartacus.  This film flies in two respects - the sheer spectacle, and the nuances Kubrick injects into the quiet scenes.  It is a film that rewards repeat viewing.  Not many can say that.",
            "review_date": "2012-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a classic but as Hollywood is always prone to do they totally miss the mark on accuracy. But still a good movie to pass the time when nothing else is on.",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To my young mind Spartacus was a revolutionary as important as Che Guevara and a fighter more brilliant than General Patton.",
            "review_date": "2012-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performances are legendary and the scope vast. Has different strengths and weaknesses to that other great Roman epic Ben Hur, but is no less impressive overall.",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Up there with Ben Hur",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it when they each stood up and said \"No, I'm Spartacus\" in support of him. He earned their respect. This was a good movie for those times.",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very sweeping and dazzling epic with great acting moments, dazzling cinematography, and a great director in training.  I feel like Braveheart is an echo of this film as it plays almost entirely the same way.  Maybe Mel Gibson had this movie in mind, or maybe Randal Wallace did.  Either way, it doesn't really matter.  As with a lot of films, I felt it was a bit too long and some scenes felt a little extraneous and unneccesary, like the relationship berween Antoninus and Crassus.  Not because of the gay thing, it just didn't really seem to add much to the overall plot of the thing and never really got a payoff, so I felt like it could've been taken out quite easily.",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "for the first and ever time kubrick has a hero to talk about.",
            "review_date": "2012-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely loved it! One of the better epic films Ive ever seen. The direction is fantastic. Darker than the other epic films of it's era.",
            "review_date": "2012-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Kubrick Master-Piece...",
            "review_date": "2012-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this in a history class. My only interest was in the \"I'm Spartacus\" scene. It was disappointing.",
            "review_date": "2012-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sound design is a little dodgy in certain places but other than that I really enjoyed Spartacus, the original gladiator.",
            "review_date": "2012-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only film that Kubrick didn't have control of, this sumptuous and forever influential sword-and-sandal epic balances quite well its campy moments with scenes of dramatic intensity but also has a messy script full of moralizing and confusing behavior from most of its characters.",
            "review_date": "2012-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, decent plot and even a good love story and a nice ending too when Spartacus got to see his kid!",
            "review_date": "2012-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half is great but the movie stumbles in the second hald. Though on of the least Kubrick-style films, it's still a solid film.\n\nGrade: A-",
            "review_date": "2012-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seeing it once is more than enough....but it's nothing special.",
            "review_date": "2012-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it has the conventional feel of Hollywood blockbusters from the early part of that decade, Spartacus is a sweeping epic about freedom & is widely considered a classic. Lots of action, social satire & a powerful ending.",
            "review_date": "2012-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film isn't without its weak points, however. Tony Curtis as Antoninus and John Dall as Glaborus take the viewer out of the world of the film with their unapologetically modern dialects. In the end, though, these are minor quibbles within a major cinematic achievement. Easily one of the 100 greatest films ever made.",
            "review_date": "2012-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sometimes a boring movie but overall a pretty damn good movie kirk douglas is a badass",
            "review_date": "2012-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kirk Douglas brings dignity, compassion, and humanity to the title role of Stanley Kubrick's epic historical fiction. Sold into gladiatorial slavery, Spartacus eventually begins an uprising that swells to thousands of rebellious slaves. Licinius Crassus (Sir Laurence Oliver) is a corrupt Roman politician who wants to exploit the rebellion in order seize absolute power of the republic in the name of \"order\". Although a lot to sit through, the three-plus hours of this classic movie contain homeric proportions of action as well as moving performances from the Douglas, Oliver, Tony Curtis, and Jean Simmons.",
            "review_date": "2012-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not a must see for fans of Kubrick  at all, as it resembles nothing of his visual style or concept choice. Spartacus is well pasted but often enough boring.",
            "review_date": "2012-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly epic story, wonderfully acted with convincing action without having to rely on the stylized action of other, more modern renditions.",
            "review_date": "2012-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like in 'Paths of Glory' and 'The Killing' before it, there's no happy ending in Spartacus either. I wonder how the film would have turned out if Kubrick had been involved right from the beginning and allowed to adjust the script.",
            "review_date": "2012-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little more predictable than you'd think since it wields \"gladiator\" around so mightily. Despite everything, however, the depth of man, the superb camaraderie speak higher than Kubrick's penchant for total technical control.",
            "review_date": "2012-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many have the tendency to dislike the film because it was basically stolen away from Kubrick, and is not considered a true Kubrick film but give it a chance. You'll be presently surprised.",
            "review_date": "2012-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kirk Douglas is magnificent (as is Ustinov and Olivier) in Kubrick's sword and sandals epic...",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic film with cool violence for an old movie. Loved the ending. The acting is off doh and its kinda hard to appreciate when you have movies like Gladiator.",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was really well done, with great epic visuals and unbelievable use of colors and camera placement. Glimpses of battle carnage that later became staples in more modern epics of the same genre, all in all this is perhaps Kirk Douglas greatest role as he plays Spartacus with humanity. A normal man caught up in an insane society of economic oppression and institutionalized slavery and barbarity.",
            "review_date": "2012-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long, but amazingly accurate and interesting.  It shows the social and emotional struggles involved in social rebellion, along with excellent gladiatorial combat and military action against the might of Rome.  I'm Spartacus!",
            "review_date": "2012-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It might sound blasphemous, but this is my favorite Kubrick movie",
            "review_date": "2012-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Spartacus\" is director Stanley Kubrick's venture into the sword-and-sandals genre that features great performances from Kirk Douglas, Laurence Olvier and Peter Ustinov. It has great production values with outstanding art direction and cinematography. However, some scenes could have been trimmed from its long running time. I would still prefer \"Gladiator\" over this movie if I had a choice.",
            "review_date": "2012-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably perfect movie. Shot on 65mm gave stunning picture. Great light and colors... Perfectly enjoyable 3-hours even in 2012 :)",
            "review_date": "2012-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic and entertaining, yes, but one of Kubrick's weakest efforts. It just doesn't seem to transcend its era in movie making history. Spartacus is merely a better member amongst its generational pack, but nothing by which to influence later movies",
            "review_date": "2012-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i prefer the TV series :)",
            "review_date": "2012-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "actually sat down and watched it all the way through and its completely remarkable and a classic",
            "review_date": "2012-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THE premiere sword and sandals epic, Spartacus features incredible action, captivating preformances,and fantastic directing from Stanley Kubrick.",
            "review_date": "2012-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't expect anyone from this new generation to like this film at all. It's certainly too good for them. Perhaps I'm arrogant, or ignorant, or both. One thing particularly interesting about this film is its lighting, which seems to be oddly natural. Probably Kubrick's doing.",
            "review_date": "2012-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent acting, great storytelling, a good inclusion of politics and great speeches, and a near-pefect ending. This is definitely going on my list of all-time favorite movies.",
            "review_date": "2012-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only special effect being that you can believe it - save for the lack of sweat among the militarily superior and morally inferior Romans",
            "review_date": "2012-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very long, but interesting.",
            "review_date": "2011-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very long, but interesting.",
            "review_date": "2011-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film that set Kubrick on the path of ensuring total creative control over his future films. He didn't like Kirk Douglas butting in as the producer and who can blame either of them? Kubrick had his vision and Douglas was producing the movie and owned the production company.\n\nIt has some delightful Americana mixed into the story of a slave rising up against the government that condoned slavery. It also displays a corrupt republican government giving way to a tyrannical dictatorship. Interestingly enough the screenwriter was someone who was blacklisted during the insanity of the McCarthy Red scare. I am sure the story of the end of republicanism in this film has something to do with the corruption and terror the members of congress fell to during the 1950s.\n\nThis is a classic sword and sandal movie and is quite enjoyable. All the main actors do a good job and the story is compelling. Who doesn't want to hear a story about standing up against tyranny and slavery and having the guts to die free?\n\nLaurence Olivier, as Crassus, also has a delightful conversation about eating oysters and snails and the morality of such actions with his slave Antoninus, played by Tony Curtis. Apparently the censors removed that bit from the film because Crassus was sharing his bisexuality with his manservant Antoninus on the silver screen and 1960 is no place to such a spectacle! Thankfully that scene has been restored once people learned to calm down. I get a kick out of the morality of sex comparing the eating of oysters compared to the eating of snails. :D",
            "review_date": "2011-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus is a bit of an anomaly within the Kubrick canon. What may be so surprising to those familiar with his body of work is the straight forward nature of the film. This is classic swords and sandals filmmaking without the eccentricity, darkness and wonder of his previous efforts.\r\n\r\n              Spartacus stars Kirk Douglas in the title role, as a slave working in the mountains of Libya who is sold into a Roman Gladiator academy of sorts. This is a period within Roman history where the most popular form of entertainment was the fight to the death between two sword welding warriors. Even kin could be faced with  the horror of a face to face battle. It suddenly occurs to one of these fighters that maybe it is better to direct the sword at the Rome establishment rather than each other. \r\n\r\n          This inspires Spartacus to start his own rebel gladiator army. He goes from village to village picking up new recruits as he goes along. The ultimate goal is simple: freedom and the death of human slavery. \r\n\r\n         Spartacus is one of the few dissapointments of Kubrick's career. This is not to say that it was incompently directed, since it only gives further evidence of Kubrick's growth as a film director. Never before had Stanley had to tackle a project of this magnitude, with only two features films under his belt. Yet,  he does so with utmost skill and finesse. \r\n\r\n        No, what's missing is authorial vision that is vital to any Kubrick picture. Kubrick was not even the original director. Following the success of thier previous collaboration, Paths of Glory, Kirk hired  Stanley to take over production from Anthony Mann. Rahter than give Kubrick control of the picture, it was clear that executive producer Douglas would be calling the shots. The results are then a safe and uninspired historical epic, Kubrick's one and only for hire job. It would take some much more controversial material in Lolita, for Kubrick to find his voice again.",
            "review_date": "2011-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "REBELLION-The first of the 9 favorite subjects of Stanley Kubrick, as told by the DVD booklet. \r\n\r\nPLOT:Spartacus (Kirk Douglas) is a Thracian slave that is bought by Lentulus Batiatus (Peter Ustinov) to teach to be a gladiator, but Spartacus is rebellious, and eventually starts a rebellion against Rome's slave opression with the other gladiators and takes a wife, a Brittanian slave named Varinia (Jean Simmons) and a friend named Antoninus (Tony Curtis). The slaves revolt against the corrupt Russian senator Marcus Licinius Crassus (Laurence Olivier). It is the classic story of Spartacus executed nearly perfect.\r\n\r\nACTING:The acting is truly brilliant. No one did a bad job! Douglas was perfect as Spartacus, Simmons does brilliant as Barinia, and Curtis does wonderful as Antoninus. Olivier and Ustinov also did a great job, considering this was Ustinov's Academy Award-winning role for Best Supporting Actor.\r\n\r\nSCORE:The score here is like a Babylonian John Williams. I loved it. Though I wouldn't call it beautiful or unque, it was still great.\r\n\r\nEFFECTS:The blood effects are purely spectacular for the time being. They weren't damn CG and they actually made it look like real blood instead of strawberry cough syrup shit.\r\n\r\nCAMERAWORK:Yes, the famous Kubrikian, angled camerawork is here for the best shots ever the grace the screen, as usual. \r\n\r\nOTHER CONTENT:Now, this film is purely brilliant, but it has a couple minor flaws that I could find. Firstly, I believe (as well as some other tight-fisted critics) that the plot execution is a bit uneven. It is very well executed, but you can tell that it's a little too freewilling and loose than it needs to be. Secondly, I wouldn't count this one as much of a flaw than a directorial characteristic, but I also believe this doesn't have the 100% true feeling of a Stanley Kubrick film. I mean, I can feel in some scenes more than others Kubrick's presence, but I can't feel it throughout as I could with his other films I've seen. But let's stop with the flaws for a minute and glorify any other good things about this film. The script is very well-written; so much that it is almost poetry than a script. Also, the movie's pretty accurate to the tale of Spartacus if I might say so based on what I learned in 7th grade. \r\n\r\nOVERALL,an awesome Kubrick film with a near-perfectly executed plot, brilliant acting, great score, realistic effects, Kubrickian camerawork, well-written script, and \"historically\" accurate, but the plot's execution, though near-perfect, is uneven and the presence of Kubrick in this film isn't as strong as in some of his other works.",
            "review_date": "2011-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "REBELLION-The first of the 9 favorite subjects of Stanley Kubrick, as told by the DVD booklet. \n\nPLOT:Spartacus (Kirk Douglas) is a Thracian slave that is bought by Lentulus Batiatus (Peter Ustinov) to teach to be a gladiator, but Spartacus is rebellious, and eventually starts a rebellion against Rome's slave opression with the other gladiators and takes a wife, a Brittanian slave named Varinia (Jean Simmons) and a friend named Antoninus (Tony Curtis). The slaves revolt against the corrupt Russian senator Marcus Licinius Crassus (Laurence Olivier). It is the classic story of Spartacus executed nearly perfect.\n\nACTING:The acting is truly brilliant. No one did a bad job! Douglas was perfect as Spartacus, Simmons does brilliant as Barinia, and Curtis does wonderful as Antoninus. Olivier and Ustinov also did a great job, considering this was Ustinov's Academy Award-winning role for Best Supporting Actor.\n\nSCORE:The score here is like a Babylonian John Williams. I loved it. Though I wouldn't call it beautiful or unque, it was still great.\n\nEFFECTS:The blood effects are purely spectacular for the time being. They weren't damn CG and they actually made it look like real blood instead of strawberry cough syrup shit.\n\nCAMERAWORK:Yes, the famous Kubrikian, angled camerawork is here for the best shots ever the grace the screen, as usual. \n\nOTHER CONTENT:Now, this film is purely brilliant, but it has a couple minor flaws that I could find. Firstly, I believe (as well as some other tight-fisted critics) that the plot execution is a bit uneven. It is very well executed, but you can tell that it's a little too freewilling and loose than it needs to be. Secondly, I wouldn't count this one as much of a flaw than a directorial characteristic, but I also believe this doesn't have the 100% true feeling of a Stanley Kubrick film. I mean, I can feel in some scenes more than others Kubrick's presence, but I can't feel it throughout as I could with his other films I've seen. But let's stop with the flaws for a minute and glorify any other good things about this film. The script is very well-written; so much that it is almost poetry than a script. Also, the movie's pretty accurate to the tale of Spartacus if I might say so based on what I learned in 7th grade. \n\nOVERALL,an awesome Kubrick film with a near-perfectly executed plot, brilliant acting, great score, realistic effects, Kubrickian camerawork, well-written script, and \"historically\" accurate, but the plot's execution, though near-perfect, is uneven and the presence of Kubrick in this film isn't as strong as in some of his other works.",
            "review_date": "2011-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lawrence Olivier is brilliant in the role of Crassus, and both Charles Laughton and Peter Ustinov turn in marvelous performances.  Even Kirk Douglass manages to be convincing.  The film is marred only by Tony Curtis' lame showing as Antoninus, yet I still give this epic classic a 100% rating due to its compelling presentation of Roman/Western history, its handling of the issue of slavery, and the superb performances of its English actors.",
            "review_date": "2011-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love it.  As a movie, brilliant,epic,never mind historical accuracy, it's a movie!!!",
            "review_date": "2011-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not the Kubrickian spectacle I was hoping for, a spectacle none the less. While it suffers from a ham fisted performance by Douglas and moments of nauseating sentiment, it also thrives on some well crafted battle scenes. This film feels big and I got to hand it to a young Kubrick for saving this once doomed production. While I would have loved to see Kubricks flare a little more throughout the film, Trumbo's anti-establishment message is well realized. In the grand scheme of things, it isn't my favorite of Kubricks. Yet, it is still an enjoyable watch if you can stomach the running time.",
            "review_date": "2011-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The only freedom a slave can have, is death...\"\r\n\r\n\"Spartacus\" is an epic tragedy of men and their individual quests for glory.  It's best moments show the brilliance of director Stanley Kubrick and the majesty that comprises post-classical cinema.    \r\n\"Spartacus\" is loosely based on the life of Spartacus; a slave, gladiator, and general in the Third Servile War, a major slave uprising against the Roman Republic.  He is played by Kirk Douglas, who provides a strong performance.  \r\nIt is refreshing to see that all the characters in \"Spartacus\" are highly complex.  The screenplay is largely brilliant and has some important messages to convey.  I enjoyed, for example, how the screenplay doesn't abhorrently villainze Romans and grants viewers ample time to understand their motivations.  Politics and morality are the driving forces behind \"Spartacus'\" screenplay.  I want to note how some films are quick to brand Romans as aristocratic villains.  That's not entirely the case here. Educated minds should know that the facets of good and evil cannot be defined among a whole society.  On the other hand, Spartacus and his slaves are the obvious protagonists, as they seek freedom from Roman oppression and slavery.  Morality is a matter of perspective and motivation, this film hints at that.\r\nOn a negative note, a few scenes in \"Spartacus\" are noticeably outdated and a few performances are noticeably stiff.  The romance between Spartacus and love-interest Varinia is intriguing at the start of the film, but slowly grows to slowdown the plot.  Finally, the ending scenes of the restored version of \"Spartacus\" run a little long and could use some tweaking.  \r\nHowever, I believe everyone should watch \"Spartacus\" once in their lives. I do bring into question its replay value. See it and enjoy this classic.           \r\nGrade: B-",
            "review_date": "2011-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great historical movie, a must see. Great epic story.",
            "review_date": "2011-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good body with a dull brain is as dull as life itself\r\n\r\nSpartacus is a slave that is destined for a life in the coliseum fighting regularly to the death.  Slaves like him can go for a pretty penny, but he envisions a life of freedom for his kind and future generations.  First, Spartacus leads a revolt to break out of his camp.  Once he establishes himself out of slavery he leads a revolt against the Roman Empire.\r\n\r\n\"When a free man dies he loses the pleasure of life.  A slave loses his pain.  Death is the only freedom a slave knows.  That's why he's not afraid of it.  That's why we'll win.\"\r\n\r\nStanley Kubrick, director of The Shining, Full Metal Jacket, A Clockwork Orange, Dr. Strangelove, Lolita, The Killing, and Paths of Glory, delivers Spartacus.  The storyline for this picture is a nice mix of the Spartacus television series and 300.  The action scenes are solid and the lines are very well written.  The cast delivers solid performance for the action/epic genre and the cast includes Kirk Douglas, Laurence Olivier, John Ireland, Jean Simmons, and Nina Foch. \r\n\r\n\"There's going to be a fight to the death.\"\r\n\r\nSpartacus was a film we came across while flicking through the channels and decided we had to see based on its vastness and our love for the television series.  I actually did not know this was a Kubrick movie until writing this review.  This was an entertaining action epic that is definitely worth your time despite being three hours and thirty minutes.\r\n\r\n\"Those who are about to die salute you.\"\r\n\r\nGrade: B+/A-",
            "review_date": "2011-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this epic film starring Kirk Douglas and directed by Stanley Kubrick, a slave turned gladiator leads a revolt against the Roman empire. Spartacus leads his fellow plebeians in a sacking and burning of the countryside while slowly gaining followers. Along the way he is reunited with his love (Jean Simmons). However, soon all hope of triumph or escape is gone and Spartacus must face the Roman legions in one final battle. Utterly overwhelmed by the other forces, his followers are slaughtered and taken prisoner. With all hope gone he must kill his friend (Tony Curtis) and then face death himself by crucifixion. But all is not lost because his wife and child do get away allowing his legacy to remain.",
            "review_date": "2011-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kubrick's films can be described as precise pieces of art. As the grandmaster himself was a notorious perfectionist his style of filmmaking is flawless. Almost too perfect for my taste.\r\nYou can always expect nice cinematography from his works and there are some excellent scenes in Spartacus indeed.\r\nThe cast does a nice job as well (one of the rare star-ladden Kubrick films). The score is annoying though, like most of the old epics' scores, this and the historical inaccuracy can be ascribed to the genre and the age of the film - but that doesn't make it a better experience for today's viewer.\r\n\r\nKirk Douglas was the driving force behind the making of the film after being denied the role of Ben-Hur - but I'm sorry Kirk, Ben-Hur is the better film - bigger, more ambitious and not so boring...\r\nAll in all, Spartacus seemed to me like a fast car that doesn't get its power on the road - it roars loud but underachieves.",
            "review_date": "2011-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kubrick steps into a new realm for his most epic film.",
            "review_date": "2011-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoy this amazing epic film. I would watch this movie over Gladiator any day.",
            "review_date": "2011-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the film has much else about it to praise, the thing that stood out the most to me was Kirk Douglas as the inspiring hero. One of the greatest performances in a lead role I've ever seen.",
            "review_date": "2011-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Kirk Douglas' strongest performances, and a truly moving finale.",
            "review_date": "2011-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute classic, with Kirk Douglas in a career-defining performance.",
            "review_date": "2011-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A precursor to Gladiator, Spartacus tv series, and other ancient world films, this film is filled with epic action, outstanding performances, and has a grand storyline.  This is definitely worth seeing at least once in your lifetime.",
            "review_date": "2011-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An admirable epic with a memorable first hour that is ultimately done in its own bloated length, corny performances (I'm looking at you Jean Simmons), cheesy Biblical shmaltz, and a film legacy that is based on a 20-second excerpt from a film more than 3 hours long (\"I'm Spartacus\").  This is not one I'll be revisiting and seems to have found its place on the AFI Top 100 solely for the purpose of giving the list another epic.  It didn't make the list the first time and really should never have been added.",
            "review_date": "2011-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's one of those few chances when two movies pit against each other both stack up in such a great way! Plus watching this with my dad was a big memory in my cinematic childhood.",
            "review_date": "2011-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i like this moves to much :)",
            "review_date": "2011-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it wasn't completely deserving of its runtime, with themes and characters which weren't properly developed, this was anything but a boring watch. It was all you could expect from an epic. Exciting, well written, and brilliantly directed. It wasn't completely satisfying for me, but I would recommend it in a heartbeat.",
            "review_date": "2011-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that only bear's Kubrick's stamp to the extent that his tendency to immensely detailed realism shows for the first time.  Otherwise, a superior epic dragged down somewhat by a pointless romantic subplot and too much speechifying.",
            "review_date": "2011-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well written and shot film. Anyone with a love for action or ancient Rome should come away entertained. :D",
            "review_date": "2011-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film has plenty to offer but its length is its biggest weakness.  It feels more pretentious than necessary in its length.   So much stuff could've been cut and the story wouldn't have been hurt a bit.  It has some decent battles though, and I liked the story, and Douglas' performance is great...but its never a good sign when you stop caring and notice how much longer you have left to go (I've sat through Lord of the Rings without getting bored, so I think the pacing was lacking in this one).  The movie isn't terrible, it just could've been much better.",
            "review_date": "2011-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice mix of old Hollywood, Stanley Kubrick, and a cast 10,500 people!",
            "review_date": "2011-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stanley Kubrick's Spartacus is a defining classic that has withstood the test of time. Brilliantly acted and directed, this is one of the best epics that combines action, drama and romance. This is a stunning work of cinematic genius that is a must see for cinema fans of all ages looking for a terrific, well acted and brilliantly directed film with rousing action, thrills and a compelling story. This is among Kubrick's greatest works. This is a majestic piece of cinema, and remains one of the standout classics along with such works as Ben- Hur and Lawrence of Arabia. This is an epic film that is grand in scale and scope. This is a picture that only Stanley Kubrick could have directed. With a terrific cast of outstanding talent, this is a powerful work that delivers exciting visuals, great battles and memorable performances. Kirk Douglas delivers on-screen and his role is among the most famous roles in the long history of cinema. This is a wonderful film that is sure to please cinema buffs everywhere and it is among the greatest films ever made as well. The film is truly entertaining from start to finish right up to the unforgettable climax. This epic has had a profound impact on genre films for years to come, and though no film has surpassed the greatness of Spartacus, many pictures have been influenced by Kubrick's classic. A brilliant, compelling and unforgettable film that is among the greatest films ever made. A must see for serious film fans. This film is worth watching for Kirk Douglas performance alone, and there's plenty of aspects that stand out about this work. Stanley Kubrick would aim bigger and better with this film, and it set the stage for future films in Kubrick's long and legendary career.",
            "review_date": "2011-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A breath taking epic.",
            "review_date": "2011-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hmm. Now this is a rather odd film for Kubrick to have directed. I mean, I know that he was known for directing all sorts of genres during his career, but for him to direct this 3 hour epic in the early stages of his career, I must say that I am impressed. Okay, I guess that some back story is needed to understand the way this film was even made. Kirk Douglas was, at the time, out of work and he needed a job to help him get by. So what he had done was finance a film adaption of the novel Spartacus by Howard Fast and have him (being Douglas) portray the title character. Due to creative differences with the original director Anthony Mann, Douglas went back and hired Stanley Kubrick whom he had previously worked with on the acclaimed Paths Of Glory. What resulted would be the first of Kubrick's four epics he would go on to create (the others include 2001: A Space Odyssey, Barry Lyndon, and The Shining) and this has to be, just for the scope of this film alone, one of his most wonderful films ever. With this film, Kubrick created something that appeals to everyone from the people who like romance to the people that love war. This film has it all. Now for my reaction. For the most part, my reaction to this film was in complete shock. After hearing things via word of mouth, I learned quite an interesting bit about this film and the reputation it has on being great. After sitting through this beast of a film, I understand the love people have. But for the most part with ranking this film with Kubrick's other films, I will have to say that this film is in the middle with being on my list of being the greatest. It is not that I have anything against this film. It just that it does not appeal to me on a personal level like how his other films would. But, for an epic period piece, it is by far one of the greatest I have seen. Okay, now for the details. The first is with direction. If you go into this film expecting a typical Kubrick film filled with Kubrick's trademarks that he is associated with, you will be disappointed severely. Things like Kubrick using still cameras to follow people around and the use of classical compositions are not found here. But this is an exception due to this being made early in his career and he was still trying to find his own way of making films. But what really sets this film apart and what makes me love this film is how he films the action sequences that had happened through out. Anyone who knows Kubrick knows that he is beyond difficult with his cast and crew to such a point that they start to loose their minds (ex: Shelly DuVall in The Shining), so one has to wonder how exactly the actors felt during those scenes and how many retakes there must have been. For the overall work and looking at the entire scope of this film, Kubrick done a damn good and impressive job. For acting, well, we have some of the finest performances you will ever see. First I must talk about Kirk Douglas. Now, I have never seen any of his films prior to me writing this review, but due to me seeing a good many of his son's (Michael Douglas) films, I will say that Kirk is a damn fine actor and this film proves it. The main thing that stands out with his acting is just the image and presence he presents on screen. When he is on screen, you are just aware of his control. You know he is in power and that he will steal every shot he is in. It is easy to see where Michael got his acting abilities. The next person will have to be Jean Simmons (yes, I know her name sounds like the Rock God Gene Simmons). Her role in this film is the love interest of Spartacus and my main thought on her is that she is kind of bland. Do not get me wrong: there are moments in which she shines through (professing her love for Spartacus, protecting someone dear to her near the end of the film, etc.), but at times, she just seems to have the same expression on her face. Personally, it would of worked better if she had some more expression. But overall, a rather decent to good performance. Lastly will be the young Tony Curtis. Now, I am mostly a fan of his wife Janet Leigh and his daughter Jamie Lee Curtis' films more, but this being my first introduction to him as an actor, I will admit that I do like his acting. He plays this youthful character that has complete undying loyalty towards Spartacus and Curtis just shows off this entire innocents that works well with the character as a whole. Personally, I love him in this film and I would not mind seeing more of him in other films. Now for the score. Personally, as an original score, I do like how it has a certain Roman flare to it that actually makes it enjoyable. The only thing I would of liked would be if during the fight scenes, the music would have been a tad bit more epic and exciting enough to get your heart racing. But, then again, that would of just added to the stereotypes of Epics, so this is understandable. But, for the music and what it is, I like it. Lastly the script. It is, believe it or not, hard to make a three plus hour film and keep it entertaining and the script does just that. The dialogue seems natural, the scenes are well written, and the film just flows wonderfully. Personally, I would not be surprised if this film won the Academy Award for Best Adapted Screen Play. Well written. Overall, this is a good early Kubrick film and it just shows what was to come in the future for him.",
            "review_date": "2011-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A seminal classic of sorts. One that is of true, simple story about injustice, the absurd and of freedom. Quite the riveting movie with the fitting mood and atmosphere and elegant drama to drive its archetypal hero. It's both tragic and triumphant, and bravely courageous.",
            "review_date": "2011-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the great classics.",
            "review_date": "2011-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sparticus is Kurbrick's attempt at encapsulating the essence of Ancient Rome. The film covers nearly everything love, politics and military in a bit long time frame of 3 hours and 16 minutes. Although it seems a bit long at times, the performances of Douglas, Laughton, Olivier and others keep the film going and interesting. The movie is indeed on an epic scale, on par with films like Ben Hur and gladiator. Surprisingly of all great presences on screen Ustinov was my favorite character as he calmly shifted his way through all aspects of Rome and sneakily got his way despite being on of the least amoral characters in the whole film. Overall a solid film and glad to have watched, but will be some time before I ever see it again.",
            "review_date": "2011-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far far away from the best movies of Kubrick. Even if it is an enjoyable epic tale, you get to miss the future genius of its work",
            "review_date": "2011-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very average movie, the opposite of Kubricks later films.",
            "review_date": "2011-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At times, it felt more like a filming at a broadway theater than film.  Other than that, splendid.",
            "review_date": "2011-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus shows that the Gladiators are not meant for showing only their action scenes, their love Interests and their tragic Back Story, Spartacus starts itself with the Kirk Douglas being sold to Batiatas, and from there on the story progresses forward and not even a single back flash moment is seen.",
            "review_date": "2011-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of kubrick's weakest",
            "review_date": "2011-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The epitome of artistic control denied, making for the only Kubrick film that Kubrick himself disowned. With only the occasional flare of signature style amid dated gloss, the film is one of Kubrick's worst. It is fortunate to his reputation that most individuals consider it to be a classic.",
            "review_date": "2011-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite some forced dialogue, an ill fitting musical score, and questionable acting by some of the supporting actors. I really appreciated this film. It took a moderate amount of time to build up steam, and there were several scenes that were unnecessary, but after the intermission the movie moved fluidly and great in scope and magnificence. The Battle scene was one of the largest and most well assembled that I have ever seen, and the aftermath was chilling and left a real impression. The film was quite racey for the period, with undertones of homosexuality and a near nude bathing scene with the leading lady. The climax of the film was the famous I'm Spartacus scene and it was well received even though it holds so much weight from cultural reference. In the end the story itself and the character growth (especially the growth of Spartacus and Crassus) were what made this movie. Watch this movie if you have the time (it is over three hours) and be patient it is worth it in the end.",
            "review_date": "2011-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartacus Directed by Stanley Kubrick. Starring Kirk Douglas, Charles Laughton, Laurence Olivier, Tony Curtis and son on.\r\n\r\nSpartacus has much of work and dedication done to it, like Roger Ebert said, that film has its flaws. At 'Third Servile War' a rebellion is holding sword in the air not engaging in fights, whilst the rest of men are engaged in sword-fighting, while this may not be accounted that much flaw, overall the film has set a grand record of being a masterclass epic film, that has got the critical performance of lead cast. \r\n\r\nGladiatorial-School scenes are marvelous in this classic-epic film. Performance of Charles Laughton, Laurence Olivier are worth praising. Ustinov and Laughton's conversations with bit of fun-mixed are really great-entertainment and indeed gem to be treasured with such a conversation full of serious-amusement I must say. Ustinov won Best Supporting Oscar Award for his performance.",
            "review_date": "2011-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic of epics that came about from Douglas's own arrogance, I can see why perfectionist Kubrick wished it was removed from his repertoire.  It's not especially his most perfect film. While I think the story could have been moving and emotional, I just don't feel Spartacus's character was well developed and I never truly felt sorry for him. So when his final moments came about I wasn't that moved.",
            "review_date": "2011-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like Ben-Hur, but more... you know, Kubrickian",
            "review_date": "2011-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's dated and Douglas was wrong for the role. May be Kubrick's worst film, My willing suspension of disbelief went away very fast, certainly not a bad movie.",
            "review_date": "2011-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Gladiator of its day and it has a lasting appeal. A great story and done ona  huge scale. Nice bit of romance, nice heroism, good scenes from the gladiatorial ring. A class film.",
            "review_date": "2011-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my top 5 favorite movie of all time. Gotta see it again now, lol",
            "review_date": "2011-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing epic Kubrick classic. Even with its massive length, I really enjoyed this a lot. Douglas is great, but Olivier really stole the show. I loved watching him as the antagonistic Roman leader. Captures the themes and culture of Imperial Rome very nicely, even if a lot of that is dehumanizing (then again, dehumanizing is Kubrick's middle name). Very well directed and well choreographed, especially the epic fight scene towards the end. Almost perfect, but I'm taking off half a star for length and because I thought the score was a tad obnoxious at times. Too over the top for my taste.",
            "review_date": "2011-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Three stars for epic scale.  Boo for length and sixties cheese.  And Kirk's chin hole.  Still, gotta see the classics.",
            "review_date": "2011-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant stylistic milestone in film making that unfortunately smells of 50s acting and dated editing techniques.",
            "review_date": "2011-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hey i got a surprise for you. another really good kubrick film.",
            "review_date": "2011-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of meandering storylines, including romance, friendships and politics, are given rather short thrift as the slave revolt tries to gather steam.  The balance isn't there in the script to satisfy anyone,  Perhaps the only way to do this story right is with two separate movies?  Otherwise, too clean and sanitized...but par for the era.",
            "review_date": "2011-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kubrick's Spartacus is his least Kubrick-esque film, mainly because of the situation of control (or lack of). However, this does not fail to make this 3-hour epic a masterpiece. With intelligent dialogue that strays away from the mindless clichÃ (C)s, and and ending that is not harmlessly wrapped in a fairy-tale, it is a true inspiration to film-making. Spartacus has a firm grip on all aspects that make films part of history; the acting, the cinematography, the scope, the scale, the perfection. It is without fail one of the most legendary epics.",
            "review_date": "2011-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly horrendous amount of overacting. It was impossible to be sucked into this story with what I could only see as people playing dress-up and pretending. It's also funny that Tony Curtis has an incredibly thick New York accent in the middle of everything else. Peter Ustinov was a delight to watch in his role, but that's about it.\n\nGreat themes and a great basic story, I agree. That doesn't excuse the total lack of believable execution. This film also has no right to be three hours long. Anybody who watches this could easily understand the point of every aspect of the story, and feel just as engaged and impacted in far less time. We're talking like 40% less here. It wasn't as if layers upon layers kept getting added to the story. It was the same stuff repeatedly.",
            "review_date": "2011-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stunning epic that while being a true masterpiece is not even Kubricks best film. Probably one of the best historical epics to ever hit the silver screen!",
            "review_date": "2011-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Thrilling Adventure that Electrified the World!",
            "review_date": "2011-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting epic movie for the time, nice participation of Ustinov, great cinematography, good direction... Definetely recommended but comfort seats and a lot of coke! Enjoy!",
            "review_date": "2011-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disappointing, but somewhat expected for Kubrick in 1960. Overwhelmingly full of filler empty posturing. Felt like most of the dialog was names.",
            "review_date": "2011-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely inspirational.  Great entertainment on a grand scale.",
            "review_date": "2011-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this a while back first in 6th grade and remember enjoying it.",
            "review_date": "2011-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing historical film....a Must see!!",
            "review_date": "2011-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Compelling and brilliant, this may be the best superspectacle out there.",
            "review_date": "2011-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As Stanley Kubrick's breakout film, Spartacus must have been seen as a remarkable accomplishment for the director at the time of his release. Moving from some good but small-scale noir dramas to a massively budgeted and sprawling historical epic must have seemed impressive at the time. However, compared to some of his later films, Spartacus underwhelms as a well-made but overly conventional historical epic. It shares a lot of blood with the other epics of its time period, such as Ben-Hur or The Ten Commandments, and though it holds up well in comparison, it suffers from an inflated length and a rather simple moralistic view, in sharp contrast to the ambiguous genius of some of Kubrick's other work. It also lacks that certain \"something\" that Kubrick brought to his hallmark work, mainly due to his lack of creative control over the movie. After all, he was only brought in as a replacement for Anthony Mann, and while Dalton Trumbo's script is impressive, it does not hold the same weight as Kubrick's auteur work. Luckily, the film is remembered fondly, due to Kubrick's skilled direction and the strong performances from its actors. Kirk Douglas gives one of his most memorable performances as the eponymous gladiator, making Spartacus a memorable, likable, charismatic, and identifiable hero. The legendary Laurence Olivier gives a strong and occasionally unsettling turn as the antagonistic Crassus, making the Roman consul a villain with depth, a man who fears the break Spartacus brings to the order of Rome, no matter how foul or flawed that order might be. Peter Ustinov earns his Academy Award (the only acting Oscar for a Kubrick film, no less) as Batiatus, a character filled with charisma, cowardice, greed, and a lot of excellently written dialogue (some improvised by the actor himself). Jean Simmons plainly succeeds at making herself the object of Spartacus' desire in Varinia, and Charles Laughton portrays quite a morally ambiguous character in Senator Gracchus. The only casting misstep (in my opinion) is Tony Curtis as Antoninus. To me, he was a little too wide-eyed for the part, and his accent seemed out-of-place with the rest of the cast. A film that I believe shares quite a kinship with Spartacus is Ridley Scott's Gladiator. I believe that Scott took the concept of Spartacus and streamlined it, making a better film in the process. Spartacus occasionally falls under its own weight, but it's still an emotional and intelligent epic, and worthy of the canon of its legendary director.",
            "review_date": "2011-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If it wasn't for Spartacus, Gladiator would never have existed.",
            "review_date": "2011-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorite movies. It's tough for any modern day action flick to compete",
            "review_date": "2011-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of best film,s every made",
            "review_date": "2011-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome, If not a little long. I can't say anything about it that hasn't already been said.",
            "review_date": "2011-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the definition of epic",
            "review_date": "2011-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great epic film following the life of a man who desperately tries to fight for freedom.",
            "review_date": "2011-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is mostly dated, but it has some strong performances and some pretty interesting political and sexual subtext.  It's an intelligent epic, but the stiltedness of most of the plot and script keep it from being great.  I liked Kirk Douglas and Peter Ustinov, but Jean Simmons was poorly cast.  Ben-Hur is a better old school sword-and-sandals epic.",
            "review_date": "2011-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good classic epic. Some of the massive sets and battles would only be done with CGI in today's films. It was just a little long for me, maybe because I was really tired while watching.",
            "review_date": "2011-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's dated and Douglas was wrong for the role. May be Kubrick's worst film, My willing suspension of disbelief went away very fast, certainly not a bad movie.",
            "review_date": "2011-02-22",
            "source": "rt",
            "lang": "en"
        }
    ]
}