{
    "rating": 9.2,
    "release_date": "1960-11-14",
    "num_reviews": 190,
    "genres": [
        "Swedish"
    ],
    "summary": "Devout Christians Töre and Märeta (Max von Sydow, Birgitta Valberg) send their only daughter, the virginal Karin (Birgritta Pettersson), and their foster daughter, the unrepentant Ingeri (Gunnel Lindblom), to deliver candles to a distant church. On their way through the woods, the girls encounter a group of savage goat herders who brutally rape and murder Karin as Ingeri remains hidden. When the killers unwittingly seek refuge in the farmhouse of Töre and Märeta, Töre plots a fitting revenge.",
    "reviews": [
        {
            "content": "Grim even by Ingmar Bergman's standards, The Virgin Spring is certainly one of his most bleak and disturbing films.  Set in medieval Sweden, a young girl is sexually assaulted and murdered by a trio of goat herders, who later that evening find themselves seeking refuge in the home of the victim's father.  It is a film about rape, murder, guilt, revenge and misguided religious devotion and is unrelenting in its impact.  Bergman's direction, as always, is impeccable, as is Sven Nykvist cinematography.  Filled with powerful images and meaningful symbolism, it is a film of grotesque beauty that is difficult to forget and even more difficult to digest.",
            "review_date": "2022-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well-directed film regarding a horrible tragedy. I watched this film not knowing much about it except that it was directed by Bergman. The film begins with some over-the-top smiley acting which I thought would continue throughout the film. However, the plot takes a tragic turn which allows the film to become more engaging as you don't know where the plot is going and what the reactions of the other characters will be. The film's acting is okay and the cinematography isn't good. However, the plot and screenplay helped keep my interest. Although an early film of his, Bergman's direction should be commended as the pace of the film never slows down too much. The film's direction and screenplay is good, however, most other elements of the film are sub-standard. The film won the Best Foreign Language Picture Oscar. I have not seen the other nominees except for Kapo which I did not like and was definitely not as well-made as The Virgin Spring. The film was also nominated for Best Costume Design which I didn't think made the film stand out but did allow me to believe the medieval Swedish world these characters were living in.",
            "review_date": "2022-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece of movie-making. The good and the evil are acknowledged and not questioned, nor condemned by Bergman. It is the way it should be.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most powerful legends in the history of cinematography! (with \"The Seven Seal\")\nTerrible, beautiful, spellbinding. The scene with a tree - timeless.",
            "review_date": "2020-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tough, austere moral reckoning.",
            "review_date": "2019-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to admit, I've never been a massive fan of Bergman's flicks, but they always look spectacular. The use of natural light, and lingering close-up shots are something else. He always picks actors with uncompromisingly interesting looking faces too, which helps.",
            "review_date": "2017-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While difficult to watch given the subject matter, it is masterfully filmed.  Unlike some of Bergman's prior works, the themes did not resonate as loudly in this film.  Realism, brutality and an overall bleakness dominated the movie-watching experience. The  visceral experience (achieved visually) outweighed the cerebral experience (thematic exploration).",
            "review_date": "2017-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a sense, it is a story of rape & revenge. However, being from the hands of Ingmar Bergman, it is far from being a b-movie. This is AAA.\nJust a couple years after The Seventh Seal, the action is built in the Swedish middle age once more. It is built as a theater tragedy, and, as so, it grows up to the to the tragic resolution.\nThe film is not a splatter at all, however the violence here is brutal: both the crime and the revenge. Not a drop of real blood is shown (and also fake blood very scarcely, and only once), nothing to be compared to Tarantino, for example: but, while in a Tarantino the violence is obviously a fake, here it is emotionally real: it strikes you in your guts and your soul.\nHowever, the poetic moments are many: everything is immersed into the magic of the great Nordic forest, and quotations to the religion - both Christian and pagan - are many: notable the representation of the last supper, repeated twice, and, in the end, what I can only compare to \"La Pietà\", by Michelangelo: that is what leave the viewer, leaving the cinema, with a beautiful feeling inside.\nThank to my local cine club for finding and showing these milestone of the cinema.",
            "review_date": "2016-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Virgin Spring is thematically rich, well filmed and mostly intriguing and also well acted, but it is so uneven structurally speaking as the second half should have been the majority of the movie as far as I'm concerned and the themes, especially that of justice and the nature of evil, should have been more much prominent in the story. In the end, it is solid, but never as great as it could have been.",
            "review_date": "2016-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Virgin Spring is yet another accomplishment on Ingmar Bergman's grandiose filmography, resonating loud even after five decades.",
            "review_date": "2016-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a masterpiece!  Glad I finally got to sit down and watch this film from Ingmar Bergman, one of the all-time greatest directors.  It's a very powerful film and not an easy watch, but so well done.  I have always loved the work of cinematographer Sven Nykvist, but this might be one of the most beautiful B&W films I have ever seen.  This Swedish classic is most highly recommended for cinema lovers!",
            "review_date": "2016-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In watching these old Ingmar Bergman movies, the thought occurs to me that Bergman was to cinema what the golden age of Russian literature was to writing.  His films have a certain depth to them, and feel meaty with their observations on human nature and their questions of religion and philosophy.  'The Virgin Spring', based on a 13th century Swedish ballad, is no exception.  \n\nIf you think about it, the story of 'The Virgin Spring' encapsulates quite a bit of the effect of religion on those who believe, starting with a girl needing to mind her chastity until marriage, and continuing on with a virgin must deliver candles for Matins.   When a horrible thing happens to the girl, her companion and her mother both believe it's because of them, that God had listened to their jealous prayers, while her father is stricken and asks that time-old question, \"God, how could you let this happen?\"  However, none of them challenge that most deeply held assertion, that God exists in the first place.  After exacting brutal vengeance, including killing a child, the grief-ridden father asks God for forgiveness, and promises to build him a church on the site.   He still believes in spite of it all, wants to remain upright in the best way he can conceive, and is both admirable and flawed at the same time.  \n\nIn telling this story with elements of Job (\"Why?\") and Exodus/Leviticus (\"An eye for an eye\"), Bergman examines human nature - the inclination to do evil, and the morality of vengeance - as well as the nature of God, and our relationship to Him.  How you perceive the film's meaning will likely depend on your most personal views, but it will certainly make you think.  \n\nAs for the filmmaking, Bergman keeps his storytelling taut - every scene counts - and he captures plenty of great moments, including some beautiful shots of the outdoors in Sweden, and heavy emotions on the faces of his actors.  One scene in particular made the film controversial, however, and no review would be complete without mentioning it.  The rape is horrific, and seriously disturbing.  We see evil coming as Bergman masterfully builds up tension, but are still shocked - both at the incredible cruelty of the men, but also at Bergman keeping the camera on them as they commit the act (especially for 1960).    He knew he didn't have to show a lot of flesh to show how vile, disgusting, degrading, and animalistic a rape is, and it's a shame the film was banned in some places given the prevalence of rape in society.  The scene speaks to the darkest aspect of man, and yet oozes authenticity.\n\nAs to whether religion casts a darkness of its own on man, the shadow of ignorance, or gives his life meaning and elevates him over nihilism and chaos, the reader will have to decide, but I believe Bergman is in the latter camp with this film.   He is a bit over the top at the end, hitting us over the head with the miracle of the 'virgin spring' that gushes forth, and while that's presumably how the 13th century legend goes, it's the reason I knocked my rating down a bit for what is still a very good film.",
            "review_date": "2016-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me, this film became extraordinarily powerful in the last scene. At first, its slow pace and relative quiet and stillness was not engaging me, but as time went on I realized just how much the silence actually was communicating. Simple gestures or facial expressions or shot juxtapositions said so much, and said it more poignantly than simple dialogue would have.",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Virgin Spring offers up a moral conundrum; a young girl is raped and murdered and her father seeks retribution. It he justified in doing so? Is he a hypocrite for espousing religious rhetoric and succumbing to the passions innate to human nature? Why would a god do this to a religious family at all?\n\nThose who practice religion are portrayed as cruel and judgmental, focusing on building huge, indulgent churches while the average man lives in huts. This is not an indictment of religion, however; the fact that the finale suggests rebirth through the divine and offers an explanation for why man would feel the need to honor their deity through massive monuments rebukes that interpretation entirely. Bergman simply questions the nature of man's relationship to god, whether or not man is futile in shouting up at a man in the sky they've never seen. He offers no answers because there aren't any, the conundrum unsolvable, ambiguous beyond explanation, a decision that rings true to life.",
            "review_date": "2015-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another greatly disturbing, and greatly powerful, Ingmar Bergman film. Shocking and beautifully filmed, this is an absolutely great film!",
            "review_date": "2015-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Winner of the Foreign-Language Oscar Picture, the film represents the first peak of Ingmar Bergman's creativity, released right after The Seventh Seal and before Through a Glass Darkly, all three masterpieces. Although the story plays straightforwardly, greater enjoyment comes through pondering the meanings behind Bergman's symbolic tapestry. The master guides us through this heartbreaking tale with a delicate hand and a gorgeous, poetic touch. It's actually one of his simplest and most moving works -- a film to be savored and pondered. Sven Nykvist's luminous black-and-white photography conspiring with the austerity of Bergman's imagery to create an extraordinary metaphysical charge. Easily lost amid a brilliant career, The Virgin Spring once again shows Bergman's control in capturing the furthest ranges of emotion. Bergman's instinctive approach to filmmaking - like his gripping use of long wordless moments filled with pictures of great power- is in evidence, with some unforgettable scenes that even today, almost 50 years later, have fresh impact. The period details are magnificently worked into the narrative, and the pace and economy of the tortured Swede's storytelling make his metaphysics infinitely easier to take.\n\nVERDICT: \"High-Quality Stuff\" - [Positive Reaction] This is a rating to a movie I view as very entertaining and well made, and definitely worth paying the full price at a theatre to see or own on DVD. It is not perfect, but it is definitely excellent... (Films that are rated 3.5 or 4 stars)",
            "review_date": "2015-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So What!!!!!!!!!!!!!!!",
            "review_date": "2015-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on a medieval Swedish tale, The Virgin Spring is twisted tale of morality, justice, revenge and salvation. A young girl from a wealthy family was raped and murdered on her way to light candle in the church for virgin Mary, the rapists sought shelter in the girl's family and upon learning the crime they did, the girl's father executed his own brand of justice.\n\nThe theme of religion was particularly important, you have Ingrei the pagan servant who is secretly resentful of Mareta, she failed to help her and allowed her to be killed as Odin's wrath. Mareta represents the goodness of the faithful, while Tore is God who smites evil.\n\nI love the camera-work and lighting used, the long shot of characters were able to reflect the emotions of each character while close ups brought the tension and suspense into full effect. I love the light cast on the character's faces showing the contrast of light and darkness, reflecting the moral dilemma the characters faced.\n\nThe acting was also excellent, from beginning to the end, there was not a single dull moment, everything was meaningful and the symbolism used was able to fully convey the ideas behind the film. It is a masterpiece which would be later adapted into The Last House on the Left.",
            "review_date": "2015-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jungfrukallan is a harrowing and starkly brutal yet somehow beautiful and poetic film about revenge, compassion and the silence of God, one of Bergman's most prominent themes.",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The staggering acts of vengeance was as horrific and brutal as anything ever committed to film past or present!",
            "review_date": "2015-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plot twists leave the viewer unsure who to cheer for - as each adult is a stinker at some point.",
            "review_date": "2014-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An often neglected picture, in the canon of the magnificent Ingmar Bergman.",
            "review_date": "2014-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Burning with intensity, Bergman's 21st film is carved from an old Scandinavian ballad, lending it the quality of fable or allegory.  The setting (Middle Ages) and the striking black and white cinematography (courtesy of Sven Nykvist) serve to heighten this effect. But it is the sudden brutal and realistic violence, which is that much more confronting due to its matter-of-factness, that truly commands your gaze and asks you to contemplate the presence and nature of evil.  Max von Sydow's response may be our first primal stab (ultimately toothless) at this foe and Bergman does not shy away at concentrating our attention on its complications.  As in the Book of Job, we and the characters in this medieval drama are led to question why any God would allow evil to exist (even as the competing Pagan spirits are still being worshipped for their power to influence and harm others). There is no simple answer but at least in this film Bergman seems to be suggesting (through symbols and story) that faith is the way ahead.  His next films offer much more doubt.",
            "review_date": "2014-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cinematography is just great in this film, really beautiful but at the same time dark and dirty, just as the story. In a beautiful world, poor people live filthy lives and do greedy things. Just magnificent storytelling about christianity and belief.",
            "review_date": "2014-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Seventh Seal meets Summer with Monika. Another fantastic work of Bergman's.",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Teaming up director Ingmar Bergman with legendary actor Max Von Sydow, The Virgin Spring sounded like a collaboration of versatile talent.\n\nThe Virgin Spring is an example of a dated film. While it is a good piece, the effect of its story would not have the same effect today because in a society which reports the violent nature of rape cases left right and centre as well as depicting the dark nature of them in films, the central moment that depicts that in The Virgin Spring does not have the same dramatic impact anymore. It's understandable as the film is 54 years old, and it is enjoyable for its merits as a classic film of Swedish cinema. But there is no denying that it is a dated film, so by contemporary standards it is likely to be judged as one. \nThis is one of the two central scenes in The Virgin Suicides: the rape scene and the brutal moment of vengeance in the final scene. The one scene that would have more of an impact today would be the latter because there is a lot of complex depth in it stemming from how the viewers' morals affect their interpretation of the scene. The impact of the actual moment is not all that powerful because, again, the film is dated. But the meaning of it remains valid. It is dramatic and is depicted very powerfully with raw violence based on clever visual traits, and it does not use complex film techniques to dramatize it. The Virgin Spring feels like a very natural film in terms of the way that Ingmar Bergman handles the drama in the story. Some may find it empty, but I found it to be mostly an atmospheric experience. There are a few scenes where a musical score echoes its way into the film gently and presents a sense of mysterious melancholy on a subtle level which means that it is a nice touch, but overall the film mainly relies simply on the natural atmosphere to build which echoes a certain sense of emptiness into the film. The musical score manages to achieve that same feeling, so it Is a nice addition to the film.\nLike I said, The Virgin Spring is a dated film. It is based on a famous Swedish ballad and is extended to feature length running time yet cannot transcend the fact that it has a limited story. It manages to capitalise on the complex themes and concepts that come with it which are handled powerfully by director Ingmar Bergman. Some may find that the slow pace of the film allows things to happen rather organically and that the classical film style is one of its major benefits, the same way that others may deem it to be an overly simplistic and slow film which did not survive the battle of age. My feelings lie in the middle because while I found the premise to be thin and the development to be slow, the nature of its story was good and the drama was handled well by Ingmar Bergman even if what he was working with seemed like it was stretched for a bit much.\nOne of the key themes in The Virgin Spring seems to be that either directly or indirectly, humans are inherently evil. The one character in the film who is essentially all good is Karin, and that becomes her downfall because her decision to always be a good girl ends up resulting in her untimely suffering and the unfolding of a more dark society around her. It reveals how even the slightest ray of light in life can turn the world into a darker place than before, and the pure darkness in that concept is one of the reasons that The Virgin Spring is a memorable film. It has no optimism but never ends up in melodramatic territory, and the way that it balances the hardcore nature of its drama is fairly impressive.\nThe atmosphere in The Virgin Spring is great. Although the story itself is a simple one, the atmosphere of the film is dramatic but also natural and makes the experience unpredictable. It gives audience the perspective of the character Karin who is innocent and is just coming to terms with the nature of the world. The world seems like a strange and somewhat dark place when the film starts, and it stays on the tone as the film progresses until it makes a sudden turnaround. The drama of the film is terrific.\nVisually, The Virgin Spring is also very nice because the lovely scenery of the film is captured with a lot of nostalgic cinematography while the art direction of the film echoes the time of the setting very well. It is easy to believe the story in The Virgin Spring because it is both firmly dramatic and visually realistic.\nThe performances of the cast in The Virgin Spring are also pretty firm. They aren't all that groundbreaking, but they make the film seem more realistic and therefore more dramatically effective. This is particularly present in Max Von Sydow who is able to make a complex and yet sympathetive figure out of his character as usual which means that viewers are able to see nearly eye to eye with him. He handles the raw drama of the film with a powerful display of human emotion, and you could expect nothing less from him. Max Von Sydow delivers a powerful performance in The Virgin Spring which proves to be essentially no challenge to him, and he delivers the language of the script so naturally that the realistic nature of the story is bound to make an impact in one way or another.\n\nSo although The Virgin Spring is a dated film with a lesser impact by today's standards, the complex nature of the atmosphere, the handling of the material by director Ingmar Bergman, the visual style of the film and the performance of Max Von Sydow manage to make up for it.",
            "review_date": "2014-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A virginal girl is brutally raped and murdered, and her killers unwittingly take refuge in her parents' home.\nSimply stated, this is Bergman at his best.  While there is a touch of the misogyny that Bergman featured in The Seventh Seal, as Birgitta and her sister turn into metonyms for light and dark female sexuality rather than fully fleshed out characters, the film nevertheless explore tough questions about the existence of God and humans' duties in response to cruelty and despair.  Is revenge ethically, morally, or religiously justifiable?  If God exists, why do bad things happen to good people?  Should we or can we celebrate a deity in a world this fucked up?  Filmmakers like Bergman aren't didactic enough to tell us the answers to these questions; instead, we get round characters who struggle with ethical dilemmas in intelligent and compelling ways.\nOverall, Ingmar Bergman is rightly celebrated as one of the world's best for good reason.",
            "review_date": "2014-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb Bergman morality play, with his usual stunning black and white photography. Von Sydow  is great and Brigitta Peterson simply radiant.",
            "review_date": "2014-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disturbing yet poignant in questioning religion by creating a situation that would make anyone lose faith.",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started the film without knowng much. I got skeptical when I saw that it was based on some story from the 1300's, but I've heard good things about it so I stayed with it.\n\nAnyhow, a poetic and pretty tense for it's age at least, must have been a shocker back then. I've read that \"The Last House on the Left\" is based upon this story. That makes sense, I guess. Quiet and simple but also beautiful and haunting. Also well captured of course. The story is very good, and is the best feature for me. Themes are anti-god in a way and the film is topped with a great ending. This is not especially entertaining but it will stay with you and that is often enough.\n\n7.5 out of 10 sips of warm ale.",
            "review_date": "2013-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great, indelible, and emotionally powerful film!  The dichotomy of brutality and beautiful in this film has forever stuck with me.",
            "review_date": "2013-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fifty years ago this movie was made. For that, it's originality, and the revenge films that copied it in the 70s and beyond, I give it 5 stars. Wes Craven's Last House on the Left (which started his career as a legitimate filmmaker) pays homage to this film. Pretty gritty stuff for 1960.",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly violent in parts, this is a well acted and typically brooding drama from Bergman.",
            "review_date": "2013-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A riveting experience, and much more graphic than I expected. This is the movie that \"inspired\" Last House on the Left. However here we are presented with a tale of faith, sin and redemption. Max Von Sydow is easily one of the greatest actors of all time.",
            "review_date": "2013-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful film if startling for the period. Bergman's the Virgin Spring is graphic where appropriate but nonetheless marked with an odd spirituality. Not easy to view but it should be viewed by a serious film viewer.",
            "review_date": "2013-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i watched this one just because i'm interested in seeing more films by director ingmar bergman. i had no idea what it was about and was surprised how much \"the last house on the left\" ripped off this film. i found it to be a really believable telling of the story, depressing and brilliantly acted and directed. a definite must see for film buffs.",
            "review_date": "2013-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is far from an easy picture to watch or entirely commend. For Mr. Bergman has stocked it with scenes of brutality that, for sheer unrestrained realism, may leave one sickened and stunned.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bergman's harrowing film that inspired Last House On The Left; a young girl is attacked and killed by a couple of goatherder degenerates.  Bergman plays around with Christianity and Paganism and the whole \"the Lord giveth and the Lord taketh away\" against the need for retribution.  It's a simple film but wonderfully made.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "gripping and scary in a way that most modern \"horror\" movies cannot even come close to.",
            "review_date": "2013-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Human only felt guilty after making a mistake.Too late for that isn't it?\n\nFather will hardly shown their love to their children,they mostly given a bad images,rare to meet a good one,I know.There is a part where Auntie Mareta(Tore's Wife) was worried about her daughter and non-stop praying to god hoped she will come back safely,yes,this is Mother's greatest love.While Uncle Torre is calm and comfort his wife and believed his daughter will return safely.However,when they found their beauty daughter is killed,Uncle Torre's act in the scene is actually wilder than the culprits,even kid has no mercy for him.So is this Father's Greatest Love,eh?\n\nDirector Ingmar's memorable and daring direction,leaving an unforgettable ending which I am still wondering why.Other than that,still have to give some credits to the costume,the music,the background and storytelling.A classic not to be missed.\n\nSo,girls,never-ever accept the request from stranger you never met,well,even your friends still can't be fully trusted,or unless you have a daddy like Uncle Tore.Devils are everywhere,even angels can be part of the devil too.",
            "review_date": "2012-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Film-making. Film-making is a beautiful legacy. A legacy that has been handed over from one generation of film-makers to another and there are countless \"good\" examples of that...\n\nRecently while reading an article related to renowned Director Ang Lee's upcoming epic \"Life of Pi\", Ang Lee in his interview mentioned Ingmar Bergman's Virgin Spring and how it had changed his opinion about cinema when he was just 18. It was also his first R film and he briefly explained how it had a huge impact on his life and how the subtly horrifying images of Virgin Spring totally stunned him. I was very intrigued. I have to check this film out, I told myself. I haven't seen many films of Bergman. My first was The Seventh Seal which I barely remember now and my second was Persona which I watched recently. So I decided to give Virgin Spring a higher priority and today I finally watched it.\n\nBeautiful. Flawless. Thought-provoking. Haunting. Masterpiece. I was left spellbound by the film but at the same time a little surprised at how underrated it is. Sure, I haven't watched Bergman's most well-known works yet so I won't say it's his best. But it surely and easily is one of his best! The Virgin Spring is haunting revenge story that not only questions our faith on God but also gives us hope. While experiencing this film, I felt a little like I was watching Akira Kurosawa's Rashomon again. Ingmar Bergman's direction is superb and, my God, the camera work, the acting everything is perfect.\n\nHighly Recommended. A clean 5/5.",
            "review_date": "2012-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original 'Last House on the Left' is a beautiful film. Slow, stark and shocking.",
            "review_date": "2012-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Virgin Spring is definitely one of the most haunting, and one of the most symbolic of all of Bergman's films. It aspires to be a spiritual journey into the deepest parts of our minds, as it makes the audience question the actions shown in the movie, but it doesn't give any answers itself. This spellbinding creation touches many important and controversial topics, such as selfishness, vengeance, superfluous brutality, sexual assault, and many notions connected with various religion (Paganism, Norse Mythology etc.). It's a deeply disquieting film, which tells a story about a unimaginably beautiful girl, who one day embarks on a journey to the church in order to light the Virgin candles. However, she never makes hit, because of two ruthless thugs, who rape and murder her in front of their young brother. And it's only the beginning. The whole shocking event makes way for a disturbing aftermath, as the killers unknowingly take shelter in the girl's parents' house. When the loving father realizes, who his guests really are, he goes berserk and finishes them off ruthlessly one after another. Even though it's human to say that killing is never the answer, some may argue whether his decision to be the judge and the executioner is justifiable or not. Fantastically paced and compellingly narrated, The Virgin Diaries proves to be a moralizing tale of the most brutal, and at the same time, most powerful kind, showing its purifying nature in the highly-aesthetic visuals.",
            "review_date": "2012-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that is stunningly beautiful, and horrifically real. I have rarely seen better use of a camera, and the writing is unbelievably detailed and layered.",
            "review_date": "2012-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well made but over praised",
            "review_date": "2012-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ingmar Bergman deals with an intense story in this disturbing, yet meditative film.",
            "review_date": "2012-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm best to leave it to the experts to decamp Bergman's Oscar-winning treatise on family, nature, sadism, religion, and forgiveness, but I'll say this: \"The Virgin Spring\" has Bergman giving dimension to the devil inside. It's about the presence of God in violence and darkness, the merits of sacrifice in mythology. How love transcends evil, even when you're doing evil out of love. And sometimes, when there's really no returning, all things must go, even those on the sidelines. It's what Peckinpah did with the great \"Straw Dogs\". \"The Virgin Spring\" offers no answers. Why Bergman's so great, is because his filmography is a like an epic poem it's too painful to read back. So you keep dictating and asking questions to keep going. Because when we don't have that, we don't have anything.",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When his daughter is raped by a group of hunting and gathering brothers, the father seeks revenge, and it comes to him.\nWhile the story isn't anything refreshing or extremely creative Bergman's directorial style makes it work. Whether it was the cinematography or the scenery in a directorial sense everything was perfect. The acting wasn't anything amazing or even anything good but the characters weren't really of strong focus to the film. It was more of justice in a 1300s small city, and it was delivered",
            "review_date": "2012-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't expect much of this. But, as always, Bergman has a way of making me re-fall in love with cinema, even though I already was. And I don't believe in God and almost all Bergman films are on that subject. Anyway, the plot, of course is simple, but a powerful plot in itself. Max von Sydow and Ingmar Bergman were essential to making this film a masterpiece, they are irreplaceable. The film is about forgiveness. The father was forgiving of the daughter even though she is lazy, disobedient and always gets her way. Then when she gets raped and murdered, the father leaves her sins way far behind his immediate actions. The film is masterfully shot, absorbing, brilliantly constructed, fiercely acted, and it's directed by Bergman.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest movie ever.",
            "review_date": "2012-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first Bergman! And what a brilliant, heartbreaking film.",
            "review_date": "2012-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm thinking this has to be where Wes Craven got the idea for his \"The Last House On the Left\".  Great movie, tragic story.  One asks just how often this happened in the medieval period and later went down under a fairytale?\nI don't believe that Odin answered the sister's prayer.  He is the protector of mankind, not the enemy.  One would more likely invoke Loki for such a terrible thing.\nIt was touching to see the family's reaction to this winter tragedy.  The father didn't hesitate to kill the child, yet he seemed not to feel much anger for the elder sister.  The ending is the best part, with the spring.  It's very metaphoric.  I would like to see more films like this, based in the medieval periods.",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bergman, one of the best fabulists in film history, concocts a typically bittersweet  tale of preserving goodness and purity of spirit in the face of life's - of nature's - cruel indifference. He again tackles impossible questions of God's role, of morality's place in nature, of faith's apparent ineptitude, but his decision to provide a true, hopeful possibility in place of an answer is satisfying, and the period setting lends the film a timeless quality.",
            "review_date": "2012-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really, really thought provoking.",
            "review_date": "2012-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, I get it... Innocent, brutalized, retribution, how did this happen... just wasn't that interesting...  and by the way, i just found the director is a guy....",
            "review_date": "2012-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "once again Ingmar Bergman knocks me over with his brilliance",
            "review_date": "2012-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fantastic film from one of cinema's greatest masters, Ingmar Bergman. It doesn't deal with its existential subject matter in quite the same as Bergman's other films, but that is made up for by gorgeous mise-en-scene. Another masterpiece.",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very symbolic film of a time when one god (Odin) is being sdiscarded for another (Jesus the Christ), and the struggle of humans to make sense of the existence of sufferning and evil, and the motivations of their gods.",
            "review_date": "2012-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes the sound of silence is the most powerful and impactful sound to use. This is the case in Bergman's Virgin Spring. The two most climactic scenes are the rape scene and the revenge on the rapist brothers. Both scenes utilize the sound of ambience. In combination with a under abundance of cuts, viewers are forced to sit and stare without the influence of music. These are real moments. No music would be playing in real life. Additionally, Bergman's use of lighting and camera angle are superb in these scenes but also throughout. The revenge scene is most notable in both of these techniques, though, because of the fire that is burning in the center of the room. There is a brilliant shot of Herr (Max von Sydow) burning inside about the rape and death of his daughter behind the flames of the fire which acts metaphorically and provides beautiful shadow across his face. Aside from technique, the film;s content is not the deepest that has ever been seen. A daughter is raped, the rapists seek hospitality in the daughter's parents house, and the Herr takes them down. It is a religious household but not even God could save the daughter. Bergman's direction is easily the star of this film.",
            "review_date": "2012-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quiet, provocative, beautiful and horrifying, Max von Sydow shows us the power of revenge over passive people when it takes hold and won't let go --Bergman matches it with his usual visual allegory as well as a scene involving a tree. One I'll never forget.",
            "review_date": "2012-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ingmar Bergman's films are declarations.  Declarations of doubt, declarations of fear.  Somehow in his confrontation of death, he tries to find the meaning of life.  In The Virgin Spring, Bergman revisits medieval times (as in 1957's \"The Seventh Seal\").  This time, the scene is a fourteenth century farm.  Töre is the landowner and patriarch of his little family which includes wife Märeta and daughter Karin.  The family, being devoutly christian, have an \"adopted\" family of farmhands and runaways, as well as one \"fallen\", heathen woman who is carrying an illegitimate child.  It's with her the story begins as she prays for Odin to come and curse the daughter Karin.  Karin is the perfect one, always getting her way, not having to do anything and getting spoiled by the masters of the house.  So when she and Karin are sent to the church to deliver the candles for the virgin mother's mass, she gets her wish most brutally answered.  \r\n\r\nWatching Töre's penance towards the end of the film, you have to wonder about the level of ritualism and meditation that precedes an act motivated almost entirely by blind retribution.  As observers, we can only feel sorrow at this destruction, regardless of what end it seeks to achieve.  What can we take away from the Virgin Spring?  That God, if he exists, works in mysterious ways?  That life is cheap?  That one's notion of existence can be swept away in one callous motion?  It's not enough to just exist, you have to know why you are doing it.  Once upon a time, we built churches to give our lives purpose, and to try and provide some higher understanding of why we were here.  With The Virgin Spring, we have a film etched hard into the celluloid, an artistic rendition of the question that plagues our human nature.",
            "review_date": "2012-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ingmar Bergman's films are declarations.  Declarations of doubt, declarations of fear.  Somehow in his confrontation of death, he tries to find the meaning of life.  In The Virgin Spring, Bergman revisits medieval times (as in 1957's \"The Seventh Seal\").  This time, the scene is a fourteenth century farm.  TÃ¶re is the landowner and patriarch of his little family which includes wife MÃ¤reta and daughter Karin.  The family, being devoutly christian, have an \"adopted\" family of farmhands and runaways, as well as one \"fallen\", heathen woman who is carrying an illegitimate child.  It's with her the story begins as she prays for Odin to come and curse the daughter Karin.  Karin is the perfect one, always getting her way, not having to do anything and getting spoiled by the masters of the house.  So when she and Karin are sent to the church to deliver the candles for the virgin mother's mass, she gets her wish most brutally answered.  \n\nWatching TÃ¶re's penance towards the end of the film, you have to wonder about the level of ritualism and meditation that precedes an act motivated almost entirely by blind retribution.  As observers, we can only feel sorrow at this destruction, regardless of what end it seeks to achieve.  What can we take away from the Virgin Spring?  That God, if he exists, works in mysterious ways?  That life is cheap?  That one's notion of existence can be swept away in one callous motion?  It's not enough to just exist, you have to know why you are doing it.  Once upon a time, we built churches to give our lives purpose, and to try and provide some higher understanding of why we were here.  With The Virgin Spring, we have a film etched hard into the celluloid, an artistic rendition of the question that plagues our human nature.",
            "review_date": "2012-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touches on profound existential questions but too crude in acting, etc. for my liking.",
            "review_date": "2012-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another dark, ambitious triumph from Bergman. At times I am surprised at just how modern his films can be in terms of the use of violence or graphic themes, but maybe that comes from being used to primarily having watched British or American films from this era. Hollywood in the fifties would certainly have baulked at the rape scene displayed here. Max von Sydow is quickly becoming one of my favourite actors as he's been excellent in every Bergman film I've seen him in. But it's some of the imagery and its framing that really make this film, with the brutal beauty of some scenes adding even more power to the subject matter.",
            "review_date": "2012-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've always wanted to see this movie as it is what inspired Wes Craven to make The Last House on the Left.  The synopsis is the same.  A daughter is brutally raped and murdered, then the attackers seek shelter with the girls family, although they don't know that's who it is.   \nThis film, while not anything remarkable by today's standards, was beautifully filmed, and really captured the harsh life of a family of farmers in 14th century Sweden.  Ingmar Bergman seemed to do very well showing how powerful religion was for people cut off from much of the world.  Max von Sydow was cast very well as the father and Birgitta Pettersson played a beautiful Karin showing how naive a young virginal sheltered girl may have acted back in the 14th century.  There is always a mistrust of people in modern times that I don't think many had back then, especially in more quiet areas, so it's easy to see why she would not suspect something was amiss....until she sees for herself, but by then, it's too late.\nWas this film disturbing?  I imagine for 1960, it could have been.  It was brutal to see both what happened to Karin and just as brutal to see Sydow get his revenge.  \nI enjoyed this movie but I don't think most would unless they have the same desire I do, which is to watch films to see where other get inspirations.",
            "review_date": "2012-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An older movie, Very well directed.  Not a movie for people who are in movies strictly for hollywood crap.",
            "review_date": "2012-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All Bergman films are dark, disturbing and powerful and The Virgin Spring is no different in those respects, but it is different in a way I can't quite put my finger on.",
            "review_date": "2012-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite simply a masterpiece (bergmans first but not his last). The subject is very grown up and quite shocking and the tone is dark and oppressive. You will be haunted by this tale of destruction, murder, revenge and abandonment. And it's beautifull.",
            "review_date": "2012-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the great atmospheric horror films, and an Academy Award winner for Best Foreign Film.  The same story was updated for Wes Craven's LAST HOUSE ON THE LEFT, but Bergman got it right.  The master director doesn't spend a lot of screen time lingering on a girl's rape and murder.  The film instead focuses on the nature of faith and the father's (Max Von Sydow) pagan vengeance, but Christian resoluteness.  Actually based on an event that inspired a church to be built.  Tragic and profound.",
            "review_date": "2012-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite good, with very striking visuals. Bergman's use of black and white is brilliant, and although the pacing is a little slow at times it is still undoubtedly captivating. The performances throughout are also worthy of a mention, particularly Max von Sydow.",
            "review_date": "2011-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've only seen about 5 Bergman movies so far and it's already clear his movies are going to look outstanding, the story will be timeless and it'll make the wheels turn. The Virgin Spring is no exception. In any other filmmaker's hands the ending would be contrived, with Bergman it's heavy, touching and utterly brilliant.",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first Bergman film.  Both beautiful and brutal.  Enjoyed the spiritual questions it explores.   Highly recommended.",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In one of his most widely known and controversial films, Ingmar Bergman raises many deep seeded questions. The Virgin Spring offers intelligent insight into justice, vengeance, Gods role in the universe, and so many other areas of faith. Like so much of Bergman's work, this is his personal thoughts and questions displayed on film with luscious cinematography and performers who embody his rich concepts. The ideas and suggestions are strong, just as they are in The Seventh Seal. God, religion, and our bare human behaviors are core areas covered in such films. This was Bergman's first Academy Award winner for Best Foreign Language Film for 1960 and it stands out in an already superb library of fascinating films by the Swedish master director.\r\n\r\nMax Von Sydow and Birgitta Valberg are loving, proud parents who dote on their young daughter (played by Birgitta Pattersson). The Christian family is a happy one and when young Karin (Pattersson) sleeps through church service, she is then tasked to take candles to the church for her mother as a light penance. Along the way, the naive girl is savagely attacked and killed while her servant (Gunnel Lindblom) watches in horror while hiding. The three attackers soon seek shelter at Karin's parents home. During their stay, Karin's cloths are discovered and the servant who witnessed the atrocity confesses what she saw. Now the loving parents are angered to the point of murder...or is it justice? \r\n\r\nBergman is a director who really captures my interest and I want to see as many of his films as I can. This being the 6th one I've seen, I think it might be my overall favorite so far. It is very simple as far as plots are concerned but the way it raises questions is marvelous. Why did a horrible thing happen to a good person? How can a father atone murder? How is the startling and beautiful ending explainable? These are just a few ideas that the story offers us to think about. I admire the risk that this film took and it dares to ask some unsettling questions while offering the freedom to answer and judge for one's self. One of Sydow's most uninhibited scenes is when he crumbles and growls that he does not understand God, yet retains his faith. This moment is then followed by something truly unique and puzzling. The Virgin Spring is a loaded experience and it is as haunting as it is spiritually perceptive. (A)",
            "review_date": "2011-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully realized tragedy, and one of the few films Bergman directed but did not write. The black and white photography from Nykvist pops off the screen, while Von Sydow appropriately looks cut from an ancient religious icon. The film is built on a visually-oriented language that highlights shadow and closed spaces. Only in the final moments, when Von Sydow awkwardly collapses in front of the stream, do we get any real sense of freedom of movement.",
            "review_date": "2011-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feels like some kind of parable or dark fairy tale. It's also like directly watching a director trying to overcome his religious upbringing through his film(s). It brings up some interesting themes.",
            "review_date": "2011-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remade twice (both times under the title The Last House on the Left), this is a drama set in medieval Sweden about a deeply religious man who seeks revenge after his daughter is raped and murdered. Unlike the remakes, this is more of a drama than a horror film, although the events that take place are horrific. The way they are handled is makes it distinct. \n\nThe big push here is this film's focus on themes of religion, forgiveness, faith, heavy questions about the nature of crime and punishment.  In a way, and I'm not trying to  diminish the film here, you could possibly call this (if you had to) an arthouse exploitation film. Because really, it is art, it just happens to be punctuated byt two very strong (but surprisingly tasteful (as it were)) scenes of violence. \n\nI loved this movie because it has Bergman's traemark playing around with light and shadows, and gorgeous cinematography, and the participation of his long time collaborator Max von Sydow (who is excellent). It has wonderful atmosphere, and everything is made more effective and unsettling due to the lack of a soundtrack (most notable during the violence) and the fact that the film doesn't ever go out of its way to see creepy or frightening. Everything is very peaceful, quiet, and serene, and that is far more intense than being overtly gritty. \n\nThe version I watched had an introduction by Ang Lee, and he really does a great job of explaining the film as being so powerful and moving because of the things I've mentioned above, and because the film is an overall classy affair despite the subject matter. Now, I'm giving this the same rating I gave to the first The Last House on the Left, but that doesn't mean the films are equal. In fact, you really can't put them in the same league, despite their similarities. They are both great in their own way. One just happens to be an artsy film with strong symbolism and heavy themes awhile the other is a gritty, disturbing, and unrelenting exploitation thriller (yet still has some subtext).  As a film overall though, I think this one is better, as I see the other working better as more of an experience than as a movie.\n\nYou should definitely give this one a watch, It's some great stuff.",
            "review_date": "2011-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is quite possibly Max von Sydow's best work. The message behind the film along with the intense nature of the subject matter makes this film a true piece of art. It is a must see for anyone who loves film.",
            "review_date": "2011-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spouses Töre (Von Sydow) and Märeta (Valberg) are poor, but devout Christians, and in a daily routine, they send their spoiled but sweet daughter Karin (Pettersson) to send candles to a church, with their foster daughter Ingeri (Lindblom) at her side. Along the way, however, the two encounter a trio of travelers, and they trick Karin and then rape and murder her, but Ingeri manages to escape. The killers go to Karin's house for food and shelter soon after, and they try to sell Karin's fancy clothes to Märeta, and when Töre finds out, he plans a fitting revenge. \"Jungfrukällan\" isn't always considered among Bergman's top five films, however, it is always considered to be one of his most controversial movies, which includes a rape scene (though pretty tame by today's standards), a strange look at religion, revenge, and violence. Unlike many suspense and revenge films, the heart-pounding stuff is never too violent or scary, and just comes to show that even a film as quiet as this can just be as powerful as any thriller. Like director Ang Lee says, his films never entertain, they just make you think. This to me, leaves a mark in Bergman's rep, and I believe that this was the film that I think gave him legendary status. The depth of everything from the characters, the scenery, the music, and the cinematography match the story perfectly, and even if it's not on purpose, it makes the film seem so much more genius and planned out, and make Bergman's style seem ever better. The acting is awesome too, especially from Von Sydow and Lindblom who really step out from what you can call a normal role. \"Jungfrukällan\" is an excellently made film that I think is not Bergman's best, but one of his most powerful.",
            "review_date": "2011-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hummm. Ingmar Bergman. I'm a film fan so why have a never seen a Bergman film?  I'm just stubbon i guess. I tend to shy away from things where the many are saying you have to; read this book/seethis film/watch this director, hence i've never read The Da Vinci Code and i only recently watched Citizen Kane (very good film, well ahead of it's time but not the best film ever made by the way). Eventually i'll come around, like i did with CK and sometimes it is circumstance (although i'll never read the Da Vinci Code based on the couple of paragraphs i read over the shoulder of a train commuter). Such it was, that i can to watch Virgin Spring and i have recorded 2 other highly regarded films, as they have had a Bergman season on Film Four.\r\n\r\nWell this certainly was an auspicious start, although i don't believe that the historic, even farytale setting used by Bergman is his usual style. While what we are actually seeing is a fairytale or folk tale unfold, the themes are modern, Religion, sex and innocence, revenge and redemption. Needless to say i want to see more Bergman films before i get an idea about what he as a director may be saying here, but also that is not necessary becuase the events and symols presented in the film are open to interpretation and arguement, and still are over 50 years after the film was realeased, which is truely the test of how great a film or a director really are surely.\r\n\r\n To that i'd just like to add that the cinematography is beautiful. I've never seen black and white look more alive and I've been a fan of Max Von Sydow for some time but i'm only really familiar with him in his later days in Hollywood fare, This was quite a revelation seeing a vital dominating Sydow in the full vigour of youth and has certainly enhanced my appreciation for him.",
            "review_date": "2011-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome Bergman of revenge and faith.",
            "review_date": "2011-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, lyrical ... as always... !!! Perhaps the only tale of vengeance from Bergman that questions faith and the necessity of revenge itself. The murder of innocence and another in avenge ... it reminds me of the faith trilogy and also The Seventh Seal somehow...",
            "review_date": "2011-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Swedish with subtitles. Black and White. Worth a watch.",
            "review_date": "2011-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised to see how many other people had rented this movie from Spin It. Then I realized that \"The Last House on The Left\" was kind of inspired by it, thus the unnusual interest in the old black and white sweedish film. However, where Wes Craven was interested in highlighting the revenge-fantasy aspect of it...Bergman is interested in the guilt felt by the main protoganist after avenging himself upon the killers of his daughter, and his angst over his inability to understand how God could let this happen. In Bergman's film, there is no catharsis offered by violence or revenge..only more questions that he is unable to answer for himself.",
            "review_date": "2011-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's easy to see the inspiration behind The Last House on the Left and I Spit on Your Grave, the films that popularized the rape revenge sub-genre, in The Virgin Spring, unfortunetly that's one of the most interesting things about the film. As expected, the cinematography and themes are the best points but the film is bogged down with far too many awkward scenes and what should be the main shocking point leaves no impact at all.",
            "review_date": "2011-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic.  Bergman again directs an superbly filmed and acted movie.  The story is one of faith and the interplay between imperfect humans.  This is not an easy watch but there is beauty within the story.  It's hard to know what to say about it so I will leave with the opinion that this is an amazing film.",
            "review_date": "2011-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rarely has any director done so much in so short a time, or achieved such depth with a story of such simplicity, as Ingmar Bergman in the Virgin Spring. This film, adapted from a medieval ballad, tells of how a fair young maiden was raped and murdered in the forest, and the perpetrators came to spend that very night in the home of her parents. This may sound like the premise for a gory horror film- in fact Wes Craven would later remake this as the shockingly graphic Last House on the Left- but with Bergman there is no question of resorting to shock value, everything is treated with the seriousness and dignity it deserves.\r\n\tThere's little more to the plot than what I've already said. Where this film gets its power is from the depth of the characters and their emotions. Karin, the daughter of a wealthy farmer, is one of the purest, most innocent, and most naive girls I have ever seen. She can be a brat, and is the life of any dance, but could never imagine that anyone would hold impure motives or wish her harm. Even as her killers remark upon her beauty, she cannot fathom that she is in any danger 'til it is far too late.\r\n\tThe family's servant girl, Ingeri, is Karin's polar opposite. Ingeri is caustic and resentful, her visage scared from a hard life, and her belly swollen with child. She hates Karin with a burning passion which seems born of jealousy. The first time we see her, she is praying to Odin that great misfortune will befall Karin. I can hardly guess what she's been through to make her so embittered at her age, but I pity her.\r\n\tKarin's death is shown openly but not graphically. No doubt is left of what happens to her, or of her assailant's depravity, but there is no nudity or attempt to shock the viewer. The father's revenge is handled in the same manner. The rouges die violently and painfully, but it is done quickly, and with a minimum of blood and gore. They got no less than what they deserved, or at least the older brothers did. The father goes too far in killing the younger brother, who was no more than a child himself. But he realizes this as soon as his rage is passed, and is filled with remorse for what he has done.\r\n\tWhat left the greatest impression on me was the ending, in which the family sets out to retrieve their daughter's body. Bergman does a masterful job of showing how the father, the mother, and even Ingeri deal with their grief and their perceived guilt as they travel the forest path. But even more powerful is the father's action upon finding the slain body of his only daughter. Falling to his knees he breaks down and shouts to the heavens \"You saw this...  You allowed it to happen. I do not understand you. I do not understand you, but still I seek your forgiveness. It is the only redemption I know. \r\n\tIn the midst of great tragedy, when he has every reason to despise life and doubt God, he instead turns to faith, and from loss comes renewed commitment, and a symbol of new life. This is what makes Bergman's The Virgin Spring a truly great film.",
            "review_date": "2011-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seriously disturbing, yet strangely profound.",
            "review_date": "2011-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a good movie to watch while you're waiting for the end of the world to happen. It is an extremely bleak and critical look at religion and how God allows evil things that happen to good people. This was the basis for Wes Craven's 1972 horror film, \"The Last House on the Left.\" While Craven's film was definitely darker and more difficult to watch, \"The Virgin Spring\" nonetheless leaves you feeling empty inside. It does, however, leave off with a symbol of hope and the idea that good can come out of even the worst of situations.",
            "review_date": "2011-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Art house version of the same story from Last House on the Left. In fact, Last House on the Left is close to an exact remake of this film. This film spends a little to much time on the girl and she is not that likable. The fathers revenge is well played. The biggest difference in this film is that a child is involved with the rapists. This makes the fathers revenge even more horrific. Max von Sydow is always great.",
            "review_date": "2011-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deeply unsettling and powerful.",
            "review_date": "2011-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most symbolic and emotional movies you will ever see, and more than likely one of the best. Max Von Sydow's performance as the religious and vengeful father is one of the best when it comes to conflicts of feelings over beliefs.",
            "review_date": "2011-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This revenge drama feels very familiar, but it is very well done here.  Bergman utilizes lighting and shadows to great effect, and gives a vivid depiction of rural medieval Sweden.  The violence is handled  very well--it is neither exploitative nor does the film shy away from depicting violence and showing the humanity of its victims and its perpetrators.",
            "review_date": "2011-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of all time. Visceral, gloomy and insightful. Perfect art, perfect direction, perfect acting. A must-see to all cinephiles.",
            "review_date": "2011-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If the plot seems familiar, than chances are you've seen Wes Craven's Last House on the Left. Virgin Spring did indeed serve as the basis for that reviled/revered horror film, but the former is certainly more effective. Bergman's use of long takes and silence craft a disturbing aura, all with minimal violence (despite an intense-for-the-time rape scene). You could see the film as a bit too simple in it's storyline, but it's hard to argue that Bergman has any more to say.",
            "review_date": "2011-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "last house on the left only a better version of it.",
            "review_date": "2011-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As Ang Lee nicely said: \"A microscopic zoom-in into humanity. Some movies make you laugh, some make you cry, but Bergman's movies make you think!\"",
            "review_date": "2011-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "simple and unsubtle, but really powerful.",
            "review_date": "2011-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rape scene makes it. Ending ruins it. Does anyone want to watch Last House on the Left with me? Just kidding. But not.",
            "review_date": "2011-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely depressing and very graphic for when it was released.  Hits on big questions about the nature of evil, retribution, and the use of God as a mechanism for allaying guilt and pain.",
            "review_date": "2011-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another one of Ingmar Bergman's wonderfull black and white pictures. THis must be one of his most darkest , most dreadful and most horrifying creations.\r\n\r\nThe Virgin Spring is set in the midieval where a prosperous christian virgin is headed for the church one sunday. Her pregnant foster sister, who is a basterd child, does not follow her as planned and it leads to big consequences without proportion, and beyond all evil.\r\n\r\nThis is one among the most gruesome and filthy out of Bergman's fine colletion. Absolutely worth to check out.",
            "review_date": "2011-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Apparently this got remade into horror movies? Or rather, the tale on which it was based was also adapted into horror movies (I forget which one exactly) (the other reviews tell me it's The Last House on the Left).\n\nAnyway, this is probably my second favorite Bergman so far, next to The Seventh Seal.",
            "review_date": "2011-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When it comes to tales of revenge, there are few finer than this. With an incredibly well paced build up, this is one of the most visually disturbing pieces from Ingmar Bergman. Any fans of The Last House on the Left should check this out, due to it essentially being a medieval rendition of the story. It contains what might be the greatest feats of strength one man has displayed on camera. Max Von Sydow kills three men practically with his bare hands via burning, stabbing and raising someone above his head and throwing them. Him playing such a peaceful and religious father one minute and a warpath the next is a little shocking and a ridiculously well done tactic in terms of character development. \nAs always with Bergman, this is a truly beautiful looking movie. Every shot is so well composed and captures the landscape and characters so well. It sort've becomes the third part of the unofficial trilogy, also consisting of The Seventh Seal and The Magician. All are period pieces revolving around a group of characters having to face death in some form. In my opinion, these are Bergman's three greatest movies. They deliver on every level and seem to have endless life.",
            "review_date": "2011-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful film. Bergman at his best! A huge inspiration on the original 1972 version of THE LAST HOUSE ON THE LEFT (a favorite of mine). This film; however, is cinematically superior. The camera work, the mood, lighting, and acting are nothing short of incredible!",
            "review_date": "2011-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This influential revenge film is about faith more than anything else. I found it to be one of Bergman's weaker efforts because of its simple and unsatisfying conclusion. The director did not write this film and made much better films about faith later in his career.",
            "review_date": "2011-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant, tragic, heartfelt story that will move all who see it. This is a movie I would strongly recommend to anyone especially lovers of classic cinema. The only other Bergman film I have seen is The Seventh Seal which is also outstanding. This movie was extremely troubling to me not only because of the brutal act but also because Karin did not deserve this. We have a young innocent naive girl whose trust was betrayed. The acting, directing, story, cinematography is simply flawless. Haunting and superb.",
            "review_date": "2011-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant, tragic, heartfelt story that will move all who see it. This is a movie I would strongly recommend to anyone especially lovers of classic cinema. The only other Bergman film I have seen is The Seventh Seal which is also outstanding. This movie was extremely troubling to me not only because of the brutal act but also because Karin did not deserve this. We have a young innocent naive girl whose trust was betrayed. The acting, directing, story, cinematography is simply flawless. Haunting and superb.",
            "review_date": "2011-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a stunning Ingmar Bergman film. Set in 14th century Sweden, it tells the story about Karin who is brutally raped and murdered before the perpetrators unwittingly arrive at her parent's house asking for shelter. Whilst there, they offer the mother clothes allegedly belonging to their dead sister in exchange for payment. Instantly recognising them as the clothes she had dressed her daughter in that day before she went missing, and seeing the blood stains on them, she alerts her husband (Max Von Sydow) and they take little time in deciding the fate of their guests.\n\nUnlike the infamous Last House On The Left (which although cites Virgin Spring as an influence, it is more of a remake), Bergman's family are god fearing and the violence is not sustained longer than it needs to be. There is contemplation and regret and the scenes in which Von Sydow prepares for his acts of revenge by self flagellation with such vigour, followed shortly by him sitting patiently awaiting dawn, contrast vividly from the happy and loving father of the beginning of the film. So too does the scene at the end of the film, when confronted with his daughters body.\n\nEven with the level of violence in today's films, Virgin Spring holds its ground and stands the test of time. Perhaps the purity of Karin's innocence and naivety when meeting her murderers increases the power of the crimes they commit, and perhaps her parent's religious pursuits increases equally the power of their revenge.\n\nThere is a magical simplicity and charm to Virgin Spring that is contrasted by dark and suggestive sub-plot lines. There is the jealous and unruly step sister Ingeri who is pregnant without a husband; the social activities of the perhaps not so innocent Karin; the scene with the bridge keeper in which he offers shelter to Ingeri and yet his motives seem all too sinister; and even that Ingeri prays to Odin, and does not follow the religious beliefs of her parents. \n\nUltimately these contrasts add depth and complexity to the story and complement the natural beauty of Karin and the locations where she lives and journeys, with an undertone of discomfort and evil.",
            "review_date": "2011-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The pictures are great - as always by Sven Nykvist. And scenography, medieval decorations, acting (very theater, but it's tipical for Bergman's and I like it). Intense, powerful, significant ugliness. Good and evel, corruption and innocence, enlightenment and ignorance, spirituality and animal (human) instincts. Parental love moved to a crime, even the deepest faith i god won't stop the father. Where thefaith gone? What should he do? Where was the mistake??? Where was the error?",
            "review_date": "2011-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bergman's films are heavy on symbolism. Sometimes it's very heavy-handed symbolism, and this is one of those cases. The story is not all that compelling. Characters are black and white, there is no grayness such is to be found in Bergman's masterpieces like \"Cries and Whispers.\" That said, his visuals are powerful as always, including a mesmerizing shot of a man wrestling a long, skinny tree to the ground, the tree and man framed dead center screen with the rising sun in the background. He was an expert at making the ordinary seem beautiful.",
            "review_date": "2011-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know. Sometimes I love Bergman. And sometimes he makes movies like this...\r\nHm, only reason I give this a \"fresh\" rating is Max von Sydow's masterful performance.\r\nThe rest of the movie is a little uninteresting.\r\nThe last 20 minutes, however, totally rock. That's one of those moments where I love Bergman again.\r\nAnyway, the good and the bad things in this movie compensate for each other. That makes it only a mediocre film.",
            "review_date": "2011-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Last House On the Left' is definitely a reboot of this movie (although with less religious imagery). Its super messed up, especially for 1959!",
            "review_date": "2011-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ingmar Bergman's adaptation of an old Swedish ballad, which in turn inspired Wes Craven's gorefest \"The Last House on the Left\". An interesting case of how the same basic story (it really is very similar) can still become two completely different stories depending on how it is told. \n\nBergman forces the viewer to question innocence, guilt, right to revenge, faith, fate, a parent's love, sibling rivalry & - in its barest essence - Right or Wrong.  Though not a masterpiece beyond compare like \"The Seventh Seal\" or \"Wild Strawberries\", \"The Virgin Spring\" is a wonderfully provocative work from one of the undisputed masters of Cinema.",
            "review_date": "2011-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bergman is a poet. There are certain scenes in here that brand your memory bank like a cattle iron.",
            "review_date": "2010-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good Bergman film, that has great performances and a terrific climax/resolution.  However, the first half is slow and takes too long getting to where it's going.",
            "review_date": "2010-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know if I've ever felt or seen the range of emotions that this film portrays. Loss, anger, guilt, remorse, vengeance, lust, rage, love, hatred, jealousy....this film is a roller coaster. A heavy ride, it weighs you down, lifts you up and then pulls you down again. There is a freedom and purity of the whole environment: actors, settings, dialogue that feels very very real. Bergman displays animal brutality here, and obsessive love, and almost everything that makes us human. I almost shed a tear at the end and the poignancy of the whole final act. I liked the use of music, well, laymen would say lack thereof but I'd beg to differ. All the music in the film, the little there was, was initiated by the characters, it was an element. Overall the film's linear, nothing fancy, yet is very close to perfect, the story itself is the centerpiece here and bergman frames and hangs it flawlessly.",
            "review_date": "2010-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By Odin!! That's what i call getting medieval",
            "review_date": "2010-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not much on violent scenes in films, especially violent rape/murder scenes. This is why I can't let myself watch Gaspar Noe's \"Irreversible.\" This is why the thought of Zed in \"Pulp Fiction\" makes me cringe. \n\nHaving seen a few of Bergman's films: The Seventh Seal, Persona...it's noted that he favors symbolism, the questioning of God's existence; themes of nature, purity, depravity. I knew the premise for \"the Virgin Spring,\" before watching it; for the most part, it still made me uneasy. \n\nThe dread was impenetrable, suffocating...the victims innocent, the hostility and jealousy for the innocent, too true, too real; the honesty was beautiful and ugly, and I felt tense in the duality of it all. My face held the look of concern. My stomach cramped. I felt despair for lack of feeling sad or sorry for any of the characters. \n\nThen I too shared the guilt of resenting the girl who was murdered, for being so naive, so trustworthy going into the deep, dark woods and offering her company to the shadiest of desperate men. \n\nBergman, in the end, had won. He's warped and conflicted my feelings and made me ask myself whether or not I was a good human, or if I had faith in anything substantial. But it was probably a good time for that anyway.",
            "review_date": "2010-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bergman's thought-provoking,emotionally raw,beautifully lensed film challenges the human condition on our need for a spiritulal existance",
            "review_date": "2010-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It seems like cinematic heresy not to rave about an Ingmar Bergman film... especially one that won him an Oscar... however although the film is beautifully shot and has some fantastic historical detail as a whole it just doesn't posses the indefinable magic of a classic",
            "review_date": "2010-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Shakespeare-like Tragedy which shows the Naturalistic Beauty and the Animalistic Brutality of the Middle Age",
            "review_date": "2010-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect. Words fail me. Powerful, haunting, and stunning. A masterpiece.",
            "review_date": "2010-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm thinking this has to be where Wes Craven got the idea for his \"The Last House On the Left\".  Great movie, tragic story.  One asks just how often this happened in the medieval period and later went down under a fairytale?\nI don't believe that Odin answered the sister's prayer.  He is the protector of mankind, not the enemy.  One would more likely invoke Loki for such a terrible thing.\nIt was touching to see the family's reaction to this winter tragedy.  The father didn't hesitate to kill the child, yet he seemed not to feel much anger for the elder sister.  The ending is the best part, with the spring.  It's very metaphoric.  I would like to see more films like this, based in the medieval periods.",
            "review_date": "2010-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The master guides us through this heartbreaking tale with a delicate hand and a gorgeous, poetic touch. It's actually one of his simplest and most moving works a film to be savored and pondered.",
            "review_date": "2010-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of Bergman's best and most imitated. The sorrow and isolation felt in this family after the daughter's brutal rape and murder is gut-wrenching and the father's justice towards the killers is simultaneously satisfying and sad. A must see!",
            "review_date": "2010-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was brought to my attention because someone said it was \"the film Wes Craven ripped off when making The Last House on the Left.\"  I'd replace \"ripped off\" with \"improved\" personally. I have nothing against older movies or even foreign language films, but this didn't work for me.",
            "review_date": "2010-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starring the always (and still) great Max Von Sydow. Won 1961 Oscar for Best Foreign Language Film, is the inspiration for Wes Craven's classic thriller \"The Last House On The Left\", as well as the recent remake.\r\n \r\n\r\nTÃ¶re: You see it, God. You see it. The innocent child's death, and my revenge. You allowed it. I don't understand You. I don't understand You. Yet, I still ask your forgiveness. I know no other way to live. I promise You, God... here on the dead body of my only child, I promise you that, to cleanse my sins, here I shall build a church. On this spot. Of mortar and stone... and with these, my hands.",
            "review_date": "2010-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best Bergman I've seen so far, but I still didn't like it.\n\nIt was just stupid. I was impressed with the rape scene, which I thought was fairly graphic for its time. But, it was too preachy. I liked Last House on the Left because it was... probably because it was graphic. I just didn't feel for any of the characters and I didn't like the era it was set in.",
            "review_date": "2010-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely shattering emotional experience. Can we justify violence? Vengeance? Why would God watch while we suffer? A masterpiece.",
            "review_date": "2010-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "beautifully directed and edited. surprisingly harrowing given the 1959 release date. the medieval religious content was hard for me to relate to but still thoughtfully rendered. i enjoyed the moment where the father seemingly blames his pagan, wild foster daughter but is actually blaming god for the atrocities others and now he himself has committed. the phallic imagery is pretty rampant. the rape and murder don't convey the appropriate level of sadism and torture, yet the acting is all stylistically appropriate.",
            "review_date": "2010-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film whose esteem rises in response to reflection that adds layers to the more simple entertainment of the first digestion, right from the opening shot the viewer knows they are watching a beautifully crafted film. Some stellar performances delight with depth of expression without falling into melodramatic exaggeration.\r\n\r\nA simple film with deeper context of dogmatic questions finding answer with brutality, revenge, penance, and a miracle that leaves things to consider long after its finish.",
            "review_date": "2010-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe I gave it so low a score because it just isn't what I'm into. I'm just not one for movies with people getting raped, but then again no one really is. I thought it was kind of slow, but it was intriguing.",
            "review_date": "2010-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense, thoughtful, beautiful and everything else that Wes Craven's remake isn't.",
            "review_date": "2010-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was soo beyond its time ... Black and white \r\nMovie about a beautifull blonde girl pure and untouched by man who is Violently Raped ... great classic Must see...",
            "review_date": "2010-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a spell bounding story of a father avenging his girl's rape and demolishing the rapers in complete vengeance only to realise that this act of avenge will not pay him back his daughter.\nInnocence got stripped in front of Satan himself.This story emotionally draining and superbly done by Bergman.I hate to see this turned into a horror flick.\nThis remains a classic artistic presentation of Bergman questioning many beliefs, asking us to delve down in the meaning and the religious distinction of good and evil, and it really matters who wins in the long run.",
            "review_date": "2010-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Compelling, disturbing at times despite simplicity, this is yet another work of genius from IB.",
            "review_date": "2010-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most beautiful and infuriating (not in a good way) films I've ever seen.",
            "review_date": "2010-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story of a horrible and profound prelude to a miracle.  I refuse to review Bergman.  His existential medievalism is at once deeply disturbing and hauntingly beautiful.  Every character--every character's every movement, in fact--carries its symbolic weight.  And gracefully.  What a genius.",
            "review_date": "2010-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a heartbreaking film, filled with religious symbolism as a young virgin is raped and murdered (The Last House on the Left movies are based on this).  All around terrific cast, and a fine piece of cinema mastery.",
            "review_date": "2010-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After a second viewing, I can't say I saw things in the movie that I hadn't seen before (maybe I did it was a long time ago), but I certainly enjoyed it more. It had the usual power of Bergman's black and white movies but the story was easier to follow than The Seventh Seal or Wild Strawberries, my two favourites of his. The movie didn't change but I certainly did, I think this was the fourth movie of his that I saw, but since then I have seen at least 7 more and have developed and even more of a liking for his style. the look, the mood, everything was spot on.",
            "review_date": "2010-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know it's a slow fifty years old black and white film from Sweden, so you'll have to read subtitles. But it's worth it.",
            "review_date": "2010-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on a 23th century ballad and later remade by Wes Craven as The Last House on the Left, Bergman's The Virgin Spring is one of his best, questioning and exploring religion, morality and justice through a ponderous tone and stunning lasting visuals by Sven Nykvist. The controversial scene certainly remains disturbing due to the matter-of-fact way it is shot, making it un-sensational but powerful. The entire film is nakedly told and balanced out by the cinematography which is rich and empty, visceral and concentrated. The film carries a lasting effect; I cannot stop thinking about it. I would rank this with the very best of Bergman's work which I have seen along with The Seventh Seal, Persona and Cries and Whispers. \r\n\r\nCheck out my film blog Cinema Enthusiast! www.cinemaenthusiast.com",
            "review_date": "2010-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movies depend hardly on \"what\" and thrive instead on \"how\" and \"why.\" This is one of the best movies.",
            "review_date": "2010-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bergman and his best!",
            "review_date": "2010-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Ingmar Bergman film....deserving of its 1960 Oscar....once seen never forgotten",
            "review_date": "2010-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Austere and powerful tale of rape, murder and revenge set in rural medieval Sweden; only a truly great director like Bergman can make such remarkably simple action, story, and dialogue so captivating",
            "review_date": "2010-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most serene and quiet movies to show rape and murder. In the intimate spaces of the small mansion, the forest glade and the hunter's hut, passions of religious devotion, lust envy, and vengeance seethe throughout Bergman's film. Max von Sydow exquisitely calibrates the range of emotions that his character must endure.",
            "review_date": "2010-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bergman can beat the existential horse to death once in a while (Winter Light), but not here.",
            "review_date": "2010-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1960\tSweden\t\tDirector: Ingmar Bergman\r\nScore: 7\r\n\tHey I found it, the real origins of Wes Craven's film The Last House on the Left.  Seriously, here it is.  This movie tells the story in a much more artistic way and places it in the era of the original fable, 14th century Sweden.  This Oscar winning film (Best Foreign Language Film-1960) takes its time to set up our characters, but with out gory SFX or nudity the rape/murder scene is still gut wrenching and the revenge killings are still shocking and brutal.  The acting is not too bad.  Max von Sydow is the main shining star of the cast as the devout and vengeful father.  The effects are well done for the period and they get the point across with out buckets of stage blood.  The music score is good enough, though nothing special to be honest.  I thought for a long time that Wes Craven's shocking exploitation film was original.  Now I know that it has very high brow roots in this Academy Award winning depiction of an old Swedish fable.\r\n\r\nNotes: HV-BN-SV\t\tSuggested Age: 13+",
            "review_date": "2010-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Third Bergman flick I've seen and the third near perfect one in a row, I might just be onto something here. A masterpiece that's not quite as much of a masterpiece as the director's earlier triumph The Seventh Seal but comes damn close. All in all an emotionally draining yet rewarding experience. Gorgeous cinematography and a terrific performance by Max Von Sydow as the father, as well as many other pluses, make this one to watch.",
            "review_date": "2010-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good film, well made by one of the greatest directors of all time in Bergman, Sydow was my favorite, I would rate it 3.8 or so, something close to 4/5!",
            "review_date": "2010-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can you say VIKINGS? Watched this last week, making a quick comment in-between on overdose of Flight Of The Conchords. This is one of our favorite viking movies. This is one of the few viking movies in the world. It's a damn good movie! It's not a funny movie. But it is definitely a viking movie. Ensconced between a dialectical juxtaposition of pagan vs. Christian symbolism is a taut story beautifully photographed by Sven Nykvist. Von Sydow is iconic in his portrayal of a stricken farmer bent on revenge against the men who murdered his daughter. We love the details, the authentic farm, built on high ground, the pagan rituals and inscriptions, the servant girl praying to Odin, von Sydow's stunning performance as he prostrates himself before the always-silent Christan God. Bergman seems in this one to have balanced his interest in mystical beliefs in opposition to Christian certainty. Here the beliefs in the old Gods yield darkness and crime linked to carnal excess, the very energy the Christians were tamping down. In some respects the argument is simplified as we are dealing with a tragic crime. What is apparent is God's silence, or at least the hint towards it that would figure more strongly in the coming decade of Bergman's filmmaking. Silent or not, human excess seems in need of reigning in. Curious that Bergman is at the same time so apparently resistant to other aspects of Christian worship. It's almost as if he's tossed the baby out with the bathwater. In this film the story is more concrete, set in the past, based on an ancient ballad, almost a recreation in its historical accuracy. The more introspective explorations were to come. A perfect double bill with Seventh Seal.",
            "review_date": "2010-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was a very sad movie. not as good as Bergman's others like Wild Strawberries or The Seventh Seal but still powerful and wonderful performances.",
            "review_date": "2010-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed , I cried , It was a masterpiece",
            "review_date": "2010-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not going to butterscotch it, this film is harsh and as another user observed it's very \"emotionally draining\". The film shows Sweden on the verge of becoming a Christian nation and symbolises the savagry of the pagans in a controversial (at the time) rape scene. That key part of the plot is very important in the events that occur in the rest of the film but I must not spoil it because this is a film you should see if you are prepared for a rather grim, dark tale.",
            "review_date": "2010-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was ok. This movie could have been mute and it would not make much of a difference.",
            "review_date": "2010-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My second Bergman film, the first being The Seventh Seal, which I liked infinitely more than this. This isn't bad, but that one was brilliant. This one's message is simpler, but at least it has one and makes you think. Cinematography and such is great of course, as to be expected.",
            "review_date": "2010-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though this is based on a medieval tale, I was shaken by the clinical nature of the actions of the characters. Everything seems blunt and unwavering. From the brutal act, the allowing of it, to the revenge - the viewer is put through the mill. I found it very powerful.",
            "review_date": "2010-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It truly doesn't get any better than Bergman. An absolutely gorgeous film, despite the tragic story. Based on the Swedish folk tale, \"Tore's Daughter' and served as Wes Craven's inspiration for the 1972 version of THE LAST HOUSE ON THE LEFT, it tells of a father's vengeance over the rape/murder of his beloved child.",
            "review_date": "2010-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a quiet, understated movie about God, morality, vengeance, and redemption. i liked this much better than \"Persona,\" which was way too abstract for my taste.",
            "review_date": "2010-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Flixter gives the entire plot of this movie away! Lol, if the title wasn't spoiler enough.",
            "review_date": "2010-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"God...I don't understand you!\"\r\n\r\nSo Max von Sydow, as an anguished father, cries out in the closing scene of Ingmar Bergman's great The Virgin Spring (1960).  The moment, when it comes, is inevitable: the end of a path paved by torment and loss of faith.\r\n\r\nI've long suspected that Bergman (1918-2007) was the cinema's greatest director; after my second viewing of The Virgin Spring, I'm sure of it.  And if Bergman was the greatest director, then so too was Sven Nykvist (1922-2006), his long-time collaborator, the best of all cinematographers, a master lensman who understood better than anyone else the awesome power of light and shadow.\r\n\r\nFilmed in exquisite black-and-white, Spring is a devastating meditation on mercy, retribution, and the fine line that separates the the two.  Bookending the story are two startling acts of violence, made all the more shocking by the overall quiet tone of the film; both moments are anticipated--even expected--but nothing prepares us for their sheer brutality.\r\n\r\n\r\nBased on an 18th-century ballad, the story centers on a young maiden who, while delivering candles to the church for matins, is savagely raped and murdered by a trio of highwaymen--among them, a young boy.  In a bizarre twist of fate, the killers seek refuge in the home of the girl's parents.  One of the trio offers a dress from their victim to the mother as repayment for her kindness, setting in motion the third act, as the parents, now fully aware of their little girl's fate, decide what to do with her killers.\r\n\r\nIf all of this sounds vaguely familiar, it's because Wes Craven sourced The Virgin Spring for his classic 1972 shocker, The Last House on the Left.  And while Craven's update is certainly violent and disturbing, and moderately effective in its own way, it's weightless when compared to the anguish the father of Bergman's version experiences, as he quietly weighs his faith in God against the need for primal vengeance.  Indeed, there's a magnificent sequence near the end, where von Sydow sits at a table and rummages through the trio's belongings, simply thinking about what he plans to do.  As he does so, morning sunlight filters through the window, illuminating him--and his decision.  Craven, in his haste for exploitation, failed to include what Bergman surely knew was the defining moment of his own film.\r\n\r\nThe closing scene I mentioned above comes as von Sydow kneels by a stream, mere feet from his child's lifeless body.  He curses the heavens, not only for his daughter's murder, but for his own vicious act.  It's a powerful, heartbreaking moment, a parallel to Bergman's own long-held belief that God remains largely absent in times of need.\r\n\r\nThe Virgin Spring is a great film--one of the greatest--and should be seen by anyone who isn't afraid to be profoundly moved by the medium.",
            "review_date": "2010-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So, evidently I\u0092m not a Ingmar Bergman fan.  The Virgin Spring is my third film of his and even though I enjoyed this one the most, I could take it or leave it.  The Virgin Spring, like his others, is heavy on themes (religion, spirituality, morality) and though many think Berman is the bomb, I have never felt he is any better at asking thought-provoking questions than many another director.  Bergman\u0092s films are sooooo slooooow and I just can\u0092t overcome the pacing like it seems everybody else can.  I still want to watch The Seventh Seal at some point, but I\u0092m expecting to be underwhelmed with that one as well.",
            "review_date": "2010-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was very interesting for me to perceive the Swedish spirit in Swedish tale.",
            "review_date": "2010-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting, and certainly a vicious story.",
            "review_date": "2010-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very difficult-to-watch, but powerful revenge film.  A teenager on her way to church is raped, robbed, and murdered.  Unknowingly, the 3 destitute killers seek shelter from the cold at the home of her parents.  They're discovered when attempting to sell the looted clothing back to the horrified mother.  Certainly not an uplifting film by any stretch of the imagination, make sure to bring a bit of extra mettle along for the viewing experience.",
            "review_date": "2010-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After thinking about this film for hours on end, I feel like I have finally come to some sort of conclusion.  This is perhaps Bergman's least cynical film about faith and God.  By the story line itself, The Virgin Spring seems like it would be the most cynical, but the ending is what makes the film so beautiful.  \n\n***Spoilers***\n\nKarin is loved by her mother and father for being so pure and innocent.  If I had a friend like this, I would beat the hell out of anyone who would even hit on her.  On her way to church to carry the virgin candle Karin is raped and murdered.  This scene is so powerful, and through parts of it Bergman makes you sit in silence.  He cuts off all sound and you must sit and watch the (a complete understatement but lack of better word) uncomfortable taking of a girl's purity.  Remember, this was not just some ordinary day, but on a day where she is going to church.  Later, Tore is asking why God would not protect her.  He obviously has doubts about whether or not he is there.  His absence is noticeable, which seems to be a common theme in Bergman's films.  He goes to Ingeri, who is a pagan girl, and asks for her help.  Tore knows that revenge won't come from a Christian God, so he goes to paganism.  We know this because he starts whipping himself with branches with Ingeri watching him.  The way it's done seems more pagan than Christian.  However, even after the revenge takes place Tore still prays to God, and promises God that he will build a church where his daughter's body lies.  Once they remove her body, a stream of water begins to flow.  God is with them now.  They all feel this overwhelming feel of comfort in this difficult time, and even Ingeri baptizes herself in the water.  Most of this is not directly stated within the film, but this is what I believe to be what happens.  The fact that something described in this way, yet could not be correct is popular among Bergman's films.  He gives enough information for the viewer, and typically tells it in a form of a narrative and still allows the audience to analyze it in their own way.  This film is perfect in every way, and I hope to see it again soon.",
            "review_date": "2010-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wes Craven, eat your heart out!  Profound, if not action packed.  \n\nFavorite Quote:\n\n\"God alone knows where guilt lies.\" -Tore",
            "review_date": "2010-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspiration for Last House on the Left, this is much better than either version of that film.  Directed by Bergman, the cruelty functions as a effective juxtaposition against the idyllic setting.  People's guilt about the crime is touched upon, and it's more than the revenge fantasy that it became under different directors.",
            "review_date": "2009-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has been a long time coming, but I am glad that I am going through my Bergman phase at this age. This is another one of his gems that had me from the first frame and kept me going until the last. I loved the story (even though it has been hacked by some horrible remakes here lately) and thought it was well acted by the entire cast. Of course, when you have Sven behind the camera, you are going to have a gorgeous film and this film just keeps that legacy in tact. Max Von Sydow is the premiere badass and it's amazing how shocking the rape scene is even today. Great film.",
            "review_date": "2009-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Staggering.  Why don't we see more movies based on 13th Century ballads these days?",
            "review_date": "2009-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hard to watch, but the casting was great. I like the heavy moral questions posed.",
            "review_date": "2009-12-27",
            "source": "rt",
            "lang": "en"
        }
    ]
}