{
    "rating": 9.3,
    "release_date": "1952-01-20",
    "num_reviews": 90,
    "genres": [
        "Italian"
    ],
    "summary": "When elderly pensioner Umberto Domenico Ferrari (Carlo Battisti) returns to his boarding house from a protest calling for a hike in old-age pensions, his landlady (Lina Gennari) demands her 15,000-lire rent by the end of the month or he and his small dog will be turned out onto the street. Unable to get the money in time, Umberto fakes illness to get sent to a hospital, giving his beloved dog to the landlady's pregnant and abandoned maid (Maria-Pia Casilio) for temporary safekeeping.",
    "reviews": [
        {
            "content": "Vittorio de Seca was a master of the neorealist style and Umberto D. is one of his many, some argue the greatest, masterpieces. The key to the neorealist movement was in utilizing real life locations and mostly ordinary people in the prominent roles. Umberto D. is played by Carlo Battisti, who was a professor and this is the only film he was featured in but yet what a wonderful performance! Battisti gives such a multifaceted portrayal of the character that you really feel for the down-and-out side but also cheer on the stubborn and prideful side too. The story itself isn't overly complex but rather tells a straight forward narrative following Umberto D. and his trusty companion, whom seems to be the only stability in his life. We see how Umberto's life has been going downward since his retirement and his surmounting back-rent forces his landlady to kick him out (in reality she simply wants to do some improvements to the house and needs his room). We then see him trying to catch a break and get the money in order to keep his room by selling his belongings, all of which the viewer knows is pointless as she wants him out, and thus setting him back all the more. Umberto after coming to this realization that he has lost his home and livelihood as well as any pride he once had, has two choices left. He can either end it all by committing suicide or carrying on into the unknown future with very little to his name, simply his dog for company. The ending can be bittersweet as there is hope but amongst a lot of hopelessness and gloom. The film is simply terrific in telling a profoundly moving story and one of the crowning jewels of the neorealist movement!",
            "review_date": "2022-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can rewatch this movie countless times and always catch something new.",
            "review_date": "2022-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the masterpieces of the Italian neorealist movement, Vittorio De Sica's Umberto D. tells the story of Umberto, a retired civil servant trying to adjust to life in post-war Rome.  Abandoned by his colleagues, struggling to survive on a meager pension, and battling with his landlord to avoid eviction from his rundown apartment, he finds that his only friend is his faithful dog, who remains by his side regardless of the hardships experienced.   Featuring some beautiful cinematography and strong performances from its primarily amateur cast, Umberto D. is a film about survival in a changing world and finding companionship in a community uninterested in establishing relationships.  It is filled with memorable moments, including the final touching scene where Umberto looks for a home for his faithful dog.  Umberto D. is must see viewing for anyone interested in classic cinema.",
            "review_date": "2022-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Umberto D\" is a stark portrait of human suffering, rendered all the more potent through the dynamics of a mercilessly beleaguered older man and his beloved dog. If what I've described here sounds like pretty strong stuff, such is the crux of what makes the film great as well a trifle challenging. We genuinely care about the trials of this duo because their affection for one another and their efforts to contend determinedly with their daily travails are heightened by a refreshing absence of manipulative artifice; we peer into their harsh world as though looking directly into our own. In the form of \"Umberto D\" we are thus given a touching portrait of everything that the neorealist movement stood for, leaving us astounded by an experience that both enchants and hurts because it cuts so undeniably closely to the bone.",
            "review_date": "2022-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After watching the Trailer for this film I had high expectations. Unfortunately I came out disappointed due to the lack of character developments. On one hand you can sympathize with the Main Characters ,but their personal stories merely scratch the surface. \nNothing is ever revealed about anyone's past background. Nor do we see much more than  mere daily struggles to keep a room\nand board. I would have liked to know more about Umberto and Maria's background or even a future outcome. Another major flaw with this movie was the sloppy cutscenes that jumped from one dialogue to an entirely different scene. If it wasn't hard enough keeping up with a foreign language film ,their conversations were too impersonal. Every time it appeared to have a heartfelt moment we are immediately catapulted back into a pointless scenario.It was just not an enjoyable viewing experience or had much of a point that reached a conclusive end.",
            "review_date": "2022-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This neorealism film is hard and easy at the same time and it's just thus by the direction. Carlo Battisti performance is from another world. He showed his soul to the camera. 7/10",
            "review_date": "2021-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Umberto D is a film of great simplicity in story writing and cinematography elements yet surprisingly complex in capturing raw emotions of seemingly everyday thing and everyday people. \n\nPortraying the recovery of Italy after WWII, we follow an elderly man in his daily struggle to stay afloat. Through the interactions with the characters he encounters, we glimpses into his psychological turmoil; a tug of war in which on one side is his pride, and staying alive on the other. The story is dense and lean in an almost economic way, with little excess. But the meat of the matter lies in the slow burn build up to Umberto's suicide attempt. Most of the actions throughout the film seems to have no grandeur. Characters mostly hang around waiting for something, doing routinal things, but loomed over by the shadow of some invisible force of their own fate, pulling from inside, the unknown that is their future. This is perhaps the juxtaposition that prominently characterizes neo-realism. \n\nWhat's most notable is that the actor for Umberto's role wasn't a professional actor. Yet the performance turns out to be one that is relatable and sincere. It is somewhere in that authenticity and almost vulnerability that made the film all the more urgent and emotional.",
            "review_date": "2021-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sad Italian movies with no subtitles..A man and his dogs love for each other .",
            "review_date": "2021-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece; perfect in its simplicity and portrayal of its character Umberto D., which was acted with such intensity that flows through the screen into your heart and squeezes it. The whole ending is one complete uninterrupted string or raw emotions and perfect cinema, and astounding acting, both from Battisti and the dog.",
            "review_date": "2021-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie randomly not knowing it to be one of the most important movies to ever be filmed, but to find out so does not surprise me considering its masterful organization of pace, tone and expectation. Absolutely fantastic in delivering one of the most desolate and hopeless endings ever.",
            "review_date": "2021-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Rule Number One of film: you get a dog involved in a sincere drama without coming off as silly, and you've got a guaranteed critical following. Like De Sica's earlier Bicycle Thieves, Umberto D. focuses on silent suffering, very human plights that feel tangible, often existing just below the surface of society's accomplishments, victims that exist as a result of weaknesses of everyday life that people would rather pretend did not exist. The film taps into a deep-seated, universal fear - the unknown associated with age, feelings of uselessness, and a lack of love; though it clearly taps into bleak aspects of life in post-WWII Europe, its themes are universal. What could have been a powerful-but-predictable piece on human suffering and isolation is instead completely reoriented with moments of pure joy in the midst of all the misfortune, and an ending that is so hopeful that it's downright devastating. There is consideration of the balance between shame and survival in a modern setting that is just as compelling as the more overt emotional exploration between Umberto, his dog, and Maria, the girl whose pregnancy without a husband means she is living on borrowed time in her position. A great piece of Neorealist cinema that is brought out by one of the incredible performances from a movement famed for its use of nonprofessional actors; Battisti is stunning, and can portray his character's fury and withdrawn moments with great care. But this was his sole performance, so like Harper Lee, we're left wondering what if. (4.5/5)",
            "review_date": "2021-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The formula is similar to that of \"Ladri di Biciclette\", De Sica's earlier masterpiece. A social commentary about the struggle of the common man for survival.",
            "review_date": "2020-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you watch a movie like this you ask to yourself what's happen to cinema. You watch this movie and you're in the movie, you live in the room where Umberto sleep, you live his pain, his problems, you feel what does it means being old, being broke. Umberto D. bring you to walk in some other else shoes, with such sublime elegance. I can easily believe that this was the favorite movie of Bergman, it's poetry of street. Materpiece",
            "review_date": "2020-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An alright film, that focuses on an elderly gentleman who feels his humanity being stripped away in a post-war society.  Its slow-pacing is less than to be desired but makes up with heart",
            "review_date": "2020-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunned into silence and contemplation by the whole movie.",
            "review_date": "2019-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Umberto D. is an Italian neorealist film in the vein of Bicycle Thieves. A retiree with a fixed income struggles to get by as his pension is eaten away by postwar inflation. Umberto is dignified in the face of misery and you feel sorry for him, and especially his dog, even though the movie never manipulates your feelings.",
            "review_date": "2019-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic story of world cinema. \n\nUmberto (Carlo Battisti) is a retired civil servant, bereft of friends--save for his pet dog--and family. Unable to pay the rent on the shabby room where he has lived for three decades, Umberto is slated for eviction. His angered protests to the Italian government about the cavalier treatment afforded him and his fellow senior citizens fall upon deaf ears.\n\nSo I'm in world cinema, a class at my film school. Each week, we're supposed to watch one movie that's considered a classic. Many of these films thrived in times of neorealism, French New Wave, Japanese realism, and more. \"Umberto D.\" was one of the first films we watched.\n\nBack then, the way films were shot stylistically were so much different than they are today. \"Umberto D.\" was shot with many long, lingering takes and not many cuts. Its black & white film makes this film visually appealing. The lack of cuts and rapid editing allows us, the audience, to experience all the emotion we need to in minimal takes. \n\nThe character of Umberto is really what made this film. The film depicted a lifestyle of the lower class in order to show people the severity and difficulties that many faced. Umberto is the average citizen, too proud to beg but too old to work a meaningful job. He's stuck in a dead end and we watch his struggles and how it defines him as a person within civilization.\n\nIn the end, \"Umberto D.\" was a great film. I'm sure it's on the Criterion Collection but if not, I know it's available at a small price for streaming.",
            "review_date": "2018-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Examines the pathetic side of sorrow. A happy ending from the love a dog--all you need.",
            "review_date": "2017-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a lot of human spirit in this movie. Pretty sad at times it shows how a dog can really be a man's best friend. It was very striking to see the poverty but also kindness that is spread throughout the movie. \n\nQuite sad and depressing, but also very hopeful. Wonderful movie!",
            "review_date": "2017-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Understated and powerful.",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched the whole movie because it received such good reviews.\nBut I found it to be slow  and plodding.\n\nI did enjoy the in-depth character study.\nI do not think that it was a happy ending. The happiness seemed short-lived....  only for the moment.\nGreat scene at  the end when Flike is not sure whether to trust his master.",
            "review_date": "2016-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a depressing movie. It is definitely a classic. It's a pretty simple, yet deep film. The acting is great, even if the actors aren't professional actors. I enjoyed the movie a lot.",
            "review_date": "2016-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though I had already seen this film several times before, watching it again in 2016 left me speechless and deeply moved.  Umberto D is a masterpiece of storytelling, of human drama, of everyday life.  A remarkable and deeply affecting film.",
            "review_date": "2016-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "played by non-professional actors another good slice of Italian neo-realism",
            "review_date": "2016-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is another beautiful masterpiece from Vittorio De Sica that I originally saw may years ago but decided to revisit on Criterion Collection's gorgeous blu-ray.  It's a simple story about a man and his beloved dog.  He's extremely poor in post-war Italy, and the Italian government doesn't seem to care about the pensioners who don't seem to have enough money to get by.  He tries to raise money any way he can to pay his back rent to avoid being evicted.  The story simply follows him as he sells items and care for his dog. It sounds basic, but there's really a lot going on in this film, and it's elevated by the neo-realist style that De Sica incorporates.  This is simply a must-watch film.",
            "review_date": "2016-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the hardest I've ever cried during a movie.",
            "review_date": "2016-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Umberto D. is a flawed, but still a good movie. I found its first half to be incredibly slow and even dull and some aspects are exaggerated, but the film becomes so much better later on with such a fantastic second half with the finale in particular being great - moving, memorable and one of the best endings I've seen recently. The film is problematic at first, but becomes very relatable and heartwarming in the end with some excellent score, great cinematography and a big heart at its core.",
            "review_date": "2016-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When my History of Film professor showed my class this film I was at first skeptical of I would enjoy it. However I can now safely say that this has become one of my favorite films of all time. With a cast of unprofessional actors this movie is much more relatable then today's modern day films. The story is so compelling, that of an older man attempting to find a way to support himself and his dog after losing his pension, that it left me with a pit in my stomach towards the end of the film, due to just how connected you become to the characters. This is something no other film has ever made me feel, and I'd doubt ever will. For anyone interested in film history, majoring in film media, or just an average moviegoer, this is a film I believe everyone should see at least once, because of the pure emotion you feel radiating from the incredible acting and story.",
            "review_date": "2016-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredibly depressing slice of life film, Umberto D depicts a man named Umberto and his dog Flike living in post-war Italy. A depressing and largely hopeless story unfolds in which your heart breaks at every single point, almost to the point where you hold contempt for the film for making you go through this. The turmoil and emotional pain this film causes make you want to break through the screen and give Umberto a hug. Like damn. Overall, Umberto D is a masterful film from the Italian Neorealism and from director Vittorio De Sica.",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I usually like Italian films from this era but this one never gripped me. It lacked the edge of the Bicycle Thieves or even La Strada.",
            "review_date": "2015-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I give this an -A( 93).",
            "review_date": "2015-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant and ahead of its time.",
            "review_date": "2015-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe that italian cinema was so powerful, they had so many great names and works. It's unbelievable today, when all these geniuses stayed in the past.",
            "review_date": "2015-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the great Italian Neorealist films. Like Bicycle Thieves, it tells a gentle story about gentle characters dealing with unfortunate problems. It also gives us one of the great onscreen friendships, Umberto and Flike the Dog.",
            "review_date": "2015-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The drama is expertly weighted, and extremely poignant. Umberto D is simple, but heart-breaking. 9/10.",
            "review_date": "2014-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Sica's at his best.",
            "review_date": "2014-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Sica's story of re-affirmation of life from a bleak existence. It is about the struggle of an old man to keep from falling apart in acute financial crisis in post-war Italy. It is mostly a character-driven film and more is said through gestures than words in a minimalist framework. The part where the protagonist comes back from the verge and accepts life is just unforgettable.",
            "review_date": "2014-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Subtle and profoundly moving, \"Umberto D.\" is both crushingly depressing and gloriously life-affirming in equal measure.",
            "review_date": "2014-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Italian neo-realism masterpiece. Vittorio De Sica pulls the hard strings of the viewer in this touching movie of a man's desire to live and eventually die respectably. Key performance by the dog",
            "review_date": "2014-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The (neo)realism, thanks to the excellent performances, works very well and the film is touching, but the story is very simple.",
            "review_date": "2014-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Umberto D represents the most human and touching side of the revolutionising cinematic movement known as Italian neo realism. Directed by one of its main exponents Vittorio De Sica and written by one of the best screenwriters of the period Cesare Zavattini, this is the painstaking story of an old man with all kinds of problems from health to financial and who struggles to survive the overall bleakness of his existence. This wave of realism is full of humanity but does not spare the viewer from the dark side of the faithful portrayal of its settings and its characters. De Sica is great at making sure that all the elements of the story and of the production are in perfect harmony with one another, from the music to the cast entirely made up of real people from the streets. Umberto D. is gerenally rightfully considered De Sica's best work alongside Bicycle Thieves and certainly a powerful age defining and influential and haunting representation of the everyday struggle of the people that society tends to forget and the people whose existence is all too blatantly ignored by society.",
            "review_date": "2014-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Carlos Battisti will leave you in tears with his raw emotional performance as the struggling lonely man Umberto. Almost impossible to believe that the man had never acted before until this.",
            "review_date": "2013-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The neorealist movement began in Italy at the end of World War II as an urgent response to the political turmoil and desperate economic conditions afflicting the country. Directors such as Roberto Rossellini, Vittorio De Sica, and Luchino Visconti took up cameras to focus on lower-class characters and their concerns, using nonprofessional actors, outdoor shooting, (necessarily) very small budgets, and a realist aesthetic. The best-known examples remain De Sica's Bicycle Thieves, a critical and popular phenomenon that opened the world's eyes to this movement, and such key earlier works as Rossellini's Open City, the first major neorealist production. Other classics of neorealism include De Sica's Umberto D. and Visconti's La terra trema, but the tendrils of the movement reach back to De Sica's The Children Are Watching Us and forward to Rossellini's The Flowers of St. Francis, as well as to some filmmakers who did their apprenticeships in this school, Michelangelo Antonioni and Federico Fellini",
            "review_date": "2013-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great realist character study.",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart touching, masterpiece!",
            "review_date": "2013-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful heart tugging story of a retired bureaucrat who can't make ends meet. The sequence with his dog at the end is particularly poignant.",
            "review_date": "2013-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me, I walked away from this film with the same raw emotion that I walked away from Robert Bresson's Au Hasard Balthazar with. Both films deal with abuse in one form or another. In Balthazar, the donkey is the central character that is undergoing the predominant amount of abuse throughout the film but the side character, Marie, is physically and emotionally abused in certain scenes in the film as well. In Umberto, Umberto himself is the central character who receives unsympathetic abuse from his landlady, society, certain friends, even the government. Umberto's dog, Flike, also undergoes abuse from society and, to a certain extent, Umberto, even though he doesn't mean to. Both films deal with different themes but both speak volumes about the concept of innocence in humans as it is in animals. Do humans abuse animals as they abuse each other? Do they feel more sympathy toward one more so than the other? Of course both these films deal with many other themes and political/social statements, but this is simply what I walked away with.",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I probably would have cried if I didn't watch this in class. Probably truer to form in today's times but feels as close to post war Italy and it's effects than we will ever know.",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really really really really my storu of life!\n\nI have a great sympathy with umberto\n\n it is all that i;ve  experienced in this planet else  being father. I love you umberto and if I have money I would buy your watch",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the saddest and most quietly devastating films I've ever seen. Its also inspiring and immensely beautiful. Changed my life.",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absolutely amazing. loved it!",
            "review_date": "2012-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely brilliant. Vittorio De Sica does it. MASTERPIECE, oh goosebumps!",
            "review_date": "2012-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How can such a simple little film affect us so much?",
            "review_date": "2012-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Umberto D. is Italian neorealist masterwork paired with Bicycle Thief as some of the best neorealist films to date. The characters' suffering is so incredibly expansive in the representation of the workplace, the post-work life, and exposes some daring contrasts in humanity through the surrounding characters such as Maria, the maid, and the landlady.",
            "review_date": "2012-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, heartfelt movie. Vittorio De Sica named it as his favourite of all his pictures. He even dedicated it to his father. Again, his use of ''non-professional'' actors is not noticeable. The performances were uniformly excellent. I loved the score, the direction and most of all, the story. *SPOILER, I guess* It had a beautiful ending - the last 28 minutes or so contrasted the last 2 minutes...thank God. Really worth checking out.",
            "review_date": "2012-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This neorealist masterpiece by master Vittorio de Sica is a deeply heartfelt and unforgettable portrait of a poverty-stricken life in postwar Italy, avoiding any sort of easy sentimentality and needing no effort to make us love and care about its struggling character.",
            "review_date": "2012-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An aged pensioner suffers at the indifference of the idle class. Umberto D's title character is a joy to watch. Non actor Carlo Battisti, in his only movie role ever, delivers as powerfully as any veteran could have. The class commentary is kinda simple, and there are some lulls in the middle, but it all adds up and the third act is phenomenal. And Umberto D looks so good it makes me wish 4:3 cinematography wasn't dead.",
            "review_date": "2012-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wednesday, September 12, 2012\r\n\r\n(1952) Umberto D.\r\n(In Italian with English subtitles)\r\nDRAMA/ SOCIAL COMMENTARY/ NEO-REALIST\r\n\r\n  To the average viewer it's long, boring and plotless but to others it's the reflection about how it used to be during that particular \"Neo-realist\" time and that was Italy as it used to be.  Upon seeing it almost seemed like a continuation of Vittorio De Sica's other hit \"The Bicycle Thief\"/ \"The Bicycle Thieves\" made in 1948 except that instead of a young man, we are taken under the wing of an elderly person and his name is Umberto Domenico Ferrari playing with a \"subtley\" performance by Carlo Battisti hence the title. He's living with his pension renting from a landlady who appears to overcharge him as opposed to living somewhere else- it is obvious to the audience that she's doing anything she can to get rid of him but as a result of his pride he stands firmly tall refusing to move anywhere else, and also because he's stayed their for a long time and it may not be easy to just live somewhere else.  It is evident that he needs money and throughout the film we the audience get to witness Umberto's daily life as he struggles takes us day to day, and it is not the most appealing for at times it's hard to sympathize with him if he doesn't want to adapt, for instance theirs a scene somewhere during the film where upon looking at a successful begger and he contemplates trying it but decides that he is way too proud and makes his dog Filip to do it instead ducking somewhere and instructing him to hold up his hat but of course fails.  One other point is that they're alot of \"nuances\" that will not be apparent to first time movie watchers, but demands repeated viewings to all others because they're plenty.\r\n\r\nIt is said to be the director Vittorio De Sica's personal favorite film he's ever made since the movie's title Umberto is really his father's name and it was his dad that encouraged him to make it as well. The Italian government at the time even refused to be shown overseas since he almost felt that it was personal attack on him and the rules that's been laid out.  \r\n\r\n3 out of 4",
            "review_date": "2012-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a man and his dog, fuck everybody",
            "review_date": "2012-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "His personal favourite of his own revered filmography, Vittorio De Sica's \"Umberto D.\" lays bare the tribulations of Italy's postwar senior class, struggling to get by on meager pensions. Carlo Battisti plays the representative elderly character with a great deal of pathos and heart, and De Sica films him in typically bleak neorealist fashion, although he does allow for indulgences such as music and some more interesting visual compositions than the style usually provides.",
            "review_date": "2012-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those sad and tragic movies about a man down on his money and down on his luck. The only thing keeping him alive is his loyal dog and an undeterred spirit of eventual optimism.",
            "review_date": "2012-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A strong emotional film that will melt your heart as it surely did for me.",
            "review_date": "2012-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So many truths are spoken in this emotionally beautiful film. This is one of the few films that cuts straight to the core of me. My heart is still broken having watched this. The premise of an old man and his dog has to be one of the most simple and beautiful things. This film portrays exactly what we urged to see and more. Maybe my favorite performance of all time (Battisti as Umberto D.). The fact that almost everyone repulses him except the very rare few who do. People look at him and feel disgusted, which absolutely tears me apart. I love this film. Maybe the saddest film I have seen (next to The Elephant Man).",
            "review_date": "2012-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was totally not expecting to feel sad after I watched this movie, it's even better than The Bicycle Thief and the dog... that goddamn dog. Vittorio De Sica had a great talent in breaking people's heart.",
            "review_date": "2012-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "De Sica's powerful and heartbreaking masterpiece",
            "review_date": "2012-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple yet very sweet. Carlos Battisti delivers a trully professional performance, not to mention his unbelievably charismatic persona. Amazingly directed.",
            "review_date": "2012-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "/B/ The grandfather of the sad panda independent films that I love is not all that great for the first 60 minutes. The last act is tremendous though.",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie for me was about depression, and not just sadness.",
            "review_date": "2012-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first De Sica movie.  The use of an almost entirely untrained cast made the story very believable.  A very touching film.  Thumbs up!",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched a neorealist film after quite some time....one of the greatest works of humanist cinema. De Sica, take a bow! \nTRIVIA: Ingmar Bergman listed this as his favorite film.",
            "review_date": "2011-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good first act, an unwatchable second act, and a fascinating finale, it lacked structure.",
            "review_date": "2011-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vittorio DeSica's wonderful \"Umberto D\" was one of the last films of the Italian neo-realism movement and by far its best one. It is also one of my favorite movies ever.\nThe movie's premise is simple: it is a slice of the life of a poor lonely pensioner, Umberto. Throughout the movie, we see Umberto struggle to find money to pay rent to his horrible landlady, love his dog Flike, and deal with the loneliness and disillusionment of the postwar era.\n\"Umberto D\" is a character-driven film. It works very well because of its sharp observations on loneliness and poignant gestures. The gestures evoke powerful feelings without necessitating dialogue. Many of the scenes, even the ones that do not necessarily advance the plot, are hypnotically beautiful in their simplicity. Take, for example, a beautiful scene where Umberto finally needs to beg for money but cannot physically bring himself to do it. He extends his palm up, but when a passer-by stops to give him money, Umberto quickly flips his hand over, as if testing for rain. The film is full of these small gestures that quietly emphasize the desperate loneliness and poignancy of Umberto's situation.\nThe acting in this film is absolutely superb. Carlo Battisti, despite having never acted before, is wonderful as the titular character; his face is a fascinating blend of stubborn dignity and weariness of life. Maria Pia-Casilio, who plays the maid, is just as good as evoking life's loneliness and quiet desperation. The supporting cast is also very strong.\nOne of the very few criticisms I have heard of this film is that it is too sentimental and borderline sappy. While some scenes with Umberto and his dog Flike are sentimental, never is it \"too\" sentimental. DeSica knows how far he can push his film without making it sappy, and he wisely shows it as it is. Nothing feels forced. The subject material itself and the simplicity in which it is presented will bring tears. (If you don't cry in this movie, you need to have your heart professionally de-thawed.) But \"Umberto D\" is never dumbed down into sappiness and clichéd corniness. It is a very powerful film.\n\"Umberto D\" is the masterpiece of the Italian neo-realist era. It's a rather bleak and very realistic movie, but it makes some fascinating commentary on the human condition, specifically the loneliness we face. Highly, highly recommended.",
            "review_date": "2011-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another masterpiece by Vittorio DeSica. Definitely on par with Bicycle thieves as one of the great simplistic yet powerful and great human dramas. I think DeSica made better Neo-realism films than anyone because he delved deeper into character's emotions and struggles, and didn't need cheap tricks to evoke tears from the audience.",
            "review_date": "2011-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films to come out of the Italian neorealist movement.",
            "review_date": "2011-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sad thing is that this does happen. the awkward silence between friends and everyone turning a blind eye. i love Flike, his only loyal and loving friend.",
            "review_date": "2011-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Am I a monster if I didn't cry during Umberto? I mean, even the Criterion DVD case all but says 'get ready to ball out loud.'",
            "review_date": "2011-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an old man who tries to keep his home.I hated the house's owner and liked Maria.\r\nI think this movie was great but not a masterpeice...",
            "review_date": "2011-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic case of Neorealist cinema... wth no exaggeration of sentiments or melodrama... beautiful !!!",
            "review_date": "2011-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vittorio De Sica's Umberto D. is the story about the old citizen named Umberto Domenico Ferrari who have trouble of paying his rent and the money for food. He also has a little dog named Flike whom he loves more than everything in this world. He knows that he's not able to take care of him due to his economical problems. It's a wonderful love story. But the other dragging elements in this picture might hack it down a little, like all the conversations and arguments. I give it a marginal thumbs up.",
            "review_date": "2011-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly moving masterpeice...be warned",
            "review_date": "2011-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Neo-realist masterpiece.  The little dog Flike steals several scenes and underscores the tragic desperation.",
            "review_date": "2011-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still not sure if I tolerate or am lukewarm on Neorealism. Cinema hell for someone with severe ADD: subject him to a steady diet of Italian Neorealist films. I quite enjoyed this one, though. Really thorough character study and direct and deliberate.",
            "review_date": "2011-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A quiet, sweet story about a lonely old man.",
            "review_date": "2011-07-13",
            "source": "rt",
            "lang": "en"
        }
    ]
}