{
  "title": "Brazil",
  "rating": 8.6,
  "release_date": "1985-12-18",
  "summary": "Brazil is a surrealistic nightmare vision of a \"perfect\" future where technology reigns supreme. Everyone is monitored by a secret government agency that forbids love to interfere with efficiency. When a daydreaming bureaucrat (Pryce) becomes unwittingly involved with an underground superhero and a beautiful mystery woman, he becomes theBrazil is a surrealistic nightmare vision of a \"perfect\" future where technology reigns supreme. Everyone is monitored by a secret government agency that forbids love to interfere with efficiency. When a daydreaming bureaucrat (Pryce) becomes unwittingly involved with an underground superhero and a beautiful mystery woman, he becomes the tragic victim of his own romantic illusions. [Universal Pictures]… Expand",
  "critic_reviews": [
    "Brazil may not be the best film of the year, but it's a remarkable accomplishment for Mr. Gilliam, whose satirical and cautionary impulses work beautifully together. His film's ambitious visual style bears this out, combining grim, overpowering architecture with clever throwaway touches.",
    "This modern cult classic is a triumphantly dark comedy directed by one of the film world's truly original visionaries, Terry Gilliam. \"Imagination\" is this futuristic film’s middle name.",
    "A ferociously creative 1985 black comedy filled with wild tonal contrasts, swarming details, and unfettered visual invention--every shot carries a charge of surprise and delight.",
    "It's a glimmering hunk of fractured brilliance riddled with Orwellian paranoia encased in a production design seemingly pieced together from the shared dreams of Franz Kakfa and Salvador Dali, and shot from cruelly low angles.",
    "It remains a stunning achievement, if nearly as exhausting and frustrating as the Tex Avery bureaucracy it roasts, but Gilliam's stylistic dysfunctionalities, art-directed out of junkyards, are what still percolate in the forebrain.",
    "Gilliam's dystopian epic remains among his best, blending his trademark visual inventiveness with a vicious brand of social satire. Unique and essential.",
    "Chillingly hilarious.",
    "Terry Gilliam's darkly funny and truly visionary retro-futurist fantasy is a mess dramatically, and its turbulent history echoes the battles fought by Orson Welles against studio executives bent on recutting or scuttling his films.",
    "Brazil can be enjoyed without knowledge of the behind-the-scenes circumstances but the rich irony of the parallels between Gilliam and his fictional creation, Sam Lowry, add a layer of appreciation to the project that it otherwise lacks.",
    "Blindingly obtuse, excessively morose, the film is nevertheless dazzling in its inventive and massive sets and spectacular in its techniques...A powerful work that is both bleakly funny and breathtakingly assured.",
    "Visually, it’s an original, bravura piece of moviemaking, with a weirdly ingenious vertical quality: the camera always seems to be moving up and down, rarely across.",
    "It's a strange, hypnotic, completely fresh vision, not of the future per se, but into Terry Gilliam's own mind.",
    "Fortunately the story of an alternative future is realised with such visual imagination and sparky humour that it's only half way through that the plot's weaknesses become apparent",
    "Perhaps it is not supposed to be clear; perhaps the movie's air of confusion is part of its paranoid vision. There are individual moments that create sharp images (shock troops drilling through a ceiling, De Niro wrestling with the almost obscene wiring and tubing inside a wall, the movie's obsession with bizarre duct work), but there seems to be no sure hand at the controls."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "A beautiful, dystopian mess.",
      "review_date": "2008-09-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's hard to explain for some, why they love this movie. For me, it's hard to capture the movie in few sentences, it's almost impossible. In my opinion the best movie ever made, Lawrence of Arabia has a scale no movie has, Brazil however,It's hard to explain for some, why they love this movie. For me, it's hard to capture the movie in few sentences, it's almost impossible. In my opinion the best movie ever made, Lawrence of Arabia has a scale no movie has, Brazil however, comes right behind Lawrence. It's not the longest movie and it doesn't have the most complicated story, but it's great storytelling makes this movie multilayered. The more you think of it, the better it gets and not to mention it's catchy theme song, that you whistle weeks after you have seen it. I will not even try to explain the story as it has so many interpretations including my own, so the best you can do is to go see it.",
      "review_date": "2014-08-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies of all time. Obviously a little too complex for Mr. Ebert.",
      "review_date": "2006-06-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Brazil is surely Terry Gilliam's masterpiece. With this surrealistic vision he draws a distorted image of the modern world which shows up the cruelty of the authority of the state and is simultaneously so close to the emotional world of Brazil is surely Terry Gilliam's masterpiece. With this surrealistic vision he draws a distorted image of the modern world which shows up the cruelty of the authority of the state and is simultaneously so close to the emotional world of the protagonist that it don't let the viewer go.",
      "review_date": "2007-12-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of those movies that I (stubbornly) try to show people, and get upset when they think it's stupid, even though I know better. It's not for everyone. I can watch Brazil over and over and over again. It's funny as hell but alsoThis is one of those movies that I (stubbornly) try to show people, and get upset when they think it's stupid, even though I know better. It's not for everyone. I can watch Brazil over and over and over again. It's funny as hell but also frankly depresses me at the same time because it strikes so close to home. It comes across as over the top but it's really not as silly as it seems. Some would say that it gets lost in itself, doesn't make sense, or something like that, not saying that i \"get it\" but I admit that I do get that guilty feeling of self-assurant cynicism that I do indeed see the message that the movie is trying to send to its audience. It's a bit of \"preaching to the choir\" but I think that it is still funny/pretty/interesting enough for the masses, at least for the time... Held up to today's standards, it doesn't stand a chance, unfortunately.. But I still recommend this movie to punk rockers, fans of dystopian/orwellian fiction, Monty Python fans, drunks, sci-fi weirdos, people with a real sense of humor, or anybody with an open mind, hell, anyone with a mind at all... Watch Brazil!",
      "review_date": "2011-02-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favourite films of all time. In some ways it could be viewed as a horror film, as well as being darkly satirical. It sure as hell scared me.",
      "review_date": "2011-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An all-time classic. Ebert, what were you thinking, man? How can you not get the ducting? It's a simple (and hilarious) metaphor for the ridiculous, rule-bound world of Brazil. At least that's the way I take it.",
      "review_date": "2006-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Brilliant in every way, just dark enough and just thought provoking enough to be interesting without distracting.",
      "review_date": "2009-07-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A classic cult film, if that is possible.",
      "review_date": "2008-09-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The conflict and contrast between humanity and efficiency is at the film's core. Set in a dark dystopia where the only escape is through the protagonists own twisted fantasies.",
      "review_date": "2012-02-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies I've seen.\rBrazil is very complicated and 'hard' movie to understand. It's highly detailed and every scene has something that symbolizes something.\rThe bureaucracy has taken control of everything and everyone worksOne of the best movies I've seen.\rBrazil is very complicated and 'hard' movie to understand. It's highly detailed and every scene has something that symbolizes something.\rThe bureaucracy has taken control of everything and everyone works all day long and don't know for what.\rCapitalism is everywhere and the people have been divided into castes.\rThen there comes the protagonist and decides to go outside the 'box' and be free. Or at least try to.\rA brilliant story. But not for everyone. You should still watch it and see if you like it!",
      "review_date": "2012-11-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Too bizarre and creepy at times for its own good, Brazil is nevertheless worth seeing for its undeniable originality and incredible set pieces.  First things first.  This is one strange movie.  It's completely out of its mind.  This is atToo bizarre and creepy at times for its own good, Brazil is nevertheless worth seeing for its undeniable originality and incredible set pieces.  First things first.  This is one strange movie.  It's completely out of its mind.  This is at once its cardinal flaw and the reason why it's so vividly memorable.  Disturbing tones and strange characters abound.  It's extremely successful at freaking you out but it does this way too often for my taste.  The world in Brazil is incredibly unique, with out of this world art direction and one of the cruelest dystopian societies ever displayed in cinema history.  No one could ever possibly feel safe or comfortable residing in this over-controlling and paranoid dictatorship.  The film is filled with impressive visuals, tense scenes, and expert direction, but it's also pretty funny at times.  This however doesn't deny it of emotional resonance.  I liked Brazil a lot more after seeing it as a whole rather than in separate pieces.  Even if it isn't completely logical and isn't really a pleasant vision of the future it's still worth a look if you don't mind a movie with some screws loose in its head.",
      "review_date": "2013-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is one of those movies, you know, the ones that are claimed to be very good but yet you cannot understand why. Besides some of the obvious things of course, like fighting amongst yourself, how people try to improve the self through products, and government control. That stuff I think a lot of people can understand, but I don't know why it deserves as much credit as some may say. It does have only two people that I know in it; Robert De Niro and that guy from who framed Roger rabbit, but I don't think there're any bad performances, if anything there all good or okay. The story is what makes this story interesting and the execution is what makes it unique. The effects of course are somewhat dated, but like Akira, it seems to fit the setting and mood perfectly. There isn't much else to say. Oh wait, the action in this is not that great, and it is a a bit sad because the most visually intereresting sections are based off action, and when they don't look as well it can take away from the scene. In the end, this is a very interesting social commentary, and is one of the best dystopian movies out there.",
      "review_date": "2013-05-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWhat I really love about this film is the dark atmosphere and comedy. It works so well and the dream scenes are so imaginative. It's also directed by a former member of Monty Python, Terry Gilliam, and you can even sense the feel of them at moments. Another thing is that the world he lives in is so surreal to us that when he dreams we can seem to have a whole different level of the surreal we are witnessing. It may be one of those movies you'll hate but if it's for you, you really got to love it. Every time I watch it, it gets better and better. More and more recently I've noticed how much Zach Snyder's Suckerpunch takes from this movie, is that good or bad, I can't tell but it sure has also had a big influence on me and my view of films. One of my personal favourites.",
      "review_date": "2013-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies I have ever seen. It is astounding, every aspect of this film is brilliant.\rA lot lot people say it is boring, stupid and hard to follow, don't believe them, watch it yourself. Maybe you will see the masterpiece.",
      "review_date": "2013-09-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am really surprised about the number of positive reviews for this film !! it's one of the worst movies I've ever watched, I felt confused (what's going on?!) until the end of film, even the jokes were so silly.I know the film is talkingI am really surprised about the number of positive reviews for this film !! it's one of the worst movies I've ever watched, I felt confused (what's going on?!) until the end of film, even the jokes were so silly.I know the film is talking about satirizing the dystopian society, but it was so messy and you don't know what's going on or why !! maybe if you watched it at that time you will like it, who knows!On my advice, don't waste 2 hours of your life on it.",
      "review_date": "2020-05-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A unquestionably bizarre film, \"Brazil\" at first seems like an improvisation on Orwell's 1984, a funnier 1984, and ends up being like nothing else ever made by anyone, anywhere.  An average fellow, the son of a rich, decadent woman, who worksA unquestionably bizarre film, \"Brazil\" at first seems like an improvisation on Orwell's 1984, a funnier 1984, and ends up being like nothing else ever made by anyone, anywhere.  An average fellow, the son of a rich, decadent woman, who works for the Ministry of Information, gets caught up in a series of bureaucratic nightmares inflicted by a heartless, tyrannical, uber-government.  He fantasizes about flying thru the air, confronting demons dressed like samurai robots, and of a pretty blonde, who turns up in his life one day, the member of a rebel group.  There was some controversy about \"Brazil\" back in the day because of its liberal use of terrorist bombings and its misanthropic character sketches.  The story is nothing all that brilliant, but the visuals are magnificently dystopian, with fantastic, gritty, futuristic urban sets, pipes and ducts tumbling out of walls, police in quasi-Nazi garb, and depictions of luxury.  I read somewhere that this movie was the beginning of the steampunk aesthetic.  Bravo, Terry Gilliam!",
      "review_date": "2018-03-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was probably one of the best, darkest comedy that I have watched that had a couple of down sides which I will get into.First of all the world that they are showing us was amazingly crafted and incredibly interesting , society is prettyThis was probably one of the best, darkest comedy that I have watched that had a couple of down sides which I will get into.First of all the world that they are showing us was amazingly crafted and incredibly interesting , society is pretty much the worse nightmare for Orwell, Kafka and Huxley where the entire premise is a bureaucratic nightmare + Authoritarian Regime where people have incredible apathy towards the world around them. Daily bombings? Lets just continue shopping baby, a guy got wrongly killed because we made a document mistake? What are you talking about we don't make mistakes around here do we gov'nah?. The world is pretty much the most interesting part of the movie , the characters not so much sadly. The main character was good and so were most of the supporting roles except Julie which was played by a robot(if that was the point Bravo) and sadly the movie is pretty long for its own good but the worth was totally the wait because the end was really well made and was realistic for the world that they lived in , only if they have made it shorter and got a better female lead  it would've been perfect.9/10",
      "review_date": "2021-02-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I originally saw Brazil when I was 8 or 9 years old, and man did that movie leave a mark on my psyche.  For years I thought about its images until one day I tracked it down at Blockbuster and re-watched it.  This movie joins the manyI originally saw Brazil when I was 8 or 9 years old, and man did that movie leave a mark on my psyche.  For years I thought about its images until one day I tracked it down at Blockbuster and re-watched it.  This movie joins the many groundbreaking films that bombed at the box office and only achieved greatness in retrospect (for many at least).  This is definitely Gilliam's masterpiece (for now) and shows off his strengths and the caliber of imagination that he possesses.  Brazils dystopian society is nothing new, Orwell wrote of 1984 and this movie is inspired by his book.  It takes many of the fears/concepts of 1984 and modernizes them, eventually leaving behind the source of inspiration and developing into its own mythos.  The movie reflects a much distorted look at what humanity and society can become and views the world through twisted, fun-house mirror lenses.  The effect is definitely more shocking in how he takes very ordinary things, like an automated printer that can issue a warrant for arrest, and shows just how dangerous it can be to take the human elements out of society in an attempt to make things run \"smoothly and sterile\".  He is definitely trying to make a point at what terrifies him in the modern world: past, present, and future; but underneath all the social commentary is really a story about a man who wants to be free in many ways.  Sam Lowry is a man with no joy in life; having a unsatisfying job, living in a overly bureaucratic, fear-mongering society, along with his materialistic and superficially-obsessed mother who has never heard of the word nepotism.  His life is crushingly without options, and so he does what many do, fantasizes about another life, another world.  This of course leads him to trouble and as the story progresses, things become grim...in a darkly funny way.  The movie is essentially a comedy, although of the darker kind.  Not so much in a gross or unbelievable kind of way, but more in a frighteningly plausible form that does not poke but stab at the fabric of our current society.  The movie is not for everyone, especially if you can't take a good jab from something that may not sit well with your established view of the world.  In order to help enjoy this movie, being open to many possibilities is important, as this movie likes to shake up the established order.  The cast is excellent, with strong performances from pretty much everyone, but then seeing the caliber of actors in the movie, its no wonder.  Michael Palin is frighteningly nonchalant/creepy in his \"business as usual\" demeanor, and you can't help but pity poor Sam Lowry as a doomed dreamer whom you have the sneaking suspicion that his life won't end well.  Brazil is a movie that very few people would have the guts to make.  Gilliam to me isn't a director as much as an artist, and depending on how you view the purpose of movies and the role of directors, this can be a good or a bad thing.  To me a director tries to make a movie that the public might want to see, while an artist makes a movie that he wants to see.  Self indulgent or not, whenever Gilliam makes a movie, I sit back and let him tell me his tale.  Whether I like it or not is not that important, as I would rather watch an unfiltered story from the source, as opposed to something that has been through the \"demographic machine\".  Watch this movie, a person like Terry Gilliam comes around very rarely.",
      "review_date": "2010-10-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gilliam slashed at the bloated stomach of the 80's and all its juicy guts spilled forth in this film. All the tidy systemic organs mingling with the filthy, slimy entrails, muddled together on the cutting room floor. He makes no Gilliam slashed at the bloated stomach of the 80's and all its juicy guts spilled forth in this film. All the tidy systemic organs mingling with the filthy, slimy entrails, muddled together on the cutting room floor. He makes no critique of the dystopian/utopian system depicted, only the shared humanity that is haplessly trapped in its process.",
      "review_date": "2009-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film deserves a place on the Voyagers golden record-plate, if NASA should send its probe after the completion of Brazil!",
      "review_date": "2010-02-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Brazil\" is such a bizarre and frantic movie that nobody can follow its pace. The story basically revolves on the same idea as well as focusing on unnecessary parts. Ultimately, despite the powerful ending, its a ideological mess.",
      "review_date": "2011-09-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nothing in my opinion!!!",
      "review_date": "2008-07-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of the most unentertaining movies I have ever seen.",
      "review_date": "2005-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Awful movie. This is one of those movies people who like to appear intelligent say they totally got, but they are lying. This movie doesn't make any sense.",
      "review_date": "2008-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Awful movie. This is one of those movies people who like to appear intelligent say they totally got, but they are lying. This movie doesn't make any sense.",
      "review_date": "2008-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A surprisingly and, it has to be said, disappointingly confusing film. Despite the fact that, in its attempt to convey the nightmare of a dystopian world, this film was wildly exciting for its time, a modern audience  perhaps less obsessedA surprisingly and, it has to be said, disappointingly confusing film. Despite the fact that, in its attempt to convey the nightmare of a dystopian world, this film was wildly exciting for its time, a modern audience  perhaps less obsessed and, indeed, excited by negativity  would find it difficult to follow. It targets a very niche audience, for whom I'm sure it interesting in its 'ostensible' ambivalence; however, as a universal film  that is, one which is available and accessible to the masses  it fails on a fundamental level: the plot line is insecure; it seems rushed and hurried, the proper planning of a film simply cast into the dystopian nightmare itself. No doubt, the integral themes and comments are there, but, ultimately, the watcher is so frustrated by the nonsensical plot line that any attempts to appreciate it are simply not worth the effort.",
      "review_date": "2013-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When government intrusion runs into every aspect of life, work is intolerably boring, as is entertainment. Technological progress is stunted. The most dangerous enemy of state is a maverick home repairman. The horrors of terrorism are hidden When government intrusion runs into every aspect of life, work is intolerably boring, as is entertainment. Technological progress is stunted. The most dangerous enemy of state is a maverick home repairman. The horrors of terrorism are hidden behind portable screens kept handy in public areas (officials apologize about any blood spatter). In Brazil life is so intolerable that escape into a polluted mud hole is cause for joy. Brazil is chilling assessment of the inevitable fruits of socialist attempts at utopia. I love this movie; it scares the hell out of me.",
      "review_date": "2009-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Such familiar ideas wouldn't have been a problem had it not been for the lazy and incoherent fashion in which they're put together in Brazil. The film deserves seven points for its distinctly Giliiam quirkyness and for it's Such familiar ideas wouldn't have been a problem had it not been for the lazy and incoherent fashion in which they're put together in Brazil. The film deserves seven points for its distinctly Giliiam quirkyness and for it's often crazy and at times wonderful art direction.",
      "review_date": "2005-09-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great movie - brilliant Gilliam as always!",
      "review_date": "2005-09-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the 20 or so movies that I can watch repeatedly over the years. It is a testament to Gilliam's genius that its message and its entertainment remain fresh 20+ years later.",
      "review_date": "2007-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Distopian, bleak, dirty, old, new and at times, funny as all get out; for those who fear for fate of the free world, this movie might just make you cry.",
      "review_date": "2008-11-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Close to a perfect movie but begins to lose focus as some great ideas give way to a formulaic plotline.",
      "review_date": "2008-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Alas, a film that is arty, but has at least some direction and purpose. There is something about Brazil, and it is that in amongst it's unpredictable evens, likable characters and unsettling imagery it manages not only to be consistenly Alas, a film that is arty, but has at least some direction and purpose. There is something about Brazil, and it is that in amongst it's unpredictable evens, likable characters and unsettling imagery it manages not only to be consistenly entertaining but it puts across a strong looming message that we should try as hard as we can to prevent society from becoming something akin to the world it presents. Perhaps the most disturbing thing is that this is remarkebly similar to how the owrld has turned out: plastic surgery, terrorist attacks, endless office jobs. Brazil is a brilliant film and, while not perfect, is worthy of all the acclaim that it has revieved over the years.",
      "review_date": "2005-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most beautiful movie's I have ever seen. Terry Gilliam is the only director who I feel has been able to take that special feeling you have in a dream and share it with the world. What I loved most was that the romance One of the most beautiful movie's I have ever seen. Terry Gilliam is the only director who I feel has been able to take that special feeling you have in a dream and share it with the world. What I loved most was that the romance wasn't erotic or lustful and all. It was honest and in a way childish and idealistic. The view shares the elated emotions of the main character as he meets his dream girl in reality. It felt infinitely more real than any relationship in frankly any movie I've ever seen before.",
      "review_date": "2007-04-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film can readily be interpreted in Lacanian terms: the Imaginary, the Symbolic and the Real; jouissance/enjoyment as an act of rebellion or subversion; the individual imagination vs. the oppressive state. 'Brazil' is very This film can readily be interpreted in Lacanian terms: the Imaginary, the Symbolic and the Real; jouissance/enjoyment as an act of rebellion or subversion; the individual imagination vs. the oppressive state. 'Brazil' is very clever and very watchable.",
      "review_date": "2008-02-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of Gilliam's more coherent efforts but includes his trademark lunacy. Pryce is good.",
      "review_date": "2020-03-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simultaneously the second entry into Terry Gilliam's \"Trilogy of Imagination\" and the first entry in his \"Dystopian Trilogy\", Brazil is a masterwork of pure satirical genius. More aligned with modern day America than I am comfortable toSimultaneously the second entry into Terry Gilliam's \"Trilogy of Imagination\" and the first entry in his \"Dystopian Trilogy\", Brazil is a masterwork of pure satirical genius. More aligned with modern day America than I am comfortable to admit, Brazil is a cautionary tale of government control where freedom is assumed, but is merely an illusion. Working in the Ministry of Information, Sam Lowry (Jonathan Pryce) is a lowly worker who just does as he is told and keeps plugging along with no aspirations for anything better. Except, he keeps having dreams where he is a winged angel and trying to save a mystery girl. Learning that this girl is Jill Layton (Kim Greist), Sam tries to find her, only to discover that the government believes her to be a violent terrorist. Now, he must subvert the government to find the girl that he loves. A visually rich and thematically dense film, Brazil is a hard nut to crack and though this review will make it sound like I know what I am talking about, allow me to assure you that the opposite is in fact true.In my review of Time Bandits, the first entry in the \"Trilogy of Imagination\", I highlighted one of the major themes in that work as being materialism. With a psychotic obsession towards material items over their own child, Kevin's parents in that film ignore him at all costs. Gilliam continues this thematic discussion in Brazil, except it takes on a particularly politically charged tone. During the Cold War, the American government equated the communists with being godless heathens. Therefore, to be truly godly, one must be a capitalist. As such, spending and material goods are good and a glory to God. Throughout the film, Gilliam critiques this idea with a visual motif of a glowing blue cross in various shots, but also takes shots at the biggest glorification to capitalism in existence: Christmas. Setting Brazil during Christmas time allowed Gilliam to adorn each scene with a reference to the gift giving holiday. Everybody in the film has some asinine gift they are carrying or give to another person. Sam receives presents from nearly everybody he sees in the film and it is never something he truly wants. Interesting to note as well that nobody says \"Merry Christmas\" in the film, rather they always say \"Happy Christmas\". However, Gilliam ensures that this is a religious critique during a sequence in a shopping mall. One boy is carrying what appears to be a folder that reads, \"Consumers for Christ\" on the cover. Similar to the glowing blue cross, this folder is also blue. Highlighting the capitalist indoctrination disguised as Christianity, Gilliam decries the linking together of religion and mindless consumption above all else. This is further emphasized through Sam's mother (Katherine Helmond) and her friend Mrs. Terrain (Barbara Hicks). The two are constantly getting face lifts to look younger and while Mrs. Lowry's goes fine, Mrs. Terrain is constantly shown with bandages due to her complications having complications. For Gilliam, this is a way of punishing the vanity and mindless materialism and consumption that has gone on in our present society.This is further underscored in a callback to Sergei Eisenstein's Battleship Potemkin and the famous Odessa steps sequence. In that famous sequence, people are gunned down on the Odessa steps by guards and, as she runs down, a mother's baby carriage gets stuck and begins to tumble down the steps. Gilliam takes this scene as inspiration towards the end as Sam has a dream about escaping from the prison he is held in. During his breakout - with the help of Archibald \"Harry\" Tuttle (Robert De Niro) - the guards in the Ministry of Information are shooting at the escapees from the stairs and begin walking down them. As they do, a vacuum tumbles down the steps akin to the baby carriage in Battleship Potemkin. Here, Gilliam creates a parallel between the baby and the vacuum, in essence saying that we now serve machines and the system, instead of our children and one another. Our purpose and focus in life has shifted from each other to the soulless machines in the name of innovation. This is further confirmed, in hindsight, by a sequence earlier in the film. The chief torturer of the Ministry of Information is a friend of Sam's named Jack (Michael Palin). While visiting with Jack, Sam sees Jack speak to one of his three children. During this conversation, Jack calls the girl \"Amy\" and later \"Chloe\", despite the girl's protests that she is actually \"Holly\". He seems disinterested and makes a crack about never really knowing anymore. For Jack and for everybody else living in this dystopian society, the only things that matter are work, consumption, and maintaining the status quo determined by those in power. All else fall by the waste side, especially family. Viewed in conjunction with the vacuum/baby carriage parallel, it is clear that Gilliam wishes to highlight this as a major fault in our present society.",
      "review_date": "2017-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Terri Gilliam has a unique vision that he brings to all his films. Having seen Brazil after 12 monkeys and Fear and Loathing this was not unexpected. However both those films are relatively simple and straightforward compared to this one.Terri Gilliam has a unique vision that he brings to all his films. Having seen Brazil after 12 monkeys and Fear and Loathing this was not unexpected. However both those films are relatively simple and straightforward compared to this one. Everything about this film adds up eventually. But along the way a lot of things seem strange and out of place. This helps add to the atmosphere of a capitalist bureaucracy run amok. Indeed some of the simplest things make for the most disturbing of scenes. Whether its a truck driving between two walls of advertisements, unable to see beyond. Or the occasional double take scene where the main protagonists nightmares are gradually stepping into reality. Or the simple yes/no decision maker present people give each other everything about this film it some way relates to a different concept or theme than the one that is being shown at the time. It is a terrifying vision to be sure. Masterfully executed.",
      "review_date": "2014-07-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A clever and satyric dystopia exposing the troubles of bureaucracy and other ills of modern society. Sometimes it looks like a grotesque comedy and sometimes it is really scary in it's totalitarian terror with a surrealistic touch of TerryA clever and satyric dystopia exposing the troubles of bureaucracy and other ills of modern society. Sometimes it looks like a grotesque comedy and sometimes it is really scary in it's totalitarian terror with a surrealistic touch of Terry Gilliam. So I believe the movie was actual back in 1985 and still it is actual nowadays.",
      "review_date": "2013-09-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Terry Gilliam is out of his mind - that almost goes without saying. But the answer to whether or not his insanity is genius or just deeply incomprehensible may lie somewhere in \"Brazil.\" Killing it on nearly every technical aspect ofTerry Gilliam is out of his mind - that almost goes without saying. But the answer to whether or not his insanity is genius or just deeply incomprehensible may lie somewhere in \"Brazil.\" Killing it on nearly every technical aspect of filmmaking -- sets, makeup, costuming, cinematography, vfx -- and providing a tidal wave of hard-to-swallow narrative threads, Gilliam's 1985 epic is quite the head-scratcher, but a pretty one at that.",
      "review_date": "2015-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The critics love this movie, but somehow I didnt enjoy it much. I guess it is too surrealistic. I didnt like the protagonist Sam Lowry and his teenage like behaviour to another character I didnt like, Jill Layton, who was half a man. So ofThe critics love this movie, but somehow I didnt enjoy it much. I guess it is too surrealistic. I didnt like the protagonist Sam Lowry and his teenage like behaviour to another character I didnt like, Jill Layton, who was half a man. So of course I didnt like their \"love\" also.And somehow the movie felt very long. Also the visual effects and sets needed much bigger budget in my view, because they look cheaply. The dystopian and bureaucratic world is well made though and something you will not forget so fast. And also there are some popular actors.",
      "review_date": "2021-05-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "'Brazil', for its Pythonesque surrealism and farcical humour, is quite prophetic; this Orwellian black comedy depicts the ludicrous, overly bureaucratic society that the United States is converting, maybe already converted, into. It's almost'Brazil', for its Pythonesque surrealism and farcical humour, is quite prophetic; this Orwellian black comedy depicts the ludicrous, overly bureaucratic society that the United States is converting, maybe already converted, into. It's almost a frightening prospect I think many of us will have to accept. To find the similarities was certainly terrifying for me.",
      "review_date": "2015-07-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Another favorite, Brazil is well written, well acted, well made, and very funny. If you were a fan of Time Bandits you should enjoy this. Funny when it needs to be, but smart when it must be. This is a re-watchable film with a great comedian,Another favorite, Brazil is well written, well acted, well made, and very funny. If you were a fan of Time Bandits you should enjoy this. Funny when it needs to be, but smart when it must be. This is a re-watchable film with a great comedian, Terry Gilliam, behind it.",
      "review_date": "2014-06-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Brazil is such an amazingly imaginative film, it makes you wonder how it ever managed to get produced. The direction takes you on this stunning roller coaster ride through a dystopia theme park. The dark humor works great, with the worldBrazil is such an amazingly imaginative film, it makes you wonder how it ever managed to get produced. The direction takes you on this stunning roller coaster ride through a dystopia theme park. The dark humor works great, with the world being so terribly bad that it is more ridiculously funny than horrifying. All-in-all Brazil is one of those films where you have to see it, even if you end up not liking it, to at least have seen it.",
      "review_date": "2015-09-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Terry Gilliam's Brazil is a highly engaging black comedy that uses a dystopian society as its backdrop, and puts a unique twist on the genre, and through Gilliam's camera lens, it's a truly bizarre and memorable vision. The dystopian genre isTerry Gilliam's Brazil is a highly engaging black comedy that uses a dystopian society as its backdrop, and puts a unique twist on the genre, and through Gilliam's camera lens, it's a truly bizarre and memorable vision. The dystopian genre is very interesting, and it's one that is always exciting to see what they'll come up with it. With Brazil you have something totally different, you have hints of humor thrown into the film's storyline, and it adds something to the enjoyment of the film. Dystopian society films are often dark, nightmarish portraits of a society, but with this film we get something very different. The formula here has been reworked to give the storyline a bit more range than your standard dystopian film, and in turn it makes for a truly engaging experience. In the hands of Terry Gilliam, you have a well crafted picture with some truly stellar performances from its cast, especially from lead actor Jonathan Pryce who lights up every scene that he's in. Brazil is a great film, one that succeeds at delivering a different take on your standard dystopian society film, and in the hands of Terry Gilliam, he crafts a standout picture that is sure to please genre fans looking for something a bit different. Brazil is eccentric in the way that it's told, and it makes for a truly entertaining two and a half hours. If you enjoy Gilliam's work, you're sure to enjoy this. What makes Brazil great is the fact that it has your standard dark, atmospheric elements than are synonymous with the genre, but there are also lighter touches comic relief to really make it stand out among other films. Brazil is great filmmaking and one of the finest dystopian society films I've seen. With a great mix of comedy and serious content, Brazil is a standout genre film that elevates the bar and makes for a truly worthwhile viewing experience.\r I have thought of my own reason why this movie is called Brazil/ the ending, reason 1, obviously is that the song 'Brazil' is played numerous times throughout the film.\r Reason 2: So, I've never been to Brazil and when I look up Google images and I see these beautiful pictures of Rio de Janeiro etc. and the amazing weather, it just looks like the dream place to live, a paradise....but apparently it's a pretty dangerous place to live, with the slums it has a pretty high death rate, you have to be smart and know what streets are safe to walk down ect. It's safe to pressume Brazil is a False paradise.\rJust like the end of the film is a false paradise for Sam. He's living the perfect life in his mind with his dream girl away from all the faulty machinery that's been ruining his whole life...but in reality, he's not in paradise, he's strapped in a chair without a state of mind. And to top things off he hums the song Brazil before the credits role indicating that he's in a false paradise.?",
      "review_date": "2016-05-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is one of those science-fiction motion pictures people may not have seen for many years, a remarkable cinematography, sets and greatest direction by Terry Gilliam, full of images that you need to experience with and those images haveIt is one of those science-fiction motion pictures people may not have seen for many years, a remarkable cinematography, sets and greatest direction by Terry Gilliam, full of images that you need to experience with and those images have representations. If someone who is a Monty Python fan, I highly recommend this.",
      "review_date": "2016-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Brazil is one of the best adaptations of dystopias. Stylistically, the film is very similar to 1984. The world in which bureaucracy is elevated to absolute. And although the plot cannot be called holistic, it is both protracted and sometimesBrazil is one of the best adaptations of dystopias. Stylistically, the film is very similar to 1984. The world in which bureaucracy is elevated to absolute. And although the plot cannot be called holistic, it is both protracted and sometimes tedious. The end of the film is very long and delusional, which only spoils the impression of the film.",
      "review_date": "2021-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Terry Gilliam probably signs his best film. A dystopian future, where work, obedience to the government and the infernal bureaucracy dominates, a man has the courage to challenge the system, allowing himself to love a woman freely, meetingTerry Gilliam probably signs his best film. A dystopian future, where work, obedience to the government and the infernal bureaucracy dominates, a man has the courage to challenge the system, allowing himself to love a woman freely, meeting his tragic fate.The citations to 1984 written by Orwell are obvious, just as the citations to other great movies like Armor Potemkin are clear and make you realize the genius of a director who was too underrated.",
      "review_date": "2017-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Though more impressive from a visual standpoint than for tight plotting, Terry Gilliam's dystopian masterpiece is as much Orwellian nightmare as it is dark comedy. Jonathan Pryce's turn as the emasculated Sam Lowry is a delight to watch. WhenThough more impressive from a visual standpoint than for tight plotting, Terry Gilliam's dystopian masterpiece is as much Orwellian nightmare as it is dark comedy. Jonathan Pryce's turn as the emasculated Sam Lowry is a delight to watch. When not entrenched in the grey, monochromatic offices in the Ministry of Information, Lowry is soaring like Icarus in the paradise of his imagination, the only respite from the repressive bureaucracy which dominates every aspect of society. Like \"1984,\" but with a wicked sense of humor, Gilliam's \"Brazil\" is bound to captivate audiences for generations to come.",
      "review_date": "2017-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is like a weird dystopian nightmare - less V for Vendetta and more 1984-ish, with a heavy emphasis on 'Big Brother' and government ministries. I knew it'd likely be a bit weird but it really is rather bonkers and there's not much contextThis is like a weird dystopian nightmare - less V for Vendetta and more 1984-ish, with a heavy emphasis on 'Big Brother' and government ministries. I knew it'd likely be a bit weird but it really is rather bonkers and there's not much context or information provided to the viewer as it goes on - we have to guess things as and when.I recognised a number of well known comedian/actors, including Bob Hoskins, Gorden Kaye, Michael Palin and of course Robert DeNiro. There is some witty dialogue present but its not what I'd call a particularly accessible film - its very quirky and surreal with a weighty feel to it, so you have to be in the right sort of mood for it I suppose. It's very much a film about corporate and indeed government based bureaucracy. It's quite dark in terms of the themes covered and the visual look of the film - most settings are in barely lit dark rooms. I suppose it does well at putting an oppresive feel across. I did laugh a bit at the scenes depicting a worker or manager being hounded by a gang of other workers asking him questions, as he rushed down a long, long hall, reminiscent of MPs being hounded by the press I suppose (not that I feel sorry for them most of the time), due to the upbeat music played during these sequences.There's an element of riddle present in some of whats said and given this film dates from the mid 1980s, its visually somewhat dated, a little like Blade Runner, only without the flying cars obviously. This is quite a niche sort of a film - not one that will likely appeal to too many people, certainly on first watch. I wouldn't really recommend this as such, as I don't think its the kind of film that will appeal to many unless your really in the mood for something off-centre.",
      "review_date": "2022-10-01",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 66,
  "genres": [
    "Sci-Fi",
    "Drama",
    "Fantasy"
  ]
}