{
  "title": "The Color Purple",
  "rating": 8.4,
  "release_date": "1985-12-18",
  "genre": [
    "Drama"
  ],
  "summary": "In rural Georgia during the first half of the 20th century, Celie (Whoopi Goldberg) is married off to an abusive man (Danny Glover) after becoming pregnant by her own father. Based on Alice Walker's Pulitzer Prize-winning novel.",
  "critic_reviews": [
    "The affirmation at the end of the film is so joyous that this is one of the few movies in a long time that inspires tears of happiness, and earns them. The Color Purple is the year's best film.",
    "To miss this film is to cheat yourself and your family of a memorable moviegoing experience.",
    "Spielberg lacks his usual intuitive affinity for his story material; consequently the film is a bit clunky at times. There are some unfortunate slapstick comic relief sequences and a few of the characterizations are also much too broad and cartoonish.",
    "Some parts of it are rapturous and stirring, others hugely improbable, and the film moves unpredictably from one mode to another. From another director, this might be fatally confusing, but Mr. Spielberg's showmanship is still with him. Although the combination of his sensibilities and Miss Walker's amounts to a colossal mismatch, Mr. Spielberg's ''Color Purple'' manages to have momentum, warmth and staying power all the same.",
    "There are some great scenes and great performances in The Color Purple, but it is not a great film. Steven Spielberg’s turn at ‘serious’ filmmaking is marred in more than one place by overblown production that threatens to drown in its own emotions. But the characters created in Alice Walker’s novel are so vivid that even this doesn’t kill them off and there is still much to applaud (and cry about) here.",
    "This time out, Spielberg has chosen to put an antic disposition on, and with the single exception of casting, his almost every decision has been disastrous. He has prettified or coarsened; he has made comic scenes broadly slapstick and tiptoed over the story's crucial relationship. The result, alas, is the film purpled."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Very good but depressing.  All of the acting and directing was done very well.  And yet, I don't care to ever sit through it again.",
      "review_date": "2011-03-04"
    },
    {
      "review_title": null,
      "content": "The Color Purple is a truly amazing film!",
      "review_date": "2009-01-06"
    },
    {
      "review_title": null,
      "content": "Epic film that your enjoyment of will depend on your investment in the characters. I was a bit bored.",
      "review_date": "2019-09-05"
    },
    {
      "review_title": null,
      "content": "The kind of film that makes you feel warm on the inside, \"The Color Purple\" is a true testament to the directorial versatility of Steven Spielberg, the acting talents of Whoopi Goldberg, Oprah Winfrey, and Danny Glover, and the true triumphThe kind of film that makes you feel warm on the inside, \"The Color Purple\" is a true testament to the directorial versatility of Steven Spielberg, the acting talents of Whoopi Goldberg, Oprah Winfrey, and Danny Glover, and the true triumph of human spirit.",
      "review_date": "2013-10-15"
    },
    {
      "review_title": null,
      "content": "The Color Purple is probably one of the most poignant and amazing films of Steven Spielberg's career. I am still surprised Whoopi Goldberg didn't win the Oscar as her portrayal of Celie is beautiful, deep and heartbreaking.",
      "review_date": "2019-06-21"
    },
    {
      "review_title": null,
      "content": "Moving and uplifting, the performance of Whoopi Goldberg is outstanding and powerful, beautiful movie",
      "review_date": "2020-02-16"
    },
    {
      "review_title": null,
      "content": "There are some great scenes and great performances in The Color Purple, but it is not a great film. Steven Spielberg’s turn at ‘serious’ filmmaking is marred in more than one place by overblown production that threatens to drown in its ownThere are some great scenes and great performances in The Color Purple, but it is not a great film. Steven Spielberg’s turn at ‘serious’ filmmaking is marred in more than one place by overblown production that threatens to drown in its own emotions. But the characters created in Alice Walker’s novel are so vivid that even this doesn’t kill them off and there is still much to applaud (and cry about) here.\r Walker’s tale is the story of a black family’s growth and flowering over a 40-year period in the south starting around 1909. At the center of everything is Celie, who as a young girl gives birth to two children and is then married into a life of virtual servitude to a man she can refer to only as Mr (Danny Glover).\r Above all The Color Purple is a love story between Celie and her sister, Nettie, from whom she is separated at childhood, and, later in life, the blues singer Shug Avery.\r Saving grace of the film are the performances. As the adult Celie debuting Whoopi Goldberg uses her expressive face and joyous smile to register the character’s growth. Equally good is Glover who is a powerful screen presence.",
      "review_date": "2016-03-06"
    },
    {
      "review_title": null,
      "content": "By now, you shouldn't even check your watch or wallet or anything, it always will be a Spielberg classic.The Color Purple\n\nSpielberg is a kind of filmmaker you can invest on for a longer period. And I don't just mean it because he makesBy now, you shouldn't even check your watch or wallet or anything, it always will be a Spielberg classic.The Color PurpleSpielberg is a kind of filmmaker you can invest on for a longer period. And I don't just mean it because he makes these long films. But because he can blend into any genre instantly. And it is not that he just qualifies for that project. He excels it. His durability is a dangerous skill that he carries so effortlessly. And usually the director Steven Spielberg is famous for working with props. And I was looking forward to this drama. And see how he binds this thick script with various personified objects. But there isn't any. This disappointment is the best thing that happened to me. And to even the film.This is not your Spielberg film anymore. I think this is more Sergio Leone-isc. The faces are captured. Well, to be precise the emotions are captured. Call it a tensed phase of the film where you see a sweating face or call it an engaging phase where the eyes turn red and insults empower the rage or my personal favourite, a face whispering a peace sign when it was supposed to scream war. These close up shots is what's decided by the director and is then, these decisions that sweetens the bitter pill.For no one is more present then Spielberg, himself on the set. He makes sure that you are there for that action. No matter how mundane an activity is. No matter if it is just shaving. The Color Purple isn't painted bright by that intense background score or the sheer hatred that ignites the friction between two characters, it is those kids mimicking the actual activity, the shaving, with a leaf as their replica. Something so innocent, scientific and magical can only be present in Spielberg's house. You better warm up, you have to stay for decades here.",
      "review_date": "2019-09-16"
    },
    {
      "review_title": null,
      "content": "Based on a book, the film tells the life of a young black woman who lived a good part of her life being brutalized by her father and her husband. This is a Spielberg movie, starring Whoopi Goldberg as the protagonist. Its story, touching andBased on a book, the film tells the life of a young black woman who lived a good part of her life being brutalized by her father and her husband. This is a Spielberg movie, starring Whoopi Goldberg as the protagonist. Its story, touching and powerful, directly confronts the racism and machismo of a more conservative America. It's an exciting film, although the director makes a huge effort to avoid sentimentality (not always with success). Goldberg also shone, was totally at the level of the character in front of us, and proved to be extremely versatile, especially if we consider her to be an actress more accustomed to humor characters or a considerably more pronounced personality than Celie Johnson, a A woman clearly traumatized and accustomed to keeping her head down. Very different is the character who stunned the yet-unknown Oprah: Margaret Avery also came downstairs and knew what it was like to beat a man but her strong personality taught her to fight back. A final word for the scenarios, careful and detailed, appropriate to the time portrayed.",
      "review_date": "2018-06-28"
    },
    {
      "review_title": null,
      "content": "Meio parado mas a historia é sensacional, comovente mesmo, as atuações e filmagens, nem parece que sao de quase 40 anos atrás, filmaço",
      "review_date": "2023-02-25"
    },
    {
      "review_title": null,
      "content": "The Color Purple is really something that you will never expected to be directed by Steven Spielberg, yes, the guy who directed Jaws, ET, and Indiana Jones, the result? Incredible, with Whoopi Goldberg amazing perfomance, Oprah WinfreyThe Color Purple is really something that you will never expected to be directed by Steven Spielberg, yes, the guy who directed Jaws, ET, and Indiana Jones, the result? Incredible, with Whoopi Goldberg amazing perfomance, Oprah Winfrey outstanding debut perfomance, The Color Purple really mixed my feeling with all the sadness and happiness that really work for me, The Color Purple is really a big new game by Steven Spielberg, i highly recommended.",
      "review_date": "2021-06-04"
    },
    {
      "review_title": null,
      "content": "Easily one of the worst spielberg movies. It looks like a film aimed at extorting the easy tear of the average low-level viewer. The film that would mean a lot actually says very little. One of those films that you could easily remove fromEasily one of the worst spielberg movies. It looks like a film aimed at extorting the easy tear of the average low-level viewer. The film that would mean a lot actually says very little. One of those films that you could easily remove from spielberg's filmography without it losing quality.",
      "review_date": "2022-08-27"
    }
  ],
  "num_reviews": 18
}