{
  "title": "The Breakfast Club",
  "rating": 8.5,
  "release_date": "1985-02-15",
  "genre": [
    "Drama"
  ],
  "summary": "We accept the fact that we had to sacrifice a whole Saturday in detention for whatever it was that we did wrong. What we did WAS wrong. But we think you're crazy to make us write this essay telling you who we think we are. What do you care? You see us as you want to see us...in the simplest terms and the most convenient definitions. You seeWe accept the fact that we had to sacrifice a whole Saturday in detention for whatever it was that we did wrong. What we did WAS wrong. But we think you're crazy to make us write this essay telling you who we think we are. What do you care? You see us as you want to see us...in the simplest terms and the most convenient definitions. You see us as a brain, an athlete, a basket case, a princess and a criminal. Correct? That's the way we saw each other at seven o'clock this morning... - The Breakfast Club… Expand",
  "critic_reviews": [
    "The performances by the young cast, culminating in an exuberant pot-smoking session, followed by a genuinely touching denouement, is classic stuff. And such lines as: \"The chick can't hold her smoke!\" and \"You wouldn't know her, she lives in Canada,\" are still spouted today.",
    "Nelson is jarring, scary and brilliantly bitter.",
    "The quintessential Brat Pack vehicle, hampered by Hughes’s willingness to pigeonhole his protagonists in exactly the same manner as they accuse Vernon of doing, The Breakfast Club is hopelessly tethered to its era in ways that the same year’s other major high school-themed blockbuster, Back to the Future, isn’t.",
    "This could have been an unmitigated disaster, but Hughes' way with the material ensured it a special place in the heart of just about everyone who happened to be in high school while Ronald Reagan was President.",
    "As he proved in the far funnier and livelier \"Sixteen Candles,\" Hughes has a wonderful knack for communicating the feelings of teenagers, as well as an obvious rapport with his exceptional cast — who deserve top grades.",
    "Hughes has made funnier (Ferris Bueller) and better (Pretty In Pink), but this is the only one you could get away with calling iconic. Good and bad, it's still the definitive '80s teen movie - and, to paraphrase Simple Minds - don't you forget about it.",
    "Before lapsing into the land of the insipid,... John Hughes actually made a few movies that shined some light on the trials of modern adolescence. The Breakfast Club is one of them.",
    "From the neon-sign opening titles to the derivative angst of the dialogue, it's a touchstone of '80s pop culture, and a schizophrenic one, too.",
    "Eminently watchable and consistently entertaining...It has a candor that is unexpected and refreshing in a sea of too-often generic teen-themed films.",
    "For all its contrivance, it's lively and amusing and occasionally disconcerting in its reproduction of what life was like in the mid-to-late teens.",
    "The Breakfast Club doesn't need earthshaking revelations; it's about kids who grow willing to talk to one another, and it has a surprisingly good ear for the way they speak.",
    "Comes to the comforting conclusion that they're just as alienated, idealistic, and vulnerable as the baby boomers of the 1960s.",
    "Hughes, though he gives the material a sense of fun and achieves several moments of genuine warmth, too often resorts to obvious cliches, stereotypes, and easy answers, and throws in the near-obligatory rock video as well.",
    "The five young stars would have mixed well even without the fraudulent encounter-group candor towardS which The Breakfast Club forces them. Mr. Hughes, having thought up the characters and simply flung them together, should have left well enough alone.",
    "Hughes may deserve more plaudits as a social worker than a filmmaker, but you have to admit his hokey situation plays. The reason is the five terrific young actors, who bring more conviction to these parts than they perhaps deserve.",
    "Does director John Hughes really believe, as he writes here, that 'when you grow up, your heart dies.' It may. But not unless the brain has already started to rot with films like this.",
    "High school detention, most will attest, is a grim and dull experience. This film is not only about high school detention, it is similar to it. Audience members may feel like they've been sentenced, along with the five principals, to a day in the library, just sitting and doing nothing. While high schoolers will recognize some shrewd satiric hits in Breakfast Club, the film is tedious and unpredictable. Unless the nation's teachers decide to make it required viewing, this grueling Illinois-set presentation should be about as popular with teenage moviegoers as additional homework.",
    "Which would be fine, were the characters not a punchable quintet of overdrawn saps, the acting (Ringwald and Hall excepted) overplayed and unsympathetic, and the script the wrong side of the line that separates smart from smart-arse. Its continuing cult popularity is mystifying; as teen movies go, this is a long way off, say, Fast Times at Ridgemont High or Pretty in Pink. Hughes: stay behind for detention afterwards. And write me four sides on why this, uh, sucks."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "One of the most honest movies ever made, The Breakfast Club ranks with flawless social dramas such as American Beauty.",
      "review_date": "2012-11-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ok If you love John Hughes 80's flicks, You Will love this one. I don't really like the swearing from Bender , but it is hilarious none the less. There are some real dramatic scenes with confessions but that is what makes it real. My FavoriteOk If you love John Hughes 80's flicks, You Will love this one. I don't really like the swearing from Bender , but it is hilarious none the less. There are some real dramatic scenes with confessions but that is what makes it real. My Favorite Character was Emilio Estevez. He is very sexy football player. That knows what he did was wrong but did it anyway. This is a life learning movie. I also don't like the fact that Bender Makes fun of Brian's life just because he is a nerd. Nothing wrong with being smart. Just remember that. But the dancing scene is fun, and the classic \"Running through the halls scene\" Check it out and let me know what you think of this 80s classic.",
      "review_date": "2011-08-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I decided to review this film mainly as an excuse to see the film again (although itâ",
      "review_date": "2012-01-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hey I meant to write ten, but my computer won't let me change it. But anyways, I want you all to know that I am a struggling screenwriter in Hollywood. Actually, i was just commissioned to write a screenplay, so perhaps I won't be strugglingHey I meant to write ten, but my computer won't let me change it. But anyways, I want you all to know that I am a struggling screenwriter in Hollywood. Actually, i was just commissioned to write a screenplay, so perhaps I won't be struggling much longer but I do want you to know that this movie made me into what I am today. This film is so moving, so influential, it inspired in me a lifelong passion for film and it made me think.Mainstream critics are jerks. Best movie of all time.",
      "review_date": "2011-11-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "How can you not like it? I've seen it so many times and just saw it again recently and it still cracks me up. It's a freaking classic, Plain and simple.",
      "review_date": "2013-11-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a great look at high school life. As with real life, everybody has a story and inner demons, whether they show them frequently or not. Everybody is also divided based on \"status\" and rarely get to actually talk to people from otherThis is a great look at high school life. As with real life, everybody has a story and inner demons, whether they show them frequently or not. Everybody is also divided based on \"status\" and rarely get to actually talk to people from other \"cliques\", as is shown here. That is what makes this film so special, as it breaks down those walls and allows everyone from every different clique to really see the others as they truly are: people just like them. However, what I really liked about the film is one of the discussions they have at the end, where they discuss how their friendships will be once detention ends. This discussion really rings true as I think everybody knows that these kids will never see one another afterwards and, if they do, they may ignore them or mock them after seeing them because of high school social pressures. While this one is a very accurate representation of high school and all of its oddities, it is also very funny. At many times, I found myself laughing quite hard at something somebody said or did. Overall, this is a very good film and I feel ashamed for just watching it now.",
      "review_date": "2014-06-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the story I wish I could write. I was writing a story similar to this but after I watched this movie I gave up because I could never write it as good as this. If Ferris Bueller's Day Off was the lighter side of high school with someThis is the story I wish I could write. I was writing a story similar to this but after I watched this movie I gave up because I could never write it as good as this. If Ferris Bueller's Day Off was the lighter side of high school with some of the dark bits, The Breakfast Club (also written by John Hughes) was the darker side of high school with some of the lighter bits. It is so dark at time dwelling into the psyche of the characters but its at the same time so incredibly funny. Each character is done so well and each has their own story arc. Brian gains some friends, Andrew learns to accept other people, Claire learns to love, Allison learns to act in society, Bender gets accepted by other people, and even the principal learns to understand that he is just like the students. My only real problem is the end of the movie for two characters. And without giving away any spoilers, it isn't really fulfilling, especially with the connection the two build in the movie, that's my opinion at least.",
      "review_date": "2013-08-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a great interesting and touching drama, with parts that are hilarious. This movie is definitely worth watching    .",
      "review_date": "2015-03-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Breakfast Club\rYou would think that the 1985 film The Breakfast Club would be about breakfast lovers, but prepare to be thoroughly surprised. This film appeals to an audience of all mature ages with its adult humor and abundance ofThe Breakfast Club\rYou would think that the 1985 film The Breakfast Club would be about breakfast lovers, but prepare to be thoroughly surprised. This film appeals to an audience of all mature ages with its adult humor and abundance of emotions being thrown at you at once. Even though the humor may not appeal to everyone, the meaning behind this film is definitely a classic that can be enjoyed by everyone. From the beginning to the epic ending, the entire story line has a smooth flow that tells the story of five different characters coming together. The audience will also notice how the writer, John Hughes, used pathos in his work so that the audience could really relate to the characters and their stories they tell. This is one of those films that will definitely have the audience intrigued and wanting more.\rEmilio Estevez, Anthony Michael Hall, Judd Nelson, Molly Ringwald, and Ally Sheedy play the main characters portrayed in this film. Throughout the film, you can tell the actors all work very well together and perfectly depict their roles. In this film the five main characters act as “a brain”, “an athlete”, “a basket case”, “a princess”, and “a criminal”, who come together for Saturday detention. At first the group doesn’t get along but throughout the film they come together to become a close group of acquaintances who call themselves “The Breakfast Club”. Due to all these different types of characters, all kinds of audiences can relate to the emotional connection these characters represent. In the film, the character Andrew Clark played by Emilio Estevez says, “We’re all pretty bizarre. Some of us are just better at hiding it, that’s all”. One of the main themes of this movie is that no matter how different a group of people are, they can still come together and learn to understand one another.\rThe story line of this film is nearly flawless. Every scene flows and never has a dull moment. Each character has a different story to tell that eventually we find out near the end of the film. With each story comes an overwhelming flow of emotion. The audience can see that John Hughes used pathos to connect with his audience, and it works. For example, Emilio Estevez who plays the athlete named Andrew Clark comes out to say he doesn’t feel like he’s ever good enough for his father’s standards which hits home with a lot of people and they connect with it. In one scene, Judd Nelson who plays John Bender, says “Screws fall out all the time, the world is an imperfect place”. Even though the group doesn’t know that much about each other, they support each other emotionally because they all have feelings and know what it’s like to feel like that. This is one of the most moving and memorable scenes in the film.\rThe way this movie was filmed, also known as the camera viewpoint, plays a big part in how well this movie was produced. The actor’s facial expressions, physical emotions, and line delivery also play a huge part in the pathos stated in the previous paragraph, and help justify how powerful and moving this film really is. You can tell that the actors really connected with their character and are seeing themselves become their character when they speak. The actors use a lot of their emotion to portray how their character is feeling at that time and place depending on the scene. There is also what’s called symbolic images which is when filmmakers direct the attention of the audience to the deeper underlying approach the film is taking. An example of this is when Claire, played by Molly Ringwald tells John Bender, played by Judd Nelson, to stop back talking the principal so he will not get in any more trouble and in attempt to protect him. Little does the audience know, a romance will bloom between the two. The director also uses audio techniques to really connect with the audience. In the final scene right before the film cuts off to the credits, John Bender is walking across the football field while the song “Don’t You (Forget About Me)” by Simple Minds is playing and Bender sticks his fist in the air. Making this scene one of the most iconic scenes in all film history, because everyone will think of that scene when they hear this song.\rFor me personally, this movie taught me multiple different life lessons in what felt like a very fast 98 minutes. It teaches the audience that no matter how different you may think a group of people are, they can still have things in common and you find the best of friendships with each other. This film also teaches that you can find romance in the strangest types of people. The criminal ends up falling for the preppy girl who thinks of herself as a princess while the athlete falls for the basket case. All in all, the film is not only a comedy with plenty of drama, but a film that we can all take something from, regardless of age.\rAlthough this is a phenomenal film, some may argue that it is inappropriate for some ages. While the film is rated R, there is many sexual references and vulgar language throughout the film making it ill-suited for younger viewers. For example, one scene Bender is being very descriptive about being intimate with a girl while talking to Claire, clearly making her uncomfortable. This movie is highly recommended for mature viewers or younger viewers with their parents’ consent since it can be slightly raunchy at some parts of the film, for certain age groups.\rIn conclusion, The Breakfast Club can appeal to all types of viewers since it contains all kinds of humor. Not only is the story line flawless, but it’s one of the most moving films ever produced. With the use of pathos, John Hughes has done a fantastic job connecting his audience to tangible feelings in his film. Not only just with emotions, but the way the movie was filmed just adds to the experience and the lessons this film puts out.",
      "review_date": "2014-12-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "different  lives shown  and explored.\rShows how we are all connected, but different and our choices to accept, deny, or ignore.\rFun, dark and a must.",
      "review_date": "2015-07-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The incredible thing about this movie is that the premise seems so incredibly boring, and it could have been so incredibly boring, but it isnt! The Breakfast Club is a warm, insightful and hilarious movie about a group of seemingly polarThe incredible thing about this movie is that the premise seems so incredibly boring, and it could have been so incredibly boring, but it isnt! The Breakfast Club is a warm, insightful and hilarious movie about a group of seemingly polar opposites of each other.\rThis is a character driven performance piece, despite only starring young actors and a always hilarious **** teacher and a delightfully innocent janitor who sometimes walks into scene. But what mostly keeps this movie together is not the fantastic script, but the engaging, interesting, hilarious **** of a character, beautifully portrayed by Judd Nelson called ''John Bender'', every scene he is in (quite alot), he steals the show. He is just so engaging, your eyes are glued to him whenever he says or does something, it is Judd Nelson who is unforgettable as Bender that acts as the catalyst of everyone's emotions.\rOn top of that the last half hour of The Breakfast Club, is truly incredible, emotional and heartbreaking. Every actor in this film shows their true potential there, and oh boy do they all shine.\r With ''The Breakfast Club'', John Hughes shows us once again why he is the king of 80's comedies.",
      "review_date": "2016-05-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very funny, interesting and awesome. I loved it, John Bender's character was great. The greatest movie based off high school in history. A movie that will always be remembered. Many references in good shows today such as simpsons, futurama,Very funny, interesting and awesome. I loved it, John Bender's character was great. The greatest movie based off high school in history. A movie that will always be remembered. Many references in good shows today such as simpsons, futurama, Family guy, etc.",
      "review_date": "2010-08-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Breakfast Club introduces us to five teenagers who, initially at least, appear to have little in common other than the fact that they are all due to spend their Saturday together in school detention.\r Starting from a point in which theThe Breakfast Club introduces us to five teenagers who, initially at least, appear to have little in common other than the fact that they are all due to spend their Saturday together in school detention.\r Starting from a point in which the characters come across as little more than stereotypes (jock, nerd, prom queen etc) writer John Hughes excellent script develops each of them over the hour and a half running time, arguably painting a more realistic picture of teenage life than any movie before and since. Admittedly none of the kids revelations are all that surprising, and critics would argue that everything is perhaps wrapped up a little too neatly, but The Breakfast Club is a still a movie that lives up to its lofty reputation.",
      "review_date": "2014-07-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "most overhyped movie of all timeTHESE ARE EXTRA CHARACTERSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS",
      "review_date": "2010-08-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An iconic 80's film, and a great 'coming of age' film to watch. I love the character development in it also.",
      "review_date": "2019-01-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "the breakfast club is a film for melodramatic teenagers and impudent a-hole critics with absolutely no idea of what's it like to be a teenager. because clearly it all comes to down generations and generations pass from one era to the nextthe breakfast club is a film for melodramatic teenagers and impudent a-hole critics with absolutely no idea of what's it like to be a teenager. because clearly it all comes to down generations and generations pass from one era to the next era. in the end, this film has a very abused message with foul mouthed stereotypical teenagers who have few similarities to reality and a director he lives under a rock. the breakfast club is possibly the worst teenage film ever, john Hughes worst film of all time, and one of the worst movies I have ever seen in my young life. in other words it is a mutant abomination bred by poor directing and crude humour and a true disgrace to the cinema itself.",
      "review_date": "2015-03-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie was alright, the performances were good, the directing was solid and the screenplay was alright, just as the movie. When a movie depends too much on the script, you have to make it great in order to make a great production (a greatThe movie was alright, the performances were good, the directing was solid and the screenplay was alright, just as the movie. When a movie depends too much on the script, you have to make it great in order to make a great production (a great example on a movie that depends on the screenplay and does it fantastic is \"Before Sunset\"). Sometimes when the characters were expressing their feelings i really saw them forced, and predictable and as a thing that plays an important role (script) it was supposed to make me understand the characters and their motives and it failed at that. The character development was fine, but i really didn't felt that they were that interesting as they try to make them look like, because of that i really got bored at some parts, but that doesn't mean i didn't enjoy it. I did but i think this movie is a little overrated",
      "review_date": "2015-03-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Breakfast Club can't pack itself a story due to the stale comedy/drama. It left me confused with a sign saying, \"I don't get it.\" Decent movie anyways.",
      "review_date": "2016-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the greateset masterpieces of all time, The Breakfast Club is a heartwarming, funny, and moving piece of excellence.",
      "review_date": "2006-06-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a 80's classic and one of the greatest movies of the Brat Pack era. Molly Ringwald, Anthony Michael Hall, Ally Sheedy, and Emilio Estevez were in that movie. I forgot who else was in the movie besides them. Anyway, this movie is This is a 80's classic and one of the greatest movies of the Brat Pack era. Molly Ringwald, Anthony Michael Hall, Ally Sheedy, and Emilio Estevez were in that movie. I forgot who else was in the movie besides them. Anyway, this movie is an classic and shall live on in 80's movie history until the end of time.",
      "review_date": "2006-02-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best teen movie all-time.One of movies which in best way saving 80s culture.  Genial script- mixing comedy and drama. Best roles of teen actors ever.",
      "review_date": "2006-07-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It seems that mainstream critics completely miss the message of John Hughes' films. Similar to \"Ferris Bueller's Day Off,\" a lack luster score doesn't give the movie the credit it deserves. Despite this, the movie is It seems that mainstream critics completely miss the message of John Hughes' films. Similar to \"Ferris Bueller's Day Off,\" a lack luster score doesn't give the movie the credit it deserves. Despite this, the movie is absolutely fantastic. Its well written, down to earth, and accurately depicts the cliques that run rampant in schools even in now-a-days. If you have the means of seeing this film, do so, you won't regret it.",
      "review_date": "2010-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love this movie. I like how quiet it can be at some points.",
      "review_date": "2006-07-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The merit of the movie is that for the first time the teenager was portrayed as really is: his anxieties, insecurities, frustrations and fears were characterized in a surprising manner and with a simple and catchy language. The film makes usThe merit of the movie is that for the first time the teenager was portrayed as really is: his anxieties, insecurities, frustrations and fears were characterized in a surprising manner and with a simple and catchy language. The film makes us reflect on the consequences of poor education and as the father and mother figure is important for the balance of the teenager who somehow is thrown into a world full of doubts and insecurities accompanied with a hint of fear and frustration. Without a doubt is the definitive teen movie, being for the perfect timing,  by the sharped performances or by the soundtrack of 80 years, rocked by the hit â",
      "review_date": "2011-09-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Breakfast Club is an incredibly vibrant coming of age story that is just so incredibly honest that you cannot help but love it. The film tells the story of five high school kids who get Saturday detention. These five are howeverThe Breakfast Club is an incredibly vibrant coming of age story that is just so incredibly honest that you cannot help but love it. The film tells the story of five high school kids who get Saturday detention. These five are however completely different. There is the Brain (Anthony Michael Hall), The Basket Case(Ally Sheedy), The Princess (Molly Ringwald), The Athlete (Emilio Estevez) and The Criminal (Judd Nelson). Over the course of the film each and every one of them discovers something new about each other.It seems a little formulaic but in a way its the teen film that built the formula. John Hughes once again took a simplistic plot premise and made it so incredibly detailed and intelligent much like he did with Sixteen Candles. However the greatest part of The Breakfast Club is its tone. The tone of the film goes from dark to light in a blink of an eye, it allows for some of the character reveals to feel shocking and real at the same time. The tone allows for pure joy and fun (the iconic dance sequence) while also allowing for some utterly upsetting character moments (Judd Nelsons depiction of life in the Bender household for instance). Its a film that knows exactly what it wants to do while also making it relate-able for its target audience. In the hands of a lesser director this film would seem generic but Hughes makes it iconic while also thoroughly entertaining.",
      "review_date": "2011-11-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Breakfast Club is without a doubt one of the greatest films of the 80's, while the setting is of the decade, the substantial quality of the film is timeless as the plot and characters are things that normal people like you or I canThe Breakfast Club is without a doubt one of the greatest films of the 80's, while the setting is of the decade, the substantial quality of the film is timeless as the plot and characters are things that normal people like you or I can imagine ourselves in or relate to, aside from that, the interaction between the characters is fun, and the actors do a great job (Judd Nelson and Ally Sheedy give two of my favorite performances here). Easily recommend to everyone.",
      "review_date": "2012-04-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hughes is as contrived and caught up within his own little silly fantasies as ever, but his message that all teenagers are all the same on the inside remains one of the strongest counter-cultural propositions of its time and one of the most sincere.",
      "review_date": "2012-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An 80's classic! You can't help but love this movie. No it's not a masterpiece but this film is certainly a must see. It also has the best stereotypical 80's musical montage. It's realistic in a way that makes it easy for any generation toAn 80's classic! You can't help but love this movie. No it's not a masterpiece but this film is certainly a must see. It also has the best stereotypical 80's musical montage. It's realistic in a way that makes it easy for any generation to relate to. Also the Breakfast Club has a great cast that is able to bring the movie to life in a unique way.",
      "review_date": "2013-07-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "File this one under the already scant list of movies that I'm shocked I didn't love. Now, don't get me wrong; I don't dislike it. It's just that there's something a little slapdash and thrown-together about the structure here. SomethingFile this one under the already scant list of movies that I'm shocked I didn't love. Now, don't get me wrong; I don't dislike it. It's just that there's something a little slapdash and thrown-together about the structure here. Something almost piecemeal about the central line of action (or lack thereof, rather) that really made me buy the fact that Hughes wrote this in such a short period of time. The matrix of character relationships, however, is what makes this movie really sail by, and the respective performances from Nelson, Ringwald, Hall, Estevez, and Sheedy all really do help in the end. Again, not a movie that I didn't like, just one that I feel hype may have ultimately undercut for me overall.",
      "review_date": "2017-10-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Breakfast Club focuses on the clichés of every high school in the 80's, but it uses them to its advantage in this social drama. The dialogue is fresh and sharp, and many a memorable line can be quoted from this movie.",
      "review_date": "2014-02-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Won't you come see this movie. It's on netflix the greatest you know it baby. The Athlete, The Brain, The Basket Case, The Princess and The Criminal. Don't You Forget About It. When your at my house, telle me put it on. LOL. Watch the movieWon't you come see this movie. It's on netflix the greatest you know it baby. The Athlete, The Brain, The Basket Case, The Princess and The Criminal. Don't You Forget About It. When your at my house, telle me put it on. LOL. Watch the movie it's awesome.",
      "review_date": "2013-11-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A classic movie. I know I only gave it an 8 out of 10 but it was still really well done. I know that many people have it on there all time favourite list me no but I still enjoyed watching it. Got a little boring at times but it was stillA classic movie. I know I only gave it an 8 out of 10 but it was still really well done. I know that many people have it on there all time favourite list me no but I still enjoyed watching it. Got a little boring at times but it was still really well acted and a good heart felt story. I could watch this movie again easily and not get bored by it really related to me when I watched it because I am a high school student and I see thing happening.",
      "review_date": "2014-05-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A classic, does get a little slow around 2/3 in and it's not even a long movie but would recommend.",
      "review_date": "2018-09-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The film starts out well, but deteriorates with the only intelligent kid being put in detention for having a weapon in his locker, although the \"cool\" kid carries a knife on his person. Much of this film resonated with me as a good reflectionThe film starts out well, but deteriorates with the only intelligent kid being put in detention for having a weapon in his locker, although the \"cool\" kid carries a knife on his person. Much of this film resonated with me as a good reflection of all that is **** about school, but it was destroyed by the music and dancing montage as well as some bad interactions. If we were all that messed up everyone would be in prison by now.",
      "review_date": "2015-07-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While I slightly prefer Planes, Trains and Automobiles, this along with Ferris Bueller's Day Off is one of John Hughes' better films. It isn't a perfect film I agree as admittedly the characters are clichéd and there are minor logic lapses,While I slightly prefer Planes, Trains and Automobiles, this along with Ferris Bueller's Day Off is one of John Hughes' better films. It isn't a perfect film I agree as admittedly the characters are clichéd and there are minor logic lapses, but here's the thing- the more I see The Breakfast Club the more I like it. It still has its freshness, and while I never had a detention when I was in school even from what I've heard from people who have this actually makes detentions cool. And it is still relevant not only to the teenagers back then but now too, it does ring true a vast majority of the time what with its justified grievances, self-pitying whinges and hard-hitting home truths. The cinematography is nice and fluid, typical Hughes really, and the soundtrack adds to the film's coolness. Hughes directs wonderfully, and the script and story are well written and I think memorable. While their characters are clichéd, that I agree, the cast do a great job with what they have. Emilio Estevez, Judd Nelson, Ally Sheedy, Anthony Michael Hall and especially Molly Ringwald give very appealing performances and interact well together. In conclusion, I love this film, while not perfect I like it more every time I see it. 10/10 Bethany Cox",
      "review_date": "2022-03-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "To sum up it's a Cliff Notes of the eighties, one of the best J. Hughes film. If you were young in that time you will like this movie a lot and will be still entertained today after almost 40 years.If you are younger you will find in thisTo sum up it's a Cliff Notes of the eighties, one of the best J. Hughes film. If you were young in that time you will like this movie a lot and will be still entertained today after almost 40 years.If you are younger you will find in this movie a good teenagers comedy-drama .... maybe the teenagers stereotype are differet now but the struggle to be understood and sound advice to overcome first impressions and bond together are still relevant today.",
      "review_date": "2020-06-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Plot/Summary,John Hughes wrote and directed this quintessential 1980s high school drama featuring the hottest young stars of the decade. Trapped in a day-long Saturday detention in a prison-like school library are Claire, the princess (MollyPlot/Summary,John Hughes wrote and directed this quintessential 1980s high school drama featuring the hottest young stars of the decade. Trapped in a day-long Saturday detention in a prison-like school library are Claire, the princess (Molly Ringwald); Andrew, the jock (Emilio Estevez); John, the criminal (Judd Nelson); Brian, the brain (Anthony Michael Hall); and Allison, the basket case (Ally Sheedy). These five strangers begin the day with nothing in common, each bound to his/her place in the high school caste system. Yet the students bond together when faced with the villainous principal (Paul Gleason), and they realize that they have more in common than they may think, including a contempt for adult society. \"When you grow up, your heart dies,\" Allison proclaims in one of the film's many scenes of soul-searching, and, judging from the adults depicted in the film, the teen audience may very well agree. Released in a decade overflowing with derivative teen films, The Breakfast Club has developed an almost cult-like status.\rMy Review\rMan i have been wanting to see this film for quite a while now, and finally I did. I wanted to see this film cause it is one of the pivotal 80's films along with some of my other favorite films like ET, Jaws, and Back to the Future. I have been trying to buy the DVD copy since I saw it at a store and i finally bought it and i have seen it and it is a masterpiece.\rThe Plot has to deal with five kids with nothing in common all in a detention room on one saturday and they all learn about each other throughout the film and become better friends.\rin the opening sequence you meet your characters and find out a little bit about them like how Andrew's the jock,Brian's the brain,John's the criminal, Claire the princess, and Allison the basket case.\rThe movie is great on an exponential level with it's characters. They are the pivotal part of the movie. These are characters are so well written that you either know or are like someone that are just like one of these characters. This movie has the pivotal 80's soundtrack a person would want in a movie. The film is something that should be seen along with another High School movie called The Perk's of Being a Wallflower which is similar to this along with two other John Hughes classics I will be checking out sometime soon named Sixteen Candles and Ferris Bueller's Day Off. You feel for these characters cause you can probably relate to them that's the point of High School movies like this and these are very good high school movies were you feel like you either know or are one these characters that's what makes a great high school movie. I have not seen any of his other films but this already my favorite John Hughes film. But I will be sure to check out some of his other movie's.\rIn the end there isn't much i can say then what I already have. This movie is my second favorite High school movie of all time I like the characters i feel for the characters this movie has an awesome soundtrack and I think it's a masterpiece I give The Breakfast Club a 5 out of 5.",
      "review_date": "2016-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Breakfast Club gives us a great 80s cast in a simple but memorable story about high school and adolescence. This is a classic coming of age story all should see.",
      "review_date": "2016-09-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "¿What do you get when five students -the brain, the basket case, the athlete, the princess and the criminal- are grounded in a classroom on Saturday? One of most typical, loved comedies of 80's, courtesy of John Hughes, the same mastermind¿What do you get when five students -the brain, the basket case, the athlete, the princess and the criminal- are grounded in a classroom on Saturday? One of most typical, loved comedies of 80's, courtesy of John Hughes, the same mastermind that years later will direct Home alone. So honest and close to real life.",
      "review_date": "2020-06-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I loved it! Call me a fanboy, but I gave this a 10 because I enjoyed my time with it.The film touched me dude, it touched me! I haven't felt this good since I watched Good Will Hunting!\n\nIt's a shame I'm 20 years old and wasn't alive whenI loved it! Call me a fanboy, but I gave this a 10 because I enjoyed my time with it.The film touched me dude, it touched me! I haven't felt this good since I watched Good Will Hunting!It's a shame I'm 20 years old and wasn't alive when all these pieces of art were around",
      "review_date": "2017-08-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the quintessential teen drama film. Full of drama, comedy and charm, and with memorable characters and scenes. This film is absolutely timeless.",
      "review_date": "2017-11-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A group of students that have committed school infractions during the week, ended up in detention in a saturday and do a essay about what they think of themselves, they don't really know each other at that point, at first they are completelyA group of students that have committed school infractions during the week, ended up in detention in a saturday and do a essay about what they think of themselves, they don't really know each other at that point, at first they are completely different from one to another and don't really seem that they match between each one, there were Andrew, the sportsman, Claire, a preppy, Allison, a weird girl, Brian, the nerd and finally Bender, the rebel one. During the course of the day they got to know a bit more the others, and surely a lot more about themselves. Directed and written by John Hughes.The story in here won in it's simplicity to approach complex themes, well, before anything else, the subtleties that are presents in this movie are fantastic, how they just make you know every character in here, almost equally and in different ways, it was so creative but at the same time so easy. It is just impossible to not relate with pretty much everything in this movie, every single teenager that are in this movie you most likely know people from school or even college that are just like them, and surely you will identify yourself in one of them, or a bit of you in all of them possibly, it is characteristics that i have had in almost every class that i have been during my life, the most different people, and a lot of them i didn't really knew what was going on in their lifes or how were they relationship with families and things that they might be going throught, and this movie did showed me that we had much in common that i expected, that bad people had a reason to be like that in school, not everybody is what it looks like, and surely not only what it looks like, no one is just black or white in a psych meaning, everybody have a lot of shades, and the way that this story exemplifies this, isn't just clear made in a movie perspection, but it helps us to change our minds in other people.Inchmeal that the story progresses we got to know more about them next to the same, so in first we have the same vision together as the characters, we only know things superficially, and inch by inch, with the strong and powerful dialogues that we have we got know more about them, and definely understand things way more clearly, during this process the reason that it is so important for us, is because we can see how are issues that doesn't matter if you are rich or poor, strong or weak, things happen to everybody. One of the main situations that is approached by this story, is how parents and adults can be destructive, how bad parents could be to children and how they would, and are, affected by things that parents do, you hear by each one of them, and definely everybody have had moments with this during our lifes, some could be exaggerated and some don't, but the true is that things like this go through the head of everyone at some point.It is great how the characters had the others back, even if they don't really rock with them, the interaction between them are so great, and at the same time very real, are things that i did or i could see happening.Another strong thing that it is very common between the adolescence, is that how necessary it is to be inside of a group and get accepted by that, the film talks about it and exemplify how suffering that could be, the fear of not being accepted and the needed to be part of something, and how bad can be the necessity to stay there, even when you gotta do things that you don't really wants to. They also put how easy it is to regret of something, do something to impress someone or something like that, but when you actually get to know how bad it was, or seing in the other side, seing things from other perspective, that was really nice.Judd Nelson was phenomenal in here, he could first give that student that apparently don't really care about anything, and then he gave him layers, he is sarcastic, funny, scrotum and have his manneirsms, he is authentic and can finally, after that all, give that image of sadness.Molly Ringwald could gave that pretty and rich girl aspect, and had some nice dialogues where she put her emotions out well. Ally Sheedy was really nice in here, without speaking much, she was myterious and had some really peculiar moments while she did strange things, you got interested to know more about her during the whole movie. Emilio Estevez did a nice job as well, he was strong and convinced me in his regret moments. Anthony Michael Hall is also really good, he could pass that innocence and vulnerability, so as his sadness and trouble with the personal life.It does have some problems, like some cuts feel so unnatural, there are somethings that was disruptive, moments that were from emotional from a completely different thing with no working, but that is a small thing compared to the whole thing.",
      "review_date": "2018-11-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It’s a movie many can relate to. It’s also a movie that you don’t really know you liked until it’s over. Rating - 78%",
      "review_date": "2018-10-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A Saturday detention session becomes an intense encounter group for all concerned, even the teacher and the janitor.  This film has the best casting choices in the history of cinema.  No plot at all.  No gun battles, no car chase, noA Saturday detention session becomes an intense encounter group for all concerned, even the teacher and the janitor.  This film has the best casting choices in the history of cinema.  No plot at all.  No gun battles, no car chase, no explosions... no three-act structure! Breaks all the strict rules of screenwriting and industry structure requirements -- but still ranks as one of the greatest films of the 80s.  Bravo!",
      "review_date": "2018-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "just you and me..The Breakfast Club\n\nAs much as powerful the screenplay is, John Hughes's attempt to install cheesy and petty inputs in characters to attract younger audience wears down the intensity and gravitas that it had created thatjust you and me..The Breakfast ClubAs much as powerful the screenplay is, John Hughes's attempt to install cheesy and petty inputs in characters to attract younger audience wears down the intensity and gravitas that it had created that easily would have helped it enter the major league. His directorial work is appreciative but deserved a better supervision compared to its script. The performance wasn't up to the mark which is the only thing that itches one down the throat in this old classic. The Breakfast Club is a typical teenage movie retold in the most intriguing way that it is almost impossible not to invest in it and be moved by it (no matter how much familiar their tales may sound but the impact doesn't grow shallow at all).",
      "review_date": "2018-04-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I had pretty low expectations for this movie, as I don't really like teen movies. However, I must admit that the film is good and well-made. It's not perfect or exceptional, but it works and entertains without our time being wasted. I canI had pretty low expectations for this movie, as I don't really like teen movies. However, I must admit that the film is good and well-made. It's not perfect or exceptional, but it works and entertains without our time being wasted. I can understand why so many people consider this movie a classic, but I don't agree. It's not such a good movie to have that designation, and it has maintained a certain aura to this day, this is due to a certain cult status it has acquired over the years. The film takes place in a school on a Saturday, in which five students who do not know each other will be grounded, each for their own reasons. The teacher, however, is an idiot, and they will end up enjoying the day, listening to music, talking and discovering that they are not so different from each other.The film has weaknesses, starting with the thin script it presents. In fact, there is no story or action here. If the movie didn't have so many humorous scenes or where the characters escape and walk around the school, we would have an hour and a half of dialogue. Another problem is the use of all the most common stereotypes in high school movies: we have an idiotic teacher with no authority, a rebellious student with problems at home, a good student under pressure to have good grades, a beautiful and smug student from a wealthy family, an athletic student with anger issues, and a lonely, weird student. The only thing that saves them is, deep down, the way they gain depth and personality as the dialogues flow. And could I still speak of the illogicality of this punishment, in which five troubled students are left alone in a deserted school?Regardless of the script's weaknesses and other issues, the film has a young cast that does a very committed and interesting job. Of them all, the one who impressed me the most was Judd Nelson, who managed to impart a genuine rebelliousness and irreverence to his character. I also really liked Ally Sheedy. She starts the film almost silently, letting her pose, and bizarre costume dominate our attention, but then she presents us with an intense, intelligent and pleasantly unpleasant and sarcastic character. Anthony Hall has a more palatable and emotional character, which he plays satisfactorily, as do Molly Ringwald and Emilio Estevez, and they also worked well in their respective characters. A word, more, for Paul Gleason, and the impeccable way in which he played a mediocre teacher.Technically, it's a low-key film. It has good cinematography and was very well shot, with sharpness and good colors. It doesn't feature great visual or special effects, but what it brings us is well done and works pleasantly. The library set was well-built, and the school is credible. But what amazes us is, clearly, the soundtrack, and particularly the theme song \"Don't You (Forget About Me)\", which is heard in the credits and which became one of the biggest hits of that decade, in that many were young or (like me) born.",
      "review_date": "2022-01-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is just amazing. Acting is astonishing. Character development is staggering. Love it. Rewatched 2 times.",
      "review_date": "2020-02-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was a pretty decent movie showing us the typical high school archetypes and how even if they look like your typical jog on the outside, on the inside they are their own person with their own troubles and so on. The acting the kids didThis was a pretty decent movie showing us the typical high school archetypes and how even if they look like your typical jog on the outside, on the inside they are their own person with their own troubles and so on. The acting the kids did was pretty good and I found it both funny and kinda odd that they kept switching from comedy to drama to comedy and then drama. The romance part was pretty bad and didn't really had any part in the movie except in the end (which fell forced as **** Give it a check just to see how good those kids are at acting.",
      "review_date": "2022-09-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's a good movie with cliché-ridden characters, that actually have a second layer to them. It was just a little too simple, too plump, in a way, to have a meaningful impact on me, though.",
      "review_date": "2020-07-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Although The Breakfast Club is the lynchpin of the brat pack movies this film is a lot more than teen comedy. I'd even go so far as to call it one of the finest films of its kind that came out during that era. The Breakfast Club is veryAlthough The Breakfast Club is the lynchpin of the brat pack movies this film is a lot more than teen comedy. I'd even go so far as to call it one of the finest films of its kind that came out during that era. The Breakfast Club is very different from almost every other entry into what was (at the time) a burgeoning genre. Instead of relying on the staples of bare flesh, crass humor, and brainless plots, this movie focuses on five dissimilar characters, is almost entirely dialogue-driven, and doesn't offer even a glimpse of a breast or buttock. It's a story about communication gaps, teen isolation, and the angst that everyone (regardless of how self-assured they seem) experiences during the years that function as a transition from the freedom of adolescence to the responsibilities of adulthood.(Evocative description of high school life).",
      "review_date": "2019-09-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is an amazing movie, hands down. The acting, the setup, the story, all of it is amazing. My main criticism is that at times it could be a bit predictable, and/or cliche, but this doesn't detract too much from the main story. I'm not fromThis is an amazing movie, hands down. The acting, the setup, the story, all of it is amazing. My main criticism is that at times it could be a bit predictable, and/or cliche, but this doesn't detract too much from the main story. I'm not from the 80's, but I honestly can kinda relate to some of the characters still, primarily Brian. My teacher played this for a sociology class, and I'm glad she did. This is great.",
      "review_date": "2021-05-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My family likes this movie. It's a classic. I don't know I personally think it's dumb. There's no point to the movie. Just a bunch of kids in detention with absolutely no action or anything going on that's exciting. Don't know why people sayMy family likes this movie. It's a classic. I don't know I personally think it's dumb. There's no point to the movie. Just a bunch of kids in detention with absolutely no action or anything going on that's exciting. Don't know why people say it's a classic or a good movie. It's boring as hell.",
      "review_date": "2022-12-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "'The Breakfast Club' is a 1985 teen dramedy. John Hughes is not only a director of this movie but also a scriptwriter. John Hughes later started to be even more popular because of such of his pictures as: \"Home Alone\" (1990), \"Curly Sue\"'The Breakfast Club' is a 1985 teen dramedy. John Hughes is not only a director of this movie but also a scriptwriter. John Hughes later started to be even more popular because of such of his pictures as: \"Home Alone\" (1990), \"Curly Sue\" (1991), \"Beethoven\" (1992) and other movies that became cult hits. Emilio Estevez, Paul Gleason, Anthony Michael Hall, Judd Nelson, Molly Ringwald and Ally Sheedy played six main roles. This movie earned $51.5 million, whereas its budget was $1 million.When five high school students once stayed at school on Saturday morning as a school punishment, they didn't realize that they would get closer to each other by speaking about their lives.This is an emotional movie about teenagers' lives with addictive plot twists. The life stories of the main characters open up to moviegoers gradually, provoking strong feelings. The movie raises and discloses many social topics. Teenagers deal with these topics and many others that have an impact on their lives and they cope with problems in their own ways. Even though the movie was released in 1985, the topics that were revealed in the movie are actual for the contemporary society and for current generations too.Written by Anastasiia Shystovska",
      "review_date": "2020-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The original teen movie. A timeless classic that has heavily influenced every teen movie since.",
      "review_date": "2021-07-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "All time dance sequence, still a classic, some things haven't aged perfectly but a classic for a reason.",
      "review_date": "2022-08-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "",
      "review_date": "2022-03-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A good relatable teen movie that anyone can relate to regardless of the time period",
      "review_date": "2022-08-14",
      "source": "metacritic"
    }
  ],
  "num_reviews": 75
}