{
  "title": "The Purple Rose of Cairo",
  "rating": 8.3,
  "release_date": "1985-05-02",
  "genre": [
    "Drama",
    "Fantasy",
    "Comedy",
    "Romance"
  ],
  "summary": "A Depression-era waitress spends every free moment she has at the cinema because the grand stories she finds there distract her from her pitiful life, but when a dashing character from one of the films becomes smitten with her and leaves his celluloid world, she finds herself in the middle of her own fantasy romance.",
  "critic_reviews": [
    "I'll go out on a limb: I can't believe the year will bring forth anything to equal The Purple Rose of Cairo. At 84 minutes, it's short but nearly every one of those minutes is blissful.",
    "Allen has done better than this, but The Purple Rose of Cairo is a sweet little film and an interesting diversion for his legion of followers.",
    "Mia Farrow is note-perfect in this charming little movie.",
    "Tale is a light, almost frivolous treatment of a serious theme, as Woody Allen here confronts the unalterable fact that life just doesn't turn out the way it does (or did) in Hollywood films. For all its situational goofiness, pic is a tragedy, and it's too bad Allen didn't build up the characters and drama sufficiently to give some weight to his concerns.",
    "Woody Allen's naive notions of art--he thinks it means a story with a moral--might have some primitive charm if he didn't put them forward so self-importantly."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Allen at his most romantic (in terms of romanticism) about film, TPROC is as sweet as a film could be, without being sugary. It's funny, sad, romantic, and quite zany, and catches Allen at his most Chaplinesque. I feel I'm about using theAllen at his most romantic (in terms of romanticism) about film, TPROC is as sweet as a film could be, without being sugary. It's funny, sad, romantic, and quite zany, and catches Allen at his most Chaplinesque. I feel I'm about using the word 'magical' in a review, but I'll generate a substitute for the word, and use that instead.",
      "review_date": "2011-08-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Woody Allen is amazing.\rI thing he is free. Free from every thing.\rLook at his films, there is no logical things in his films. every thing in his films is possible!\r\nHe always surprised his audience.\r\nThere is too different between him andWoody Allen is amazing.\rI thing he is free. Free from every thing.\rLook at his films, there is no logical things in his films. every thing in his films is possible!\rHe always surprised his audience.\rThere is too different between him and Charlie Chaplin but I want to say that Woody Allen is the best comedian after Charlie Chaplin.",
      "review_date": "2015-01-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Woody Allen never ceases to amaze me. His imagination and humor are so admirable. This film is so unusual and incredibly creative. Enthralling even. It never fails to fascinate and in many ways it is brilliant. My only gripe is the two Woody Allen never ceases to amaze me. His imagination and humor are so admirable. This film is so unusual and incredibly creative. Enthralling even. It never fails to fascinate and in many ways it is brilliant. My only gripe is the two leads. I think Mia Farrow and Jeff Daniels are too bland, better casting would have helped. The rest of the cast is terrific though, especially Zoe Caldwell.",
      "review_date": "2009-09-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is a unique concept that is filled with light comedy and romance. I really loved the characters in the movie theater. They were the ones that stole the show.",
      "review_date": "2012-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Certainly a unique and interesting film, The Purple Rose of Cairo features a terrific performance from Jeff Daniels and Mia Farrow, who have terrific chemistry with one another. Strongly written, lively, funny, and enjoyable, Woody Allen isCertainly a unique and interesting film, The Purple Rose of Cairo features a terrific performance from Jeff Daniels and Mia Farrow, who have terrific chemistry with one another. Strongly written, lively, funny, and enjoyable, Woody Allen is as good as ever in this film as writer/director. However, the film feels incredibly slight. It just feels like a diversion more than anything else, instead of a truly engaging Woody Allen film. This may be because it is so short at just an hour and twenty minutes. It does not get a chance to really sink too deeply into its characters and is quite skin deep in its characterizations. Though that portion is well done, I do wish it was longer and allowed me to follow these characters longer to truly figure out more than one-dimension of them. That said, this film is enjoyable and incredibly well done. Often cited as one of his best films, I do not necessarily agree, though I do really like the film.",
      "review_date": "2016-07-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The more and more shades of Woody Allen I find myself being exposed to throughout the years (parody Woody Allen, crime drama Woody Allen, adult dramedy Woody Allen) the more and more I realize that the one I think I appreciate most is hisThe more and more shades of Woody Allen I find myself being exposed to throughout the years (parody Woody Allen, crime drama Woody Allen, adult dramedy Woody Allen) the more and more I realize that the one I think I appreciate most is his nostalgia-obsessed side. First off, similar to \"Radio Days,\" there's a tremendously tender hand assigned to filling this world with as much detail and texture as possible, in order to make it feel totally period accurate. It's evocative and warm, hearkening back to an era that's so far gone, yet so aesthetic. Pile on some trademark Woody Allen magical realism and you're dealt a movie that's just too hard to dislike. Say what we will about the many flaws and intricacies of him as a human being (and there's a hell of a lot to say) I'll be damned if the man can't write a watchable movie at the very least. \"The Purple Rose of Cairo,\" however, is thankfully not only watchable, but a thoroughly delightful and a blast at times to watch, featuring two incredible performances from Jeff Daniels.",
      "review_date": "2020-03-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you love watching movies then you have to watch \"The Purple Rose of Cairo\". It's sweet, funny, nostalgic and it overall it just nails what a good film is about.",
      "review_date": "2016-10-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A tribute to cinema within cinema, to remind us what films are for: to evade reality for a moment, to admire and identify ourselves with the characters. A Woody Allen signature love letter.",
      "review_date": "2020-12-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Cinema is a heavenly parallel version of life.This film really reminded me why I find the most light-hearted, feel-good romantic comedies so heart-crushing and devastating.(8/10)",
      "review_date": "2020-03-31",
      "source": "metacritic"
    }
  ],
  "num_reviews": 14
}