{
    "rating": 8.3,
    "release_date": "1963-03-28",
    "num_reviews": 370,
    "genres": [
        "Mystery&thriller"
    ],
    "summary": "Melanie Daniels (Tippi Hedren) meets Mitch Brenner (Rod Taylor) in a San Francisco pet store and decides to follow him home. She brings with her the gift of two love birds and they strike up a romance. One day birds start attacking children at Mitch's sisters party. A huge assault starts on the town by attacking birds.",
    "reviews": [
        {
            "content": "Classic Hitchcock.\nHe is the God Father of film & story telling.",
            "review_date": "2023-04-24",
            "source": "rt"
        },
        {
            "content": "Oh man Alfred Hitchcock what was this? I heard this movie was critically acclaimed and loved by a majority of the audience so I decided that I was going to watch this. At the end of the day, a plot about birds attacking humans is a pretty ridiculous plot. The birds barely feel like a threat throughout the movie and the characters feel like the are overreacting. There's literally talk about the world ending. Over bird?! Are you kidding me?! It was just too ridiculous for me to fully immerse myself into the story. Also the characters are bland at best. I have no reason to like them at all. On top of all that, there's a corny love story that takes up a majority of the first half of the movie. It's just so ridiculous. One of the only things that save this movie are the dialogue and the acting. Both of those things are well-done and you can see the excellence of Alfred Hitchcock's directing shine through. Overall, this was just not a good movie in my opinion and I'm very disappointed.",
            "review_date": "2023-04-11",
            "source": "rt"
        },
        {
            "content": "This is a classic?… it was so bad!… I'm never watching this again.",
            "review_date": "2023-04-10",
            "source": "rt"
        },
        {
            "content": "All time classic. No green screens. All real including the birds",
            "review_date": "2023-04-08",
            "source": "rt"
        },
        {
            "content": "It's an excellent motion picture, The Birds, 1963, by my favourite director-producer, Alfred Hitchcock...\n\nA debut actress, Nathalie Kay \"Tippi\" Hedren is my second time on her movie...",
            "review_date": "2023-02-10",
            "source": "rt"
        },
        {
            "content": "I don't know why people like this film so much. The exposition of the characters and their drama in the first half of the film seems so pointless, since they don't matter in any way to the overall story. I spend maybe half the time of the film wandering where are the birds, since it's called \"The Birds\". The screenplay is very bad because it is so obviously an adaptation of a book. Like for example there are moments that may work for a reader, but definitely don't work for a viewer. A perfect example of this is the dialogue scene in the bar, where it seems everybody has something to say and it looks so fake and staged. Which brings me to the acting, and some of the actors are very bad at it, while the others are decent at best. While it's so hard to criticize the visual effects of \"the birds\", since the film was made so long ago, I still think that they could have put more effort into it to look at least remotely realistic and entertaining. The biggest suspense I experienced in this film was the anticipation of waiting for it to end.",
            "review_date": "2023-01-31",
            "source": "rt"
        },
        {
            "content": "The Birds is a 1963 cinematic triumph. This is visual content giving ultimate force to birds and their attacks. It achieves its goal of horrifying and shocking. Nothing else matters but the amazing control of birds real and mechanical giving audiences an unforgettable experience. Birds are and always have been omens and symbols of something like death approaching. It doesn't matter why the birds are attacking just that they are. The brilliance here is watching how Hitchcock is able to bring a romantic encounter with love birds to such horrifying heights.",
            "review_date": "2023-01-26",
            "source": "rt"
        },
        {
            "content": "I can't understand why this movie was such a commercial and critical success: regarded as a classic even.  Birds just aren't scarey.  The premise itself is just silly.  All of Hitchcock's fancy camera work can't really hide that.  Hearing how Hitchcock was (allegedly) terrorizing Tipi Hedron behind the scenes; harassing her, (allegedly) threatening her and her daughter even; to the point where he did infact enclose her on the set with a bunch of wild birds at the ending; attempting to bring her to her knees after she continually rejected him; all of that is much scarier than this absurdist film.  As is Melanie Griffith's claim that during this period when she was a little girl; Hitchcock sent her a Barbie sized coffin; and when she opened it there was a doll laying down inside that looked exactly like her mother.  These allegation are pretty creepy.  And all of that, along with the stupid script, is enough to turn me off this movie.  The critical community be damned: this is still garbage!",
            "review_date": "2023-01-24",
            "source": "rt"
        },
        {
            "content": "This movie was so boring! What is going on!",
            "review_date": "2023-01-21",
            "source": "rt"
        },
        {
            "content": "The movie didn't age well- the 'special effects' are horrible, the plot isn't interesting and there's no culmination",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "I don't find it special, but is scary enough 7.8/10",
            "review_date": "2022-11-13",
            "source": "rt"
        },
        {
            "content": "THE STORY DID NOT MAKE SENSE, \nI'D RATHER WATCH MORBIUS THEN THIS",
            "review_date": "2022-11-03",
            "source": "rt"
        },
        {
            "content": "The bird revolution is here in Alfred Hitchcock's The Birds. A very original horror film idea about how birds want to harm every human. While the film is considerably scary, the film does more than just rely on horror as it can get very dramatic and serious at some moments. The visuals are serviceable at times. The cinematography by Robert Burks was also quite nuanced especially during the film's climax where the humans barricade themselves inside the house and the electricity went out. Overall, The Birds is quite an interesting and original film that is slightly above average.",
            "review_date": "2022-10-27",
            "source": "rt"
        },
        {
            "content": "This movie has a good premise and while it may seem odd. The idea of birds killing people is pretty terrifying. However, this film falls short on the ending which seemed extremely rushed. Overall though it's a decent film.",
            "review_date": "2022-10-26",
            "source": "rt"
        },
        {
            "content": "This is one of my favorite Hitchcock films.  Everyone knows this film as the one where the birds attack and kill some unwitting people in a small northern California coastal village.  But it's more than that.  It's also a film about a complicated mother-son relationship, and a strong, (and well ahead of its time) look at relationships in general.  Even if you took the birds away, you'd still be left with a pretty interesting little film.  In fact, the genius of the film is that by the time you get to the bird attacks, Hitchcock had already created a strong narrative drama.  So when the birds do show up, you feel the impact they have on the characters that much more.\nIn short, this is not just another \"when nature attacks\" horror film.",
            "review_date": "2022-10-24",
            "source": "rt"
        },
        {
            "content": "Alfred Hitchcock's 1963 famous thriller focuses on a wealthy socialite pursuing a potential boyfriend when a series of sudden and unexplained violent bird attacks on the people of Bodega Bay, California, take place over the course of a few days. It is based upon the horror story by the British writer Daphne du Maurier, and even though the special effects are outdated, they convey the feeling of fear and danger, the film itself creates a great atmosphere of suspense and claustrophobia. With a bit of symbolism and an allegory for birds against humans for taking nature for granted, the film is enjoyable and a sample of the marvelous cinematic work of a genius which remains a classic 60 years later.",
            "review_date": "2022-10-18",
            "source": "rt"
        },
        {
            "content": "WOAH. tbh, i was not expecting the 5th entry in the LCU to be good at all  considering the quality of the last to films but holy shit this movie was actually pretty damn good. Turning Lyle into a bird this time around was a smart decision considering that he ate one in Dear Evan Hansen. My big problem though was the fact that they acknowledged ME TIME as canon. AMAZING plot twist at the end!",
            "review_date": "2022-10-09",
            "source": "rt"
        },
        {
            "content": "This is a typical Hitchock film in that its pretty tense and suspenseful at times, it keeps you guessing and isn't an all out horror film but perhaps more of a psychological thriller of sorts. I remember reading the story when I was in secondary school, so I had a rough idea of what to expect. The special effects are a bit tame (the bright red blood kept making me think of tomato ketchup - it didn't look like real blood at all I think but I'm maybe a bit of a nitpick?) but of course this is a film of its time, having been released in 1963. I thought it did quite well at making the viewer feel uneasy when faced with groups of birds stood congregating nearby, which is something I doubt anyone would normally bat an eyelid at. I imagine this was really quite a spooky and sinister perhaps even film of its time, although nowadays its hardly what I'd think of as a truly scary film (although one or two images I did find a little frightening) but I can understand why its well regarded and is a cult film. An interesting film by Hitchcock, based on a short story by Daphne DuMaurier, I'd recommend this.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "Die Vögel (Originaltitel: The Birds) ist ein US-amerikanischer Horrorfilm von Alfred Hitchcock aus dem Jahr 1963. Auffällig ist das der Film vorkommen ohne Musik auskommt, nur das gekreischte der Vögel kommt zur Geltung. Erwähnungswert sind auch die Dialoge, sie sind spitzfindig und mache voll mit dem Humor von Alfred Hitchcock. Der Film ist ein Klassiger aus den Spätwerken von Alfred Hitchcock, und ist immer wieder sehenswert.",
            "review_date": "2022-08-01",
            "source": "rt"
        },
        {
            "content": "A superior Hitchcock thriller. What's most worth savoring here is Hitch's time-tested method to his madness--he draws us in with absorbing characters and seemingly mundane drama, yet doesn't let you forget the creepy factor. But intricate plotting is a trademark for Hitch, and here it only helps to ratchet up the tension until the birds finally attack. Genuinely chilling scenes of vicious bird attacks help offset the slightly quaint \"romance\" going on here. What's probably most scary here is what is implied or isn't explained. Performances are solid, and the final shot will leave you with goosebumps. Creepy stuff",
            "review_date": "2022-07-24",
            "source": "rt"
        },
        {
            "content": "The concept behind \"The Birds\" evokes a deep-rooted sense of revulsion, greatly enhanced by the film's wise decision to abstain from providing tangible reasons behind the horrifying attacks. In appropriate fashion, Hitchcock also omits a music score, leaving us at the mercy of shrieks and squalls which quickly become heightened to truly claustrophobia-inducing proportions. Through such a calculating approach, Hitchcock offers us a thoroughly suspenseful experience against the backdrop of a story that evolves casually and even idyllically until the charming veneer is mercilessly shattered. The contrast is indeed quite striking, as we observe a story setting that might initially have been inspired by Hallmark card art eventually sling-shotting to the other extreme of near apocalyptic ruin. It may be noted that \"The Birds\" is one of the master's more expository works and might have benefited from slight editing, however I must admit that I've personally never felt bothered by the extra care and attention exercised in developing the central characters just that little bit more. Although never quite achieving reaching the heights of classic greatness of works such as \"Psycho\" and \"Rear Window,\" \"The Birds\" is still a masterwork in suspense that richly succeeds in the development and execution of a concept that seems born of a half-repressed primordial fear.",
            "review_date": "2022-05-18",
            "source": "rt"
        },
        {
            "content": "One of the weaker Hitchcock films, but of course involving some wonderful filmmaking moments.",
            "review_date": "2022-04-09",
            "source": "rt"
        },
        {
            "content": "Although I've seen this film before, I not only barley remembered it, but what did remember wasn't much that I liked. Which I found odd considering this film's classic reputation. Watching The Birds again, I'm sad to say, my less than stellar memory of it wasn't far off.\nDon't get me wrong, it's far from a bad! The acting is pretty good all around and I think it's fairly obvious (this being a Hitchcock film) that the tension and suspense in this movie is incredible.\nBut the pacing of the film is REALLY slow, the absurd nature of the plot often leans into unintentional comedy, and a lot of the effects really are very dated. \nI don't hate the film at all and I can see people who are afraid of birds being TERRIFIED of this film. I myself am not, so i just didn't get that much out of it.",
            "review_date": "2022-04-07",
            "source": "rt"
        },
        {
            "content": "As a massive Hitchcock fan, I saw The Birds, and it is a great film, very macabre, suspenseful and terrifying. Those bird fights alone are so well done, that I will admit I have never felt the same about birds again. The cinematography is brilliant, and the direction as you would expect from Hitchcock is superb. The screenplay is well crafted too, especially with \"They're coming, they're coming\".\n\nThe acting I thought was very good too, particularly from Rod Taylor and Susanne Pleshette, and Jessica Tandy and Tippi Hedren were excellent too. Even Hitch himself makes a \"canine cameo\". The atmosphere is terrific, enough to give you goosebumps. It is true, that there isn't much horror in the first forty minutes, but there is loads of suspense though, and the motive for the bird attacks never were explained. All in all, while not Hitch's best in my opinion, it is still a solid, perplexing and suspenseful horror/thriller, that may leave you terrified of birds. 9/10 Bethany Cox",
            "review_date": "2022-03-18",
            "source": "rt"
        },
        {
            "content": "'The Birds' is an interesting film but the plot sounds terrible if you think about it - 'Black killer birds group up to brutally attack citizens of the small town of Bodega Bay'. But Hitchcock really makes the film work. A thrilling and sometimes scary classic. Though the only problem is the ending, as it happens so sudden.",
            "review_date": "2022-03-15",
            "source": "rt"
        },
        {
            "content": "Another Hitchcock classic that left me a little underwhelmed. No doubting how freaky the bird attack scenes are but the production value is poor and I've no real idea what the point of it all was in the end. For suspense see dull.",
            "review_date": "2022-02-10",
            "source": "rt"
        },
        {
            "content": "One time, I was running and a bird attacked me because I got too close to the tree where its nest was located.  So I accepted the premise of the movie.  However, the movie was slow-moving with a lot of forced dialogue and mediocre acting.  As is annoyingly typical of horror movies, the writers have the characters do illogical and stupid things which put them in unnecessary danger.  While I don't like having everything spoon-fed to me, this movie left a lot of unanswered questions -- and worst of all ended abruptly as if they ran out of money and had to cut things short.   I will say that the special effects for the time period (1963) were pretty good, given that everything was done with film.  They would be laughable in a movie produced today, but they got the point across at that time.",
            "review_date": "2022-02-08",
            "source": "rt"
        },
        {
            "content": "It was ok. I wouldn't say that it was one of the greatest movies ever, but this is another movie where I feel like people should listen to others when they tell them things that they know about. The people in that restaurant were discussing what happened to them previously and what happened to some other people, and people weren't listening and they were getting killed.",
            "review_date": "2022-01-28",
            "source": "rt"
        },
        {
            "content": "The unmistakable chemistry between Melanie Daniels and Mitch Brenner commences in a San Francisco pet store and develops into an instinctive romance when she follows him to his family farm in Bodega Bay to deliver to him the gift of lovebirds. The butterflies soon come to a screeching halt, though, when their sparsely populated Californian village is attacked by a sea of maniacal birds!\n\n\"‘The Birds' Is An Extremely Innovative Thriller Film. Hitchcock's Mastery Of Suspense, Avant-Garde Cinematography, Practical Visual Effects, Haunting Shots, And Clever Sound Design All Play Their Part In What Makes This 1963 Romantic Horror-Mystery Noteworthy. \n\nThe Film Barely Has A Musical Score Which Made Those Drawn Out Silences Suspenseful. And Electrifying.\n\nHowever, My Favorite Aspect Of The Film Is The Dialogue. It's Casual And Sophisticated, But Nearly Every Line Serves As Some Sort Of Foreshadowing, Proving Evan Hunter's Script To Be A Skillfully Written One. \n\nThe Brilliant Thespians, Notably Tippi Hedren And Jessica Tandy, Kept Me Glued To The Screen And Enthralled With Their Horrifying Quandary. \n\nI Recommend You Give This ‘Terrifying Motion Picture' A Nighttime Viewing... And Remember, The Next Scream You Hear May Be Your Own.\" 82%!",
            "review_date": "2021-12-14",
            "source": "rt"
        },
        {
            "content": "For the technology they had available at the time, fantastic. Lots of layers here to digest.",
            "review_date": "2021-12-10",
            "source": "rt"
        },
        {
            "content": "If not quite the master's greatest it has many iconic sequences and sticks in the mind. The escape from the school is my favourite sequence. It of course has gained relevance over time with the idea that nature might turn against us and with its ambiguous ending - will the birds attack again? or is it over? Often copied. The score is also superb. However, the acting is not as good as his greatest efforts nor is the plotting and cohesion - understandable as this is from a short story and there is no real development, that is not the point. None of this detracts from the iconic status of the film or its continued impact.",
            "review_date": "2021-11-30",
            "source": "rt"
        },
        {
            "content": "I have been watching Alfred Hitchcock's movie nowadays. His movies are so different and fun to watch. He made movies which were ahead of it's time including this one.\n\nThe story shown in the movie had a lot of potential but the ending in which there was no reasoning was a let down. Also, the story felt incomplete. They could have made a proper story with 2 hour runtime but they focused too much on story build-up only. The movie was enjoyable. The direction and performances by the actors were good. There is thrill and drama which keeps this movie on track.\n\nOverall, it is a good horror thriller drama which will keep you bounded till the end but the climax portion may disappoint you.",
            "review_date": "2021-11-19",
            "source": "rt"
        },
        {
            "content": "Still a classic. Amazing special effects even now, let alone back than. Good acting. I know allot of people complain about not knowing why the birds go bunkers, I like that fact we don't know. Just proves that it could happen and our feathered friends, by most accounts are descendants of the dinosaurs, could just one day get some payback.",
            "review_date": "2021-11-04",
            "source": "rt"
        },
        {
            "content": "This has got to be one of the dumbest movies I've ever watched. Birds killing people is too absurd even for the 60s. Not to mention the terrible effects and the laughable acting. I guess watching other Alfred Hitchcock movies just because I liked Psycho is a mistake.",
            "review_date": "2021-10-29",
            "source": "rt"
        },
        {
            "content": "When we talk about slow-burn horror thrillers, we are talking about \"The Birds\".  Brilliant. Flawless. And not even Hitchcock's best.",
            "review_date": "2021-10-09",
            "source": "rt"
        },
        {
            "content": "I can appreciate how much of the discomfort and horror from this nearly 60-year-old film still comes through, and I appreciate the way the birds seem to be some sort of commentary on the self-indulgent prankster lifestyle of Melanie. The scene in the bar, followed by the massive bird attack, is really great material. So is the claustrophobic, anxious sequence in the boarded-up home. But for whatever reason, the characters and the thematic content of this Hitchcock work didn't quite deliver on the same level his other work does.",
            "review_date": "2021-09-23",
            "source": "rt"
        },
        {
            "content": "I always forget how bone-chilling it truly is until I experience it again. Especially that final shot.",
            "review_date": "2021-09-18",
            "source": "rt"
        },
        {
            "content": "A movie that is a metaphor for how Hitchcock perceived strong women (watch it and see if you agree). Scavenger birds attack a small fishing village for seemingly no reason, i.e., Birds are scary.",
            "review_date": "2021-09-16",
            "source": "rt"
        },
        {
            "content": "Clueless people taking shelter in balsa wood buildings. I don't think the movie premise was explored as well as it could have been.",
            "review_date": "2021-09-13",
            "source": "rt"
        },
        {
            "content": "How can people be so afraid of birds, is beyond me, this is Alfred Hitchcock at his worst!",
            "review_date": "2021-09-03",
            "source": "rt"
        },
        {
            "content": "Birds attacking people unbeknownst the reason why with Rod Taylor and Tipi Heydren as the stars.",
            "review_date": "2021-08-23",
            "source": "rt"
        },
        {
            "content": "One of the most boring horror movies of all time. ",
            "review_date": "2021-08-06",
            "source": "rt"
        },
        {
            "content": "Definitely one of my most favourite classic films. Definitely Alfred Hitchcock's best work. Great acting and story.",
            "review_date": "2021-07-27",
            "source": "rt"
        },
        {
            "content": "Birds Together Strong\n\nThe last of the Alfred Hitchcock's films that I will watch for now. Adapted from the work of Daphne du Maurier who wrote one of my favorite novels Rebecca, the plot was simply about the mysterious attacks from the birds.\n\nThe first half of the movie was purely setting up the characters while hinting at the looming upcoming attacks from the birds. Honestly I had no idea how spending so much time on developing the characters related to the story of the birds. For me, this part was definitely the weakest because it was unnecessarily long.\n\nThe movie got better when the birds started their large-scale attacks. Honestly I think that with better technology, the attacks would have more enjoyment and be scarier. Of course, this is not the movie's fault, but it still affected the experience. However, most of the suspense came from before the attacks, where characters had to be careful moving around the gathering birds. This part was good, although I think it can be better. \n\nOverall, it's not as good as Vertigo or Rear Window. 7/10",
            "review_date": "2021-07-14",
            "source": "rt"
        },
        {
            "content": "This is such a classic that you MUST see it!  Great special effects.",
            "review_date": "2021-06-20",
            "source": "rt"
        },
        {
            "content": "In Alfred Hitchcock's The Birds, the initial premise of a habitual prankster delivering a pair of lovebirds to a handsome stranger who she feels slighted her is a bit thin and highly improbable, but once the Hitchcock twist comes and it goes from a creepy blossoming romance story to a full out horror show, things become interesting.  Some of the bird scenes are spectacular, including the final shot, while others are wildly outdated (the children running from the school while under attack) and are more likely to provoke laughs than chills.  Regardless, once the action kicks in, The Birds is a wildly entertaining spin on the animals run amok genre of horror.",
            "review_date": "2021-06-19",
            "source": "rt"
        },
        {
            "content": "Ages 13+ only; yet so worth it!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "Hitchcock revisits the human trope of complacency that he did to such great effect in Shadow of a Doubt. Suspenseful thrill ride that starts out a bit screwball comedy style only to get much darker. Includes an Oscar worthy performance by Jessica Tandy. Recommended.",
            "review_date": "2021-05-16",
            "source": "rt"
        },
        {
            "content": "I liked the film more at the end honestly, because in the starting bit it was a bit boring, but the developing of the story was awesome.",
            "review_date": "2021-05-07",
            "source": "rt"
        },
        {
            "content": "Awesome movie the birds themselves could probably make someone terrified of them and it has some good effects",
            "review_date": "2021-05-07",
            "source": "rt"
        },
        {
            "content": "While most people might complain about the behind the scenes trouble and no score but it's a terrifying and a masterfully directed disaster thriller from the master of suspense",
            "review_date": "2021-04-24",
            "source": "rt"
        },
        {
            "content": "Capolavoro immenso di Hitchcock, letteralmente stupefacente! Ineguagliabile dai thriller moderni.",
            "review_date": "2021-03-25",
            "source": "rt"
        },
        {
            "content": "The Birds is definitely a animal gone berserk horror film with really amazing special effects and it's still a horror masterpiece film.",
            "review_date": "2021-01-21",
            "source": "rt"
        },
        {
            "content": "Due to the effects not having ageed well, The Birds produces more laughs than dread and horror",
            "review_date": "2021-01-03",
            "source": "rt"
        },
        {
            "content": "Watching The Birds almost 60 years after its release and I still marvel and the filmmaking genius of Alfred Hitchcock. Every mass bird attack is directed in an iconic manner that other moviemakers have copied in some form. Tippi Hedren, who reportedly was the victim of unwanted sexual advances by Hitchcock, provides a stunning and courageous performance",
            "review_date": "2020-12-31",
            "source": "rt"
        },
        {
            "content": "An American classic. So much to love about this film: Tippi Hedren is awesome, and the chemistry between the two leads (Hedren and Rod Taylor) is terrific. Even better are the political and social undertones, most importantly the lesson that we should always be willing to accept things that challenge established knowledge when they present themselves.",
            "review_date": "2020-12-31",
            "source": "rt"
        },
        {
            "content": "It's such a great film and lesson bout respecting nature. The main characters are such a mystery that the whole time you wanna throw the birds in the background and figure out if the two \"lovebirds\" actually have dark plans for each other. We are trained not to trust humans like this while history tells us we can trust birds. Eventually the birds take center stage, not as a villain but as a protestor to the audience that it will not be used as a plot device. Two alpha manipulators are forced to humble themselves and it's a great lesson.",
            "review_date": "2020-12-25",
            "source": "rt"
        },
        {
            "content": "The Birds contained more apparent symbolism for me than any of Hitchcock's other films I have seen up to this point. I especially appreciated the more naturally ambiguous ending and thought the lack of a concrete explanation helps sustain the feeling of uneasiness or dread long after the films conclusion. 7.5/10",
            "review_date": "2020-11-29",
            "source": "rt"
        },
        {
            "content": "A so-called horror film that lacks the kind of atmosphere, direction, music, thrills or chills that a proper horror film requires. Hedren's performance seems to be the sole life of Hitchcock's version of a \"creature feature\".",
            "review_date": "2020-11-17",
            "source": "rt"
        },
        {
            "content": "The special effects, the story, the suspense - they all work, even decades later, even after viewing for the 3rd or 4th time. Amazing film, fascinating to watch and to think about.",
            "review_date": "2020-11-01",
            "source": "rt"
        },
        {
            "content": "Gratamente sorprendido por una cinta que esperaba ver con cierto escecepticismo. \n\nLas actuaciones impecables, el sutil manejo de la tensión y la creación de escenarios de estres y terror están genialmente conseguidos y consiguen que una película de dos horas con una premisa que en principio a más de uno le haría reír, se convierta en un atrapasillones total.\n\nCierto es que hay algunos aspectos del guión que me parecen algo caducos, pero al mismo tiempo el personaje de Tipi Hedren me parece muy adelantado a su época en según qué momentos.",
            "review_date": "2020-10-16",
            "source": "rt"
        },
        {
            "content": "Despite the female characters in this film all being somewhat fragile to say the least, I do enjoy this film.  It scared me a lot as a child.  It is also one of the few \"horror\" movies I can watch with my spouse who hates horror movies.",
            "review_date": "2020-10-06",
            "source": "rt"
        },
        {
            "content": "If you want to see how props as coy as little birds can create tension and terror, watch  maestro in Hitchcock lead you there.",
            "review_date": "2020-10-02",
            "source": "rt"
        },
        {
            "content": "Alfred Hitchcock strikes again with a film that shows that build-up is the true key to suspense and shows off some effects that were as innovative as they were effective.",
            "review_date": "2020-09-15",
            "source": "rt"
        },
        {
            "content": "Bad Alfred Hitchcock movie.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "10% Overrated. Directing was good, but the acting & storyline were absolutely terrible.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "I just can't take it seriously. It seems more like a comedy.",
            "review_date": "2020-07-19",
            "source": "rt"
        },
        {
            "content": "Although not frightening by today's standards, I still find it to be a captivating watch.",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "The Birds inhabits a strange and unique place in film history. Despite falling well short of the high water mark set by Hitchcock in some of his more character-driven films, The Birds is one of the films that is most clearly embedded in the popular consciousness when his name is brought up. The story is almost painfully silly and the characters hollow, but single shots are some of the most suspenseful and well-designed in horror film history. Simple, unadorned takes of groups of birds gradually accumulating without any musical accompaniment, only the occasional shrill call, intimidate far more than they would have if left to a lesser director (the gathering outside the schoolhouse is positively fantastic). The actual attacks incorporate such woefully outdated visual effects, whether through merging shots or less than believable animatronics. Whenever the threat of the birds is palpable, but the birds themselves are unseen, the film is often great, allowing the fears of the audience to fill in the vague threats established by circumstance. Some of the film is poorly conceived to the point of being comical, such as the gas station explosion and the quick reaction cuts on display. For some reason, much of the later film seems to evoke memories of Battleship Potempkin, particularly the Odessa Steps sequence with respect to the children fleeing the schoolhouse (which was the plan why?), and close, frontal shots of characters in emotionally compromised states. Taken together, The Birds feels less like a complete horror classic than a grab bag of tricks prepared by a capable, but unfocused, production team. (3.5/5)",
            "review_date": "2020-07-12",
            "source": "rt"
        },
        {
            "content": "Of all of Hitchcock's films, this is my least favorite. I like birds. The Cardinals are my favorite baseball team; the Crows and Magpies are my favorite Aussie Rules football teams. Why does he have to pick on birds? And why, especially, did he have to be such a petulant SOB with women?",
            "review_date": "2020-06-26",
            "source": "rt"
        },
        {
            "content": "Demonstrating Hitchcock's mastery at building suspense rather than delivering all-out thrills, The Birds has maybe not held up as well as some of the director's other works, in part to due to special effects limitations. Some shots are kept noticeably short and it's easy to see why. A lot of blatantly obvious green screening is used, and some shots of birds attacking are used multiple times. But what makes the film work is its use of identifiable characters and tangible threats. Birds are something that we see everyday and give little thought to, so its frightening to imagine what those creatures would do if they turned hostile, and how powerless we would be to fight them off. The film does drag in places, and much like the ending of Psycho, some conversations do go on for far too long. But Hitchcock knew what he was doing, and what he could use to scare the audience, going as far as to blare bird noises from a speaker following the UK premier. For me it didn't have the same impact or suspense as something like Psycho or Rear Window, but it still works well because of how effectively the threat is portrayed, and how well fleshed out the characters become. It might not be Hitch's best, but it's certainly one of his most iconic.",
            "review_date": "2020-06-04",
            "source": "rt"
        },
        {
            "content": "Filmed in Hitchcock's signature style of camerawork, and another build-up to the suspense, the Birds shows how villains can be made out of anything. A more violent movie from the early 60s, and with a good supporting performance from Suzanne Pleshette, the Birds fails horribly in one thing: making a good ending. It just ends; without logic, reason, or an explanation. But if you look past that, it is a chilling, suspenseful triumph that any Hitchcock fan will be hooting for.",
            "review_date": "2020-06-01",
            "source": "rt"
        },
        {
            "content": "The title pretty much says it all in this distinctly Hitchcockian mix of petty social gamesmanship and an abrupt, all-encompassing existential threat. That being the killer birds, obviously, which dive in from nowhere to ruthlessly head-hunt the poor denizens of a sleepy marine village in northern California.\n\nIt sounds like an odd mix, but it in practice... well, okay, it is an odd mix. The film's sudden about-face, from a slow moving game of flirty pranks to a breakneck avian assault, is disruptive and awkward, its pace a whiplashed tug-of-war between monotonous waits and unannounced bursts of frenzy. I like the metaphorical idea behind it, a pontification on natural catastrophes and how quickly they lead polite society to break down, but didn't enjoy much of the experience itself.\n\nIn many ways, it's a precursor to the glut of disaster movies that flooded cinemas in the following decade: one central menace, easy enough to boil down to a single word, which sends everybody scurrying in a desperate, improvised bid for survival. The effects are glaringly bad, too, bad enough to, more than once, completely pull me out of the moment with a snicker or a snort. The last big scare scene, however, is all sound and tension, and works so much better for its restraint and subtlety, putting the more garish, visceral preceding shots to shame by leaning on a few wild-eyed close-ups. I can see what Hitchcock was shooting for, but I don't think he got there.",
            "review_date": "2020-05-28",
            "source": "rt"
        },
        {
            "content": "Hitchcock spends quite a while introducing us to the characters and making us care for them, while at the same time, meticulously revealing the horror about to rear its ugly head. That is what makes Hitchcock such a legend, he knows how to scare us. With excellent film-making and great performances all around, The Birds is a horror masterpiece that is surprisingly still terrifying.",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "A Haunting Fairytale.\nFairytales, even those for kids, are seldom serene and innocent. Think of Little Red Riding Hood, Cinderella, Hansel and Gretel, full of mysterious and haunting characters imbued with evil.\n\nThe Birds, released three years after Psycho, a gap relatively long for Hitchcock but explained also by the technical challenges of the production, contains all the trademarks typical of both his cinema style and the fairytales.\nThe blond and beautiful leading lady, much stronger and determined than the appearances suggest, the light initial tone, almost a comedy with the witty bickering of the main characters, the unmissable Hitch's cameo, the long and winding coastal road, the ingenious quotes of his previous movies, here The 39 steps and To Catch a Thief amongst others, are intertwined with the inexplicable evil and the helplessness of the darkest fairytales' personas.\n\nBut The Birds, loosely based on a short story published in 1952 by Daphne du Maurier, an author that the English master had already used as a source for Rebecca and Jamaica Inn, is also deeply experimental and has a philosophical sophistication unrivalled by any of Hitchcock's movies.\nSince the opening credits, evoking the optical expressionist illusions of Escher's birds, the film is imbued with a haunting introspection that is ultimately only enhanced by the lively beginning of the movie, when Mitch, an anonymous Rod Taylor, meets and squabbles with Melanie, Tippi Hedren on her cinema debut. \nThe director's choice of giving up a musical soundtrack, with the only music briefly played by Melanie on the piano and the nursery rhyme sang by the school children, skipping the end credits and a real, defined ending, the sophisticated special effects engineered for the birds' attacks, that all in all have well survived time and digitalisation, the dilution of time and pace challenging and almost mocking the viewer, like in the emblematic scene of the crows perched on the jungle gym, the unpredictable and random behaviour of the birds, the roles' reverse, with the humans forced by attacks and fear to look for protection into the cages, either houses, cars, bars, phone boots, coinciding with the mental cages built by the terror generated by the distortion of the natural order that everybody is used to and expects, make The Birds an overwhelming complex movie to watch and understand, difficult to define, in between horrors and thrillers and that in fact was not very much appreciated by both the critics and the public when released.\nOnly recently the first Hitchcock movie produced and distributed by Universal has been heralded as one of his bests and most likely his last masterpiece, as well as a trailblazer on the analyses of the sickness and inner demons of the human psyche.\n\nThe Birds is a movie that leaves a long-lasting impression in the discerning viewer, notwithstanding the mediocrity of the actors, with the exceptions on an intense Jessica Tandy as Mitch's mother and a convincing Suzanne Pleshette as Annie, the sacrificial lamb of both Mitch and the birds.\nRegrettably, the few films Alfred Hitchcock directed after The Birds, however well-crafted and a pleasure to watch, will not add anything to the film body of one of the most important filmmakers of the XX Century.",
            "review_date": "2020-05-23",
            "source": "rt"
        },
        {
            "content": "A perfect showcase of the effectiveness of building tension and haunting atmosphere, an also shows unlikely but iconic horror figures.",
            "review_date": "2020-05-11",
            "source": "rt"
        },
        {
            "content": "I do not really have much to say about the birds. the ending was not the best. Im not going to give away any spoilers but I think that when you have wathed it you can agree that they could have added some tiny improvements",
            "review_date": "2020-04-30",
            "source": "rt"
        },
        {
            "content": "Slow moving, but once it kicks in it's terrifying. Thematic brilliance.",
            "review_date": "2020-04-25",
            "source": "rt"
        },
        {
            "content": "The visual effects of the birds are really fantastic and innovative for that decade",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "Hitchcock at his best. Strong performances by all especially Suzanne Pleshette. A must see for all horror and suspense fans.",
            "review_date": "2020-03-31",
            "source": "rt"
        },
        {
            "content": "Suspensful and terrifying!",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "The film is exceptional. It holds you very well in your kind of suspense. I do not give the maximum score, because its ending is somewhat disappointing.",
            "review_date": "2020-03-26",
            "source": "rt"
        },
        {
            "content": "I really recommend this movie, cuz it requires some comedy, thrilling and of course mystery scenes... this movie is very enjoyable.",
            "review_date": "2020-03-18",
            "source": "rt"
        },
        {
            "content": "Brilliant.  For modern viewers it may seem slow but at heart it is good storytelling.  Yes it's about the birds but mostly about the human story's at play in the movie.",
            "review_date": "2020-02-27",
            "source": "rt"
        },
        {
            "content": "It was is basically everything you’d want in a horror movie, but also, at the same time, not? You has the suspense, the action, and the fear before ending the movie. Just ending it. Without a conclusion. If you like “cliff-hangers” and “blood red paint” than this movie is for you",
            "review_date": "2020-02-20",
            "source": "rt"
        },
        {
            "content": "A film where the fear is in the sky.",
            "review_date": "2020-02-14",
            "source": "rt"
        },
        {
            "content": "While clearly being archaic in pacing and film-making, Hitchcock's suspense classic, The Birds,  is well-acted with beautiful shots, and still brings chills down your spine when walking past a crow on the road.\nB",
            "review_date": "2020-02-06",
            "source": "rt"
        },
        {
            "content": "The Birds is one of the earliest horror movies and can give you a fear of birds, but watching it when I did, it was not as scary as it would have been when it first came out. Overall, it is a fun story to watch and it an interesting concept that will keep the viewer entertained.",
            "review_date": "2020-01-27",
            "source": "rt"
        },
        {
            "content": "This is one of my all time fave horror movies, watch this movie if you are a horror fan or a Hitchcock movie fan. Classic 60's movie about killer birds that run and fly and attack the people of a small beach like town. Tippi Hedren is one of my fave 60's female actresses from the 60's, she wasn't in too many movies from backlash from Hitchcock himself a must see movie.",
            "review_date": "2019-12-22",
            "source": "rt"
        },
        {
            "content": "\"When people heard of the story for THE BIRDS, they laughed. Now, nobody's laughing.\"",
            "review_date": "2019-12-12",
            "source": "rt"
        },
        {
            "content": "I've seen plenty of old Horror movies, but this one is definitely the scariest. Usually a movie with no music would make it kinda predictable, but with this movie you have no idea what's gonna happen. This is by far the best 60s movie I've ever seen. 96%",
            "review_date": "2019-11-16",
            "source": "rt"
        },
        {
            "content": "They are birds! One of nature must evil creatures",
            "review_date": "2019-10-31",
            "source": "rt"
        },
        {
            "content": "Overrated by a mile. First hour is a bore and could be cut in half. Once the birds start their thing it is ok, but the outright stupidity of the people is a bit much at times. The gas station scene when the guy gets knocked out with the pump spewing gas right next to him and all the people around helping him don't even notice. And the guy who pulls up and lights a smoke with the gas pooling around him feet? Come on. And Tippi going into the bedroom where all the birds are and closing the door BEHIND her when they start attacking.",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "The first half is a bit slow, but when things go down in the second half, it makes for a pretty tension-filled thriller. It also makes a good choice of not having any musical score and gives the atmosphere an unsettling feel.",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "Horrible acting but comical",
            "review_date": "2019-10-18",
            "source": "rt"
        },
        {
            "content": "🦅 special effects hold up really well 🦅",
            "review_date": "2019-10-18",
            "source": "rt"
        },
        {
            "content": "times are definitely a changing, but truly a refreshingly enjoyable movie experience.   i can appreciate how scary it would have been seeing it in the 60s, but we laughed a lot tonight.",
            "review_date": "2019-10-18",
            "source": "rt"
        },
        {
            "content": "It's good, not great. ",
            "review_date": "2019-10-14",
            "source": "rt"
        },
        {
            "content": "If you can except the extremely annoying character that Tippi Hedren plays, you will enjoy this eerie Alfred Hitchcock masterpiece. I think this is Alfred Hitchcocks most horrifying film. There is no soundtrack to the movie; the absence of music results in an extremely effective silence which only intensifies the horror throughout the movie.",
            "review_date": "2019-10-14",
            "source": "rt"
        },
        {
            "content": "A lot of scenes haven't aged well, but I've always enjoyed watching this film. It has a good build up and believable acting. Its classic that I feel not a lot of people in my generation can appreciate.",
            "review_date": "2019-09-26",
            "source": "rt"
        },
        {
            "content": "The Birds may seem cheesy to younger viewers but it is in fact a true masterpiece brought to us by one of the most iconic and talented filmmakers ever.",
            "review_date": "2019-09-22",
            "source": "rt"
        },
        {
            "content": "Alfred Hitchcock's best movie. It is almost flawless. I watch it several times a year. I always noticed something I never saw before, just like I do when watching The Wizard of Oz.",
            "review_date": "2019-08-24",
            "source": "rt"
        },
        {
            "content": "Before Jaws, there was birds!",
            "review_date": "2019-08-19",
            "source": "rt"
        },
        {
            "content": "Unlike other classics at the time, it doesn't take long for this horrific treat to get to the interesting parts while scarring people from viewing birds the same way again.",
            "review_date": "2019-08-12",
            "source": "rt"
        },
        {
            "content": "Classic thriller/horror back in the day when actresses and actors had CLASS. Of course we know in reality birds are peaceful and harmless, but what if they just got tired of all the bad things humans do to living creatures on our planet.",
            "review_date": "2019-08-08",
            "source": "rt"
        },
        {
            "content": "The Birds could easily fall into a pathetic and laughable cliche if it wasn't for Alfred Hitchcock's masterful build-up of suspense.",
            "review_date": "2019-05-11",
            "source": "rt"
        },
        {
            "content": "Lots of talking, lots of runtime and lots of Birds. This is one of the great Hitchcock's best, it does run long for a while and it does have lots of talking, but that's what we all have to expect with old movies like this.\n\nGrade: B",
            "review_date": "2019-03-28",
            "source": "rt"
        },
        {
            "content": "Even though the bad character development and the mediocre acting, 'The Birds' is still a terrifying effort from The Master Of Suspense himself.",
            "review_date": "2019-03-28",
            "source": "rt"
        },
        {
            "content": "I've actually got some mixed opinions about this classic. It's definitely overrated, and doesn't top in any way Hitchcock's previous masterpiece Psycho (1960). I found it long for a horror/thriller film, it does have its moments, especially during the end, and a bit of gore too, but this film unfortunately failed to fully entertain me. Although I did really like the message of man being weakened and attacked by mother nature's forces, which claim their planet back. But anyways, if you're a Hitchcock fan, well this is a different type of film to see.",
            "review_date": "2019-03-23",
            "source": "rt"
        },
        {
            "content": "the special effects they were very poor for my own pleasure, but since the film came out in 1963 maybe it was pioneering",
            "review_date": "2019-01-30",
            "source": "rt"
        },
        {
            "content": "I could watch this over and over again without getting bored. Only thing that lets this movie down is the cheesy special effects and yellow-screen shots.",
            "review_date": "2019-01-28",
            "source": "rt"
        },
        {
            "content": "The best, GREATEST thrilling movie ever made! With the best movie characters ever portrayed: The title group trained by Ray Berwick!",
            "review_date": "2019-01-26",
            "source": "rt"
        },
        {
            "content": "2/5.  The Birds is a very overrated and disappointing movie.  It has a few memorable sequences, but it's mostly a tedious and boring film that doesn't live up to its potential.",
            "review_date": "2019-01-20",
            "source": "rt"
        },
        {
            "content": "Great horror from a simple concept, The Birds is evidence of great cinematography, editing and effects work.",
            "review_date": "2019-01-16",
            "source": "rt"
        },
        {
            "content": "It is one of the most disturbing sequences in cinematic history: a woman tiptoes through a house until - in three staccato shots - she discovers the bloody corpse of its occupant on the bedroom floor, his eye sockets two black holes dripping with gore.\n\nThe scene is just one of several grisly moments in Alfred Hitchcock's peerless horror flick, The Birds, made three years after his scorching success with Psycho.\n\nIt begins as screwball comedy. Melanie Daniels (Tippi Hedren) is a go-getting playgirl who drives a swish Aston Martin. After a smart-arse lawyer called Mitch Brenner (Rod Taylor) flirts with her in a San Francisco pet shop, she tracks him down to Bodega Bay, north California, where he weekends with his mother (Jessica Tandy). Australian Taylor, who had won acclaim for his role in The Time Machine, died in January 2014 aged 84.\n\nSoon after she drives out to see him, a seagull pecks at her head - an ominous substitute for Cupid's arrow - and it isn't long before the town is under attack from flocks of divebombing gulls and crows.",
            "review_date": "2019-01-01",
            "source": "rt"
        },
        {
            "content": "Interesting movie and the acting was good, but many things weren’t explained in the movie. Like why were the birds attacking and didn’t types of birds at that!!!",
            "review_date": "2018-12-28",
            "source": "rt"
        },
        {
            "content": "This film was great!",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "This movie is not that scary for adults, but The Birds is a very effective horror movie if you want to frighten your children. This Hitchcock thriller offers plenty of suspenseful moments, and holds up surprisingly well, considering the visual effects of the time and the subject matter. My kids will never look at a seagull the same way again.",
            "review_date": "2018-10-31",
            "source": "rt"
        },
        {
            "content": "A suspense classic!\n\nThe Birds (1963) is not only the first Hitchcock film I ever saw as a child, but it remains one of my very favorites. Its title being a double entendre for the physical animals attacking people as well as the British slang term for women. As I just now realize that The Birds is really a drama and romance movie all about one suave man named Mitch Brenner (Rod Taylor) and his relationship between all the women in his life. It's a fascinating story about trust, love, survival, kindness, and abandonment from the mind of writer Daphne du Maurier.\n\nThe real star of The Birds is the lovely Tippi Hedren in her debut feature film. Hedren portrays a confident young woman named Melanie Daniels, whose rich lifestyle leads her to new perils. Hedren is not only beautiful in her green suit, fur coat, done up blonde hair, and sweet voice, but she also acts very well. She carries the film with her easy charm and playful demeanor. You just want to know more about her. Hedren should have gotten more roles after The Birds, but unfortunately Hitchcock only cast her in Marnie. She is really wonderful in The Birds.\n\nAnother excellent performance comes from the mesmerizing Suzanne Pleshette as Annie Hayworth. She exudes a mysterious air and enchanting manner in The Birds. I like how her character's past is slowly revealed as The Birds goes on all helped by Pleshette's uneasy warmth. She kills it in The Birds.\n\nLastly, Jessica Tandy ties the story together as the mother afraid of abandonment with her hysterical outbursts and terrified screams. Tandy gives one of the most captivating performances of her illustrious career.\n\nOverall, Hitchcock really has something here with The Birds. From long creeping panning shots to build up suspense to sudden cuts or zooms in on the horror, Hitchcock will scare or unnerve you at some point while watching The Birds. I still cannot figure out how he got so many birds to act so still or violent to make the movie. Clearly, he utilizes green screens, early CGI, puppets, and edits to make most of the birds look great on camera. But there are still times I cannot understand how The Birds still looks real.",
            "review_date": "2018-09-25",
            "source": "rt"
        },
        {
            "content": "A masterpiece by master director Hitchcock.",
            "review_date": "2018-08-26",
            "source": "rt"
        },
        {
            "content": "Well, I'm so glad I sold my Budgies and Cockatiels before I watch this movie. Because this was pretty darn disturbing!\n\nThe Birds finds Hitchcock at his very best building up the tension and creating suspense. The way the minor details are revealed in this movie is enough to make you glued to the screen throughout the whole movie, but I already know that Hitchcock is the best in doing this.\nWhat I didn't know before watching this movie is that The Master of Suspense is also a Master of Symbolism!\n\nMany people consider The Birds as one of Hitchcock most modest films, even some of his fans. I can see why, and it's simply because the movie seems that it left a lot of very important questions unanswered. I said it seems because it really did answer these questions symbolically.\n\nI won't spoil anything for those who haven't seen this gem yet, but I'll just point that the key to all these questions is a very important character and everything related to it.\n\nJust try to think which character the movie gave it a lot of exposition, and you'll easily understand the whole movie. And there is where I've an issue with The Birds. I think it gives a lot of explanations to this character that we don't necessarily need to because the movie expose some details what have already been revealed before. That being said, all characters are well-grounded, compelling, interesting, and necessary to the plot.\n\nAll the performances were excellent, specially from Tippi Hedren who played the movie's protagonist. She is a wonderful actress, and her performance in this movie is nothing short of endearing. She is as charming as Audrey Hepburn!\n\nSome few decisions the characters made, may be one or two, are not so subtle, but the execution of the results to these decisions is what annoyed me a little bit. The characters seemed forced to fall into the trap.\n\nAlthough there is some blood and gore in this movie, Alfred Hitchcock proves again that what the scenes imply can be way more brutal than what they show. The scenes when the titular creatures attack are very painful to watch. Adding insult to injury, the birds acquire a metaphorical complexity that is as distressing as their beaks!\n\nOverall, The Birds is a very underrated Hitchcock film that doesn't lack any of Hitchcock's unparalleled brilliance. Also it would make a great companion to Hitchcock's most famous work, Psycho!\n\n(9/10)",
            "review_date": "2018-08-14",
            "source": "rt"
        },
        {
            "content": "The special effects aged horribly and what feels like hours of leading up to the main conflict could have easily been left out without the viewers missing it. But Hitchcock's The Birds still has its great moments that evoke a feeling of terror that you just can't resist. PErsonal favorite: the ravens on the playground.",
            "review_date": "2018-06-29",
            "source": "rt"
        },
        {
            "content": "I just watched this movie last night at the historic Los Angeles Theater for a special event and despite the somewhat silly concept (there are some comedic moments in the film so I'm pretty sure Hitchcock was aware of this), it's another really good film which helps to further bolster Hitchcock's legendary status. There are legitimate moments of suspense and moments that creep up on you until it's too late. Some of the 60s effects are a bit dated and it can get a little slow sometimes, but it's still a fine piece of filmmaking with great build up and terrific performances.",
            "review_date": "2018-06-17",
            "source": "rt"
        },
        {
            "content": "Unsurprisingly, it works best when the birds are attacking, providing for some scary and tense scenes with a fantastic sound design that really does make all the difference. The acting is good too, with Tippi Hedren stealing the show. That being said, the build-up is just too long (it's almost an hour before anything particularly unusual happens) and it's not nearly as terrifying or well-written (some of the decisions the characters make are particularly stupid, to say the least) as its reputation would suggest. In anyone else's hands this could have been a disaster, but with good ol' Hitch at the helm, ratcheting up the tension and suspense, it becomes a far better film than it should be. Certainly not his best, but iconic, nonetheless.",
            "review_date": "2018-04-29",
            "source": "rt"
        },
        {
            "content": "It started with an interesting love triangle and then introduced a potential mother twist.  The third act didn't deliver anything other than a larger bird attack.  After a long-winded second half it abruptly ends with no conclusion..",
            "review_date": "2018-02-24",
            "source": "rt"
        },
        {
            "content": "Title: Bird\nStory/Writing/Message/Plot:\t2\nCharacter/Acting:\t\t2\nMusic/Sound:\t\t\t4\nCinematography/Editing:\t4\nAge/Originality:\t\t\t4\nTotal:\t\t\t16/25",
            "review_date": "2018-02-06",
            "source": "rt"
        },
        {
            "content": "A historically important horror film, and ironically directed by Hitchcock who, at the time, was famous for his craft of suspense and fresh to the element of horror, let alone the genre.",
            "review_date": "2018-01-12",
            "source": "rt"
        },
        {
            "content": "Nope. Watched it out of curiosity and it's not scary or clever - it's just as ridiculous as it sounds. Critics gave it lots of undeserving praise. I would compare it to \"The Blob\", \"Attack of the Killer Tomatoes\", or \"Sharknado\". It starts out as a somewhat interesting love story with a very attractive Tippi Hedren, but all hope for the movie was lost when birds got added to the plot.",
            "review_date": "2017-12-31",
            "source": "rt"
        },
        {
            "content": "I love Alfred Hitchcock but this film was soooo slow moving and the Tippi Hedren to me was just a materialistic snobbish stalker. In fact, all the characters were pretty creepy to me, moreso than the birds",
            "review_date": "2017-12-25",
            "source": "rt"
        },
        {
            "content": "I'd argue that this is the original \"zombie film\".",
            "review_date": "2017-11-08",
            "source": "rt"
        },
        {
            "content": "Well, The Birds certainly takes a turn, doesn't it? For what seems like almost an hour this movie barely even hints at what it will become. It feels like a simple relationship drama as we see these two characters meet and grow closer while dealing with all the family and friends that surround them. We wander through a series of scenes that introduce us to all our characters, as they run around from one place to the next. All of this is vital information that makes the rest of the film work. We care about the characters because we got to know them early in the film, and we know where they are headed at any given time because we already are aware of the layout of the town.\n\nWhen the tone shifts, it turns on a dime and truly becomes a horror film. This is where we totally get to experience the amazing talents of Hitchcock. There are so many scenes where the tension builds brilliantly, and that's what makes for a film that is genuinely scary. We can feel the dread along with the people in the film, and even when they don't see it coming, we do. There were a couple of those classic horror movie moments where you get annoyed with the characters for doing something stupid and risky, but it added to the scares so it's hard to complain. Hitchcock also has a knack for framing shots just right, and he knows how to use sound (or leave it out) to heighten the mood.\n\nI've often heard people say that Hitchcock struggles with ending movies, so it seems his solution with The Birds was simply not to end it at all. This movie stops so abruptly that I thought the blu-ray had somehow skipped a final scene. I don't need to have the reason for the bird attacks explained, it's alright that we're left to guess. I don't even need for the movie to tell me what happens next for our characters. But I need to feel like the movie genuinely concluded. Even if it's just \"The End\" on the screen or something. This wasn't enough to ruin The Birds for me, but it did leave me on a sour note. Otherwise this was a very well-crafted movie with a great cast and some of Hitchcock's best scares ever.",
            "review_date": "2017-11-07",
            "source": "rt"
        },
        {
            "content": "I've lost count how many times I've seen this. The special effects have held up surprisingly well, and the mystery of the situation is a compelling plot device. But beyond that, it's also an interesting story unfolding concerning the characters' history and motivations. Awesome actors with great personal chemistry between them. Many moments of wry humor that eventually begin to twist out of shape as the strangeness of the event takes over. It's also a great look into the time period, while maintaining a timeless quality, showcased by Hitchcock's sense of style and attention to detail.",
            "review_date": "2017-10-29",
            "source": "rt"
        },
        {
            "content": "Scariest movie of all time!!!  Most modern horror movies require you to believe in something supernatural or are just bloody/shock value. Hitchcock was a master of suspense and horror, mostly because his stories could happen, which makes them even more terrifying! Crazed birds that attack...just saying, where ya gonna go?  Hope you have an underground bunker!",
            "review_date": "2017-10-13",
            "source": "rt"
        },
        {
            "content": "A perfect combination of psychological and actual horrors. Hitchcock brilliantly alternates scenes of tense suspension with an all-out horror unleashed. From the very beginning there is some looming threat in the air, both metaphorically and physically, an inescapable doom. Hitchcock as a great master of suspense the genre he helped to create knows that suggestive horror makes wonders with people's imagination. I'd also like to point out and praise separately the editing of the movie: it's so masterful and careful, you can't help noticing it. There's also a great deal of psychology unfolding in many situations, like mass hysteria, searching for the guilty. Even the small hint at indiscriminate blaming is made when Lydia, the mother, protests against saving little innocent lovebird claiming \"They're birds!\", meaning they are guilty just being birds also. There were great films thematically similar that preceded this masterpiece, like \"Them!\" for example and there would follow equally great films like \"Night of the Living Dead\".",
            "review_date": "2017-10-04",
            "source": "rt"
        },
        {
            "content": "the first half was boring, its just about a rich beauty trying to get with this guy. then the birds attack. but the ending was kind of lame, it never explains why the birds attack and they just get away no problem",
            "review_date": "2017-09-29",
            "source": "rt"
        },
        {
            "content": "Unforgettable, unmatched and unsurpassed.",
            "review_date": "2017-09-21",
            "source": "rt"
        },
        {
            "content": "I usually like films from legendary director Alfred Hitchcock. \nHis brand of suspense thrillers and technical film wizardry  for the era are strongpoints. So it is with some degree of trepidation that my review of such a well known Hitchcock film is mediocre. The lowest I have rated one of his films.\nI just found the build up starring the two principal actors Tippi Hedren as Socialite Melanie Daniels and Australian Rod Taylor as San Francisco lawyer Mitch Brenner...boring.\nIt begins with some potential romance scenario where Brenner and Taylor meet each other in a pet store before the film cuts to Daniels driving up the California coast to a resort called Bodega Bay where Taylor spends weekends with his domineering mother Lydia Brenner (Jessica Tandy).\nEventually some bird action occurs as Daniels is attacked by a rogue seagull.\nScenes are shown featuring other bird species in attack mode such as sparrows and crows.\nThe horror of the bird attacks look tame by modern standards but I imagine back in 1963 they caused a stir.\nIn one scene a dead body with no eyeballs is shown.\nThe film was produced way before computer effects so relies on special effects from cameras and film. They do the job adequately.\nThe film ends quite abruptly without providing adequate resolution in my opinion. Questions are left unanswered. Why do the birds attack the coastal town?\nDoes outsider to the town Daniels have some link?",
            "review_date": "2017-09-07",
            "source": "rt"
        },
        {
            "content": "Alfred Hitchcock lets go of all of his symbolism and goes straight for the jugular in this horror-laced suspense thriller that turned out to be one of his most talked about films.  Tippi Hedren makes her film debut as a spoiled socialite who pursues a potential suitor (Rod Taylor) after a chance encounter at a pet store.  The story unfolds in a quiet beach town in California as residents are being pursued by unusually angry birds at an alarming rate.  The reasoning for the attacks are not the point here; but rather the sense of humanity that occurs when danger is imminent.  Jessica Tandy plays Taylor's mother and Veronica Cartwright his sister; while Suzanne Pleshette is a school teacher in the town; all part of the mystery surrounding the enraged birds.  A great storyline and some shockingly graphic depictions of the attacks make for an unsettling film experience from the master of suspense.",
            "review_date": "2017-09-03",
            "source": "rt"
        },
        {
            "content": "I'm really not sure why this movie became such a hit. Were the people in the 1950's that gullible? The movie is well done and I love Tippi Hendron - but the premise is pretty unbelievable. If Hitchcock had at least chosen birds of prey, like hawks and vultures, I would've bought it. But seagulls and sparrows, really?? The part where the seagulls are smashing through the windows and attacking Rod Taylor - without breaking their little necks and pecking through a wooden door - I thought, \"This is like a comedy!\" lol! Anyway, its a fun watch if nothing else.",
            "review_date": "2017-08-22",
            "source": "rt"
        },
        {
            "content": "The final shot depicts a successful invasion, an inversion of a scenario that might have been when this house and all others were built.  The shot unnervingly comes from the houses POV, literally a birds eye view of their victory over the humans.  Hitch doesnt seem like an animal rights activist, but with this film in particular, you have to wonder if he isnt making a statement about mans displacement of habitats during the growth of civilization, as the birds have now displaced the home owners of this whole hamlet.  Earlier in the film, our protagonist Mitch questions why birds should be in cages.  In the climactic third act, the birds will encage the humans in their own home.  Like Planet of the Apes, were experiencing role reversals between human and another kind of animal.  Hinge upon an animals freedom, especially a birds, and theyll hinge upon yours.",
            "review_date": "2017-08-18",
            "source": "rt"
        },
        {
            "content": "The Birds is Hitchcock's one and only \"monster\" movie, and it's quite good, despite some slow pacing in the beginning, special effects that suffer today, and a questionable central performance Tippi Hedren. It thrives on assured, confident direction, some excellent sequences, great sound design, and a thoughtful message about man vs nature.",
            "review_date": "2017-08-03",
            "source": "rt"
        },
        {
            "content": "A classic Hitchcock flick that builds up with a long but good story and plenty of thrills. That also shines in its own right even if it is somewhat lower than his other films.",
            "review_date": "2017-07-29",
            "source": "rt"
        },
        {
            "content": "I still feel bad for poor Tippi having to deal with actual living birds but it's hard to argue with the end result. I still get really nervous when I pass a tree which has large numbers of birds in it.",
            "review_date": "2017-07-13",
            "source": "rt"
        },
        {
            "content": "I will never ever look at birds (especially crows or seagulls) the same way again!\n\nThis film is extremely terrifying with \"birds\" being the terrifying concept which works brilliantly. I haven't been frightened by the film that much in a long time. \n\nHitchcock sets the film up quite nicely with a simple romantic plot which turns into a \"run for life\" bloody fight with nature.\n\nHe directs some scary but lovely shots that make you feel like your 'Tippi' Hedren screaming for your life.\nIf you like your classic horrors, this is right up your street.  \n\n\"The Birds\" - terrifyingly brilliant, extremely scary concept and wonderfully directed. Alfred Hitchcock said \"It could be one of the most terrifying motion pictures I have ever made\" \nWell, for me, it's the most terrifying film I have ever seen and I loved it!",
            "review_date": "2017-06-26",
            "source": "rt"
        },
        {
            "content": "Let's just be honest: this movie is the reason I don't like big groups of birds. The camera shots are fantastic at building terror and suspense. However I feel like the film ends pretty abruptly and you don't get to find out why the birds have gone mad. I also thought the romance was awkward and undeveloped. But it's still a great movie.",
            "review_date": "2017-06-14",
            "source": "rt"
        },
        {
            "content": "The Birds: Hitchcock expertly builds suspence in this underated masterpeice. While expertly crafting its characters, villans and story.",
            "review_date": "2017-06-13",
            "source": "rt"
        },
        {
            "content": "The final masterpiece by Hitchcock.  Hitch should've retired after finishing this one.",
            "review_date": "2017-05-20",
            "source": "rt"
        },
        {
            "content": "Hitchcock does it again!  One of horror cinema's finest!",
            "review_date": "2017-05-10",
            "source": "rt"
        },
        {
            "content": "Halfway through watching this I began to think that it must actually be a comedy film- but no. This ridiculous film actually takes itself seriously. After the first few bird attacks I stopped wondering what would happen next and just started wondering when the film would end. And even the end wasn't satisfying- the film just stops (but thank god it does).",
            "review_date": "2017-04-30",
            "source": "rt"
        },
        {
            "content": "Wow, that blonde is a beauty. A sight for sore eyes and the chemistry between her and the brawny man is evident. She's has a certain charm and glow about her. She's really cute and pretty, very easy around the eyes. Never noticed how keen Hitchcock's sense of humor was. It really shows in this movie. \n\nHitchcock took some really beautiful shots of the coast leading up to Bodega Bay. There's a very eerie feeling going on with the guy's mother. She looks like one of these hardcore Christian strict mother's. I'm very interested in the story now that there seems to be some sort of mystery thanks to the wonderful acting chops of the main characters. \n\nIt seems like her presence there at Bodega Bay isn't welcomed. Ever since she got there, weird things started happening. I'm very curious to see how the birds and Ms. Daniels are connected and what happens. Holy shit when all those words poured out of the chimney. That was a pretty crazy sight that I wasn't expecting to see when they showed the guy who got attacked by the birds in his pajamas. \n\nI'm glad Lidia was able to open up to Melanie about her deceased husband. I never thought that seeing so many birds in one location could be so haunting to looks at especially when they're all dark birds. Seeing the kids get attacked by the crows was pretty funny to watch. Mostly there reactions were funny. \n\nThat diner scene was really entertaining to watch. Seeing all these different characters with there unique personalities communicating for what seems like the first time together. Had it's really funny moments too. That whole part with guy lighting his cigar and everything just goes to hell had me laughing so hard. The use of noise and sound effects was really well done. I will say, Hitchcock is a pro at building suspense.\n\nThis movie was fantastic! Wow. Definitely worth re watching later on down the line to maybe make connections and as to why the birds started committing all these attacks in the first place. We're the birds a sign that Melanie, Mitch, and Mitch's mother had to come to terms and be at peace with one another?",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "An obvious must-see. Still creepy to this day.",
            "review_date": "2017-03-08",
            "source": "rt"
        },
        {
            "content": "The Birds was my first exposure to Alfred Hitchcock. The Birds is a solid horror film that just continues to build suspense. The characters are all great and personal. The special effects hold up well. The best thing about this movie is that they give us no answer. We have no clue why all of a sudden the birds turn on humanity. The great Horror films never reveal things like this. The Birds is a really solid Horror film everyone should check out at least once.",
            "review_date": "2017-02-15",
            "source": "rt"
        },
        {
            "content": "A scary and suspenseful movie",
            "review_date": "2017-02-01",
            "source": "rt"
        },
        {
            "content": "10 out of 10:\n\nThanks to incredible special effects, acting, and directing, The Birds makes innocent animals into terrifying ones.",
            "review_date": "2017-01-07",
            "source": "rt"
        },
        {
            "content": "This movie really does not live up to it's reputation. It is way too long and boring. The few scenes that have birds, while scary, do not compensate for it's empty plot.",
            "review_date": "2017-01-07",
            "source": "rt"
        },
        {
            "content": "https://sites.google.com/view/ttbreviews/our-company/the-birds",
            "review_date": "2016-10-18",
            "source": "rt"
        },
        {
            "content": "Great movie. Surprisingly nobody got covered in bird poop.\n\nI find it hilarious how Alfred's last name is *BLEEPED*  out of the reviews.",
            "review_date": "2016-09-05",
            "source": "rt"
        },
        {
            "content": "The Birds is one of Alfred Hitchcock's most iconic films, along with Psycho and North by Northwest. The film has good acting from both Tippi Hedren and Rod Taylor. The film is very well directed by Hitchcock as there is a lot of build up which may feel slow but is necessary to make us care about the characters. Once the birds attack the film is very thrilling and gets more and more tense until you get to the end. All of the bird attack scenes are very tense and get quite violent which is surprising considering this film was made in the 60's when censorship was a lot stricter. The film is well written and edited and isn't really boring although it does move at a slow pace. There are lots of iconic and thrilling moments such as the iconic phone booth scene and the school scene. The school scene is a very tense and very well set up scene that is brilliantly directed by the brilliant Hitchcock and has a great pay off. The scene where Tippi is attacked in the attic is quite possibly the most disturbing and tense moments. Hitchcock wanted this scene to feel like a rape and he really captured the intensity and horror perfectly. The bird attack is also well set up as we get brief little hints there is something wrong with the birds before they attack so when they actually do attack it's been well set up and doesn't come out of nowhere. While this is a very good film it is quite dated. For one the birds are obviously super imposed and while some shots of them attacking looks real, most of it looks rather fake which is understandable as this film is nearly 50 years old. Also while the set up is necessary I do feel it goes on for too long and does get a little tedious. Also the lack of music I feel at points is very noticeable like when the mother character finds this dead body it does feel a little odd with no music. However the birds is a really good if not great film. I highly recommend it to any fan of films or in particular fans of Hitchcock. The Birds is a classic and while not Hitchcock's best it's very good. B+",
            "review_date": "2016-08-31",
            "source": "rt"
        },
        {
            "content": "always thought this was overrated",
            "review_date": "2016-08-24",
            "source": "rt"
        },
        {
            "content": "\"The Birds\" has its own style for the first time, looks like a romance movie, but one always gets a sense that something strange, this is very good, and is the face of Hitchcock, each character is very well depth, nothing is shallow, so I think \"birds\" as one of the best scripts of Hitchcock movies (along with Vertigo), the performances are great (Tippi Hedren beautiful as ever), the picture is beautiful, this the peaceful landscapes on the roads, to the scenes of pure suspense, with red sky, aprontas birds and a desperate atmosphere in the air, the soundtrack is almost non-existent, but it does not really miss. The movie is great, but has some problems, the film has some scenes that start in spectacular fashion, you're all euphoric, and the scene ends in a silly way, the effects are good for the time, and Hitchcock really tries to leave all very real, if you like suspense, watch \"the birds\", will not regret it.\n\n(SPOLIER)Many people complain not have an explanation for the attack of the birds, well, I think the best, but we can deduce, as Hitchcock leaves clues, dialogue in agriculture, the canaries in the cage, every work of fiction has its internal logic, and Hitchcock tries to show one absurd logic (or not), the animal simply get tired of being overwhelmed, and decides to oppress, and is almost clear in the film, which has a higher intelligence controlling them, remember their attacks in waves, is a mixture of instinct with intelligence, which Hitchcock meant by that? perhaps the creator revolting against the creature a half bizarre logic, but why not? Everyone who draw your own conclusions, this is the magic of cinema.\n\nForgive my English translator google.",
            "review_date": "2016-07-22",
            "source": "rt"
        },
        {
            "content": "I forgive the terrible graphics - Hitchcock's one detour into the supernatural is a fun side-trip.",
            "review_date": "2016-07-19",
            "source": "rt"
        },
        {
            "content": "One of Hitchcock's best horror movies.  The only thing that doesn't hold up to today's standards are the subpar special effects.",
            "review_date": "2016-07-19",
            "source": "rt"
        },
        {
            "content": "A mediocre film where Hitchcock was obviously typecast into making a horror flick after the excellent PSYCHO.",
            "review_date": "2016-07-07",
            "source": "rt"
        },
        {
            "content": "The perfect Suspense movie.\nBrilliant, brilliant, brilliant.\n\nLegendary sequences that are etched in ppls minds since they first saw this, it starts out as a romance, and takes a quick, dark left into almost unimaginable terror from the skies.\n\nWatch it again to enjoy some details you likely forgot - not a criticism of your memory by any means, just a reminder of the great flourishes with Alfred at the helm firing on all cylinders.\n\nClearly this was influential on Jaws terror-from-the-deep, and still I'd love to see what he would have done within the era of Shark Week and animal attack videos on YouTube..lol\n\nThere are so many shocks and twists, you can't help but be drawn into each dilemma.\n\nA great work.\n\n5 ominous squawks out of 5",
            "review_date": "2016-07-02",
            "source": "rt"
        },
        {
            "content": "Who else better than Hitchcock to be able to really make you feel thrilled and paranoic about an animal that normally you wouldnt be scared of. Really impressive how they managed the special effects for that time, I LOVE the technicolor style (most people don't notice this) but it is delightful! I always enjoy playing Where's Hitchcock when watching his movies. All time horror classic film you must watch; book adaptation that doesn't fails, Daphne Du Maurier is a suspense goddess.",
            "review_date": "2016-05-28",
            "source": "rt"
        },
        {
            "content": "This Alfred Hitchcock masterpiece was not nearly as good as rear window or psycho but it is one of the great classics to watch",
            "review_date": "2016-05-24",
            "source": "rt"
        },
        {
            "content": "The Birds still succeeds to this day bc it delivers it's fright via suspense.  The theme may sound obvious/mundane (killer birds) but Hitchcock masterfully blends tension with a killer score to scare the viewer.  It's well worth a watch, especially on a windy Autumn night.",
            "review_date": "2016-05-12",
            "source": "rt"
        },
        {
            "content": "What an innocent classic, quirky film. I don't think there has every been another film made like it. The bird attack was funny considering what can been done in film these days.",
            "review_date": "2016-04-13",
            "source": "rt"
        },
        {
            "content": "The lack of an epic crescendo seems to add to the film's greatness, though my plebeian expectations were a bit shocked.",
            "review_date": "2016-04-03",
            "source": "rt"
        },
        {
            "content": "Oh my gosh, how is this pile of garbage a classic. the visual effects suck, the movie isn't scary in any way, the acting is horrific, and the movie just sucks. The Birds made me laugh my head off, for that it gets more than half a star.",
            "review_date": "2016-03-29",
            "source": "rt"
        },
        {
            "content": "The Birds (1963) ??? 1/2\nVery scary thriller from Hitchcock hasn't dated one bit. Bizarre occurrences with birds spring up in San Francisco. Tremendously suspenseful, yet not quite at the level of the Master's full capability. Final scene is still impressive.",
            "review_date": "2016-03-27",
            "source": "rt"
        },
        {
            "content": "It's no Psycho but The Birds is still good.",
            "review_date": "2016-03-26",
            "source": "rt"
        },
        {
            "content": "Birds conglomerate and attack residents of a small California coastal town. The blueprint for any film where animals attack. Some scenes had me wondering how they managed to film them. Another supreme effort by Hitchcock.",
            "review_date": "2016-03-13",
            "source": "rt"
        },
        {
            "content": "Still scares me tho I watched it 50 years ago.",
            "review_date": "2016-02-20",
            "source": "rt"
        },
        {
            "content": "It seems the plot was written by a hen and directed by Hitch'cock'.",
            "review_date": "2016-02-03",
            "source": "rt"
        },
        {
            "content": "Fantastic and totally creepy from the start to the finish",
            "review_date": "2016-01-26",
            "source": "rt"
        },
        {
            "content": "86%\nSaw this on 5/1/16\nBirds is a total failure as a horror film, but it is a triumph as a platform for Hitchcock's talent as a director and efficient use of build up and tension even if it all adds up to nothing. For most of the time, Birds are a distraction and the film develops a lot of story and interesting characters in the first half which you do not see often in modern horror flicks. Birds doesn't have a mentality of exhibiting gore and bloodshed right from the opening scene and when the horror really comes, it feels like a sore thumb. However, as the movie progresses into its last half an hour, it manages to gain a lot of momentum thanks to Hitchcock, a splendid voice editing (bird chirping) and some fine acting from all cast except Tippi Hedren.",
            "review_date": "2016-01-05",
            "source": "rt"
        },
        {
            "content": "The special effects don't hold up well, but they don't have to in order to scare the audience. If the merits of Hitchcock's films are based on his mastery of suspense, then this may be his greatest work ever.",
            "review_date": "2016-01-04",
            "source": "rt"
        },
        {
            "content": "What can you say? It is a brilliant horror film that set the precedent for \"gross-out\" horror while simultaneously being an achievement in visual effects. It scary, and it doesn't even have a score and doesn't need one. By the end of this film the flapping of wings will scare you.",
            "review_date": "2016-01-03",
            "source": "rt"
        },
        {
            "content": "Another intense movie that is filmed perfectly with a very disturbing scene overall another good horror film from Hitchcock",
            "review_date": "2016-01-01",
            "source": "rt"
        },
        {
            "content": "Terrifying, though there's really too much boredom between bird moments",
            "review_date": "2015-12-20",
            "source": "rt"
        },
        {
            "content": "The Birds used long build-up to gain suspense but it didn't work really well. The acting is very good.",
            "review_date": "2015-12-08",
            "source": "rt"
        },
        {
            "content": "Despite an awkward ending, Hitchcock creates some interesting characters and truly iconic scenes, using Birds as villains doesn't sound as terrifying and brilliant as it actually is.",
            "review_date": "2015-11-20",
            "source": "rt"
        },
        {
            "content": "Mr. Hitchcock demonstrates he is ever the master of suspense while magnificently depicting birds as some of the scariest horror movie villains ever filmed.",
            "review_date": "2015-11-01",
            "source": "rt"
        },
        {
            "content": "I'm giving it two stars because even though it's from the early 60s it lacks horror and it has a pointless ending. I would've given it 1 star but considering how old it is I gave it two. In my opinion it's not one of Alfred's best films.",
            "review_date": "2015-10-27",
            "source": "rt"
        },
        {
            "content": "Occasionally effective in some quiet scenes that really bring up tension. Sadly though its incredibly weak compared to Hichcocks other work. This one spends too much time padding out its runtime it gets tiresome. Scenes go longer then they should. The effects are very hoaky by today standards. Though at least they got a whole lot of birds too fly around so that's an achievement by itself. Ehhh I will never visit this one again :/",
            "review_date": "2015-10-21",
            "source": "rt"
        },
        {
            "content": "An unparalleled horror flick which Alfred Hitchcock knew well that paranoid build-up all the way from the bottom and no answers made it all the more memorable, if a little less intelligent, than his previous work.",
            "review_date": "2015-10-18",
            "source": "rt"
        },
        {
            "content": "The way how Hitchcock picked up in birds to make they villains is really chilling and interesting, but it isn't enough put birds attacking people for to make a movie being good, and that is why this movie is really great in its exhilarating well-acted bloody action, but weak about the content and the script.",
            "review_date": "2015-10-18",
            "source": "rt"
        },
        {
            "content": "The way how Hitchcock picked up in birds to make they villains is really chilling and interesting, but it isn't enough put birds attacking people for to make a movie being good, and that is why this movie is really great in its exhilarating well-acted bloody action, but weak about the content and the script.",
            "review_date": "2015-10-18",
            "source": "rt"
        },
        {
            "content": "Looking past the dated visual effects, this underrated Hitchcock film that builds a world that is both eerie and haunting. Victorious in its camerawork and suspense, this film is only marred by its bad acting and relatively simplistic story.",
            "review_date": "2015-10-07",
            "source": "rt"
        },
        {
            "content": "Considered a horror classic, even though the only reason this movie gets any attention is because of the director's name attached. If the movie were exactly the same and there were a different director's name, this movie would not be praised anywhere nearly as much as it is.\n\nFirst, a few good things. The acting is pretty good. There are some amazing visuals (especially the birds on the playground). There is an attempt to build interest in the characters with some backstory and a slow burning plot.\n\nBut that's about it.\n\nWhile the build with the characters is appreciated, the biggest problem is that when disaster strikes they all start acting so stupid. \"The birds are outside attacking people.\" \"Let's get out of here and make a run for it!\" It's so dumb, it's frustrating. It makes you hate the characters, not worry about their potential demise.\n\nSome of the shots of the birds are amazing, but the special effects are embarrassingly bad. The scene with the birds coming down the chimney starts off impressive looking, but quickly becomes laughable.\n\nThis is really just a basic man vs. nature movie. Despite such a basic premise, it's about two unforgivable hours. It has no reason to be so long. Maybe I could appreciate the woman chasing the man plot of the first hour a bit more if our two main characters didn't have to act like complete buffoons in the second half. It made me feel like getting attached to such characters was a waste of time. The visuals are good, and there is a bit of Hitchcock flare to it, but it's all at the service of a pretty stupid plot. The good thing is the two hours don't necessarily feel too long and it does pace itself well enough to hold your interest. But it's not a movie you really want to watch again.",
            "review_date": "2015-09-19",
            "source": "rt"
        },
        {
            "content": "One weird film that has inspired countless works after its release. It's another amazing Hitchcock, no surprise there, but his females in this one have a unique weight and character. The birds look a little silly at times, especially on the latest blu ray print, but the overall effect is still pretty potent. The final shots are flawlessly executed.",
            "review_date": "2015-09-17",
            "source": "rt"
        },
        {
            "content": "A movie to this day that can keep you on the edge of your seat. Birds is a classic suspense movie that has you  locked into watching and wanting more.",
            "review_date": "2015-09-12",
            "source": "rt"
        },
        {
            "content": "The characters in this film continually make ridiculous/dangerous decisions.  WHY did the kids have to leave the school?  Lock the doors and stay inside - away from the birds.  WHY does Melanie HAVE to run out of the restaurant into a phone booth and then repeatedly open the door as the gulls attempt to get at her.  Silly stuff.  SO not up to par for Alfred Hitchcock.   :-(",
            "review_date": "2015-09-05",
            "source": "rt"
        },
        {
            "content": "first film I've watched. I was 7, and it changed my life--look, I'm making films now",
            "review_date": "2015-08-30",
            "source": "rt"
        },
        {
            "content": "With \"The Birds,\" Alfred Hitchcock creates one of his most memorable horror stories with some of the most threatening antagonists in movie history.",
            "review_date": "2015-08-21",
            "source": "rt"
        },
        {
            "content": "Not Hitchcock's best work, but still very entertaining and creepy. The technicolor feeling adds to the creepiness along with the lack of a soundtrack. There is a sense of emptiness and loneliness in the film.",
            "review_date": "2015-08-17",
            "source": "rt"
        },
        {
            "content": "I have to confess to watching this film again and again, primarily to see the horrid children terrorised by birds and their ridiculously cheezy acting",
            "review_date": "2015-08-11",
            "source": "rt"
        },
        {
            "content": "Birds!!! ... I have never seen this movie.",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "Arguably my favourite Hitchcock film.",
            "review_date": "2015-07-29",
            "source": "rt"
        },
        {
            "content": "An apocalyptic nature film about birds inexplicably attacking people that was technically amazing but totally lacking in story, and probably one of the weakest films in Hitchcock's oeuvre.",
            "review_date": "2015-07-20",
            "source": "rt"
        },
        {
            "content": "Very Good Movie Best Horror Movie Ever Made in My Opinion",
            "review_date": "2015-07-15",
            "source": "rt"
        },
        {
            "content": "I tried to like it, but it's old-timey sense of suspense came off as tired and dull.",
            "review_date": "2015-06-02",
            "source": "rt"
        },
        {
            "content": "Spectacular special effects, unsettling dialogue throughout, and external forces of nature turning on humans while unprovoked. The original gory horror flick",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "The Birds is a 1963 American horror-thriller film directed and produced by Alfred Hitchcock. \nI'll never look at a bird in the same way again. This Hitchcock thriller is almost two movies in one. At the start we have clever sexual tension between the two lead actors. Then we have birds featuring some very good special effects for that era. The only thing I didn't like was the ending. \n1001",
            "review_date": "2015-05-17",
            "source": "rt"
        },
        {
            "content": "80% on my Tomatometer.",
            "review_date": "2015-05-13",
            "source": "rt"
        },
        {
            "content": "Alfred Hitchcock's The Birds is one of those films that I really wanted to watch for years, as it seems like a genius idea to make the birds the villain for a horror movie. As for a horror film of course, it needs to have suspense that can lead to effective scares, and Alfred Hitchcock has done a magnificent job with it. The cast did a great job with it, and the birds themselves about how they land in the right spot which I've never seen before for a bird in a movie. The characters are memorable and it gets a lot of character development which makes me relate to it more. The effects are amazing, and there's rarely any music in this which makes it more suspenseful. I think that for a few minutes they dragged it on and was starting to lose my interest a bit, but it makes it up for it with birds  attacking which is terrifying to say at least. When there's a group of birds, you wouldn't know when they are about to strike, and there's no music either which makes it even more unnerving. It's not the most terrifying film I have ever seen, but The Birds is a scary film that shows how suspenseful it is which Alfred Hitchcock is famous for.",
            "review_date": "2015-04-15",
            "source": "rt"
        },
        {
            "content": "Starring Rod Taylor, Tippi Hedren, Suzanne Pleshette and Jessica Tandy. Heiress Hedren follows handsome stranger Taylor from San Francisco to his home further up the coast. Birds then mysteriously begin to attack Hedren and those around her. More ambiguous and ultimately lesser Hitchcock. From a story by Daphne du Maurier.",
            "review_date": "2015-04-07",
            "source": "rt"
        },
        {
            "content": "Hitchcock is magnificent in creating that feeling of foreboding in this film.  I wouldn't liked to have some kind of speculation though for the terrorization. As is, although nicely constructed, the storyline left me wanting.",
            "review_date": "2015-03-22",
            "source": "rt"
        },
        {
            "content": "I know it's not a comedy but I laughed all the way through it. This movie is highly entertaining!",
            "review_date": "2015-03-15",
            "source": "rt"
        },
        {
            "content": "Hitchcock's slow burn thriller, uses a plot line that could actually happen making the horror of what's on screen realistic. A classic movie which see's the clichÃ©d Hitchcock blonde in the central role. Despite this one cliche The Birds is an excellent piece of cinema that although seems outdated by today's standards is still an excellent watch.",
            "review_date": "2015-02-23",
            "source": "rt"
        },
        {
            "content": "pretty suspenseful with an anticlimactic ending.  What was that about?",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "I found The Birds to be a mixed bag, and remarkably dated even for it's age.  The performances are solid like most Hitchcock films, the concept is unique and the final act carried hair-trigger intensity.  Unfortunately, the first act and it's build-up was not only slow, but also unfocused plot-wise, the developing love story blooming off screen was underwhelming, and the abrupt ending which left the reason behind the bird attack unanswered was disappointing.  Overall The Birds was a decent affair but I'm in no urge to revisit it.",
            "review_date": "2015-02-18",
            "source": "rt"
        },
        {
            "content": "There are some truly scary scenes in here, despite the ending that will frustrate any viewer in perpetuity. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "I give it credit for showing bloody kids and only having one 'hysterical woman screaming' scene. Some nice location shooting for once(and much studio lot shooting as well of course). This story could have been really silly, but Hitchcock keeps it legit (but never mindblowing). Although I guess the town has never heard of guns, torches, baseball bats...tennis rackets..something? I also didn't realize Suzanne Pleshette was so hot in her youth.",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "A perfectly produced & perfectly realised film about a small island where the avian wildlife might not be as it seems. The tension is wound up expertly by Hitchcock into a terrifying and still brutally raw final third. It remains edge of the seat stuff despite the many times I've seen this. Both eerie and beautiful this is an absolute classic.",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "Epic shots of sitting birds. But the flying ones seems a little dated 50 years on. And the end makes me want more",
            "review_date": "2014-12-18",
            "source": "rt"
        },
        {
            "content": "Much of the scholarship around Alfred Hitchcockâ??sÂ The BirdsÂ â?? and, indeed, much of the fascination â?? centers around the canny decision by the director and his screenwriter Evan Hunter not to reveal the cause of the avian assault on Bodega Bay that forms the central conceit of their film. (Hitchcock to Hunter, better known to pulp fans as Ed McBain: â??Iâ??m sure we are going to be asked again and again, especially by the morons, â??Why are they doing it?â??â??) This simple decision makesÂ The BirdsÂ stand out from nearly all of the rather more logical and spelled-out natural disaster films that have come in its formidable wake, but itâ??s a self-conscious gesture on Hitchcockâ??s part, as well. Just as the penultimate scene ofÂ PsychoÂ proposes a coldly analytical interpretation of that filmâ??s events â?? an interpretation that, like the shot that follows it, manages to dredge up the truth but not to assuage the overall sense of dread and uncertainty â??Â The BirdsÂ also proposes its share of rational explanations, but they offer neither satisfaction nor comfort.",
            "review_date": "2014-11-28",
            "source": "rt"
        },
        {
            "content": "God this movie went on forever, and it wouldn't be so bad if it weren't fricking birds. The build up is good but the fact that it's one of the lesser harmful omnivores, and that the effects of the time haven't exactly aged well.",
            "review_date": "2014-11-27",
            "source": "rt"
        },
        {
            "content": "Impossible not to love this movie!",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "An excellent example of old fashioned horror movies, with an extremely slow start and then a rampantly good pay-off for all that tension. Turning ordinary birds into a threatening force wasn't the easiest job, but Hitchcock pulled it off. Another fantastic movie of his that just proves him to be the master of building tension: A skill that a lot of modern horror movies have completely forgotten.",
            "review_date": "2014-11-01",
            "source": "rt"
        },
        {
            "content": "Absolutely terrifying. There is nothing corny about these birds, in a horror film layered with a sly romance and an ambiguous ending that wraps up the character arcs but leaves you wondering if anyone is actually going to survive long enough to enjoy their newfound relationships.",
            "review_date": "2014-10-31",
            "source": "rt"
        },
        {
            "content": "Not my favorite Hitch effort but still has a lot of magnificent scenes and Tippi Jensen is gorgeous.  The pacing is a little slow but the attack scenes are brilliantly staged.",
            "review_date": "2014-10-21",
            "source": "rt"
        },
        {
            "content": "2nd favorite Hitchcock film",
            "review_date": "2014-10-21",
            "source": "rt"
        },
        {
            "content": "Some of the camera angles and effects are a bit outdated and fake, but thanks to Hitchcock's masterful storytelling and suspense, \"The Birds\" is one of those rare films that turns its b-concept storyline into an A+ masterpiece.  It's thrilling and teaches film admirers on how to build suspense.  Too bad the ending didn't justify the story or conclude it...",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "This is one of many of Hitchcock classics I can watch over and over again and never get tired of it. Tippi is hot as always in this film. It's amazing how a woman can be so sensual and sexey without showing her boobs and ass. The color and detail of the Blu Ray are exceptional. Coupled with the fantastic sound on a good audio system and you have an excellent film to entertain you. I especially like to watch the special features, which give you not only a special appreciation for the making of the film, but also enhance the whole experience.",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "This movie is a true classic from the master of horror and suspense. A must watch and must buy.",
            "review_date": "2014-09-18",
            "source": "rt"
        },
        {
            "content": "It's slightly hindered by typical love story melodrama, but otherwise, \"The Birds\" is another Hitchcock classic that builds tight suspense and is the exact reason why I hate birds. The attack scenes are still terrifying (especially when you can't tell which birds are real or not), and the movie's sense of apocalyptic doom in the form of Mother Nature is overwhelming. We never do know why the birds are attacking, which makes the film even scarier. Add Tippi Hedren's timeless beauty to the mix and you have a horror classic.",
            "review_date": "2014-09-10",
            "source": "rt"
        },
        {
            "content": "It's only Hitchcock who can make a simple story turn scary and intriguing and leave enough suspense in the end to keep making you think of it after. A classic with good performances.",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "\"Have you ever seen so many gulls? What do you suppose it is?\"\n\nAfter having surprised and shocked audiences with Psycho, Alfred Hitchcock followed it up with another horror film, The Birds, which is more straightforward and generic than the rest of his films, but he still did experiment quite a bit with some elements here. There are no surprises or unexpected twists in The Birds and it pretty much plays out as a standard thriller slowly building the suspense by introducing us to the characters so we can identify with them. He didn't use psychological suspense either like he did in so many of his films, he just let the narrative unfold gradually. This may sound like a standard horror film, but what Hitchcock experiments with here is the lack of a musical score to accompany the film. Most thrillers rely on eerie scores to help set the mood, and we know Hitchcock included them often such as in films like Vertigo and Psycho, but here rather than introducing music he uses the sound of birds to scare audiences. Many people complain that the effects are outdated, but it didn't bother me at all, I thought they were really well done and I felt the tension during some of these scenes that have become classic by now (such as the scene where Tippi Hedren's character is trapped inside a phone booth as the birds are attacking the town, and the climatic scene where the birds are surrounding Rod Taylor's home). Those were memorable scenes full of tension, but I did have some issues with the pacing of the story. \n\nHitchcock made sure we cared for the characters and during the first hour of the film he spends time building a possible romantic relationship between Rod Taylor and Tippi Hedren. This is where I wished the main characters were played by more charismatic actors such as James Stewart and Kim Novak where the chemistry between them would seem stronger, and that would have engaged me more with a story I kind of felt was silly otherwise. The premise is kind of out there since I really never believed the threat of the birds nor felt their presence haunting, but Hitchcock still managed to build in a few scares despite it all. The bay near San Francisco where this film mostly takes place was a perfect setting and I actually enjoyed the fact that it took place in an enclosed space like this. It sort of made the audience believe these characters were enclosed and surrounded by the birds. Hitchcock can build suspense out of nearly anything and despite my disbelief of the birds being a real threat there were times I did feel that tension. The way in which he exchanges shots from one scene to the next like he did in the phone booth with exterior shots exchanged with interior ones really helps build the suspense and create a tense atmosphere. The Birds may not have much psychological depth, but it plays out quite well as a generic disaster film and slowly builds its way up to a rather interesting climatic scene (I mean switch the birds for zombies and you realize where George A. Romero may have got his ideas for Night of the Living Dead). The Birds isn't amongst my favorite Hitchcock films, but I still had a fun time with it.",
            "review_date": "2014-08-15",
            "source": "rt"
        },
        {
            "content": "\"Have you ever seen so many gulls? What do you suppose it is?\"\n\nAfter having surprised and shocked audiences with Psycho, Alfred Hitchcock followed it up with another horror film, The Birds, which is more straightforward and generic than the rest of his films, but he still did experiment quite a bit with some elements here. There are no surprises or unexpected twists in The Birds and it pretty much plays out as a standard thriller slowly building the suspense by introducing us to the characters so we can identify with them. He didn't use psychological suspense either like he did in so many of his films, he just let the narrative unfold gradually. This may sound like a standard horror film, but what Hitchcock experiments with here is the lack of a musical score to accompany the film. Most thrillers rely on eerie scores to help set the mood, and we know Hitchcock included them often such as in films like Vertigo and Psycho, but here rather than introducing music he uses the sound of birds to scare audiences. Many people complain that the effects are outdated, but it didn't bother me at all, I thought they were really well done and I felt the tension during some of these scenes that have become classic by now (such as the scene where Tippi Hedren's character is trapped inside a phone booth as the birds are attacking the town, and the climatic scene where the birds are surrounding Rod Taylor's home). Those were memorable scenes full of tension, but I did have some issues with the pacing of the story. \n\nHitchcock made sure we cared for the characters and during the first hour of the film he spends time building a possible romantic relationship between Rod Taylor and Tippi Hedren. This is where I wished the main characters were played by more charismatic actors such as James Stewart and Kim Novak where the chemistry between them would seem stronger, and that would have engaged me more with a story I kind of felt was silly otherwise. The premise is kind of out there since I really never believed the threat of the birds nor felt their presence haunting, but Hitchcock still managed to build in a few scares despite it all. The bay near San Francisco where this film mostly takes place was a perfect setting and I actually enjoyed the fact that it took place in an enclosed space like this. It sort of made the audience believe these characters were enclosed and surrounded by the birds. Hitchcock can build suspense out of nearly anything and despite my disbelief of the birds being a real threat there were times I did feel that tension. The way in which he exchanges shots from one scene to the next like he did in the phone booth with exterior shots exchanged with interior ones really helps build the suspense and create a tense atmosphere. The Birds may not have much psychological depth, but it plays out quite well as a generic disaster film and slowly builds its way up to a rather interesting climatic scene (I mean switch the birds for zombies and you realize where George A. Romero may have got his ideas for Night of the Living Dead). The Birds isn't amongst my favorite Hitchcock films, but I still had a fun time with it.",
            "review_date": "2014-08-15",
            "source": "rt"
        },
        {
            "content": "Classic horror movie, mostly based on fear of the unknown, and did not even give an explanation for the birds' behavior. Not really scary to me.",
            "review_date": "2014-08-05",
            "source": "rt"
        },
        {
            "content": "I must confess I do not see what people see in this one.  It takes 45 minutes to actually get going, which would be fine if the plot were compelling like the build up is in \"Psycho\" for example, or was connected to the rest of the film in a meaningful way, but it really isn't.  It has some great individual sequences, but I find the climax to be extremely slow, static and devoid of real suspense.  For me, this is one of Hitch's least efforts.",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "Es un trabajo lento y está ligado a convencionalismos de la época. No obstante, solo la gloriosa dirección de Hitchcock podría convertir la problemática de los personajes en algo tan serio, asfixiante, opresivo, inquietante y hasta un poco terrorífico; y sinceramente, pienso que la utilización magistral del silencio da fe de ello.",
            "review_date": "2014-07-28",
            "source": "rt"
        },
        {
            "content": "The best Hitchcock film. There are a number of scenes that are hilariously laughable for modern audiences but that adds to the charm of watching this movie. Tippi Hedren is perfect as the spoiled rich girl and Rod Taylor is pretty darn good too. It's well shot and even though the plot is absurd, Hitchcock manages to make it feel like it's real. The ending is one of the best in horror.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "Great movie that has aged well. Hitch is still better than most of our modern directors.",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "i always run away from birds now",
            "review_date": "2014-07-21",
            "source": "rt"
        },
        {
            "content": "This is one of the great Alfred Hitchcock's",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "Probably my favorite Hitchcock movie.",
            "review_date": "2014-07-11",
            "source": "rt"
        },
        {
            "content": "Awkward and escalating development of characters relationship overshadow the bigger and darker theme of the birds. Some studio shots look artificial and goofy. Intriguing, nonetheless.",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "It's alright, with a good direction and concept. The Birds fails at having good performances and an answer to why the birds attack everyone.",
            "review_date": "2014-07-04",
            "source": "rt"
        },
        {
            "content": "Asides from some uneven acting, and an unbelievable amount of plotholes, as well as a frustrating conclusion (or rather the lack of one), The Birds can be appreciated as an outdated thriller with neat special effects and engulfing suspense.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "This film is so bad, it doesn't even deserve a review.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "One of the best nature horror film",
            "review_date": "2014-06-22",
            "source": "rt"
        },
        {
            "content": "Yes, in a way Hitchcock's \"The Birds\" isn't greatly structured in its plot, but it does not seem as if that was Hitchcock's intention for this movie. One of Hitchcock's greatest achievements in this movie and, in fact all time is that he was able to depict the common bird, seen by the average person on a day to day basis as a harmful and pesty animal as a jaw-droppingly fearful subject. Unlike, \"Psycho\" or \"Vertigo\", \"the Birds\" wasn't building up to a suspenseful and unpredictable conclusion, it was simply changing the philosophy of the nature of birds. It sounds so ridiculous, that Hitchcock could make such a harmful animal the central and commanding fear of his movie, but he was able to pull it off in such great fashion that it was almost satirical.",
            "review_date": "2014-06-10",
            "source": "rt"
        },
        {
            "content": "The Birds is a successful suspense-filled movie due to a number of things. Firstly, the parts are well played. Tippi Hedren isn't just your typical \"blonde haired romantic victim\" but actually builds characters as she moves through the well written narrative. Rod Taylor also creates a character who grows on you as the film goes on. The script works well and does not rush things. The advantage of this type of story is the unpredictable conclusion to the problem. Without going into the extremes of the military, explosions and so on, how exactly do you save a small town being over run with millions of birds? It's not a scenario which happens, thus making you actually wonder to yourself how they will overcome it. The ending may not please some people, but I feel it is the best way to end a story like this.\nThe biggest worry I had going into an early 60's film about killer birds is how effective they would actually look on screen. Surprisingly, the Birds pull it off extremely well and shows why it was nominated at the Oscars for Visual Effects. Whilst there is the odd shot of a bad looking bird here and there, the majority of shots are pulled off really well. Birds are unpredictable creatures so I was especially amazed at the scene involving a good hundred crows waiting patiently on a climbing frame. \nI can understand why a modern audience may find it dated but if you going into it with an open mind and a reminder of the year it was made in, then you will surely come to enjoy the best Hitchcock can provide.",
            "review_date": "2014-06-07",
            "source": "rt"
        },
        {
            "content": "Very good. 7.7/10. B+. Worth seeing at the theatre.\n\nThe Birds is greatly written, very well directed, enjoyable, has great characters, and successfully makes birds menacing, but has a very unsatisfying ending.",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "The only thing that bothered me about this movie was the ending.",
            "review_date": "2014-06-01",
            "source": "rt"
        },
        {
            "content": "The birds stills holds up as one of the best horror films and one of the best Hitchcock's movies. The suspense is great,the characters are smart which is rare in horror films, the bird effects which i was afraid that they won't hold up still look good, and i like there is no soundtrack at all which makes it more creepy. the only nitpick i can say about is some of the screen projection can be dated but, that doesn't hurt the movie for me. This is a must see for both horror fans and Hitchcock fans.",
            "review_date": "2014-05-09",
            "source": "rt"
        },
        {
            "content": "\"The Birds\" is one of the most shocking and terrifying movies ever made. The movie does keep you on the edge of your seat, and wonder if the birds will attack and kill people. Tippi Hendren and the rest of the cast were wonderful. The lack of music of Bernard Herrmann works extremely well, which makes it more effective. The special effects of the birds were fantastic. This is also one of Alfred Hitchcock's greatest films that he has ever made. Check it out!",
            "review_date": "2014-05-09",
            "source": "rt"
        },
        {
            "content": "Alfred Hitchcock's first horror movie sense Psycho, my thoughts? Overrated but enjoyable.",
            "review_date": "2014-04-29",
            "source": "rt"
        },
        {
            "content": "Incredibly uneventful for the first 50 minutes. Wow talk about milking it. Thankfully it picks up and becomes a solid horror film",
            "review_date": "2014-04-28",
            "source": "rt"
        },
        {
            "content": "My most hated Hitchcock film!",
            "review_date": "2014-04-28",
            "source": "rt"
        },
        {
            "content": "A star off because, let's face it, birds aren't that scary ; )",
            "review_date": "2014-04-22",
            "source": "rt"
        },
        {
            "content": "Birds as villains? Simply genius! Good acting by Tippi Hedren, too.",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "NOS DESTRUIRÁN A TODOS!!!!",
            "review_date": "2014-04-04",
            "source": "rt"
        },
        {
            "content": "Though the initial setup is less intriguing than previous films, Hitchcock still weaves a spooky and suspenseful thriller with The Birds.",
            "review_date": "2014-03-28",
            "source": "rt"
        },
        {
            "content": "The unbridled terror reflected in their eyes and actions was so real it was almost unbearable to watch!",
            "review_date": "2014-03-27",
            "source": "rt"
        },
        {
            "content": "Alfred Hitchcock puts on a great show here, but the real anomaly is how he turned an animal so benign as a bird into a fierce villain that can kill a person at any second. the man has a talent.",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "While not Hitchcock's best effort, it is one of his most remembered.  The reason for that is that there are exquisitely memorable and chilling moments, like the attacks on the schoolchildren.  Surprisingly, I found that the most effective moments came not from the bird attacks, but from the moments where the avians just sat there ominously as the humans try to get away from them quietly and slowly.  Moments like the crows slowly congregating on the playground, or Mitch having to slowly walk through a grouping of Birds outside the house to move the car are so creepy and wonderful, that the really dated bird attack effects just can't compete with them.  Enjoyable Hitchcock picture, not his best by my standards, but a classic nonetheless.",
            "review_date": "2014-03-25",
            "source": "rt"
        },
        {
            "content": "This may be the only Hitchcock film I've seen so far that seems quite dated. It's still a good movie with lots of suspense and great atmosphere but birds attacking people? I guess there have been better ideas.",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "Hitchcock legjobb horrofilmje, véleményem szerint a Psycho-t is felülszárnyalja. A film els? fél órája csendes és nyugodt, a közepén azonban beindul az igazi Hitchcock-os horror. Tippi Hedren óriásit alakít, ahogy Rod Taylor is.",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "The lesson learnt in horror - \"The build-up is vital\". Alfred Hitchcock's enthusiasm for horror flourishes once again with an outstanding performance from Rod Taylor.",
            "review_date": "2014-03-14",
            "source": "rt"
        },
        {
            "content": "Un poco rara la trama...",
            "review_date": "2014-03-11",
            "source": "rt"
        },
        {
            "content": "\"A-well-a, everybody's heard about the bird, b-b-b-bird, bird, bird, bird is the word!\" Man, these birds are bad enough, so one can only imagine what chaos would befall society if the bees got in on this killing spree, John Burroughs. Seriously, I've heard of California going to the birds, but this is ridiculous. I can torture you all with this nonsense all night, but in all seriousness, there are so many trite things involving birds that I can't believe this seemingly uncreative title wasn't taken, like, a couple hundred times before and after this film. Well, I can understand why no one wanted to try and evoke thoughts of a film this big by naming his or her film \"The Birds\", and even why no one made a film before this one that was titled \"The Birds\", because this film actually came out a couple months before \"Surfin' Bird\", and it doesn't get any older than that. I joke, but this was Alfred Hitchcock's last huge hit, insinuating that he had time to make huge hits prior, and that would be great if this film was by any means \"soaring\" (Ha-ha-ha-caw!), being an unreasonably two hours reasonably well-spent, but not especially smoothly.\r\n\r\nThe film is plenty well-developed, with its characters, and its settings, and even its themes, but not with, of all things, it's conflict, for although I can understand the ambiguity behind the birds' mania, and although they attempt explanations way late into the body of the film, it's hard to get all that invested in a conflict so underdeveloped. Well, the conflict at least seems underdeveloped, compared to the other aspects of this narrative, whose build-up segment runs for way, way too long, until it begins to feel aimless, just as the relatively tighter body gets to be draggy itself. Running two hours in length, the film is simply too long, and that's perhaps my biggest problem with it, as the film is all too often all too meandering to be all that engaging, and would be more compelling during its lulls in conflict if it was more genuine. The script is decent, but it holds problems extending beyond the uneven pacing, particularly within its dramatics, as the personal character conflicts feel a touch too Hollywood in their being histrionic, and working to manufacture some depth to a story of limited weight. Alas, screenwriter Evan Hunter can't quite overshadow the limitations in depth within this Hollywood thriller, which are all but overpowered by inspiration to storytelling, sure, but don't do a whole lot at all, much less anything all that uniquely. The film wasn't especially refreshing even for its time, no matter, how much it tried, at least at times, when it wasn't getting too lazy, if not overblown with its exposition and conflicts to truly reward. The film is kind of underwhelming, but it's not as underwhelming as I feared it might be, being bland in more than a few areas, but effective enough in others to impress just fine, particularly on a technical level.\r\n\r\nThe bird effects have, of course, become rather dated over the years, even with often their being presented in a frantic fashion that is ostensibly intended to give you only so much time to see the seams, yet they hold up just fine, and when their sheer business go accompanied by unique and disturbing sound effects, a sense of pandemonium is sold, and augmented by the staging of the action sequence. As you can imagine, it's a long while before tensions begin to rise, but when they do, the technical value, alone, however dated, thrills, viscerally and as a reinforcement of a sense of consequence to substance. As for the substance, I won't so much so that it's lacking, as much as I would say that it is, in fact, kind of overblown, being dragged out and histrionic, as well as formulaic, although that isn't to say that there isn't still something limited to the weight of this drama, and yet, with that said, the story concept, even for the time, is not as silly as it could have been, holding a chillingly believable primary conflict, behind interesting themes regarding natural tragedies, and even the depths of humanity in times of terror. The more human side of the film is really sold by the performances, which aren't graced with all that much material, but surprisingly stand out when the plot begin to thicken, with most everyone nailing a sense of sheer emotional distraught and human anguish that, when backed by layered chemistry, sell the many conflicts seen in a terrorized community with a convincing intensity that may have been beyond the time, at least in Hollywood affairs. Again, the dramatics get a little too Hollywood histrionic, but in plenty of areas, this film was gutsy enough to transcend traditional, watered down Hollywoodisms, and such audacity still rings true today in its graphic emphasis on disaster and human flaws, sold by the solid performances, both on the screen and off. What truly defines the effectiveness of this film is, of course, Alfred Hitchcock, whose directorial skills are limited by a questionable script, but are inspired enough to play an instrumental role in getting the film as far as it goes, playing up quietness just right to prevent dullness and establish genuine suspense, while placing a harsh attention to violence and claustrophobia in order to really drive the intensity that in turn drives this thriller, at least at times. The film takes much too long to pick up, and it ultimately fails to reward on the whole, but there are plenty of moments that really are more audacious and effective than one might fear, and in between them is a film that entertains enough to join the thrilling highlights in establishing a very decent, if a touch overblown Hollywood thriller.\r\n\r\nWhen the flock has cleared the air, little development to the ultimate conflict and too much development to an overdrawn build-up segment, with the help of some Hollywood melodrama, conventions and narrative thinness, wear the film down until it slips into underwhelmingness, but not so deeply that strong effects and action, interesting thematic depth, strong acting and effective direction aren't able to drive Alfred Hitchcock's \"The Birds\" close enough to a rewarding point to intrigue adequately as a flawed, but classic portrait on extreme natural disaster.\r\n\r\n2.75/5 - Decent",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "Suzanne Pleshette is one of my all-time favorites.  She left us too soon.",
            "review_date": "2014-03-02",
            "source": "rt"
        },
        {
            "content": "A movie that for its time had the best or one of the best special effects ever. Today the \"cheap\" tricks still scare people to this day and the movie overall is still solid as ever.",
            "review_date": "2014-02-26",
            "source": "rt"
        },
        {
            "content": "Even though it was exaggerated through its reputation, it shows how skillful Hitchcock was when making a suspenseful tale at such scale with some moments of ridiculousness, short thrills and little shocks when watching the nice, but creepy visual effects of the titular subject. (B)\n\n(Full review coming soon)",
            "review_date": "2014-02-25",
            "source": "rt"
        },
        {
            "content": "Not among Hitchcock's best, but a well made monster film with highly impressive effects and strong suspense. Weakened by poor plotting and a poor ending.",
            "review_date": "2014-02-22",
            "source": "rt"
        },
        {
            "content": "No siempre es necesario ser fiel al material original, lo que vale es mantener la esencia tratando de dar algo mucho mejor que la fuente en la que se basa, y con The Birds, Alfred Hitchcock demostró que si se puede.",
            "review_date": "2014-02-17",
            "source": "rt"
        },
        {
            "content": "The Birds is not powerful as much as Hitchcock's previous films but it affects the audience in a mysterious way regarding their relationship with birds. I think the first 30 minutes of the film, which are usually before the main events of the film, are not thrilling as in Psycho but much better than Notorious, but however the rest remains weak.",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "Okay movie, nothing special and definitely NOT scary! Watched it on the plane to Turkey.",
            "review_date": "2014-01-28",
            "source": "rt"
        },
        {
            "content": "Because the Birds is 50 years old, it isn't scary. Most of the time I can admire something even if it is out dated but the whole point of this movie is the horror. A story is supposed to be like a maze. A viewer enters a story to get lost in the maze knowing that there will eventually be an outlet. In other words we enjoy not knowing what is happening but we want to be able to figure it out. The birds offers no explanation to its main issue. This frustrated me a lot because the stuff in between was often boring and not very suspenseful. This is probably my least favorite Hitchcock movie (that I have seen), Nd I am incredibly disappointed in it.",
            "review_date": "2014-01-28",
            "source": "rt"
        },
        {
            "content": "Simple and strange, Hitchcock scared us with the fear of birds. It is still a masterpiece and is quite frightening.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "Despite it's ludicrous concept, it still manages to be quite eerie and builds tension well, at times - it's just a pity that it takes a while to get going and is probably 20min too long. Still, it's a testament to Hitchcock that he can make even seagulls look scary, what with the score & decent CGI. Worth a watch.",
            "review_date": "2014-01-20",
            "source": "rt"
        },
        {
            "content": "Sometimes slow, but still a classic.",
            "review_date": "2014-01-09",
            "source": "rt"
        },
        {
            "content": "Classic Fears / I shake a little at the sight of seagulls.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "Los pájaros parece ser que son dos películas que se enlazan entre si; esto no era nuevo para Alfred, ya que en Psicósis pasa lo mismo. Pero de alguna manera el primer acto del filme es algo complicado de ver; la falta de música no le ayuda en nada, y realmente no cautiva mucho. Durante todo el desarrollo romántico entre Melanie y Mitch hay toques sutiles del inminente ataque de los pájaros, y justamente cuando este llega se vuelve otro filme. Esta vez la falta de música genera tensión y tiene grandes escenas, de entre todas mi favorita es quizás el diálogo que tienen en el restaurante; un gran manejo de humor, datos sobre los pájaros, tensión y miedo aparecen en esta escena y lo que le sigue es fantástico. Si bien la primera parte es una prueba de fuego para los que vean este filme, para el segundo acto todo se compensa y sigue siendo cautivante y divertido de ver, a sus ya 50 años de existencia.",
            "review_date": "2013-12-26",
            "source": "rt"
        },
        {
            "content": "Considered to be a classic Hitchcock film, this one is as always with the master very well directed, tensed, well acted and beautifully shot. I really enjoyed the vibe of the film.",
            "review_date": "2013-12-26",
            "source": "rt"
        },
        {
            "content": "Everyone watches Hitchcock on Christmas, right? Right?!? Ending was a little flat, though.",
            "review_date": "2013-12-25",
            "source": "rt"
        },
        {
            "content": "Love it, love it, love it!",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "Very entertaining automatic Hitchcock classic, among the others.",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "One Of The Best Alfred Hitchcock Films Of All Time! It Good In Pretty Much All Aspects. My Favorite Scene Was The Gas Station Scene Quite Awesome.",
            "review_date": "2013-12-21",
            "source": "rt"
        },
        {
            "content": "If a movie was made today about killer birds attacking a community due to two love birds being in a cage it would be laughed at.\n\nIts Hitchcock...simple.",
            "review_date": "2013-12-17",
            "source": "rt"
        },
        {
            "content": "When I saw The Birds, I was a bit confused. Yes its Horror story, its directing by Alfred Hitchcock and theres a tone of Suspense moments that gets incredibly boring at times. Actually, the first act of the film is nothing but a love triangle. Thats a bit odd because isn't    The Birds supposed to be a horror story and NOT a romantic story. Thats a bit off topic. After sitting though an hour and fifteen minutes of a pointless romantic story, we then cut to a group of seagulls attacking various areas of San Francisco though the rest of the movie. The Seagulls attacking really get my attention when they appear on screen. They fell like they're going to kill you instantly when you run around or doing something crazy. That I give credit to for this movie. Another credit I give for this flick is the cinematography . Every angle shown on the screen is a job well done for the cinematographers. What I don't really give credit for this movie is the ending. I really HATE it. No dialogue, no reaction, just driving away from the birds and thats it. Another flaw I have is not explaining where the birds came from. I didn't really get it until a friend of mine told me why. The reason why is because its a scientific reason. Thanks movie for not giving much details on that. The Birds is an okay horror film. Not considered the greatest horror film of all time, but worth to watch around Halloween time.",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "The first act is slow and adds little to the overall plot, but once the birds start attacking, the film takes a turn into excitement and horror. While very little gets explained and things go by slow, it all has a certain suspense to it that Hitchcock could only conceive. It's one to check out.",
            "review_date": "2013-12-08",
            "source": "rt"
        },
        {
            "content": "I had a neighbor who, after watching this film, has to this day aviaphobia.",
            "review_date": "2013-12-05",
            "source": "rt"
        },
        {
            "content": "Though not as good as Psycho, The Birds still has an eerie feel and suspensful atmosphere.",
            "review_date": "2013-12-01",
            "source": "rt"
        },
        {
            "content": "Not bad, loved the cast and the setting of course, but between this movie and Psycho I won't be showering or going to the beach again without looking over my shoulder.",
            "review_date": "2013-11-29",
            "source": "rt"
        },
        {
            "content": "I don't think I want to walk out side anymore.",
            "review_date": "2013-11-29",
            "source": "rt"
        },
        {
            "content": "(Upcoming Review)  Rating:  8.8/10  Overview:  Terrific directing, theatrical acting, strange but effective special effects, not only is it one of Hitchcock's greatest masterpieces, it is also a landmark film that is truly a terrifying work of art and achievement.",
            "review_date": "2013-11-24",
            "source": "rt"
        },
        {
            "content": "The Birds reminds us of one very important life tenet: birds are creepy. Based on the fantastic Daphne du Maurier's short novel, The Birds takes a common human phobia and showcases it on such a grand scale that even bird aficionados will be scared. This is no easy feat, given how long ago the film was made - but like almost all of Hitchcock's films, The Birds doesn't feel dated. The premise, while simply silly-sounding (what if killer birds flocked en masse onto unsuspecting humans?) still works for today's audiences. In fact, if it was made today this film could have been a Birdnado B-grade production.  But this is Hitchcock, and this is arguably his most realistic and tense film.\nAnyone who's been chased by an angry bird during mating season and pecked on the head and arms knows that birds, when defensive and angry, can be objects of immediate terror. One bird can cause a human a bit of physical damage; a horde of them determined to rip flesh from your body can cause death. And that's what the birds are intent on doing in this film: killing every human being in sight. This intention is played out slowly at first: a few of the main and peripheral characters (all of which are fine, but take second place to the birds) notice there's a few more birds around than usual. Later, in a children's playground, main character Melanie observes as a hundred or so crows systematically flock to a swing-set nearby in one of the film's more famous scenes (even satirized in modern sketch comedy shows), and this is the point where you know it's Game On.\nThe film lands in familiar territory, with many of the surviving main characters ending up holed up in a house for safety (in a turn which slightly reminded me of Night of The Living Dead). It doesn't feel ridiculous, watching the terrified humans inside board up the windows; without CGI, Hitchcock has visually conveyed without question how terrifying a bird attack is. These birds are so determined that we know they'll force their way in somehow and pick off humans one by one; we don't know until the end whether there will be any survivors. \nAnother specially impressive aspect is that, like du Maurier's short novel, it's never expressed why the birds have suddenly turned on mankind, or how they are able to coordinate their attacks. This lack of information is impressive because we don't even want to know why the birds are doing what they're doing. The only important thing is they're doing it. There's no sappy message such as \"This is what happens to humans when you keep birds in cages!\" or anything similar. It's just all-out war without any discernible reason. If the film had been poorly handled, questions might justifiably arise from the viewer: but this isn't the Lost finale. We don't need questions answered because we have none. We're just flabbergasted and trying to cope with the present. And not knowing the intent of the birds in this universe just makes it all the creepier. \nMy only minor complaint is the abrupt ending. It's not an uncommon technique in film: the unresolved ending that just cuts to black. It's a technique employed to leave the audience feeling breathless, but in The Birds it feels like someone's given you an edited copy with the ending missing. However, we shouldn't blame Hitchcock: he wanted a different ending, apparently, but the budget wouldn't allow it. \nThe ending is just a minor part of the spectacle, thankfully, failing to eclipse how tense the film really is.",
            "review_date": "2013-11-20",
            "source": "rt"
        },
        {
            "content": "\"The Birds\" is...awesome-tacular. It has great acting, a great script and campy special effects. It's kinda silly though.",
            "review_date": "2013-11-12",
            "source": "rt"
        },
        {
            "content": "Best Horror Movie Ever",
            "review_date": "2013-11-07",
            "source": "rt"
        },
        {
            "content": "Was a great movie.  I really enjoyed it and the birds had me nervous.  Parts are kind of funny with the birds, however; if you get lost in the movie, it is crazy.",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "Le pondria mas , pero no explican nada y no solucionan nada...",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "Maybe an exhausting ride for today's standars, but Hitchcock picturing how little social precepts endures facing the unkwown right next to us transforms the sizing of life as a terryfing idea.",
            "review_date": "2013-10-27",
            "source": "rt"
        },
        {
            "content": "I don't look at the birds the same way again",
            "review_date": "2013-10-26",
            "source": "rt"
        },
        {
            "content": "I Like Alfred Hitchcock.",
            "review_date": "2013-10-25",
            "source": "rt"
        },
        {
            "content": "http://www.clevelandmovieblog.com/2013/10/31-days-of-halloween-2013-birds-october.html",
            "review_date": "2013-10-22",
            "source": "rt"
        },
        {
            "content": "The birds relies more on suspense rather then shock. Also the movie having no musical score makes the movie even scarier.",
            "review_date": "2013-10-06",
            "source": "rt"
        },
        {
            "content": "Awesome...watching right now!",
            "review_date": "2013-10-06",
            "source": "rt"
        },
        {
            "content": "Movies that are fiction  but could be a reality have me freaked. Just like that movie Willard the rat king.",
            "review_date": "2013-10-04",
            "source": "rt"
        },
        {
            "content": "More of a dramatic thriller than a major suspense ride on Hitchcock's part.\nVery original and very compelling.\nGreat performances by Tippi Hedren and Jessica Tandy.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "In an isolated California town, birds mysteriously begin attacking people.\nIt's often said that a Hitchcock film has two plots: in the beginning there is an innocuous plot, but then something unexpected happens that overtakes the film.  For example, Psycho is about a woman stealing money from her employer until Norman Bates appears thirty minutes later.  Notorious is about a love story between Cary Grant and Ingrid Bergman until it becomes a spy flick about thirty minutes later.  The Birds follows this formula, but the problem is that the initial story is so damn boring.  The love story between Mitch and Melanie gathers no steam, and the Breaking Bad credits have more chemistry than Rod Taylor and Tippi Hedren.  Once the birds start pecking away at people's eyes, I had already given up on caring about these characters.  \nAlso, the film refuses to answer why the birds go nuts, and while I don't think it's necessary that the film answer this question, the film's steadfast apathy for wherefores got overbearing when a character asked why for the fourth or fifth time.\nWhat I can say about the film is that Hitch's work changes the way people look at the world.  The Birds is not a strong film, but I did notice myself paying closer attention to birds as I drove to work.  It's irrational but also the mark of director who can affect his audience in mysterious ways.",
            "review_date": "2013-09-19",
            "source": "rt"
        },
        {
            "content": "It's a concept that Alfred Hitchcock never explained to us (why are the birds attacking), yet The Birds remains one of Hitchcock's scariest and most memorable movies to date.",
            "review_date": "2013-09-17",
            "source": "rt"
        },
        {
            "content": "The film is not closed smoothly, but rather unexpectedly, I admit. This is not so rare for Hitchcock (vide \"Topaz\"). Apart from that it's really good and in terms of visual vocabulary of horror it was ahead of it's time.",
            "review_date": "2013-09-16",
            "source": "rt"
        },
        {
            "content": "It failed to explain itself properly, leading up to then it was all fantastic.",
            "review_date": "2013-09-06",
            "source": "rt"
        },
        {
            "content": "Alfred Hitchcock is at it again, as he takes precious creatures known as birds and turns them into pure evil.  Who would've thought a bird would be such a vicious species?  This was a pretty good film and if you like anything by Hitchcock, you'll enjoy this picture.  What makes this film so great is that Hitchcock progresses the story slowly, but not too slow that it bores the audience.  What makes this film so frightening is that the birds (crows, seagulls etc) just don't attack adults, but children as well. . . even while at school where a child should feel safe.  Not so much in this film.  A great flick that I watched in HD on Turner Classic Movies.",
            "review_date": "2013-09-02",
            "source": "rt"
        },
        {
            "content": "The subplots have always seemed a little excessive at times with Hitchcock. But the build up is what made him the master of suspense. The special effects would disappoint the modern viewer. But the Birds are villainous.",
            "review_date": "2013-09-02",
            "source": "rt"
        },
        {
            "content": "Solid no doubt. I really didn't love this one as much as most did, but maybe I should give it another try. I don't really know why, but I just wasn't really satisfied with this one",
            "review_date": "2013-09-01",
            "source": "rt"
        },
        {
            "content": "I just re watched The Birds for the 50th anniversary as of today. It's still a great movie & I think it still holds up today. I love the trick shots for the attack scenes. CGI eat your heart out!!! I do have one question though, was this movie ever shown in 3D? I think that would be the only thing that would make the movie better. thank you Mr. Hitchcock!",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "A terrifying and slow suspense-inducing horror film that fails to surpass the director's horror classic, Psycho.",
            "review_date": "2013-08-28",
            "source": "rt"
        },
        {
            "content": "\"The Birds\" es una obra maestra en control de tono. Alfred Hitchcock se toma su tiempo desarrollando a sus personajes y envolviéndolos sutílmente con una amenaza inexplicable. \nMelanie Daniels es la hija de un empresario que sigue a un hombre que visita a su madre y hermana a una pequeña comunidad cuando es atacada por una gaviota. Súbitamente existen diversos ataques sin razón aparente. \nLas actuaciones son brillantes y aunque los efectos especiales se noten un poco anticuados, esta sigue siendo una cinta de enorme poder. Muy recomendable.",
            "review_date": "2013-08-27",
            "source": "rt"
        },
        {
            "content": "There are countless horror films trying to imitate \"The Birds\" and even with todays special effects and gruesome concept-design nothing can trump this raw cinematic masterpiece.",
            "review_date": "2013-08-26",
            "source": "rt"
        },
        {
            "content": "Well made but slightly dated in places. Still good though.",
            "review_date": "2013-08-23",
            "source": "rt"
        },
        {
            "content": "inquietante..senza un perchè, senza sangue né assassini..madonna quanti zompi..e nn c'è nemmeno il lieto fine..ma un capolavoro!!..",
            "review_date": "2013-08-19",
            "source": "rt"
        },
        {
            "content": "Before \"Jaws\" was \"The Birds\", the most frightening Hitchcock film, as well as the most complex and complicated. The human drama is so well depicted, the revenge by nature make the audiences feel guilty of their pleasures when the angry flocks of birds attack people apparently innocent. The most dignified human being is shaken until the tragedy can be felt, that's the greatness and most thrilling aspect of the film.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "Scary and Frightening, but I like it.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "Loved the directing of course. However, the story was slow and didn't have any explanation as to why birds started attacking everyone.",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "Superbly crafted classic.",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "Clearly an unforgettable film.  Though my lovely wife disagrees, I think of this as science fiction for the same reason that M. Night Shyamalan's film Signs is science fiction -- a horrible and implausible event, seen unflinchingly through the eyes of a single family.  (Anyway, she can get her own RT account and her own list.)",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "That's not for anyone to be able to turn birds into horrific monsters, and that Hitchcock done that, all right. But it's not a classic. This is not scary anymore, that's not a particularly extraordinary cinematic job, and nowadays that doesn't work anymore. Something happened, we don't know what, and it was scary once, but not anymore.",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "Iconic as this classic may be I simply can't get over the sheer stupidity of the humans in this movie and the ending always leaves me unsatisfied.",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "Not the best of Hitchcock but still pretty freaky.",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "Very good movie for it's time especially...but I was not a fan of the ending at all",
            "review_date": "2013-07-31",
            "source": "rt"
        },
        {
            "content": "Simplistically terrifying in it's concept and execution, this remains one of Hitchcock's grimmest films.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "It's very difficult in the beginning, because for one hour, nothing happens, and the birds are the subplot. I expected something else, I guess, and I am to blame. But as soon as the eponymous and mysterious villains reach the foreground, they do their prominence justice, by being utterly terrifying and engendering a string of well-directed and executed kinetic and relentless action. Basically, it's rather tedious for a half, and suddenly it's turned to 11. Very well-done for the time, and surprisingly sophisticated for what is advertised as a mere cheap thrill, this is worth its acclaim, though seriously, you can skip some chapters in the first half.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "I have great respect for Alfred Hitchcock, and North by Northwest was one of my favorite movies growing up. However, he does have a tendency to make suspenseful scenes feel drawn-out and exhausting. The Birds is a prime example of this. It is supposed to be one of the original horror films, but I can't imagine a universe in which this movie was actually scary. Through the whole thing, I was either mildly bemused or legitimately angry at Hitchcock for not paying more attention to his film's logic.\r\n\r\nI'm not one to discount the effect of classic films just because they haven't aged well, but BOY has The Birds not aged well. And I'm not talking about the special effects-- this movie seems to have been made for a far less demanding audience than the ones today. It might be a classic, but there are gaping holes in logic that actually prevented me from enjoying the film.\r\n\r\nThe film follows Tippi Hedren as Melanie, a spoiled rich woman who follows a man from San Francisco to Bodega Bay just to give him a couple of lovebirds for his sister's birthday. In other words, she is a stalker. As the two of them have their little love affair, we begin to suspect that something is up-- birds are acting weird, flying into windows, and attacking children's parties. Finally, all hell breaks loose and the birds start dive-bombing people, pecking out their eyes, and inadvertently blowing up gas stations.\r\n\r\nNowadays, if this film was made, it would be made in the spirit of Sharknado. So I have to give Hitchcock credit for making a serious effort to make birds legitimately terrifying. However, just trying to make them scary is apparently not enough. I now understand why people have to scream so much in horror movies-- when Melanie is attacked by birds at one point, all she does is make little gasping noises. That just tells me that she's not particularly frightened, she's just a little annoyed. And it translates into the audience's fear as well. I didn't feel scared through the entire movie.\r\n\r\nAlso, the birds attack people in waves, but character are able to walk right past them in between attacks. Why? When Hitchcock was asked this in an interview, he said he didn't know. Sure, you can write it off by saying \"It's just a movie,\" but I refuse to give anything such an easy pass. The logic of it just didn't end up panning out. However, I'm glad the birds found time to attack Sebastopol-- that place is a shithole. \r\n\r\nIt's implied that the birds are attacking because of the two lovebirds that were brought to Bodega Bay all caged up and 'wrongfully imprisoned' or whatever, but why would these two birds be the tipping point? Wouldn't they have started attacking us a long time ago for eating chicken or slaughtering them with windmills? And why isn't this resolved at the end? They drive off into the night, and... that's it. It's a disappointing finale.\r\n\r\nBut really, you can't measure The Birds by how well it's held up. Sure, the special effects are atrocious, and it is kind of distracting, but the imagery is still great. Just as Jaws made an entire generation afraid to go in the water, The Birds made the previous generation afraid of a bunch of fucking crows sitting on a telephone wire. And you have to give some credit to that. If you can make seagulls scary, you can make anything scary.\r\n\r\nFinal Score for The Birds: 6/10 stars. I only go this easy on it because it's a classic that legitimately changed people's day-to-day life by making them afraid to feed pigeons. By the way, the perfect follow-up to watching this movie is Birdemic: Shock and Terror, the epic rip-off of The Birds that inexplicably has even worse special effects, despite being made in 2009. So rejoice that movies like this were made, and that modern horror films aren't the only option that audiences looking for a scare have. I can't imagine what Hitchcock would say about what the horror genre has become nowadays, but he'd probably shit his pants.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "I was not engaged as much in this film than in other Hitchcock films (Vertigo, Psycho). May need a second watch.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "What I really like of this film is The End",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "How can you describe this film?",
            "review_date": "2013-07-26",
            "source": "rt"
        },
        {
            "content": "I will never look at a flock of birds sitting on a telephone wire quite the same way again...",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "Die Frage die sich mir stellte, als The Birds so vor mir auf der Leinwand schimmerte war folgende: Ist das Hitchcocks Ernst? Oder ein sehr elaborierter Scherz, denn nur ein Kenner von britischem Understatement so richtig genießen kann.\n\nThe Birds ist ein schizophrenes Wesen eines Films. Einerseits hat er den großartigen Build-Up eines Hitchcock-Films und handwerkliche Präzision auf höchster Stufe wie man sie vom Meister kennt, andererseits wohl ein paar der furchtbarsten darstellerischen Leistungen in Hitchcocks Karriere, einen (zu) starken Hauch an B-Movie Flair und 60er Jahre Special Effects die heutige Zuseher eher zum Lachen bringen, was dem Film ganz neue Zugangsmöglichkeiten eröffnet.\n\nGanz ehrlich, ich bin der Meinung, dass The Bird heutzutage eher halbernst perzipiert werden sollte. Nicht nur, dass wahrscheinlich auch Hitchcock selbst sehr angetan gewesen wäre von dieser Art der Publikumsreaktion, es gibt dem Film auch neue Qualitäten ganz einfach mal loszulachen, wenn sich in einem HITCHCOCK-Film Szenen wie in einem unterdurchschnittlichen Horrorfilm abspielen.\n\nSir Alfred war wieder einmal sehr experimentierfreudig was die Wahl seines Quellenmaterials anging, und wählte Daphne du Mauriers Geschichte unbegründeter Vogelangriffe auf eine nichtsahnende Bevölkerung.\nDas darin auch der typisch Hitchcockian Protagonist steckt, der Jedermann, der von bösen Mächten verfolgt wird, kann zwar kein Zufall sein, doch die Art und Weise wie Hitchcock vorgeht ist für seine Verhältnisse schon fast trashig.\n\nZwar ist seine Fähigkeit zur Suspensebildung bis heute ungeschlagen, und der Film dauert locker eine Stunde bis es so richtig ernst wird, bis dahin, und das ist Hitchcocks wahre Stärke, ist die Sache aber auch nie langweilig. Dann ergießt sich ein Stakkato aus Möwenschreien, schnellen Cuts und etwas Kunstblut über die Leinwand, und eine recht lächerliche Prämisse löst sich in ein Paar der spannendsten Szenen der Filmgeschichte auf.\n\nThe Birds spaltet die Kritiker. Die einen finden es zu trashig für Hitchcocks Verhältnisse und Ansprüche, die anderen sehen darin nur eine weitere Variation des Genius des großen Meisters.\nSo sehr ich die Einwände der ersten Gruppe auch verstehe - ich muss mich dann doch den Zweiteren anschließen. Mit Mut, technischer Neugier und einem Haufen Selbstironie kreiert Hitchcock einen Film, der zwar nicht fehlerlos ist, den Zuseher aber in den gleichen aufgeregten Zustand der Spannung versetzt wie seine besten Werke - auch heute noch - fünfzig Jahre später.",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "There has been a debate whether this was as good as \"Psycho\" but in my mind whilst not as good it's still a classic in its own right with the vintage tension he always brings to the table and flawlessly written",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "The reason I am still afraid of birds today! A must see for all, Hitchcock at his best!",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "I wanted to see more from the town drunk and the guy that goes to the bar before driving on the freeway.",
            "review_date": "2013-07-18",
            "source": "rt"
        },
        {
            "content": "I'm still scared when a bird swoops down...",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "An odd film as there are two stories going on, one which takes over the other. You are expecting a connection between the two, and it is hinted at when one person suggests that the problems with the birds started when the woman arrives, but it is never touched upon again, and as reports of similar attacks happen in other places, it can't be the case. So the story is flawed, or somewhat irrelevant. What is impressive is the \"bird action\". You wonder how, in the days before computer graphics, Hitchcock could have created such scenes. I'm sure that the first time I watched this, it was in black and white and I've now just seen a colour version. The colour seemed so strange, and in a lot of scenes not everything was \"coloured in\", it may just be my imagination but it seemed that way, which makes me wonder why they only bothered to do half a job.",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "\"I think you're evil. EVIL!\"\r\nNo, I don't think you're evil. I'm just quoting a line from the film I'm about to review: Alfred Hitchcock's classic horror flick, The Birds.\r\n\r\nThe Birds starts off as sort of a romantic comedy where the rich, spoiled brat Melanie Daniels (Tippi Hendren) heads down to the small town of Bodega Bay to stalk and prank lawyer Mitch Brenner (Rod Taylor), unaware that he had a former relationship with town schoolteacher Annie Hayworth (Suzanne Pleshette).\r\n\r\nWhen Melanie is attacked by a bird during a boat ride, the horror starts to kick in. Soon afterwards, birds start attacking children at the school, causing a gas station to explode, and even kill random people in the town. Melanie, Mitch, and his mother (Jessica Tandy) have to use quick thinking in order to escape.\r\n\r\nAlso, Veronica Cartwright plays Mitch's younger sister Cathy, Ethel Griffies plays Mrs. Brundy, a \"bird expert\", Alfred Hitchcock cameos as the man who exits the pet store, and Doreen Lang plays a crazy mom who describes Melanie as \"EVIL!\".\r\n\r\nThere's a giant reason why Hitchcock is called the Master of Suspense, and The Birds continues his dominating and deserving title. Using many trick shots, models, and some animation, Hitchcock creates these menacing birds well, and they still shock today. Even though there is no film score, which can wreck a film, such as the original Frankenstein, Hitchcock pulled the impossible by continuing to make a film like this suspenseful without a score. It's those bird sounds that make the film scary.\r\n\r\nThe cast is a decent bunch. Tippi Hendren is the biggest highlight in the film. For her film debut, you'd think she had done other films prior. Rod Taylor is also good in his role. I also liked Pleshette as the teacher.\r\n\r\nHowever, there are two actors that I didn't like in this, and that would be Jessica Tandy as the mom and Veronica Cartwright as the young girl. They can't act, and they come off as annoying, especially in the bird attack scenes. I was hoping that the birds would kill these two off, but sadly, that didn't happen.\r\n\r\nSome people have complained that Hitchcock was lazy in making this cause it was never explained why the birds would attack viciously. Hitchcock explained in an interview that he intended for the audience to figure that out on their own, seeing that this was a horror film, not a nature documentary. With that being said, I applaud Hitchcock for making us think about things like this in a film. This is another reason why Hitchcock is one of Hollywood's most talented directors ever.\r\n\r\nWhile not Hitchcock's greatest film, The Birds succeeds as a suspenseful horror film, making it a pretty good film, despite it's weak ending. Despite the not-so-good ending, I still recommend this film for anyone, with the exception of the weak hearts.",
            "review_date": "2013-06-25",
            "source": "rt"
        },
        {
            "content": "was scared of birds for a week when i saw this as a kid.",
            "review_date": "2013-06-21",
            "source": "rt"
        },
        {
            "content": "A good thriller, the scenes of avoiding the onslaught of birds within the house is great with the constant noise and not talking for several minutes. Then Rod steps out to get the car...   A joy to see the late Pleshette in a non-Disney role.  The actual ending seemed rather sudden and unfulfilling though.",
            "review_date": "2013-06-04",
            "source": "rt"
        },
        {
            "content": "A Hitchcock that is actually good. Amazing! Who would have thought.",
            "review_date": "2013-06-02",
            "source": "rt"
        },
        {
            "content": "Classic. It even made me afraid of birds for a few minutes. Just wish the ending was better, we didnt get much resolution. But Hitchcock is a genius.",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "A really loooonnnggggg build up, and then the movie ends.",
            "review_date": "2013-05-30",
            "source": "rt"
        },
        {
            "content": "I have loved Hitchcock movies for a long time. It's been years and years since I've seen \"The Birds\" so it felt very new to me. I didn't recall the story and flow of the movie being so unconventional, much like \"Psycho\". And that's a good thing. The flow is that of a windy road, not a straight away. You just sit back and relax and wait for whatever comes up around the next curve.\n\nHaving seen \"The Girl\" just a few weeks before gave me a different outlook on this movie. \"The Girl\" had some serious issues like the questionable underlying honesty of it, but this post is about \"The Birds\". \"\n\nThe Girl\" showed which scenes were filmed on location and which were green screen. So that was something I knew to look for. The flow from on location to green screen is really unsmooth in several places. I don't think if that was just because I was looking for it. This is surprising since Hitchcock was such a perfectionist, which is why so many of us love his movies. \n\nFor as rough as those transitions are, the special effects are amazing for the era. \n\nOverall this is a very satisfying movie to watch. The ending is rather wishy washy but it's hard to think of a better ending.",
            "review_date": "2013-05-29",
            "source": "rt"
        },
        {
            "content": "Shocking and intense, The Birds is not Alfred Hitchcock's best, but it's certainly another terrifying suspense story, revealing once again the genius of Alfred Hitchcock!",
            "review_date": "2013-05-24",
            "source": "rt"
        },
        {
            "content": "Melanie sitting outside the school. She is listening kids singing in the classroom. As they are singing, more and more crows are perching on the climbing frame behind Melanie ready to attack. The image of grotesque... That scene alone is enough to prove that Alfred Hitchcock is true and only Master of Suspense! At the end he leaves this movie in mystery as there is no conclusion. But why to spoil the perfect movie with an explanation?!",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "Amongst Hitchcooks' best films!",
            "review_date": "2013-05-12",
            "source": "rt"
        },
        {
            "content": "My favorite Hitchcock movie. A classic.",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "LOVE it. but def not a good idea to watch it before I went to bed last night plus all the bird flu outbreak in China recently... I am such an idiot. -___- Viva Hitchcock!!",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "Wow!  This was my 1st viewing and I was surprised by the effective intensity this 1963 film. The film starts slowly, but builds and builds the tension to an extremely high level, impressively all without a music score. The scenes of Jessica Tandy finding the dead farmer, Tippi Hedren waiting outside the school, the discussion in the cafe and the bird attack disaster outside the cafe are some the best cinematic sequences ever filmed.  Ever!!  The outlandish premise feels plausible in the hands of Hitchcock.  One of his best!",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "I sure wont think of a bird the same.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "Yes. The birds were evil. They terrified me with their evilness. But this cannot overshadow the fact that the movie has a pointless and illogical end to it. Leaving the climax, the whole movie was a good experience.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "My favorite Hitchcock movie besides psycho",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "When it drags, it really long. When it's on, it's on like Donkey Kong.",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "This movie has problems... you never figure out why the birds are attacking... and in the end, nothing is resolved. The movie ends as if they ran out of money to make an actual ending. Other than that... I guess it's a pretty good movie for what it is.",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Leave it up to Hitchcock to find the horror in something ordinary, but he did just that with THE BIRDS. This also happens to be the first Hitchcock film I ever saw. From what I can remember I thought it was fine, but nothing really spectacular. Now having seen it for the second time, with a lot more film-watching under my belt, I feel like I appreciate it more for what it is, what it meant to cinema going forward, and as a part of Hitchcock's oeuvre. Like all of Hitchcock's films, it takes a simple premise, in this case a socialite who follows a potential boyfriend to his family's small hometown, and while there birds start attacking. On the surface, and for most of the people in the audience, this is probably enough and Hitchcock would probably have agreed. However, there is more to the film than the innovative score and still-impressive visual effects. THE BIRDS also works as a metaphor for the (apparently) rising violence in modern society. Along the way, a few themes are recycled from previous efforts such as SABOTEUR and PSYCHO, but the film I feel is the closest kin would be SHADOW OF A DOUBT. In that film, you have menace coming to a small town in the form of a person, and everything turns out alright in the end. Here, we see menace come to a small town again, but something even more innocent on the surface and more pervasive; and, in a rather pessimistic turn, the ending is left ambiguous. I'm not sure if Hitchcock intended the film to be read this way, but in a world where people are afraid of getting shot when out at the theater or, in a more abstract sense, being the victims of terror attacks, THE BIRDS couldn't be more thematically relevant today, perhaps even more so than when it first came out. And really, that's the beauty of Hitchcock. He was able to tap into the human psyche and fear in a way that few others can (or could). From a technical perspective, the film perhaps doesn't hold up as well, but you can hardly hold that against it. Sure, the visual effects aren't as believable as some modern CGI, but they're still rather effective. Yes, Hitchcock's reliance on rear projection can be distracting at times, but that's a feature of his work I've begrudgingly come to accept. What isn't so forgivable is the downgrade in acting talent from his previous pictures. Tippi Hedren is serviceable as Melanie Daniels, and does get a nice character arc, but she's no Grace Kelly or Kim Novak. Rod Taylor (Mitch) is a handsome face, and not a whole lot more; and hopefully I never have to see the child actress who plays his sister Cathy in anything else. By contrast, Jessica Tandy did well in her supporting role as Mitch's mother. What was most impressive to me was the experimental score (supervised by Bernard Herrmann) that was used in lieu of traditional orchestration. Often, some of my favorite moments in other Hitchcock films have been ones with little to no music, and the effect here of having a mixture of simulated and real bird sounds was chilling at times. There was also more ominous moments, like the well-known sequence that shows a children's jungle gym completely overtaken by a murder of crows and, of course, a literal bird's eye view of an explosion that shows the birds moving in for the kill. Overall, I can comfortably say that I liked this film a lot more on second viewing and it definitely ranks up with Hitchcock's best.",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Maybe not his best film, but definitely his most intense. I was on the edge of my seat all the way through the 2nd half.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "Ok movie.. It would have been better if they had explained the reason of the bird attack !!!",
            "review_date": "2013-03-29",
            "source": "rt"
        },
        {
            "content": "San Francisco Socialite Melanie (Hedren) meets handsome young lawyer Mitch (Taylor) while visiting a bird store. He recognizes Melanie from one of her many court appearances and mocks her rebellious lifestyle, which she claims to have left behind, but Melanie is attracted to him nonetheless. As a prank, she purchases a pair of lovebirds and drives to the small coastal town of Bodega Bay, where Mitch spends weekends with his mother Lydia (Tandy) and young sister Cathy (Cartwright). Once there she is attacked by a gull while attempting to row away from Mitch, who persuades her to stick around for the weekend. Melanie books into a B&B run by Annie (Pleshette), a former lover of Mitch. As the weekend unfolds, the town is subjected to a series of increasingly violent bird attacks.\nFollowing the phenomenal success of 'Psycho', audiences were crowing (pardon the pun) for Hitchcock to provide more gruesome thrills. The master was equally eager to supply such thrills and found the ideal material in a 1952 short story from the pen of Daphne Du Maurier. Hitch had previously adapted Du Maurier for his American debut 'Rebecca' back in 1940. Many critics are of the opinion that the director's best period is book-ended by the Du Maurier films. (They're wrong of course. Hitch's best period began in London in the twenties and ended back in the same city in the seventies.)\nWhile 'Psycho' was generally slammed by critics at the time, audiences flocked (forgive me) to it. 'The Birds', however, would receive a luke-warm reaction from both, thanks in no small part to it's unrelentingly dark tone. Had the film been released later in the decade, following the King and Kennedy assassinations and America's increased involvement in Vietnam, I suspect audiences, and possibly critics, would have been much more receptive. In 1963, things were looking good for America and nobody wanted a killjoy like Hitch to ruin the mood of the nation. Some viewers were clearly paying attention though, as the film's influence can be seen in the work of the seventies' \"movie-brats\", particularly George A. Romero's 'Night of the Living Dead', Steven Spielberg's 'Jaws' and John Carpenter's 'The Fog'.\nThe film is indeed grim, arguably the darkest film to come out of mainstream American cinema up to that point. Despite the apocalyptic tone of the premise, much of the film's melancholy comes from the characters rather than the situation. As soon as we meet Annie, we immediately get the sense that she's doomed. The product of a failed romance with Mitch, she represents everything the ruthless Melanie is fighting against. The town of Bodega Bay seems almost like a retirement home for weak-willed women, with Mitch's mother Lydia struggling to find any enthusiasm for life since the death of her husband. With this pervading fog of despondency, Melanie sees an opportunity to become the alpha-female of this particular flock. \nWhile there's a battle between humans and birds, the film features another power-play; one fought between Melanie and Lydia. When Lydia breaks down after finding a corpse with its eyes pecked out, Hitch repeatedly cuts to Melanie as she observes this chance to assume command. Hedren's lips move just enough to suggest a wry smile of satisfaction. (Anyone who believes the myth that Hitch couldn't direct actors should view this scene and realize their folly.) With Lydia confined to bed, Melanie becomes the woman of the house, but her reign is short-lived. Early on, Mitch makes a jokey remark, \"back in your gilded cage Melanie Daniels\". It turns out to be quite prophetic as Melanie later finds herself trapped in a phone booth, a metaphorical cage, as the birds violently attack the town. By the film's end, Melanie is delirious. As Lydia, now back on her rightful perch, leads her out of the house, we see the same almost-smirk on Tandy's face.\nHitch does some of his best work here, filling the film with moments that have gone down in film lore. The scene where birds gradually appear on the bars of a school playground behind Melanie is a masterclass on the power of editing. The film's main attack features a cut to an aerial shot which we at first assume to be a bird's POV. Hitch twists our preconceptions by then having the birds fly in from the corner of this shot. It's a technique John Carpenter would employ brilliantly with the character of Michael Myers in his masterpiece 'Halloween'. Unusually for a Hitch movie, there's little in the way of humor on display but a shot of lovebirds leaning left and right as their car traverses a coast road is inspired.\nAdding to the bleak tone is the inspired decision to forego a traditional musical score. Bernard Herrmann oversaw the use of a pre-synthesizer instrument known as a \"Mixtur-Trautonium\", which created the chilling bird sound effects. The aforementioned playground scene is accompanied by the sound of schoolkids singing a children's tune. Now, of course, the use of ironically cheerful music to accompany a dark scene has become one of cinema's worst cliches but in 1963 it seemed completely original. (The earliest example of this technique I can think of is the use of \"I'm Forever Blowng Bubbles\" in William Wellman's 1931 'The Public Enemy').\nThe birds themselves are a combination of real birds and their animated cousins, the latter created by Disney technician Ub Iwerks. While some of the projection shots look crude today, at the time they were revolutionary. (Thanks to the brilliance of Hitch's technique, you'll forget within moments how simple the animation looks as you get wrapped up in the film's atmosphere). 'The Birds' features some of the best use of matte paintings, with much of Bodega Bay enhanced convincingly by the legendary matte-artist Albert Whitlock.\nThe irony of 'The Birds' is that, despite the 1963 audiences' struggle to embrace it, it's now one of Hitchcock's most accessible films for modern viewers. It's a film that was well ahead of its time and, like most of Hitch's films, hasn't dated a moment over the last fifty years. The director produced several masterpieces throughout his career; this was his final one.",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "Pretty good film about Birds coming to a small town and kill people. The story was good and it eventually gets the audience to care for these characters to survive the onslaught of the birds. The acting was spot on and not much problems on special effects. There are a few problems though and one them is the outdated special effects. Especially in the kids getting attacked from birds and it was rediculous but I was ok with it because of the times. The major problem that I did not like was the ending. I was expecting more of a battle between Daniels and the birds and escaping in a quick and timely fashioned manner. The ending found that the birds were weak and the family was lucky. Despite the problems, this film was pretty good and another of Hitchcock's masterpieces.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Just wish the ending had a bit more closure.",
            "review_date": "2013-03-18",
            "source": "rt"
        },
        {
            "content": "The Birds is a perfect movie to watch to appreciate Alfred Hitchcock.",
            "review_date": "2013-03-14",
            "source": "rt"
        },
        {
            "content": "Keep in mind, that while the special effects look laughable to the modern viewer, creating something of this scale with the limited technology of the '60s is quite a feat.  The movie itself did a good job of doing what many modern horror movies fail to--having an interesting plot independent of the scares.  The first half of the movie could pass off as a pretty good rom-com on its own, and had interesting characters with interesting back-stories. Great movie!",
            "review_date": "2013-03-12",
            "source": "rt"
        },
        {
            "content": "Suspensful, gripping and for the time shocking, these are just some of the many great qualities this movie holds. The Birds is simply a must see and one of Alfred Hitchcock's many masterpieces.",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "Well, I will never see birds the same way! Hitchcock made a wonderful, inventive and original suspense!",
            "review_date": "2013-03-05",
            "source": "rt"
        },
        {
            "content": "Great! Creepy and suspenseful. Better than modern horror movies 9 times out of 10.",
            "review_date": "2013-03-05",
            "source": "rt"
        },
        {
            "content": "I just love Tippi Hedren! The Birds is amazing, i don't care! When i first saw this it was an experience to behold, something so simple becomes so creepy and demented. The house scenes at the end where the birds start breaking in is pretty freakin scary. I don't know, this feeling cannot be recreated no matter how much CGI these days. I suggest everyone should watch The Birds especially if you're not expecting much it makes it all the more better.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "it's pretty much a night of the living dead ripp off, substituting zombies for birds.",
            "review_date": "2013-03-03",
            "source": "rt"
        }
    ]
}