{
  "title": "Adaptation.",
  "rating": 8.1,
  "release_date": "2002-12-06",
  "summary": "The lives of screenwriter Charlie Kaufman (Cage), author Susan Orlean (Streep) and orchid poacher John Laroche (Cooper) become strangely intertwined as each one's search for passion collides with the others' in this adaptation of the best-selling \"The Orchid Thief.\" [Columbia Pictures]",
  "critic_reviews": [
    "In a larger sense, Adaptation is a movie about the simple act of enjoying life -- of really embracing it -- without constantly worrying about what others think.",
    "Surely the most creative trick of the year and grimly funny throughout.",
    "Screenwriting this smart, inventive, passionate and rip-roaringly funny is a rare species. It's magic.",
    "It's typical of the nerve, the bravado, the sheer giddy playfulness and sense of fun that characterize what has to be the boldest and most imaginative studio film of the year.",
    "Kaufman strikes just the right balance between playfulness and sincerity, leaping freely from one absurd situation to another before pulling back on the reins.",
    "What a bewilderingly brilliant and entertaining movie this is.",
    "May not be the first movie to examine the creative process. But it's the most playfully brilliant.",
    "An inspired flight of fancy, an oddly poignant examination of the creative process, a rumination on adaptation (orchids to their environment, books to the screen and misfits like Charlie to life) and, in its ultimate irony, a story in which our hero learns a life-altering lesson.",
    "Like no movie before it, Adaptation risks everything -- its cool, its credibility, its very soul -- to expose the horror of making art for the business of entertainment.",
    "I realize that the fear of contracting writer's block from a fictional character is crazy, but in the brilliantly scrambled, self-consuming world of Adaptation it has a certain plausibility.",
    "The notion of meta has never been diddled more mega than in this giddy Möbius strip of a movie, a contrivance so whizzy and clever that even when it tangles at the end, murked like swampy southwestern Florida itself, the stumble has quotation marks around it.",
    "For three-fourths of its journey, Adaptation is, for my money, the movie of the year: an incredibly audacious and original exercise that challenges the conventions of moviemaking and stretches the boundaries of fiction -- almost, but not quite, to the breaking point.",
    "A highly enjoyable failure, a quandary that can't resolve itself.",
    "Adaptation is hardly profound, but it's one of the most soulful and loopily romantic movies I've seen all year.",
    "Spellbindingly original -- Like the wild orchid, Adaptation is a marvel of adaptation, entwined with its hothouse environment and yet stunningly unique.",
    "Adaptation's success in engaging the audience in the travails of creating a screenplay is extraordinary.",
    "All but stealing the film is Cooper, who seizes a rare opportunity as an extroverted, rather than buttoned-up, character to bust loose like an uncaged alligator.",
    "Probably the ultimate writers' film, but it's also a brash, daring, and dynamic film -- as delicate as an orchid but as durable and malleable as the species.",
    "Duelling roles are an actor's dream, and Cage takes full advantage. He and that face of his -- hang-dog homely one minute, vibrantly macho the next -- are perfectly cast. So is Streep as the sophisticated Manhattanite drawn into a steamy realm of Southern discomfort.",
    "The final result, shaped by the brilliantly nimble, pitch-perfect direction of Spike Jonze, and blessed by superb acting, is an extraordinarily clever comedy that falters only in the last 20 minutes.",
    "There's only one proper Hollywood ending to this story. Next year, Charlie and the surreal \"Donald\" Kaufman (listed as co-writers in the playful credits) should win twin Oscars for best adapted screenplay. They've earned it -- really.",
    "It's a testament to Cage's canny performance and Jonze's seamless use of special effects that you believe Charlie and Donald are two entirely different people.",
    "You have to experience the thing to understand its simultaneous recklessness and care, its humor and sadness in the name of failure, its playful but dismal take on formulaic Hollywood endings.",
    "One of the best movies Hollywood has ever made about itself, a extraordinary meta-narrative that continually questions its own ability to capture human experience, disappointment and uneventful loneliness. It's hilariously funny.",
    "The movie ends in a burst of violence that we are unprepared for and don't believe. Maybe it's the film's final joke.  It's a miscalculation -- though a calculated one -- but it does not erase one's fond memories of all the odd, deeply humorous behavior that preceded it.",
    "Infinitely impractical, consistently unique and vastly imaginative.",
    "Adaptation is sort of like the mythical Ourabouros mentioned in the screenplay -- the snake that eats its own tail -- or like a series of mirrors repeating their images to infinity.",
    "Wastes amusing beginnings.",
    "An occasionally maddening and sometimes brilliant motion picture that varies between being insightfully sharp and insufferably self-indulgent. Regardless of whether you appreciate the movie or not, it's likely to stay with you.",
    "Streep is perfect, as per usual, but the showy orchid role goes to Cage in an Oscar-worthy tour de force. He pours his body into Charlie's slumped frame of mind and creates a character churning with endearing contradictions -- the unforgettable nebbish.",
    "Snags on the fact that neither story depicted -- not Kaufman's and especially not Orlean's -- is enough to sustain more than an incidental interest.",
    "This is like a Ferris wheel--the ride's enjoyable but you've gone nowhere once it's over.",
    "I'm not turning cartwheels over Adaptation as energetically as my colleagues. Part of me -- and I'm thinking aloud here, I've likely been infected by Kaufman's comic self-consciousness, and also by his meta-comic impulse to draw attention to that self-consciousness, and probably also by his meta-meta-comic impulse to draw attention to drawing attention to his self-consciousness -- that -- that --",
    "Even at its best, Adaptation is one of the movie year's most esoteric outings -- more so than even Paul Thomas Anderson's far superior \"Punch-drunk Love.\" Too smart to ignore but a little too smugly superior to like, this could be a movie that ends up slapping its target audience in the face by shooting itself in the foot.",
    "At the end of the day, though, this is Charlie Kaufman's movie and I'm not sure he proves quite the visionary puppetmaster many in the media are making him out to be.",
    "The real joke is that the picture's most conventional elements, the superbly acted entanglement between the complicated Orlean and the boastful but unexpectedly thoughtful Laroche, would have made a compelling movie all by themselves -- if written by someone other than Charlie Kaufman.",
    "The most overrated movie of the year (of all time?) by people who should know better.",
    "Virtually everything that happens in Adaptation is almost juvenile showing off - daring to make a film that is in search of a script."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Self Indulgent? Yep. Pretentious? Of course. But the real miracle here is how the film can take all of these self-references and neuroses to create a story of characters with which the viewer can empathize and actors can let their talentSelf Indulgent? Yep. Pretentious? Of course. But the real miracle here is how the film can take all of these self-references and neuroses to create a story of characters with which the viewer can empathize and actors can let their talent shine (most notably Nicolas Cage in his dual role). And believe me, I would give this movie a lot less credit if the screenplay wasn't so damn good.",
      "review_date": "2010-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A work incredible philisophical scope and one of the best written films I have ever seen, Adaptation is a treatise on what it means to exist, to be alive, to love, and to create.",
      "review_date": "2017-02-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A few years ago, a screenwriter named Charlie Kaufman was given the job of adapting Susan Orlean's non-fiction book, \"The Orchid Thief,\" into a motion picture script. Although Kaufman found the principal character of the book, John Laroche,A few years ago, a screenwriter named Charlie Kaufman was given the job of adapting Susan Orlean's non-fiction book, \"The Orchid Thief,\" into a motion picture script. Although Kaufman found the principal character of the book, John Laroche, to have cinematic potential, he was at a loss how to effect the book-to-screenplay transformation. Eventually, he decided to wander off in some very strange directions, writing himself into the script and really only using \"The Orchid Thief\" as a jumping-off point. The movie, as it turns out, is about a screenwriter named Charlie Kaufman, who is given the job of adapting Susan Orlean's non-fiction book, \"The Orchid Thief,\" into a motion picture script. Although Kaufman finds the principal character to have cinematic potential, he is at a loss how to effect the book-to-screenplay transformation. Eventually, he decides to wander off in some very strange directions, writing himself into the script and really only using \"The Orchid Thief\" as a jumping-off point.\r There is a concept in mathematics called \"recursion.\" Kaufman and director Spike Jonze have apparently discovered the cinematic equivalent with Adaptation, an occasionally maddening and sometimes brilliant motion picture that varies between being insightfully sharp and insufferably self-indulgent. Regardless of whether you appreciate the movie or not, it's likely to stay with you. An hour after seeing Adaptation, I was still wondering exactly what the hell I had seen and whether I liked it or not.\r Adaptation stars Nicolas Cage in a dual role as Kaufman and his fictitious brother, Donald. Meryl Streep is Susan Orlean, the writer of \"The Orchid Thief;\" Chris Cooper is Laroche; Brian Cox is Robert McKee, a real-life lecturer about the art of screenplay writing; and Tilda Swinton is Valerie, the one who commissions Kaufman to write the adaptation of the book. The film flips back and forth across time, alternating between the \"present,\" in which Kaufman is trying to write the screenplay, and three years in the past, when the events recounted in \"The Orchid Thief\" are taking place. There are also various flashbacks and even an excursion to pre-historic times. Certain events take place on the set of Jonze and Kaufman's previous collaboration, Being John Malkovich, allowing actors like Malkovich and Catherine Keener to make cameos.\r The title of Adaptation doesn't only refer to what Kaufman is doing to Orlean's book. It is also meant in the Darwinian sense - that humans adapt to circumstances. The movie is certainly as offbeat as Being John Malkovich, although it is neither as funny nor as accessible (if, indeed, Malkovich can be considered to be \"accessible\"). Adaptation has a serious point or two to divulge. In particular, it's about the importance of passion in every endeavor. Laroche's passion is orchids. Orlean's one great need in life is to feel passion about something. And Kaufman desperately wants to write something original, not generic or derivative. The movie also takes great pains to skewer the script-by-numbers mentality of Hollywood. The final 15 minutes represent a parody of how things would have concluded had Kaufman followed the screenwriter's Bible.\r One intriguing aspect of Adaptation is how Kaufman portrays himself – as a fat, balding, aging man with such a severe case of self-doubt that he can't bring himself to approach a woman. In reality, Kaufman is nothing like his on-screen counterpart, nor does he have a twin brother. (Donald Kaufman, who is given co-credit for the script, is entirely a figment of the real Kaufman's imagination.) I would be interested to have a psychologist view this movie and give an opinion of the man who wrote it.\r The movie comes across as chaotic, which I'm sure is intentional. With the multiple storylines, there's too much going on, and this damages Adaptation's structure. Jonze does his best to bring a kind of order to the proceedings, but there are times when things get away from him. And there are instances when the movie comes across as being a little too clever (such as when McKee's character insists that several techniques prominently employed by Jonze, such as a voiceover, have no place in any film). I can't imagine Adaptation having much mainstream appeal, but, for those who look for something genuinely off-the-wall in a motion picture, this will unquestionably strike a nerve.",
      "review_date": "2016-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This should technically go under 'unscored' or 'not a number', as I didn't consider this to be a movie. Since this is not a possible option, I've gone with zero.",
      "review_date": "2020-06-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie makes me imagine a middle school writing class. The students are asked to write about their favorite vacation ever. The best student in the class, instead of writing about his favorite vacation ever, writes a long story about This movie makes me imagine a middle school writing class. The students are asked to write about their favorite vacation ever. The best student in the class, instead of writing about his favorite vacation ever, writes a long story about trying to write a story about a book about an exciting vacation. This was the problem with Adaptation. It's cute, it's sometimes funny, it's sometimes fun, but it spends so much time winking and nodding at the viewer that it just gets to be annoying. The movie insists that we're in on the joke so many times that the joke gets tired really, really fast. It's too bad, too, because I enjoyed Cooper, Streep and the always stellar Brian Cox (hope he wins an Oscar one day). But, as a movie, this failed in a big, big way.",
      "review_date": "2005-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "To be honest, the feelings on this movie seemed to be mixed among the masses. I've talked to just as many people who loved it as I have who hated it. In all fairness, it is a very original idea for a movie. But this is not enough to To be honest, the feelings on this movie seemed to be mixed among the masses. I've talked to just as many people who loved it as I have who hated it. In all fairness, it is a very original idea for a movie. But this is not enough to overcome the one major problem with this movie: BORING! BORING! BORING! ! F....ING BORING!!!!! There...I said it.",
      "review_date": "2003-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Adaptation is further proof that no director does off-the-wall filmmaking like Spike Jonze, and no writer plays with the concept of reality quite as well as Charlie Kaufman. Adaptation is an extremely appropriate title for the film, which isAdaptation is further proof that no director does off-the-wall filmmaking like Spike Jonze, and no writer plays with the concept of reality quite as well as Charlie Kaufman. Adaptation is an extremely appropriate title for the film, which is an adaptation of and adaptation of an adaptation (the film follows a fictionalised Kaufman struggling to adapt a book into a screenplay, and he ends up writing himself trying to adapt the book into his film - that's three levels of reality). Kaufman's writing, as per usual, is exceptionally clever, funny, and unconventional. He has a lot to say about being a writer, the film industry in general and social ineptitude. He bravely creates an exaggerated version of himself, a depressed, self-hating and bordering on paranoid personality, played brilliantly by Nicolas Cage, to act as narrator and ground the film's undeniably odd story in some semblance of reality. The other characters in the film, all weird and wonderfully warped versions of real people, add a little something extra to the film, whether it be Meryl Streep's passionate and driven, but quite tragic journalist Susan Orlean, or Chris Cooper's slightly batty but compelling activist and orchid hunter John Laroche or Brian Cox's universally respected but rather arrogant screenwriting lecturer Robert McKee. I also found the introduction of Charlie Kaufman's fictional twin brother Donald (Cage again) an interesting concept - it's almost as though Kaufman has a love-hate relationship with himself, and differing aspects of his personality, with each of the brothers representing particular personality traits. The \"Charlie\" part of himself is thoughtful, intellectual, and occasionally brilliant, but at the same time is cripplingly shy and socially awkward. The \"Donald\" part of himself is charming, confident and interesting, but his writing is uninspired, mainstream drudgery. The film could be commenting on Kaufman's desire to be better known and more loved, but also being unwilling to dumb down his writing to achieve this. Adaptation is an extremely effective film when talking about filmmaking, writing, inspiration and identity, but sometimes I felt Kaufman took these concepts a little too far. The film's finale, especially, is quite jarring when compared to the rest of the film - it seems like Kaufman and Jonze have given up the originality and consistent tone of their film at this point in favour of a final act from a run-of-the-mill thriller. This portion of the film is turgid, melodramatic and feels simply wrong, threatening to overwhelm the brilliant subtlety and quiet confidence of the of the first hour and twenty minutes or so. I'm also not sure whether Charlie's hallucination sequences were really necessary to demonstrate his sleep-deprived, uninspired state of mind either. Even with its hugely disappointing conclusion and minor artistic niggles, Adaptation is an insightful, original and funny reality-distorting piece of cinema from two of the greatest talents working in the film industry today. Being John Malkovich undeniably pulled off the same ideas more effectively, but Adaptation still has a lot to say, especially when taken as a companion piece to the aforementioned masterpiece.",
      "review_date": "2012-03-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Adaptation, just like my last review of Seven Psychopaths, references itself and is so ironic that it pulls it off. The movie is about a screenwriter who is having a hard time adapting a book into a movie, yet the actual screenwriter of thisAdaptation, just like my last review of Seven Psychopaths, references itself and is so ironic that it pulls it off. The movie is about a screenwriter who is having a hard time adapting a book into a movie, yet the actual screenwriter of this movie, Adaptation, wrote the movie about this subject. Cage plays a lonely, asocial screenwriter perfectly, and yet at the same time plays his social, flirtatious twin brother: sometimes in the same scene! It takes true acting talent to do that.\r Adaptation takes a banal subject- orchids- and turns it into an original piece of indie magic with a couple of unforeseen and unconventional twist near the end. It's more than a movie about a movie- it's a movie about failing to write a movie: if that makes sense.",
      "review_date": "2014-06-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very witty and self referential. Entertaining in a highly ironic way. All of the cliches that the protagonist is supposed to avoid come into play, down to the \"act of god\" in the end, and the strange drama that comes out of left field. It wasVery witty and self referential. Entertaining in a highly ironic way. All of the cliches that the protagonist is supposed to avoid come into play, down to the \"act of god\" in the end, and the strange drama that comes out of left field. It was ironically bad, which made it ironically good, if that makes any sense.",
      "review_date": "2013-11-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Would not recommend this to anyone at all. Why was I so looking forward to watching this ? It is obvious why. I was keen after reading all the so called experts say it was such a good this and this but it was really just a tired old bag of Would not recommend this to anyone at all. Why was I so looking forward to watching this ? It is obvious why. I was keen after reading all the so called experts say it was such a good this and this but it was really just a tired old bag of cliches. Cage has a habit of picking these non charismatic parts as no one could make his characters seem lively or any of the characters for that matter, This was as bad as I have seen of late and that takes into account a few very bad ones as well......... While i admire the guts and courage to create this movie and gather such a good cast (on paper) and realise it is so easy to sit back and throw insults at the work ,I really do feel this is a total loss as far as watchability.",
      "review_date": "2003-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best scprit by Kaufman ever, best acting by Cage ever. A must.",
      "review_date": "2005-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "People who think this was poorly written are not paying attention! Kaufman gets as close as any masterpiece I've known to expressing something true and simple and universal. The humor and wit are clever (I get the \"winking at the People who think this was poorly written are not paying attention! Kaufman gets as close as any masterpiece I've known to expressing something true and simple and universal. The humor and wit are clever (I get the \"winking at the audience\" part), but beyond being playful, they are executed with such a steady and deliberate hand to lend to a greater, troubling problem of how to survive -- to preserve our uniquely human consciousness -- in an era of mass-production. Fantastic, reflexive and self-indulgent? Yes. And yet! It still issues a \"message\" (for unfortunate lack of better word) relevant to the world we live in. This is a film you can watch repeatedly and find something new every time.",
      "review_date": "2009-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A brilliant film, quite possibly my favorite film, it is beyond me why anyone can give this flick 0/10, i say they either lack the intelligence to appreciate an innovative creation or they should stick to predictable and simple flicks and A brilliant film, quite possibly my favorite film, it is beyond me why anyone can give this flick 0/10, i say they either lack the intelligence to appreciate an innovative creation or they should stick to predictable and simple flicks and avoid anything a bit different or challenging. This film has it all, great acting, cage and cooper give oscar worthy performances, i'm glad cooper got best supporting actor but why cage didn't get best actor is beyond me, this is his best performance, well at least in the films i've seen him in. Spike Jonze delivers stunning cinematography with an equally engaging narrative. This film is both comic and profoundly moving at the same time. being John Malcovich is a very good film, don't get me wrong but this is better, this is superb. Also look out for the countless in jokes mocking the conventional, predictable hollywood films. Especially the scene with Swinton and cage, Michael Clayton starring Tilda Swinton is an epitome of the kind of flick cage is trying to avoid making his screenplay like.",
      "review_date": "2008-05-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "[***SPOILERS***] Personally I am appalled that this movie did not become an instant classic. It is no understatement to say that the screenplay is up there with Pulp Fiction as one of the best ever written, the directing is superb, Nicholas[***SPOILERS***] Personally I am appalled that this movie did not become an instant classic. It is no understatement to say that the screenplay is up there with Pulp Fiction as one of the best ever written, the directing is superb, Nicholas Cage deserved two separate oscars for his portrayals of both Donald and Charlie and best of all the film is so intelligent. I loved how Charlie was mocking Robert McKee by including deus ex machina in the films conclusion just because he was told not to. I adore the scene where Charlie asks Donald if he can hekp him out with the script because it is at this point exactly where the film it is no longer a story about a writer's frustration and dissapointment, but rather a story of intrigue, drugs and car chases. In the films final scenes ***SPOILER*** we are finally given the reasoning for this: the entire point of the third act was to kill off the Donald personality once and for all. ***END SPOLIER*** We must realise, of course, that Donald and Charlie are the same person, with Charlie being the intelligent one who wants to write original screenplays, while Donald wants to write that Jerry Bruckhiemer blockbuster. But I cannot explain how perfectly this film adresses every topic it wants to address, and how it magnificently explains the struggles of a writer. Easily Kaufman's best screenplay and Jonze's best film. Amazing in every sense of the word.",
      "review_date": "2005-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Oh my goodness do I feel sorry for those sad few who do not \"get\" this movie. You truly have to be either arrogant, pretentious or inhuman to not be enchanted with this hilarious tale of the bizzare reality in which humans and nature entertwine.",
      "review_date": "2005-10-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie came in strong in the beginning and middle. But as it ended, the trick of the film just became too much a part of the film. Right when the film took the \"disaster Hollywood\" i understood what Kaufman was doing already. But it went The movie came in strong in the beginning and middle. But as it ended, the trick of the film just became too much a part of the film. Right when the film took the \"disaster Hollywood\" i understood what Kaufman was doing already. But it went on only for so long.",
      "review_date": "2009-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Thank God people like Charlie (and Donald) Kaufman are out there writing. With so much brain-dead crap coming out of Hollywood every day, it's great to know that someone is bringing to the table some creativity, vision, and a wilingness Thank God people like Charlie (and Donald) Kaufman are out there writing. With so much brain-dead crap coming out of Hollywood every day, it's great to know that someone is bringing to the table some creativity, vision, and a wilingness to take risks. Visionaries like Lynch and creative teams like the Coen brothers & the Jonze/Kaufman teams need to inspire young movie-makers out there to make bold, original, and rule-breaking films. Adaptation is hilarious. Cage is terrific, and I'm especially proud of Kaufman for integrating the Uroboros into his script. Don't expect \"Malkovich II: The Next Portal\" but definitely see it. It's clearly one of the best films of 2002.",
      "review_date": "2002-12-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I tried to like this film, but I couldn't even finish it. My best friend loved it. I reckon it depends upon your taste. I found it very boring, I couldn't sympathize or care about any of the characters, and, in trying too hard to I tried to like this film, but I couldn't even finish it. My best friend loved it. I reckon it depends upon your taste. I found it very boring, I couldn't sympathize or care about any of the characters, and, in trying too hard to be artsy, it ends up being irritating and too dang long (I am not sure how much of it I saw, but my guess is about 2/3 to 3/4 before I got really fed up and quit watching).",
      "review_date": "2007-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great Movie...Chris Cooper is Great!!",
      "review_date": "2009-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really makes you think--one of my favorite movies. Exceptional acting and story to go with it.",
      "review_date": "2005-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If Being John Malkovich introduced us to the creative ideas of Charlie Kaufman and took us (fictionally) into the mind of John Malkovich the actor then Adaptation takes us into the mind of Charlie Kaufman himself. Of course, this is stillIf Being John Malkovich introduced us to the creative ideas of Charlie Kaufman and took us (fictionally) into the mind of John Malkovich the actor then Adaptation takes us into the mind of Charlie Kaufman himself. Of course, this is still only fiction and much poetic and artistic license is taken but Kaufman turns the tables onto himself this time and the results are just as creative and enjoyable. He even creates a fictional brother in Donald Kaufman (which the Academy even nominated as a joint writer when the Best Screenplay Oscar was announced). Kaufman is simply a master at creating a story where art imitates life imitating art. It’s so cleverly done and effortlessly blurs the lines between fact and fiction such is it’s astute and clever construction. Director Spike Jonze, once again, seems to be on the same wave length of Kaufman’s ingenuity and the performances are fantastic. Chris Cooper won the Best Supporting Actor award but, in a dual role as Charlie and Donald, this is arguably the best work that Nicolas Cage has ever delivered. Another mind-bending treat from Kaufman.",
      "review_date": "2020-09-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Charlie Kaufman once again creates a masterful film. One of my top 10 favorites of all time. Nic Cage shows that he is a talented actor if he's given a great script. I love how Charlie and Donald look and sound, yet we can tell one fromCharlie Kaufman once again creates a masterful film. One of my top 10 favorites of all time. Nic Cage shows that he is a talented actor if he's given a great script. I love how Charlie and Donald look and sound, yet we can tell one from another. The movie makes Donald feel so real that I actually almost teared up at the end. I love some of the irony the movie has. I saw a review on this page slamming it for it's \"Top 40 ending\" what he or she failed to see was that's part of the irony. A must see, but only for those who are willing to use some of their brain instead of just dosing out and not paying attention",
      "review_date": "2011-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fairly clever and enjoyable, but not as good as it thinks it is. Acting is strong.",
      "review_date": "2019-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An extraordinary film of beauty and cinematic mastery. Although bolstered by remarkable acting performances, the true splendor is rooted in Charlie Kaufman's screenplay and the heavenly direction of Spike Jonze.",
      "review_date": "2014-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Adaptation is a brilliant work for the first hour and a half before it goes off the deep end. The writing is immaculate during this former period and works on multiple levels, it really makes you think, really entertains, and feels authenticAdaptation is a brilliant work for the first hour and a half before it goes off the deep end. The writing is immaculate during this former period and works on multiple levels, it really makes you think, really entertains, and feels authentic and real. However, in the last half hour, it all falls apart with a stupid ending that embraces all that the character rails against throughout. I understand the point, I got it. That is not the problem, I can get it and still think it sucks and my God did the ending suck. It not only thought it was smarter than its audience and took self-indulgence to a different level, but it sucked the life out of the film and spit in the face of its audience. I love Charlie Kaufman's writing, but the ending was horrendous and a complete turn off that left me sitting there trying to piece together how a film I was falling in love with just turned its back on me and called me an idiot. Luckily, the acting is fantastic from Nicolas Cage, Meryl Streep, and Chris Cooper, which really boost this one up considerably. Ultimately, Adaptation is a sometimes brilliant work that is great when it respects its audience, but falls apart when it feels it too smart, just like the characters it depicts and would be really well served by, ya know, respecting those who view the film.",
      "review_date": "2015-06-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's third act may be rather polarizing, but as an overall film, \"Adaptation.\" is stil a beautifully written meta-drama with utterly priceless performances from Nicolas Cage and Chris Cooper.",
      "review_date": "2013-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A film about the screenplay which is currently being written within the film and how it ends. Phenomenal and extraordinary. The lives of screenwriter Charlie Kaufman (Cage), author Susan Orlean (Streep) and orchid poacher John LarocheA film about the screenplay which is currently being written within the film and how it ends. Phenomenal and extraordinary. The lives of screenwriter Charlie Kaufman (Cage), author Susan Orlean (Streep) and orchid poacher John Laroche (Cooper) become strangely intertwined as each one's search for passion collides with the others' in this adaptation of the best-selling \"The Orchid Thief.\" This brilliant meta-narrative and hilarious spoof of Hollywood's formulaic approach to telling stories. \"Adaptation\" came about because of Jonze and real-life writer Kaufman, who had worked previously on \"Being John Malkovich.\" Cage's sweaty, uncomfortable turn in both roles is marvelous. I miss the vintage Nicolas Cage in well made films, and his performance here still amazes me every time. Enough can't be said about the performances of a stellar cast, Strep and Cooper (won Oscar), that exceed lofty expectations. Original, clever, beautiful, tragic, and I could go on.",
      "review_date": "2013-01-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nic Cages best movie that Charlie Kaufman comes up with on the spot. The ultimate meta-movei with the best screenplay ever written or one of the top ones.",
      "review_date": "2013-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The story is boring in the beginning, because it is too slow and shows the failures of Kaufman too often. The mix of fiction and reality is interesting though and  the performance of Nicholas Cage is brilliant, because he is playing twoThe story is boring in the beginning, because it is too slow and shows the failures of Kaufman too often. The mix of fiction and reality is interesting though and  the performance of Nicholas Cage is brilliant, because he is playing two different characters.",
      "review_date": "2021-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Such a film that leaves you mulling over what just happened. In a good way, that is. The film's screenplay is contained in this droste effect of a film within a film. Nicolas Cage, when given the right script, can be an accomplished actor.Such a film that leaves you mulling over what just happened. In a good way, that is. The film's screenplay is contained in this droste effect of a film within a film. Nicolas Cage, when given the right script, can be an accomplished actor. Meryl Streep and Chris Cooper are far from supporting roles. It's a three way story and intertwines like 'Pulp Fiction'.",
      "review_date": "2014-06-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Charlie Kaufman writes a screenwriting master class with in the movie. Many rules are broken, the third wall seems to disappeared in a unexplainable way, yet you always remain in the universe of the story. Directing is fine, no risks whereCharlie Kaufman writes a screenwriting master class with in the movie. Many rules are broken, the third wall seems to disappeared in a unexplainable way, yet you always remain in the universe of the story. Directing is fine, no risks where taken, acting is good.",
      "review_date": "2013-10-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Donald Kaufman: \"What's on your mind monkey butt?.\"\rCharlie Kaufman: \"Nothing, like always\".\r\r\nThe story is about a screenwriter and his brother try to work to gether to fulfill at least one good story. Their ordintary lives twist and turnDonald Kaufman: \"What's on your mind monkey butt?.\"\rCharlie Kaufman: \"Nothing, like always\".\r The story is about a screenwriter and his brother try to work to gether to fulfill at least one good story. Their ordintary lives twist and turn into something that no one can even believe.\r Adaptation is one of those movies that just blow my mind with it's clever writing and it's weirdly but wonderful character's. Spike Jonze knows how to tell a story, make my jaw drop and knows when to surprise me with it's twist and turns. We all like to make fun of Nicolas Cage's rage moment's and I have to admit I'm one of them who takes the mick of of him, but after seeing this movie and the film Joe that came out early this year; I came say that Cage is more than a screaming over the top actor, his actually a fantastic actor and in this movie his pure brilliant. Meryl Streep and Chris Cooper did a good job in this film as always as they are both great actors.\r My only problem with the film was Meryl Streep's character, now before you flip your **** at me, let me explain why I didn't enjoy her character. She wasn't all that interesting to be honest and she kind of slowed the movie down for me. She was good in the movie, but her character could have been taken out and I wouldn't even care.\r But the one important thing that I want to say and it may not be a big deal for most people but to me this movie told the perfect message and that is \"Writing a story or a writing a script is hard.\" For every screenwriter out there can look at this and say \"Yes that's me right they, trying to get a great idea out there, but how can I put it into words to make the great idea into a even more brilliant idea\".\r I tried to write a story once called Mark Rider: The Wanted Fugitive and I had a lots of ideas for that story, perfect and so brilliant ideas that I couldn't get it into words, and that got me mad, until I saw this movie and I saw Nicolas Cage's character (Charlie Kaufman) and that character was having the same problem that I had, and I could see myself as him in this movie.\r Overall Adaptation is a well written movie that sinks it's warm and smart message into you, that you really do feel like your in the movie yourself.",
      "review_date": "2015-03-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Well. It requires a good performance from Nicholas Cage. And this time, he nails it. Because the movie is a comedy as much as anything, Cage's quirks are perfect. The drama is brought by the great Meryl Streep. In terms of the writing and\"Well. It requires a good performance from Nicholas Cage. And this time, he nails it. Because the movie is a comedy as much as anything, Cage's quirks are perfect. The drama is brought by the great Meryl Streep. In terms of the writing and plot, is truth that at times Kaufman wants to show how smart he is (he is) and can get a little annoying (just a bit). But when is over, you are going to realize how different and good this movie was.\"",
      "review_date": "2018-08-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A surreal comedy about the hardest work of the adaptation of the book to the film.Inconceivable and unrepeatable Nocholas Cage in the double role of Kaufman brothers.",
      "review_date": "2017-02-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Adaptation is an excellent tragicomedy, one of the best roles of Nicholas Cage. So it's not every actor who can play two completely different twin brothers. The plot has a slow dynamics of development, but the last third of the filmAdaptation is an excellent tragicomedy, one of the best roles of Nicholas Cage. So it's not every actor who can play two completely different twin brothers. The plot has a slow dynamics of development, but the last third of the film completely changes its opinion about the film, which is an example of the thesis expressed in the film Robert McKee. You can also note the game Meryl Streep, how it plays well)",
      "review_date": "2022-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A postmodern philosophical prophecy, rife with self-referential humor and metatexual commentary. But at the heart of Adaptation is a beautiful story about love and soulmates. It's supported by an amazing cast, with perfect performances byA postmodern philosophical prophecy, rife with self-referential humor and metatexual commentary. But at the heart of Adaptation is a beautiful story about love and soulmates. It's supported by an amazing cast, with perfect performances by Nicolas Cage, Meryl Streep and Chris Cooper.",
      "review_date": "2017-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a chemical reaction where Charlie Kaufman with all his neuroses merges with Nicolas Cage with all his neuroses.  What we end up with is a Jungian meditation on identity and discovery, the value of uncertainty, the lack ofThis movie is a chemical reaction where Charlie Kaufman with all his neuroses merges with Nicolas Cage with all his neuroses.  What we end up with is a Jungian meditation on identity and discovery, the value of uncertainty, the lack of control in life.  How most of our experiences are unavoidable despite our best efforts to engineer them.   The best performance by Chris Cooper, who gets to express more than anger.  The best performance of Nicolas Cage, who gets do essentially do a Woody Allen impression.  He takes awkwardness to new heights, the best performance of Meryl Streep.  I just love the idea of twin brothers arguing about multiple personality disorder.  I like what Ebert said: \"To watch the film is to be actively involved in the challenge of it's creation.\"  I don't know how they ended up with a movie where Cage masturbates several times while berating himself for being pathetic and narcissistic.  I like that the thesis of the movie seems to be that drugs make people fascinated, and are hence the goal of passion seekers.",
      "review_date": "2020-02-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i'm a walking cliche..Adaptation\n\nThe eerie perspective, bold plotline and a potential premise are the high points of this feature which unfortunately is supervised without any care and hence fades off into just a mere blurred out idea ini'm a walking cliche..AdaptationThe eerie perspective, bold plotline and a potential premise are the high points of this feature which unfortunately is supervised without any care and hence fades off into just a mere blurred out idea in this overlong feature. Spike Jonze seems a bit distracted from the main track and hence leads it into a boring ride that may have an interesting climax but the journey is certainly not worth it. The performance objective is completely satisfactory in here for Nicolas Cage and Meryl Streep both are putting all their chips in and delivers what is essential. Adaptation might be something plausible on terms of art and craft but when it comes to blend all it in and offer intriguing and gripping tale along with entertainment to the audience, it fails on all levels.",
      "review_date": "2018-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Adaptation is one of Kaufman's earlier movies, and while it is both self-indulgent and self-effacing, it is also incredibly witty and self-aware. Adaptation doesn't take itself too seriously, and yet at the same time, it is Kaufman's mostAdaptation is one of Kaufman's earlier movies, and while it is both self-indulgent and self-effacing, it is also incredibly witty and self-aware. Adaptation doesn't take itself too seriously, and yet at the same time, it is Kaufman's most sincerely endearing movie when it comes to reality. Adaptation is an absurdist comedy, but it is also a broader critique of film as a creative medium and as an art form. Adaptation literally looks at the story of Kaufman's struggle to adapt a critically middling book that lacks a clear subject into a Hollywood film. The movie is a satire of the film industry and the creative vampirism that it incentivizes, ultimately illustrating that the only way to be financially successful in Hollywood is to give up your creative principles and pander to the most general of filmgoing audiences.Adaptation has a basic three-act structure, and while this is the least creative approach you can take to a film, it acknowledges this and asks the viewer to move on to focus on the broader content of the film. Charlie Kaufman's arc throughout the film is one of adaptation - it is through his struggles and countless failures that he can change as a person and adapt to his biggest problem, i.e. socializing with women. The film starts from a point of total self-effacement, reflecting some degree of Kaufman's own self-loathing. Charlie Kaufman sees himself as a gross, despicable person who is socially awkward, unfit, and generally a waste of space. Whether Kaufman as a real person truly believes this doesn't matter because it is embedded in the text of the film nonetheless. Charlie Kaufman's journey is not one of self-discovery but instead is guided by a creative realignment. The film literally states that movies as an art form must adopt some degree of a cliche to be successful, but it also implies that a refusal to adhere to any norms of a craft leaves an artist in a state of creative drought. When a creative endeavor is born from only restrictions and no foundation, it is doomed to fail. Similarly, when Charlie Kaufman is strictly self-destructive in his thought process, he dooms himself to a dangerous state of learned helplessness. Charlie Kaufman must learn to love and accept himself for who he is before he is finally able to have a successful interaction with a woman. The film may start slow, but by its end, it is an incredibly fast-paced ride filled with the very creative vices Kaufman vowed to avoid.While Adaptation is incredibly witty and self-aware, it is also charming and charismatic. Adaptation illustrates that conformity may be a necessary evil; however, it can also be circumvented by the mere awareness of its existence. Like Kaufman within its walls, Adaptation is aware of its flaws, but rather than revel in their depths, it accepts them and allows them to define its very success. Adaptation explores the painstaking process of screenwriting and creative genesis and how it relates to the search for perfection. Kaufman capturing the monumental task through his use of incisive one-liners. While some may perceive the self-referential and deconstructionist nature of the movie to be pretentious, they can just as easily read as more of the witty, analytical features that are present across Kaufman's oeuvre. Kaufman does write himself into the movie, which in some cases can lead to some degree of deifying - but by splitting himself with and invented brother, he can critique his failings while preserving his better, more genuine talents. Donald serves as the ultimate foil for Kaufman, as he is a caricature of all of Charlie Kaufman's biggest complaints with the industry. Donald continually follows through with actions that Charlie Kaufman assures will result in him being worse off, but in the end, is the more successful of the two. Donald is, on one hand, an epitome of all that Charlie Kaufman despises about the industry, but is also in some ways his ideal self, effortlessly holding many traits that Charlie Kaufman strives to attain. Donald is an embodiment of the best and worst of Charlie Kaufman's desires, yet he also holds many characteristics in common with Charlie Kaufman; therefore, neither Donald nor Charlie Kaufman truly represents the entire gambit of what makes up Kaufman as a real person. Kaufman has split himself into two bodies, each holding different traits, while simultaneously acknowledging that doing so is an overused trope and a lazy technique.Adaptation is mature when it needs to be and aware of its boundaries. The film never tries to reach beyond its logical boundaries, without first acknowledging that doing so is all that matters when judging a product. The first two acts may be slow, but their content and their extensive critiques of the film industry show Kaufman is someone who is not afraid to make his stances known. Overall, Adaptation is funny, incisive, and well constructed, providing a broadly accessible experience of high quality and good humor.",
      "review_date": "2020-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nicholas Cage's best movie.If you ever want to make an original, unpredictable movie, having Jonze & Kaufman involved would be a perfect start.One of 2002's best movies.",
      "review_date": "2021-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie makes no ******* sense! I started watching and expected it to conclude to something sensible but it is just mental. Complete waste of my time and sanity. I can't believe that someone made money by selling this script",
      "review_date": "2022-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI'm declaring this a formative movie for my 20s even though I've got 6 years left on them. The scene where Donald Kaufman explained to Charlie that you are what you love, not what loves you, helped motivate me to feed my cat. She had been meowing for the past hour despite it not being dinner time yet, and I paused the credits (I like to watch them all the way through) to open a can of pate. Once I walked her downstairs and slapped that stuff in her bowl, she calmed down and without eating any hopped on my lap for the rest of the credits and started purring. I guess getting fed was a secondary to feeling loved and payed attention to. She really proved Charlie right there.",
      "review_date": "2022-05-29",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 82,
  "genres": [
    "Drama",
    "Comedy",
    "Crime"
  ]
}