{
  "title": "Jason X",
  "rating": 7.4,
  "release_date": "2002-04-26",
  "genre": [
    "Sci-Fi",
    "Horror"
  ],
  "summary": "Jason Voorhees, iconic movie villain, returns to the screen after a nine-year absence in the 10th installment of the classic Friday the 13th film series.  (New Line Cinema)",
  "critic_reviews": [
    "The film has spunk. Unfortunately, the gore comes with brutal regularity, so that, despite Farmer and Isaac's attempts to liven things up, the film still just wears you down.",
    "The premise of Jason X is silly but strangely believable.",
    "It gets much more watchable in the last half-hour.",
    "Feels like it was written as a fairly straight horror/sci-fi movie, then script-doctored by a comedy writer intent on satirizing the original script. As a result, the film's intentional and unintentional laughs mingle so freely that it becomes difficult to differentiate between the two.",
    "Jason X conjures up more giggles than scares, assuming you make it through the first 15 minutes.",
    "A moviegoer's only defense against Jason is to avoid theaters showing this gruesome and derivative movie.",
    "There's a hint of nostalgia toward the end, with Jason encountering two nubile female campers in a virtual reality Camp Crystal Lake -- but it merely serves as a reminder that the franchise should have quit while it was ahead.",
    "This time the action takes us out of the usual campgrounds and girls in underwear into the realm of outer space, where no one can hear you screaming \"Enough already.\"",
    "Further proof that titular antagonist Jason Voorhes is ready for retirement -- to videostore shelves.",
    "A protracted and only sporadically imaginative menu of ways to be murdered.",
    "Even the imaginative gore can't hide the musty scent of Todd Farmer's screenplay.",
    "Too much of Jason X plays it straight, and that means boredom. Murder and mayhem of this sort quickly becomes monotonous.",
    "Despite the futuristic setting, which relies so heavily on GGI effects that it looks like a feature-length production concept painting, this film is painfully predictable.",
    "The kind of a moron movie, which is built to be watched by people who haven’t even seen the other nine.",
    "It will come as no surprise that the movie isn't scary. But here's the real damn: It isn't funny, either.",
    "The only chills to be found are courtesy of your theater's central air, and the suspense will come from the wait to see which disappointed kid in a hockey mask will be the first to slash the screen.",
    "Jason X sucks on the levels of storytelling, character development, suspense, special effects, originality, punctuation, neatness and aptness of thought. Only its title works.",
    "Here suspense is abandoned, and Jason is on-screen so long you get sick of seeing him -- and sick of the poorly staged slasher-film tricks.",
    "Like a dinner-theater version of the \"Alien\" movies without the good grooming.",
    "It had a little originality, unlike the other sequels, but not much."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Incredibly underrated imo. I really don't know see why people hate it so much. The acting is weak but what makes up for it is that it's so memorable and Uber-Jason is a complete bad-ass lol.",
      "review_date": "2012-11-05"
    },
    {
      "review_title": null,
      "content": "This is a so bad its good movie. But it does have a ridiculous plot and acting. But it is very entertaining to see Jason in space! But I can see why people hate this movie.",
      "review_date": "2016-08-20"
    },
    {
      "review_title": null,
      "content": "I give it a zero and that would be a compliment judging the fact I cannot give it a lower rating.This is by far the worst movie I've ever seen and I absolutely dreaded every second of it.What a sad excuse for a horror movie.I have seen I give it a zero and that would be a compliment judging the fact I cannot give it a lower rating.This is by far the worst movie I've ever seen and I absolutely dreaded every second of it.What a sad excuse for a horror movie.I have seen by far better movies that get lower scores.It never seemed to work on any scene as it escaped from being a horror to a sci fi in space.",
      "review_date": "2009-06-08"
    },
    {
      "review_title": null,
      "content": "Jason has an upgrade suit? please. horror killers don't have some crap like that",
      "review_date": "2010-11-04"
    },
    {
      "review_title": null,
      "content": "I think it was an original addition to the franchise and it was better then most of the other films in the franchise as well. However it is rather stupid and the acting is pretty terrible.",
      "review_date": "2011-11-27"
    },
    {
      "review_title": null,
      "content": "Once you get over the absurdity of the premise you can see the potential for a good film here. A slasher film set in space sounds awesome. While we technically already got that with 1979's \"Alien\" this movie had the advantage of having aOnce you get over the absurdity of the premise you can see the potential for a good film here. A slasher film set in space sounds awesome. While we technically already got that with 1979's \"Alien\" this movie had the advantage of having a legendary horror villain to use that could have set it to greatness. However the results aren't as satisfying.\r In it's best moments it can seem like a low-budget version of Alien. In it's worst the intentionally self-aware sense of humor cranks up the absurdity dial and pulls you out of the experience. Not that it was that great of a movie anyway. As always with this series the scares are non-existent and the appeal is just on watching characters get killed in brutally amusing ways while maybe getting to see some boobs in the process. It's mindless, but entertaining.\r You think that the jokes would actually end up adding some value to the experience, but they actually just end up bringing it down. Self-aware doesn't always equal funny. Sometimes the jokes can just be cringe worthy. However the only times things get bad is during an intentionally goofy showdown between Jason and a one-liner spouting android. That whole scene is just awful.\r I think the film would actually have benefited if it had taken the serious tone of the earlier Friday the 13th films. The idea would still be out there, but at least we would have avoided the bad jokes. As it stand though there is some entertainment to be had here. It can be quite fun and it's pretty cool to see Jason cutting down space marines. Your enjoyment depends on whether or not you can get behind the premise, as well as how big a fan you are of this series. As far as I'm concerned it's far from Jason's worst killing spree.\r I give \"Jason X\" a 6.5/10.",
      "review_date": "2015-04-25"
    },
    {
      "review_title": null,
      "content": "Its more of a comedy than a horror. It just ruined the entire Jason series. The first 3 are excellent but this one just had no scare. And a range of terrible deaths made a loss of action.",
      "review_date": "2013-01-13"
    },
    {
      "review_title": null,
      "content": "The Friday the 13th series stared getting ridiculous after Friday the 13th part 6,so I don't count this as a Friday the 13th movie.It's stupid,the characters are bad and is an insult to the Friday the 13th series.",
      "review_date": "2013-07-16"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nsooo dissapointing movie . absolutely worst action and worst direction .. also the lead roles are worst too .. so much waste to watch movie also that space thing is doomed",
      "review_date": "2014-03-07"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis movie IS NOT a movie to be terrified of. People who hate this movie seemed to be from a viewpoint that it was intended to be a masterpiece in the F13th Franchise. However I view it as a self aware title that is amazing. The kills are out right ridiculous and allow Jason to do things that we haven't really seen before as an audience. Of course there are stupid things like \"I think he's mad give him back his machete\" but to me it is the studio being aware that counselors commit stupid troupes. How many times do we see the counselors about to get frisky and *bang!* Jason is there to stop that sh*t like he was a Catholic mother. If anyone has seen Jason goes to hell they will know how stupid and ridiculous this movie series can get. How we got from a sack-head killer taking revenge on his experiences at the camp following his dead mother, to a black cannibalistic cop will forever be a mystery to me. That being said I believe they all bring entertainment value.\r The overall costume design is not bad but more of a silly thing where they re-shine his mask and add a cyborg element to him for some unknown reason other to say \"Hey we're in the future guys isn't that cool?\"\r The movie has some smart ideas in it as well not that many but some need to be recognized. One of which is a hologram of camp Crystal Lake used to try and confuse Jason, (After all the man is well over the average life expectancy and has literally been dragged to hell, drowned at the bottom of a lake, had a boat telepathically dropped on him, stabbed numerous times,and hung) so for him to be tricked shouldn't be that unbelievable. The film also uses it's environment in a way that makes sense. Air locks can be a blessing and a curse and you feel like the poster should say \"In space no one can hear you scream\".\r So in summary its one of those movies that you can laugh and scream at (whether that was the intended reaction or not) alone or with friends. Be open minded and maybe, just maybe you will have a very pleasant movie experience. Thanks for making it to the end of this and this is Reactions signing off.",
      "review_date": "2016-07-31"
    },
    {
      "review_title": null,
      "content": "I know Jason X was trying to break the 4th wall but I did not want it THIS way. In space? REALLY? I try to like Jason X but I just can't. Its a horrible movie which had no point of being made.",
      "review_date": "2017-07-14"
    },
    {
      "review_title": null,
      "content": "HORRIBLE!!! I can not stand this movie. Now don't get me wrong, I am a HUGE, HUGE fan of the Friday The 13th Franchise but this movie should've been burned when it was put on the shelf.",
      "review_date": "2011-06-13"
    },
    {
      "review_title": null,
      "content": "This movie is freakin' terrible.  Maybe the worst I've ever seen.  So why did I give it an 8 out of 10?  Because it might be the most unintentionally funny movie I've ever seen.  I could not stop laughing for the entire movie.",
      "review_date": "2012-03-30"
    },
    {
      "review_title": null,
      "content": "Not the best Jason film I've seen, but definitely the most imaginative. The special effects rock, it's freakin hilarious, and some of the characters are cool too. Plus, if anyone wants to see what one of these is like with Not the best Jason film I've seen, but definitely the most imaginative. The special effects rock, it's freakin hilarious, and some of the characters are cool too. Plus, if anyone wants to see what one of these is like with character development and plot, pick up the novel of Jason X. It's surprising just how good it is.",
      "review_date": "2006-01-06"
    },
    {
      "review_title": null,
      "content": "'Friday the 13th' may have been panned by critics when first released but since then it is one of the most famous and influential horror films, the franchise containing one of horror's most iconic villains. The film is popular enough to'Friday the 13th' may have been panned by critics when first released but since then it is one of the most famous and influential horror films, the franchise containing one of horror's most iconic villains. The film is popular enough to become a franchise and spawn several sequels of varying quality and generally inferior to the one that started it all off.Due to the location and incorporating space and sci-fi, on top of all the expected 'Friday the 13th' elements then some, 'Jason X' is certainly different and a little credit is due for that. For a 'Friday the 13th' film it and 'Jason Takes Manhattan' are pretty unique as far as the series goes. 'Jason X' is an example of different not really being a good thing.Interesting idea and understand totally what the film was trying to do, but it was messily executed. The strengths and faults are pretty much the same as with the previous entry 'Jason Goes to Hell', excepting 'Jason X' is marginally better because it tried to be different.A couple of creative and disturbing deaths and some inventive and stylish camera work lift 'Jason X' to a better level.One good performance too, which comes from Kane Hodder. Again creeping and chilling the socks off the viewer as Jason.However, those are the only praises really that can be given. The music is a little appealing on the ears, but it still doesn't have the eeriness and mystery that the pre-'Jason Goes to Hell' films had so brilliantly and doesn't fit as adeptly.That is the least bad though of the drawbacks, which are pretty much the same as those of the worst 'Friday the 13th' films but even worse than before. Again, like 'Jason Goes to Hell', while a good deal of 'Friday the 13th' films are silly, the silliness here is overkill that it becomes insultingly ridiculous. 'Jason X' is one of the most unique conceptually of the series, but it sure is one of the strangest to the point of overdone weirdness.'Jason X' tonally feels muddled and like it was trying to do too much with too many elements screaming of kitchen-sink. If it tried to do less it would perhaps have been a better film. Hodder aside, the acting is really horrendously amateur hour, even for the 'Friday the 13th' films where acting rarely was a strength.Likewise with the dialogue, which is even worse than 'Jason Goes to Hell', with 'Friday the 13th' at its most taking-simplicity-to-extremes, stilted, cheesiest and lacking in taste. Scariness and suspense is nil, instead going for witless comedy and gratuitous gore and nudity. The deaths go for quantity rather than quality, and generally are not particularly imaginative or creepy. The story is paper thin and confused, with too hectically paced storytelling and there is the sense that the series has gotten really stale even with a change in location.Overall, lame. 3/10 Bethany Cox",
      "review_date": "2022-03-29"
    },
    {
      "review_title": null,
      "content": "No puedo creer que esta tenga mejor puntuación que Jason Goes to Hell, la cual es mucho mejor que esta basura.",
      "review_date": "2020-04-10"
    },
    {
      "review_title": null,
      "content": "It's a pretty fun movie, with entertaining characters, settings, and humor. I will say that it is a bit stupid for my taste.",
      "review_date": "2017-10-04"
    },
    {
      "review_title": null,
      "content": "this movie was the stupidest movie i ever saw! all of Jason's movie are great but this one was a disappointing one!!! the plot was stupid and the at the end when he becomes updated was stupid!!! I don't recommend this movie!!",
      "review_date": "2006-05-06"
    },
    {
      "review_title": null,
      "content": "Becomes pointless when Jason can't be killed. Only saving grace is that it has some black humor. Time to retire the Friday the 13th series. Surely, 10 movies are more than enough.",
      "review_date": "2007-09-19"
    },
    {
      "review_title": null,
      "content": "The filmmakers have fun with the absurdity of the series in this one. Jason X is better than a lot of the original sequels partially because everyone involved in it knows it's stupid. The plot is stupid, the characters are stupid, the The filmmakers have fun with the absurdity of the series in this one. Jason X is better than a lot of the original sequels partially because everyone involved in it knows it's stupid. The plot is stupid, the characters are stupid, the dialog is stupid, and we, the audience, for buying into it, are stupid too. For that, everyone is happy. Sort of.",
      "review_date": "2009-07-15"
    },
    {
      "review_title": null,
      "content": "by no means look at that score of 5 and think im doing that because its was a ok movie. no it gets a 6 for how awsomely bad its is . what do i mean by \"awsomely bad\" ? i mean a film thats acted so bad , a story so stupidly rediculas itsby no means look at that score of 5 and think im doing that because its was a ok movie. no it gets a 6 for how awsomely bad its is . what do i mean by \"awsomely bad\" ? i mean a film thats acted so bad , a story so stupidly rediculas its comical . not many films meet this standerd most films are just horrable , bad , wachable , ok , good , great , or awsome . very few meet my awsomely bad standerd . this film should be viewed by no one . unless you get the laugh of how exceptionaly comicaly bad theese kinda films are .",
      "review_date": "2010-08-23"
    },
    {
      "review_title": null,
      "content": "Is it stupid? Yes! Is it entertaining? Well, I would say so. The plot is incredibly silly, Jason Voorhees in space. That alone makes you know that this isn't gonna be taken seriously. But out of all the Jason movies, I think this one has theIs it stupid? Yes! Is it entertaining? Well, I would say so. The plot is incredibly silly, Jason Voorhees in space. That alone makes you know that this isn't gonna be taken seriously. But out of all the Jason movies, I think this one has the most body count. Speaking of that, the gore was pretty good and I come back mostly to watch that. Overall, it is a stupid movie, but its also fun and imaginative. I kinda like this better than \"Jason Goes to Hell\".",
      "review_date": "2013-04-23"
    },
    {
      "review_title": null,
      "content": "Almost like Jason becomes The Terminator.  Has some good moments, but the plot is inane and there's too much comedy here for my taste.  Hodder, again, is great in the role of Jason.  Some slick kills, but the characters are un-likeable andAlmost like Jason becomes The Terminator.  Has some good moments, but the plot is inane and there's too much comedy here for my taste.  Hodder, again, is great in the role of Jason.  Some slick kills, but the characters are un-likeable and somewhat idiotic.",
      "review_date": "2012-09-09"
    },
    {
      "review_title": null,
      "content": "With over-the-top violence, tongue in cheek dialogue, Jason X definitely fits into the \"So bad it's good\" category. The movie is really bad, but it has just enough in it to justify watching it during Halloween or when you want to satisfy aWith over-the-top violence, tongue in cheek dialogue, Jason X definitely fits into the \"So bad it's good\" category. The movie is really bad, but it has just enough in it to justify watching it during Halloween or when you want to satisfy a late night horror flick",
      "review_date": "2019-03-03"
    },
    {
      "review_title": null,
      "content": "I know alot of people love this one. But besides some clever homages and one cool ass death scene with liquid nitrogen it all plays out like an overly mediocre episode of andromeda which makes sense because so many people from the show areI know alot of people love this one. But besides some clever homages and one cool ass death scene with liquid nitrogen it all plays out like an overly mediocre episode of andromeda which makes sense because so many people from the show are responsible for this. The plot is unimportant but basically Jason is frozen and than thawed out in the future aboard a space ship where he wreaks havoc. The FX are okay and the characters are mostly unlikable and annoying aside from the retro leading lady and Kane Hodder of course. It's not a terrible movie I especially enjoyed the 80s sleeping bag scene but I do feel like it's the weakest of the series. The uber Jason design is cool but unnecessary and the fact that they're aware their making a bad movie is i believe its biggest problem. Because instead of avoiding those pitfalls it becomes what it's making fun of.2.5/5",
      "review_date": "2020-03-13"
    },
    {
      "review_title": null,
      "content": "this movie is great it gets jason voorhes to the next level of the word awesome",
      "review_date": "2018-10-04"
    },
    {
      "review_title": null,
      "content": "From a slasher to a comedy to a sci-fi, is there anything that this franchise hasn't done? Yeah, a horror musical. Do that for twentieth film in the franchise. ..Bad : After the events of Final Friday, the existence of this piece of s**tFrom a slasher to a comedy to a sci-fi, is there anything that this franchise hasn't done? Yeah, a horror musical. Do that for twentieth film in the franchise. ..Bad : After the events of Final Friday, the existence of this piece of s**t isn't justified. We get everything 2001-ish except for that stupid sci-fi mumbo jumbo **** with the lab technicians (or whatever) dressed up like strippers and looking like ultimate sluts, that makes no sense at all. You can heal a 400 year old fossil but not someone who died just now? May be the movie explains it, and I might have snoozed at the very moment. But who the f**k cares? This movie is already nonsensical. There are some stupid references of the movie being in 2455 or whatever, and has some high tech weapons made of plastic to take out Jason. And, all the other negatives are exactly those of Part 8, in fact this is part 8, but in space - no good characters, no storyline, no logic, takes itself too seriously and absolutely sucks. This feels like a crossover between Power Rangers and the Doom Game, with Jason. It feels dragged as **** and is also a pseudo pornography. If someone says he/she hates sci-fi, he/she might have watched this movie. None of the characters are interesting. It sucks out all the life you have and makes you die of dehydration. I am really tired of watching this garbage, and I don't want to whine about this anymore. ..Conclusion : It was perhaps the worst idea, assuming that there were ideas that were introduced for this movie, for this movie. It's a lame attempt to give a whacky filler while the crossover was in developmental hell. ..Rating. ..Score : absolute 0/10Grade : F",
      "review_date": "2019-03-07"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nJason gets cryogenically frozen, ends up on a space ship in the future, kills everyone and gets some cybernetic implants.",
      "review_date": "2020-09-27"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nJason X now this movie is dumb and I like it I don't know why people hate it so much it's a decent movie yeah the characters are bad and the special effects are awful I can come around to this movie uber Jason is awesome even though he does not appear until the last ten minutes still this is a dumb fun movie and it was only made so people could have Jason still in there heads for Freddy vs Jason which came out two years later",
      "review_date": "2021-09-04"
    },
    {
      "review_title": null,
      "content": "Incredibly stupid movie, but I think this is not a movie to be taken seriously. If you just look at it for what it is, it’s a fun flick. If you’re expecting a AAA, serious-like movie, you’re not going to enjoy it.",
      "review_date": "2021-03-05"
    },
    {
      "review_title": null,
      "content": "This movie has a lot of silly stuff, cheesy acting, hot 2000s girls, kind of trash looking sets. But it adds up to more than the sum of its parts, the cheesy acting is kind of good for a B movie, the editing is kind of snappy and notThis movie has a lot of silly stuff, cheesy acting, hot 2000s girls, kind of trash looking sets. But it adds up to more than the sum of its parts, the cheesy acting is kind of good for a B movie, the editing is kind of snappy and not worthless, and it's overall pretty intentionally funny. Good thrills, good spills, good thrills. 8/10",
      "review_date": "2021-03-12"
    },
    {
      "review_title": null,
      "content": "This movie revolutionized the teenager murder genre by going into space. Steven Speilberg took a wild turn with this entry and it clearly paid off earning him 40 Oscars and $20 at the box office.",
      "review_date": "2021-04-30"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWould you say a franchise is jumping the shark when they send their main bad guy into space? Normally I would say yes, but I think Jason jumped the shark when he went to hell. But that could just be me. Jason X is the final movie before the remake and when he faces off against Freddy.PLOTCurrent year, they finally capture Jason but don’t know how to contain him. He’s cryogenically frozen along with a young woman. Over 400 years later a scientist and his students find the bodies and take them aboard their ship. Both wake up and Jason goes on another rampage. This is when Jason becomes Uber Jason.MY THOUGHTSOh, this sucks on so many levels!–JaneesaWhile Jason kills 28 people, they are not overly graphic or too interesting in my opinion. I did like Adrienne’s (Kristi Angus) death by her head being dunk into liquid nitrogen and being smashed to pieces. Great death. And Janeesa’s (Melyssa Ade) death, being sucked through the grate (even though you only see the after effect), was more chilling than graphic. Being pulled through the gate like that is horrible. I think one of the flaws with this movie is the deaths and gore are all CGI and I’m more of a practical effects kind of girl.It’s sad to see this is Kane Hodder’s last time playing Jason in a Friday the 13th movie. They hired other actors for Freddy vs Jason and Friday the 13th 2009. Brodksy (Peter Mensah), is the only other male, besides Tommy, who kills Jason. I did like Rowan (Lexa Doig) as the final girl. She wasn’t weak and she did try to talk sense to people, even though they didn’t listen. I did actually like a few of the characters. So it was sad to see some of them die.I like UberJason. I like the combination human(?) and cybernetics. Imagine going up against this? But, unfortunately, most of the kills are before he gets upgraded. I also liked the VR/Simulation of 80’s campground with the two dumb girls. The sleeping bag scene was a nice throwback. That was funny. Nice to know you can distract Jason for a short time with this. LOLI like the sleekness of this movie but it lacked substance. I think this movie would have been so much better with practical effects instead of digital effects. Overall it’s better than Leprechaun in Space but it is definitely in the bottom few movies of the series. Unfortunately, it’s basically the end of the franchise. All we have left is Freddy vs Jason and the remake.The film was a critical and financial failure in its initial release in theaters, it made more than triple the cost of production in DVD and post-theater sales. Statistically, It is one of the most successful ‘Friday the 13th’ films.The film only had to make a couple seconds of cuts/alterations to earn an “R” rating, making it the least censored entry in the series.The film is included on Roger Ebert’s “Most Hated” list.Features considerably less nudity than the previous Friday the 13th/Jason movies.If you want to see my other Friday the 13th reviews, click here: Friday the 13th Franchise.Let’s get into the rankings:Kills/Blood/Gore: 2.5/5Sex/Nudity: 1/5Scare factor: 2/5Enjoyment factor: 3/5My Rank: 2.12/5IMDB: 4.4/10Rotten Tomatoes: critics: 1.9/10 audience: 2.5/10Letterboxd: 2.2/5",
      "review_date": "2021-12-20"
    },
    {
      "review_title": null,
      "content": "Was really feeling the setup to this, a good and inventive concept to freshen things up slightly. Of course in the future Jason gets taken onto the horniest ship possible for some easy targets. The CGI was all time classically bad. TheWas really feeling the setup to this, a good and inventive concept to freshen things up slightly. Of course in the future Jason gets taken onto the horniest ship possible for some easy targets. The CGI was all time classically bad. The cheesiness and pun loaded dialogue was awful but was refreshing compared to what we normally get.",
      "review_date": "2022-10-17"
    }
  ],
  "num_reviews": 54
}