{
  "title": "Nine Queens",
  "rating": 8.5,
  "release_date": "2002-04-19",
  "genre": [
    "Thriller",
    "Crime"
  ],
  "summary": "Set in Buenos Aires, this is the story of two small-time swindlers who team up after meeting in a convenience store and become involved in a half million-dollar deal.  (Sony Pictures Classics)",
  "critic_reviews": [
    "As tricky and satisfying as any of David Mamet's airless cinematic shell games. Mamet's films are all plot and no atmosphere; this one has a squalid, urban-greed-meets-the-gutter mood that lends its filigreed cleverness an unusually resonant kick.",
    "Deliciously funny and fiendishly clever con-man comedy that begins on a note of ingenuity that it then sustains with the tension of a high-wire act.",
    "A seductively structured and superbly acted suspenser that breathtakingly piles swindle upon scam without giving away the game until the very end.",
    "Wickedly clever drama.",
    "When you think you've figured out Bielinsky's great game, that's when you're in the most trouble: He's the con, and you're just the mark.",
    "The kind of movie that seduces you into becoming putty in its manipulative card-sharking hands and making you enjoy being taken in by its shameless contrivance.",
    "Two suggestions as you watch it: Never take anything for granted, and keep your hand on your wallet as you leave the theater.",
    "Elaborately layered movie about schemes and more schemes that pile up faster than chips on a blackjack table. The other half is realizing, about halfway through the film, that you won't figure it out until it's over.",
    "Bielinsky's movie builds like a poker game in which the players, having invested everything, cannot afford to fold.",
    "Has more twists than the Pacific Coast Highway and more layers than a stack of silver-dollar pancakes. If you can wrap your mind around one unlikely condition, the picture provides unalloyed pleasure for connoisseurs of cinematic con artists.",
    "It may not keep you guessing to the end, but there are enough surprises and wry revelations, right down to the last play, to make this a most satisfying cinematic confidence game.",
    "If the movie isn't true, it's at least true to itself. When Nine Queens spirals out of the realm of believability, we've already been won over enough that we don't care.",
    "Here it is -- another double cross for which you will, and should, hand over your few grubby bucks.",
    "Bielinsky's debut is a fine con picture, but at its best, it achieves even more, presenting the profession as a lifestyle with almost existential ramifications.",
    "Writer-director Fabián Bielinsky's devilish Nine Queens serves as further evidence that Argentina's film industry is at the forefront of a resurgent Latin American cinema.",
    "Leaves you feeling tense and terrific. It's fun to be fooled.",
    "If Nine Queens were a great film, instead of just a very good one, this rottenness would be so pervasive that it would burst the bounds of the plot; it would make us shudder.",
    "The actors are charismatic, particularly Ricardo Darin.",
    "A con within a con within a con. There comes a time when we think we've gotten to the bottom, and then the floor gets pulled out again and we fall another level.",
    "This cleverly structured Argentine heist movie isn't as original or ingenious as it tries to be, but it's fun watching the chicanery veer down one unexpected pathway after another.",
    "Fast-paced and unerringly surprising.",
    "It would be a crime in itself to reveal the surprises of Nine Queens, which provides two solid hours of corking entertainment.",
    "Often more ingenious in appearance than fact. The hunter-gets-captured-by-the-game scenario is predictable and the sequence of shell games does not, when reconsidered, actually add up.",
    "But for all the duplicitous minds playing games with each other on the screen, Nine Queens' best con artist turns out to be Bielinsky himself -- and his target is the audience.",
    "Bielinsky's feature debut is a smart, enormously entertaining thriller whose preposterous conclusion in no way diminishes the fun of getting there.",
    "Has a customarily jovial air but a deficit of flim-flam inventiveness."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Great con artist movie. Increasingly disturbing in its atmosphere of the pathetic mindset that motivates the pursuit of the wealth of others, but also showing that what goes around comes around.",
      "review_date": "2006-06-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A very clever plot that unfolds at the very last moment.",
      "review_date": "2007-03-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie. Funny but also dramatic. Has you wondering at every turn.",
      "review_date": "2007-01-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "For the most part I agree with other reviews here, but I would add that it seemed to go on a bit too long, to the point that the plot started to take a few turns for the sake of complexity in it's own right. And the ending left me cold. For the most part I agree with other reviews here, but I would add that it seemed to go on a bit too long, to the point that the plot started to take a few turns for the sake of complexity in it's own right. And the ending left me cold. Yes, I suppose it could happen, but it revealed layers to certain characters that had not been developed at all. Surprise for it's own sake. I wish the idea of the underdog as overlooked genius had been developed more completely.",
      "review_date": "2007-05-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's great fun to be fooled once more after expecting to be fooled.",
      "review_date": "2006-12-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A truly humorous, vibrant, delightful movie. It is engaging and never predictable -or very little.  At times it is disturbing, and occasionally moving, so the different elements created the best combination for a great film. The performancesA truly humorous, vibrant, delightful movie. It is engaging and never predictable -or very little.  At times it is disturbing, and occasionally moving, so the different elements created the best combination for a great film. The performances are outstanding! Particularly, Gaston Pauls' performance, he certainly is an excellent actor -and I heard he is directing too.The first time I watched  this film was here in Australia. Personally, I believe South American movies are better than Mexicans, but I guess Mexican movies are more promoted since, that is the dominant Hispanic culture in the States, where the blockbusters movies come from. Unfortunately, Americans do not really know much about South America and its diversity and assume that all Latin American culture is the same and it is not. Argentina is a country where most of the people comes from European background; thus, their sense of aesthetics is atypical in comparison to most of other Latin American countries. Argentina is a country where Arts and theatre have definitely the highest standards of Latin America. The very famous  Colon Theatre is in Buenos Aires. So, give Argentinian and other South American movies a go! I am sure you won't regret it. ...BTW, in case you wonder why I am so passionate about this movie, I have no Argentinian background..in fact, I am an Aussie, but I am merely stating the truth!",
      "review_date": "2012-02-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very heavy dialog which would indicate the slow development of this con movie. Half of the movie is setting up the characters and plot surrounding the 9 queens. Watching this movie VIA subtitles didn't keep me from missing anything- thats howVery heavy dialog which would indicate the slow development of this con movie. Half of the movie is setting up the characters and plot surrounding the 9 queens. Watching this movie VIA subtitles didn't keep me from missing anything- thats how slow it moved. But the final 30 or so minutes leaving the viewer guessing which way the ending will unfold. Glad I didn't give up on it.",
      "review_date": "2012-09-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Clever, funny, moving, catching and confusing. This movie has an excellent plot, brilliant performances, great scenes and a breathtaking finale. While most people can feel entertained with it, only an Argentinian person (especially the oneClever, funny, moving, catching and confusing. This movie has an excellent plot, brilliant performances, great scenes and a breathtaking finale. While most people can feel entertained with it, only an Argentinian person (especially the one who was born and raised in Buenos Aires) will fully understand it.",
      "review_date": "2014-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nNueve Reinas al principio es un poco confundido y despacio. Es decir, que todo vale la pena en verla al principio hasta el final porque veremos como los desiciones se desarrollen perfectamente. Lo recomiendo a gente que les gustan \"thriller\" y un poco de suspenso.",
      "review_date": "2015-11-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Una película que te hace pensar que conoce a los personajes bien. La búsqueda de la riqueza de otra persona puede convertirse en su propia caída. Esta película es inteligente y te mantiene entretenido ya que la historia se desarrolla.",
      "review_date": "2015-11-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best argentinian film i have ever seen\rThe writing is excellent, the acting is excellent (i love Ricardo Darin), the enviorment is excellent, the plot twist are excellent, the comedy and drama are excellent, and the whole movie can beThe best argentinian film i have ever seen\rThe writing is excellent, the acting is excellent (i love Ricardo Darin), the enviorment is excellent, the plot twist are excellent, the comedy and drama are excellent, and the whole movie can be timeless! I really love this movie!\rIts sad that the argentinian films arent that good as this one, and i say that because im argentinian and i enjoy more the american films. It definitely needs to be checked out.",
      "review_date": "2016-05-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dynamic and interesting. I expected something like that in the end, but it's a really good plot twist.",
      "review_date": "2018-02-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\",\",\".\".\".\".\".\".\".\".\"",
      "review_date": "2021-06-21",
      "source": "metacritic"
    }
  ],
  "num_reviews": 39
}