{
  "title": "Road to Perdition",
  "rating": 7.9,
  "release_date": "2002-07-12",
  "genre": [
    "Adventure",
    "Drama",
    "Thriller",
    "Crime"
  ],
  "summary": "A portrayal of two families whose fates are determined by the complex and often combative relationships between fathers and their sons.  (DreamWorks Pictures)",
  "critic_reviews": [
    "Overflowing with melancholy and tragedy, Road to Perdition is one of the most somber gangster pictures ever made.",
    "Mendes, in only his second feature (following the Oscar-winning \"American Beauty\"), has told this surprisingly resonant story with the potent, unrelenting fatalism of a previously unknown Greek myth.",
    "Has the juice to get its hooks into you, knock you off balance and keep you that way for two hours. It's a triumph for director Sam Mendes. The passion and precision of his Road work is staggering.",
    "A truly majestic visual tone poem.",
    "Sam Mendes' much-anticipated second effort after his Oscar-winning \"American Beauty\" finds him working in a very different key while displaying an even more pronounced attentiveness to tone, genre variations and artistic niceties.",
    "It's a genteel film with a gun in its pocket, but it's also a film with a universal chord of feeling that keeps welling up from the dark surfaces and violent byways of the plot-and a final confession that both warms the heart and chills the blood.",
    "The movie misfires: It's numbingly cold and soulless, and the zeitgeist stays far beyond its reach. But it's so visually striking you almost don't notice, its relentlessly somber mood has a certain masochistic appeal and, while hardly a career-redefining performance, Hanks is as winning as ever.",
    "Results are classy entertainment with little to interest women viewers but very shrewdly and cleverly put together, and probably more rewarding in long-range terms if you invest in Fox or Dreamworks than if you actually see the movie.",
    "This dark, almost mythic heart is what makes the film such an emotionally rich experience.",
    "Try as he might, (Hanks) is miscast in Road to Perdition, a partly satisfying gangster drama that amounts to less than the sum of its handsome parts.",
    "Paradoxically, the closer Mendes gets to his characters, the more remote Perdition becomes. One wishes that his film had as much heart as it does art.",
    "This is a remarkably good-looking near-corpse of a film, with a pulse that fades in and out.",
    "Romanticizes gangland Chicago, but no more so than other films set in the same period. And, like almost every movie about the mob, this one deals with themes of family, loyalty, and betrayal -- albeit without the intensity of some of the great ones (\"The Godfather,\" \"Goodfellas\").",
    "Choice, a luxury of the Corleones, is denied to the Sullivans and Rooneys, and choice or its absence is the difference between Sophocles and Shakespeare. I prefer Shakespeare.",
    "Subdued yet percolating with suppressed emotion.",
    "Paved with such good intentions and talent that it's sad to report this lavishly mounted gangster epic - the most serious-minded Hollywood film of the season - doesn't come close to living up to expectations.",
    "There's much that's simplistically grand, worthy, and fine in Perdition. If I yearn for less measured filmmaking that cries out with more reckless despair, it's because I think hell on earth is a meaner, much more interesting, and far less tidy cinematic place than Mendes trusts his audience to handle.",
    "Impressive yet always self-conscious, Perdition has more class and less sass than any movie in a while.",
    "I'm not sure Sam Mendes' latest is a masterpiece as so many critics are exclaiming but it is very probably the most artful and earnest drama ever adapted from a comic book.",
    "In the scenes between Hanks and Newman, we get glimpses of greatness.",
    "Mendes' second effort plays like a familiar song transposed to a minor key, a gangland fable soaked in portent and fatalism until its familiarity ceases to be an issue.",
    "There's something impressive and yet lacking about everything.",
    "It's a dirty, ugly, joyless world these fathers and sons live in, and for all the passion involved, of retribution and a father's fierce love, Perdition is as emotionally distant as Sullivan. The feelings are all there, just submerged.",
    "Its seriousness is welcome. It's also a burden the film can't completely surmount.",
    "Visually more coherent than \"American Beauty,\" but despite the burnished mahogany of Conrad Hall's cinematography, Mendes still doesn't quite know how to fill a frame. Like the Hanks character, he's a slow study: The action is stilted and the tabloid energy embalmed.",
    "A change from summer fare, but it doesn't make the picture compelling to watch. You won't find the detail of the \"Godfather\" films or the psychological complexities of Martin Scorsese's gangster movies. The plot holes are big enough to hide Al Capone's illicit millions in.",
    "Feels like a movie that keeps wishing it were something else: an award-winning play, a grand novel, an epic poem, anything but that populist thing we call a movie. Mendes makes movies as if he hates them.",
    "Law gives a doozy of a performance: He's fond of bulging his eyes, curling his head like a gargoyle, and displaying a set of rotten yellow teeth. This is some of the most flamboyantly bad acting since Brad Pitt in \"Twelve Monkeys\" (1995). An Oscar nomination would appear inevitable.",
    "Like a date who's primped too long to arrive at dinner with something to talk about, Road to Perdition is beautifully groomed and a perfect drag to be with."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I could not believe Road to Perdition was as good as it was. Sam Mendes' best movie, even better than American Beauty, and Skyfall (which is amazing that Skyfall didn't top it).",
      "review_date": "2014-09-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beautifully shot; I love the way the images almost match the cells in the graphic novel on which it",
      "review_date": "2013-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA very underrated film. Tom Hanks was the perfect actor for the role. It was a little hard taking him seriously after Forrest Gump. Anyway, the acting was excellent by Jude Law, Paul Newman, Daniel Craig and the rest of them. Great cast too. And because the acting is good so is the directing. My favorite scene was when Tom Hanks took out Paul Newman. Very emotional, especially with the silence. This film also tests your morals and values. Making you think, if you have a farther like Michael Sullivan, is he a good man? Your response might be, \"well, he was my farther\". Which is not the response I would give. A murderer is a murderer no matter who he is to you. In conclusion, Michael Sullivan was not a good man, no matter how much money he gives to the elderly. Although the message is not a responsible one it doesn't affect the rating of the movie. I didn't forget about the cinematography. The film was very well filmed. Loved the lightning. it gives it a more classic feel to the astonishing master piece. There's also something at the end that I wasn't expecting. If you haven't seen this film, go see it know. If you love great films you won't be disappointed.",
      "review_date": "2011-12-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While not as strong as American Beauty, Sam Mendes' Road to Perdition still succeeds thanks to strong performances by both Tom Hanks and Paul Newman, the breathtaking cinematography, and it's father-son themes.",
      "review_date": "2014-02-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was a absolutely stunning movie.They gave a great effort in every scene.They used the perfect proposition in the movie.The sequence.I liked the acting.Such a interesting movie.",
      "review_date": "2013-12-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Over the course of his illustrious career, which is well into its third decade, Hanks has played a cross-dresser, a man infatuated by a mermaid, the manager of a women's baseball team, a child in an oversized body, an idiot savant, an AIDSOver the course of his illustrious career, which is well into its third decade, Hanks has played a cross-dresser, a man infatuated by a mermaid, the manager of a women's baseball team, a child in an oversized body, an idiot savant, an AIDS patient, and a man stranded on a desert island. However, during more than four-dozen TV shows and movies, he has yet to challenge himself with the most difficult role for a well-liked actor - that of a bad-to-the-bone villain. He comes close in Road to Perdition, but doesn't quite reach that destination. For, although Michael Sullivan is a murderer for hire, he also has a conscience and a soul, loves his family, and kills not because he likes it but because it's his job. In short, Sullivan is portrayed sympathetically. The script's positive spin and Hanks' instant likeability ensure that Sullivan will be viewed not as a bad guy, but as a flawed man. There's some darkness there, to be sure, but not the pitch black of pure evil.\r The film, director Sam Mendes' eagerly anticipated follow-up to American Beauty, is based on the \"graphic novel\" (a term that is applied to a very long comic book printed on high-quality paper and sold in bookstores) by Max Allan Collins and Richard Piers Rayner. As with many adaptations from this medium, Road to Perdition stuns with its atmosphere and visuals, but arguably underachieves in some aspects of its characterization and plotting.\r Road to Perdition allows you to feel, smell, and breathe the air of 1930s Chicago. To some extent, Conrad L. Hall is as big a star as any of the actors, since there are occasions when the setting overwhelms the characters. At its heart, Road to Perdition is a little drama about fathers, sons, and the covenants they make and break. Rooney betrays Sullivan to save Connor, even though, to the very end, he loves Sullivan best. Sullivan risks everything, including his life and reputation, to protect Michael. A telling conversation between Rooney and Sullivan italicizes this point. \"And there is only one guarantee--none of us will see Heaven,\" says Rooney. \"Michael might,\" replies Sullivan. Rooney then notes that it's Sullivan's primary duty to make sure that happens.\r Road to Perdition romanticizes gangland Chicago, but no more so than other films set in the same period. And, like almost every movie about the mob, this one deals with themes of family, loyalty, and betrayal - albeit without the intensity of some of the great ones (The Godfather, Goodfellas). As was the case in American Beauty, Mendes illustrates how accomplished actors will respond to an assured director. Serious movie-goers embarking upon this journey will find that Road to Perdition leads to a satisfying destination.",
      "review_date": "2015-04-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Incredible film. Intense, methodical and extremely underrated, Road to Perdition is much more than a 1930s era gangster movie. Its incredibly well shot and you get to see a much colder side of Tom Hanks in this as he is a ruthless enforcerIncredible film. Intense, methodical and extremely underrated, Road to Perdition is much more than a 1930s era gangster movie. Its incredibly well shot and you get to see a much colder side of Tom Hanks in this as he is a ruthless enforcer for the mob. It covers alot of interesting themes, most notably morality, redemption and the relationship between a cold 30s era gangster and his young son.",
      "review_date": "2019-09-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Following a messy murder, hit man Michael Sullivan is betrayed by the man he called father, formidable Irish hood John Rooney. Leaving behind a murdered family and with a killer on his tail, Sullivan goes on the run, hungry for revenge.Following a messy murder, hit man Michael Sullivan is betrayed by the man he called father, formidable Irish hood John Rooney. Leaving behind a murdered family and with a killer on his tail, Sullivan goes on the run, hungry for revenge.\r Chastely violent and sombre, the movie is a blood-rush of visual magnificence (take a bow, cinematographer Conrad L. Hall). However, it's at times weighed down by its own gravity, and perhaps too eager to touch its forelock to Mendes' forebears, Scorsese and Coppola, not to mention John Ford's scope and Michael Powell's lushness.\r This is supremely crafted, grown-up moviemaking that never escapes its pulp origins. The themes are well worn and the structure predictable, but these are gangster cliches as gift-wrapped by Fortnum & Mason, and the grandeur of the film slips down like fine caviar.\r One of the best soundtracks and films ever made!",
      "review_date": "2015-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A story of betrayal and intrigue set in the context of the mob in the United States. While violent and ruthless at times, which is to be expected, the movie has a different side aswell: in short it is a tragedy. The movie will leave youA story of betrayal and intrigue set in the context of the mob in the United States. While violent and ruthless at times, which is to be expected, the movie has a different side aswell: in short it is a tragedy. The movie will leave you shocked. The soundtrack is hauntingly beautiful, as expected by composer Thomas Newman.",
      "review_date": "2018-05-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Probably the best gangster movie ever made. Tom Hanks' performance is Oscar-worthy.",
      "review_date": "2021-05-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "At first, I had never heard of this movie until just last year. And after watching it for the first time ever, I got to say, this was magnificently triumphant in everyway possible. I just don't understand why I had never heard of this movieAt first, I had never heard of this movie until just last year. And after watching it for the first time ever, I got to say, this was magnificently triumphant in everyway possible. I just don't understand why I had never heard of this movie before. This movie truly is underrated. Anyway, this movie has some tremendous acting from Tom Hanks, Tyler Hoechlin, Paul Newman, etc. But I was really surprised to see Daniel Craig (James Bond). He was fantastic playing Connor Rooney. Plus, I never really say this about a movie, but it really has some tremendous cinematography. Conrad L. Hall really knows how to get the perfect shots. Also, the storyline is exciting and captivating. It really keeps you interesting. Finally I have to say that Thomas Newman's original score is breathtaking. I mean, he's done some amazing music for other movies such as \"Shawshank Redemption\", \"Finding Nemo\", \"WALL-E\" and even \"Green Mile\". He really knows how to set the tone of the story. Overall, it's a fantastic gangster movie that needs to be more well known.",
      "review_date": "2013-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Once again, Sam Mendes manages to successfully craft a truly powerful drama with \"Road To Perdition\". The movie cohesively blends together very deep and moving themes that explore the repercussions of violence, the relationships betweenOnce again, Sam Mendes manages to successfully craft a truly powerful drama with \"Road To Perdition\". The movie cohesively blends together very deep and moving themes that explore the repercussions of violence, the relationships between fathers and sons, and the path to vengeance. With incredible performances from Tom Hanks and Paul Newman, an awesome soundtrack by Thomas Newman, and stunning camerawork by Conrad L. Hall, \"Road To Perdition\" remains, in short, superlative.",
      "review_date": "2012-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "hihhiigughihhiihhiihtdtdfugihiihihhihiihhihihiihihihigigguguigigiguguggiigigfyrdesesctghmkmbvfxzweuppkyfedghjkkj",
      "review_date": "2021-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "●¡●¡●¡●¡●¡●¡●¡¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".",
      "review_date": "2021-06-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%",
      "review_date": "2021-07-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Overall, this one is quite good. The acting, as expected from a cast of this kind of talent (Tom Hanks, Paul Newman, Jude Law, Daniel Craig, AND Stanley Tucci?!) is awesome. I was kind of worried about Hanks playing an against type character,Overall, this one is quite good. The acting, as expected from a cast of this kind of talent (Tom Hanks, Paul Newman, Jude Law, Daniel Craig, AND Stanley Tucci?!) is awesome. I was kind of worried about Hanks playing an against type character, but he did so very well and really stood out. In addition, the cinematography is breathtaking at almost every turn. Each image is beautifully crafted and not enough praise can be given to it. Road to Perdition is a definite slow burner, but never fails to completely grip you and really pays off at the end with a very touching, tragic, and moving, ending. For the most part, this one really rises above what you would expect from a typical gangster film and really finds a way to make all of these people seem entirely human. In addition, in a short period of time, all of the characters are well crafted, in large part thanks to a great script. Now, is this a great film? No, but it is certainly a damn good one that lives up to the hype for me.",
      "review_date": "2014-07-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Moody, methodical and measured, “Road to Perdition” takes a brooding look at the wages of sin and the heritage of violence among hoodlums during the dark days of Prohibition. Predominantly concerned about the passing of nasty traditions fromMoody, methodical and measured, “Road to Perdition” takes a brooding look at the wages of sin and the heritage of violence among hoodlums during the dark days of Prohibition. Predominantly concerned about the passing of nasty traditions from fathers to sons, and the strenuous effort of one killer to be redeemed through his boy, Sam Mendes’ much-anticipated second effort after his Oscar-winning “American Beauty” finds him working in a very different key while displaying an even more pronounced attentiveness to tone, genre variations and artistic niceties. Absorbing drama sees Tom Hanks fitting comfortably into the role of a morally aware bad guy, and while history has shown that one should never underestimate Hanks’ extraordinary B.O. draw, production’s autumnal feel and A-plus awards-season pedigree will make it fascinating to see if DreamWorks can pull off its gamble of putting this over as a summer attraction that can successfully duke it out with the more obvious popcorn pictures. Its seriousness notwithstanding, crime drama looks to play well with all audiences, although appeal to women could be somewhat limited.\r “Sons are put on this earth to trouble their fathers,” Illinois mob boss John Rooney (Paul Newman) confides to his top enforcer and surrogate son, Michael Sullivan (Hanks), a remark that has deep significance for both men and frames the concerns of the movie. Rooney, now an old man, has seen his biological son, Connor (Daniel Craig), go hopelessly astray into reckless (as opposed to “respectable”) criminality, while Sullivan still hopes he can somehow keep his two pre-teen boys from inheriting his bloody legacy, having kept the nature of his work a secret for as long as possible.\r It’s a potent theme, one that recalls not only “The Godfather,” with which “Perdition” shares “family” concerns, a dark look and period detailing, but also such explosive father-son dramas as “East of Eden.” The connections to Coppola and Kazan are telling in the precision performances, resonant settings and perhaps above all in the unhurried pacing; while crisply edited and unindulgent, Mendes’ work is gratifyingly old-school in its rejection of modern-day stylistic agitation, the better to achieve a slow but inexorable build to its climax.\r At the 45-minute point, they hit Chicago, beautifully evoked on modern La Salle Street with a modest amount of digital erasures to convey 1931. Sullivan offers to go to work for Al Capone’s (real-life) right-hand man, Frank Nitti (Stanley Tucci), for whom he has done jobs in the past. But Nitti’s ties to the Rooneys prove more binding, resulting in the Italian’s recruitment of gimpy freelance hitman (and professional crime-scene photographer) Maguire (Jude Law) to do Sullivan in.\r Film’s second half, then, consists largely of a slow cat-and-mouse chase, with Maguire pursuing his prey across the flat Midwestern rural landscapes while Sullivan tries to stay one step ahead, break through to the son to whom he’s never been close and even get the upper hand on the Capone gang. The latter he achieves through the ingenious ruse of robbing small-town banks where the Chicagoans have deposited “dirty” money, a sequence of events wonderfully and concisely expressed in a fluid montage of lateral left-to-right tracking shots intermingled with Maguire calmly rolling a quarter through his filthy fingers.\r In one very fine scene, Maguire catches up to Sullivan in a lonely roadside diner, where they exchange some cryptic remarks before the inevitable fireworks. Significantly less satisfying is a crucial encounter Sullivan has with a mob accountant (Dylan Baker) who inexplicably is running around the boondocks with incriminating financial documents in hand. After Sullivan manages to exact the rain-soaked revenge he has so patiently sought, climax and coda fulfill the promise of fateful inevitability while providing the right measure of final dramatic release.\r Practically every effect in the movie has been calibrated to the nth degree, from the nuances of the family dynamics and the color coordination of the decor to more subtle details such as laying a coffin on ice to keep the body cold but also to link with the winter snow outside, to emphasize the frigid ossification of the mobsters’ lethal behavior patterns. But the picture is able to deflect charges of preciousness by putting narrative and character first; it’s suffused in a distinct sense of aestheticism, but not artiness.\r Thomas Newman’s inventive score, while appropriately serious toward the end, seems intent upon lightening the mood earlier on with some overly busy and cutesy orchestrations and melodic doodlings. Of all the film’s accomplished creative contributions, certainly the most notable is Conrad Hall’s extraordinary cinematography.\r A complete and utter masterpiece!",
      "review_date": "2016-03-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As the rain falls heavily during pivotal points of Road To Perdition, the realisation that the thematic use of water represents what the film pertains to be, a cold-hearted and merciless journey, but while the film is visually beautiful fromAs the rain falls heavily during pivotal points of Road To Perdition, the realisation that the thematic use of water represents what the film pertains to be, a cold-hearted and merciless journey, but while the film is visually beautiful from the sincere art of cinematographer Conrad Hall, it always feels like it is turning the other way and won't let anybody in, with most of its main characters lacking emotional clarity towards their goal, perhaps this is a deliberate attempt to push the purpose and ideals of the Rock Island-based mob in depression era America, the setting of the film.\rWe are introduced to quite a unique and quieter role for Tom Hanks as he plays Mike Sullivan, a hitman for the mentioned mob, lead by the man who raised him as his own, Peter Rooney (Paul Newman). The film plays out after the hot-headed son of Rooney, Conor (Daniel Craig), who becomes to trigger happy and ends up creating some tragic moments in the film, and in very little time.\rMike must protect the remainder of his family, which involves running from his boss and the man who raised him. While the film deals with issues that where common ground in its era, it's main focus is that of the relationship between father and son, but although this should serve as the emotional standing point of the film, the plot lacks the proper pacing to have the viewer get emotionally engaged, we go from one scene to the next at such quickened pace that we barely have time to bathe in the excellence.\rThe performances are truly encapsulating, from Hanks to Newman and also the man on the other side, played by Jude Law, who brings an eery and commanding personality to his hitman character.\rBut the best moments consist of the cinematography which cannot be criticised at all, the whole tone of the film can be told through the lighting, the weather and the moments of despair as the rain pounds down upon our characters.\rThe film just moves a bit too quickly, with not enough time spent on the development of relationships within the film, and while some one on one conversations create some emotional moments, there is still a lacking in overall growth.\rIf the plot isn't enough to go see the film, it should be the wonderful filming that draws you in.",
      "review_date": "2013-08-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A deep sorrowful cinematic treasure.\rRoad to Perdition depicts the conflict of a father and son who's family is ripped apart by gang violence, Tom Hanks engulfs his audience with this realistic crime drama.",
      "review_date": "2013-11-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I could not believe Road to Perdition was as good as it was. Sam Mendes' best movie, even better than American Beauty, and Skyfall (which is amazing that Skyfall didn't top it).",
      "review_date": "2021-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is so good-intentioned, well-shot, and well-acted that it is hard to say anything bad about it even when matched up against a predacessor like American Beauty.",
      "review_date": "2012-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Following a messy murder, hit man Michael Sullivan is betrayed by the man he called father, formidable Irish hood John Rooney. Leaving behind a murdered family and with a killer on his tail, Sullivan goes on the run, hungry for revenge.Following a messy murder, hit man Michael Sullivan is betrayed by the man he called father, formidable Irish hood John Rooney. Leaving behind a murdered family and with a killer on his tail, Sullivan goes on the run, hungry for revenge.\r EARLY in \"Road to Perdition,\" a period gangster film that achieves the grandeur of a classic Hollywood western, John Rooney (Paul Newman), the crusty old Irish mob boss in a town somewhere outside Chicago, growls a lament that echoes through the movie like a subterranean rumble: \"Sons are put on the earth to trouble their fathers.\"\r In surveying the world through Michael Jr.'s eyes, the movie captures, like no film I've seen, the fear-tinged awe with which young boys regard their fathers and the degree to which that awe continues to reverberate into adult life. Viewed through his son's eyes, Sullivan, whose face is half-shadowed much of The time by the brim of his fedora, is a largely silent deity, the benign but fearsome source of all knowledge and wisdom. An unsmiling Mr. Hanks does a powerful job of conveying the conflicting emotions roiling beneath Sullivan's grimly purposeful exterior as he tries to save his son and himself from mob execution. It's all done with facial muscles.\r In the flashiest of many visually indelible moments, a cluster of gangsters silhouetted in a heavy rain are systemically mowed down on a Chicago street in a volley of machine-gun flashes that seem to erupt out of nowhere from an unseen assassin. But no shots or voices are heard. The eerie silence is filled by the solemn swell of Mr. Newman's score. It is one of many scenes of violence in which the camera maintains a discreet aesthetic distance from the carnage.\r Road to Perdition is a true tour de force! A remarkable film!",
      "review_date": "2015-12-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A really good Tom Hanks film with hood acting and strong plot and script + good music and direction.",
      "review_date": "2019-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When Road To Perdition hit theaters, it was critically acclaimed and was eventually nominated for six Academy Awards. While it was a great film, it was very dark and fails to deliver the emotional impact that it intended to have on it'sWhen Road To Perdition hit theaters, it was critically acclaimed and was eventually nominated for six Academy Awards. While it was a great film, it was very dark and fails to deliver the emotional impact that it intended to have on it's audience. In the 1930s, Michael Sullivan (Tom Hanks) is a family man living in the suburban mid-west. By all accounts, he is a normal man, who is hiding one very dark secret, he is a hit-man for an organized crime syndicate. His secret is safe and life continues on as usual until one day, his son, Michael Jr. (Tyler Hoechlin), witnesses his father execute someone. Sullivan assures his bosses that everything is fine and his son won't say anything, but when has the mob ever taken that chance? Sullivan and his family are targeted for elimination and only he and his son manage to escape to Chicago, where he plans his revenge. As with most films based on a novel, the story here is top notch and very well written. Tom Hanks is the premier actor of our time, a man who will be remembered for centuries, but was he really the right choice to play Michael Sullivan? Hanks has many amazing skills as an actor, but playing such a cold, sedentary character, Hanks is unable to use his many tools and gives a performance that is very dry. The audience simply doesn't relate to Sullivan the way they relate to his son, and that brings the emotional impact of the film way below what it was intended to be. Tyler Hoechlin is fairly well known now, but when he got this role, it was his first, and he beat out over 10,000 other kids to get it. I don't know who any of those other kids were, but Hoechlin couldn't have had much competition, because he was out of this world good. It's a shame that the Academy rarely recognizes kids and that Paul Newman got the Best Supporting Actor nod over Hoechlin, because this kid is really the only one who comes off in a way that the writers originally intended. Road To Perdition was a tremendous story and was full of award winning actors, but the star power was more important to the producers, then finding actors who fit the characters as they were written. Aside from that and a painfully predictable ending, that you have to see coming, this was a pretty good film. I loved the setting and how dark it was, as well as the originality of a film that takes places nearly 60 years ago. I just find it ironic that in a cast full of Academy Award winning actors, it's a kid who steals the show.",
      "review_date": "2014-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well acted and certainly easy to sit through and watch. I felt that the pay off near the end wasn't as satisfying as it could have been. It felt that they sort of took a cheap, easy way out to wrap things up. It wasn't bad but it wasn't trulyWell acted and certainly easy to sit through and watch. I felt that the pay off near the end wasn't as satisfying as it could have been. It felt that they sort of took a cheap, easy way out to wrap things up. It wasn't bad but it wasn't truly satisfying. Still an enjoyable movie but could have been much better.",
      "review_date": "2016-11-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Such a intense storyline, good acting and overall a great movie that i recommend to everyone! I watched it with my dad and he loved it, even more than i did!",
      "review_date": "2016-10-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beautifully shot, well-acted and dull.  This is a movie that is so in awe of itself that it appears to be staring at it stunned, like a deer in the headlights.",
      "review_date": "2013-07-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe year is 1931, and dapper immigrant mobsters are running an icy America with big guns and deadly honour codes. You know, the stuff of cinematic pearls since time immemorial, and the canvas on which Max Allan Collins and Richard Piers Rayner painted their graphic novel (posh comic book).\r It's this emotional exploration of the gangster myth that Yank-fixated Brit Sam Mendes was drawn to after his blistering debut, 'American Beauty'. 'Perdition' translates as 'damnation', and with wry whimsy is also the name of the elusive Midwest town planned as sanctuary for enforcer Michael Sullivan's young son, desperate to find love in his cold-blooded father.\r This is a moody, pristine study of paternal woe, localised to an Illinois chapter of the mob run by Newman's ageing patriarch, a man tormented by a trigger-happy dolt of an heir, Connor (Craig, slimeballing with relish). His is the devilry that rips apart Sullivan's life, sending echoes up to Chicago, in the form of a slick Stanley Tucci as real-life Capone general, Frank Nitti. Gangsters are the ultimate dysfunctional family.\r Chastely violent and sombre, the movie is a blood-rush of visual magnificence (take a bow, cinematographer Conrad L. Hall). However, it's at times weighed down by its own gravity, and perhaps too eager to touch its forelock to Mendes' forebears, Scorsese and Coppola, not to mention John Ford's scope and Michael Powell's lushness.\r Comparisons with 'The Godfather', 'The Untouchables' and 'Miller's Crossing' will fly, but the true reference point here is 'Unforgiven'. Sullivan's journey into a hell of his own making is pure William Munney. It falls short of Eastwood's classic, but not by very much.\r Mendes conducts with a grace the material can't quite handle, and we do not hear clearly the earnest notes of the designated quest for salvation. Look, it's Hanks and Newman together! As crooks! Worry not, though, we've still got Jude Law as the real scumbag, a Weegee-styled hit man with stained molars and a porkpie hat, who shoots his victims with both gun and camera.\r Hanks - hunkered down in a heavy skin with a threadbare moustache and the rigid posture of moral deep-freeze - works hard not to force things. Neither hero nor anti-hero, for the audience it proves too taxing to shake the notion that this is Forrest Gump doing his best Clint Eastwood. Amoral? Ambiguous? Evil? Too big a leap.\r Newman, meanwhile, is electrifying. Coating Rooney in dead eyes and a soft smile, his conflation of the jovial grandfather with flints of absolute darkness is a performance that chimes with (and betters) Brandon's Don Corleone. His is the crowning speech, power's inevitable corruption writ heavy across his soul: 'This is the life we chose... And there is only one guarantee: none of us will see heaven'.\r When he and Sullivan finally cross swords, Mendes pulls out a moment of transcendent cinema: a speechless sequence washed in the film's signature downpour, lit to throw Tommy guns and fedoras into stark silhouettes - you watch agape as simple celluloid transforms into poetry. Mendes has the eye, if not yet the ear, to be amongst the greats he honours so much. The luxury is that this is only film two.\r Verdict\rThis is supremely crafted, grown-up moviemaking that never escapes its pulp origins. The themes are well worn and the structure predictable, but these are gangster cliches as gift-wrapped by Fortnum & Mason, and the grandeur of the film slips down like fine caviar.",
      "review_date": "2015-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Following a messy murder, hit man Michael Sullivan is betrayed by the man he called father, formidable Irish hood John Rooney. Leaving behind a murdered family and with a killer on his tail, Sullivan goes on the run, hungry for revenge.Following a messy murder, hit man Michael Sullivan is betrayed by the man he called father, formidable Irish hood John Rooney. Leaving behind a murdered family and with a killer on his tail, Sullivan goes on the run, hungry for revenge.\r EARLY in \"Road to Perdition,\" a period gangster film that achieves the grandeur of a classic Hollywood western, John Rooney (Paul Newman), the crusty old Irish mob boss in a town somewhere outside Chicago, growls a lament that echoes through the movie like a subterranean rumble: \"Sons are put on the earth to trouble their fathers.\"\r n surveying the world through Michael Jr.'s eyes, the movie captures, like no film I've seen, the fear-tinged awe with which young boys regard their fathers and the degree to which that awe continues to reverberate into adult life. Viewed through his son's eyes, Sullivan, whose face is half-shadowed much of the time by the brim of his fedora, is a largely silent deity, the benign but fearsome source of all knowledge and wisdom. An unsmiling Mr. Hanks does a powerful job of conveying the conflicting emotions roiling beneath Sullivan's grimly purposeful exterior as he tries to save his son and himself from mob execution. It's all done with facial muscles.\r In the flashiest of many visually indelible moments, a cluster of gangsters silhouetted in a heavy rain are systemically mowed down on a Chicago street in a volley of machine-gun flashes that seem to erupt out of nowhere from an unseen assassin. But no shots or voices are heard. The eerie silence is filled by the solemn swell of Mr. Newman's score. It is one of many scenes of violence in which the camera maintains a discreet aesthetic distance from the carnage.\r Road to Perdition is a true tour de force! A remarkable film!",
      "review_date": "2015-04-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Moody, methodical and measured, “Road to Perdition” takes a brooding look at the wages of sin and the heritage of violence among hoodlums during the dark days of Prohibition. Predominantly concerned about the passing of nasty traditions fromMoody, methodical and measured, “Road to Perdition” takes a brooding look at the wages of sin and the heritage of violence among hoodlums during the dark days of Prohibition. Predominantly concerned about the passing of nasty traditions from fathers to sons, and the strenuous effort of one killer to be redeemed through his boy, Sam Mendes’ much-anticipated second effort after his Oscar-winning “American Beauty” finds him working in a very different key while displaying an even more pronounced attentiveness to tone, genre variations and artistic niceties. Absorbing drama sees Tom Hanks fitting comfortably into the role of a morally aware bad guy, and while history has shown that one should never underestimate Hanks’ extraordinary B.O. draw, production’s autumnal feel and A-plus awards-season pedigree will make it fascinating to see if DreamWorks can pull off its gamble of putting this over as a summer attraction that can successfully duke it out with the more obvious popcorn pictures. Its seriousness notwithstanding, crime drama looks to play well with all audiences, although appeal to women could be somewhat limited.\r “Sons are put on this earth to trouble their fathers,” Illinois mob boss John Rooney (Paul Newman) confides to his top enforcer and surrogate son, Michael Sullivan (Hanks), a remark that has deep significance for both men and frames the concerns of the movie. Rooney, now an old man, has seen his biological son, Connor (Daniel Craig), go hopelessly astray into reckless (as opposed to “respectable”) criminality, while Sullivan still hopes he can somehow keep his two pre-teen boys from inheriting his bloody legacy, having kept the nature of his work a secret for as long as possible.\r It’s a potent theme, one that recalls not only “The Godfather,” with which “Perdition” shares “family” concerns, a dark look and period detailing, but also such explosive father-son dramas as “East of Eden.” The connections to Coppola and Kazan are telling in the precision performances, resonant settings and perhaps above all in the unhurried pacing; while crisply edited and unindulgent, Mendes’ work is gratifyingly old-school in its rejection of modern-day stylistic agitation, the better to achieve a slow but inexorable build to its climax.\r At the 45-minute point, they hit Chicago, beautifully evoked on modern La Salle Street with a modest amount of digital erasures to convey 1931. Sullivan offers to go to work for Al Capone’s (real-life) right-hand man, Frank Nitti (Stanley Tucci), for whom he has done jobs in the past. But Nitti’s ties to the Rooneys prove more binding, resulting in the Italian’s recruitment of gimpy freelance hitman (and professional crime-scene photographer) Maguire (Jude Law) to do Sullivan in.\r Film’s second half, then, consists largely of a slow cat-and-mouse chase, with Maguire pursuing his prey across the flat Midwestern rural landscapes while Sullivan tries to stay one step ahead, break through to the son to whom he’s never been close and even get the upper hand on the Capone gang. The latter he achieves through the ingenious ruse of robbing small-town banks where the Chicagoans have deposited “dirty” money, a sequence of events wonderfully and concisely expressed in a fluid montage of lateral left-to-right tracking shots intermingled with Maguire calmly rolling a quarter through his filthy fingers.\r In one very fine scene, Maguire catches up to Sullivan in a lonely roadside diner, where they exchange some cryptic remarks before the inevitable fireworks. Significantly less satisfying is a crucial encounter Sullivan has with a mob accountant (Dylan Baker) who inexplicably is running around the boondocks with incriminating financial documents in hand. After Sullivan manages to exact the rain-soaked revenge he has so patiently sought, climax and coda fulfill the promise of fateful inevitability while providing the right measure of final dramatic release.\r Practically every effect in the movie has been calibrated to the nth degree, from the nuances of the family dynamics and the color coordination of the decor to more subtle details such as laying a coffin on ice to keep the body cold but also to link with the winter snow outside, to emphasize the frigid ossification of the mobsters’ lethal behavior patterns. But the picture is able to deflect charges of preciousness by putting narrative and character first; it’s suffused in a distinct sense of aestheticism, but not artiness.\r Thomas Newman’s inventive score, while appropriately serious toward the end, seems intent upon lightening the mood earlier on with some overly busy and cutesy orchestrations and melodic doodlings. Of all the film’s accomplished creative contributions, certainly the most notable is Conrad Hall’s extraordinary cinematography.\r A complete and utter masterpiece!",
      "review_date": "2016-03-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Early in \"Road to Perdition,\" a period gangster film that achieves the grandeur of a classic Hollywood western, John Rooney (Paul Newman), the crusty old Irish mob boss in a town somewhere outside Chicago, growls a lament that echoes throughEarly in \"Road to Perdition,\" a period gangster film that achieves the grandeur of a classic Hollywood western, John Rooney (Paul Newman), the crusty old Irish mob boss in a town somewhere outside Chicago, growls a lament that echoes through the movie like a subterranean rumble: \"Sons are put on the earth to trouble their fathers.\"\r Rooney is decrying the trigger-happy behavior of his corrupt, hot-headed son, Connor (Daniel Craig), who in a fit of paranoid rage impulsively murdered one of Rooney's loyal lieutenants. The ear into which Rooney pours his frustration belongs to Michael Sullivan (Tom Hanks), his personal hit man, who witnessed the killing. An orphan whom Rooney brought up as a surrogate son and who has married and fathered two boys, Sullivan is in some ways more beloved to Rooney than his own flesh and blood. He is certainly more trustworthy.\r But as the film shows, Rooney's bitter observation about fathers and sons also works in reverse: fathers are eternal mysteries put on the earth to trouble their sons as well as teach them. The story is narrated by the older of Sullivan's two boys, 12-year-old Michael Jr. (Tyler Hoechlin), who in a prologue establishes the movie's tone and setting (most of the events take place over six weeks in the winter of 1931) and invites us to decide, once his tale has been told, whether his father was \"a decent man\" or \"no good at all.\"\r \"Road to Perdition,\" which opens today nationwide, is the second feature film directed by Sam Mendes, the British theatrical maestro who landed at the top of Hollywood's A-list with his cinematic debut, \"American Beauty.\" The new movie re-teams him with Conrad L. Hall, the brilliant cinematographer responsible for that film's surreal classicist shimmer. With \"Road to Perdition\" they have created a truly majestic visual tone poem, one that is so much more stylized than its forerunner that it inspires a continuing and deeply satisfying awareness of the best movies as monumental \"picture shows.\"\r Because Sullivan is played by Mr. Hanks, an actor who invariably exudes conscientiousness and decency, his son's question lends the fable a profound moral ambiguity. \"Road to Perdition\" ponders some of the same questions as \"The Sopranos,\" a comparably great work of popular art, whose protagonist is also a gangster and a devoted family man. But far from a self-pitying boor lumbering around a suburban basement in his undershirt, Mr. Hanks's antihero is a stern, taciturn killer who projects a tortured nobility.\r In surveying the world through Michael Jr.'s eyes, the movie captures, like no film I've seen, the fear-tinged awe with which young boys regard their fathers and the degree to which that awe continues to reverberate into adult life. Viewed through his son's eyes, Sullivan, whose face is half-shadowed much of the time by the brim of his fedora, is a largely silent deity, the benign but fearsome source of all knowledge and wisdom. An unsmiling Mr. Hanks does a powerful job of conveying the conflicting emotions roiling beneath Sullivan's grimly purposeful exterior as he tries to save his son and himself from mob execution. It's all done with facial muscles.\r Yet Sullivan is also beholden to his own surrogate father, who has nurtured and protected him since childhood. Mr. Newman's Rooney, with his ferocious hawklike glare, sepulchral rasp and thunderous temper, has the ultimate power to bestow praise and shame, to bless and to curse. The role, for which the 77-year-old actor adopts a softened Irish brogue, is one of Mr. Newman's most farsighted, anguished performances.\r Those shades are matched by Thomas Newman's symphonic score, which infuses a sweeping Coplandesque evocation of the American flatlands with Irish folk motifs.\r In the flashiest of many visually indelible moments, a cluster of gangsters silhouetted in a heavy rain are systemically mowed down on a Chicago street in a volley of machine-gun flashes that seem to erupt out of nowhere from an unseen assassin. But no shots or voices are heard. The eerie silence is filled by the solemn swell of Mr. Newman's score. It is one of many scenes of violence in which the camera maintains a discreet aesthetic distance from the carnage.\r Although \"Road to Perdition\" is not without gore, it chooses its bloodier moments with exquisite care. The aftermath of another cold-blooded murder is seen only for an instant in the swing of a mirrored bathroom door. Another is shown as a reflection on a window overlooking an idyllic beach on which a boy frisks with a dog. Here the overlapping images evoke more than any words the characters' tragic apprehension of having to choose between two simultaneous, colliding worlds. One is a heaven on earth, the other hell.",
      "review_date": "2016-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Taken on a scene-by-scene basis, Road to Perdition has enough Oscar-caliber performances and cinematography to lessen the impact of the miscast lead and relentlessly somber tone.",
      "review_date": "2020-03-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie with very boring and monotonous plot and great cast. The plot is very boring, and looks quite unrealistic. Mafia in it the movie is kept for society of idiots. In the movie characters upon have no development of characters, well theThe movie with very boring and monotonous plot and great cast. The plot is very boring, and looks quite unrealistic. Mafia in it the movie is kept for society of idiots. In the movie characters upon have no development of characters, well the only thing that is shown - it is changes of interaction of the father and the son that they I know each other better. The movie which excellent cast and a good game of Tom Hanks has nothing else besides.",
      "review_date": "2018-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "more salvation than damnation..Road To Perdition\n\n3 And A Half Out Of 5\n\nRoad To Perdition is a character driven dramatic thriller about a relationship between a father and a son which is brewed at a critical stage and higher stakes.more salvation than damnation..Road To Perdition3 And A Half Out Of 5Road To Perdition is a character driven dramatic thriller about a relationship between a father and a son which is brewed at a critical stage and higher stakes. Despite of portraying an essential chapter or episode of a young kid, the writing wisely accounts in the bonding of him with his father from the scratch. And it is so well fed to the audience that despite of its dark tone and poignant theme, there is a cathartic experience on each tiny moments of them. One of the primary strengths of the feature is its uncertainty and unexpected outcome that it evaluates keeping the audience tangled in its world where the sense of urgency too factors in a lot. Each supporting character gets enough range and space to factor in and work effectively which shows how the makers were chewing the characters properly and were not in any rush. The costumes designing is out of the park and so is the finely detailed production design but what draws in most of the attention is the metaphorical cinematography that is just pure passion throughout the course of it. An elevating background score, glorifying camera work and perfect editing are too some of its rich details. The writing is simple as it can be but sensible and justifying as you've never seen. Mendes; the director, at the heart of it, has done a tremendous work on executing such a balanced feature. Hanks has never been more impactful with a excellent support from Newman, Craig and Law. Jaw dropping visuals, whistle-blowing dialogues and a heartbreaking chemistry are the high points of the feature that makes you look twice. Road To Perdition is more salvation than damnation since it has such a risky tone to explore at let along triumph over it; a masterstroke by the makers.",
      "review_date": "2018-08-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Before there was The Road and God of War PS4, there was this movie. The cinematography in this movie is just on point, the music score is beautiful, and you have great talented actors in this movie. This is a really good movie but it's veryBefore there was The Road and God of War PS4, there was this movie. The cinematography in this movie is just on point, the music score is beautiful, and you have great talented actors in this movie. This is a really good movie but it's very underrated and not known today.",
      "review_date": "2019-01-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An underrated masterpiece. Tom Hanks, Tyler Hoechlin, Jude Law and - especially - Paul Newman toast us with great performances in a film with cohesive and touching development, plus a brilliant direction, masterful cinematography ...An underrated masterpiece. Tom Hanks, Tyler Hoechlin, Jude Law and - especially - Paul Newman toast us with great performances in a film with cohesive and touching development, plus a brilliant direction, masterful cinematography ... everything in this film works very well (at least in my opinion).",
      "review_date": "2018-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A gorgeous looking film by Sam Mendes, Road To Perdition is unique in that it is probably the only film with Tom Hanks where he plays a character we don't like, in fact we hate him here. Road to Perdition romanticizes gangland Chicago, but noA gorgeous looking film by Sam Mendes, Road To Perdition is unique in that it is probably the only film with Tom Hanks where he plays a character we don't like, in fact we hate him here. Road to Perdition romanticizes gangland Chicago, but no more so than other films set in the same period. And, like almost every movie about the mob, this one deals with themes of family, loyalty, and betrayal - albeit without the intensity of some of the great ones (The Godfather, Goodfellas). As was the case in American Beauty, Mendes illustrates how accomplished actors will respond to an assured director. Serious movie-goers embarking upon this journey will find that Road to Perdition leads to a satisfying destination. For fans of Tom Hanks this is a great opportunity to see the great man play a negative shade. For others the gorgeous cinematography should suffice.(Watch it for the negative shady Hanks).",
      "review_date": "2019-10-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I've made clear in previous reviews that I'm not really interested in \"mob\" or \"mafia\" movies, especially the ones by Martin Scorsese. This movie hits along those lines, but is more interesting and less boring.I generally like the 30sI've made clear in previous reviews that I'm not really interested in \"mob\" or \"mafia\" movies, especially the ones by Martin Scorsese. This movie hits along those lines, but is more interesting and less boring.I generally like the 30s America aesthetic, fitting, because the movie actually takes place in that period. I just felt let-down by the last half-hour, where what is exactly done must've gone over my head. Also the photographer has, like, three appearances, but still seems extremely underused. Coming to think of it, I'd have rather wanted to see a movie about that guy than the guy Tom Hanks portrays. Both of them aren't even the protagonists, though, that role belongs to Tom Hanks' in-movie son, who is actually likeable and not annoying all the time. The wonders of modern technology.If you want to indulge in some prohibition-era movie aesthetic, with gangsters, drama, and road trips, this movie is something for you, if you want to see a movie that's actually challenging and interesting, I'd recommend something else. though.",
      "review_date": "2021-02-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I could not believe Road to Perdition was as good as it was. Sam Mendes' best movie, even better than American Beauty, and Skyfall (which is amazing that Skyfall didn't top it).",
      "review_date": "2021-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》***********************************************",
      "review_date": "2021-07-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beautifully shot, well-acted and dull. This is a movie that is so in awe of itself that it appears to be staring at it stunned, like a deer in the headlights.",
      "review_date": "2022-02-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Oustanding.",
      "review_date": "2005-11-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A brilliant film, actors are very good. A very simple movie, but very stylised also. It's realy a great film.",
      "review_date": "2006-08-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film should have been better and it could have been.The Jude Law charactor is a waste,the screen writer should have stayed closer to the novel.Hanks and Newman were both up to the task and their talents were largely wasted.Read the This film should have been better and it could have been.The Jude Law charactor is a waste,the screen writer should have stayed closer to the novel.Hanks and Newman were both up to the task and their talents were largely wasted.Read the novel,it's a much better story. It's a good example of someone pushing the art of film making while botching the story within the film.Bill C.",
      "review_date": "2005-10-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing, it was nominated for 7 academy awards. but it was missing from the most important category, BEST PICTURE! it was strongly underrated, this is one of the best gangter films i've seen, great acting, perfect cinematography, a masterpeice!",
      "review_date": "2005-10-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I like that movie. They created a convincing world of the early 30s. But the best part of the movie are the characters: many of them are convincing, only Daniel Craig as Connor is clearly a bad guy. The music is unforgettable.",
      "review_date": "2022-04-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "6.5/10Hanks was great, Thomas Newman score was beautiful, the story was interesting, but the movie never really improve, it's like a drum who played the same beat over and over again, causing me personally bored, once it improve, only couple6.5/10Hanks was great, Thomas Newman score was beautiful, the story was interesting, but the movie never really improve, it's like a drum who played the same beat over and over again, causing me personally bored, once it improve, only couple of time works but the rest is not, overall Road To Perdition was surprisingly not a really good movie.",
      "review_date": "2021-09-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "a meh at best, no idea why people keep overrating this movie, sam mendes has made way better movies",
      "review_date": "2022-02-21",
      "source": "metacritic"
    }
  ],
  "num_reviews": 77
}