{
  "title": "Talk to Her",
  "rating": 8.2,
  "release_date": "2002-11-22",
  "genre": [
    "Drama"
  ],
  "summary": "A story about the friendship between two men, about loneliness and the long convalescence of wounds provoked by passion. (Sony Pictures Classics)",
  "critic_reviews": [
    "When it's over, the realization of how much the movie means to you really sinks in; you can't get it out of your heart.",
    "The actors are outstanding, illuminating four different views of loneliness. But it's Camara's tour-de-force performance that anchors the film, that shocks and unnerves us.",
    "One of Almodóvar's most challenging pictures, jumping around in time and sending a large gallery of characters through a wide variety of situations --  will find him again at the peak of his powers.",
    "Like everything else in this superb work of art, ''Shrinking Lover'' is exquisitely Almodóvarian. It's funny, tender, a little shocking, and it pays homage to what we know about movies: that they can move us beyond words.",
    "Like taking a drug everyone says is dynamite and impatiently wondering why the heck it's not kicking in. The kick in fact turns out to be real, and as powerful as advertised, but it doesn't necessarily hit you in any way you anticipated.",
    "Talk to Her is as melodramatic -- and, sporadically, as funny -- as any Almodóvar comedy, but its mood is one of muted, aching loneliness, while the color scheme leans less to hot reds and magentas than to rich, elegant shades of ochre.",
    "No one can blend melodrama and heightened emotion with laugh-out-loud wackiness the way Almodóvar does.",
    "Great filmmakers push their ideas and characters to the limit, unafraid of consequences - which is what Pedro Almodovar has done in Talk To Her, his latest film and, I think, his best.",
    "No director since Fassbinder has been able to evoke such complex emotions with such problematic material.",
    "Almodovar loves the human flesh -- indeed, one of his films is titled \"Live Flesh\" -- and with the quietly subversive Talk to Her, he utilizes it not just as mere decoration but weaves with it textured themes of powerlessness, love and obsession.",
    "The marvelous new Talk To Her has elements that wouldn't have seemed out of place in an Almodóvar film of 20 years ago",
    "A movie of technical skill and rare depth of intellect and feeling.",
    "Moments of almost unbearable beauty.",
    "This quiet yet jolting meditation on love, obsession, loneliness, friendship and fate has the quality to entrance you through a first viewing, and compel you to take its themes and characters home with you for further consideration.",
    "Pure cinematic intoxication, a wildly inventive mixture of comedy and melodrama, tastelessness and swooning elegance, bodies with the texture of fresh peaches, and angular faces Picasso would have loved.",
    "Almodóvar has made a powerfully moving film about men who think they want to lose themselves in their women, then are startled to realize that they're the ones who have been comatose.",
    "It is at once warmly humanistic and boldly innovative, raising philosophical questions but not answering them.",
    "Isn't quite as accessible or as deeply moving as his masterpiece, \"All About My Mother.\" It's a tad too self-consciously a work of art for that. But it's still a must-see for anyone who's halfway serious about film.",
    "This rich, emotionally complex movie finds Almodóvar venturing into trickier, more fascinating territory, even if his themes.",
    "Almodovar also manages to conclude the film on a hopeful note, and one that will have many audience members wishing that he will someday return to tell more about these characters.",
    "This ode to the peculiar strength and flexibility of love, romantic and platonic, is simultaneously perverse, overwrought, deeply creepy and truly moving, a high-wire act that finds humor in the grotesque and hope in emotional malformation.",
    "It feels strangely slight for Almodovar, but there's a richness that draws us in -- There's so much going on beneath the surface that you can hardly take it all in.",
    "An engaging, well-crafted and imaginative meditation on solitude and communication.",
    "Odd, moving, strained cinematic poetry.",
    "This is Almodovar's stab at serious drama, and the result is bizarre and affecting but also unsettling in ways that the filmmaker may not have intended.",
    "Talk to Her is much better than Almodóvar's \"bad\" movies. But it never soars as freely as his best ones do -- it has a very trim, manicured wingspan.",
    "The movie is occasionally funny, always very colorful and enjoyably overblown in the traditional Almodóvar style; and the performances -- especially Javier Cámara as the gentle, sweet-spirited Benigno -- are exquisitely tender and moving.",
    "I do wonder why a gay director's best-known movies about straight guys, Talk to Her and \"Tie Me Up! Tie Me Down!,\" suggest that satisfying relationships with women are most easily achieved if they're 1) unconscious or 2) in bondage.",
    "The movie's cinematography is sumptuous, in its own intimate way. But all that's glorious about this film is the flesh tones. There isn't enough flesh and blood.",
    "Talk to Her affects some people very deeply, while others, like me, find it high-grade kitsch.",
    "The key scene --  is typical of the film's fanciful narrative approach but also its grating pretentiousness.",
    "Initial strangeness inexorably gives way to rote sentimentality and mystical tenderness becomes narrative expedience."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "It is a film of magic - whether it is diabolism or wonder, I can't say, but it is there, and it will captivate you. Almodovar has created an unmined dramatic space for us to dwell in, and knocks any preconceived notions of morality andIt is a film of magic - whether it is diabolism or wonder, I can't say, but it is there, and it will captivate you. Almodovar has created an unmined dramatic space for us to dwell in, and knocks any preconceived notions of morality and certainty out of his twisted world, and carries us along into it.",
      "review_date": "2010-08-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a story about the friendship between two men, about solitude, about the long process of healing wounds provoked by passion, about communication and the lack of it in relationships. About cinema as an ideal vehicle in the This is a story about the friendship between two men, about solitude, about the long process of healing wounds provoked by passion, about communication and the lack of it in relationships. About cinema as an ideal vehicle in the realationships between people. Watching as the cinema as storytelleing can stop the time and sets in the life of who´s telling the story and who listens it. \"Talk to Her\" is a movie about the joy of tell a story and about the words as a weapon of escape of loneliness, death and madness, that madness so close to tenderness and common sense that can´t be so different from reality. In \"Talk to Her\" there are moments of cinematic perfection, of sublime blend of music and image (as the great cateano veloso singing and the whole almodovarian crew listening --cecilia roth, marisa paredes, paz vega et al--) and moments of unbearable beauty. This is the second great masterpiece of a genius and the best example of narrative as cinema and viceversa.",
      "review_date": "2006-06-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "[**Potential Spoilers**]  With this mature Almodovar work, gone is the glitz of ten years ago, but not the subversion. If you want a movie that neatly mirrors your own set of prejudices, forget about Talk to Her. The attraction of Almodovar[**Potential Spoilers**]  With this mature Almodovar work, gone is the glitz of ten years ago, but not the subversion. If you want a movie that neatly mirrors your own set of prejudices, forget about Talk to Her. The attraction of Almodovar is that he tempers outré sensibilities with the exhausting disciplines of the true cineaste. Suspect situations that would turn to mush in most hands are transformed by the precise emotions elicited from loyal ensembles of actors. The contrivance here is the unlikely friendship struck up by two fellows watching over their comatose loved ones at a hospital. Of course, they?ve already met by chance, at an avant-garde Pina Bausch performance, the one (Benigno) having been struck by the other?s (Marco) tears of feeling. If Almodovar has been esteemed for his depictions of women, here the men?s deepening friendship takes centre stage, filmed against masculine red-earth hues. Marco is infuriated when Benigno wants to wed the apparently brain-dead woman he nurses every day, even more so by his moderate suggestion that they would get along as well as most married couples. Nonetheless, he stands by his (disintegrating) man to the bittersweet end. The most outrageous gag is the reworking of The Incredible Shrinking Man as the ultimate back-to-the-womb fantasy. The subtle joke occurs when the ashen doctor first emerges from the suite of Marco?s girlfriend, gored senseless while bullfighting. In every other movie, he?d break the bad news in the time-honoured fashion. Almodovar?s twist is that the hapless medic can?t get a word in edgeways, as his intended audience of loved ones dissolves into a Spanish maze of side-conversations. ",
      "review_date": "2003-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This one is flawless. Personally I didn't watch much out of Hollywood movies but this certainly can convince that the best stuff is not only Hollywood, The underlying messages of loneliness, of friendship tends to take you by surpriseThis one is flawless. Personally I didn't watch much out of Hollywood movies but this certainly can convince that the best stuff is not only Hollywood, The underlying messages of loneliness, of friendship tends to take you by surprise sometime. Certainly can see why it's so critically acclaimed. And my score reminds me that I'm not that much of a critic.",
      "review_date": "2010-11-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a horror movie starring a Spanish Norman Bates. Look out. This is a horror movie starring a Spanish Norman Bates. Look out. This is a horror movie starring a Spanish Norman Bates. Look out.",
      "review_date": "2016-06-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "En esta ocasión Almodóvar explora al mismo tiempo la mentalidad masculina y la femenina, teniendo como conexión una tragedia irreversible, y un lazo profundo de amistad sin posibilidad de una salida feliz. La corta secuencia de cine mudo esEn esta ocasión Almodóvar explora al mismo tiempo la mentalidad masculina y la femenina, teniendo como conexión una tragedia irreversible, y un lazo profundo de amistad sin posibilidad de una salida feliz. La corta secuencia de cine mudo es de antología y prácticamente, el corazón de la película.",
      "review_date": "2022-04-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Going through Almodovar movies chronologically is like watching evolution.  Each one is more polished, incisive and interesting than the last.  This has more developed characters and chemistry than I have seen.  A female bullfighter with aGoing through Almodovar movies chronologically is like watching evolution.  Each one is more polished, incisive and interesting than the last.  This has more developed characters and chemistry than I have seen.  A female bullfighter with a phobia of snakes should be corny but it is endearing, like Indiana Jones.  Even a girl in a coma is developed.  The photography has more layers and blends with the music nicely.  By not using high profile actors, the focus is on the broader image.  Definitely his best movie up to that point.",
      "review_date": "2020-02-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I liked this mysterious film so much, I wrote a whole book explaining it (Look for \"Dreamtalking\" by Noam Traub on Amazon).",
      "review_date": "2017-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is my third favourite Almodovar movie. Marco is a journalist specializing in tourist guides, Benigno a generous, perfect nurse. The latter has been taking care of Alicia, a (former) dancer, in a coma for four years. Marco has an affairThis is my third favourite Almodovar movie. Marco is a journalist specializing in tourist guides, Benigno a generous, perfect nurse. The latter has been taking care of Alicia, a (former) dancer, in a coma for four years. Marco has an affair with Lidya, a torera, who soon reaches Alicia in the same hospital, reduced in turn to a coma. Benigno talks to his patient as if he were conscious, he tells her everything, daily life, thoughts, shows. Marco, less imaginative, just watches crying. Benigno (never had women, perhaps gay), teaches him to \"talk to her\", in fact.The film takes unpredictable, disconcerting, alarming paths that I won't spoiler. This movie has a great melodrama power inside, all Almodovar poetry is evident here and his style is so clear and beautifully shown. One of his best, whitout a doubt.",
      "review_date": "2021-11-14",
      "source": "metacritic"
    }
  ],
  "num_reviews": 41
}