{
    "title": "The Bourne Identity",
    "rating": 7.6,
    "release_date": "2002-06-14",
    "genre": [
        "Action",
        "Adventure",
        "Mystery",
        "Thriller"
    ],
    "summary": "Robert Ludlum's international thriller gets an edgy 21st century spin from director Doug Liman.",
    "critic_reviews": [
        "A first-rate thriller with grit and intrigue to spare.",
        "Blisteringly fast, Bourne also has a strong or striking supporting actor around every corner: Chris Cooper, Brian Cox, Julia Stiles and Clive Owen in roles that range from meaty to amazingly small.",
        "One of those rare thrillers where the cops aren't fools, villains don't turn stupid at crucial moments, and career assassins seldom miss targets.",
        "Somehow the movie works like a clock. Its scenes and sensibility are all more than familiar, but it exudes a kind of nostalgic spy-movie charm and, at the same time, is so fresh and free of the usual thriller nonsense that it all seems to be happening for the first time.",
        "The full-throttle approach of director Doug Liman (Swingers, Go) is impressive.",
        "There isn't a dull or dumb moment in this movie.",
        "The result is an escapist fantasy that is -- Damon's and Potente's persuasive performances aside -- as weightless and inconsequential as a musical. And at the moment every bit as welcome.",
        "The movie is a generic paranoid espionage fantasy, but its proportions are refreshingly correct. It moves quickly, adroitly, and without fuss.",
        "This is an entertainment that really entertains because any number of interesting and unexpected choices were made, starting with the selection of Doug Liman as the director.",
        "Entertaining, handsome and gripping, The Bourne Identity is something of an anomaly among big-budget summer blockbusters: a thriller with some brains and feeling behind it, more attuned to story and character than to spectacle.",
        "The Bourne Identity, like its hero, triumphs through sheer unreflective professionalism. It is, by today's standards, a modest thriller, with a self-contained storyline and with very few big special effects.",
        "Like its protagonist, it never hands you explanations on a silver platter, and it makes you think a bit, something far too few thrillers do these days.",
        "Liman packs enough firepower into The Bourne Identity to please the summer action fan, including a reshot climax that contains one of the niftier stunts I've seen recently. The centerpiece action sequence is a bravura car chase through Paris, yet the moments that bookend it are equally impressive.",
        "The result is not only entertaining but also refreshing, a shameless crowd-pleaser with a healthy cynicism about itself.",
        "A skillful action movie about a plot that exists only to support a skillful action movie. The entire story is a set-up for the martial arts and chases. Because they are done well, because the movie is well-crafted and acted, we give it a pass. Too bad it's not about something.",
        "Nicely paced and fits the bill for those in search of two hours of spy-based action and martial arts. The movie has credibility issues, but none are insurmountable in the name of entertainment.",
        "Damon, starring in his first full-fledged action pic, brings a determined bearing and believability to the proceedings.",
        "Though it's clearly meant to be character-driven, the movie is thrown out of whack by a total lack of chemistry between the leads, and some great acting (Clive Owen, Chris Cooper, Brian Cox) on the side.",
        "Director Doug Liman -- the hip skipper of \"Swingers\" and \"Go\" -- makes all the familiar dirty business seem fun and almost human. In these dog days, Bourne earns what passes as high praise: It doesn't suck.",
        "A lean, deftly shot, well-acted, weirdly retro thriller that recalls a raft of '60s and '70s European-set spy pictures. There are even moments when you hope it could turn into a modern \"Charade.\"",
        "The problems with Damon's character are the problem with the movie: It's about plot mechanics, not heart and soul.",
        "This savvy adaptation of Robert Ludlum's action-clogged 1980 bestseller benefits from the fact that the filmmakers were smart enough to throw out most of the book's preposterous spills and thrills and concentrate instead on its intriguing central character.",
        "May be a bloodless piece of thriller craftsmanship, but at a time when craft has become negligible, its efficiency and whipcrack timing are increasingly uncommon virtues.",
        "As for Damon, this may not be a performance so much as an appearance. But he cares so utterly, it works.",
        "Makes one interested in seeing the inevitable sequel, but one is also left to somewhat question the worth of sitting through this first installment.",
        "It has a few whispers of intrigue, but at the heart of The Bourne Identity lies a dispiriting paradox: The more that Jason Bourne learns about himself, the less arresting he seems.",
        "Films borrow tricks from pictures made years ago -- try to watch Bourne without thinking of \"The Manchurian Candidate.\"",
        "Next time Damon will have to find a worthier vehicle. As the intended start of a franchise, The Bourne Identity is a bit of a bust.",
        "All this is diverting but also borderline dull.",
        "Banal big-budget adaptation of Robert Ludlum's 1980 espionage thriller.",
        "The best audiences can hope for is that they, too, get amnesia and forget they ever saw this movie."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "The Bourne Identity is in many ways your classic spy thriller and in many ways not your classic spy thriller. The ways in which it subverts it genre largely rest in the blending of mystery with the action spy thriller genre. The mysteriousThe Bourne Identity is in many ways your classic spy thriller and in many ways not your classic spy thriller. The ways in which it subverts it genre largely rest in the blending of mystery with the action spy thriller genre. The mysterious nature of the film and its protagonist really help it to become different than your classic spy movie. However, it still is a spy movie, right down to the over-the-top European location. This does not mean it is not a good spy movie, however. Endlessly entertaining with brilliant action set pieces, added in with the twists and turns of every good spy movie, The Bourne Identity really does it job well. Mat t Damon, Franka Potente, and Chris Cooper, are all very good in their roles and it is no surprise as to why this one exploded the way it did. Overall, very satisfied.",
            "review_date": "2015-10-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A cool action movie with some boring scenes and it looks even better than The Fugitive. This is the movie that starts the long spy series of Jason Bourne.",
            "review_date": "2012-08-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A good action flick with an interesting story but it never really captures you in the way it should have but its good enough to make you wanna see the sequel. Matt Damon was a solid lead and the rest of the cast was good as well. I enjoyed it.",
            "review_date": "2012-01-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film defines what makes a great action thriller. The pacing is perfect, with no fillers but just under 2 hours of epicness. The balance between action and story, suspense and cinematic scenes is perfect. The story is very easy to follow,This film defines what makes a great action thriller. The pacing is perfect, with no fillers but just under 2 hours of epicness. The balance between action and story, suspense and cinematic scenes is perfect. The story is very easy to follow, it's direct, intriguing and filled with great voice acting from Matt Damon and almost perfect direction. There's not a single moment in this film where you are not immersed. You don't want to take your eyes off it, whereas a lot of action films tend to go for all-out explosions and miss out on the story. You can switch on and comeback to it later and still enjoy, like the Transporter films, but this one is so gripping and almost perfect in every way. All it's really missing is a bit more action and scenes to go in between - basically a tiny bit longer. On the whole it's a must watch.",
            "review_date": "2012-08-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is a near perfect espionage thriller. It delivers on every side: the story is strong, perhaps shallow at first glance but efficient the way it is told; the actors are truly great, Damon acts exactly the way it should be and PotenteThis movie is a near perfect espionage thriller. It delivers on every side: the story is strong, perhaps shallow at first glance but efficient the way it is told; the actors are truly great, Damon acts exactly the way it should be and Potente is particularly honest in her performance.",
            "review_date": "2012-07-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A rather original action film that is helped along the way with the interesting plot and solid acting by the cast. It's one of few modern day action films that is actually good.",
            "review_date": "2013-01-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Starts the series of with a huge bang. The Bourne Identity is not only action packed and tense, but also features a very, very smart script. This one's not just for the action junkies.",
            "review_date": "2013-01-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"The Bourne Identity\" is a 2002 film directed by Doug Limon and starring Matt Damon. The film follows the story of Jason Bourne (Damon), an amnesiac desperately attempting to discover more about his true identity while simultaneously\"The Bourne Identity\" is a 2002 film directed by Doug Limon and starring Matt Damon. The film follows the story of Jason Bourne (Damon), an amnesiac desperately attempting to discover more about his true identity while simultaneously embedding himself in a convoluted conspiracy involving the CIA. Now, when I had first heard \"The Bourne Identity\"'s fairly original and intriguing premise, I was already expecting this movie to be great. Did it disappoint? No. No, it did not. This is one of those movie's that just cannot fail - it has a rock solid story crafted by one of the most intelligent authors of our time, a brilliant screenplay written by one of Hollywood's most sought after screenwriters, and an intensely entertaining lead performance. \"The Bourne Identity\" and it's sequels are often credited with setting the par for most spy thrillers of the past decade - Does it deserve that credit? I believe so, for I have seen a multitude of films with similar concepts that have come out since \"The Bourne Identity\"'s release. However, most, if not all, of the movies that have tried to replicate what The \"Bourne\" movie's have done, cannot reach the level of intrigue that each of the \"Bourne\" movies have reached - and they promptly fall flat in comparison. That being said, everything about this film, beit it's fighting sequences, it's car chase, or it's intense cinematography has made an impact on the spy thriller genre, and the modern film industry, as a whole. All in all, I felt that \"The Bourne Identity\" was an intensely entertaining thriller with a large amount of intelligence clearly woven it.",
            "review_date": "2012-11-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Idenity is a solid action flick that had a good plot. The movie started strong but towards the end I didn't know what Damon's character goal was. He wanted answers but  he didn't really know what he was looking for in which turnedThe Bourne Idenity is a solid action flick that had a good plot. The movie started strong but towards the end I didn't know what Damon's character goal was. He wanted answers but  he didn't really know what he was looking for in which turned to me not knowing what to look for.",
            "review_date": "2013-08-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Compelling and exciting, The Bourne Identity follows a sturdy plot with great characters and a swiftly paced thrill ride. It also has the perfect amount of suspense and a big scope to cement it as a success.",
            "review_date": "2014-11-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "the bourne identity is a tremendous film with suspense, action and a gripping story to take you on a thrill ride of fun and brilliant film-making the film also has in my opinion Matt Damon's best performance yet my only flaw with this film isthe bourne identity is a tremendous film with suspense, action and a gripping story to take you on a thrill ride of fun and brilliant film-making the film also has in my opinion Matt Damon's best performance yet my only flaw with this film is that the plot can get a tad convoluted at times.",
            "review_date": "2015-10-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Identity is an interesting, well-made and thrilling start to the Jason Bourne franchise. Matt Damon fits the title role perfectly, and the script manages to focus on both action and character development. It's certainly the leastThe Bourne Identity is an interesting, well-made and thrilling start to the Jason Bourne franchise. Matt Damon fits the title role perfectly, and the script manages to focus on both action and character development. It's certainly the least propulsive of the franchise, but nevertheless, there are still plenty of impressive action scenes to keep you on the edge of your seat. Overall, The Bourne Identity kicks off the Bourne franchise with a fun spy thriller that features a charismatic performance from Matt Damon.",
            "review_date": "2016-07-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A well paced, well acted, well directed, and well told, The Bourne identity does a solid job when it comes to making an action thriller. This movie is very enjoyable to watch.",
            "review_date": "2015-11-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A solid action-suspense package that gets the job done. The movie proceeds in a precision fashion that keeps you entertained while managing not to insult your intelligence. All in all, The Bourne Identity is a refreshing departure from theA solid action-suspense package that gets the job done. The movie proceeds in a precision fashion that keeps you entertained while managing not to insult your intelligence. All in all, The Bourne Identity is a refreshing departure from the typical largesse of big-budget action films.",
            "review_date": "2016-04-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Identity is a fun thriller that has great pacing, great action scenes, and a wonderful mystery. There is a lot of downtime and dead air that really doesn't add to the tension, and only slows the movie down. The dead air holds thisThe Bourne Identity is a fun thriller that has great pacing, great action scenes, and a wonderful mystery. There is a lot of downtime and dead air that really doesn't add to the tension, and only slows the movie down. The dead air holds this first installment in the Bourne franchise back from being truly great, but it is memorable nonetheless.",
            "review_date": "2019-07-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beginning of story about Jason Bourne. Quite second-grade movie, though has been shot 2002, but throughout all movie it seemed that a setting of the movie of the end of the 80th and the beginning of the 90th years. The movie obviously looksBeginning of story about Jason Bourne. Quite second-grade movie, though has been shot 2002, but throughout all movie it seemed that a setting of the movie of the end of the 80th and the beginning of the 90th years. The movie obviously looks as B-movie, only Matt Damon takes out all movie. As the beginning of a series of movies isn't bad, but as separately taken movie - it is very mediocre.",
            "review_date": "2018-05-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Identity is a mindless hack and slash action film.  There is an attempt at embedding some sort of intrigue into the plot, but it's really just an excuse for more boring violence. This has its appeal for certain audiences, but inThe Bourne Identity is a mindless hack and slash action film.  There is an attempt at embedding some sort of intrigue into the plot, but it's really just an excuse for more boring violence. This has its appeal for certain audiences, but in the modern day when time is such a precious resources this movie just doesn't have value.",
            "review_date": "2018-11-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I will give it a 6 out of 10 because I found it too slow paced for an action movie, the first third of the movie was very entertaining but then after that it started to get tiring.",
            "review_date": "2012-08-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Can't believe this has weakest rating out of trilogy. Wonderful movie with scenes to remember. Two other ones are just too fast and without decent plot. Nice work, one of my favorites",
            "review_date": "2008-05-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Bourne Identity\" is a serious action movie that looks cool, but creating a game off of this might have been a better choice.",
            "review_date": "2011-09-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a 9 out of 10 movie. Acting pretty good. Matt Damon is really good at Jason Bourne. Action is pretty great. Which leads to the great story. It's really good. Score is good to. Overall, this is a great start to a great series of JasonThis is a 9 out of 10 movie. Acting pretty good. Matt Damon is really good at Jason Bourne. Action is pretty great. Which leads to the great story. It's really good. Score is good to. Overall, this is a great start to a great series of Jason Bourne movies. You should watch it.",
            "review_date": "2012-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "From start to finish, this is a great movie. It's got just the right amount of suspense, just the right amount of action, just the right amount of character development. I don't have a single complaint about this movie.",
            "review_date": "2011-09-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fairy tale about glamorous boy for little girls....All very primitive and predictableIf you want spy history try \"24 hours\" series.",
            "review_date": "2018-04-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Oh my god. Love it. Espesiall since it is Taylor Lautners favorite movie. I heart Taylor Lautner. Must watch again. Gotta go because I am going to watch the movie again. Thankyou for reading my review. Goodbye.",
            "review_date": "2011-10-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Love this movie.",
            "review_date": "2013-01-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "So you wake up and don't remember a thing.  What do you do?  Some of the Users see this movie as an action movie with boring scenes.  I think it's more of a mystery movie, \"who am I\", with some action scenes.  Yowie, I don't know who I am soSo you wake up and don't remember a thing.  What do you do?  Some of the Users see this movie as an action movie with boring scenes.  I think it's more of a mystery movie, \"who am I\", with some action scenes.  Yowie, I don't know who I am so why are people trying to kill me?  As he tries to discover who he is, he finds he has skills, like spy training CIA skills.  I don't have many DVDs but this one is in my collection.",
            "review_date": "2015-11-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is truly great. I expected it to be good, not this good! Jason Bourne is ready to start his adventure in this great series. It was worth it to watch.",
            "review_date": "2017-05-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The start of the Jason Bourne adventures is very entertaining and interesting.",
            "review_date": "2018-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The story of a man (Matt Damon), salvaged, near death, from the ocean by an Italian fishing boat. When he recuperates, the man suffers from total amnesia, without identity or background... except for a range of extraordinary talents inThe story of a man (Matt Damon), salvaged, near death, from the ocean by an Italian fishing boat. When he recuperates, the man suffers from total amnesia, without identity or background... except for a range of extraordinary talents in fighting, linguistic skills and self-defense that speak of a dangerous past. He sets out on a desperate search-assisted by the initially rebellious Marie (Franka Potente) - to discover who he really is, and why he's being lethally pursued by assassins. Expertly blending genre formula with bursts of unexpected wit, The Bourne Identity is an action thriller that delivers -- and then some. I'll give The Bourne Identity an A.",
            "review_date": "2018-08-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Gahhh! Can't resist! MUST... WATCH... AGAIN...",
            "review_date": "2005-08-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was intense and at the same time, made you think. I loved it!",
            "review_date": "2009-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An incredibly satisfying thriller because it's so smartly done - all the usual action movie cliches are absent, and thank goodness. Damon is very good. Franka Potente is outstanding. One of my favorites of recent years. It deserves more An incredibly satisfying thriller because it's so smartly done - all the usual action movie cliches are absent, and thank goodness. Damon is very good. Franka Potente is outstanding. One of my favorites of recent years. It deserves more credit for its intelligence and sheer entertainment value.",
            "review_date": "2005-10-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As far as action movies go, The Bourne Identity has a charm like few others. Its world is simply more real. The people look closer to average, vehicles are worn down, and the clothing isn't gawdy or fashionable. Another movie would have As far as action movies go, The Bourne Identity has a charm like few others. Its world is simply more real. The people look closer to average, vehicles are worn down, and the clothing isn't gawdy or fashionable. Another movie would have slick cars and immaculately groomed cast members who would be CG'd through their fight scenes. Here, so much of what you see feels genuine that it's easier to fall into, and easier to like the characters, for what they are. Damon in fits particularly well into the role of amnesiac assassin Jason Bourne. Once the action kicks in it doesn't try to reach the bar that The Matrix or X-Men set, but rather follows a more realistic, but still entertaining kind of action. And because it's unafraid to be what it is, it's its own kind of cool. If you have this is one hand and another action flick in the other, do yourself a favor and pick this.",
            "review_date": "2007-03-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I loved this movie. It had lots of action and suspense. I think Matt Damon did a great job bringing Jason Bourne to life. I can't wait till the third one.",
            "review_date": "2006-10-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the first and strongest of the Bourne trilogy, based on the novels by Robert Ludlum. It deviates greatly from the books but is no less of a film for that. It",
            "review_date": "2008-03-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Unconscious man gets rescued in the sea by fishing boat, amnesia, has \"special\" skills, someone trying to kill him, befriends German girl, tries to find out what's going on & who he is.Sharp action-thriller which has its fair share of twistsUnconscious man gets rescued in the sea by fishing boat, amnesia, has \"special\" skills, someone trying to kill him, befriends German girl, tries to find out what's going on & who he is.Sharp action-thriller which has its fair share of twists and turns and outright action with some great fight choreography.Strong cast helps it & Maaaaatttt Daaaammmon is very believable as Jason Bourne. Good turn too from Franka Potente, Chris Cooper & Clive Owen as the deadly sniper.",
            "review_date": "2010-09-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Identity is a great action movie that kicked off a decent franchise. This movie is a lot of fun, mainly because it sees Jason Bourne discovering his own powers along with the audience. The film also features some strongThe Bourne Identity is a great action movie that kicked off a decent franchise. This movie is a lot of fun, mainly because it sees Jason Bourne discovering his own powers along with the audience. The film also features some strong performances and an unforgettable car chase. That said, it doesn't quite achieve the same heights as it's masterpiece sequel The Bourne Supremacy... But then again, not many action movies do.",
            "review_date": "2013-04-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Found floating in the Atlantic Ocean Jason Bourne awakes to find he has no memory of who he is.Unfortunately Bourne has enemies and they certainly know who he is. The hero with Amnesia story is not exactly original but The Bourne IdentityFound floating in the Atlantic Ocean Jason Bourne awakes to find he has no memory of who he is.Unfortunately Bourne has enemies and they certainly know who he is. The hero with Amnesia story is not exactly original but The Bourne Identity tells a more interesting story than most as Bourne fights to find out why everyone seems to want him dead. The movie whips along at a cracking pace featuring all manner of exciting fight scenes and car chases meaning the two hours will fly by.",
            "review_date": "2013-07-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "First, this is not an adaptation the Robert Ludlum novel that it's supposedly based on.  It's a completely original, standalone work, with the only similarity being the central character, while everything else built around him from scratch byFirst, this is not an adaptation the Robert Ludlum novel that it's supposedly based on.  It's a completely original, standalone work, with the only similarity being the central character, while everything else built around him from scratch by the director and screenwriter.  And as that standalone work it's an excellent action thriller that delivers on every front.",
            "review_date": "2011-07-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Brilliant action film with great story, screenplay and music. Damon nails the role.",
            "review_date": "2019-04-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Though it's not quite the incredible film critics were making it out to be, The Bourne Identity manages to entertain the whole way through, and it's hard to imagine someone being bored during the film. A body of a man is found floating in theThough it's not quite the incredible film critics were making it out to be, The Bourne Identity manages to entertain the whole way through, and it's hard to imagine someone being bored during the film. A body of a man is found floating in the ocean. This man has no idea who he is, who he was, or anything about his past. His ability to speak many different languages and provide detailed summaries about surroundings and people by just glancing at them suggests he was part of something big. Turns out, his name is Jason Bourne. And he's an assassin, and a good one. But now, he's on the run with the girl, in order to figure out more about his past, and not die. As I watched the film, I was constantly reminded of another action film I saw recently: The Fugitive. The Fugitive was a 90's film with Harrison Ford, who plays a man named Richard Kimble, falsely charged with the murder of his beloved wife. He escapes prison, and is on the lam. There are many reasons why The Fugitive is better than The Bourne Identity. For one, The Fugitive is more emotionally involving. We care about Dr. Kimble, and we feel his loss. The Bourne Identity offers no reason for us to care about any of the characters, so it's hard to root for either side. Also, The Fugitive is much more frantic. Dr. Kimble's race from the cops never really stops until the very end. Jason Bourne stops every so often, as if to take a breather from the action. We don't feel the thrill with The Bourne Identity, like we did with The Fugitive (and the generic chase scenes don't help). The film lacks smarts as well. The Fugitive was a nice little mystery alongside an action movie, but The Bourne Identity requires little thinking. We learn Jason Bourne's main role within half an hour. But The Bourne Identity isn't as bad as I'm making it out to be. There's lots of action. Maybe even more so than The Fugitive. There's gun fights, and fist fights. There's some exciting (and somewhat unrealistic) escape scenes as well. The film also benefits from a solid cast. Never for a minute will you question a lack of quality in the performances. Matt Damon provides a frustrated man who lost his memory. Franka Potente acts convincingly as an even more confused and worried Marie Kreutz, who wants nothing more then to get out of this mess. The rest of the cast is equally strong. I usually don't comment about the score in action films because they're usually very run-of-the-mill. This one was a little bit better than that, but the over-powering drums keep me from praising it too much. The main flaw with The Bourne Identity, however, was it's lack of a final fight. No cinematic duel to the death. In The Fugitive, we had a manic fight/hide-and-seek/out wit game going, that was heart-pounding. We get no such thing in The Bourne Identity, which surprised me, considering the fact that this was in fact, a movie about action. The Bourne Identity is perfect for teenage boys. It's fun, it's got some good action scenes, and a strong cast. It entertains from start to finish. It does suffer from problems though, such as a lack of thrill, no cinematic duel, and no need to think. But in the end, good outweighs the bad, and I'm ready for the sequel.",
            "review_date": "2012-04-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Identity makes for a fantastic thriller, with the pivotal positive element of the film being that Jason Bourne doesn't care for violence: he only uses it when provoked.",
            "review_date": "2012-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "[1/4 The Bourne Legacy Marathon]\r The Bourne Identity [2002] - 3.5/5\rA solid action film, with some well-made action setpieces and fight choreography.",
            "review_date": "2012-08-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Near perfection action/drama film. The action is not overblown and focuses on intelligent aspects instead of lots of explosions/gunfire, with the winter scene in the countryside being a prime example.\r Great dialogue, intricate plot, greatNear perfection action/drama film. The action is not overblown and focuses on intelligent aspects instead of lots of explosions/gunfire, with the winter scene in the countryside being a prime example.\r Great dialogue, intricate plot, great pacing, great character dynamics (like the changing relationship between the two main antagonist characters).\r And the film does a great job of showing how Bourne completely outsmarts his opponents instead of using brute force.\r It has some small flaws but is otherwise one of my favorite action films.",
            "review_date": "2016-09-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "From the beginning of the movie to the end of it I always felt suspense. From the 3 movies following it the story continues although the story is kind of confusing if you don't understand it from the beginning, or don't have someone toFrom the beginning of the movie to the end of it I always felt suspense. From the 3 movies following it the story continues although the story is kind of confusing if you don't understand it from the beginning, or don't have someone to properly explain it.",
            "review_date": "2015-01-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Awesome movie for James Bond fans! It is better for younger audiences in terms of suggestive content, but still pretty violent. Good story, characters, and stunts, not really a downside I could find, but it's still not the best movie I'veAwesome movie for James Bond fans! It is better for younger audiences in terms of suggestive content, but still pretty violent. Good story, characters, and stunts, not really a downside I could find, but it's still not the best movie I've seen. Still a good 9 out of 10!",
            "review_date": "2013-04-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The ultimate start to one of the best action movie trilogies, the Bourne Identity satisfies your action cravings, and gives you a dose of life on the run in foreign countries, something the majority of movies don't cover.",
            "review_date": "2013-09-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Identity is the beginning of one of the best trilogies in recent memory and perhaps even of all time. This movie is really something special.",
            "review_date": "2013-10-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A brilliant novel forged into an equally mesmerizing film.\rThe Bourne Identity cruises with ease as Matt Damon plays a humble but skilled agent in search of his own name.",
            "review_date": "2013-11-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Compelling and exciting, The Bourne Identity follows a sturdy plot with great characters and a swiftly paced thrill ride. It also has the perfect amount of suspense and a big scope to cement it as a success.",
            "review_date": "2013-12-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The acting was really good and the story was interesting.The characters were different from all the other Hollywood big budget films.The only thing The Bourne Identity is undeniably a classic.",
            "review_date": "2016-07-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Yeah, its OK Damon is a dweeb and doing action movies isn't going to change it. Its a poor man's James Bond.Nothing new to see here, cliche amnesia plot, some OK set pieces.Over all its pretty mediocre.\nIf you haven't seen it yet, you'reYeah, its OK Damon is a dweeb and doing action movies isn't going to change it. Its a poor man's James Bond.Nothing new to see here, cliche amnesia plot, some OK set pieces.Over all its pretty mediocre.If you haven't seen it yet, you're not missing a whole lot.",
            "review_date": "2019-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I remember how I loved The Bourne Identity when it first came out, the plot, the action, I thought everything was great about this film was riveting but then I saw it again and I dozed off for a little bit.\r The film doesn’t really holds upI remember how I loved The Bourne Identity when it first came out, the plot, the action, I thought everything was great about this film was riveting but then I saw it again and I dozed off for a little bit.\r The film doesn’t really holds up today but weirdly enough the plot and the action is style good. The fight scenes and the stunts are still impressive today but the sound effects are kinda bad, it actually put me off of the fight scenes this time around. How come punches sounded like that in movies back then? And how the hell was I ok with it? It took me out of the story and I struggled to get back in it.\r As distracting as the sound effects are in the film, The Bourne Identity has a good cast, Matt Damon is amazing in that role, completely belivable as this amnesiac dude who knows all of these thing. The story is simple but efficient as are the action scenes. It has a James Bondsy flavor, that is if James Bond was on a budget, which gives a gritty, realistic feel to the movie.\r The Bourne Identity has its quirks but it’s a rather entertaining film. by @wornoutspines",
            "review_date": "2015-06-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a fairly routine story that is generally well-handled, enough to be \"involving\" though somewhat short of \"absorbing\".  It does manage to do something I've never seen before, involving the use of a human cadaver as a sort ofThis is a fairly routine story that is generally well-handled, enough to be \"involving\" though somewhat short of \"absorbing\".  It does manage to do something I've never seen before, involving the use of a human cadaver as a sort of trampoline.  But the film is not without its failings, such as when the character who beats up an entire procession of cops, guards and US Marines neglects to recognize the obvious advantage of changing his clothes and perhaps swapping out the big red bank bag he's carrying for something less conspicuous.  All in all I'd say this is a competent production awash in a sea of Hollywood idiocy and as entertainment dollars go it's a better buy than most.",
            "review_date": "2015-09-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie, interesting throught and one of the classics. Great action and plot and acting",
            "review_date": "2019-12-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Identity is starving for hungry audiences waiting to see this movie and so... they did. Results? This movie did nothing other than just standing there moving frames per second. That's how to love the Bourne Identity.",
            "review_date": "2016-04-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Dynamic thriller about an amnesiac hit-man and his efforts to trace who is him and who and why are trying to kill him. With the right amount of suspense and action, it's the fortunate start of a saga; the main role is on right hands. ItDynamic thriller about an amnesiac hit-man and his efforts to trace who is him and who and why are trying to kill him. With the right amount of suspense and action, it's the fortunate start of a saga; the main role is on right hands. It deserves a big bag of popcorn.",
            "review_date": "2020-03-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "So much better than the sequels, just the right amount of romance, Franka Potente is excellent.  The stunts have understated music and driving.  The action mounts as the other super assassins get tougher going along, feels like an rpg.  It'sSo much better than the sequels, just the right amount of romance, Franka Potente is excellent.  The stunts have understated music and driving.  The action mounts as the other super assassins get tougher going along, feels like an rpg.  It's just a superior movie.  The sound effects have more variety, the locations are more varied. Matt Damon as the man in search for himself is excellent.  I love how he takes charge right away and she interlocks with him so naturally.  Franka Potente really makes the movie.  Bryan Cox is excellent, Julia Stiles has more range in this one, negotiating for staffing and all.  Clive Owen is excellent.",
            "review_date": "2020-02-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Identity is one of the best spy thriller films of all time. The characters are great and surprisingly fleshed out. The story is great and the action is some of the best stunt work I've ever seen. In the end, this is a fantasticThe Bourne Identity is one of the best spy thriller films of all time. The characters are great and surprisingly fleshed out. The story is great and the action is some of the best stunt work I've ever seen. In the end, this is a fantastic film that suffers from having some generic characters and scenarios but is overall fantastic and it gets an 8.5/10",
            "review_date": "2017-12-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Swift, suspenseful and undeniably intriguing. Bourne sets out a story and a character that is both easily rewatchable and easily accessible. Driven with decent pulse, it's the relationship between Jason and Marie that give Identity its trueSwift, suspenseful and undeniably intriguing. Bourne sets out a story and a character that is both easily rewatchable and easily accessible. Driven with decent pulse, it's the relationship between Jason and Marie that give Identity its true identity. As it still feels like it hasn't quite reached its peak form as a series of films quite yet, but it's close.",
            "review_date": "2019-07-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was attracted to this action film by the hope of seeing something that went a little beyond the simple and common \"run, shoot, kill and jump\" of films like this. The basic premise, a man in search of his own identity, could allow the scriptI was attracted to this action film by the hope of seeing something that went a little beyond the simple and common \"run, shoot, kill and jump\" of films like this. The basic premise, a man in search of his own identity, could allow the script to have some mystery that would sweeten this recipe and make the film more interesting. However, after seeing the film, I feel that this is not exactly what I found and the film took little advantage of this idea.The script starts off well, as I said: a man wakes up not knowing who he is, but quickly starts behaving like a \"killing machine\". It's instinctual. It becomes evident to us there that he was, or is, a professional killer hired by someone. Furthermore, it remains to be seen what the details of his story will be, and it is this quest that leads the film, from one pursuit to another until the end. The problem with this movie really starts with a sparse script: the man doesn't know who he is and everyone wants to kill him, so he has to flee almost the entire movie, between gunfire and bombs. It's simple, and it's tiring.Matt Damon achieved, with this film and its sequels, a consecration as an actor that is deserved, albeit uninteresting. He is a good actor, but in this film he was far from his potential and the film, due to its characteristics, does not favor the work of an actor who wants to stand out for the quality of his dramatic interpretation. Still, the film gives him enough to do a satisfying job, and still allows to some supporting actors a certain leeway to show talent. This is the case of Franka Potente, Clive Owen and Chris Cooper. The rest of the cast shows up just because they have to and doesn't stand out.Technically, the film has many positive and well-developed aspects. Being a pure action film, there are high production values and a lot of money invested in great and quality effects. Gunshots, explosions, smashed cars, things that explode, fake blood, the film is a godsend for the visual, special and sound effects team. The work of action stunts is also important and worthwhile. Cinematography takes a back seat, with discreet but competent work, and the soundtrack, by John Powell, plays its part, with an especially good and striking song in the end credits: \"Extreme Ways\", by Moby.",
            "review_date": "2021-07-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Masterpiece!it was smooth,calm and intense at same time,the music was phenomenal in surprising situations.the acting was iconic Matt was brilliant in the role,the plot was unique and great and the screenplay was brilliant and great,the actionMasterpiece!it was smooth,calm and intense at same time,the music was phenomenal in surprising situations.the acting was iconic Matt was brilliant in the role,the plot was unique and great and the screenplay was brilliant and great,the action scenes were awesome and the hand combats were fast and well performed.its literally a flawless experience right from the start.the boat scene and identity unknown was engaging from start the whole self discovery ride from then on with unexpected situations with having a amazing partner it was great,the bank scene was amazing with passports and money.the embassy and police fight at start was great,the Tread-stone and the Assassination of the person was amazing as side story,the assassins hired to kill Bourne and his fight with them was awesome,the ending i was expected to be a ground-breaking reveal of something from past but it was very calmly handled with the last surprising shot of leader.the car technique and the breaking in room was awesome and love the ending with the return to partner,it was awesome experience,it's one of the greatest spy action movie A Masterpiece!",
            "review_date": "2020-06-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Before Paul Greengrass showed the world how to correctly use shaky cam, Doug Liman was introducing the world to Jason Bourne in equally stylish, albeit more dated fashion.Unlike the next two movies, this one doesn't feel as timeless (theBefore Paul Greengrass showed the world how to correctly use shaky cam, Doug Liman was introducing the world to Jason Bourne in equally stylish, albeit more dated fashion.Unlike the next two movies, this one doesn't feel as timeless (the technology and editing style is very early 2000's), but it is the one Bourne film that focuses more on the humanity of Bourne, his relationship with Marie being its main focus.This was a great start for a great trilogy.And two other movies.",
            "review_date": "2020-10-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This one is my favorite one out of the series and another one of my favorites of all time. He remembers nothing. Just walking around kicking everyone's butte and disappearing without a trace love it.",
            "review_date": "2022-12-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "matt damon was amazing in this movie. he and franka potente had great chemistry too. wonderful acting from both of them, and loved the plot and its ability to not miss out on details. really made the movie immersive. thank you directors andmatt damon was amazing in this movie. he and franka potente had great chemistry too. wonderful acting from both of them, and loved the plot and its ability to not miss out on details. really made the movie immersive. thank you directors and producers and actors for this film!",
            "review_date": "2021-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is an example of great action movie. Usually nowadays lazy directors and scenarists make stupid and annoying characters with 0% of brains, but 100% of show-off.Bourne Identity has it flaws, but compare to other action moviesThis movie is an example of great action movie. Usually nowadays lazy directors and scenarists make stupid and annoying characters with 0% of brains, but 100% of show-off.Bourne Identity has it flaws, but compare to other action movies (especially nowadays) it's a masterpiece. Operating and composing still awakes goosebumps!",
            "review_date": "2021-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Bourne Identity is one of the best action/thriller film's of all time. The screenplay was smart and perfect. Matt Damon did a great job playing this character and the rest of the cast were amazing in their roles. The action and fightThe Bourne Identity is one of the best action/thriller film's of all time. The screenplay was smart and perfect. Matt Damon did a great job playing this character and the rest of the cast were amazing in their roles. The action and fight scenes were well chrographed and filmed properly. Almost all of the directing and cinematography were great but one flaw that the movie had was that it breaks the 180 degree rule.",
            "review_date": "2021-06-26",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 99
}