{
  "title": "The Experiment",
  "rating": 7.3,
  "release_date": "2002-09-18",
  "genre": [
    "Drama",
    "Thriller"
  ],
  "summary": "Inspired by the Stanford Prison Experiment, this psychological drama focuses on twenty paid recruits who are divided into groups \"prisoners\" and \"guards\" and are let loose in a controlled prison-like environment.",
  "critic_reviews": [
    "En route, we also get a chance to examine the nature of the self and the responsibilities of science. Das Experiment has all this and more, excitingly packaged as a prison movie featuring superb performances and high emotional tension.",
    "Because the confrontations between power and powerlessness are so dramatic and because Hirschbiegel's editing is so emphatic, Das Experiment is practically over before you realize that you don't know what its point is, exactly.",
    "What impressed me is how effective the movie was, even though the outcome is a foregone conclusion. That's a tribute to the director, Oliver Hirschbiegel, and the actors, who have been chosen with the same kind of typecasting that perhaps occurs in life.",
    "Disturbing film.",
    "This is a grimly thrilling movie that falls somewhere between clear-eyed realism and the improbabilities of an action flick.",
    "There's not enough insight to the social phenomenon presented onscreen, but that doesn't make the utterly human horror of this thriller any less unsettling.",
    "One of those all-too-rare cases in which a riveting premise is expertly executed.",
    "As an exploitation picture, Das Experiment is mindlessly potent; subtitles are no guarantee of sophistication and subtlety.",
    "A solid slice of entertainment without reaching the psychological depths promised by the subject matter.",
    "After the film's ultraviolent finale (set to the tacky beats of synth-pop volksmusik), one wonders whether this sharp bit of fascinating fascism provides a true analysis of television's new mean streak, or simply an engaging indulgence in same.",
    "Doesn't tell you anything about human nature you probably haven't already suspected, but then again it's good to be reminded of these dark things from time to time. Especially these days.",
    "This cacophonous ending may serve to reinforce the filmmakers' cynical themes, but it leaves viewers trying desperately to remember the part of the film that had brains, wit, and so much promise.",
    "It's empty calories trying to trumpet its bogus nutritional value, and the strain for social importance undermines the picture.",
    "The film's hysterically pitched action overshadows its more subtle psychological points.",
    "First-time feature filmmaker Oliver Hirschbiegel maintains a riveting sense of simmering brutality.",
    "For all its slickness, is an R-rated version of \"Survivor,\" \"Big Brother\" or any number of reality-TV shows that present voyeurism as entertainment and exploitation as insight.",
    "Eventually any serious statement is lost in a sea of sadism, as he forces us to watch scene after scene of gruesome, humiliating torture.",
    "Rigid, airless, and browbeatingly repetitive, Das Experiment is an overly didactic piece of thesis hectoring; it's like ''Lord of the Flies'' set in a Skinner box.",
    "Too much of a mess to say anything with assurance, pieced together as it is from mismatched institutional movies such as \"Cool Hand Luke\" and \"Shock Corridor\" -- with \"Lord of the Flies\" thrown in for good measure -- and turning on plot points that simply don't wash."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Interesting throughout the complete duration. The love story integrated seemed kinda exaggerated but everything else was shocking and quite realistic.",
      "review_date": "2018-08-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film was intense. It was based off the Stanford Prison Experiment, but if I remember correctly, nobody really died at the end of it, though someone did get removed early, and some of the psychologists actually tried to stop theThis film was intense. It was based off the Stanford Prison Experiment, but if I remember correctly, nobody really died at the end of it, though someone did get removed early, and some of the psychologists actually tried to stop the experiment earlier than 6 days. Great performance by everyone in the cast. But I'm not a big fan of the story, since it seemed a bit melodramatic; the phrase \"that escalated quickly\" really describes this film. I wish they'd actually stuck to the facts instead of aiming for the disgust factor. They made the psychologists look like real genuine gullible idiots in this film; first, they let an ex-convict in (they obviously did not do any background checks), second, they let a potentially psychopathic guy in, third, they took their participants at their word (people lie, it's a fact).",
      "review_date": "2014-01-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I got this movie after I discovered it was written, produced & directed by the genius behind Prison Break Paul T Scheuring.\r The two leads are brilliant, and it was clear from this film how they were both Oscar winners.\r\n\r\nA couple of theI got this movie after I discovered it was written, produced & directed by the genius behind Prison Break Paul T Scheuring.\r The two leads are brilliant, and it was clear from this film how they were both Oscar winners.\r A couple of the scenes were brutal, overall a good movie, not the best I've ever seen, but I'm glad I bought it.",
      "review_date": "2015-02-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There is only few mistakes: The movie is a bit unrealistic and sometimes the actors are too quiet and should speak louder. But other than that it is a top movie with good acting and humanistic meaning. Especially I like, that the movie focusThere is only few mistakes: The movie is a bit unrealistic and sometimes the actors are too quiet and should speak louder. But other than that it is a top movie with good acting and humanistic meaning. Especially I like, that the movie focus on the psychological development of the characters.",
      "review_date": "2021-04-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Das Experiment\" the original version, was unsettling, so much that plays an important role in psychology and philosophical, good characters and a very good story that will keep you glued to the seat, so I felt it.",
      "review_date": "2017-09-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "L'Expérience est une sorte de \"jeu\" grandeur nature, un \"test\" éminemment instructif et édifiant dans lequel 8 gardiens sont chargés de surveiller 12 détenus sous l'oeil attentif des expérimentateurs qui veulent ainsi regarder à la loupe,L'Expérience est une sorte de \"jeu\" grandeur nature, un \"test\" éminemment instructif et édifiant dans lequel 8 gardiens sont chargés de surveiller 12 détenus sous l'oeil attentif des expérimentateurs qui veulent ainsi regarder à la loupe, puis éventuellement disséquer le comportement humain dans une telle situation...C'est inspiré de faits réels et bien entendu on se doute bien que tout cela va partir en vrille bien vite... On pense évidemment avant cette \"expérience\" à celle de Stanley Milgram sur la soumission à l'autorité et la déshumanisation stupéfiante qu'elle a engendrée. Ici, le réalisateur allemand Oliver Hirschbiegel exploite à fond le concept et le creuse à l'extrême.De façon très progressive, il démonte et démontre habilement toute la mécanique qui va mener à la violence, au sadisme, à la cruauté et à l'humiliation. Puis au meurtre. L'ambiance est très réaliste, telle une sorte de quasi-documentaire et si quelques points scénaristiques sont sujets à caution (le rôle de la copine, anecdotique et dispensable notamment) si peut-être une certaine exagération fait pencher finalement le film vers le thriller plus classique, il n'en reste pas moins que l'objectif recherché est atteint : nous voilà sidérés par cette Expérience qui n'a rien perdu de son impact, bien des années après.On retrouve quelques pointures du cinéma allemand et la mise en scène caractéristique de Hirschbiegel : plutôt froide et peu amène en vérité mais contrairement au cinéma américain sans aucun effet de manches ou de guimauve superflue. Pas de \"leçon\" non plus, car les \"faits\" parlent d'eux-mêmes et ça, c'est très appréciable. Un film passionnant et très efficace, toujours aussi saisissant.",
      "review_date": "2017-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An interesting film that started innocently enough, but gradually started to build up and ended in a proper style. Prison had its own atmosphere and it was made even better by the fact that it was an experiment based on a true story. What IAn interesting film that started innocently enough, but gradually started to build up and ended in a proper style. Prison had its own atmosphere and it was made even better by the fact that it was an experiment based on a true story. What I also liked was the brutality at times, which the film didn't shy away from. For me, a good film that I can recommend.",
      "review_date": "2022-03-12",
      "source": "metacritic"
    }
  ],
  "num_reviews": 26
}