{
    "title": "The Adventures of Pluto Nash",
    "rating": 7.7,
    "release_date": "2002-08-16",
    "genre": [
        "Action",
        "Sci-Fi",
        "Comedy"
    ],
    "summary": "Set on the moon in the year 2087, this comedy stars Eddie Murphy as Pluto Nash, the audacious, successful owner of the hottest nightclub in town who finds himself in trouble with lunar gangsters.  (Warner Bros.)",
    "critic_reviews": [
        "Eddie Murphy's latest comedy, The Adventures of Pluto Nash, takes place in the year 2087, which is about the earliest he can hope to be forgiven.",
        "There are worse movies, but that's no excuse. Rarely has so much money delivered so little entertainment.",
        "A limp Eddie Murphy vehicle that even he seems embarrassed to be part of.",
        "In terms of execution this movie is careless and unfocused.",
        "The proper mix is never found. Ill-conceived and expensive project that winds up looking like a bunch of talented thesps slumming it.",
        "Murphy slogs his way through this dismally dull sci-fi comedy.",
        "A headache-inducing mess without direction or purpose.",
        "Strands one of the most gifted casts assembled in some time. Sadly, though many of the actors throw off a spark or two when they first appear, they can't generate enough heat in this cold vacuum of a comedy to start a reaction.",
        "So unremittingly awful that labeling it a dog probably constitutes cruelty to canines."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "This is my most favorite film in the universe. Sure, the budget was 100mil and they only got 7mil, making Warner Bros lose 93million dollars... but that's because people didn't see it and didn't want to know how good it was. This deservesThis is my most favorite film in the universe. Sure, the budget was 100mil and they only got 7mil, making Warner Bros lose 93million dollars... but that's because people didn't see it and didn't want to know how good it was. This deserves film of the century.",
            "review_date": "2014-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Painfully unfunny, and just a total mess of a movie, I just can't stand it's unfunny ness, and seeing Eddie Murphy just not being funny, which is just painful.",
            "review_date": "2014-01-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Simply awful. This mush should be fed to the Taliban and other Islamo-fascists until they are dead (which shouldn't take too long).",
            "review_date": "2006-04-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Can someone tell me if they can remember what the point of this movie was? Maybe then I'll at least be able to laugh at how stupid it was.",
            "review_date": "2006-07-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of my most FAVORITE movies. I had heard so amny negative things I was scared to watch it. But when I did, I laughed all the way through. Randy Quaid was hilarious! He was my favorite. The music was also fantastic. The movie was This is one of my most FAVORITE movies. I had heard so amny negative things I was scared to watch it. But when I did, I laughed all the way through. Randy Quaid was hilarious! He was my favorite. The music was also fantastic. The movie was fun when you didn't take it too seriously and expect any hidden meaning.",
            "review_date": "2008-09-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mayday! Mayday! Call for Mayday here! This movie's on autopilot and it's going out of control since this movie's a complete box office bomb and Eddie Murphy can't help us at all!",
            "review_date": "2016-01-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I love this movie! Funny as all get out...just watch it more than once.",
            "review_date": "2008-06-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Forget bombs and guns and gas chambers, use this to create a mass genocide!",
            "review_date": "2008-03-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's pretty lousy. Most of the actors have kind of a \"what the hell am I doing here?\" look on my face. The jokes fall flat, and I'm assuming they didn't make this movie for the plot.",
            "review_date": "2005-12-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It is quite concerning that people can find this enjoying. It is not an exaggeration to say nothing in this movie is funny. Maybe it is the terrible pacing caused the nonsensical scenes covered by forced dialogue. The world set up does notIt is quite concerning that people can find this enjoying. It is not an exaggeration to say nothing in this movie is funny. Maybe it is the terrible pacing caused the nonsensical scenes covered by forced dialogue. The world set up does not make any sense and comes off as uninspired rather than the spoof type atmosphere that the film was obviously going for. Cardboard is more exciting than the action and the humor is either in your face or already drawn out. This movie introduces some cool things, but nothing that furthers the plot or has not been done before. Plus anything responsible for hurting Eddie Murphy's career can't be good. The worst part about this film is that there are no real adventures. It is called \"The Adventures of  Pluto Nash\", yet it is as adventurous as buying milk from the groceries. The film tries to be a neo-noir mystery, but in actuality it is as boring as predictable as the film just mimics rather than innovates. I guess if you had never seen any movies before it is not that bad, but if you have experienced any type of visual media in the past then this film is worth passing.",
            "review_date": "2015-06-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Eddie Murphy played a pretty hilarious part and his motley crew was just as funny. Personally, I believe there was little bad acting in it. The humour however while pertaining to realistic scenarios that most people have had to deal with, wasEddie Murphy played a pretty hilarious part and his motley crew was just as funny. Personally, I believe there was little bad acting in it. The humour however while pertaining to realistic scenarios that most people have had to deal with, was a bit raunchy to watch in front of family. I would still recommend this film as a funny sci-fi adventure film that kind of plays like a game of D&D.",
            "review_date": "2019-03-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Good light hearted movie. I do not understand why it is so hated. Well worth watching.",
            "review_date": "2019-10-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the funniest movies of 2002, some of the best jokes and action I have seen in a sci fi action comedy.",
            "review_date": "2021-04-06",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 24
}