{
  "title": "High and Low",
  "rating": 8.0,
  "release_date": "1963-11-26",
  "genre": [
    "Drama",
    "Mystery",
    "Thriller",
    "Crime"
  ],
  "summary": "An executive of a Yokohama shoe company becomes a victim of extortion when his chauffeur's son is kidnapped by mistake and held for ransom.",
  "critic_reviews": [
    "A sizzling, artistic crackerjack and a model of its genre, pegged on a harassed man's moral decision, laced with firm characterizations and tingling detail and finally attaining an incredibly colorful crescendo of microscopic police sleuthing.",
    "Miraculously, High And Low turns the mundane follow-through of police work into the stuff of white-knuckle suspense.",
    "Few movies have ever been as subtly, methodically composed as High And Low, in which every shot reflects, to some degree, the dichotomy presented by its title.",
    "The most tension-filled ransom exchange sequence ever filmed works perfectly as the midpoint break between the two halves, which eventually begin to converge as a potent study on the psychological effects of income inequality disguised as a straight genre piece.",
    "I would nominate this authoritative 1962 adaptation of Ed McBain’s novel The King’s Ransom as Akira Kurosawa’s best nonperiod picture, though Ikiru and Rhapsody in August are tough competitors.",
    "High and Low is a masterful cinematic elevator connecting two warring social perspectives, finding a common ground between them in the pressurized corners of the classic crime drama.",
    "While not a masterpiece on par with Kurosawa's best work, High And Low is a fine example of his craft, and further proof that it's not a few masterpieces but the overall scope of a career that defines a great director.",
    "This lesser known Kurosawa feature is worth a look, with outstanding performances and stunning cinematography.",
    "It's not one of his masterpieces, but High and Low fully illustrates why Kurosawa is regarded as Japan's foremost director.",
    "Structurally, High and Low, which is remarkable in many ways--the camera work alone could serve as a primer in film technique--is quite a departure for Kurosawa.",
    "The first half, set in a single room, echoes Hitchcock's Rope in exploring his moral dilemma while the action takes place off-screen. The second is disconcertingly different in that it focuses excitingly on the police procedures deployed in the hunt for the kidnapper. But the connections, though sometimes overly obvious in appealing to the liberal conscience, span fascinating Dostoevskian depths.",
    "In HIGH AND LOW Kurosawa succeeds in developing a highly visual structural style within the wide-screen format."
  ],
  "reviews": [],
  "num_reviews": 12
}