{
    "rating": 4.4,
    "release_date": "1993-11-05",
    "num_reviews": 45,
    "genres": [
        "Comedy",
        "Family",
        "Romance"
    ],
    "summary": "The dogs can talk at a family of 4, where mom loses her job the same day dad gets a job as pilot for a cute, single boss.",
    "reviews": [
        {
            "review_title": "Well, there are puppies... adorable puppies... gotta love puppies... you know I had to try",
            "content": "OK, yes, I do think we are all a little sick of the Look Who's Talking sequels, even though I did enjoy Look Who's Talking Too, it was just taking a really great concept and not putting the effort into it. Look Who's Talking Now is just plain pathetic on the level that it's more for the kids vs. the adults, I think because they found that Look Who's Talking had a children's love as well as an adult's, because it was just all together a great comedy. With Look Who's Talking Now, we have a more \"family friendly\" movie with puppies that surprise, surprise talk. Not to mention that the silly plot line that they put in where it seems like the dogs more revolve around the characters instead of the characters we have grown to love.A young cross bred puppy is up for sale and we can hear him talking, he sees Mikey passing by him and begs him to take him home. Mikey however has to hurry past in tow of his mother, and two harsh looking individuals buy the puppy. The puppy manages to escape them and starts his life as a stray. James is a private air pilot working for Samantha, who we see has a crush on him and is always trying to extend the trips to spend more time with him. Mikey tells Santa that he wants a dog for Christmas, James feels the time has come to give Mikey the present he has always wished for and tells his boss Samantha about this. In the meantime, Mollie is a top accountant at her firm but because her salary is so high, she is suddenly fired in order for the firm to save money. Unable to acquire a decent job, Molly gets a job as one of the Elves for the mall Santa for the holiday season. During a visit, Mikey discovers to his horror that that Santa Claus is a fake and becomes upset with disbelief. One day though the dog gets caught by the animal rescue force and taken to a kennel, where several other dogs are kept - presumably also found on the streets. The dog is about to be put to sleep on the same day that James brings Mikey to the kennel to select a dog, overjoyed Mikey bumps into the dog he saw as a pup, and takes an instant liking to him and decides to take him home. When James, Mikey and Rocks the dog get home, they see that Samantha is at their house and has brought over her dog Daphne who is highly trained and she wants James to have it as a present from her. Molly discovers that James had gone and gotten a dog for Mikey without discussing it with them and after a brief argument, they can't take Rocks back to the kennel or he will be put to sleep, and James does not want to offend Samantha by refusing Daphne. And now realize they are stuck with two dogs. And of course these dogs talk as well to narrate the story that Mikey cannot narrate any more.Is Looking Who's Talking Now the worst movie ever? No, not really, it's certainly not terrible, but it's just pointless. It was just a different way of making money off of the franchise. I think that this is a silly movie, but it did have a couple of random laughs here and there, but for the most part it's just silly with the whole story between James and his new boss, Samantha who has a crush on him, more like an obsessive crush where she just throws herself at him, maybe she saw those Welcome Back, Kotter episodes one too many times and was in love with Vinnie Barbarino. But anyways, I wouldn't really recommend this movie to too many people, more for the really young kids who just wanna see really cute puppies, that's about it. This movie doesn't have much to offer except for\u0085 puppy love! Oh, you know I had to make a lame joke.2/10",
            "review_date": "2004-02-10",
            "lang": "en"
        },
        {
            "review_title": "Tired and predictable",
            "content": "Look Who's Talking Now is not absolutely unwatchable and certainly not the worst movie ever made, but for me it is weakest of the series. I really enjoyed the first, and while watchable the second was a disappointment. Look Who's Talking Now has its good points, such as the soundtrack and the two dogs voiced wonderfully by Danny DeVito and Diane Keaton. Plus it is not too bad visually.However, the concept has been done to death but the story feels very tired this time around, and to further disadvantage there are one too many thin and predictable gags and weak lines in the script. Other than DeVito and Keaton the other acting wasn't so impressive, this time John Travolta and Kirstie Alley seem to be phoning in their performances as the bickering couple. And the ending was far too sentimental for my liking.Overall, perhaps worth the look but it is disappointing for me anyway. 3/10 Bethany Cox",
            "review_date": "2010-08-02",
            "lang": "en"
        },
        {
            "review_title": "Not brilliant but still an underrated movie.A nice family film.",
            "content": "Looks Whos Talking now isn't a brilliant film but I find it to be underrated,it still quite funny,with a nice storyline and enjoyable for the whole family,John Travolta and Kirstie Alley have great chemistry and I enjoyed how they made dogs the ones talking this time instead of doing something like,having another baby.Christmas is on the way and the Ubriacco family get two dogs,James gets a new job which involves a lot of travelling while Mollie gets fired.This time the dogs do the talking because the two kids are all grown up,Daphne (voiced by Diane Keaton) is a pampered poodle and starts to fall for the other new dog Rocks (voiced by Danny Devito).",
            "review_date": "2012-01-04",
            "lang": "en"
        },
        {
            "review_title": "This movie is underrated.",
            "content": "Some of you people are so picky. This is certainly not the worst movie ever made. I agree it's not the best movie of the series but it's fun to watch especially around the holidays.First, the cast is great. Lot's of funny stuff and the chemistry is perfect especially between John Travolta and Kirstie Alley.The way Danny DeVito and Diane Keaton blend their voices with the on screen action of the dogs is nothing short of great. The facial expressions of the dogs, in some cases, fit the dialog perfectly.I also think this movie is great for the holidays. It expresses the importance of family and togetherness.I do find it interesting that there are two endings to this movie. The original theatrical version had a different music cue at the very end along with regular scrolling credits. The version that was released on laserdisc and VHS had a, in my opinion, better music cue at the end (Joy to the world) and then a music video with the credits. The DVD release has the original theatrical ending but thankfully the Netflix HD version has the \"video\" ending.In my humble opinion, a wonderful family film especially for the holidays. Lots of fun if you are in the mood for light comedy. Just enjoy it and don't worry about comparing it to the other films.",
            "review_date": "2011-12-12",
            "lang": "en"
        },
        {
            "review_title": "Number 94 On The Worst Movies List?",
            "content": "That movie was much better than that. It was so cool to hear the dogs talk. And it was also cool to see how Mikey and his sister would be like when they are older. This was actually one of the best movie sequels! And we got to see how the boy on 7th Heaven was when he was younger. This movie was so funny. It might have not been the best movie,  but it deserved a much better rating than #94 on the worst movies of all times list!",
            "review_date": "2003-02-22",
            "lang": "en"
        },
        {
            "review_title": "A Night in the Doghouse",
            "content": "Decided to watch \"Look Who's Talking Now\" as the podcast \"How Did This Get Made\" is planning to (rightly) eviscerate it in the near future.In this second sequel to the inexplicably popular \"Look Who's Talking\" Mikey and Julie have reached the age where they can actually speak, so the hearing thoughts conceit is pushed onto two dogs that come to live with the family. James (John Travolta) and Mollie's (Kirstie Alley) marriage is being put to the test by the long hours James is taking in his new job as a private pilot, flying around his new boss played by Lysette Anthony. Into their lives come two dogs, Rocks (voiced (badly) by Danny Devito) and Daphne (voiced by Diane Keaton). Eventually the film get bored and crowbars these two plots together before giving up and prolapsing into one of the worst music videos your ever likely to see.What's striking about \"Look Who's Talking Now\" upon watching it is the disinterest the people involved it making it seemed to have. I'll save Kirstie Alley and John Travolta from too much criticism here, they are doing their best with what was given to them and both have proven themselves capable in other roles. But that's about the only plus point. Logic is sacrificed pretty early on. Rocks ages from a puppy to fully grown dog during the opening scenes, although there's no other indication that any time has passed, the kids are the same age, and their home situation is the same. The daughter Julie (Tabitha Lupien) is enigmatically obsessed with Charles Barkley, in a way that never pans out to be relevant to the plot (almost as if they convinced Barkley to do a cameo and then had to find a way to get it into the plot somehow). The family are struggling financially, in that kinda of 90's Hollywood struggling where they have a massive apartment in New York, a car and the world is so full of qualified pilots that one would struggle to find work. Everything that happens to, and with, the dogs, who the film was supposed to be about, is completely pointless until the end and they both get a \"Lassie\" moment to help the film find some sort of conclusion.And then there's the music video. The version I saw was with Jordy's \"It's Christmas, C'est Noel\". Merde'. The nadir of badly shot, badly conceived, mess.",
            "review_date": "2018-11-21",
            "lang": "en"
        },
        {
            "review_title": "The low rating is undeserved",
            "content": "I'm really surprised at such a low rating. This movie is such a great family film. Ok it's not the same as the first 2 in the way it's more family orientated. However I think it's a great family Christmas film and one that kids would love. The dogs are really cute and Devito and Keaton are perfect for the voices. I recommend watching it at Christmas, it's not a movie that is a huge blockbuster but for a couple of hours at Christmas why not?!",
            "review_date": "2018-11-13",
            "lang": "en"
        },
        {
            "review_title": "John Travolta and Kirstie Alley are great.",
            "content": "John Travolta, Kirstie Alley, and Lysette Anthony are wonderful in this funny, funny film. James and Mollie Ubriacco (John Travolta and Kirstie Alley) now have 2 more bundles of joy...dogs! Danny DeVito lends his talent as the voice of Rocks, a street dog who now belongs to Mikey. Diane Keaton is the voice of Daphne, a poodle that's dropped off by James's boss, Samantha (Lysette Anthony) who's got her sights on stealing James from Mollie. This is a great movie that is really enjoyable for everyone in the family.",
            "review_date": "1998-11-08",
            "lang": "en"
        },
        {
            "review_title": "The series hits rock bottom, but hey, it wasn't that far a drop",
            "content": "Well, at least this was the last they made(*no*, Hollywood, that was *not* a dare). In that they had run out of different genders of children to give celebrity voices to, they turned to the pets. This time, they give the family two dogs, one of each gender, give them each a voice and lets the kids rest their inner voices. Why is it that infants, right from the womb(which we, again, see, because there apparently can not be an entry in this franchise without that), have the voice of people who are about middle-aged, give or take a handful of years or so? Apparently, even dogs. Oh well, at least these two actors, DeVito and Keaton, aren't too bad(not that I had a problem with Willis, at least as an actor), and the former's voice fits rather well for a canine. Take that any way you want. At least Roseanne is gone... but they make efforts to make Julie as annoying without her, having her tell knock-knock jokes so lame that even the parents would ask her to stop... she also apparently fantasizes about beating Charles Barkley, who must have liked the part, as he did the same thing again three years later, in Space Jam. Dukakis shows up again, in what can only be loyalty(in a film with dogs as main characters, how fitting). Heckerling neither wrote nor directed this... when the very *creator* of a franchise steps down, you ought to know there's something wrong. There is no trace left of any charm the series ever had(which was all found in the first). I would say that the franchise by this point just has overstayed its welcome, but it could be argued that it achieved that before the end credits of the original film. More nightmare sequences, this time being ridiculous(a first for the series; usually, they were just misplaced and more unsettling than anything a young child should watch). The main conflict is essentially rehashed from the first two, only dumbed down. Lysette Anthony shows up, her acting performance being at the same level that it was in Trilogy of Terror II(that would be poor). This film will insult the intelligence of anyone beyond the age of seven, but some of the humor remains above what they will(or should) understand, or ought to watch. The very ending was almost too much. I recommend this to people who like dogs, and men attracted to Lysette. 3/10",
            "review_date": "2007-10-29",
            "lang": "en"
        },
        {
            "review_title": "Well it was better than two.",
            "content": "This movie is part of one of the worst set of trilogies ever made where all the movies somehow made it to the theater.  This one is quite bad, but at least it isn't part two so no Roseanne doing the voice.  Here we have Danny DeVito and Diane Keaton doing dogs voices.  Not really worth watching and there are probably lots of dog movies that are better.  This one has the family being hateful to each other again.  Let's face it Travolta and Alley have to be the worst screen couple ever, they always have problems.  All in all not worth watching, but at least it is more tolerable than part two, but I say skip the entire set movies as none of them are good.",
            "review_date": "2003-05-06",
            "lang": "en"
        },
        {
            "review_title": "Deeply unsettling, hopelessly inept and really boring.",
            "content": "At least the second film in this god-awful trilogy had the benefit of being so bad and inappropriate it was unintentionally hilarious. This scattershot, occasionally offensive, always unsettling and very dumb film is one of the most boring cinematic experiences in recent memory. The side plot of dogs, (how'd they score DeVito and Keaton, both of whom were doing much better that Alley or Travolta at this point in their carreers?), is useless; the 'dad is hard at work' subplot is just recycled from the second film, (they even use the same dream gag), and the plot doesn't really exist. And why does everyone keep ragging on Travolta's carreer? Being a pilot is no easy feat!Travolta and Alley, who seem to get along in real life, seem to repel each other onscreen; maybe because they're platonically inclined to each other in reality; onscreen they're like two positively charged magnets pushing each other apart. On top of all that, the casual misogyny throughout is grating and extremely distasteful. Dumb, dumb, dumb.",
            "review_date": "2018-11-27",
            "lang": "en"
        },
        {
            "review_title": "struggling to reclaim any originality",
            "content": "The Ubriaccos are back. James (John Travolta) get a new job as a pilot for entitled Samantha (Lysette Anthony) who is the president of a major company. Meanwhile, Mollie (Kirstie Alley) gets laid off from her accounting job. Mikey and Julie get 2 new dogs. Rocks (Danny DeVito) is a mutt and the runt of the litter from the dog pound. Daphne (Diane Keaton) is a spoiled pedigree poodle from Samantha.The family is now bland. The kids are not as compelling without their gimmick. It seems like the movie is struggling to find something to happen to the family. I do mean struggle. It has way too many stupidity. I don't get why there's a dream sequence with Julie and Charles Barkley. It seems like filler. The dogs get sporadic screen time in the first half. I expected that the dogs would be in the home right away but the first half is wasted. Once the family unites with the dogs, it gets the expected kids with dogs mayhem. I keep thinking that there is a better story. The story is more like a sitcom. It should have been a fun family fare. I am bored with the dream sequences. This is like watching an unstable house of cards completely collapse. Then it takes a hard turn at the end that doesn't fit any of the rest of the movie.",
            "review_date": "2015-04-20",
            "lang": "en"
        },
        {
            "review_title": "A funny and fresh addition to the series",
            "content": "James (John Travolta) has a new job as a pilot for a small airline.  Mollie, his wife (Kirstie Alley), has just been handed a pink slip. Their children, Mikey and Julie, are dreaming about a pet dog.  Thus begins the third installment of this likeable series of films.  Since Mikey and Julie are now talking on their own, the addition of not one, but two family dogs is the explanation of \"who's talking now\".  Rocks (Danny DeVito) is a streetwise pound puppy while Daphne (Diane Keaton) is a pampered poodle that is a gift of James' new boss, Samantha.  Speaking of Samantha, she has set her sights on luring James away from his happy family life.  Can the family adjust to life with the canines and thwart Samantha's romantic schemes?This is a funny and fresh addition to the Look Who's Talking series. Travolta and Alley exude such charm and humor that they make a terrific comedy team.  The rest of the cast is notable and the voices of DeVito and Keaton bring their doggy personalities to life in a big way.  The script is somewhat predictable but still brings a smile to any lucky viewer.  There are some scenes involving a wolf that may be scary for the youngest movie enthusiasts.  But, on the whole, this is a fine film for the entire family to chuckle over.",
            "review_date": "2003-08-27",
            "lang": "en"
        },
        {
            "review_title": "The ratings of this movie shows everything what is wrong with Imbd",
            "content": "This is one of those \"Christmas\" movies that always sticks with you.\nReally underrated.Ignore the ratings, it is quite a great family movie.",
            "review_date": "2020-12-23",
            "lang": "en"
        },
        {
            "review_title": "Another one",
            "content": "I don't know why they only made 3 of these films. They could have made 20 and still remained fresh",
            "review_date": "2020-03-30",
            "lang": "en"
        },
        {
            "review_title": "Enjoyable and fun... until the ending",
            "content": "I couldn't resist the temptation, and I found myself liking 'Look Who's Talking Now', even though I knew it wasn't really a... what's the word I'm looking for here... good movie? I think it was because I had gone into it expecting absolutely nothing. It's not the kind of movie that'll change your life, and you'll probably forget you had even seen it the next morning, but it's fun and lightweight, just as films in this genre should be.The last week, I've gone a movie watching spree, watching at least eleven films in seven days, and this is probably the biggest treasure out of the bunch, if only because it was so much better than I had hoped. Angela's Ashes, The Running Man, Blow, Memento, Midnight in the Garden of Good and Evil, Empire of the Sun, Paper Moon, Jacob's Ladder, Leaving Las Vegas, Along Came a Spider, The Stand, the list goes on and on, and, of all those films, this is the one that stands out... if you can believe that. Of course it had it's share of flaws, probably more than the rest of those movies combined, but hey, it just added to the fun instead of detract from it.I did see Look Who's Talking. I hated it. I hated it with a passion. That was a year ago. Why I hated it, I don't know. I just know that I didn't like it at all. The only reason I rented this movie, it's SECOND sequel, was to see how the series had deteriorated since the first film. Well, if nothing else, it's really improved. I haven't seen the second in the series, but I doubt it could even begin to match the third.One can guess that Travolta didn't want to be here. You've gotta feel sorry for the guy. Once one of Hollywood's biggest stars, through the eighties he was reduced to parts in TV movies and bland films like The Experts. He struck box office gold in 1989 with the first Look Who's Talking, and then made a few wrong moves and was right back down at the bottom of Hollywood, even appearing in both of the sequels. Well, if he was bored here, he sure didn't show it. Though his performance seemed to wane a bit towards the end, he was engaging all the way through, and obviously didn't feel as though the material was below him like many actors would've had they been in his position.Kirstie Alley, however, is entirely a different story. Never a particulary good actress, you have to wonder how she rose so high into Hollywood's elite, before plunging again after the first Look Who's Talking. Her screen presence here is non existent, and she is about as much fun to watch as this review probably is to read. Though she doesn't bring the whole film down with her, she comes pretty close at times, and for me at least, didn't garner a single laugh.As the voices of the two dogs, Rocks and Daphne, Danny DeVito and Diane Keaton fare a lot better than Alley. Given some of the best lines in the film, they add a certain flare to their characters, making us believe that dogs actually can communicate with each other as illustrated here, even if it is clearly not possible. It takes real talent to make the audience believe that. Even if it is just through voice work, chemistry between the two is clearly evident, and you wish they had been given more scenes together, or even seperately. The writers seemed to forget about the dogs for long periods of time and focusing instead of the family, even though the movie was supposed to revolve around the dogs, at least according to the advertising.Though she is third billed, Olympia Dukakis has little more than a cameo, given five or six lines at the absolute most. Rounding out the main cast was the two actors who played Travolta and Alley's kids, David Gallagher as Mikey and Tabitha Lupien as Julie. Lupien is funny at times, especially with her obsession with basketball star Charles Barkley, but it's clear that was too young to really know what was going on, and just following the orders of the director. She did have some good lines, and that wide eyed gaze she had is priceless. Gallagher, who was later cast as one of the leads on the television series 7th Heaven, is impressive here, turning in a surprisingly good performance for someone so young. Though his character was shallow and obviously wasn't drawn out much (strange considering he's on screen for most of the movie), he makes good use of the weak material given to him.Spread out through the movie were five or six dream sequences. There's only one word to describe them, downright hilarious. Wait, that's two words. Oh well, they were really funny though. I'm not going to go through describing them, you'll have to see them for yourselves, but take my word on it, it doesn't get much funnier than that folks.Well, I've spent long enough praising the movie, now to the flaws I mentioned earlier. For one, I don't know if this was the fault of the boom operator or if it was my particular cassette, but the on location audio was dreadful. The voices were muffled and hard to understand, and it weakened the impact of many of the dialogue based jokes. Any chemistry between Travolta and Alley that may have existed in the first Look Who's Talking has vanished. Though many may not agree with me, I put the majority of the blame on Alley, who probably took this role only because of the paycheck.The last third of the movie, especially the sappy happy ending, is contrived beyond belief and not the least bit funny. It's as if the producers hired a seperate writer for the ending, the style is that much different from the rest of the movie. The songs are unimaginably bad. Well, it's not so much the songs, but the obtrusive way they were edited in, with the audio levels at least 50% higher than the rest of the movie. I'm not going to drone on and on, like I already have, so I'll end this quick.Look Who's Talking Now is a surprisingly entertaining little movie, easily better than the lackluster first entry, just don't go in expecting too much (which shouldn't be too hard given the horrible reviews and low IMDb rating), because you're bound to be disappointed.7.5/10",
            "review_date": "2001-04-18",
            "lang": "en"
        },
        {
            "review_title": "This movie is great!",
            "content": "Looks Who's Talking Now was the best of the three.  John Travolta and Kirstie Alley have so much spark together.  It was a very cute movie and I liked it so much.  I think that it is definitely worth seeing and voting a ten on.  I don't understand why it has such a low rating, but I guess people are ignorant to talent.",
            "review_date": "1999-08-05",
            "lang": "en"
        },
        {
            "review_title": "Mostly fun, some odd scenes...",
            "content": "For the most part this is a pretty fun movie and a good follow up in the \"look who's talking\" series. However, it needed to take another pass through the editing department. The family scenes are really well done and come across well, the plot itself is well developed, and the acting comparable. However, most of the early dog talking scenes and the dream sequences could have gone and not been missed.",
            "review_date": "2020-01-09",
            "lang": "en"
        },
        {
            "review_title": "The movie is for kids! (I love Dogs movies so it for me as well)",
            "content": "Third movie in the series, kids talk on there own now, now it the dogs turn to talk. I grew up talking dogs, So I never really Grown out of these kinda of movies. I love them, I also really enjoyed this movie, This movie was very funny for both parents and kids, there are really great jokes that really work.However this movie as some Xmas moments but never really felt like Xmas movie. all the way thought. Decent Family movie, I love dogs, you will enjoy this more. 6 out of 10",
            "review_date": "2012-11-30",
            "lang": "en"
        },
        {
            "review_title": "Look Who's Sucked!",
            "content": "Ok.. John Travolta needed some money to buy a plane so my guess is that's why he starred in this poorly written/idea of crap. Instead of throwing this one to the dogs, they should have given these two old tykes another sibling to make their lives hell.. but of course someone just said hey, why don't we try animals.. and again these people failed... The original and it's copies should be on the 100 most lamest movies ever made and be burned! Enough Said.",
            "review_date": "2003-02-11",
            "lang": "en"
        },
        {
            "review_title": "Repetitive? Eggxactly.",
            "content": "Gone are Bruce Willis (too bad) and Roseanne (no loss) as the voices of Mikey and Julie, and in are Danny DeVito and Diane Keaton as the voice of the family pets. Didn't we get this with Don Ameche, Sally Field and Michael J. Fox in two \"Homeward Bound\" films? Yep, we did. So Mikey and Julie look like their characters just a bit older, and now Mikey is of school age and Julie is near her terrible two's. The third entry has its charms, but they are of the standard sitcom variety, showing Mikey doing a \"Here's Lucy\" by investigating a luggage tressel and getting the ride of his life and creating all sorts of tension in his disgust over discovering that there may not really be a Santa. For the adults, Kirsty Alley is fired from her job and neer do well hubby John Travolta is hired by the seductive Lysette Anthony to work as her personal pilot.As Christmas approaches, this goes down the territories of many other films we've already seen (\"Home Alone\") or would be done better later on (\"Marley & Me\"), but there certainly are some charming moments like when Alley, Travolta and young Julie perform \"The Chipmunk Christmas Song\" for a saddened Mikey. Julie goes up against professional basketball player Charles Barkley in her fantasies, a cute but pointless scene. This in fact is a whole 90 minutes of sweet, amusing but unrelated scenes that focuses on the antics of mutt Rocks (DeVito) and purebred Daphne (Keaton) who get along like Mikey and Julie did in the previous film. The result is a film trying to force its audience to ooh and ah at pedestrian comedy that snooty Daphne would stick her nose up at.Olympia Dukakis, judgmental of Travolta's seeming lack of ambition in the last film, is now proud of his success, while Alley is forced to take jobs way beneath her including an elf working with a department store Santa. In the first two films, it was reversed so it's Alley's turn to be idle which makes her think that something's going on with Anthony while having dreams about Mikey's natural father (George Segal in a pointless cameo). There's a sense of vintage nostalgia with Julie thinking that she can fly like Mary Martin's Peter Pan while Alley dreams of being Ginger Rogers to Travolta's Fred Astair. Unfortunately the voice overs of Devito and Keaton falls flat even though the lines are witty and intelligent. Their voice-overs are supposed to parallel Alley and Travolta as the humans which seems smart on paper but doesn't work in translation.The situation gets complicated but cloying when Travolta doesn't show up for Christmas Eve, having been trapped by femme fatale Anthony at her luxurious cabin in the woods and Alley takes the kids (and dogs) upstate New York to find him. They have encounters with some vicious wolves (which has a rather unrealistic conclusion) while Travolta tries to outwit the devious fox, Anthony, who could certainly give reason for Travolta's character to claim me too! This attempts too hard to be a feel good comedy, but with what plot that is there, it ends up as a major disappointment.",
            "review_date": "2020-01-29",
            "lang": "en"
        },
        {
            "review_title": "Look Which Series is Failing Now!",
            "content": "Horrible second sequel to what was - before it spread into three films - a clever idea. Baby Mikey is \"growed up\" now - at least to the age of seven - so there's no Bruce Willis voice over, there are no funny gags about a baby's point of view. We just get dogs. DOGS? Yes, dogs. One voiced by Danny DeVito. Sound funny? Yeah, that's what I thought. Film gets ridiculous towards the end, but then again, the entire film was ludicrous from the start. Watch the first film, avoid the sequels.0/5 stars -John Ulmer",
            "review_date": "2003-09-02",
            "lang": "en"
        },
        {
            "review_title": "Look Who's Talking Now!",
            "content": "The first film became a huge hit and reignited the career for the lead actor who went on to star in Pulp Fiction, the second film just repeated the same format and was okay, I didn't have my hopes high for this third instalment in the trilogy. Basically, in New York, Christmas is approaching, and Mollie (Kirstie Alley) and James Ubriacco (John Travolta) are preparing for the holiday season with their young children, Mikey (David Gallagher) and Julie (Tabitha Lupien). Meanwhile, a mutt puppy (voiced by Danny DeVito) is on the run and living as a stray. One day, the puppy bumps into Mikey who is walking with Mollie, he likes the little boy and wants to go with him. Eventually the puppy is caught by dog handlers from an animal rescue centre, he taken into a kennel along with many other rescued dogs. James is a pilot and has been recently introduced to English businesswoman Samantha D'Bonne (Lysette Anthony) who has taken over the airline company and extends his trips to spend more time with him. Meanwhile Mollie is looking for a job after getting laid off. At the mall, Mikey tells the store Santa Claus (Ron Gabriel) that he wants a dog for Christmas, James feels the time has come to get one, and he tells Samantha about this. James takes Mikey to the animal rescue centre; they arrive just as the stray mutt puppy is about to be put down. The puppy recognises Mikey and James decides he wants to take him home; he names the dog Rocks. When the return home, Samantha is there, having already purchases a dog, a well-groomed and beautiful poodle named Daphne (voiced by Diane Keaton). Rocks and Daphne meet each other and do not get along. Rocks is messy and untrained while Daphne is well trained and spoiled. Daphne bonds with Julie, while Rocks gets on well with Mikey. But Rocks is testing Mollie's patience due to his behaviour, including leaving messes for her to clean up, and chewing various pairs of her shoes. Samantha continually asks James to fly various long trips, while Mollie is still looking for a job and taking care of the kids and the dogs. James and Mollie develop tensions over Samantha, as she is concerned that he is having an affair. James states he has faith in his wife and wants her to have faith in him. She agrees to trust him but is still distrustful of Samantha's intentions. Meanwhile, Mollie is becoming increasingly unhappy with Rocks' behaviour and declares a final strike; if he chews one more pair of her shoes, he will out! After another trip, both are in bed on opposite sides of the world and have dreams of the other being unfaithful. James and Mollie still love each other and miss each other while they are apart. As Mollie becomes more tired, Daphne realises that she needs to become more independent. Rocks helps Daphne to develop skills of her own, including opening the door and to use her sense of smell to track people and things. The two dogs start becoming friends. But Daphne previously deliberately chewed up Mollie's most valued pair of shoes, while she had a grudge against Rocks, in order to have him thrown out, but she cannot do anything when Mollie finds the shoes and feels guilty after Rocks is thrown out. However, Mollie has a change of heart when she sees how upset it makes Mikey, and she notices Daphne misses him as well. On Christmas Eve, Samantha tricks James into coming to fancy cabin in the woods, claiming she has a prospective client for him to meet. James cannot leave due to a severe snowstorm and calls Mollie to tell her that he cannot make it home for Christmas. Mollie learns that he is alone with Samantha and becomes worried he is going to cheat on her. Mollie's mother reassures her that if James truly loves her, he would never do that. Mollie drives through the storm with the children and dogs to \"bring Christmas to Daddy\". Their car gets stuck in the woods; they are attacked by wolves, but Rocks fights them and scares them away while his family are in the car. Daphne sets out to find help using the tracking skills that Rocks taught her. Rocks runs out to track down James and eventually finds Samantha's cabin. James finds him and realises that Mollie has set out to find him. He confronts Samantha about her intentions towards him and finally quits his job, then intends to leave with Rocks to find his family. Samantha tries to throw a vase at him, but he shuts the door. The wolves return and try to attack, but Rocks fights them off while James escapes. Meanwhile, Daphne finds forest rangers, who take Mollie and the kids to safety. James finds them at the cabin, and Rocks runs in after. James tells Mollie that if it wasn't for Rocks, he wouldn't have made it. James and Mollie carry Mikey and Julie to bed to wait for Santa to come. Also starring Olympia Dukakis as Rosie, George Segal as Albert, and Space Jam's Charles Barkley as himself, with the voices of Bob Bergen, Peter Iacangelo, Nick Jameson, and Patricia Parris. Travolta is fine as the father and husband, and gets another dance number, Alley is still likeable enough, Gallagher and Lupien are cute as the kids, while DeVito and Keaton are alright as the inner voices of the dogs. With the kids old enough to speak for themselves, there is no room for the voices of Bruce Willis or Roseanne Barr, Homeward Bound: The Incredible Journey was out the same years, months before, the producers probably just thought it was easier to nick the talking animals idea. Two talking dogs heard only by the audience, no matter how cute they are, can't rescue an already exhausted formula, the story is predictable and often annoying, the Christmas element doesn't add anything either, especially the ending credits with the horribly cheesy song \"It's Christmas, C'est Noel\" and montage, it's just an unamusing and pointless comedy. Adequate!",
            "review_date": "2022-10-13",
            "lang": "en"
        },
        {
            "review_title": "Meh",
            "content": "I really like the first film, it was hilarious, cute and relatable. The second wasn't as good, but it still had charm. Look Who's Talking Now was a complete flop. Listening to the dogs talk instead of the babies completely ruined it. It might have been a little bit interesting, but they picked the wrong voices for the dogs and I didn't find the dialogue very funny. It was nice that they had the original cast, but the story in the film was less interesting compared to the others. It wasn't fun seeing John Travolta become serious instead of his goofy self. The kids and Mollie seemed to be an after thought in the film. The main focus was on the dogs which wasn't very interesting and it was on James with his new job and boss. The film lacks in its humour leaving it kinda boring as the story isn't very interesting.",
            "review_date": "2021-04-05",
            "lang": "en"
        },
        {
            "review_title": "Thank heavens this was the last one\u0085..",
            "content": "(Credit IMDb) In this, the third film, it's the pets that do the talking. The Ubriacco's find themselves the owners of two dogs, Rocks, a street wise cross breed, and Daphne, a spoiled pedigree poodle. James has a new job, pilot to the sexy and lonely Samantha. Mollie's just lost hers and is stuck at homeAfter such a cute movie that the first produced, we were treated with a mediocre sequel, then a travesty. Who in there right mind thought this was a good idea? Pets talking didn't cut it for me, and obviously plenty of others, when this tanked miserably at the box office. I didn't laugh once during this movie. In fact I felt sorry for solid talent like Travolta and Alley for having to star in such a pathetic mess. One of the most laughable scenes for me, that obviously tried to come off as cutesy was when Travolta's daughter has a crush on Charles Barkley, and has a scene with him on the basketball court. Also, the pets. What was this, Lady and The Tramp? Performances. John Travolta tries to charm his way through this mess, but can only do so much with the terrible material. He's certainly far from bad, but he's not exactly in the position to do much with his performance. Kirstie Alley also tries her hardest, but much like Travolta, she can only do so much. The kids are OK, as are the voices.Bottom line. Did they not get the memo on the 2nd one? This was clearly unwarranted, and the results showed that. The 2nd one isn't worth it, neither is this turd. Avoid, stick with the cute 1st.2 ½ /10",
            "review_date": "2011-01-08",
            "lang": "en"
        }
    ]
}