{
    "rating": 7.6,
    "release_date": "Invalid",
    "num_reviews": 306,
    "genres": [
        "Kids&family",
        "Holiday",
        "Comedy",
        "Drama"
    ],
    "summary": "The family comedy \"A Christmas Story Christmas\" is the long-awaited follow-up to annual holiday favorite, \"A Christmas Story.\"  This time, Ralphie is all grown up and must deal with Christmas and all that comes with it... as a dad. Peter Billingsley returns to the role that has made kids of all ages anticipate Christmas morning like no other.",
    "reviews": [
        {
            "content": "Better than the original. I loved this movie based in the 70's and had fun watching things that were old-school for me. I watched it a few times and laughed out loud throughout. Not a fan of Ralphie's day dream scenes in the original and in this one, when re-watching I fast-forwarded over those scenes. SPOILER ALERT - One of the funniest 70's throwback scenes was at the local bar, patrons all enjoying a night at the bar when the bar phone rings and you could hear a pin drop. Bartender looks around asking if \"so-and-so\" is there, everyone shaking their head NO. So many things have changed with the death of the landline and this was one I hadn't thought about until I watched this charming movie.",
            "review_date": "2023-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As the considerable classic really set the low bar in terms of debatable enjoyment, it's actually an equivalent to a Christmas gone wrong thus cementing a bad memory except for parts you couldn't help but chuckle when thinking back. While this became a nostalgic edge for its surpassing 2012 sequel that assisted in brightening the enjoyment level, the truest sequel being the purest, whereas most of the original cast returns plus irreplaceably remembered, combines both its predecessors with glorified elements providing an improved connective balance between nostalgic and characterized appreciation. The characters are now likable by wit and hilarious delivery with unexpected warmth as the cast never lost touch of their iconic roles as they performed under improved sensible realization while refining a revival of something notably cherished that also revived the Christmas narrative formula that lessened in usage. Picking among the three that narrates in direct, canonical alignment, this is the best and nicer to watch, therefore strengthening the classic foundation in an acknowledged touching matter. (B+)",
            "review_date": "2023-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad follow up to the classic. It's good to see Ralphie as an adult. I enjoyed it.",
            "review_date": "2023-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hit me in the feels.",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another classic Way to go One that me and my family will Enjoy every year",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ignoring \"A Christmas Story 2\", this is a great follow up to the classic, including many of the original cast.  That said there are tons of Easter eggs and call backs to the first movie, some might get annoyed by it.  Also, like the original, some gross out jokes I could pass on.  But for the most part a good follow up that almost recaptures the original's magic.",
            "review_date": "2023-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly fun and in a very close story telling vein to the original",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "November 2022: 68%. \nDidn't love Christmas story and didn't love that either. The internal dialogue is annoying and corny. Has some funny moments tho and is a cute story.",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm gonna be honest, this movie was actually pretty good though not as good as the original \nThe storyline was well done but there are some parts of the movie that are cheesy and stupid . Overall the movie is pretty good.",
            "review_date": "2023-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I knew going in that it was not going to be as brilliant as the original, I desperately wanted to like. This was a very predictable script with flat acting running solely on nostalgic memories. For me, it ruined the original and left me wishing I had not watched!",
            "review_date": "2023-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I genuinely can't believe this film is getting good reviews. It's a lazy, often uncomfortably unfunny retread of the original with almost none of the charm or wit. \n\nMinor spoilers ahead: \n\nAs it turns out, the parents mostly carried the first film, something I'd always suspected but now know for sure. (I still love every moment of the original; don't get me wrong.) And I'm not sure what I imagined Ralphie's childhood friends ending up doing with their lives, but getting pass-out hammered in a rundown dive bar every day definitely wasn't a guess. In fact, this film has a strange focus on binge drinking. I do realize it takes place in the 70s, but the constant boozing felt out of place and at odds with the chaste, wholesome vibes I expected. I'm no prude, but if I wanted to watch disenfranchised people drown their sorrows in cheap liquor and lament their disappointing lives, I'd go to Applebees. If I'm watching a follow up to a classic Christmas movie, I'm looking to get my heart warmed. \n\nI added a half star to the mandatory other half for the exactly one scene that got a laugh out of me or my three viewmates. Overall, this film added nothing to the original and didn't need to exist. Apparently the nostalgia factor is enough for some, but in my opinion that's hardly necessary for a film that to this very day plays around the clock on Christmas each year.",
            "review_date": "2023-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing will ever replace the Original..but such a good, family vibe, great movie with so many of the original cast, AWESOME!!!!",
            "review_date": "2023-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrid writing and very boring plot to match the original idea of the movie made this one a real stinker.  Yes, Ralphie still daydreams about the same stuff when he was a kid…blah, blah, blah.  I was expecting more; not the same sappy sentiments as the first but how Christmas has changed over the years and how it has become even more commercial than it was in the \"old times\".  Give me the original any day and stop trying to duplicate the classics.",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Usually a follow-up movie is either a-okay or a let down. Thankfully, this lived up to the original! Gave all the same comfy, warm family fun chuckles! This right besides, not behind, the classic! You did good, Ralph! Reaaal good!",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was something nobody asked for but it's still worth a watch in my opinion.",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect sequel, if you liked the original this will not disappoint.",
            "review_date": "2022-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it. Stayed awake the whole time!",
            "review_date": "2022-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A worthy sequel that mostly hits the right notes, and makes for some heartwarming moments of nostalgia. The voiceover takes a little getting used to.",
            "review_date": "2022-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is ok. It lacks the originals charm or childhood fun but is a fine story. About 20 years too late.",
            "review_date": "2022-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not a movie that a newly widowed person should watch. It just made me hate this holiday season even more.",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some funny moments, some very touching moments.  Narrated in the style of Jean Shepherd but it doesn't go over the top--a nice homage.",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a true classic. It never gets old.",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The characters were just as lovable as they were back then!  I can see this being an annual tradition movie!!",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of heart and a great continuation into the next generation without tarnishing the original but holding it up as an example in time.",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Noting like the original story and I kinda liked it because it told a whole new story than Being a remake of the first",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It had references to the first movie but not overly so. The plot did a good job of moving forward in time but felt comfortable with characters you feel you know.  I think they did a good job with this sequel nothing will ever top the first movie!",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"A Christmas Story\" is a perfect movie so any offshoot affiliated with the original is a tall order. \"A Christmas Story Christmas\" does manage to capture some of the same magic as the original which is an amazing accomplishment. It did not pull off a better than the original like Maverick and T2, but it was good enough to be added to my Christmas rotation for future years.",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": " Of course it’s not better than the original. It’s not trying to be and is about the nostalgia. ",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie did exactly as I had hoped it would. It made us laugh and cry. Myself and my kids thoroughly enjoyed it.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Christmas movie I have watched in a long time!",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We were excited to see this, love the original, and had high hopes. We turned it off 20 minutes in. The acting is terrible, the script even worse, and it is quite simply unwatchable. Just don't do this to yourself. Watching paint dry is a better use of your time.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic sequel, it really keeps the spirit of the original movie",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The family really enjoyed this follow up to the original Christmas Story.  Critics are complaining that it's too nostalgic, to which I'd say, \"well, duh, what were you actually expecting?\" We'll be adding it to the seasonal movie rotation.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing redeemable about this movie. The kid actors were insufferable. The script was horrible. It ruined my Christmas. I'll never get back this hour and a half of my life.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad. Nothing of what makes the first one good. Basically just a collection of scenes. Mad at rotten tomatoes for having  decent score before I wasted the time to watch this.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I triple dog dare you to find anything good about this silly and utterly unfunny sequel. \nHalfway through, I shot my own eye out.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "boring; couldn't get past the first 20-30 minutes without thinking what other movies i could be watching with my hard-earned vacation time..",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie...reminds me of the original with original cast!",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was really slow and we stoped half through because we were so bored.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hopes were low that they could recapture any of the magic but not only did they, they did with real heart and affection.\n\nEveryone was great and Julie Hagerty did amazingly filling in Melinda Dillion without seeming like an impersonator.\n\nIt was great that everyone came back for an encore so we've finally got a true sequel made to the Christmas classic.",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie. It captured the nostalgia of the original. This will be a yearly Christmas Season watch!",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie with a good ending! Links to the first movie pretty cool. Well done!",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original \"A Christmas Story\" becomes a legend as a Christmas story. TV station shows it all day long in Christmas eve. Everybody watch it during Christmas time. Of course people is waiting for a sequel. The so called original sequel \"A Christmas Story 2\" was out but it was bad! Just like most of the movie sequel, very disappointing! I am so glad they make this new one \" A Christmas story Christmas\" to make thing right.  I will rather call this one a follow up, not sequel because they have almost all the original actors (except the mom, too bad) in this new one. It is truly a follow up story from the original. It is fun to see all those kids grown up as a adult. Besides that, the story is very well written. Absolutely not boring and not corny. It is funny, touching and sentimental. My wife and I love it. We absolutely love it. I have to say that: if you love the original A Christmas Story, you have to see this and you will also love this one too. So forget the \"A Christmas story 2\". Throw it away. Keep the original \"A Christmas Story\" and this one \"A Christmas Story Christmas\" in your Christmas movie collection. I hope the TV station will air these 2 movies back to back every Christmas eve from now on. This new one should also become the legend in Christmas movie. Well done, Peter.",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't even read any of the other reviews.  This movie was good.  Had the feel of the old Christmas a story.  Peter Billingsley Touch as Ralphie, and his contribution to this movie is evident.  Good Xmas flick",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great revisiting of the house and family on Cleveland Street! Touching, funny, well written and well acted. It will be an annual tradition to watch!",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my family, I am the old man.  I didn't think that a sequel would even come close to the original.  All that I can say is \"BRAVO\".  It was heartwarming.  Thank you Peter Billingsley. Vince Vaughn and the production crew.  Thank you Hungary!",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sequels rarely live up to the billing but this is a really enjoyable homage to the original. Tons of fun nostalgia and it's really nice seeing the old cast back together!",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than most Christmas movies...brought back memories of my father.",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not going to be as iconic or great as the original but it's often heartwarming and funny but this is the best sequel We will ever get",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ralphie just seems like a jerk in this movie. The whole joke of the narrator being a jerk doesn't work as well when its the same voice as the main character. I loved the original because it felt like a real family having a normal Christmas while this one feels like characters we all love getting dipped in Hallmark goop. Also Randy is mentioned so little in this movie it should be retitled \"Where the hell is Randy?\"",
            "review_date": "2022-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just enough nostalgia for the fans of the original, but this is its own story. While A Christmas Story focuses on the magic of Christmas through the eyes of a child, this film focuses on the stress of adulthood in trying to achieve the perfect Christmas. A bonus is that most of the original cast was able to return for this film.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The love, charm, and humor that Billingsley and the entire cast bring to this movie makes it a very worthwhile follow-up to the beloved Christmas classic, \"A Christmas Story.\" As a tribute to the late Darren McGaven, it's stellar.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A couple of the jokes were a little stale, but it was very entertaining overall.  I like the fact that it didn't coat tail too much off the original.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bringing back the young-now-middle-age cast of the original for one last run down nostalgic Christmas memory lane, this sequel is worthy enough to be paired with the classic.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent job of bringing the story full circle and showing the holiday season from the other side of the life span.",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's forgettable. The very final scene does end well. Story beats in the middle didn't land too well, however.",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything you would want in this warm sequel. It is a heartfelt joy ride throughout the entire movie.  If you love this movie I highly recommend!!",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very memorable sequel to a classic. Great film from start to finish!",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was really awful.  I stopped at the 'hiding from the carolers' scene.  If their whole goal was to engage in Christmas and capture the spirit, why?  Only real die hard fans of A Christmas Story will enjoy this one.  I myself am a fan of the original and did not care for this one.  It's a ripoff of Beautiful Girls.",
            "review_date": "2022-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sweet story that is easy to figure out but still entertaining and will make you tear up a bit.  Its sad the mom was recast but the replacement did a good enough job at trying to stay true to the character.",
            "review_date": "2022-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing cinematic masterpiece. An amazing way to honor Darren McGavin's memory. A true family nostalgic film for all to see.",
            "review_date": "2022-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the original (how could it be?).  But a worthy sequel with plenty of funny, nostalgic, and heartwarming moments.",
            "review_date": "2022-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the writing, story, narration, acting, setting, costumes and just about everything about this movie. Refreshing to see a well-made new Christmas movie",
            "review_date": "2022-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although sweetly predictable, I still enjoyed it. I like that the recreated scenes and Ralph's wild daydreams. All very cheesy but I'll take it.",
            "review_date": "2022-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Forget the other sequels- this is the perfect follow-up to the first and a fantastic legacy sequel that respects the actors. Not to mention, its tie-in to the first film is one to put a smile on the face of fans of the 1st movie.",
            "review_date": "2022-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original Christmas Story has been loved and shoved into the pop culture zeitgeist to such a degree that no sequel could ever match its popularity. It's an amazing feat that anyone would even attempt to approach the idea. The reception of previous attempts have been lukewarm at best. I'm not quite sure what anyone expected by this endeavor by most of the original cast, but it is an absolute love letter to the much beloved original. I literally enjoyed every minute. I have no specific complaints. I was just simply happy to see Peter Billingsley return and hope that everyone opens their heart to a new chapter. I teared up several times. Thank you to Mr. Billingsley and the filmmakers for making me laugh, cry, and revisit wonderful Christmas memories. Please give it a chance.",
            "review_date": "2022-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas Miracle of a Movie. Ralph is back and it Joyous Fun Time for the Holiday Season. Nostalgia, Yes but delivers.",
            "review_date": "2022-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ralphie character / narrator doesn't work.... It worked in the first movie because it was an old guy looking back on his childhood and recalling it and there was a charming quality to it. Now it's just a middle-aged guy commenting on himself, and the ralphie character hasn't seemed to really grown or evolved in any meaningful way 33 years later. This is dog s***. It's not funny it's not cute it's not charming it's pathetic. I'm not even an hour into the movie and I'm only waiting for the inevitable BB gun scene at this point. Oh look they just arrived at the mall and they're going to do the Christmas Santa scene. Poor Julie haggerty. Shoot me. Now.",
            "review_date": "2022-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had high hopes for this sequel, but as is usually the case it was not good. The first thing I didn't like was the voice narrating and that Ralphie looked old. He should've done this at least 10 years ago! Then the plot wasn't entertaining at all. If it'd been I might've been able to overlook the first two annoying things.",
            "review_date": "2022-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Predictable, but fun.",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was cute. And heartwarming in certain parts. A story fairly effectively told in the remnants of a cobweb-covered childhood memory. Not sure how much more anyone could have hoped for than that.",
            "review_date": "2022-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Refreshing, updated, kept to the original but better. No corny or cheesy. A much needed movie and brought a smile and a tear to me, thank you.",
            "review_date": "2022-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Couldn't finish watching this movie. The internal monologue was awful to listen to.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good, very good.",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great sequel to the best Christmas Movie ever… Fa-Ra-Ra-Ra-Rah Ra-Ra-Ra-Rah",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly good! Very heartfelt, funny, and true to the spirit of the original.",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WOW WOW WOW!!!!!!! They haven't made a good Christmas movie since Elf in 2003. And the ONLY decent Christmas sequel until now was Home Alone 2. This movie is an absolute keeper!!!!!!! THANK GOD! We really needed this! Loved every single bit of it! The original Ralphie is a legit HERO for writing this and making it!",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow opening that gets unexpectedly better and better. Takes a half hour too long for the film to warm to a comfortable balance of good storytelling, character situations that viewers can care about, and slapstick humor that is a necessary homage to the original.\n\nThe film's creators artfully rescue everything in the end with several sudden unexpected big heartstring plucks of thoughtful family surprises. And a cleverly placed last scene's fade out narration words that twists the entire film into standing as a prequel to the original.",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming and hilarious, A Christmas Story Christmas is an instant holiday classic. A great tribute to the original and to the characters who are and who are not still with us!",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming movie. There are some corny parts, as designed but truly worth watching. And watch it all the way to the end.",
            "review_date": "2022-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For children who grew up watching a Christmas story, it fits narratively as those kids will have grown up and become adults, and it perfectly encapsulates the charm and wit that made the first movie so successful. It brings a captivating look as to what parents go through to give their children the best Christmas ever and has many callbacks to the original film that feel earned. Definitely a good watch and fits perfectly with the first one, despite not reaching the same heights as the original, and the moments where they try to add something more memorable ends up falling a little flat, and pale in comparison to the quote \"You'll shoot your eye out,\" that have become a staple in pop culture for years",
            "review_date": "2022-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a very disappointing movie.  I waited for a while thinking it's got to get better, but it just got worse.  I only got through about half of it and turned to something else to cut my losses.  The characters were pathetic, not funny.  I wasn't expecting it to match the original but this was just unworthy of any connection to that great Christmas classic.",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was great, not 24 hours straight great, but great",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad I couldn't even get half way through. Shameless cash grab by all involved.",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, I thought I wasn't going to enjoy this movie. I watched it because I just wanted to see something new, but I honestly enjoyed it way more than I thought I would. The story nicely makes the transition from seeing Christmas through a child's point of view to trying to live up to the magic of the season as an adult. Mind you, the original is still the best, but this one does hold its own. I love the recasting of Ralphie's mom from the retired Melinda Dillon to Julie Hagerty. Excellent choice!",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's great to see Ralphie all grown up with a family of his own but as far as the plot did not see much reason for this movie to be made other than nostalgia but still recommended.  Its a fun movie.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoy this movie. A good surprise for the lovers of the original. I like that it is a different story not a rehash.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good, sappy fun. I wish Ralphie's orginal mom had returned. Julie Hagerty filled in well, but Melinda Dillon would've perfected the nostalgia. Still, with so many of the original actors, and a good story to give them life, this one was well worth the watch.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dangerous reboot to make because it looks like a money grab. Played it safe though. Not over the top, kept the original's style without trying to be an exact copy.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As good, if not better, than the original.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing compares to the original, but this movie made a good attempt and showed care in their attempt to bring a sequel back that both stands on its own while also being a bridge back to the original. Worth the watch",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The perfect mix of nostalgia and new. Wonderful, heart warming family movie full of laughter and tears. It was an absolute treasure to watch this movie and see the kids all grown up after all these years.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a few cringeworthy jokes but its heart is in the right place. The story works really well, and the film gives you many callbacks while still doing its own thing. Great to have the cast back, though Randy is not used anywhere near enough.",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a huge fan of the original - I'm one that's happy to watch every year for the nostalgia. This movie adds to that nostalgia. Well done.",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a big Jean Shepherd fan, This movie has it all. It pays homage to the great storyteller throughout the whole film.  Getting most of the cast back from the original made the movie even more heartwarming. It's funny and sticks to what it is meant to be a story about life growing older and Christmas. This is definitely going on my top Christmas movies list. Flick lives!!!",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a sad but happy sequel. I'm still very confused about the whole timeline and that this is a 70s movie and the first movie is a 40s movie but came out in the 80s. Very confusing. Anyway besides that the movie is a good time. I have no complaints. It's nice to see Ralphie back. I recommend this movie. Nov 18 22",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hope that most that weren't aware that there was a sequel to A Christmas Story watch this film instead of the ACTUAL sequel to the film made back in 2012.  This film has it's issues as well and it's not likely going to be one that ever gets a 24-hour continuous marathon, but it does act as a serviceable next chapter.  The first film basically caught lightning in a bottle.  This film caught \"lukecool\" Diet Coke.  You can drink it and it's not terrible, but it's not as good as it could be.",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has lots of heart and nostalgia. It reminds us of what we loved about the original movie.  We got to see these characters as adults now.  I really liked it.",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"A Christmas Story, Christmas\" somehow surpassed \"A Christmas Story\" for me. I know that's a crazy statement to say but I've basically aged with Ralphie. When since we first saw the OG movie we were told the story from a middle school kids perspective.  Now, as a middle aged man myself I can truly identify with the struggles from a parental perspective. \n\nAll of the throwbacks to the original were captured perfectly, amazingly well done. From the cut scenes, triple dog dares and the bully beat down this movie truly relives those moments in this film without it feeling awkward. \n\nGreat movie. A must see Christmas movie along with the original.",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loves the movie. The sequel normally can't top the original,  and that stands true for this one as well but I absolutely enjoyed it. Loved how the ending created the full circle.  So nostalgic,  will certainly be watching again.",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was so so good! There was so much homage to the original but was new and fun and nostalgic. Loved it!",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was skeptical at first but ended up really loving this. So many of the original cast, beautiful parallels to the original, and all the warmth and humor I was hoping for. Even cried a little, which I wasn't expecting. God bless the Old Man.",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely fantastic!",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it! A new Christmas classic!",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While this movie in no way matches the quality and true timelessness of the original A Christmas Story, A Christmas Story Christmas makes up for the other wretched excuses for sequels. Unlike a Christmas Story 2, an uninspired cash grab requiring nostalgia even to be remotely enjoyable. A Christmas Story Christmas is enjoyable all the way through and never feels too nostalgia-heavy. It truly does tell a great story about a man trying to step into his father's footsteps and make Christmas great as his father did for him. A true highlight of this movie was the car ride with Scut Farcus expanding on his story after the events of the original. The returning actors all did great, and they truly were the thing this film needed to go from good to great. A great Christmas flick and a must watch for Christmas Story fans",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Couldn't be happier they finally made a sequel the original deserves. This movie will be on the holiday docket at my house for years to come.",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watch the original movie for 24hrs straight every year. I LOVED this movie. It has the cheesiness of the original, Ralphie's daydreaming skits, the storyline is great, plenty of funny moments, Flick gets his revenge on Schwartz (hilarious scene), original characters and where they are now. It was funny, sad, and nostalgic. I truly believe anyone who doesn't love this movie really isn't a fan of A Christmas Story. I've watched it twice now! And I will watch it again. Hopefully it comes out on DVD ASAP so I can add it to my collection.",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed it. All the old actors came back and it was sweet.",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "expected a flop... was so nice to be wrong... i really enjoyed this movie... lots of the old characters all grown up. it managed to get plenty of laughs and a few choked up moments as well. they did a great job with this. totally recommend it. nothing can beat the first... but hats off for doin soo well... going to make the whole fam watch this one this year! ty!!! Merry christmas!!!! :)",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't sure what to expect, but I wasn't disappointed! Nothing will ever be as great as the original, but this comes pretty close! The acting was great, the flashbacks were fun. I cried when they opened presents. Really impressed.",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting is poor, and the story line was boring and over done.\n\nThis movie shouldn't have associated it's self with a perfect gem. It cheapened the real movie.",
            "review_date": "2022-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely loved it, if you're a true fan of the original movie you'll love and appreciate this one. I will be watching this annually along with the 1st one.",
            "review_date": "2022-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't have asked for a more fitting tribute to my childhood favorite movie. It wasn't a cheesy remake, or a sequel with recycled jokes. It was a love letter to all that grew up watching the original over and over again every Christmas. Now I have to watch them both back to back every year now. Thank you for a wonderful holiday gift!",
            "review_date": "2022-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this since Holly Richardson recommended it.  It had some good moments, but ultimately it was a cringe worthy.  Credit to the director to keep the story flowing and keep interest even though we wanted to turn it off.  It was on HBO.",
            "review_date": "2022-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Our family loved it. For us it had all the feels!",
            "review_date": "2022-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review: A Christmas Story Christmas \n\nA Christmas Story Christmas is a genuine treat, a gift for those of us who have grown up with the beloved Bob Clark original. \n\nThe story - set in the early 70's - follows a grown Ralph Parker ( a returning Peter Billingsley, who assumes narration duties from Jean Shepherd, on whose writings the original was based) revisiting the familiar house on Cleveland Street with his wife and children after a phone call from his mother delivers extremely sad news:  The Old Man has passed away.\n\nThe rest of the film chronicles Ralph's efforts to give his family the same holiday experience the Old Man always seemed to do with ease, only to discover how infrequently it's as easy as it looked when he was a boy . Along the way he reunites with Schwartz, Flick and even his old bully Scott Farkus. \n\nMany people may not be aware of this but between television films, direct to video sequels and an unsuccessful theatrical sequel directed by Bob Clark himself, A Christmas Story Christmas is roughly the eighth project inspired by Shepherd's work. \n\nIt's also the best since A Christmas Story. What sets this film apart is the approach. This is as much a love letter to the original as it is a sequel and it really feels as if we're revisiting this charming cinematic world forty years on. \n\nThe cast is excellent across the board, with Billingsley providing a strong center.  It helps that the actors portraying Schwartz, Flick, Farkus and even Ralph's younger brother Randy were brought back to portray their older selves. It feels like a homecoming and that chemistry quickly reestablishes itself.\n\nIf there's one aspect of the film that's different, it's the structure. Though this movie still has a through line of comedy, it leans a bit more to the dramatic side of things than its predecessor, particularly in regards to dual subplots about both Ralph's attempt to write an epic science fiction novel and his struggle to find the correct words to summarize his father in an obituary. The way these two threads eventually dovetail is as sweet as it is rewarding. Expect to go through some emotions as the film unfolds. It's impressive how well those heart tugging scenes sneak up on the viewer. The moment Ralph learns of his Dad's passing is particularly potent as - for a moment - we see in Billingsley's face that same young boy who smiled lovingly at his father upon realizing the Old Man had come through with a Red Ryder BB gun all those years ago. \n\nThat said, the film does boast some genuinely funny moments. There are a few reasons for this.\n\nOne is the humor is relatable, only now it's relatable to those of us who grew up with the original because we're adults roughly the same age as Ralph and that's the perspective we experience Christmas from.\n\nAnother is the use of callbacks peppered throughout the film. A Christmas Story Christmas understands how to incorporate callbacks better than any movie I've ever seen. These are not cheap rehash moments. These are functional, such as years of resentment over the  tongue on the frozen pole schoolyard incident leading to an all new challenge being presented or the fact that Ralph still tends to drift into daydreams even as an adult ( an early example set in a publisher's office is very, very funny) .\n\nBut if there's a singular point from which the real comedic genius of this film originates, it has to be Julie Hagerty, who takes over the role of Ralph and Randy's mom from Melinda Dillon ( who retired from acting in 2007).\n\nHonestly, I was concerned when  I read Hagerty was in this. I enjoyed her in the Airplane! movies, but Melinda Dillon was one of the best things about A Christmas Story. I wasn't sure Hagerty was a good fit.\n\nI needn't have worried. Not only does the actress deliver the goods when the story calls for her to be serious, Hagerty proves she still has excellent comic timing and delivery, aided by a screenplay that allows her to be at times endearingly condescending or, alternately, delightfully weird.  She and Billingsley are the MVP's here without question. The scene where we find out what they really think about Christmas carolers is brilliant. \n\nI've been sick for a day or two having apparently caught something over the Thanksgiving holiday and I wasn't feeling well when I got around to watching A Christmas Story Christmas.  Despite that, by the time the end credits began to roll, I was grinning from ear to ear and I felt really good inside.\n\nThis is an excellent, honorable legacy sequel. It won't replace A Christmas Story, but it will earn a place next to it as part of my annual holiday veiwing line up moving forward. It's really rewarding to see someone still knows how to make a warm, funny holiday film that bears the message family, friends and above all love are what's most important. In this cynical age, that's a breath of fresh air. \n\nIn embracing its gentle and nostalgic soul, A Christmas Story Christmas proves that even decades later, you really can go home again.\n\n****1/2 out of ***** \n\n- D. S. Ullery\n\n#AChristmasStoryChristmas",
            "review_date": "2022-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is not good at all. A 76% on RT? Seriously!? The acting is painful. The plot is weak and cant decide if it wants to be \"A Christmas Story\" or \"Christmas Vacation\" sadly its neither and is best left off your holiday movie list.",
            "review_date": "2022-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly good remake",
            "review_date": "2022-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to say this harrows the same Christmas spirit as a charming update as the true followup to the 1983 classic, albeit a smidge pedestrian. For those who remember Ralphie as a child, this grounded tale reminds us that kids eventually have to grow up. Filled with callbacks and original cast, with some nuances, it was truly enjoyable to kickstart the holiday season.",
            "review_date": "2022-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a true sequel. It brought back all the original actors, and the writing was perfect. The ending was awesome, and I can't wait to show this to my kids when they are older.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of heart that did a great job of bringing the characters back without relying on being a retread of the original.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you love the original you do not want to miss this one.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plenty of nostalgia and reconnection with these characters abounds.  This is an excellent trip down memory lane with a heartwarming story to get you there.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plenty of lovely throwbacks to the original. Met most of my expectations and I was happily surprised with the movie. Far from the success of the original but a sufficient sequel.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We have had more than a handful of rough looking sequels out there but thankfully to me this isn't one of them. Loved it!",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie about an all-grown-up Ralphie trying to give his family the same kind of Christmas he looks back on fondly from his childhood provides the origin story of how A Christmas Story came to be written. It has the same kind of wholesome midwestern humour as the first movie with a bit more nostalgia and sentimental notes added in. Memorable for bringing back some of the original actors now all grown up, this is a funny, sentimental Christmas movie.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is so good.  In a season when the bright lights of the world are spewing out Santa Slasher movies a predictable, yet comforting tale of wholesome goodness emerges.  Take the time, down memory lane, to enjoy this tale of tales.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite an odd film.  Here we were, sitting down to watch a wholesome, family Christmas movie and all was going okay until THE SCENE WHERE HE GOES OUT SHOPPING FOR HIS KIDS CHRISTMAS PRESENTS!?  Hello??? The golden rule anyone??   This appears to be a kids Christmas movie which presumes you know santa doesnt exist.  What were they thinking.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it! It has a lot of the same charm as the original.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well done. Grasps the nostalgia and pacing of the original while adding fresh (ok, 1973) material !",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful sequel to the original! It hits home being that my dad past away in June at age 84. This movie made me laugh, cry and bring back memories of Christmas from the 70s. I miss my old man and know that he too would have loved this movie.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was excited and yet, extremely nervous about watching this movie, as I grew up on the original- I mean \"you'll shoot your eye out kid\" and \"fragile\" are part of my every day vocabulary! So going in I didn't really know what to expect or what I was hoping for. The way they did this movie was nothing less than perfect! It was delicately respectful of the first one, with the way they did the throw backs.\nI knew from reading the synopsis and obviously knowing that the incredible Darren McGavin passed away in 2006 (RIP) what this story would be based around, and honestly it was done so well!\nI laughed, I cried, I screamed out curse words like \"oo fudge!\" \nBravo & 2 thumbs up to the writers of A Christmas story- Christmas for the way they were able to achieve such an incredible quintessential balance of something new while never ruining the something old! \nIf you are a fan of the original, you definitely HAVE to see this!",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is no way this movie could have scored in the 70's! I think the decimal got moved. A 7 i would believe. This is undoubtedly one of the worst movies i have seen in recent years! I can not get that hour plus of my life back… :-(",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed It alot had lots of memories from the first picture well done movie",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you loved the original, you will enjoy this. It's a wonderful homage to the stories of Jean Shepard. I particularly liked Ralphs fantasies of his imaginary successes.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It felt unwatchable. How did anyone rate this positive.  It attempts to play on nostalgia but Peter Billingsley is hard to watch. Was so hoping it would be good. Very disappointing",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So sweet and nostalgic.  Our whole family laughed and cried!",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it isn't close to the original it is great that all of the original kids are in it.  i did enjoy it",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was fun and sweet. It was great to see some of the original cast back.",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was better than I hoped!",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really loved this. Great sequel to a great childhood memory.",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great sequel that keeps you on the edge of your seat! It's really funny but doesn't go over the top like with what Thor Love and Thunder did.",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While never attaining the greatness of the original, this is a solid followup to the 1983 classic, if only as a nostalgic return to the familiar.  A bit uneven at first, the film really comes alive in the second half.  It was so great to see Peter Billingsley as Ralphie again, but the other actors, especially Zack Ward as Scut Farkus really sealed the deal.  It could have gone wrong in so many ways but the scenes between the two characters made the film in my opinion.  And while I would have loved to have seen Melinda Dillon back as Mother Parker, Julie Hagerty was well cast as her replacement.  All in all, this as a good film, and while there will never be a 24 hour marathon, it arrived just when we needed it.  Let's just forget about all of those other sequels, okay?",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed it.  There was a good mix of nostalgia from the original mixed with enough new material and light comedy to make it a fun watch.   I love Julie Hagerty cast as Ralphie's mom.",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved every second of this and after almost 40 years later this movie has put me in the christmas spirit.",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you liked the original you'll love this one. Well done, with the just right amount of nostalgia and story.  The ending was really really good as well.  This will go on my yearly watch list",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I turned on HBO Max with the intention of watching the original A Christmas Story and made the best holiday mistake by selecting A Christmas Story Christmas and boy was I pleasantly surprised. This movie made me laugh so hard! It had the feel of the original with the narration and bringing back a good portion of the original cast members (including Ralphie himself). The comedy was unexpected but spot on for the type of slapsticky humor it provided. \n\nI thought it was about as good as you can get as a sequel to such a classic. Give it a try!",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just finished watching it and loved it! Definitely a great movie to add to the classic films in the month of December.",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don’t know why this movie has so many positive reviews. It has heart, but seriously lacks charm and appropriate pacing. Ralph’s voiceover only worked in the original; now as an adult in this movie, the voiceover seemed weird and overused. The entire movie was awkward, and not in a funny way. ",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice companion to the holiday classic!",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great sequel to the Christmas classic!",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Going in, I thought it was gonna be a cheesy rehash, but I was delightfully surprised at the storyline and the fact that it is a slight rehash, but was done well and pretty clever. This is a new classic!",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fell asleep, as did other family members while watching, after being super stoked and excited to see this movie on thanksgiving day. Probably could have done without this reboot altogether. Poor remake using nostalgia as the only engine behind the movie. Nothing new to see here. Did not like the new mother. Poor choice of including the death of the old man in a storyline that is supposed to be about the pure delight of Christmas. EVERYONE knows the old man is no longer with us, should have never been included in what is otherwise a lousy plot. Really surprised that it has gotten any praise. As a kid of the 80's, extremely disappointed.",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At the end of the movie, I found myself really enjoying it. When I first started watching it, I thought it didn't quite capture the same charm as the original. But that quickly faded away. I loved all the callbacks to the original movie. I loved that the same actors reprised their original roles (where possible), and I will definitely be rewatching this one for Christmases to come.\n\nIf you're a fan of the original, please see it. If you've not seen the original, watch it, and then watch this.",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A worthy sequel to the original that the entire family can watch. Watching the original movie as a kid, and now watching this as an adult with my own children really hit me emotionally because the themes of the film deal with growing up, losing our parents, and having to take up the role of patriarch/matriarch of our families which we feel woefully under prepared. The secret our parents keep from us as children is the same as we keep from ours. We don't feel \"old\", and we have no idea what we're doing half the time, so like Ralphy we put on our faces of \"I've got everything under control\".",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect? No. Nostalgic? Absolutely! Be prepared for the heart strings to get tugged. Stay for the pics during the closing credits.",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There were hilarious moments I liked, and Its good Christmas movie I have ever seen. I recommend watching the first then this one.",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the legend continues.  a \"ragile\" classic tale boldly retold with a lot of the same characters and ejoyable new ones  i loved it.  good job you guys!!!  watch this one, you wont be disappointed.  Merry Christmas.",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was going to be a cheap cash grab. But thankfully it wasn't.",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "0/5 Worst Christmas Movie ever.",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They tried to do too much, say too much, narrate too much. Too much fan service. Just too much. The pacing to cram it in was too fast. It had some good scenes. But most were meh",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great sequel to a holiday classic, our family loved it and will watch this every year with the original!",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seriously, endless 5 star reviews? These paid bots need to reel it in a little. It's just ridiculous at this point. At least try to make RT reviews slightly believable.",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Building on the perennial classic, this heartwarming sequel delivers maximum nostalgia and beautiful, emotional moments for the whole family. Wonderful!",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie actually was on par with the first one. It was touching, lighthearted, and fun the whole way through. They did a great job sticking true to the original character Profiles. I am looking forward to spending every Christmas watching this as well as the first Christmas story from now on. This is 100% a must watch for every Christmas enthusiast",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Recommend rewatching the original movie first - getting you in the spirit. The sequel was exceptionally well done! Laugh out loud funny and heartfelt. A real treat!",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was painful to watch even the first twenty minutes.",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a die hard Christmas Story fan, I was very worried going into this one. Decades later sequels can suck big time. Turns out, I had NOTHING to worry about. Peter B did an amazing job putting this together. It is a true love letter to the fans and a beautiful tribute to the actor who played the father in the original. This movie is jam packed with references and so much of the original cast is in attendance. NOSTALGIA!!!! This is definitely in my Christmas movie rotation from now on.",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let me start by saying that when thanksgiving week starts, I start watching thr Christmas Story over and over and over and over until end of December.\nNow I have this sequel to alternate. My wife is already rolling her eyes with this idea.\nWhat an early Christmas present this movie was.\nI wish The Goonies had a sequel like this one.",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was fabulous. Many years ago when the original Christmas Story was in the movie theaters, it was one of the first films in my life that I ever sat through twice in a row. I love the original movie. I have the 25th Anniversary DVD, which I watched more times than I can count. I watched the marathons on TV every year. I know literally every single line of this film by heart. I really wasn't expecting much from a sequel. (I was ready to be underwhelmed). You can tell that this film was lovingly made. It has the complete Spirit of the original. It made me laugh, it made me cry, it gave me the warm fuzzies that the original did. Only a truly cynical person would give this anything less than an excellent review.   \n(And a sincere bah humbug! To all of you that did!  You're all getting coal in your stockings.) If you love the original as much as I did you will absolutely love this. And the fact that they got all the original cast members to reprise their roles was amazing. Thank you for doing this Ralphie!",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well done. A path down memory lane and a great way to start the holiday season. ",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nostalgic, well-written, heartwarming, camp & true to the original without a dull moment.",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So fun to see the cast now. Really sweet storyline and funny. Will watch it again and it will be a tradition like the first one",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "None of the jokes landed. Gave it an hour but couldn't finish it.",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great job on an unsuspecting sequel. The kids and I enjoyed this one from beginning to end. ",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meh.  Moderately entertaining, but nothing special.  Lots of tired tropes.",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If Christmas story is your favorite holiday movie like me then your in for a great treat.:) i smiled ! I laughed ! I cried! I was born in the 80s so I am not to much younger then Ralphy so it was really close to home. I absolutely love love loved it 💯💯❤️❤️❤️🎄🎄🎄🎄🎥❤️🎄❤️🎄🎄❤️🎄🎄 thank you for making this for us ❤️❤️🙏🏼🙏🏼🙏🏼",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had potential, lots of potential but it was just not good.",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The perfect sequel to the perfect original classic Christmas film of all time. Laughed and cried the entire time.",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was excellent Peter billingsley did a terrific job bringing this movie back it was funny with respect to the original movie Darrin McGavin would be so proud of ralphie the tribute to Darrin was amazing also bringing most of the original cast was a nice touch it's a job well done Mr Billingsley",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this as an homage to the original. Lovingly made, touching. Thank you Peter Billingsley for honoring the film we all love.",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not worth the time.  There was way too much heavy-handed Ralphie voice-over which basically ruined this movie. The enjoyable thing was noticing how the cute kids from the 1983 original have morphed into odd looking adults. Sorry to be mean this time of year, but this should not have been made.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than I would have ever expected it to be. The call backs and original cast members was so cool to see. The actress who played Ralphie's mom was hilarious. The ending was so great. Don't want to give too much away but perfect way to tie the two movies together.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a lot of fun. I love the original and I'm a big fan of Jean Shepard's writing. This movie catches all the right stuff and pushes the right buttons. Peter Billingsley is great, both as Ralphie and as the narrator Ralphie. Seeing all of the original cast (sans Darren McGavin, who passed away, and Melinda Dillon, retired from acting) back was a lot of fun, even Scut Farkas.\nSome critics will say it trades too much on the original. It kinda does, but it is also it's own movie that stands along side the original quite well.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie, watched it 4 times now with my 9 yr old. My son gives this an 7/10 & the orig. a 8/10, for me I give this one 8/10 and the orig. 7/10. Either way this one and the orig. gave us lots of laughs.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For my nephew, husband and myself, it was a wonderful experience for a family night.  All of us being over 25 means we grew up either when \"The Christmas Story\" came out, or enjoyed it over the years and is a wonderful tradition for opening up the holiday season.  With my nephew being here before Thanksgiving and unfortunately unable to be here for Thanksgiving.  We took the opportunity before Thanksgiving to watch it.  Both the boys stayed awake, and engaged (you know how they just LOVE to fall asleep on the sofas when they dont really care that much for a movie!).  This movie will sure to become a classic and is a wonderful addition to the Christmas Story (unlike the Christmas Story 2, ugh, that was in my opinion horrendous!)  I experienced a range of emotions while watching this movie, delight, sadness, lol disbelief, horror, relief, joy, and most of all the feeling of familial love.  \nI have not read any other reviews because I did not want to go into the movie with any biases.  I've had that experience before with other movies, but I did want to share my thoughts and feelings on the experience I had with my husband and nephew from the first time watching this movie.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure why, but the acting here didn't make a lick of sense to me. I'm all about 80s nostalgia rehashes, but are you telling me that some of those were the best takes they got? I loved how it ended, wonderful story, but a lot of these actors looked very out of practice, I think it took away. But how about Farkus being the best-looking and the best actor from the OG bunch? He was awesome here. Nevertheless, I hope we see more out of this story. This has legs at least.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should have left it alone, but y'all made a part 2. A part three just made things worse.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie had so much potential after the first one became such a staple for the holidays. they had so much time to make it good and it just fell so flat. it seems kind of predictable in the beginning that you knew what his best writing was going to be and it just seemed like not much thought went into making an actual plot.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't expecting this to be better or as good as the original, but I was expecting……something? The original Christmas Story is a timeless classic, and I watch it religiously during the holidays. But this one? This one emphasizes the fact that not all movies can endure a sequel. And watching this might make you want to shoot your eye out.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The critics won't like it because the focus is on the working class. It has Jean Shepherd written allover it- the guy that packed the Limelight in New York every time his radio show took the stage. How people forget.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was expecting it to be a flop, because most times a sequel to a tremendously great show usually is no good, but I am happy to say this was a good story. I enjoyed it entirely. It was funny and heartwarming. Good job.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfection. Just the right amount of nostalgia tied to the original with enough stand alone moments of its own. If you didn't know any better you'd swear Jean Shepherd had written the script himself. It felt like just as much of an homage to Shep as it was to the Old Man and the original movie. Sequels never capture the magic of the original, but this one did. If a person was watching it without any reference or connection to the first film MAYBE they wouldn't love it as much...or if for some unimaginable reason a person didn't like the first one..I could see it getting a low score. But as a fan of the original I can't fathom this movie getting anything less than a perfect score.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trumpets sound 'Deck the Halls' pull back in time to the 1970's and all the glory of what one would expect in a 'Christmas Story' sequel.  Subtle call backs, and returning cast members that only dreams are made of.  Notable absences are Darren McGavin - deceased both here and there (The Old Man Parker) and Melinda Dillon - retired from acting (Mother Parker).  Two key characters that would have made this gem, perfect!  Peter Billingsley narrates and stars, once again, as 'Ralphie'.  The old neighborhood is quiet and peaceful until the boy with big eyes, glasses and bigger dreams returns to honor his recently departed dad in throwing the greatest christmas celebration of all time!  Warm tidings bring chills of anticipation, tears of joy and gut-busting laughter!  Thank you Warner Bros..  Thank you Peter.  Thank you one and all!",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was such a cute movie. My family enjoyed watching it. I loved the nuances this movie portrayed from the original 1983 film that we all know and love so much! Definitely recommend watching this during the holiday season ❤️",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I grew to love the original A Christmas Story after repeated viewing every Christmas because it is my husband's favorite Christmas movie. I love the old-time (1940's) nostalgia of the original - the snowy street, the old Victorian family home - all the best of when times were simpler. So, this past weekend, my husband, 11-year-old-son and I made it a movie night: we watched the first A Christmas Story for the first time this year (probably our hundredth time watching it overall!) and then immediately followed it up by watching A Christmas Story Christmas. I have to say, I was so relieved it was as good as it was! We all really enjoyed it. The writing was good, the acting was good, the comedy was enjoyable, and the nostalgia and magic of the season were still there (in the 1970's). My one gripe./disappointment was that the original actress who played Ralphie's mom wasn't in this new movie; how wonderful would it have been if she could have been persuaded out of retirement to return just for this?!? The ending was the best part and really tied this movie up beautifully with the first. Definitely a feel-good movie that I think will also become regular Christmas movie viewing for years to come!",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome family movie. Seeing the original when I was a child and now seeing where the character is so many years later, it was so relatable. I can see this being an annual watch going forward.",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you loved the first movie, this one is for you. A continuation and a passing of the torch. The dream sequences were just as good as the first movie. Truly a Christmas tradition in watching this film has begun.",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a corny Christmas movie , like it's supposed to be …I think it definitely worked , as a second to the original movie , it's worth a watch , and take it for what it is , just a corny feel good  Christmas movie ….I enjoyed it .",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a solid feel good movie.  Not so much a sequel as it was its own story, paid homage to the original though.  Really enjoyed it,  I miss movies like this.",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now this is a sequel, amazing work loved the storyline, my kids even loved it!",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not so much a sequel... more a heart-felt and loving homage to the original story.  Great use of easter eggs, with just enough self-awareness to not be a parody.  You'll laugh, you'll cry, and while nothing can ever fill the shoes of the first movie we've all grown up with and love dearly, this is about as good as one could hope for!",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me, this heartwarming, funny movie is a perfect addition to the original. The look and feel flows and is seemless. I enjoyed seeing the characters from the first story and how they have grown in life, or not... it all made sense, a pleasure to watch!",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and a little bit nostalgic. They brought back a lot of the actors from the first film. Zack Ward coming back Scut is an ironic, heart felt, scene. Cool little flick. Pays homage to the original.",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than I thought it would be. Pretty sentimental & they did a great job of wrapping it up in a nice bow at the end.",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this film really came full circle. It goes to show, you don't need profanity or vulgar language to make a fantastic film. What a classic!",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a great follow up to the original.  Loved it!",
            "review_date": "2022-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really, really wanted to like this film. It's a dud.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It captures the original spirit while shifting the characters & concerns to an older father. So impressed with Peter Billingley's acting!!!",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas Story (1983) is a perennial classic I watch every year. I own the DVD (just in case the cable goes out and I can't watch it on TBS or stream it on demand). It is a holiday tradition.\n\nSequels, on the other hand, are hard to pull off and have a lot to live up to. A Christmas Story Christmas has proven the old maxim, \"You can't go home again,\" by literally attempting to do that very thing.\n\nWith the exception of them being older, nothing has changed on Cleveland Street after thirty-three years (outside of the old man's passing). And that's the problem. Even that life-altering event doesn't stop them from being holly jolly. All mom has to say is your father wouldn't want you to be sad; so let's enjoy Christmas and that's pretty much it.\n\nSo, in lieu of mourning the patriarch's death, they go by Higbees to see the store window, and inside the Santa exhibit is exactly the same. The Bumpuses still have the hound dogs. The visit to the tree lot is mandatory, they sing Jingle Bells in the car (though it's the Batman version because it's 1973, so that's change). The old man dying is a macguffin so they can revisit the old haunts and old stories.\n\nI realize that for nostalgia buffs this is just fine. But thirty-three years have passed and old haunts usually close or are not there anymore. And old stories have already been told. And while the original movie revolved around the world of kid-dom at Christmastime, and that made it magical and wonderful, kids grow up, and \"things get complicated when you get past eighteen….\"\n\nPersonally, I would have liked to have seen Higbees turned into a casino (which it is IRL) with a Santa exhibit with showgirls or maybe it winds up in a state of decline (no more store window display and a meager Santa exhibit), maybe the Bumpuses win the lottery and move away and a hippie commune moves in next door. You know, things that show the passage of three decades.\n\nAs far as the old man dying at Christmas, c'mon. At least set it up where it is a year after the old man's death and since you hardly celebrated Christmas at all last year (you know, because your dad died), this year you're gonna go all out.\n\nWith so many homages and flashbacks I was tempted to just pop my DVD in and watch the original. The story, for the most part, was flat. It picks up towards the end but I was left feeling like young Ralphie when Miss Shields gives him a C+ on his theme.\n\nA Christmas Story Christmas did have some good moments (the best being the well placed homage in the last scene - bravo).\n\nHowever, just like the passing of the old man, after one viewing I think I'll be closing the lid on A Christmas Story Christmas and letting it rest in peace. C-",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie held up on its own while still completely respecting the original movie from decades before.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally the best movie ever!! I loved how everyone got together and it's so funny and heartwarming and everyone looked so good too! ❤️😍🧡😁",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's everything I hoped it would be, and surprisingly very touching. I found myself tearing up and thinking about how I miss holidays as a kid. There's nothing that can touch the original, and I do kind of agree with one of the reviews that said this doesn't feel like the 1970s. Its also a touch predictable, but so was the original film. There's a lot of rehashing and nostalgia thrown in but thats what you want.\n\nIt's got some messy moments but they're made up by the joy of seeing these characters have fun. Its also nice that they were able to get most of the cast back. It made me miss the old man and his wise cracks, buts its a more than worthy sequel to a classic. What a fitting tribute to the original old man and his quest for a perfect Christmas. It bookends the original film very well.\n\nI triple dog dare you to watch this movie and not show any emotion. You can't do it.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic tribute to the original film and a touching tribute to fatherhood",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a fun and great story line. Having the original \"kids\" playing their parts made the return visit even more wonderful. There was humor, touching moments and flashbacks to the younger days. Like the original, Ralphie was determined on his quest as he was in the first movie. (Can't share). There were a few surprising twists and quips that kept my attention. This is not a remake of the first movie but a real look at Ralphie and his family in 1970.  I wish the release was easier for most to see but hope this becomes a standard on TV as the original is. We loved it! I'm sure to watch it several times more.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best character in the sequel never even appeared. Darren McGavin's character was felt throughout the entire film. That is both a pro and con of this film. \n\nThe funny parts throughout felt tired and overdone, weren't nearly as original or funny as the first film. But the nostalgia at the end really hits ya in the feels.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Job definitely will make you laugh and smile, a Classic !!!!",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most perfect sequel that could have been! Tears. Laughter. More laughter and some tears.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RALPHIE COMES HOME\n\nA Christmas Story Christmas is a 2022 American Christmas comedy film directed by Clay Kaytis 🎄 \n\nMeh, it passed the time. \nJust. 😐\n👍🏼👎🏼\n\nIt's ok, but there's not a lot that's new or original here…\n\nRalphie is now all grown up and must deal with Christmas and all that comes with it…as a dad.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually very funny!",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the nostalgia ",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very enjoyable if you like movies with nostalgia, like Ghostbusters Afterlife, Hocus Pocus 2, etc...   Is it better than the original, no but I can see TNT playing these back to back for 24 hours in 3 years.  yes this is a much watch.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as sequels happening 40 years later goes this is one of the better ones for sure. Enjoyable and lots of nice parts where they mimic the other one just enough to make the memories of the original pop out. Like most sequels like this I'll have to give it some more watches as I feel it will grow on me even more later on. Good job.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nowhere as entertaining as the original but it is hands down the best sequel of the many (and mostly forgotten) continuing adventures of the Parker family. Fans of the original will enjoy the many nods and tributes to the original but as a hardcore fan you may be bothered by Julie Hagerty's recasting of Mrs. Parker and the near absence of Ralphie's little brother, Randy. A sweet movie but not as funny as the first film. Worth a look but you won't make it the tradition that \"A Christmas Story\" is.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it, it had some 'cheese' but also some very good/meaningful tie ins to the original.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you're Christmas Story fan then you'll want to have this as part of your watch list. I both enjoyed and reccomend it.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple..thoughtful.. I may have shed a tear or two. ",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "39 years later we get a sequel to the timeless holiday classic, A CHRISTMAS STORY. Set in 1973, Ralphie (Peter Billingsley) has made a deal with his wife to quit his 9-5 job for the year to focus on his writing. However, if he doesn't get published before the year is over, he'll go back to the grindstone in 1974. With only 5 days before Christmas, the family makes the trip from their home on the south side of Chicago to Ralphie's old home in Hohman, Indiana where Ralphie is deputized by his mother to take over the Christmas planning. Bearing the weight of the stress of waiting to hear back from a publisher before the year's out and taking over Christmas duties, Ralphie and his wife Sandy (Erinn Hayes) do their best to navigate the pitfalls they must continually overcome until Christmas day. Let's be honest, it's nearly impossible to recreate the magic the original 1983 film accomplished as it's such a revered film, but this is a very touching sequel that stands on its own and doesn't besmirch it's predecessor. The role of Ralphie's mom has been recast from Melinda Dillon to Julie Hagerty but outside of that, everyone else has reprised there roles and there are a number of cameos. I'm confident in saying the world didn't need a sequel to A CHRISTMAS STORY as the original is ageless, but this is a worthy enough follow-up.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderfully executed dose of nostalgia. Very heart warming and sweet. Must watch for fans of the original.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing homage to the original.  Loved it and hope it comes to streaming or dvd!!",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas Story Christmas is a joyful tribute to the now classic and tonally pitch perfect 1983 original. Clearly a project fuelled with love and respect for Jean Shepherd's writing, those familiar with his other work will recognise the occasional turn of phrase. Tone was clearly the focus for the filmmakers, and the resulting film a faithful and fitting continuation to the Parker Family story. Funny, sad and silly in equal measure. A true celebration of ‘Lovely, glorious, beautiful Christmas'.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the how they paid tribute to the father in the movie.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas story is my favourite holiday movie ever. When I heard that they were making a sequel, to be 100% honest, I was a little bit scared but I figured I'd give it a shot. Boy am I ever happy that I did. The last few years, everything has been so \nfra-gi-le. It's  nice to have a movie like this to lift up our spirits. It blends the perfect mix of nostalgia with new stuff. We got to see old characters and a lot of throwbacks from the original movie without it being overboard. The film is sad, funny, and brings you joy. The perfect holiday film.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think they could have made a better sequel to the original classic. Lots of cameos, lots of callbacks and a great story. Other movie makers could take a lesson on how to make a sequel. If you loved the first one, this is an amazing follow up. I only wish the actor who played the father were still with us.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect combination of laughs and sentiment. Great Nostalgia while newcomers will be entertained as well. Well done.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was awesome better then the a Christmas story 2 it was very sweet and good to see the og kid",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a nice movie , great to see the old cast back. Tears and laughter with alot of nostalgia.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovers of the original will love this movie.  It's funny and endearing.  It's hard to top the original, but this film is a nice homage to all the special moments in the original while still having its own unique plot.  I loved seeing all the kids from the movie grown up (Ralphie, Randy, Flick, Schwartz, and Scut Farcus).  It was also a nice tribute to the Old Man, Darren McGavin.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this movie.  I not exactly a super-fan of the first, but I do have some of the symptoms (full-size leg lamp, kitchenware, the full Hohman Indiana Christmas village); I reread In God We Trust in December each year.  I am one of the few people I know who actually saw the first movie at the theater.  I was in the 4th grade and have been hooked ever since.  So, I admit I was skeptical.  It didn't have the beautiful narration of the first--Jean Sheppard's writing is so poetic and eloquent--but they did a great job of intermingling the old story with the new and reminiscing without being repetitive.  It had a lot of heart.  Bravo, Ralphie Parker.  You made a good, wholesome, fun movie.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie tactfully revisits what have come to be the tropes of the original without drowning you into a pool of total nostalgia. A worthy tribute to the original, but also a bit long.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They need to leave some movies in the past. The original cast doesn't have what it takes to pull this off. It was a valiant attempt but fell flat. Scott Farkus was a great scene, the rest is a big dud.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you liked the original you will love this movie especially if you were a kid in the 70's. It does a great job of balancing nostalgia with the new story line. This is a new Christmas classic,",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While this wasn't exactly a great film it was fun revisiting my favorite characters from the original movie (which is one of my all time favorite films), I also thought the last half hour of the film was better than the first hour, the actors do a good job with their roles but some parts of the film were a bit cringeworthy.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great sequel. Enjoy\nJean Sheoherd would be proud.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really gave the classic movie vibes. Really enjoyed it.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great movie!  I loved the happy ending.",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As an avid fan of the original classic this new film was hilarious emotional and heartfelt! Amazing trip down memory lane with a now grown up Ralphie and his buds! I triple dog dare ya to see this amazing sequel to a beloved classic!",
            "review_date": "2022-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The perfect sequel to a holiday classic. They absolutely nailed it. ",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this. Such a sweet, fun movie!",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very true to the nature of the original Christmas classic! From Ralphie's daydreaming to his kids being tortured by the neighborhood bullies! Oh and Mrs. Parker (Ralph's Mom) ...fantastic recasting! Almost recaptures the heart and soul of the original but is entertaining enough to make you burst with nostalgia! Amazing job all the way around!",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie. As a follow up to my all time favorite Christmas movie that already holds so many special memories for me and my family, this builds on that. As someone who has lost a parent, this movie spoke to me in a way that the original spoke to my parents and then later to me as an adult and how we learn that even though people may have to leave us, they are never really gone and especially at Christmas, when all that magic is around us, we really get to feel them again.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of course nothing is as good as the original. but if you can make a true sequel that keeps true to the first one without seeming like your watching the same movie. That is something special. I was skeptic at first when I started watching but it wasn't long before I was sucked in like I was a kid again. Don't want to say to much that will spoil the movie but its for sure a must watch.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a very good movie for you family and friends watch with the ending the best to remember his father.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas story Christmas is a love letter to fans of the original movie. It is packed full of nostalgia, had me in my feelings from the start.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so heartwarming.   Best Christmas Movie I have seen in years.   Laughed and Laughed!   Another classic for a new generation.   I'm excited to go back and watch this again during the Holidays with the entire family.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blobbo think: Egad! Was director previous director or commercials or music videos?  So many cuts!",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not crying, you're crying. This was a perfect blend of new story and nostalgia for the old. Everyone who love the original absolutely had to watch this. You will not regret it.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The gold standard for what a \"cult classic\" sequel should be. Just enough earnest fan service and appropriate world building culminated in the best sequel we could have hoped for to our favorite Christmas classic.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was so good!! A worthy follow up to the first movie. I really enjoyed it. They managed to keep the humor of the first one. Loved Ralphies fantasy sequences.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's entertaining enough but it forgot to have fun and be adventurous like the original. \n\nThis director seems to have never even seen the orignal. I really missed Bob Clark's touch while watching this. \n\nIts basically just watching Ralphie go back to his childhood home and be sad and depressed about father's death and his life. \n\nAnd they got Julie Hagerty from Airplane to play the mother. And its as if they told her \"just play your character from Airplane again.\" The mother in the original was not a ditzy klutz. \n\nThere is no real energy or fun to be found. And many of the jokes seem like they just wanted to get them in the can and shot them all in one lazy take.\n\nI just don't get why movies feel so lazy and flat these days. What the frick is going on? \n\nHave people completely forgotten the exciting and crayz things we all experience in life, in-which makes a story fun and interesting? \n\nIts like no one has anything important to say anymore so they just go through the motions and making movies is just a job for many now.\n\nIt feels like a Hallmark movie that happens to involve the family from A Christmas Story. \n\nIt wastes time showing Ralphie be nostalgic just to make you nostalgic when they should have just continued his life story and had fun with it, making up memorable scenes along the way. Instead we just are left with the desire to just go watch the original again, because it told a compelling story.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "29 years after the original was released, A Christmas Story finally has a worthy sequel. To quote the movie, \"You did it Ralph!\".  I give it an A + + + + + + + +...",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie starts off a little like it's trying to catch it's footing but falls right into a groove that harkens back to the original.  Peter Billingsly is just as charming and funny narrating this story as he was in the original. The movie pays tribute to his dad who was played by Kolchak Star Darren Gavin in the 1983 movie.  It's a marvelous tribute to his dad and to his efforts to match  who he considered a king of Christmas.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A New classic just like the original",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Admittedly, my bar was in the basement for this movie, but I was truly surprised by how moved I was by it. If you were in an \"A Christmas Story\" family like I was growing up - and that movie is wrapped up in your version of that childhood concept of Christmas that you lose somewhere along the way - this movie will speak to you.\n\nWhat I really appreciated is that this movie is honest; it may occasionally try, but this isn't \"A Christmas Story,\" and the movie knows it. The childhood magic and fantasy of Christmas transforms into a labor of love in adulthood, and this movie is about how Ralph (yeah, he's \"Ralph\" now... except to those who know him best) has an incredible labor ahead of him. And yet, just like Ralph still indulges in the occasional dissociative fantasy, we can still find moments to indulge in the fantastical pieces of Christmas in between budgeting for gifts and cleaning up the pine needles, no matter how old we are.\n\nFor many (most?) adults, Christmas joy becomes intermingled with Christmas sorrow at some point. You will have a particularly bad Christmas one year. You will notice who is missing. You will be disappointed in someone you love, or maybe they will be disappointed in you. \"A Christmas Story Christmas\" makes all of that clear, but it also makes clear that we can honor that sorrow while still finding ways to live in wonder and cheer. We just have to choose it.\n\nI wouldn't leave it on my TV for 24 hours on Christmas day, but I do recommend it for any other day of the Christmas season.\n\nA few other, more random thoughts: The bulk of the original cast is here again, sometimes in unexpected places. There are definitely moments where these characters are doing what they do for the nostalgia, or they're bringing closure to something we've already moved on from, or they're here just because, but I'm honestly glad so many of them are here again.\n\nMrs. Parker is the only character who has been recast. Julie Hagerty replaces Melinda Dillon in the role, and she was quite good. The differences are certainly noticeable - the script leans in to Hagerty's comedic chops - but it works perfectly well, and you will still probably have to look at her for a minute to really notice the difference at the start of the movie.\n\nThere are many sendups to the original, and though they feel somewhat silly at times (Ralph the Man still publicly engages in maladaptive daydreaming in front of other people while Flick and Schwartz are still triple-dog-daring one another), I think they work well. They lend themselves nicely to the tone of the film and feel pretty organic; again, this movie is pretty self-aware, so most of these are tongue-and-cheek references. That said, they're not overdone; they enhance the story, but they don't carry it.\n\nAlso, this is a reminder that his name is actually \"Scut,\" not \"Scott.\"",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is definitely the child of it's predecessor and it holds the same magic! Peter Billingsly nailed this and honestly deserves at least an Oscar nod for pulling this character off as an adult 40 years later. I love it and it will be just as special to my family and myself, for many generations. God bless you Scut Farkus!",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is good about this film is it works as a feel good comedy. The movie does a good job making it its own while paying homage to the first. Both movies are intertwined and linked by adult Ralphie anyway so this works perfectly. The FOCUS is on Ralphie but the kids, the wife, the mother all have their moments to shine. The supporting cast make a few returns and without spoiling it, you will want to see some of these characters revisited. I enjoyed this, and a worthy followup to the first film,!",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was a perfect sequel to one of the greatest Christmas movies ever made. Congratulations on, pulling off this great story for the next generation.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone has something now that they can show their friends, partners, kids, parents etc to show them what the holidays were like for them growing up or for their parents. It's a continuation of the thought behind everything lands safely during the holidays no matter what. The movie handles this concept well. Simpler times, just the love matters!! A new classic or an old classic welcome sequel-either way we were smiling ear to ear without noticing. Definitely a holiday spirit inducer!! Loved it!!",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie looks like it was made for about $1.50.  The story is boring.  The jokes are flat.  Ralphie looks like he is about 20 years too old.  I'll stick with original.  What a WASTE of time!",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"A Christmas Story Christmas\" was incredible. A true homage to the original and an absolute tribute to Jean Shepherd (the original author and narrator) in a way that no other sequel could ever accomplish.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas Story Christmas does not disappoint. From flashbacks, to easter eggs, and Ralphie's own follies with his family, this movie had us laughing and enjoying ourselves immensely. We watched on HBO Max but would have seen this in the theaters. We will be watching this every year for many Christmas to come.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun Christmas movie for the family. I wish it would of went to theaters so we would have a holiday movie to go see. Very charming.  A must watch this year.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a good sequel to a classic film. Loaded with charm and nostalgia. If you love christmas time you will love this. Dont be a grinch. Love seeing the old cast, everyone did such a great job.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BEST MOVIE SINCE SHREK 2!!!!! I loved the original Tom and Jerry movie as a kid, then I liked Shrek 2, now this!!! OSCAR WORTHY",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's been a tradition of mine to watch A Christmas Story with my daughter every year on Christmas Day. I've been doing it for years. She is now 18 and still loves it! We just watched A Christmas Story Christmas, and we  absolutely LOVED IT! We laughed, and cried, reminiscing on all of our Christmas memories. It's funny, witty and melancholic! If you're a fan of the original, this will warm your heart for sure! \n A total joy!",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A silly sequel. It was nice to see the original cast and it was loaded with nostalgia but this one didnt have the magic of the first.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without the satirical bite of Jean Shepherd, and the nostalgic magic of Bob Clark, \"A Christmas Story Christmas\" is the diet cola version of the first movie. There was 10 maybe 15 minutes of the whole movie that was good. Otherwise, it was bland.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun. Nostalgic. Touching. Emotional. Perfect for fans of the original.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"A Christmas Story Christmas\" on HBO Max was awful. But like the original, awful in a good way!  True to the original. Plenty of nostalgia. Great cameos. Cheesy. Some pretty good laughs. Heartwarming. Of course it's not as good as the original, but it doesn't have to be. It exceeded my expectations. It was exactly what it needed to be. I give it an A++++++++++++++",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big ole can of corn. I’ll stick with the original ",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was great.  I went in to it not expecting much, but overall it was great.  I love the flash backs to the original, and seeing a few familiar faces.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There’s a subtle but poignant recognition in the movie of childhood’s casual decay; our sorrow at the realization can deepen our feeling and humanity. ",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great watch, they really paid homage to the original one! ",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this really pulled on the heart strings. I don't want to spoil the movie but I will say it hit extremely close to home with that Christmas morning.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Is An Instant Christmas Classic my Family loved every second of it!!",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I adored it. It's amazing homage to the original while also being it's own thing. The story is touching, got me a bit misty eyed in parts, and to be honest, I feel this movie was just as, if not more than, from the heart and a Christmas classic as the original.",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first 1/3 of the movie I was convinced I wouldn't like it, the 2nd 1/3 it suckered me in, the back 1/3 I thought was a bit of a tearjerker.",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent...worth the wait! A great \"next generation\" story. I liked how the film has little throwbacks to the original...but keeps it fresh. Not living on history - creating a new film for a new generation. I can't wait to watch this with my kids this weekend. Wish it was in the theater though.",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Christmas Story Christmas is the highly anticipated and long-awaited follow-up to the classic Christmas movie, A Christmas Story. It's full of new and old faces and, of course, plenty of hilarious scenes. This movie certainly gets you ready for the holiday season.\n\nPeter Billingsley returns as Ralphie in A Christmas Story Christmas. He's back and all grown up, and tries to give his kids a magical Christmas, just like the ones he had when he was younger. But with an unexpected loss, he must do it by himself. Can he live up to his dad's standards and give his kids the perfect Christmas?\n\nAs the title suggests, this movie is the sequel to A Christmas Story, nearly 40 years in the making! It isn't necessary to watch the original movie to make sense of this one; however, there are references to the original movie that may be a bit confusing for those who haven't viewed it. Also, A Christmas Story is one of my favorite Christmas movies and is a joy to watch, so I do recommend it before watching this one if possible. One of my favorite parts of this movie is the fact that most of the original cast members play their same characters. Flick (Scott Schwartz), Schwartz (R. D. Robb), Randy (Ian Petrella), and even Scut Farkus (Zack Ward) all make an appearance. It is surreal (in a good way) to see what these former childhood actors now look like all grown up. I've never searched for their current appearances, so they are all a pleasant surprise. I also love how the sequel stays true to the original movie with all the sets, transitions and personalities of the characters. The narration is even similar to the first movie. Peter Billingsley, on top of just acting in this movie, also co-wrote and produced it. Kudos to him for all the work he did to bring us this movie. Speaking of some of the actors, my favorite performances are from Peter Billingsley (Ralphie), Julie Hagerty (Ralphie's mom) and Erinn Hayes (Sandy). Peter Billingsley keeps all his mannerisms and quirks from Ralphie even in his adult years, which makes this movie feel familiar and comedic. Julie Hagerty replaces Melinda Dillon as Ralphie's mom, and she fills her shoes so well. Erinn Hayes plays the newly introduced character Sandy and fits right in. She makes me feel as if she has been there forever because of the amusing interactions she has with other characters. The actors have so much chemistry, no doubt due to the fact that most of them have known each other for so long.\n\nThe primary message of A Christmas Story Christmas is that sometimes, it's the thought (and effort) that counts. This movie also deals with the loss of loved ones. There is some mild profanity and consumption of alcohol.\n\nI give A Christmas Story Christmas 4 out of 5 stars and recommend it for ages 5 to 18, plus adults. Fans of original movie will enjoy this movie as well as those who are unfamiliar with the original. It comes on HBO Max November 17, 2022. By Katherine S., KIDS FIRST!",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow...This could've easily been a force-feeding of nostalgic callbacks, but they really did it right.  I never thought we'd get to see these characters again in any meaningful way, but the wait was worth it.  Billingsley falls right back into the beloved Ralphie so seamlessly and is so rootable from the very first scene.  Erinn Hayes is also fantastic, as are the kids, and Julie Hagerty is a more than fitting replacement for Melinda Dillon.  While I'm sure it will be mostly fans of the first film who will be watching, it is just a great Christmas movie in general.  Very rewatchable too.",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely worth a watch Ralphie's kids were hilarious",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seriously, genuinely great.  What an early Christmas gift",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally captures the warmth of the original movie while not relying on it.  The adventures of adult Ralphie are even more fun. I knew this looked great from the trailer and super happy it delivered.",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surpassed all expectations! Works just as effectively as a standalone film.  So much heart and humor.  Can't recommend more.",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely worth the watch!",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a standalone film, it's likely in the 6 or 7/10 range, but as a sequel, it tugs at all the heartstrings in all the right places and does so sincerely. If they were ever going to make a sequel to the original film, this was the best way to do it. While not as funny as the first, it's surprisingly moving. I can't stress enough how earnest and sincere it is. 8/10 from this lifelong fan. The last couple minutes were a wonderful way to both end things and bring them full circle.",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most emotional movies I’ve seen In a while ",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just finished A Christmas Story Christmas, & I LOVED IT! It's so hard to top an original with a sequel, and to the iconic A christmas Story to boot? Bravo! The movie was so touching and an amazing tribute to \"the old man Darren McGavin. Sadly, My mom passed away on 12/21/2018, and growing up, just like the old man, she didn't just adore Christmas, as Ralphie says, she INDULGED in it. I cried nearly half a dozen times throughout the movie every time Ralph thought of his dad and the memories. In all honesty, Christmas for my family died when she did. After watching this movie though, I think it's time we stopped mourning over her passing especially around the time of year when she passed, but celebrate her life! Remember all our memories and stories of my beautiful and loving, caring mother, and how she would bring Christmas to life every single year. I've been dreading Christmas time since 2018, but, for the 1st time since that day, I can easily say I'm excited for Christmas and to celebrate her life. Thank you so much Peter Billingsley, Julie Hagerty and the entire cast of ACSC!!! Truly a wonderful job on this sequel which I think deserves to be up there and mentioned with the original, and heck even played for 24 hours straight on Christmas Eve/Day. \nSincerely from a lifelong fan of the Franchise, \n                  Gregg Burdash",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        }
    ]
}