{
    "rating": 9.1,
    "release_date": "Invalid",
    "num_reviews": 112,
    "genres": [
        "Hindi"
    ],
    "summary": "A series of mysterious events changes the life of a blind pianist who must report a crime that he should technically know nothing about.",
    "reviews": [
        {
            "content": "if you like plot twist, you had multiple plo twist in here.  This stories about survival instinc, greediness and off course .. LOVE!",
            "review_date": "2022-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A 2 1/4 hour movie you'll actually wish went on longer. From start to finish, Andhadhun features the cleverest film plot I have had the pleasure of discovering in a very long time. \"Hitchcockian\" is the word that comes to mind, but even Hitchcock would be jealous of the unpredictable twists and dark humor that dominate the film.",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie. Everything is not what a seems, and trust No one.",
            "review_date": "2022-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best suspense thriller ever made. It's filled with twists and turns. Keeps you at the edge of your seat for more than 2 hours. Gotta check this out.",
            "review_date": "2022-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredibly fast-paced script that is positively riddled with twists and tonal shifts that would essentially be impossible for a non-Indian film to pull together, but which remains consistently high-energy despite a lengthy runtime. There's plenty of pulp but the twists can be legitimately great and unexpected, bringing actual guesswork to a medium that seemed to have exhausted the capacity for surprise. I want to talk about specific moments in this film, but everything verges on spoiler territory and the story builds off of each preceding coincidence in unexpected ways. If you want an engaging combination of entertainment, thriller, mystery, romance, musical, and heist film that defies convention through variety and unpredictability, Andhadhun is worth taking a look at.\n\nJust ignore the very brief use of CG. It ... does not look good. (3.5/5)",
            "review_date": "2022-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plot twists were pretty cool",
            "review_date": "2021-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kuch bhi ho sakta hai ye zindagi me, kuch bhi, so enjoy this reel roller coaster and the real one too full of turns.",
            "review_date": "2021-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can`t believe that I didn`t watch it till today.  Before the start, only based on the title, I thought it was a musical or an inspirational dream-chacing movie. It is far from it. Firstly, I always love a twist in a film. In the very end, it leaves the audience to judge whether our main character is really blind or not--- however, to answer this question seems too old a topic. Secondly, I love creating the main female character, who is like a femme fatale stepping out of a 50s film noir. She is attractive, smart, automatically strong, and cruel at the same time. The low-key lighting in the room when she broke into his room to kill his eyes, those oblique shadows on the wall, and many long shots of her leaning on the door ... but these are only in the first half of the film. This film is interesting because no one character is a consistent character from the beginning to the end. We can see the different intelligence in each character when they are leveraging what could be the best choice for themselves. In this sense, everyone is both antagonist and protagonist that they can turn to the other side in a minute. Even our main character, a talented, passionate, and simple-minded pianist, is implied to tell a lie to his beloved one. Everyone is so simple, and their aims are crystal clear and straight. And they are so cruel and real. The Shiva woman, her son, and the doctor want money, so they save the main character first but then turn to his back the next day. The leading woman wants to hide her love affair, so she tried to kill every witness without hesitation. And all the cruel sides of these people are covered by the sense of black humor, which enhances the sarcastic meanings. If we believe that our main character is telling a lie in the end, then we see the growing up of this character. It is more likely to be the right answer or explanation for the ending scene. Because only in this way the main character is like everyone else who does the thing, no matter what is morally good or bad, that can help to reach the aim--- this time is to win back the girl`s heart or to retain his fame as a successful and talented musician in the new city. If he lies, things are just like what it was initially-he pretended to be a blind pianist. But everything has changed. If his blindness used to help him focus on his music, now this blindness has encompassed more complex things that are not as innocent and pure as he was ever before.",
            "review_date": "2021-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This slightly dark and witty Bollywood drama follows a blind piano player who witnesses an affair. Based on the closing credits, it seems to be a remake of an older movie. Not to stereotype, but it seems like its it's geared towards those who'd enjoy watching a longer Hispanic channel movie. The picture quality, focus, and framing are watchable but beyond that, there is little substance. \n(My siblings and I have a tradition of reviewing a movie and this was picked due to it's high rating. After watching my sister told me to save my time and not watch it because \"it was horrible\", which has never happened before. But I had to watch it for myself. I wouldn't say it was horrible, I could see a minute audience enjoying the film, but certainly has not been rated thus far, hence this submission.)",
            "review_date": "2021-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "movie is not typical ! it hs so much good elements to see , it`s basically a treat to watch it. yeah it is filled with dark humour i wud say , twisted stories, -  - blended with blind guy innocence and much more to the character and the movie. well overall stryline is good , it does not bore you, it keeps you to the edge of the seat , as well some scenes were not necessary i think. but kudos to team for delivering such a movie !",
            "review_date": "2021-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool story idea, not executed well and fell apart a quarter of the way in, which was disappointed because it began so well",
            "review_date": "2020-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie, no loss after seeing the movie, for me it is the best movie of ayushman khurrana.",
            "review_date": "2020-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is how deep a drama can go.",
            "review_date": "2020-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark,engrossing thriller with high drama make u sit on the edge of your seat till the end.",
            "review_date": "2020-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Siriam Raghavan's \"Andhadhun\" is a darkly comic, gripping and utterly unpredictable thriller that marks a new high for Bollywood Cinema. With his fifth feature, writer/director Siriam Raghavan has crafted a tense murder mystery involving a blind pianist. Using captivating cinematography, Raghavan draws viewers into the life of a blind pianist that unwittingly witnesses a murder. From intimate close-ups to stunning establishing shots, the cinematography keeps viewers immersed in the film's setting. It gives the film a dark and ominous atmosphere that is reminiscent of Alfred Hitchcock. Raghavan's screenplay is also sensational, using genre-mixing to subvert the expectations of viewers. In terms of acting, the entire ensemble is excellent. Ayushmann Khuranna delivers a star-making performance as Akash. With enthralling expressions, he conveys the fear, desperation and deceitful nature of a pianist that pretends to be blind. The supporting cast, which includes the scene-stealing Tabu, is also excellent and worthy of recognition. Although \"Andhadhun\" is undeniably unforgettable, ultimately it is not a flawless film. It builds to an ambiguous conclusion that leaves viewers with several questions. Nevertheless, fans of dark comedies will definitely enjoy \"Andhadhun\" and so will movie-goers seeking original entertainment. At a time when Bollywood Cinema seems to be running out of ideas, it's reassuring to be reminded that movies like \"Andhadhun\" are still getting made.",
            "review_date": "2020-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A near perfect dark comedy.",
            "review_date": "2020-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a huge fan of Ayushmann Khurrana. And this is one movie that absolutely nails it on every front. The story, the acting, the plot twist, the character development, and most importantly, the ending.\n\nThe story is set around Aakash, a man who is shown to be a blind pianist in the beginning of the movie. However after he meets Sophie, it's soon revealed in a surprising twist that he isn't blind after all. Every part of this movie is absolutely thrilling to watch, especially after that when he goes to Simi's house and sees her lover having murdered her husband. He has to keep calm and continue to pretend being blind even after all that, which as we can imagine is tough, to say the least.\n\nAfterwards when he leaves the house and immediately goes to the police station to report the murder, it turns out the cop, Manohar is the lover. And now he has to come up with an excuse about why he is in a police station immediately after Manohar had committed a murder. He takes his time to convince Manohar that he's blind, but fails to convince Simi. As a result she makes him blind for real. You can actually feel the tension in that scene.\n\nAfterwards he teams up with Murli and Sakhu, but they betray him and try to run away with Simi's money. They do get their comeuppance, but by then Aakash never sees them again. In the end when Aakash meets Sophie in London it seems kinda sad that Aakash has become blind, but then we get an immediate sense of joy when we see him knocking a can out of his way.\n\nI really hope in future we get to see more such movies. This movie is basically a message to tell us Bollywood isn't exactly hot garbage. If it wants not only can it make such good films, but people can actually even come to watch them. This movie absolutely deserved an Oscar and I see no reason why it wasn't even selected for it.",
            "review_date": "2020-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "See  movie  from piano player angle . back ground music is  best . Sound engineering is excellent  in this  film",
            "review_date": "2020-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic movie with great plot and mind-blowing twists and turns which keeps you off the edge and your heart thumping.\nA very intriguing and dark masterpiece and some scenes like the rabbit and accident were brilliant.",
            "review_date": "2020-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a well directed and well written melodic masterpiece.",
            "review_date": "2020-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible film, a must watch for all",
            "review_date": "2020-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nonsense, bullshit, over rated, crap, piece of shit",
            "review_date": "2020-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So it's the change of an era in Bollywood",
            "review_date": "2019-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best thrillers in Indian cinema.\nTabu and Ayushmann gave performances of their lifetime.\nGreat script and brilliant background score. ",
            "review_date": "2019-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of 2018\nOne of the best Bollywood movie ever made\nBest thriller movie\nBest movie of Ayushman khurrana",
            "review_date": "2019-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They dont make these kinda movies anymore - thats what you gonna say! ",
            "review_date": "2019-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Osm movie every second twist",
            "review_date": "2019-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somebody said: Plot twist?\n",
            "review_date": "2019-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BEWARE of the spoiler! \n\nOfficially the dumbest movie of 2018, what I've seen so far. It starts with a blind pianist who pretends to be blind. At the beginning of the movie, he's acting like blind when he's alone. Clearly, to keep you inside an illusion. Later in the movie, after you understand the guy's blind, he acts normally alone. What a turn! The story unfolds towards possible romance yet it takes the director at least 30 min to introduce all the main characters. If you managed not to dislocate your jaw by yawning after half an hour of nothing much but views of Pune the director finally decides to add a twist to the story - a guy comes to the murder scene. That's where the comedy starts. All of a sudden a woman speaks on the phone to her husband, who's actually sitting shot dead in the next room. Boom! Mystery! Does she speak to the ghost? No, it's just remarkable screenwriting of this masterpiece. It turns out that the guy was gunshot straight into his forehead or so yet nobody noticed(read: heard) it, even blind pianist who's sitting next room. Probably he's not just blind, but also deaf and dumb. Don't worry, he's just pretending. After that, the comedy turns into a blockbuster - one murder after another, yet the main guy stays alive even after a mysterious poisoning, which makes him truly blind! How the murderer managed to do so, even the director of the movie doesn't know. If you wondering how check Google - that's what the killer did. I did so too, and guess what? I didn't find any. Okay, let's put it so - she apparently invented a new secret pharmaceutical remedy. She's Dr. Evil! But not as good as a doctor of the bankrupted hospital in Pune, who appears in the middle of the movie and tries to cut out the kidney of the blind guy! What a twist! Of course, if the hospital is in danger, the doctor will do anything to save it, even sell the organs. Yet, it rings the bell, when the doctor explains why he does it. Surprisingly, all the patients he was taking care of for the last decade abandonded him and went to the new hospital that got open close by. Pretty much life-like situation. For years people are being treated by their family doctor, yet the moment new hospital is open they abandoned him all at once. Doctor, along with his staff, goes turbo and captures poor blind pianist to cut him open. Still, you feel like watching to the end? Don't bother. It will end up somewhere in Europe or a place that looks like Europe. And it ends up pretty much with nothing. \n\nSix poor writers tried to make this story into something interesting and failed flat on their faces. I guess it's time for them to update their CV letters and call HR agents, cause this waste of time ain't not gonna make it to the red or any other color carpet.\nThe only good part of the movie is DOP work. It's done competingly well.",
            "review_date": "2019-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WOW is the only word I can say and I haven't even finished the film yet! Ayushmann is National Film Award worthy with this spellbinding performance and Tabu is fantastic as always! Andhadhun is NOT your typical Bollywood film, with only 1-2 musical segments adding to the overall ambiance. I'd say it's more of an example of parallel cinema and is very Hitchcock-esque!",
            "review_date": "2019-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You gotta watch this if you love crime thriller movies.Background music is good too",
            "review_date": "2019-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What An Amazing Indian Film! Really Smart!",
            "review_date": "2019-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie never lets you to feel relaxed for a single moment. Full of suspense and thrill. At the end you will again fall in love with the immaculate acting of Ayushmann Khurrana.",
            "review_date": "2019-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true crime thriller. Enjoyed every bit of it.",
            "review_date": "2019-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best open ended triller",
            "review_date": "2019-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what you call a perfect thriller from start to finish. Nothing bad to say about this one It has everything from plot to acting skills to directing you name it.",
            "review_date": "2019-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everysecond on this film Means !",
            "review_date": "2019-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "MOST COMPLICATED MOVIE EVER...LOVE TO WATCH THIS TYPE OF THRILLED MOVIE...",
            "review_date": "2019-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of best Bollywood movie of ALL TIME in MY OPINION.\nThe twists throughout the movie keeps it entertaining even on multiple viewings. And the ending this movie provides isvery unusual for Bollywood movies and damn refreshing.",
            "review_date": "2019-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really loved the movie.",
            "review_date": "2019-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good drama, but I wasn't surprised by the ending",
            "review_date": "2019-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that ticks ask the boxes. Watching something in Hindi after years that was such an excellent feature",
            "review_date": "2019-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Hindi film of 2018. This movie doesn’t have a dull moment and keeps you locked in the whole time. Nice finishing touch. ",
            "review_date": "2019-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. A must watch.",
            "review_date": "2019-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of story telling but overall lacks in film making. First half is stronger than the second half. Would have given it a 3-star. Adding half of a star for the playful ending. ",
            "review_date": "2019-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fabulous!! Bollywood's best suspence thriller and funny movie...very deep story needs high thinking power.....a must watch bollywood movie.",
            "review_date": "2019-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best hindi movie of the year. From the beginning to the end. Every scene is a suspense n it will give you goosebumps",
            "review_date": "2019-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a good movie. I felt there were too many twist. This could have been a full 5 star movie if not for the lot of surprises.",
            "review_date": "2018-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie.... must watch.",
            "review_date": "2018-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and with incredible twists. One wished at least some of the characters to be a bit less dark, but relentless unconventional twists make for a brilliant viewing.",
            "review_date": "2018-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was pretty great. Loved Indian cinema pushing the boundaries and trying different things. So many twists and turns - would have been 5/5 if the movie had been successful at making me suspend disbelief completely.",
            "review_date": "2018-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing movie, bollywood needs to make more such movies",
            "review_date": "2018-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gripping with tensions and unexpected twists...when start the play button here you will and you must see it till the credits roll....from dark humour to the bizzare murders...andhadhun is a blast from start to end..",
            "review_date": "2018-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect portrayal of intertwining stories about an unintended murder and a passionately eccentric artist. Brilliant acting and music got along well. This director never case to surprise viewers.",
            "review_date": "2018-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was unpredictable but a little too far fetched for my liking.",
            "review_date": "2018-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie, lots of plot twists and keeps the viewer engaged",
            "review_date": "2018-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, movie.. a must watch..",
            "review_date": "2018-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must watch....what a thriller film i loved it",
            "review_date": "2018-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best bollywood movie",
            "review_date": "2018-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Andhadhun\" is a movie that really keeps you on the edge of your seat with its truly unpredictable story. Throughout this movie, I felt I could never predict what would happen next. I enjoyed watching it and had a lot of fun with it. The characters are entertaining and the story kept me engaged. I do feel the ending was open-ended without much of a reason, but I think that makes the movie one that could be fun to discuss. It's a solid thriller that keeps you guessing every second, and I had a blast experiencing it. It is definitely one of the stronger Indian movies from 2018.",
            "review_date": "2018-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not just the movie of the year,  but probably the movie of the last few years. It doesn't disappoint you even once all the way from the first  to the last scene (both being of mighty importance). This is what an entertaining movie should be like, not what Rohit Shetty and co. have been serving for years.A commercial film doesn't need to be nonsensical. Take a bow the team.Exceptional.",
            "review_date": "2018-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a gripping plot and some stellar performances from the whole cast, this movie is definitely a must watch for all cinema lovers and a strong contender for the best Bolly film of the year. What made the film more fantastic was the unpredictability of the whole plot. Overall, a must watch.",
            "review_date": "2018-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andhadhun - You beauty! \n\n#Andhadhun is a BLOODY hoot!\n\nA taut crime tale of a blind man and his artsy screw ups. This movie easily is one of the finest thrillers to ever come out of Bollywood and will go down as one of the best crime musicals, if there ever happens to be a genre like that. Ayushman Khurana has given a splendid performance as an experimental blind man who gets into so many things that it becomes a natural instinct of the audience to know and explore more about what happens to him.\n\nSriram Raghavan is modern day Vijay Anand, as a master crime caper specialist, he knows how to present his taste onscreen extremely well. Vivid but small setups haphazardly spread characters but bound together, highly contrasted and colorized shots, few colorful characters and a pace that never lets you think away about anything else other than next frame.\n\nI forgot when was the last time I saw a first half in Bollywood that was as intense as this one. Mark my words - the way first crime scene is picturized while the blind pianist plays symphonies while being a mute and blind spectator to a crime, is nothing short of a pure gold class masterpiece and will go down as an instant classic in the list of greatest scenes ever filmed in movies. The explicit parallels drawn between two extremes in that scene is wholly on another level and shows the Raghavan class we have been familiar with since ever. This movie takes his definitions of the depiction of crimes on whole another level after a gruesome depiction in Badlapur and a high shock value execution in Johnny Gaddar.\n\nMusical symphonies often represent the mood and put you at unease. Scenes with Beethoven Symphony 5 as background score are a great example of what a fine musical taste can do to an otherwise great scene in silos, and exalts the overall weight of a scene many times. Old Bollywood style tunes scattered in beginning and jazz music with high tempo gel extremely well with the fast-paced scenes.\n\nThe only weak point of the movie is that it disintegrates a bit towards the end where new characters are introduced and a new storyline gives albeit good support to the overall story by the climax. The cryptic end is another story to write home about. The one-eyed rabbit reference at the end jaw-droppingly resembles the dilemma of our blind protagonist without mincing any words. Only Sriram Raghavan could've come out with such insanely addictive attention to detail and nuanced filmmaking; nobody else.",
            "review_date": "2018-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best comic thriller of this decade.\nA must watch for thriller lovers.\nEverything in the film is pitch perfect.",
            "review_date": "2018-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "New suspense thriller on Netflix is quite surprisingly well-made! The manner in which things unfold keeps one guessing till the end Hitchcock-style. It's dark, its comedic. Great acting. 100% rating on rotten tomatoes. Beethoven well utilized.",
            "review_date": "2018-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched a good movie after a such long gap of so many non sense movies",
            "review_date": "2018-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just WOW!! Indian cinema is definitely going somewhere.",
            "review_date": "2018-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ending was so weird... And so many loose ends.. The movie got my attention with some great scenes but the ending was too shabby... Very disappointed after a great start",
            "review_date": "2018-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "exceptional\none of the best, Bollywood has ever produced",
            "review_date": "2018-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just ok. Movie has so many twist that it becomes comical by the end. ",
            "review_date": "2018-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fist time critics and audience agree for a long time this is a thriller of the year",
            "review_date": "2018-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must watch thriller.",
            "review_date": "2018-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Under-utilised cast for an incomplete story with a perfect example of plot mismatch with the score.",
            "review_date": "2018-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tight script with perfect casting whose performances were as natural as the flow of the scenes in the movie. Direction seems to be flawless with special mention to the perfect minimal use of sound adding chills of thrills at crucial times. Andhadhun is the on\\e of the rarest movies to have been able to manage an anticlimax that gives you a quirky smile as you leave the theater and also hours after when you think about the last scene ;-) #GoForIt (If you still haven't!)",
            "review_date": "2018-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do yourself a favor and just watch it. The screenplay itself should keep you on the edge. Amazing experience.",
            "review_date": "2018-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only blemish in this otherwise flawless film is parts of the second half. It's a great dark comedy which is rarely seen in Bollywood. This is a work of a filmmaker who knows what he is doing.",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movies takes you places where most Bollywood movies don't . It's fun , entertaining and a perfect thriller with mysterious ending .",
            "review_date": "2018-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A master piece, very well written, directed 5/5 must watch. Everyone has their interpretation to the end & I have mine : )  donot miss!",
            "review_date": "2018-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie i have ever seen in my life ,Ayushmann was astonishing  And director of movie done a great job great story",
            "review_date": "2018-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best pictures ever watched till now.Perfect story perfect plot and perfect placing of all the acts so everything perfect.Hats off Ayushman.You rock man!!No there exists nothings better than him.",
            "review_date": "2018-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent acting & master production.",
            "review_date": "2018-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Bollywood thriller movie which is currently and will remain for a long time in future, a LEGEND in plot , acting and direction.",
            "review_date": "2018-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best and most INTENSE Bollywood movies of this decade and I do not remember the last time I enjoyed watching a movie in the theatre this much! Must watch!",
            "review_date": "2018-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too clever for its own good.",
            "review_date": "2018-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although an admirable foray of Indian cinema into the dark comedy genre, 'Andhadhun' is often slow and needlessly convoluted -- but its twisty storyline and excellent performances from Khurrana and Tabu make it an overall enjoyable watch, down to the last second.",
            "review_date": "2018-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is an over dramatic mess. With only the score to save it.",
            "review_date": "2018-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nerve wrecking, literally\nAnd Ayushman Khurana killid with his acting, the suspense kept till the last second, and the thrills and twists never grow thin throughout the movie.",
            "review_date": "2018-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andhadhun is a Masterpiece directed by Sriram Raghavan which is a perfect thriller on every level. The Storytellling is at the finest over here and this has to be the best movie bollywood has produced in a while. The Plot is filled with shocking twists and turns which will keep you at the edge of the seat for the whole duration of its run time.",
            "review_date": "2018-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crazy fantastic and andhadhund paisa vasool movie",
            "review_date": "2018-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A superb thriller in which nobody can be trusted, least of all the director.",
            "review_date": "2018-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "brilliant unmissable movie ! one of the benchmark thriller movies of bollywood.",
            "review_date": "2018-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie to be made by Sriram its a must watch for the thriller lovers. Best performances from Ayushman and Tabu hats off for them. ",
            "review_date": "2018-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant movie, be prepared to be constantly surprised. It got an intriguing plot full of suspense, got ridiculous yet believable situations, anything can happen and does happen, tons of laughter even in serious scenes like murder, blackmail, and kidnapping, you got to see it to believe it. By the end of the movie, our senses are heightened in wondering what's going to happen next. Got some of the most unbelievable characterizations I have seen in Indian cinema supported by superb performances, Ayushmann is good and Tabur is even better, loved the music, the only flaw I can think of is, it's a tad too long.",
            "review_date": "2018-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'AndhaDhun' is a fascinating and hilarious suspense thriller uplifted by its clever writing, top-notch execution, and top-notch performances.",
            "review_date": "2018-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well paced and meticulously executed, this movie is  a must watch. Brilliant performances by the entire cast with a storytelling style that keeps you intrigued, amused and thoroughly entertained.",
            "review_date": "2018-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie must watch!!!!",
            "review_date": "2018-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "India is no longer deficient of Cinematic Intelligence,  What a Movie ?",
            "review_date": "2018-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional.. darkest Bollywood comedy till date. Tabu at her best as always.",
            "review_date": "2018-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "‪Oh My G Andhadhun is So GOOD! It is one of the BEST movie of the year! Sriram Raghavan is a genius. Radhika Apte is delightful as always. Ayushmann Khurrana is phenomenal as a “can he” or “can he not” see blind man. But my favorite obviously is Tabu as this layered manipulator who just kills. Plus the endless Bollywood Easter Eggs throughout the movie made me fall in love with it even more. Do yourself a favor and go see this cracker of a movie. You will have a blast. ",
            "review_date": "2018-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch it u won't be disappointed.",
            "review_date": "2018-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If there's one Hindi movie you must watch this year, it is #Andhadhun. A testament to the genius that is Sriram Raghavan, it's thrilling, full of surprises and unexpectedly funny (We must remember Hitchcock made funny films). There are times when we and the characters onscreen gasp together and in other times we already know but the characters don't, and that's where the real fun starts.\n\nIn one of the film's best scenes, there's a plan being hatched to fix a corpse, an impersonate approaches, the corpse is fixed while a blind piano player plays the instrument. Now imagine all these in a single shot with no dialogues. The good thing is, moments like these are plenty.\n\nThe film packs in so much and everything is so intriguedly linked in this crazy Raghavan universe that it doesn't give you an opportunity to blink. Andhadhun is a rare treat, a film so compelling that it may univesally be considered irresistible. The only thing that this movie demands from you is attention, and once you surrender the experience gets even better. You can have blind trust on Andhadhun. From the first scene to the climax, there's something the makers have in mind for us. Go watch Andhadhun with full attention. It's worth every penny of your ticket.",
            "review_date": "2018-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The biggest gift a filmmaker can give you is by not forcing you to a one-dimensional narrative. Where in most of the Indian movies you can just know the whole story straight away by seeing the trailer, writers will force you to root for the characters they want you to, Sriram Raghavan breaks the stereotyping so well. He just tells you a story. There are no good, bad or ugly in it. From start to end you can never guess what will be the next turn on the story. So well written, well made and well cast. Ayushmann Khurrana, Radhika and legendary Tabu in their career never aimed for the stardom nor choose larger than life characters. They just acted and trusted in the materials. That's what makes them so unique and so relatable. Well done Team Andhadhun. For me the best movie of 2018 so far across any language and border.",
            "review_date": "2018-10-06",
            "source": "rt",
            "lang": "en"
        }
    ]
}