{
    "rating": 1.2,
    "release_date": "Invalid",
    "num_reviews": 117,
    "genres": [
        "English"
    ],
    "summary": "Prominent mystery writer and crime expert, Grace (Alyssa Milano), hurries back to her family home in Washington, D.C. because her estranged sister summons her. When her sister is killed and her double life as a webcam performer is revealed, Grace ignores the warnings of cool-headed detective Ed (Sam Page) and gets involved in the case.",
    "reviews": [
        {
            "content": "this is one of the worst movies i have ever seen in my life.  Failed on all counts.  The acting is so bad that I don't know how certain scenes were approved by the directors.  I was able to guess the final plot right from the start.  My expectations for this movie were already low, but they managed to overcome my disappointment.",
            "review_date": "2023-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blurgh life is too short! Almost didn't finish it. You know you're having fun when you feel nauseated at the thought of having to finish watching. \n\nUnless, of course, you're snowed in. Then those long minutes can quickly find a few hidden treasures to watch. Like this one.  So. 'Let's give it a goo!' in the words of TC's Mike:\n\nI've done my best not to write any spoilers. \n\nSort of an odd thriller - 'criminal minds' type vanity piece delivered via the tried and true 'amateur sleuth hooks up with seasoned detective and stuff happens' formula. \n\nMost egregious in my view was the lack of any backstory or character context for any of the lead players. Some author of questionable talent and supposed success is an absolute authority on police procedural issues as well as interrogation and motive.  She pretty much states as much to the captain and her FWB detective after which she's suddenly got a job! \n\nThere are further issues with the basic conduct of characters deviating from what you'd anticipate based on reality - to the extreme. (e. g romantic element & police detective) \n\nThe world of the film is constrictive and limited. Feels like only a couple dozen people live in this city and their all involved somehow. Such as somehow bumping into various key witnesses on one little walk around the block... Kinda like Trueman Show where everyone's a character and there are no 'ordinaries'. \n\nThere is some weird psuedo-breakage of the third wall when the book the film is based on is also a construct in the film. Idk what the point of that is. It is odd.\n\nIt appears to be trying to appeal to all audiences with elements of romance, action, mystery and thriller - but sadly none are done well and too many tropes and stereotypes left me realising I'd not really seen anything original or meaningful. \n\nThere are some slightly better moments such as some some curveballs to the standard police procedural pro-forma, but sadly these are few and far between. They also don't jive with the rest of it being quite dry and witless and many times end up feeling cynical and ill timed. \n\nThe casting/acting is reasonably good I think which elevates it from 1 to 2 stars.\n\nI'm actually writing this whilst watching the final few moments - a measure of how captivating the film is.\n\nPs. Oh and handwritten notes from florists tend not to be written by the person who ordered them but by the florist themselves.  SML.",
            "review_date": "2023-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Generally interesting. People who don't like it just don't like Nora",
            "review_date": "2023-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really? Even the cringiest of the cringe would be embarrassed by this disaterpiece.",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dumb, bland and poorly researched. Nothing in this movie feels authentic. The dialogue is bad, the story is bad and the mystery is mostly forgettable. Nobody behaves like believable characters for the entirety of the runtime. This is either a very poor adaptation of a decent novel or a faithful adaption of a terrible novel. It passes the time when you have nothing else to watch, but is best enjoyed with a phone in one hand, and in the company of other people. Some enjoyment can be gleamed from guessing who the murderer is. Spoiler, it's the one you all agree on for the reason you all agree on.",
            "review_date": "2022-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was horrible. Like a Hallmark murder mystery, but worse. The acting is atrocious, the lines are pathetic, this movie sucks.",
            "review_date": "2022-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible acting! Especially the female acting! Cringy moments in the storyline. Painful to watch",
            "review_date": "2022-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was a bionic super bad movie made by pieces of lesser movies.",
            "review_date": "2022-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is dreadful.\n\nComplete nonsense.\n\nI would recommend painting your nails instead of wasting time watching this.",
            "review_date": "2022-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two ladies at the kitchen were drinking wine:\n- I can be an actress, you know? I could play a sexy detective wearing latex!\n- And I could be a serious police captain. Do you have money to shoot the film?\n- Of course I do. Let's do it!\nAnd they did...",
            "review_date": "2022-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible acting, terrible plot. The cinematography is similar to that you see on the hallmark channel. Overly cliche lines and writing. I would not waste my time on this. Big fat F.",
            "review_date": "2022-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a bad movie. Waste my time!",
            "review_date": "2022-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting was so bad! There was absolutely nothing thrilling about this movie. It felt like a bad hallmark movie. The detective and author falling in love after 2 days was hilarious. The author being let in on a murder case just bc she has good profiling skills, laughable. Trying to glorify Webcam wh*res as talented artists, disgusting. Don't waste your time with the movie",
            "review_date": "2022-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No. \nI can't believe a veteran actor like Milano is so bad in this one. The story is filmsy and doesn't even resemble a daytime soap because the eye candy is...just not strong enough for me to sit through 90min of predictable sobbing and doe-eyed idiocy.",
            "review_date": "2022-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful. Barely a thriller, more like a drama. Soooooo slow and we guessed the killer about 20 mins in. Some pretty bland performances too. Don't bother watching.",
            "review_date": "2022-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was okay. Definitely something to pass the time. Could have had more added to it. It had potential. I really watched to support Alyssa Milano honestly",
            "review_date": "2022-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm still trying to figure out what Brazen is about, a romantic thriller that has neither one nor the other. Definitely avoid it at all costs, it's not worth it.",
            "review_date": "2022-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible acting, predictable plot and actors lines. Alyssa Milano should find another line of work and Sam Page wasn't much better.",
            "review_date": "2022-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The idea of rating this movie was more fun than watching it. The acting is bad, sure, but it's out-done by the worst writing I have ever encountered in a Netflix-produced murder-mystery. In the most convenient scene in cinematic history, the murdered woman's sister is granted \"full access\" to the police investigation because she writes murder novels. Writing that sentence out loud makes it sound like a piece of sketch comedy, but each scene is delivered in complete monotonic seriousness. The ending is predictable and unbelievably stupid. The writers concoct a ridiculous, out of left-field narrative for the killer, and yet an infant could see the setup from a mile away. The only thing keeping me from rating it a half of a star is how much I laughed at the movie during its duration. There is nothing clever about this film, but if you want a laugh at a terrible movie then you should check this out.",
            "review_date": "2022-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so boring my husband fell asleep in the middle of it, so it took two dreadful nights to finish it.",
            "review_date": "2022-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't find enough Rotten tomatoes to throw at the cast, script writer and director. I hope these people didn't get paid. Totally predictable. I've seen plays in middle school kids' back yards that are far better than this stinker. Come on, Hollywood. Do better than this.",
            "review_date": "2022-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God this was such a terrible movie. I can't even begin to understand how it got made in the first place.",
            "review_date": "2022-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best part of this movie was when the guy was like \"caffeine is the problem\" and the girl was like \"caffeine is the purpose\" or \nsomething like that",
            "review_date": "2022-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't even watch more than 30 min of this \" non-thriller\".. It has a weak storyline and non-fluid acting.\nSeems more of a Lifetime\nProduction.",
            "review_date": "2022-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The premise was there, but the execution terribly failed. I demand justice for its storyline.",
            "review_date": "2022-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "18%?! How did this get such a high rating. 8% would be too high. This was awful awful awful. Worst acting I've ever seen. And I mean that. Every character was terrible. Plot was terrible, criminally dull and predictable. Within 10 minutes I was hoping that it was Alyssa Milano's character that would get killed but no luck. The stupid high school kid couldn't pull it off. Did I just spoil it for you!??! You can thank me later.",
            "review_date": "2022-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally the worst movie I've ever seen. Astoundingly bad acting. The story was lazy and predictable but nothing was as bad as the acting. Every character sucked. On par with a high school film class production. No wait... maybe a middle school film production.  I wondered if there was a reason Alyssa Milano always did cheesy B movies. Now I know why. She can't get roles based her looks anymore so she's just left with...Umm... yeah I guess nothing. I've never cringed so hard. I was embarrassed for her. I was too embarrassed to even get half way through it.",
            "review_date": "2022-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A poorly written and acted movie. Alyssa Milano is truly a terrible actress. ",
            "review_date": "2022-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like everything else Alyssa Milano does, this movie wasn't even Lifetime worthy. The women in the \"power positions\" weren't believable. The attempt to make the men look like fools, falls flat. Alyssa as a hero writer seeing what isn't seen is laughable. Sucky film!",
            "review_date": "2022-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mystery? A spoof? I certainly couldn't tell  In either case it missed the mar. The dialogue repeatedly made me wince and groan out loud. The worst movie I've seen in a long, long time.",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "worst movie i have seen in a while, literally no sense plot and the acting was giving second hand embaresment",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow action and very predictible.",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My only wish is that I could give this a zero. It's like a Lifetime movie made for Netflix. No one should waste their time with this please.",
            "review_date": "2022-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible movie. Lead actress made it feel like a cheesy lifetime movie. Slow paced and corny as heck.",
            "review_date": "2022-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's difficult to tell if there was any material to work with here, if AM's performance weren't so distractingly poor to the point of dragging down the entire project.  The premise looked like it had somewhere to go, but I'm just not able to follow it.  She's that poor an actress.  Rather they got a new face to try the project again.",
            "review_date": "2022-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was Horrible. Actress should not quit her day job. Netflix sure made a stinker with this one.",
            "review_date": "2022-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The storyline is bad. So many loopholes and plots that don't make sense.",
            "review_date": "2022-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "‘What would Hamlet make of the internet?' ‘To tweet or not to tweet that is the question.' Yes, it's THAT level of terrible.",
            "review_date": "2022-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "B grade Netflix class mediocrity.  I was so irritated by the detective character's smugness so many times. Annoying,  predictable and unexciting.",
            "review_date": "2022-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Milano's agent must be a brilliant hypnotist ?! She can't act worth toffee.",
            "review_date": "2022-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The actors were absolutely fabulous in this movie. Although somewhat predictable, I appreciate a movie that kept me interested enough to watch until the end these days!  I definitely think it's worth a watch, and to the horrible reviewers, reconsider this movie.",
            "review_date": "2022-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brazen plays like one of those made for TV movies you may stumble across on some obscure cable channel or TV Plus. Poorly written and laughably acted. This movie could be career ending for most actors. Fortunately for these performers, none of them have careers anymore. I would write a bit more however, simply recalling this film makes me hate myself for sitting through it.",
            "review_date": "2022-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alyssa Milano....what happened?  Your disgust for men shines through...",
            "review_date": "2022-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie took a good book and made it horrible. I was expecting better with the cast but I'm sorry, it was terrible acting all around, the \"characters\" were literally that. I fell asleep half way through and the next day, because I thought I might just have been tired, suffered through the last half. If you don't want to waste your life, don't watch. Save yourself to watch the news, cartoons or ANYTHING else. So disappointing.",
            "review_date": "2022-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is not worth watching at all. Better save your time.",
            "review_date": "2022-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I created an account here just to say how bad this was. A better use of my time would have been watching my toenails grow for the 1h 36m I invested in this.",
            "review_date": "2022-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad script and poorly acted. This movie is predictable and awful. At least it lasted only 94 minutes.",
            "review_date": "2022-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst written, cast, and executed movie of this decade.",
            "review_date": "2022-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring, bad acting, bad script.",
            "review_date": "2022-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was pleasantly surprised!  I usually don't like Netflix movies. I wasn't going to watch it because of all of the bad reviews about this show. It's not cheesy at all and it's actually GOOD!  It only gets 4 stars because the ending was predictable. But this movie held my attention for all 1:22!  I didn't even check my phone and that's saying a lot for a gal with ADHD!  It's good. Alyssa Milano is a good actress!  I didn't know this. Don't listen to the reviews. Watch it!",
            "review_date": "2022-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't waste your time watching this. There are bunch of better thriller movies out there. It is ridiculous that a detective willing exchange information on on going investigation with the victim's family.",
            "review_date": "2022-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible movie horrible acting horrible actors specially the detective and the writer Lady",
            "review_date": "2022-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I've ever seen. It's like they weren't even trying to make it good. There were opportunities to make it good and they sidestepped all of them.",
            "review_date": "2022-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to be honest. Lately all I see when Alyssa Milano is on anything is her crazy left wing wokeness stalking a Supreme Court justice hurling unproven allegations but then I remember that smoking hottie from before I knew how low her IQ really was and have to remind myself that even Tom cruise as crazy as he is still is a great actor so give it a shot. Yep. Then I saw this and remembered. Tom cruise, yes he believes a drug addict that preached don't so drugs and sold a bunch of people on the idea that aliens attached their soles to ours and we must give his religion all their worldly possessions to be \"free\" but still HES a GREAT actor. She however never was. There was never a question if \"she\" was the boss form the 80s sitcom and it's debatable if she's a real witch after all the crazy she's done and not just from her \"acting\" on the witch show. Nope, all those are all very debatable: what can't be debated is if she's a real actor and NOPE she's not. This pile of crap should be shown to Guantanamo prisoners to get them to confess.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Milano just wanted to wear the leather dominatrix suit. Other than that, it seemed like a poor adaptation of what would've been a great novel.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely awful on every level. Avoid!",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Soooo cheesy, so unrealistic, so pitifully predictable.  Alyssa Milano is a bad choice for the lead.  She doesn't fit the character at all and the acting all around is just bad.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sam Page is hot. The rest was stupid. The End. ",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a waste of 90 minutes. Awful actors and even worse plot. Don't waste your time.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure how this became a #1 movie on Netflix. Poorly written storyline, poorly acted. Disappointing in every way.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horribly made movie with really bad acting. From the beginning you know who killed the lady, there is no suspense, everything is so unrealistic, it is like a parody. It's horrible",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, I have seen a lot of things that Alyssa Milano has done and she has been fine.  What happened here; was it a bad script or bad direction or what, I don't know but her acting was unwatchable in this movie.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some Friday night mindless trashy fun to take a break from that high-falutin 1001 movies list. \n\nBut sadly not so fun... \n\nAlyssa Milano plays a mystery novelist whose sister, a teacher by day and secret cam girl Dominatrix by night, is murdered by an unknown assailant. Alyssa teams up with the hunky police detective next door to sift through the suspects including her sister's rich entitled ex-husband who is embroiled in a savage custody battle, sister's sullen air pod wearing student whose grades are slipping and the creepy school janitor that knows a little too much about sister's secret life. \n\nSounds juicy right? I mean how do you get this wrong? \n\nUnfortunately it plods along at such a slow pace, that by the time we finally hit the reveal of the killer I had long since lost interest. The ultimate downfall is the lacklustre relationship between Alyssa and the cop-next-door. They do cutesy really well and then straight away get cranky at each other as the investigation intensifies. We never really get any love/hate sexual tension vibes and much as with the killers reveal, the will they/won't they dynamic is more like 'who cares?' \n\nThe absolute highlight of the film is Malachai Weir (who you may recognise from Billions) as the laid back partner of the hunky cop next door. He is the perfect identification point for the audience as he honestly looks like he could give a stuff if the murders gets solved or not. Also keep your eyes peeled here for Alison Araya as Police Cheif who is absolutely hilarious in the new Peacekeeper series. \n\nOh and it goes without saying - they missed a huge opportunity by dressing Alyssa Milano as a Dominatrix and NOT having her ask 'Who's the Boss?'",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An hour and half I'm never getting back.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe one of the worst movies i have ever seen in my life. They spoil the killer at the 30th minute. LIKE LITERALLY we saw the killer's eyes, it was so OBVIOUS. Don't waste your time.",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm about half way through . It's friggen  taking forever",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting was terrible and yet it didn't reach the depth the script managed to fall at. After 5min I had managed to predict who was going to be a suspect, in which order and what the « climatic » (yes the « » are needed) moment would be. I have no words to describe my last 90min spent on this planet.",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So boring….I fell asleep",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very normal detective film that looks like an episode of a TV series, but still quite valid and very entertaining. The twists are well structured and the interactions between the characters are very well managed. Too bad that in the end it is very banal and without particular inspiration",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Predictable. Characters I didn't particularly care about. Predictable.\nDid I mention it was predictable? What a waste of time! If I wanted to watch a Lifetime movie, I would have just turned on a Lifetime movie. Lazy tropes, lazy writing... just LAZY! Skip this one if you're looking for substance.",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acting was terrible! I could not sit through it.",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was so bad that I only kept watching to see how much worse it could get. I gave it a half star because Samuel Page is the only reason I considered it in the first place.",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How can i unsee this?",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie was meant to be suspenseful, but did not come across that way to me. An easy to figure out whodunit and the acting was very noticeable, therefore distracting. Seemed very contrived and kinda like a not so great Lifetime movie. Not my favorite, even tho I like Alyssa Milano.",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Will have you saying \"as if\" the entire film.",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was the worst movie I've ever seen . Can't wrap my head around how it's in the top 10 on Netflix. Kept waiting for something, ANYTHING, to make me say \"oh okay, it's not awful.\" But it never came . I don't write reviews for movies, but this one needed to be addressed. I feel like I'm entitled to financial compensation.",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who gave permission and money to make this?",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, at first I thought it will be an interesting movie, but at the end, was highly disappointed and just wasted a piece of my precious time.",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie ever, super predictable that you will be chocked of how silly it is. Not worthy ur time",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's like something I would've made back in film school but didn't…because even a student would create a better script. Who wrote this sh*t? And why is the acting so awful?",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I managed to watch the whole movie, but quite frankly, the characters of Ed (Sam Page), Ben (Malachi Weir), and Grace (Alyssa Milano) were laughably reminiscent of The Mod Squad, resurrected 50 years later.",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review is short and sweet as not much to write about. Having some experience in films/commercials, I understand the journey (and often setbacks) filmmakers face to produce a movie. On most occasions, I'm in awe of the final product and constantly surprised how movie makers can do so much with so little i.e. locations, scripts not finished, miscast actors, etc.. Unfortunately, Brazen isn't one of these surprises. I switched off about half way through though did finish the film to ensure I could write a review. Not that this is a review. Made for TV movies should be on TV, not Netflix.",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheesy, predictable but somehow still enjoyable. Probably because Sam Page is gorgeous !",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pitiful acting, terrible script.  Waste of time",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is better than most Netflix crappy movies. And I love Alyssa Milano.",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A weak and predictable script executed poorly.",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whoever said the movie was rubbish clearly don't have a clue about what makes a good film.  Alyssa Milano was superb as the grief stricken Grace Millar.  Really good storyline, kept me on the edge of my seat that's for sure!!",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the worst movie ever !!! I just wasted 1h30 that i can't get back !! The story has a potential but the execution and the acting are SO BAD !!!!! DO NOT WATCH !!\n\nI wouldn't recommend this movie for my worst enemy",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HORRIBLE ACTING! I'd have given this movie a zero but it's not possible.. so I give it a 1",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of, if not the worst acting I have ever had the displeasure of watching. Reminded me of day time TV acting, very poor.",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Any critic that would consider this as acceptable film making should quit the business, or has friends involved with the production. \"Brazen\" is the murder mystery version of a Hallmark Christmas romance...per NYT, hit it on the head",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first Netflix stinker of the year has dropped in the form of ‘Brazen'.\n\nSYNOPSIS: ‘When her sister is killed and her double life as a webcam performer is revealed, Grace ignores the warnings of a cool-headed detective and gets involved in the case.'\n\nOh dear. As slick as this film is it's just silly and stupidly bad. It's so formulaic in places it's almost laugh out loud funny and there are' very few chills.\n\nAvoid.\n\n2/10",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just really really bad....bad plot, acting, transitions, acting, plot, storyline, acting, did I mention plot. Definitely belongs on the D list for movies.",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just another Lifetime movie with a predictable story line and ending with mediocre acting. Yawn!",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible writing. Obvious. A Lifetime movie on Netflix. I love Alyssa Milano, but this is a big no. And maybe a minor detail, but a teacher in a private school and she has a blackboard with chalk in the classroom? No Smart board?? Not even a whiteboard? Awful. Lazy writing.",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst things I have ever seen, and you cannot un-see it !",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Alyssa Milano ever since Who's the Boss. Ive loved every movie she has made since then and I loved Brazen. It's such a good story and I loved how suspenseful it was. Great job Alyssa",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alyssa Milano is as bad of an actor in real life as she is acting as a person acting.  The writing is cheap porn quality.  I'm not sure if this is a tongue in cheek parody of the genre or a serious attempt at a crime thriller. The young actors should omit this from their resume.",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Alyssa Milano and as soon as this movie came out I hopped right on Netflix. This is a great story by Nora Roberts and it made for a great picture. Milano lights up the screen in anything she's in and this movie is another great addition to her resume. If you love good crime thrillers and you love Alyssa Milano then this is the movie for you.",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie! My wife always like's watching Nora Roberts movies and the like. I thought I was going to be a captive audience, but I was pleasantly surprised. Alyssa Milano plays a great part and like any crime drama, this movie keeps you off-guard and on your toes. I loved her character and was rooting for her the whole way. Great job, great movie!",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nowadays, if a movie is tagged as a \"thriller\", it has to be chock full of gore, violence and foul language. Many times, finding out who the criminal is becomes secondary by how much the film can disgust and horrify the viewer.\n\nNow along comes \"Brazen\". It's a crime drama that adds a little more of the human element to the story in true Nora Roberts fashion. The characters play well off of each other and they're all very believable. As each player is introduced, the storyline gets better and better.\n\nThe movie presents us with relationships, both broken and still-developing. I don't like dropping spoilers in a review, so I'll try and set the stage without doing so. Suffice it to say that we are left guessing through a number of great plot twists and red herrings, My interest was piqued from the opening scene and my pulse rate was definitely sent up and down throughout the whole movie. If you are an Alyssa Milano fan, you know what she's capable of bringing to a project, and this latest film will not disappoint. It's a great movie for a weekend afternoon (or evening), and it's a movie that I was comfortable watching with my whole family.\n\nI think you'll enjoy this as much as I did. It's time well-spent. Enjoy!",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so bad I'm planning to sue Netflix for wasting my time and the emotional scarring it caused.",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very bad acting, no creativity. Don't waste your time.",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Predictable.   Is something wrong with Alyssa Milano's face?   Face lift?    She use to be so beautiful.   Shame how she's fallen.  I sensed she was acting with an attitude rather than authenticity.   Not worth the time.",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do not waste an hour of your life watching this rubbish. Abysmal on every level.",
            "review_date": "2022-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dreadful.  Book was quite good so was looking forward to this.  Dreadful acting. Very poor. Didnt even watch until the end. Poor is an understatement.",
            "review_date": "2022-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poorly written and poorly acted.",
            "review_date": "2022-01-13",
            "source": "rt",
            "lang": "en"
        }
    ]
}