{
    "rating": 9.0,
    "release_date": "Invalid",
    "num_reviews": 12,
    "genres": [
        "Arabic"
    ],
    "summary": "Syrian activists, revolutionary leaders, former army generals, journalists and ordinary citizens discuss their country's humanitarian crisis and civil war.",
    "reviews": [
        {
            "content": "A must see. Such a tragedy in our  world",
            "review_date": "2018-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know if i will be able to see this again. It's a very difficult movie to watch. Syrian and Russian president deserve all the worst to come for them in a future. Highly recommended to watch only if you're ready to watch really tough scenes of war.",
            "review_date": "2017-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HBO thanks for sharing this.",
            "review_date": "2017-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Death to Putin & Assad. Goddamn them all to hell.",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film should be mandatory viewing for all government officials!",
            "review_date": "2017-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although I was generally aware of the problems in Syria, it's hard to comprehend if you merely see 15 seconds of footage on the news. This powerful movie provides a chronological history of the brutal atrocities inflicted on innocent people, most of them children and women. Torturing teens, bombing schools, raping women and men is tough to grasp...the amount of footage showing some of this and the hundreds of dead children will move everyone brave enough to sit through it.",
            "review_date": "2017-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a challenging movie for me to watch. I had to pause several times to compose myself. As heartbreaking as it is to watch... I feel it is necessary to watch.",
            "review_date": "2017-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know this was all filmed in a stage right?\nAnd that none of it is true right?",
            "review_date": "2017-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gut-wrenching. Syrian refugees are not terrorists.",
            "review_date": "2017-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russia, under the guise of helping the Free Syrian Army, instead targeted civilians, beginning with 22 hospitals in Aleppo. This is documented by Doctors Without Borders. Why do we still ignore the genocide of the Syrians and refuse to give them asylum? Why do we not punish ISIS and the Russians for war crimes? Sickening.",
            "review_date": "2017-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3/17/17 HBO\nNear the end of the movie a little boy asks, \"where is the humanity\" and that is the crux of this entire, difficult, moving and anger inducing film. This has to be the best effort yet to explain the origins of the revolution, the terror impossed on the civilians and the utter callousnes of Assad, Putin and the world at large, including America and its past and present administration. There is truly evil in the world and this movie forces you to look it in the eye.",
            "review_date": "2017-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Went to the US premiere, hosted at VCU. They did not hold anything back. Frank discussion and images of the real violence to everyday people going on in Syria. Presents a coherent timeline to order the jumble of events. Talks about how the revolution started when the Assad regime started torturing children, how nonviolent protests were met by disappearings, and how Daesh posed as a group giving aid to Syrians, then started executing people. The movie makes it very clear that Syrians tried to fight for their own rights of free speech, but instead got beaten down by multiple other forces. Most disturbingly, we see Assad and Russia systematically bombing hospitals and people dying of starvation and chemical weapons.",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        }
    ]
}