{
    "rating": 8.3,
    "release_date": "Invalid",
    "num_reviews": 210,
    "genres": [
        "Hindi"
    ],
    "summary": "A tradition-minded Indian housewife (Sridevi) enrolls in an accelerated English-language course after she finds herself unable to place a simple order in an American restaurant.",
    "reviews": [
        {
            "content": "Feel-good movie with a great message.",
            "review_date": "2022-02-23",
            "source": "rt"
        },
        {
            "content": "Must watch it........",
            "review_date": "2021-11-16",
            "source": "rt"
        },
        {
            "content": "The courses in foreign languages are often great experiences",
            "review_date": "2021-07-10",
            "source": "rt"
        },
        {
            "content": "A sweet, likeable film that has its heart in all the right places.",
            "review_date": "2021-05-30",
            "source": "rt"
        },
        {
            "content": "best movie to watch , this film gave  hope to a person  to learn at any age",
            "review_date": "2020-04-21",
            "source": "rt"
        },
        {
            "content": "At once both uplifting and gratifying, 'English Vinglish' is at once a smart and affecting film about motherhood which both consumes you with it's light-weight touches, and moves you with it's inherent sweetness. It's a mainstream film which has been elevated by smart story-telling by Gauri Shinde who affectionately dedicates the film to the clan that mothers are, and Sridevi unleashes in her comeback a yet another distinct performance. It's truly a great coming-of-age nature of cinema that makes this film worth viewing, and viewing, and viewing.",
            "review_date": "2020-03-17",
            "source": "rt"
        },
        {
            "content": "Must watch this movies should release more",
            "review_date": "2020-01-13",
            "source": "rt"
        },
        {
            "content": "English Vinglish has a different view on motherhood than I have seen in other Bollywood films. While a film like Mother India shows its audience the hardships that a mother can go through and demonstrates the unparalleled love that a mother has for her children, English Vinglish allows its central female character to be more than a mother. The film demonstrates that it is possible to have multifaceted female character in Bollywood. Although being a mother is a large part of Shashi's identity, it is not all that exists in her life. For instance, she is also a baker. She is clearly proud of this work, as can be seen when she is overjoyed that she is called an entrepreneur by her English teacher. It was empowering to see that just because she has children does not mean that she can not have outside interests and passions. \n\nOne part of the film that was not so pleasing to me was the ending. I understand why Shashi decided to prioritize her family over her English classes, but it was still a bit disappointing to see her relinquish her independence. A traditional Bollywood mother will do anything for her family. Rosie Thomas asserts that in Bollywood films, a mother \"is able to love and give unconditionally\" as well as \"keep the family and home together\" (Thomas, \"Melodrama and the Negotiation of Morality\"). It would be incredibly unconventional to have Shashi simply abandon her family at the end of the film. I never expected that to happen. However, I did anticipate that her husband would come to realize that he had been taking her for granted. It was frustrating that she never had any sort of confrontation with her husband about his lack of respect for her. It seemed as if Shashi had not made any significant modifications to her old life, which undermined her growth throughout the film.",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "English Vinglish encapsulates the difficulties encountered by many Indians who are unable to speak English. Starring Sridevi as Shashi Godbole, a married woman whose children and spouse mock her inability to speak English. The other characters are played by Mehdi Nebbou (Laurent), Adil Hussain (Satish Godbole), Priya Anand (Rahda), Sujata Kumar (Manu), and Sulabha Deshpande (Mrs. Godbole) with guest star Amitabh Bachchan. The film follows Shashi as she travels from India to New York for her nieceï¿ 1/2(TM)s wedding. In New York she decides participate in a four-week English class with other non-native speakers. Although from different backgrounds, the class builds a strong relationship towards one another as they feel a connection to one another due to their similar struggle and desire to learn English. Laurent, a French man, in particular grows close to Shashi and develops romantic feelings. As a married woman, Shashi must decide whether or not to act upon her feelings toward Laurent. Due to the confidence provided by her classmates and her improved English, Shashi finally gains the respect of her family.\n\nIn many ways this film strays from the characteristics of a typical Bollywood movie. Unlike most Bollywood films, this movie provided no extradiegetic scenes and existed in a realistic world. Without the typical song sequences characteristic of many Bollywood films, such as DDLJ, Amar Akbaar Anthony, and Kabhi Khushi Kabhie Gham), English Vinglish has an overall more modern and realistic take on Bollywood cinema. According to Rachel Dwyer, ï¿ 1/2In recent years some of the multiplex films have been made with more dialogue in Englishï¿ 1/2 not to market films overseas (there has been no interest in these films at all from overseas distributors) but because it gives an element of realism to the filmï¿ 1/2Â? (Dwyer, ï¿ 1/2Zara Hatkeï¿ 1/2Â?). Much of this film is spoken in English as Shashi attempts to learn the language and gain respect from her family. This film would be enjoyed by many non-native speakers as they can relate to the struggles that Shashi faces and celebrate as she overcomes these obstacles. Despite the differences from most Bollywood films, the main characters in English Vinglish strongly value their familial relations, a value shared amongst most Bollywood films. The choice between family and love is a common theme throughout Bollywood as expressed in both DDLJ and Qayamat Se Qayamat Tak. English Vinglish continues to explore the never-ending conversation between the values of love and family.",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "English Vinglish is remarkably different from most Bollywood movies, although it still employs many of the same themes and values of traditional Bollywood. It stars Sridevi as Shashi Godbole, a woman who isn't satisfied in her role as mother and wife. She finds herself stuck, in part because she doesn't know much English. Her family makes fun of her English and doesn't appreciate the work she does selling ladoo (Indian sweets) and caring for them. When she travels to New York for her niece's wedding she decides to learn English while she is there and enrolls in an intensive language program. It is in these classes that she finds a supportive community. The other students are from various backgrounds, providing unusually diverse representation, although the characters seem to be based on stereotypes. Shashi experiences independence in New York, learns the word entrepreneur, and gains self-confidence. She also meets Laurent, played by Mehdi Nebbou, who provides a love interest outside her marriage. \n\nEnglish Vinglish is a woman-centered film, directed by a woman, which frames Shashi by her roles as a mother and wife, but doesn't center on them. The main plot is driven by her quest to learn English, independent from her family. Director Gauri Shinde focuses on Shashi's personal journey, but frames it within Bollywood's family values. While Shashi is not always respected, she is portrayed as a good mother and wife. Ultimately her decisions are based on what is best for her family, not herself. Like the mother, Radha, in Mother India, Shashi cares deeply about her family. However, her strength is portrayed in a very different way. Radha is consistently strong despite overwhelming odds; strong in an impossible, superhuman way. Shashi is a much more realistic character who experiences normal displeasures and develops strength during the course of the movie.\n\nI really enjoyed the progressive narrative, which follows a woman who is building her self-esteem. It also reveals the struggles women face. For example, Shashi notes an inequality saying \"When a man cooks, it's art... when a women cooks, it's her duty.\" In addition, the music is catchy and Shinde does a wonderful job making the movie fast-pasted and very entertaining. I found the ending surprising and slightly disappointing, however, it is based on Bollywood morality. As Rosie Thomas writes, good, moral characters think about their family and community before thinking of themselves (The Moral Universe: Mothers and Villains). Shashi certainly fulfills this role. Overall, I believe this is a well-done, engaging film, which provides a compelling storyline unlike those of other Bollywood movies.",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "This is a very cute, easy to watch film with a good message. There are some special moments where the two main characters speak in their own native tongue and completely understand each other. A very Bollywood film in that there is the classic group dance scene. It was a pleasure to watch",
            "review_date": "2018-04-12",
            "source": "rt"
        },
        {
            "content": "i love the movie not becuse the movie is an exceptional art piece but it literally reflects the everday struggle of woman. I like the way she was able to develop herself",
            "review_date": "2017-11-04",
            "source": "rt"
        },
        {
            "content": "Great movie.  Funny too.",
            "review_date": "2016-09-12",
            "source": "rt"
        },
        {
            "content": "Another awesome Indian movie!  It emphasizes about the loving relationship and respect between a family.  Highly recommended!",
            "review_date": "2016-08-06",
            "source": "rt"
        },
        {
            "content": "Very entertaining comedy and family drama. Lots of great lessons for a Indian family too. A must watch for the whole family",
            "review_date": "2016-05-02",
            "source": "rt"
        },
        {
            "content": "Beautiful  heartwarming funny and inspiring",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "For anyone that ever dealt with being a Stranger in a Strange land, this movie will hit home. It was very touching. It also deals with those in English Education as well.  But basically it's a movie about family.  Also, I like the Japanese title \"Madame in New York\" more than the English title.",
            "review_date": "2015-01-15",
            "source": "rt"
        },
        {
            "content": "Great film about study english",
            "review_date": "2014-08-18",
            "source": "rt"
        },
        {
            "content": "A delight from start to finish! Sredevi's return tothe big screen was well worth it. This is a very modern Bollywood film with songs but not sung by the cast. Its touching and well worth a watch",
            "review_date": "2014-06-22",
            "source": "rt"
        },
        {
            "content": "This was the best movie I saw last year, and I did not expect to like it.  It is funny, contemporary, and beautifully written and acted.  Most of the action takes place in New York City and New Jersey, so despite its characterization as a foreign film it seems very American.  The story is surprising, not trite, and makes you want to cheer for the main character for all the right reasons.  Really good movie.  Fun.",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "Its a good hearted movie, despite being very over dramatic at times. The film has a lot of strong messages which I appreciated. Despite its repetitive nature it isn't a boring movie and its a joy to see this character grow. I do think that the main character has much less self control than the average person and it becomes an easy way for the conflict to develop. There are minor plot inconsistencies and the movie starts to get slower at times since multiple scenes show similar things happening, but ultimately its an enjoyable movie that also has great themes for everyone.",
            "review_date": "2014-04-13",
            "source": "rt"
        },
        {
            "content": "a story depicting each and every  women, i think i see sashi in each and every women i have met in India. I guess for some the movie might seem unrealistic about the choice sashi makes in the end but to my core of heart i know thats what every women does when it comes to decision.",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "\"When you don't like yourself, you tend to dislike everything connected to you. New things seem to be more attractive. When you learn to love yourself, then the same old life starts looking new, starts looking nice.\"",
            "review_date": "2014-01-20",
            "source": "rt"
        },
        {
            "content": "Wonderful movie pictures treasured feeling deep down in a mother's heart. To all mothers in the world, thank you.",
            "review_date": "2013-12-28",
            "source": "rt"
        },
        {
            "content": "\"It's great like 3 idiots\"someone said. I don't agree that. There is gender bias in this movie. Husband controlled wife's life without respect. No matter there are happy and different experience, But she has to come back to India. Because family and are most important for female in Easter culture. This movie express \"although you had great adventure in New York, but you should stay with your husband, no matter you are no longer interested  living with him. And he probably loved someone else already.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "not a bad storyline, but it took too long to get to the point",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "A MUST WATCH...TRULY UNIVERSAL FILM",
            "review_date": "2013-12-22",
            "source": "rt"
        },
        {
            "content": "Wish chacha had more lines ... !",
            "review_date": "2013-12-01",
            "source": "rt"
        },
        {
            "content": "A heart-warming romance about a woman empowering herself to overcome her stigma as a housewife.",
            "review_date": "2013-10-17",
            "source": "rt"
        },
        {
            "content": "What a comeback by Sridevi in 'English Vinglish'. It was a treat to watch her act - such beautiful display of emotions - hesitation, fear, control, resignation . She was wise in choosing the script and did full justice with it. Special mention goes to a small and simple scene between her and AB (guest appearance) - they took a very very simple scene to an altogether different level. No wonder they are the real superstars. Good direction and choice of character artists too. Seems that the movie is a tribute to the shedding of 'silent tears' by women worldwide in order to bind their family together and/or carve an identity for themselves. As Shashi (Sri) rightly sums it all by saying that 'she is not looking for love but respect'.",
            "review_date": "2013-10-14",
            "source": "rt"
        },
        {
            "content": "undoubtedly, the best feel good film of bollywood.",
            "review_date": "2013-08-01",
            "source": "rt"
        },
        {
            "content": "A simple, sweet story for the whole family.  Pretty typical, cliched but performed well and entertaining enough.  Only issue is the run time, goes over two hours because of the several random musical montages, but I guess that was expected for a half-Bollywood Indian production.",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "When a good story mixes with great moral! Proper time invest!",
            "review_date": "2013-06-14",
            "source": "rt"
        },
        {
            "content": "Sridevi returns in a suitable vehicle. Easy going and enjoyable fun film.",
            "review_date": "2013-05-27",
            "source": "rt"
        },
        {
            "content": "Very impressive. Simple yet powerful story telling.",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "rather a different story... simple, yet brilliantly done!",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "Excellent Bollywood to Hollywood film that bridges cultural divides through the power of friendship, food and families.",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "Entertaining despite the cliches.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "Thoroughly enjoyed this uplifting and fun film. More suited to a female audience although could also be appreciated by men.",
            "review_date": "2013-03-22",
            "source": "rt"
        },
        {
            "content": "beautiful experience",
            "review_date": "2013-03-15",
            "source": "rt"
        },
        {
            "content": "the story is great.  Show the passionate of learning and conflict of family.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "Na ez végre aranyos volt, megérte.",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "English Vinglish is yet another good example of progress in Indian-American movies that needs to be pursued further by Bollywood filmmakers.The movie tells the story of Sashi, an insecure Indian housewife who lives with her, rather sexist husband and two kids, one being a very spoiled teenage daughter who both think less of her resulting from her incapability to speak the second language in India, English. \nAs the movie goes, Sashi has to leave India and come to New York for her niece's wedding. The film gets interesting when Sashi enroll in a four weeks English course that leads her in founding a new freedom of expressing herself without the judgement from her family and society in general, but also spark a new possibility of love interest with Laurent, French guy in her English class who take an interest at her. \n\nI appreciate what the director, Gauri Shinde did here. She tells the enclosed obsession of Indian society with the Western lifestyle, and at the same time tackle women role in an Indian family. But, of course like any other Indian movies who are to afraid to make a bold statement, the climax ended with an absurd and disappointing conclusion.\n\nBollywood veteran actress, Sridevi plays Sashi beautifully, after being rather absence from the Bollywood scene, which leaves me with hope to see more of these kinda role offers to those 'aged' actresses. And a big shout out to French actor, Mehdi Nebbou who plays the underdog character, Laurent. \n\nWhether it's the interracial relationship, gay awareness character or even hint of feminism merely presence in the movie, English Vinglish do brings a fresh point of view that has been lacking in Bollywood movies for(ever) sometimes now.\n\n6.5/10.",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "Sridevi is terrific!",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "fell in love with Sridevi...",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "for me, one of finest bollywood movies so far. Not too cliche or cheesy, heartwarming and great in every aspect. Nice job.",
            "review_date": "2013-02-13",
            "source": "rt"
        },
        {
            "content": "A  routine story, but well executed and with a number of fun character performances in the supporting roles, including a delightful cameo by Amitabh Bachchan in the Hindi version. (I expect Ajith Kumar's cameo is good in the Tamil version as well.) Even the English language actors are good; not always the case in Bollywood movies. \n\nThere aren't any real surprises but the movie is brisk and charming and effectively affecting. I even teared up a bit toward the end.",
            "review_date": "2013-02-08",
            "source": "rt"
        },
        {
            "content": "One woman show with great motivation. Sri Devi is no doubt a bollywood queen..",
            "review_date": "2013-02-07",
            "source": "rt"
        },
        {
            "content": "Sridevi Rocks And How !! She hasn't lost the touch but has even gone a bit further in her acting skills. This  movie belongs all to her and must be watched just for her. Though the brilliance of director Gauri Shinde can't be denied !! Must Watch !!",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "One of the most realistic film made in the Hindi Film Industry., really a beauty :)",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "The execution, direction, flow and music along with an accurate depiction of Indian middle-class family dynamics: Spot On.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Really good movie, one of those rare Hindi movies worth recommending to everyone. A really well knit story that isn't as far removed from reality as you'd imagine. I think they could have worked a little bit on the ending and made it have a little bit more of an impact, but I think the entire film was really well done, good acting, very good choice for the cast and definitely worth a watch. I think if everyone can follow the two main messages of the film, we'll all become better people. =)",
            "review_date": "2013-01-19",
            "source": "rt"
        },
        {
            "content": "Cute, touching, funny story. Fell in love with Sridevi and her acting.",
            "review_date": "2013-01-16",
            "source": "rt"
        },
        {
            "content": "Very sweet... Very true...",
            "review_date": "2013-01-13",
            "source": "rt"
        },
        {
            "content": "A decent movie with some good acting by Sridevi.!\n\nSort of enjoyable at times but you'll definitely love it if you're 40+ in age!",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "Best Bollywood film I've seen for a long time...",
            "review_date": "2013-01-07",
            "source": "rt"
        },
        {
            "content": "Great comeback by Sri Devi. Loved it.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Superb...Awesome...Fantastic...What a comeback from Sridevi...Take a bow!!",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Very realistic. For once.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "KivÃ¡lÃ³ indiai , mondom indiai mozi bÃ¡rkinek! KÃ¶telezÅ'en CSAK felirattal",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Very nicely done ,simple story and effective screenplay",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "Sridevi proved again after a long back with sensational movie.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "Sridevi just made me realize why the entire nation was mesmerized with her in the 80s-90s. Now she is back with a bang after a 15 year hiatus delivering another masterful performance carrying the entire movie on her shoulders with such grace, charisma and a terrific sense of humor. What the movie suffers from bloated runtime, occasional indulgences to mainstream comedy, some stereotypical characters and an undying resolute to repeatedly show the protagonists misgivings more than makes up with many subtle heartfelt moments.\r\n\r\nShashi (Sridevi) is a simple Indian housewife happily married with 2 children in an upper-middle class family. She is loving and caring but she does not seem to get the respect she deserves primarily due to her inability to converse in English. When her sister invites Shashi to New York to help with her daughter's wedding, she gets nervous about traveling alone ahead of her family. With a little inspiration she receives from her fellow passenger, she secretly enrolls in a English speaking class.\r\n\r\nThough Sridevi hogs all the limelight, rest of the cast apart from a few forced in for stereotypes delivers a brilliant performance. The writer-director has done what is rare in Hindi film industry, art of being subtle (well mostly when mattered). Also she seem to have a talent in extracting those delicate masterful nuances from Sridevi which uplifts the movie entirely. The background score though does not feature the song and dance routine is mainstream and decent. \r\n\r\nLittle overdone but delicious nevertheless.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "It is always so comforting to watch sweet Bollywood movies like this one, during the winter vacation days over baked caramel apple croissants. I fully enjoyed the journey Sridevi takes you on this tender comedy romantic movie. Even though it also revolves around a wedding, this story is fresh and different from the typical Bollywood predictable maintream movies. I also enjoyed the photography in both India and New York, portraying both places openly and welcomingly. Sridevi playing the protagonist is awesome, I have to embarrassingly admit I had not noticed her work until now, please forgive me in all these years of Bollyfanhood, but oh well, happy to meet and express how young she looks!! Overall this is a great investment of time for good Indian entertainment.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "As most Hindi movies go, starts off great and then progresses to an interesting middle, raising many complex dilemmas all women can relate to. Yet, at the end of it all, the film resorts to a convenient end with a moral that's hard to digest without many spoonfuls of laddoos.",
            "review_date": "2012-12-23",
            "source": "rt"
        },
        {
            "content": "A very nice movie that tells the story about a mother that has major issues with English and speaking reading understanding etc. She gets no support or encouragement from her husband or daughter she just gets teased and made fun of that she does not try and learn and that shes an embarrassment to the family.\nThe movie struck some home truths for me and felt like something that my mum went through not for English but other things.\nThe Women gets to travel to the US and she fears it at first and is nervous etc...\nBasically i could go on forever how you have to see this movie but i wont you just need to see it its a Bollywood Flick so make sure your version has subtitles.\nOhh and the one scene that had me up in arms was the mum had made ladoos and the kid comes out from behind a plant and scares the mum and she freaks and drops the whole plate of ladoos i would have killed the kid man that kid was very annoying in the movie.\nThe best part was when the mum learns English and puts her hubby and daughter in their place and they feel the embarrassment of what they put her through.\nThe Songs were there in the movie but were not great more like just background music\nOn a film creating note this film is misleading to a degree although India has had issues with English this is not the case present day English is part of Schooling and in all places English is the first language they learn at school and then they learn Hindi.\nThis movie would be right about 30 years ago.\nHighly Recommended even if you are not into Bollywood this flick you will relate to and will give you an understanding of where a person from another country comes from and feels when they come to a new land.",
            "review_date": "2012-12-22",
            "source": "rt"
        },
        {
            "content": "Sridevi is undeniably the most amazing actress to pull off such a simple character with such grace and persistence without making the movie preachy, peachy or melodramatic.. it felt more like a personal victory of an ordinary lady.. plus my mum really liked it.. :D",
            "review_date": "2012-12-20",
            "source": "rt"
        },
        {
            "content": "A movie that's good family entertainer and one that's hard to find. The protagonist is a simple housewife who is indirectly bullied by her own father and daughter for her poor English knowledge gets a chance to visit New York for her niece's wedding. There she decides to learn English without letting anyone aware of her enrollment into English speaking course. At the end of movie, it would leave a smile on your face.",
            "review_date": "2012-12-18",
            "source": "rt"
        },
        {
            "content": "the little boy was too adorable for words (and so was 'radha')\nin truth though, wasn't the first three quarters of the movie kinda dull and slow-paced?",
            "review_date": "2012-12-16",
            "source": "rt"
        },
        {
            "content": "Good comeback movie for Sridevi... I specially liked the \"french touch\"",
            "review_date": "2012-12-15",
            "source": "rt"
        },
        {
            "content": "When you find your true WORTH in this world...The RESPECT you earn,is something that you totally deserve\n\nBeautiful movie,bolstered by solid performance of Sridevi & creative yet so simple storyline",
            "review_date": "2012-12-12",
            "source": "rt"
        },
        {
            "content": "Moti Chur ladoo ! - Awesome !",
            "review_date": "2012-12-12",
            "source": "rt"
        },
        {
            "content": "Very quietly blindsides you:)",
            "review_date": "2012-12-12",
            "source": "rt"
        },
        {
            "content": "Dramatic to the max...and pretty boring...",
            "review_date": "2012-12-09",
            "source": "rt"
        },
        {
            "content": "The name 'Shashi' remembered me person I loved once.",
            "review_date": "2012-12-09",
            "source": "rt"
        },
        {
            "content": "I am Sridevi Die-hard...:) So, loved each minute of the movie.\r\nIt is hard to understand this movie if you havent lived on the other side. By other side, I mean in a country which is full of complexes. Some of the incidents are so very true and relatable. You have to live it to get it. The entertainment value is immense, how can Hawa Hawaiii go wrong...OOOOOUU...:))\r\nAll songs are good.",
            "review_date": "2012-12-06",
            "source": "rt"
        },
        {
            "content": "Love a good Bollywood film and this is a good one.\nThe journey of Shashi from insecurity to confidence & self respect.\nIt is Sridevi's comeback movie but I'd never heard of her before this film. Count me in as a fan now.\nTouching, poignant, humorous, it sucked me in!\nRecommend to all.",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "Sridevi is still one of the best actresses of Bollywood.",
            "review_date": "2012-12-03",
            "source": "rt"
        },
        {
            "content": "Good time pass movie with Botoxed Sridevi leading the way.  It is fun at parts and typical hind movie senti in large bouts....",
            "review_date": "2012-12-01",
            "source": "rt"
        },
        {
            "content": "Comeback film of Sridevi, an undoubtedly a great actress. Here she plays a role of an housewife who does not know English and is sought of let down in the society.  A sweet film .",
            "review_date": "2012-12-01",
            "source": "rt"
        },
        {
            "content": "Cool Indian movie very little English.",
            "review_date": "2012-11-28",
            "source": "rt"
        },
        {
            "content": "An easy to watch well made film.",
            "review_date": "2012-11-25",
            "source": "rt"
        },
        {
            "content": "Sweet characters, and some great moments. A simple and strong message underlying in the script and some good dry humour.",
            "review_date": "2012-11-25",
            "source": "rt"
        },
        {
            "content": "The best Bollywood movie I've seen this year!",
            "review_date": "2012-11-25",
            "source": "rt"
        },
        {
            "content": "A feel good film that offers stength to adapt with life...",
            "review_date": "2012-11-25",
            "source": "rt"
        },
        {
            "content": "English Vinglish (Tamil) is Absolutely beautiful with great depth! Loved every minute of it! a must watch family entertainer.",
            "review_date": "2012-11-24",
            "source": "rt"
        },
        {
            "content": "Totally enjoyed this movie",
            "review_date": "2012-11-19",
            "source": "rt"
        },
        {
            "content": "nice movie...but not much entertainment ...",
            "review_date": "2012-11-19",
            "source": "rt"
        },
        {
            "content": "This movie really surprised me; not bad at all.",
            "review_date": "2012-11-18",
            "source": "rt"
        },
        {
            "content": "Loved the movie... Nice story... Good comedy and drama and a heart touching movie... Will recommend to everyone... Great for kids too, so watch with family..",
            "review_date": "2012-11-18",
            "source": "rt"
        },
        {
            "content": "A feel good movie. This one leave you with a smile on your face. Sridevi excels as Shashi, a middle class house-wife who is poor in English.",
            "review_date": "2012-11-18",
            "source": "rt"
        },
        {
            "content": "It was just amazing and a great delight to see Sri Devi in an unconventional role in this light-hearted drama. The movie is rudimentary, yet had me glued to the\ncouch. The theme of the movie, which is delectably presented, is rife\nin both India and Pakistan, where burgeoning middle-class generation\nsees the parent as some archaic 'object.' Sri Devi's stellar\nperformance will surely land her a Filmfare critics' award if not the\nbest actress's.",
            "review_date": "2012-11-14",
            "source": "rt"
        },
        {
            "content": "Watched a delightful movie after long. Please don't go by what the critics say, as most of them here are western and know zilch about Indian family system. This is a beautiful movie of a women who gives it all to keep her husband, children and passion alive. A very sensible movie indeed. One of the Bollywood best in 2012.",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "such a beautiful film --- wow Sri Devi is really INCREDIBLE --- after all these years, she still got her unique charm & acting --- her expressions & acting is simply brilliant --- not only her looks are beautiful but also her acting --- she is so charming & adorable --- she literally lived in that character till the end --- and also everyone in the movie showed a great performance --- great screen play & direction --- though Ajith comes for a few mins but he attracts with his trademark smile --- Priya Anand is sooooo cute & lovely --- a feel good movie, I JUST LOVED IT :)",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "Day: Saturday\nDate:  10 Nov 2012\nTime: 8.30 pm\nWith: No One\nOn: HD TV.",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "perfect emotions, and excellent performances.",
            "review_date": "2012-11-10",
            "source": "rt"
        },
        {
            "content": "After a long time, a heart warming and humane movie from Bollywood. No frills, no action, no item numbers, no hollywood stunts...plain, simple, about everyday people. Such a treat to see Sridevi on screen, playing her age and reminding us what good actresses are made of ...not brands, not make-up, not accents but acting that can invoke emotions. As much as I would have loved her hooking up with the French guy, it sounds almost unrealistic for her character to have done so. Loved her small little speech in the end about marriage. With so much variety and culture, I hope we got more such movies from Bollywood. Wonderful job by Gauri Shinde. If you want to watch a feel-good movie, go watch this...",
            "review_date": "2012-11-10",
            "source": "rt"
        },
        {
            "content": "Aflatoon (english vinglish)\nHain junoon (english vinglish)\nMorning noon (english vinglish...)\nIt's all about english vinglish\nOh o o..",
            "review_date": "2012-11-05",
            "source": "rt"
        },
        {
            "content": "This film is a must watch for every Indian housewife",
            "review_date": "2012-11-05",
            "source": "rt"
        },
        {
            "content": "Deepinder'sPerspective: The movie has an excellent couple of morales: Equality of sexes in a wedlock, overcoming your shortcomings regardless of age or other societal pressures, strength of character etc. Now coming to the movie and its primary character Sridevi. The first half of the movie is a Drag unfortunately. The concept of a daughter disrespecting the mother is not naturally designed and appears exaggerated. The second half of the movie is the USP of the film. In come a few characters that lighten up the movie's depressing first half through colloquial mockery. Sridevi has done a good job, however she seemed a shadow of the actress I've come to see over my years. She felt restrained and conscious - probably thinking that some of the many plastics on her face or the brand new set of teeth might come off!! Unfortunately the delivery of the excellent morales could have had a better and entertaining capsule. I wouldnt rate the movie higher than 6.0 stars and expect that rating from RT.",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "Power packed Solo performance...",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "Great movie. Perfect mix of culture. Awesome music. A must watch.",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "A breath of fresh air for two+ hours. The story is unusual in Hindi cinema. And Sridevi is just brilliant. Plus the side-tales covered are truly remarkable and without the usual Bollywood stereotypes - a teenage daughter's rudeness, a patronizing husband who is otherwise well-meaning, a foreigner niece who is truly helpful, a French chef falling in love with an Indian housewife, a Pakistani English-learning cabbie who is plain humorous etc.",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "Extremely naturalistic acting and free flowing and unforced comedy, unlike other masala movies from bollywood. One of the best comedies out there.",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "I wasnt' expecting much, but was deleighted by this whimsical film with subtle, thought provoking handling of several issues.  Loved the cast of students - maybe because when I visited NYC I didn't find any so multi dimentional.  My experience was more like hers in the cafe.  Went in thinking I was going to see a haphazzard Indian film and walked out pondering many subjects; the power of English on the world, how we treat women and foriegners (or just people with an accent), stereotypes, relationships, family ... etc.  Worth seeing if you need a lift!  Don't expect great acting, but I can't imagine trying to fake that you didn't know English if you actually did.  Also be forewarned - there's a brief intermission (I guess it's an India thing).",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "This movie was released in multiple languages. I saw this movie in the Tamil version.\n\nThis movie is about a typical Indian woman who has trouble with English speaking and her New York expedition.\n\nThe simple one line story is whether Sashi (Sridevi) succeeds her English learning mission?\nComing to the lead role Sridevi has done it picture perfect in her role of a middle aged typical Indian women.  She proves us that her acting skills are legendary through her expressions and dialogue delivery. Her casual looks suits the role perfectly. The whole movie we see her domination on screen.\n\nPriya Anand comes as Sridevi's niece and helps her to succeed in her mission. She didn't have much screen space yet delivers a decent performance and her casual advice to Sridevi about 'love after marriage isn't wrong' we see her American cultural influence. Other characters like the husband and daughter of Sridevi has fulfilled their roles in humiliating.\n\nPerfect group was the classmates of Sridevi all of them were so perfect in choice and did their part very well. The French cook with his love for Sridevi and the unkown language conversation between them was interesting.\n\nSurprise element in the Tamil version is Actor Ajith . He travels along with Sridevi to New York and comforts her during her flight with his comic sense.\n\nThe only drawback we could feel when watching it in Tamil was we could not take the entire faces in the movie to be a Tamil people. The marriage ceremony was done in Marathi style where we cannot take that as Tamil culture. But we have to come face to face with the fact that this was a Hindi movie dubbed in Tamil.\n\nExcept this cultural point the overall movie was clean in its scope and casting. Nice work by Director Gauri Shinde and team. We feel like when the movie ends as if we are out of the English class.\n\nGet in for a feel light entertainment drama from the house of \"Cheeni kum\" and \"Paa\".\n\nVerdict: \"English Vinglish\" Mission Spoken English accomplished .Definitely Sridevi sweeps it all.",
            "review_date": "2012-11-01",
            "source": "rt"
        },
        {
            "content": "Wonderful as the movie was, it reminded me of incidents that happened when I was a kid. Read about my experience in my blog. http://vibhanayak.wordpress.com/2012/10/31/english-vinglish-could-have-been-story-of-my-mother/",
            "review_date": "2012-11-01",
            "source": "rt"
        },
        {
            "content": "Not just about English but about understanding cultures. Quite a big issue these days. All above the movie was something sweet & good to see the 80's queen back in action.",
            "review_date": "2012-10-31",
            "source": "rt"
        },
        {
            "content": "Wonserful! Sridev is fantastic... I loved this movie .. I can completely relate to her aituation.. So well done",
            "review_date": "2012-10-31",
            "source": "rt"
        },
        {
            "content": "Mediocre movie that doesn't really have anything new to say, but Sridevi is wonderful.",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "English Vinglish comes as a breath of fresh air amidst all the junk and mediocre films Bollywood churns out every week.I think twice before spending money on a multiplex ticket for  a  Bollywood movie  and I wasn't disappointed.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "Sridevi's powerful performance and captivating screenplay makes English Vinglish a must watch!",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "In recent time, bollywood has started producing movies having local flavor with global appeal ..",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "So sweet as a laddu.. !!!",
            "review_date": "2012-10-26",
            "source": "rt"
        },
        {
            "content": "i have not yet seen this epic movie, but it is beautiful..",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "Really good movie! Good to see sreedevi back!",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "For a film wanting to make a point about self confidence, it is whispering it in a very shy manner, like the main character. Maybe to avoid rocking the established order. There are some nice touching moments and some smiles.",
            "review_date": "2012-10-23",
            "source": "rt"
        },
        {
            "content": "Good movie exploring the life of a conservative Indian housewife",
            "review_date": "2012-10-22",
            "source": "rt"
        },
        {
            "content": "A feel good family drama with great comeback from Sridevi. Also surprise cameo from Amitabh. This movie is about a housewife who gets embarrassed always by her family determines to learn English. This movie explains how we hurt each other without knowing and how we forget to respect others in a family.  The movie has got a great message for the audience at the end. A must watch movie.",
            "review_date": "2012-10-22",
            "source": "rt"
        },
        {
            "content": "This one just reiterates why you were a huge fan of this The most expressive eyes talk you through the whole movie and leave you wanting more. The movie without here would still have been a good one in my book but Sridevi just takes it to another level. Gauri Shinde has picked a small and simple concept and created a beautiful script around it. The supporting cast is capable and the the use of Manhattan ideal. Gauri presents America without any prejudices and its a very refreshing take from all the racist pictures that are painted in usual Bollywood fare. Hats off to this effort and hope for more.",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "Regardless who you are, English Vinglish is guaranteed to contain something that you can relate to on a higher level of thinking. An emotional roller coaster that is quite possibly one of the best feel good movies of 2012!",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "brilliant movie! must see",
            "review_date": "2012-10-20",
            "source": "rt"
        },
        {
            "content": "thank you @surbhigoel for taking me to this lovely film. i really enjoyed it! big hug!",
            "review_date": "2012-10-20",
            "source": "rt"
        },
        {
            "content": "A wonderful performance from Sridevi in regard to acceptance and equality. Being very difference from traditional Bollywood movies, it holds a charm and shows the heartfelt journey of a non-English speaker.",
            "review_date": "2012-10-20",
            "source": "rt"
        },
        {
            "content": "Not your regular love shuv sing & dance in the mountains in a slinky sari in the dead of winter Bollywood movie. It was real, something everyone can connect to in one way or another with the basis of self love, familial love, respect & relationships. And it helps that its set in one of my favorite cities in the world. It's one for the DVD collection.",
            "review_date": "2012-10-19",
            "source": "rt"
        },
        {
            "content": "English Vinglish succeeds where Barfi fails. Gauri Shinde did what Anurag Basu couldn't. Barfi was fantastic in parts but the basic premise for these films is to \"Keep it simple\" which Mr. Basu dint and Mrs. Gauri did. English Vinglish is a simple film with a big heart with an absolutely outstanding performance by SriDevi. During the much expected climax, Sridevi's final speech is not all made up, you can actually feel the conversion from Hindi to English on her mind. No actress today even stands near Sridevi. The ending I expected to be very melodramatic, but Gauri Shinde dint fall in the trap, and kept it simple. Watch it with your family, it's a delightful film!",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "Simplicity is a rare characteristic in Bollywood films. English Vinglish is a film that delivers a tasteful mix of excellent performance by the returning Bollywood beauty, easy flow to the story, spotless script and a good message to every family. Recommended watch.",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "Dont bother, boring with no depth but pretended to",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "Awesome movie ... Movie was missing a good dance number otherwise I would have given it 5/5 :)",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "Good feel good movie that boasts of an amazing comeback performance of arguably the queen of bollywood.",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "Good feel good movie that boasts of an amazing comeback performance of arguably the queen of bollywood.",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "One of this year's MUST WATCH Bollywood films!!",
            "review_date": "2012-10-15",
            "source": "rt"
        },
        {
            "content": "Sri is always awesome..............!!!",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "A film that everyone can watch and appreciate. A story that everyone can relate to and understand. A role that Sridevi fits in like a glove to hand. A sure winner. If not for anything, one must watch it for Sridevi's performance and she excels as Shashi. Enter Shashi's world through Sridevi and you will laugh, cry, smile and celebrate life.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "excellent comeback movie by Sridevi. key strength is Screenplay and all credit goes to Gauri. a must see.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "Gauri Shinde masterfully makes a heartwarming film about a woman who is looked down upon by her own family because she doesn't know English and her journey to earn respect.  It's the small things in this movie that make it such a delight to watch.  Each dialog, expression, costume, etc. has been paid such careful attention to.  All characters have been developed excellently.  Songs are terrific.  The film is not at all preachy, melodramatic, or larger than life.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "Awesome nd touching movie",
            "review_date": "2012-10-13",
            "source": "rt"
        },
        {
            "content": "A heart warming tale beautifully directed and portrayed wonderfully by the very talented Sridevi... Back on the big screen where she belongs.",
            "review_date": "2012-10-13",
            "source": "rt"
        },
        {
            "content": "superb and heart warming!!!!!!!!!",
            "review_date": "2012-10-13",
            "source": "rt"
        },
        {
            "content": "nice picture, with the perfect amount of domestic flavor and no cliche jokes.",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "Sridevi's still great...really liked it!",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "It is the best movie ever",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "Nice movie but what has Sridevi done to her face?",
            "review_date": "2012-10-11",
            "source": "rt"
        },
        {
            "content": "Amazing acting! Every woman should see it! Loved it! :) :) This movie was worth the watch!!",
            "review_date": "2012-10-11",
            "source": "rt"
        },
        {
            "content": "An amazing movie and a greater return to an amazing actress",
            "review_date": "2012-10-11",
            "source": "rt"
        },
        {
            "content": "Shashi Godbole is a housewife. She runs a small catering business, and everyone loves her delicious laddoos. She does everything that she can to keep her children happy, even if they ridicule for her unfit pronunciation of 'jazz'. She doesn't speak or understand English. So does that makes her and everything she does less important? Why is a housewife's work given less importance than the work men do? And why is not knowing English language suddenly such a monstrous weakness?\n\nEnglish Vinglish throws light on such issues, and comes out as a winner. With an ordinary script like this, it is very easy for the film to go terribly wrong. But this movie doesn't â\" thanks to director Gauri Shinde (who has also written the film), Sridevi's fabulous performance and Amit Trivedi's poignant background score.\n\nSridevi (Shashi) has to attend a wedding in New York. While in the city, she decides to join an English class to 'educate' herself. She is more driven towards this by the fact that her daughter is embarrassed that her mother doesn't speak English. Soon, she finds that she is enjoying herself; by learning that she is not just a housewife, she is an entrepreneur. She means it when she says, \"When men cook, its art; when women cook, its duty.\" Mild applause.\n\nEvery actor comprising the English class is amazing,  including the teacher (David sir). English Vinglish has many little moments to keep you occupied emotionally. I admit here â\" this is the first Sridevi film I have ever seen. And she blew my expectations away with her expressive facial demeanor. Sridevi is the force that drives the film, as you yearn to learn more about her character. That is the sign of a true actor â\" to give you a fictional person that you start to care about.\n\nIt is hard to believe that a film crafted with such finesse is somebody's first directorial venture. Gauri Shinde's direction is top class. She keeps offering clever and emotionally stimulating junctures, while showing a woman's fight to win back her self-esteem. English Vinglish is the kind of a movie which you owe to yourself. Helped finely by Amit Trivedi's background score and the jaw-dropping Manhattan skyline, it is a sincerely made film with lots of heart.\n\nFour out of five. If you ask Vidya Balan how she feels about this film, she would probably say, \"Sridevi, Sridevi, Sridevi.\"",
            "review_date": "2012-10-11",
            "source": "rt"
        },
        {
            "content": "Sensational acting by Sridevi!",
            "review_date": "2012-10-11",
            "source": "rt"
        },
        {
            "content": "Brilliant film without a dull moment.",
            "review_date": "2012-10-11",
            "source": "rt"
        },
        {
            "content": "Sridevi is back,with a bang!\r\nEnglish Vinglish, just like the Laddoos, it's lead protagonist Shashi so craftily supplies throughout the movie, is as simple, sweet and tasty.\r\nworth watching",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "Sridevi steals the show...",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "Sridevi is Back... want to see more from her...",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "Very well woven script and lot of life in the narration. When my daughter said \"Is it already interval?\" I felt the director has achieved in spell bounding the audience. No words to explain at the way Sridevi got into Shashi's character.",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "Loved the movie. Heartwarming story about growth and self-respect!  I wanna watch it again!",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "What a beautiful movie.  Part Bollywood, part girl-power chick flick.  Normally I wouldn't have given it such high ratings (due to the chick-flickishness of it) but I was at a place in my life that made me relate 100%.  I cried at the end... and I never cry in movies.  :-)",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "English Vinglish is light-headed entertainment consisting senti-mental depth. It seemed to portray it's message without raising as many \"ifs\" and \"buts\" as other bolywood films do. The acting is also quite remarkable.",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "Now this is a masterclass in how to make a comeback!!!! Not \"Aaja Nachle\", not Dangerous Ishq\"!!!! Sridevi really nails this one perfectly.\n\nUsing the lack of knowledge and fluency of the english language as a backdrop, this movie tackles some major issues with such ease and simplicity that you cannot help but applaud the entire effort.\n\nGauri Shinde, in her directorial debut, handles the issue of lack of self esteem with such tact, drawing up scenes that we can all identify with in our daily lives. Therein lies the beauty of this movie. There are so many scenes that hit you right where it hurts, making you perhaps even think back to the time you may have ridiculed someone for something, without realising the effect it may have had on their self esteem.\n\nSridevi is the \"hero\" of the movie. I suspect that Boney Kapoor will have to order a new cabinet for the ir house to display all the Best Actress trophies she will be winning at the next round of awards.\n\nHer mental dilemmas, her moments of happiness - which inevitably turn to sadness thanks to a barb from the family - her gradual discovery of her self esteem and self worth. All of this has been so perfectly assayed by her, in a very dignified, real and believable way without any melodrama or OTT stuff.\n\nThe other members of the cast do make their own impressions on us, but Sridevi's overbearing presence makes them all pale into relative insignificance.\n\nWatch this one for sure, do not miss it. Watch it for Sridevi's return, watch it so you can introspect on your interactions with people less fortunate than you. Mainly, watch it to become a better person!!!!!!",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "is it bad that i wanted her to leave her jerk husband and run away in to the sunset with Laurent?",
            "review_date": "2012-10-09",
            "source": "rt"
        },
        {
            "content": "as delightful and palatable as the ladoos being served",
            "review_date": "2012-10-09",
            "source": "rt"
        },
        {
            "content": "Great humor, heart, & New York City! The English class scenes alone are worth the price of admission",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "I absolutely loved this movie. So heartwarming and tear jerking.  Go SriDevi!",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "Watched English Vinglish over the weekend! Fantastic movie on a very simple and realistic theme! More than anything, this is one of those very rare Indian movies where there wasn't a single annoying character/actor. Loved it!",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "fantastic piece.....quite a touching experience. a must watch!",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "Excellent Movie! .. 5 Stars! .. Sridevi is absolutely fantabulous! .. its a must see!",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "Witty, funny & heart warming",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "A delightful movie, a strong story, a breathtakingly refreshing performance by the legendary Bollywood actress Sridevi, who truly has brought a much-needed breath of fresh air into Bollywood films for sure! A must-watch for Bollywood fans the world over! :)",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "Excellent feel good movie with a human touch. All the credit goes to the director",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "great movie, good comedy & Indian drama, awesome time, Good to see SriDevi back",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "Probably a minority view but the film did not live up to the hype..was very predictable and slow-paced",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "Superb movie!! Sridevi gives the world (and the current generation of Bollywood actresses) a master class in acting.",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "must watch, worth watch.",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "Awesome!  Go see it.",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "I love you Siri Devi. In fact  I'm not a cinema person but I had to arrange my time, make a plan to watch your come back after 14 years and each of my minute spent was worth it......",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "Nice feel good movie, good to see sridevi after so many years",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "What a simple but well put story........ A good jibe for those wannabes who talk things like \"Sheee, McDonalds mein aake Hindi mein kaise baat kar sakte hai\"",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "Excellent movie! A must see if you're a Sridevi lover!! Good for kids to watch with their mothers!! Loved it!! :)",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "Sridevi who had been away from the spotlight for a decade and a half, comes back in this star vehicle, with her acting chops all there and matured like good wine. This film has a wonderful ensemble cast aptly cast and directed by Cheeni Kum's and Pa's Director's wife. Sridevi is everywhere and leaves with you when you reluctantly pull yourselves from the seat at the end and two standouts in the cast is the kid son of Sridevi and the French Cook in the English Speaking Class. She does look a bit over botoxed but for her performance we are willing to excuse such minor blemishes and also sulk for the fact that a jealous Boney K has deprived us of such a performer for such a long time. She plays a underdog lady who has an adoring son but is deprived of respect by her teen daughter and disinterested husband. The English Speaking class scenes remind you about 'Mind your Language' but still have enough ingenuity and pathos to stand out and hold your attention. New York plays the backdrop for a millionth time but then its New York so you really don't mind it!\nBut still this is one film, which focuses on the lead character and the lead actor grabs the limelight and doesn't let go for even a moment in a pitch perfect performance with enough gravitas to drown hundred plastic newbies. The speech in the end in the era of the Video Cassettes would have ensured the tape all messed up in that section due to the repeated rewinds. The soundtrack is almost perfunctory yet appealing and all in all this film is a necklace of multiple moments like pearls and makes you hope desperately that the wait for the next Sridevi Gem shall not be so long. Boney K, I hope you are listening!",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "If you have not known about the story by the title, you would have known all of the story after watching the trailer. So, when the story is all known and the suspense element is already lost how good the screenplay and directions are determines the strength of the movie. If you talk about bringing back the most beautiful actress of Indian cinema (Sri Devi) to make it a huge success, she was not all that glamorous. She even looks bad compare to other stars of her age. But none of this stops English Vinglish from being a great flick. The movie opens to a middle aged woman who is struggling whole day in preparing ladoos and distributing around town. Despite her being a lone fighter in her ladoo business, there does not seem to be any lack of demand for her sweet snack nor the flow of revenue. So why does a Pune based small scale ladoo entrepreneur feel insecure by the lack of her English knowledge? That is very well told in the next few opening scenes. Both her kids and her husband undermine her in the ever increasing English using high class societies of India. But as if adding insult to the injury, she is asked to go to New York alone for the preparations. But then, you don't consider yourself traveling alone when the passenger next to you is Amitabh Bachchan, do you? \nWhen does this ordinary story transform into an extraordinary film? Actually every element of the film are so simple yet so unpredictable. Director Gaurav Shinde has done a tremendous job in capturing the relations of family and friends. How Love can Happen at any age with anyone and how we can move on beyond those flings without hurting anyone. For me this is the greatest Motivational Hindi film I have ever seen in recent years. A close second and third place is between Taare Jameen Pe and Lagaan. Music is good but not all that I can understand. I give four plus stars to any moving (movie) that makes a grown man cry with the right kind of emotional drama.",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "Shashi Godbole and Sridevi walks hand to hand in this movie. After watching the movie, you cannot imagine English Vinglish without Sridevi and Srdievi's comeback wouldn't have been better than this and she stretches herself to the best level she can. Her role is very strong and she enacts it in a brilliant manner. Worth a watch.",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "one the best this year!...each moment is refreshing including one of the finest cameo by Bachchan. . something that will connect with your heart!...don't miss this one!",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "Was an OK flick. Another silly story, with some comedy. Was definitely more about Sri Devi's return!",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "This film restores my confidence in Bollywood ,the storyline is good  but as always it's how told that's  more important and this is one story really well told,loved the basu Chatterjee style directing ,clean funny and unpretentious. Sridevi looks great but it's her acting which is a treat to watch.no raunchy dances no earshattering music so this film isnot a money spinner.\nBut it is the fantastic feel good factor that underlines the whole film well done to director gauri shined billy wood desperately needs more films like this",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "Exceptional and Sridevi nails it ...",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "awsum concept.....must watch with your family......hats off to sridevi for amazing acting.....loved every second of it,,,,,,:)))))))))",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "LOY MACHEDO'S MOVIE REVIEW - English Vinglish (2012)\n\nA Thought-Provoking Family Entertainer with a Fantastic Caste of Gifted Actors, a Great Script and Award Worthy Performances from Sridevi â\" This is one movie I would recommend as a Must Watch of the Year. Writer / Director Guari has done absolute justice to this movie with her double role. Yes, there are bits of the movie that are reminiscent of 'Mind Your Language' but then again, why not add it anyways? And who can forget - Amithab Bachan's Cameo appearance in the movie and yes, his sarcastic joke against the West - Was Funny as Hell.\n\nThe only criticism which I have against the movie is simply this â\" Why such a clichÃ (C) ending typical of what the Indian Audiences would expect and like? Why not something new? Giving an Emotional Decision with a Logical Explanation did not make any sense. And while trying to empower women through this movie, giving women the typical 'family oriented image' even after disrespect, was a safe yet disappointing move.\n\nBut having said that â\" I loved the movie so much, I may actually watch it again. And if anything else, the speech at the end was worth the entire time spend in the theater. I was impressed. Since Sadma, this without a doubt is Srideviâ(TM)s finest and greatest performance ever.\n\nOverall Rating - 9 out of 10",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "Sridevi does an amazing comeback in a story which feels more real than fiction. I like the way the movie ends and the message it leaves you with. Such a believable story, surely these things happen in most homes. Every one portrayed an awesome role. Including the actress who is Sridevi's niece and the Italian character. They have both acted very well. Music is the USP of the movie. Surely one would like to hear those songs and will look for them after the movie. All in all a great entertainer with friends or family.",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "Sridevi is back after a 15 year gap and what a comeback it is! Her character Shashi is a hardworking dutiful housewife and part-time Entrepreneur who finds joy in her work and serving her family with a lot of love but never gets the respect she deserves. Her family finds her lack of English skills a source of entertainment and at times embarrassment. She gets an opportunity to go to NY to help out at her niece's wedding and once there, is constantly handicapped by her lack of language skills and overall cultural differences. After an unpleasant incident due to her poor mastery of English she decides to correct this and joins a 4 week course at learning English.  Joining the class gives her the confidence and validation that was lacking in her life and we are introduced to a bunch of immigrant class mates, trying to learn English, who become an endearing support system for Shashi's journey from a shy housewife to a self assured and articulate Indian woman. It's hard to imagine this is Gauri Shinde's directorial debut as she manages to use Sridevi's natural charisma and comedic chops in a way that would put veteran film makers to shame. You will want to watch it over and over only to look at Sridevi's wonderful performance and an overly charming story brimming with winning characters and a wonderfully progressive outlook. Super-like!",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "Refreshing movie after a long time!",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "Great movie, minute attention to detail, good message.",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "Strongest comeback of an actor/actress ever.",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "If you really want to watch \"Heroine\" n \"Barfi\" then watch Sridevi in this movie... still looks stunning n great acting!!!",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "Surprisingly good movie. Bollywood is starting to impress me again.",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "Wonderful movie!!! Sridevi is fantastic!!!",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "One more wonderful movie of 2012",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "Sridevi is fabulous. Must watch film. A clean entertainer with drama, comedy and sentiment",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "solid positive feedback.. Mast Music tooooo",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "Sri Devi is Fantabulous!",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "A well cast and finely executed movie with a marvellous central performance from Sreedevi and a dashing cameo by Big B!",
            "review_date": "2012-10-04",
            "source": "rt"
        },
        {
            "content": "This is a heartfelt journey of one woman's path to independence and self-discovery. Yet it is not a check flick. It is a film we all can relate to. The acting is superb and the cinematography makes you want to fall in love with New York all over again. Although the film is in very limited release, you should go out of your way to see it.",
            "review_date": "2012-10-04",
            "source": "rt"
        },
        {
            "content": "Fantastic movie, want to see it again :)",
            "review_date": "2012-10-01",
            "source": "rt"
        },
        {
            "content": "India's first female superstar returns with 100 crore blockbuster English Vinglish",
            "review_date": "2012-09-28",
            "source": "rt"
        },
        {
            "content": "Simple straight & just Sridevi !!!",
            "review_date": "2012-09-26",
            "source": "rt"
        },
        {
            "content": "love this movie really good movie to be watching it..",
            "review_date": "2012-09-23",
            "source": "rt"
        },
        {
            "content": "It's a conventional film, but the character of Shashi--an Indian-American mother whose shortcoming it is that her English is poor--really gathers our sympathy and makes us consider how important our moms are in our lives and how easy they seem to make it look at running an entire household without ever getting much credit for it.",
            "review_date": "2012-09-19",
            "source": "rt"
        },
        {
            "content": "English Vinglish is the comeback film of India's megastar actress, Sridevi !!! It will be foolish if one misses the movie on the first day first show !!! Outstanding actress and a great movie appealing worldwide audiences !!!",
            "review_date": "2012-09-18",
            "source": "rt"
        },
        {
            "content": "yes will b super hit.....damn sure",
            "review_date": "2012-09-18",
            "source": "rt"
        },
        {
            "content": "Money, fame and a knowledge of English. In India, these 3 factors play a huge role in how society judges an individual. English Vinglish is the story of a woman who does not know English and is made to feel insecure by her family and society at large. The film is a light -hearted yet touching and transformational journey of Shashi. Circumstances make her determined to overcome this insecurity, master the language, teach the world a lesson on the way to becoming a self assured and confident woman. The film is shot mostly in New York and captures the inherent struggle of many people all over the world with the English Language. Hilarious, touching, sensitive, this film marks the come back of Indiaâ(TM)s biggest female starâ¦Sridevi.",
            "review_date": "2012-09-17",
            "source": "rt"
        },
        {
            "content": "A beautifully crafted feel good movie about personal upliftment and family values.",
            "review_date": "2012-09-17",
            "source": "rt"
        },
        {
            "content": "i really liked this film!! it was so simple and such a feel-good movie, but at the same time it wasn't a cliched happy ending. the ending was surprising yet inevitable - exactly how every film's ending should be. i loved that it was set in new york and i thought it had some very interesting, touching themes, about love, respect, culture and family. i connected with it on several different notes, which is impressive, given that the protagonist wasn't someone i would've associated with readily. the characters were very well-developed, and the script was simple, yet rich and layered. the acting was great - i could really easily put myself in the world of the film and i had a great time watching it - it was great in the sense that it had some laugh out loud moments, as well as some deeper, cathartic moments, and i think every good film has to have a mixture of both to be a great, engaging filmic experience. the only thing that bothered me was that the film was littered with slow-motion moments whenever something \"important\" happened as well as a myriad of montages set to very literal, on the nose music that was clearly made specifically for the film. i just felt like the filmmaker didn't trust the audience's intelligence to discern the feeling of the moment and kind of beat us over the head with the emotional beats. but that's such a minuscule problem and the film had more than enough to make up for it. overall, an excellent watch!",
            "review_date": "2012-09-14",
            "source": "rt"
        },
        {
            "content": "a must watch for all decent cinema lovers..",
            "review_date": "2012-08-19",
            "source": "rt"
        },
        {
            "content": "\"ENGLISH VINGLISH\" was \"EXCELENT VEXELENT\"\n\nSpecial mention here of Sridevi, she allows the director to lead her and doesn't overpower the narrative, with a held back, controlled performance. She could have tried to do a lot more, considering this was 'her' film, after like a zillion years.\n\nThat is where the film hits you. It's real. You can easily identify with it. And is therefore that much more enjoyable.\n\nI don't have stars to dole out. Just hugs for the entire team, because, like many others know, it's not easy to make a good film. That too your first one, and at the same time having the guts to relaunch someone's career after many years.\n\nThe music is soothing.\n\nThe cinematography is top-notch.\n\nThe dialogs are well-worded The screenplay is water-tight.\n\nPerformances: Sridevi rocks as Shashi!I feel that her performance must earn an National Award.If not at least a Film-fare Award.Kudos to her! Amitabh Bachchan,although in a cameo steals the show.The whole theater went berserk when Amitabh Bachchan makes his appearance.His comic timing is superb!He truly rocks! Adil Hussain is efficient.Navika Kotia and Shivansh Kotia as the children,act well.\n\nI am giving it a 4 out of 5, Strongly Recommending! If you miss it,its your loss!",
            "review_date": "2012-06-02",
            "source": "rt"
        }
    ]
}