{
    "rating": 1.0,
    "release_date": "Invalid",
    "num_reviews": 50,
    "genres": [],
    "summary": "",
    "reviews": [
        {
            "content": "I swear every idiot who put up a review for this movie just saw the first film and the title Escape plan and decided to watch this.Its called EXTRACTORS.This was one of the most grounded and realistic action film I've been especially cause of the events that happen from the villains hands so many unexpected things happen that'll literally make you go \"woah wait what\"cause you can see things coming from a mile away these days with pop-corn flicks.Its a dark movie where the hero just doesn't comes in and kicks ass and walks away happy at the end.Just give yourself a break from everything you've already seen and go in with a fresh mind and WATCH IT.",
            "review_date": "2022-09-30",
            "source": "rt"
        },
        {
            "content": "The worst acting, plot and characters I can recall watching in my life. It's tough to match that trifecta of awfulness.",
            "review_date": "2022-08-26",
            "source": "rt"
        },
        {
            "content": "I want a story about escaping from a prison not a story about fxcking china.",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "This isnt escape plan. This is Sylvester Stallone and his team killing people for about half an hour. My suggestion is just to watch the first movie and, if you want to continue, watch the second one. The third one just ruins the whole experience of Escape Plan.",
            "review_date": "2021-11-18",
            "source": "rt"
        },
        {
            "content": "ABSOLUTELY APPALLING.",
            "review_date": "2021-09-26",
            "source": "rt"
        },
        {
            "content": "Does it even deserve a star here? I don't think so! It's so awful. I wonder why they even released this movie. It's a waste of talent and money. It's one obvious rubbish!",
            "review_date": "2021-07-17",
            "source": "rt"
        },
        {
            "content": "Give me a break with the nonsense ratings. Stallone's Escape Plan and Expendables series are some of the most straight up and refreshing action films of 30 years... consistent quality, scripts, acting, and production values.  Beats most movies out there including inconsistent and often terrible Statham and other films.  Get a grip.  Solid.  5 stars... really 4, but give the guy a break and some credit y'all snobs.",
            "review_date": "2021-04-17",
            "source": "rt"
        },
        {
            "content": "Lame movie with real reason why it was even made.",
            "review_date": "2020-06-19",
            "source": "rt"
        },
        {
            "content": "Stallone looks about as tired as this movie.",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "Meh. \nThe franchise got too bloated \nIt passed the time",
            "review_date": "2020-03-06",
            "source": "rt"
        },
        {
            "content": "It's violent and brutal for an action flick but even Stallone can't save this sequel from its thin storyline that fails to entertain.",
            "review_date": "2020-02-14",
            "source": "rt"
        },
        {
            "content": "So much fun! We all need a little toxic masculinity!",
            "review_date": "2020-01-10",
            "source": "rt"
        },
        {
            "content": "rotten to the root, do not waste your time",
            "review_date": "2019-12-08",
            "source": "rt"
        },
        {
            "content": "most problematic: it does not stay with the great premise of its predecessors. it is not an elegant breakout movie but rather rough revenge shit. in this sense, it is more  rambo 6 than ep 3.",
            "review_date": "2019-11-05",
            "source": "rt"
        },
        {
            "content": "Might be conversational, but I did enjoy this film. There I said it. It's 100% better than EP2, and I mean it. Stallone is back being the main focus, Bautista has more to do in this film, he gets some cool fight scenes. I quite liked the action in this film. Yes this is a straight to dvd action movie, and the level for them is average to god awful, this will be right at the top of average. It's a decent enough movie to watch one night when your bored, and you might like it.... and you don't have to worry about watching EP2 as this is more of a sequel to the first film, so can miss EP 2 out completely. So I would say watch it if your bored... its a pretty decent straight to dvd action film. ",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "Its Rambo with a different movie title. cheesy as always but enough action to keep you occupied.",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "Sylvester Stallone takes back the lead role for the third (and likely last) Escape Plan, The Extractors.  This time Ray Breslin must break into a black site prison in Latvia know as Devil's Station in order to save the daughter of a Chinese media mogul who's been kidnapped by the son of Beslin's former partner.  Devon Sawa makes for a great villain, and the whole son avenging the father thing helps to connect the film to the first one and feel like a true sequel (unlike the last one).  Still, the plot is pretty weak and it's clearly pandering to the Chinese audience.  Yet the fight choreography is especially good, perhaps the best of this series, and add a lots of energy and excitement to the film.  Escape Plan: The Extractors is a step up for the series, but is nowhere near as good as the original.",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "These China funded movies just aren't that good. The first Escape Plan was the best. Watching the second and third in this \"series\" dilutes the memory of the first and only good one. ",
            "review_date": "2019-10-16",
            "source": "rt"
        },
        {
            "content": "If you have nothing to do. It will do. ",
            "review_date": "2019-10-07",
            "source": "rt"
        },
        {
            "content": "Big step up from escape plan 2, still doesn't quite match the first one but a worthy sequel if you are looking for some fun action ",
            "review_date": "2019-09-08",
            "source": "rt"
        },
        {
            "content": "At first I thought this was going to be one of those Chinese co-productions where everyone who's Chinese has superpowers, but then I realised that it was actually every man in the movie who has super powers. So, like, equality I guess, so long as you're a man. On that subject, is it just me or does it kind of suck that Jaime King's character gets taken down in the first act because of the romantic relationship she has with a man old enough to be her grandfather?\n\nEither way, what's The Extractors got going on? Well, interestingly enough, the fights in this are actually better than the previous Escape Plan movie, despite that movie being entirely about fighting. I weirdly also kind of bought Devon Sawa (who I guess finally doesn't look like he's 17 anymore) as the villain of the piece. But it does feel distinctly as if it's two movies that got jammed together. Or maybe just one actual movie that had another plot jammed into it to accommodate the mandatory Chinese business concern storyline. Not sure that either one of these is the case, but it wouldn't surprise me if one was. Regardless, it's certainly how it feels. The Extractors has a lot of the problems of its predecessor, but it is ultimately a better movie, if not a very good one. It's a shame, the Escape Plan franchise started out... Well not \"strong\" exactly, but, promising I guess? And has really not lived up to what Schwarzenegger and Stallone could have done with this thing.",
            "review_date": "2019-08-25",
            "source": "rt"
        },
        {
            "content": "I was not sure if I would like it BUT after seeing Stuber/Baustista, I wanted to give Him another chance.  It was AWESOME, I wish I could see the first ones of the Escape series, gotta hunt them down.  Good action, love, commitment good entertainment.. Would see it again, suggest to others.  Rented",
            "review_date": "2019-08-24",
            "source": "rt"
        },
        {
            "content": "The movies sound effects sounded very cheap like the punching and slapping. But that didn't really bother me except for the fact that this movie feels so long and it's only an Hour and 30 minutes. It's very boring. Do not waste your money.",
            "review_date": "2019-08-14",
            "source": "rt"
        },
        {
            "content": "Woah the movie is horrendous and super terrible. The plot is definitely ridiculous, boring and flat. Not to mention acting of the casts looked unconvincing and laughable. The movie series itself have never been performing well so far so why did they bother to bring another one?",
            "review_date": "2019-08-13",
            "source": "rt"
        },
        {
            "content": "Sylvester Stallone has not lost his touch for another action movie, as well as, Russell Wong.  I enjoy watching martial arts, therefore, it is a must see...if that's your thing.",
            "review_date": "2019-08-05",
            "source": "rt"
        },
        {
            "content": "Below my expectation.",
            "review_date": "2019-08-03",
            "source": "rt"
        },
        {
            "content": "It sucked. How u gonna play a movie for an hour and 37 minutes and not even clearly show an ending to it. Just cut off no credits or nothing. Very disappointing movie 😣😣😣",
            "review_date": "2019-07-27",
            "source": "rt"
        },
        {
            "content": "good summer action movie",
            "review_date": "2019-07-27",
            "source": "rt"
        },
        {
            "content": "I generally like Sylvester Stallone action movies but this one had me saying \"what am I watching??\" - at the end of the movie all I knew for sure is that both the antagonist and the protagonist really had father issues - everything else is a blur. 50 cent was even in it but I can only recall one scene where I thought ‘it's 50 cent!'",
            "review_date": "2019-07-22",
            "source": "rt"
        },
        {
            "content": "One of the worst movies I've ever seen. Totally disjointed, the plot was thrown together, the acting was B Movie at best! It had no actual ending or third act climax, it just sort of rolled to credits. It was like they got all these people lined up to act and then gave them each one action scene that wasn't even that good. Bautista getting a beat down from a common thug? Don't think so. Just terrible With none of the magic of the first film...nor any sense it belonged in this series. ",
            "review_date": "2019-07-22",
            "source": "rt"
        },
        {
            "content": "I did not care for the movie overall. While there are some good fight scenes packed within, a lot gets lost in translation (literally) as half the dialogue is in Chinese. No one knows what they are saying, so it loses a lot in trying to figure out the reasoning behind the characters themselves.. Even subtitles would have been better. Really nice weapon used by Bautista though.",
            "review_date": "2019-07-21",
            "source": "rt"
        },
        {
            "content": "So lousy as to be the ugliest movie with Sly. Yet he has already done so many of them at such a terrible level.\n(Mauiro Lanari)",
            "review_date": "2019-07-19",
            "source": "rt"
        },
        {
            "content": "Sly is the living legend action hero and in this movie he brings it all and more to the screen.  It is by far the most gritty and intense film he has done so far.  Directed by award winning John Herzfeld (Only in America).  At every turn the suspense has you on the edge of your seat.  The fight scenes are raw and real.  Sly Stallone hasen't been a huge star for 40 years by accident.  He know what to do and he delivers!  POW!",
            "review_date": "2019-07-18",
            "source": "rt"
        },
        {
            "content": "Hey, you can't go wrong with Stallone and Bautista!  Herzfeld action sequences are FANTASTIC!  I like the fact that he actually hires local actors, law enforcement etc...adds to the quality and authenticity of the scenes.  Hope to see BIGGER budget films by Herzfeld in the near future.  ",
            "review_date": "2019-07-17",
            "source": "rt"
        },
        {
            "content": "Much better than the failed Escape Plan 2: Hades. The performances of Stallone and Bautista are exceptional. With too much violence and revenge, Escape Plan The Extractors would give a good total closure to the successful saga.",
            "review_date": "2019-07-15",
            "source": "rt"
        },
        {
            "content": "Great action packed movie. Much better than the second!",
            "review_date": "2019-07-15",
            "source": "rt"
        },
        {
            "content": "this is not a movie this is a piece of shit\n.",
            "review_date": "2019-07-13",
            "source": "rt"
        },
        {
            "content": "Friggin fantastic. Nice action/story, not like that abominable filth that was the second installment ",
            "review_date": "2019-07-10",
            "source": "rt"
        },
        {
            "content": "This is the best in the series! John Herzfeld brilliantly directs and maneuvers through a great action script. It is so beautifully shot you could hang most of the shots on your wall- the mark of a true artistic director. The coloring and lighting is something to take note of- absolutely powerfully gorgeous. Sly puts in another compelling and powerful performance. He Is hitting it out of the park again! Fantastic collaboration. Let's hope for more from this team!! Watch it! You will thoroughly enjoy it!! ",
            "review_date": "2019-07-10",
            "source": "rt"
        },
        {
            "content": "Saw it today in a local advance screening here in Manila, Philippines. I don't really know if it'll surpass \"Spider-Man: Far from Home\". Or even the re-release of \"The Avengers: Endgame\". Don't let me start with \"Toy Story 4\". Plus the fact that they added a few Chinese actors in the movie and story plot, that kinda feels like adding insult to injury with what was happening here in The Philippines with our president letting Chinese taking over our country, slowly but surely. ",
            "review_date": "2019-07-09",
            "source": "rt"
        },
        {
            "content": "Exactly what you would expect, not a great movie but entertaining nonetheless.  The story is decent and the action will keep you interested if you like action in the form of fights and conflict.",
            "review_date": "2019-07-09",
            "source": "rt"
        },
        {
            "content": "This movie rocked! The fight scenes were on point!",
            "review_date": "2019-07-08",
            "source": "rt"
        },
        {
            "content": "Awesome action. Loved the fights ",
            "review_date": "2019-07-07",
            "source": "rt"
        },
        {
            "content": "It was so disappointing ",
            "review_date": "2019-07-06",
            "source": "rt"
        },
        {
            "content": "Overall, the movie was alright. Decent photography and cinematography, but the story was placid. Common \"rescue mission renegades\" story. Seemed more like The Expendables. Also, all the fight scenes with Sylvester Stallone were awful, like two old guys trying to blow each other. ",
            "review_date": "2019-07-06",
            "source": "rt"
        },
        {
            "content": "Synonymous with the rest of this franchise this film brings easy action entertainment! Excellent martial artist alongside the evergreen duo of Stallone and Bautista who do not disappoint!",
            "review_date": "2019-07-05",
            "source": "rt"
        },
        {
            "content": "I was genuinely suprised after the crash of the 2nd movie i didnt think it was going to be that great, but I was wrong. This movie is filled with great action packed scenes. For being just a dvd movie its very impressive and #3 is quite worth the watch. ",
            "review_date": "2019-07-05",
            "source": "rt"
        },
        {
            "content": "Despite the first 45 minutes of this movie being boring & slow, the second half makes up for it by some really good and unchoreographed fight scenes. It's not perfect, but it is way better than the last movie (Escape Plan 2 Hades). I'll give this movie a 7/10. Good, but not flawless. ",
            "review_date": "2019-07-05",
            "source": "rt"
        },
        {
            "content": "Full of action.  Love the new martial artist.  The story, prison and fight scenes were well done.  It was entertaining.",
            "review_date": "2019-07-04",
            "source": "rt"
        },
        {
            "content": "Escape Plan: The Extractors is a major upgrade over Hades making for a good old time action thriller with some pretty good perfomances, fight sequences and feels much more connected to the original. (8/10)",
            "review_date": "2019-07-04",
            "source": "rt"
        }
    ]
}