{
    "rating": 7.0,
    "release_date": "Invalid",
    "num_reviews": 110,
    "genres": [
        "Action",
        "Mystery&thriller"
    ],
    "summary": "A black-market mercenary who has nothing to lose is hired to rescue the kidnapped son of an imprisoned international crime lord. But in the murky underworld of weapons dealers and drug traffickers, an already deadly mission approaches the impossible.",
    "reviews": [
        {
            "content": "Brutal fun action with heroic characters.  Smart changing of alliances and against all odds stakes. I was impressed that Netflix could actually create this one.",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "Now here is something straight and simple. It's an extraction with John Wick Force!",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "Non stop action with excellent performances by cast led by Chris Hemsworth. The stunts are on par with any of the John Wick movies. I'm very happy to learn of a sequel coming!",
            "review_date": "2023-04-20",
            "source": "rt"
        },
        {
            "content": "Solid action film, it is exactly what you expect. (MILD SPOILER AHEAD) The ending sequence was a bit more surprising than you'd expect from this type of film although in my opinion they slightly ruined it by then leaving it up to the viewers imagination with the final closing image.",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "Focado totalmente em ação, voce não consegue entender com muitos detalhes a história de cada personagem individualmente, voce entende o genérico que é o que é por fora como traumas, e acontecimentos breves do passado.\nPorém as cenas de ação são muito bem feitas",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "It's great movie cause I love action and thrill. And also how he save the boy by himself it's so fantastic.",
            "review_date": "2023-04-11",
            "source": "rt"
        },
        {
            "content": "Extraction is a movie that I wouldn't classify as bad, but it does struggle a bit in finding its own personality I think where this movie really shines is some of the main characters which Chris Hemsworth you definitely come to really enjoyed by the end and there is one particular action sequence that feels like a one shot without a doubt one of the best action sequences in the movie. Most of the other action feels pretty basic not bad, but not distinctive also, like the only movie that has a good guy name, Tyler 🙃 i'll be there for the sequel 5/10",
            "review_date": "2023-04-02",
            "source": "rt"
        },
        {
            "content": "Quite possibly the best action movie ever made. There are long takes spanning from street level to roof top to building jumping to descent to car chase to hand to hand combat to grand theft auto to...you get the idea. Fantastically complex stunt choreography & fantastically entertaining. One of the most fun action movies we've seen. My only criticisms are very small details like being a little bit more realistic with gunshot wounds. It's so hyper realistic in fight sequences that it seemed odd to have the wounds not match. Meaning, if a person gets shot with an assault rifle, if you want them to survive the shot, maybe don't let them get shot in the chest & the neck. It's also not a movie made for plot or character development, so don't come to this movie looking for high art. It's an action movie & it knows that it's an action movie. On those terms, as far as action movies go, Extraction is about as cool as it gets.",
            "review_date": "2023-03-27",
            "source": "rt"
        },
        {
            "content": "I personally think the extraction movie is one of Netflix's best films. It brings a perfect amount of violence to the table and the movie starts off strong and holds itself throughout the film. The action, plot, story, and the characters are amazing. Hope there's a sequel.",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "Stellar performance by Chris Hemsworth with spectacular stunts and a great story",
            "review_date": "2023-02-19",
            "source": "rt"
        },
        {
            "content": "chris really killed this movie highly reccomend",
            "review_date": "2023-02-17",
            "source": "rt"
        },
        {
            "content": "This is a get from point A to point B action movie – it is not groundbreaking or complex. And that's just fine. It's gritty, bloody, and uncomfortable. It aims for realism. There are gun battles and hallway fights through multi-story slums, as well as some impressive car chases through the crowded streets of Bangladesh. Shots are tight, showing the determination and exhaustion of Hemsworth and his enemies. More: https://bit.ly/40QgkXR",
            "review_date": "2023-02-13",
            "source": "rt"
        },
        {
            "content": "Chris Hemsworth is a great actor! This movie was 117 minutes of pure adrenaline rush packed action. Very good script, plot, acting, and storyline. Great cinematography. You'll have a blast.",
            "review_date": "2023-02-05",
            "source": "rt"
        },
        {
            "content": "No character development and unrelatable. Mostly gunfire. Pointless.",
            "review_date": "2023-02-05",
            "source": "rt"
        },
        {
            "content": "Really enjoyed this.  Nice heart to the film especially at the end.  Had echoes of 3 10 to Yuma and 16 Blocks.\n\nAction fights were great, a little gory for me.  Chris was great as well.  Want to see him do more action movies.",
            "review_date": "2023-02-05",
            "source": "rt"
        },
        {
            "content": "Having a big budget and expensive actors, clearly doesn't make a great movie...",
            "review_date": "2023-02-02",
            "source": "rt"
        },
        {
            "content": "False representation of Bangladesh. Cringe dialogues, chris hemsworth proved why he's a bad actor with a MCU franchise.  i hope they don't make another film",
            "review_date": "2023-01-13",
            "source": "rt"
        },
        {
            "content": "The action sequences are masterful. Chris H. is great as usual.",
            "review_date": "2023-01-10",
            "source": "rt"
        },
        {
            "content": "While the story is predictable, it's exciting and fun. The actors obviously trained very hard as to be believable spec ops soldiers, and the over the top action raises the bar for other action films. Would definitely rewatch.",
            "review_date": "2022-12-29",
            "source": "rt"
        },
        {
            "content": "Great action, good acting. If there is a sequel i will watch it again and would want to see the sequel, if not then I probably won’t watch it again. ",
            "review_date": "2022-12-09",
            "source": "rt"
        },
        {
            "content": "We have watched this movie many times. Love the nonstop action!",
            "review_date": "2022-10-26",
            "source": "rt"
        },
        {
            "content": "Entertaining and visually stunning. Worth watching for some cool action scenes and not thinking too much.",
            "review_date": "2022-10-25",
            "source": "rt"
        },
        {
            "content": "Solid action movie, thematically similar to 'Man on Fire'. The action in this movie was *very* well choreographed and enjoyable to watch. Don't let the critics fool you with their biased remarks. They don't like this movie because it revolves around a White hero in a brown country - what they refer to as a \"White savior narrative\". They're just anti-White, and unless you posses a similar bias you'll probably enjoy this movie.",
            "review_date": "2022-10-14",
            "source": "rt"
        },
        {
            "content": "Extremamente divertido",
            "review_date": "2022-10-12",
            "source": "rt"
        },
        {
            "content": "A very good movie to pass the time and be entertained. Chris Hemsworth performance, in my opinion, managed to get rid of the weight of his most emblematic role as \"Thor\" and knew how to reinvent himself in this movie, demonstrating his great gifts and qualities as an actor. The action scenes are really incredible, each chase sequence, shootings and hand-to-hand combat along with the choreography achieves a magnificent immersion. The story of a formidable and ruthless ex-military man with traumas and family problems who deep down keeps goodness, is already widely used. The story fails to be innovative, there are similar themes and stories in other films becoming cliché.",
            "review_date": "2022-10-07",
            "source": "rt"
        },
        {
            "content": "Great action movie and performance by Chris Hemsworth.",
            "review_date": "2022-09-28",
            "source": "rt"
        },
        {
            "content": "One of the best movies of the year in my eyes and the best action movie of 2020 hands down. Chris Hemsworth's performance here doesn't feel as Chris Hemsworthy as his other performances and I love it. The 5 min. long scene with a continues shot made it feel like a grounded halo game. The cliff hanger at the end is great but the only thing it could've done better was pacing and the flashback spoiler of the ending at the beginning.",
            "review_date": "2022-09-23",
            "source": "rt"
        },
        {
            "content": "A pretty badass action film with Chris Hemsworth.",
            "review_date": "2022-09-13",
            "source": "rt"
        },
        {
            "content": "Nice to see Chris Hemsworth without a hammer in his hand.  This is an excellent movie.  Sent to rescue a little boy, the mission goes sideways and Chris has to adjust the plan of rescue when he finds out he has been set up.  Nice fast pace but genuine feelings tossed in successfully.",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "2 years ago-The film comes and goes with intrigue but truly excels in the action sequences with fast past, frenetic, and truly gorgeous fight choreography.",
            "review_date": "2022-08-27",
            "source": "rt"
        },
        {
            "content": "The action was well done, but the story isn't very original.  I would expect more from the Russo brothers than this \"white savior\" movie.",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "É um excelente filme de ação com um bom elenco, tendo potencial para evoluir na provável sequência. Boa atuações de Chris hemsworth, David Harbour (que poderia ter mais tempo de tela) e Golshifteh Farahani. \nA trama é de bom agrado para o que se espera de um filme visto pela ótica de um mercenário.",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "Now, if you're going into this film with the sole purpose of wanting action, then this is the movie. When bullets fly, it's action at it's finest. When the action stops, when it decides to slow down, that is when you realise that the characters have nothing to them. No character whatsoever. The storyline is quite generic, nothing special there. The main character's fearlessness is a good trait that also makes sense within the story and it adds a bit more charm to him. The movie has a beautiful long shot sequence filled with endless action (probably the best bit in the movie). The film is also not afraid to be bold with things that most movies would shy away from. Overall, in my opinion, it is worth a watch with the right mindset.",
            "review_date": "2022-08-07",
            "source": "rt"
        },
        {
            "content": "The action sequences are spectacular, even if the plot isn't particularly intricate or emotionally driving. Don't think too much, and it is a perfectly enjoyable movie.",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "Overall good film with some good action and generally decent performance from Chris hemsworth, not much more I can say",
            "review_date": "2022-06-27",
            "source": "rt"
        },
        {
            "content": "Chris Hemsworth single-handedly decimates the population of Bangladesh by about 15 percent in this film.  He plays a mercenary who's tasked with recovering the teenage son of an incarcerated crime lord from a rival.  The action in this is pretty much non stop and impressively choreographed.  Brutally violent and intense as once he has the kid in his possession, trying to get him out of the city to safety proves incredibly challenging as every cop, criminal and street kid is out to kill them.",
            "review_date": "2022-06-26",
            "source": "rt"
        },
        {
            "content": "Way too much violence and then they kill both the hero and the guy trying to save the kid. There was no need to kill the hero. Depressing and don't recommend! Thumbs down 👎",
            "review_date": "2022-06-19",
            "source": "rt"
        },
        {
            "content": "No apparent sexual minorities and brown people die so I'm sure that will disqualify this movie to the woke audience. But everyone else can enjoy an intense action movie with a decent story",
            "review_date": "2022-05-30",
            "source": "rt"
        },
        {
            "content": "May I interest you in some violence?",
            "review_date": "2022-05-29",
            "source": "rt"
        },
        {
            "content": "A rave of slaughter and blood, driven by the foray of the onset actin. A surprisingly enthusing plot, that leans with the key elemental aspects and resolutions that strengthen the overall delivery.",
            "review_date": "2022-05-12",
            "source": "rt"
        },
        {
            "content": "Considering the fact that people fell in love with Chris Hemsworth due to Thor from the Marvel Cinematic Universe, I've decided to go ahead and see Extraction. I'm a little interested in this considering the fact that it didn't grab my attention. But on the other hand I put it on and I really enjoyed it. We have Tyler Rake played by Chris Hemsworth, who is a mercenary recruited by his handler Nik Khan, to save Ovi from the men who kidnaps him. He kills one of them and takes him to the extraction point. Along the way he comes across Saju who he has to save Ovi himself and the mission is more f**ked when the crime lord orders the police to initiate an immediate lockdown of Dhaka, securing all bridges and travel points out of the city. After seeing this, I just saw the names pop up and recognising the filmmakers like the Russo brothers who produced it along with Chris Hemsworth. You get to hear the Russo brothers directing one of the Marvels films like Captain America: The Winter Soldier, Captain America: Civil War, Avengers: Infinity War and Endgame. It looks like you're watching the same movie but with them but not with Thor because he's playing a different character. There's also an action scene that is so long it is a long shot scene it is absolutely phenomenal. I'd never expect to see a long shot action scene that never stops. It goes on and on and on! This goes on for over 10 minutes. Afterwards Saju had a broken nose and as he was putting it back in place you can hear the crack and see the blood pouring in the sink. Really graphic! So if you're fan of Chris Hemsworth and wanting to see more of him, this is the one that'll peek your interest. Me, I enjoyed it for what it is especially thinking about the Russo brothers doing the MCU flicks. So yeah, more Netflix films coming soon.",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "An effective, quality action thriller with great stunts and camera work.",
            "review_date": "2022-04-21",
            "source": "rt"
        },
        {
            "content": "Heavy on adrenalin filled action from first time director Sam Hargrave, the only real complaint is during the films downtime, it falls flat.",
            "review_date": "2022-04-09",
            "source": "rt"
        },
        {
            "content": "I had a good time. Gunshots and action everywhere, which is expected in a war movie. Great performance by Chris Hemsworth. Clearly he may be more than just the God of Thunder.",
            "review_date": "2022-03-16",
            "source": "rt"
        },
        {
            "content": "I think this was the most intense I've ever seen Hemsworth, and it was great. It also showed each character growing tired and worn as the movie went on, and that was a great element for an action movie as well, since watching the protagonist actually show their humanity both physically and mentally tells a much better story than if they're a superhuman presence that can weather anything.",
            "review_date": "2022-03-06",
            "source": "rt"
        },
        {
            "content": "With a career-best performance by Hemsworth and incredible stunt-work that bests even the likes of John Wick (2014), Extraction is a film worthy of all action fans.",
            "review_date": "2022-03-02",
            "source": "rt"
        },
        {
            "content": "A fun and highly kinetic directorial debut for stuntman Sam Hargrave. Its plot, simple but serviceable, attempts to shoehorn emotional stakes in its later half to unremarkable success. Nevertheless, it won't disappoint those with a taste for fiery choreography and over-the-top action set-pieces.",
            "review_date": "2022-02-01",
            "source": "rt"
        },
        {
            "content": "A very good movie to pass the time and be entertained. Chris Hemsworth performance, in my opinion, managed to get rid of the weight of his most emblematic role as \"Thor\" and knew how to reinvent himself in this movie, demonstrating his great gifts and qualities as an actor. The action scenes are really incredible, each chase sequence, shootings and hand-to-hand combat along with the choreography achieves a magnificent immersion. The story of a formidable and ruthless ex-military man with traumas and family problems who deep down keeps goodness, is already widely used. The story fails to be innovative, there are similar themes and stories in other films becoming cliché.",
            "review_date": "2022-01-26",
            "source": "rt"
        },
        {
            "content": "Another tale of putting a big name celebrity / actor into an average movie. Decent scenes. Very much Ok / 100",
            "review_date": "2022-01-19",
            "source": "rt"
        },
        {
            "content": "Quite rubbish, not really worth watching.",
            "review_date": "2022-01-15",
            "source": "rt"
        },
        {
            "content": "Great storyline. Action packed. Most realistic fight scenes compared to most lately. Not the ending you'd expect.",
            "review_date": "2021-12-30",
            "source": "rt"
        },
        {
            "content": "The hero shoots ten people and the hero doesn't get shot by ten people. Then the hero shoots ten people and ten people shoot stuff right next to the hero. Then the hero shoots ten people and ten more people stand up and get shot by the hero. And then the hero dies but then he doesn't. The End.",
            "review_date": "2021-12-17",
            "source": "rt"
        },
        {
            "content": "Extraction is truly something of an experience for a film. From the immersive cinematography of the city of Dhaka the two main characters constantly sift through, to the unhinged and practical fight sequences we get. \nIt feels like a war movie without the politics.",
            "review_date": "2021-12-08",
            "source": "rt"
        },
        {
            "content": "just good shooting..",
            "review_date": "2021-12-03",
            "source": "rt"
        },
        {
            "content": "It's an interesting movie that keep me glued to my seat\nEven if you are bored of the typical mercenary characters, Chris Hemsworth perform the mercenary Tyler Rake in a great way. Although some of the characters have not a lot of participation during the movie, there are characters that are very interesting.",
            "review_date": "2021-11-26",
            "source": "rt"
        },
        {
            "content": "Generally offers an little bit more of an insight into what goes on in those areas even detailed with the lifestyle, just lacked a bit on the editing and action scene front where as much as people like the brutality, Mr Thor didn't really pull it off. Stone faced hiding behind his beard I don't think he really has much in terms of acting skill especially not for a lead actor but he does demonstrate and so did a few of the other leads that they can entertain us somewhat without us rolling our eyes. All in all, the film was chaotic in itself where it was meant to be but much got in the way of an easier more compelling story.",
            "review_date": "2021-11-14",
            "source": "rt"
        },
        {
            "content": "good when you have noting to see but you need to watch is a really good movie",
            "review_date": "2021-11-10",
            "source": "rt"
        },
        {
            "content": "This movie is not exactly going to win a lot of points with originality but, the action sequences and the committed performance by Chris Hemsworth saves this movie from complete mediocrity.",
            "review_date": "2021-11-08",
            "source": "rt"
        },
        {
            "content": "Okay, but not great.  Sort of what you would expect of another turn of the crank action, thriller these days.",
            "review_date": "2021-11-01",
            "source": "rt"
        },
        {
            "content": "Good story & plot line, completely unexpected ending!",
            "review_date": "2021-10-31",
            "source": "rt"
        },
        {
            "content": "One of the coolest action movies I've ever seen.",
            "review_date": "2021-10-28",
            "source": "rt"
        },
        {
            "content": "Pretty much non stop action. Great camera work.",
            "review_date": "2021-10-18",
            "source": "rt"
        },
        {
            "content": "Movie had no story or plot just action for nothing...",
            "review_date": "2021-10-11",
            "source": "rt"
        },
        {
            "content": "The best Netflix-produced action movie to date.  Very, very fun to watch.",
            "review_date": "2021-09-17",
            "source": "rt"
        },
        {
            "content": "Really good movie and lost of Acton",
            "review_date": "2021-09-08",
            "source": "rt"
        },
        {
            "content": "The movie is good, but are there scenes that border on \"The Fast and the Furious\", like you get hit by a speeding truck and still live? It's practically impossible.",
            "review_date": "2021-09-04",
            "source": "rt"
        },
        {
            "content": "Strong action, decent story, and passable character building. It is far from groundbreaking and you won't be blown away by any twists but it does a great job staying above just becoming a \"dumb fun\" movie.",
            "review_date": "2021-09-03",
            "source": "rt"
        },
        {
            "content": "A overall good gun shot action movie. Some long shots are good level, but the main actor is too Rambo and over realistic.",
            "review_date": "2021-08-12",
            "source": "rt"
        },
        {
            "content": "This is a throw back to the action movies of the 80s.   Kind of like a darker, more brutal version of Commando.   The directing is fantastic with a lot of really beautifully shot fights.   Lots of fun.  Hemsworth is very believable in the role and the rest of the cast is solid.",
            "review_date": "2021-08-09",
            "source": "rt"
        },
        {
            "content": "The characters were uninteresting, as was the plot.\nIt was just an excuse for some action scenes.",
            "review_date": "2021-07-28",
            "source": "rt"
        },
        {
            "content": "Best pure action film I've seen in a long time.",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "If you want Action packed, fighting, shooting, suspense and a beautiful kick-ass female this is the movie to watch. The story was great, the actors were even better. I love action films and this one is one I would watch again.",
            "review_date": "2021-07-19",
            "source": "rt"
        },
        {
            "content": "Loved this movie, non-stop action, solid performances and THAT scene!",
            "review_date": "2021-07-17",
            "source": "rt"
        },
        {
            "content": "Sometimes a masterclass in stuntwork and action direction, sometimes a boring bloodbath. Good thing you can fast forward the latter.",
            "review_date": "2021-06-30",
            "source": "rt"
        },
        {
            "content": "If I didn't see the movie trailer I would have enjoyed this movie more, but like all most Hollywood movie trailers they ruin the experience. This is a very good predictable action movie.",
            "review_date": "2021-06-07",
            "source": "rt"
        },
        {
            "content": "This one keeps stunt people in business: it is non-stop action.  The drama is too soapy.",
            "review_date": "2021-06-04",
            "source": "rt"
        },
        {
            "content": "Great action packed movie, great performance by Hemsworth and his supporting cast. The storyline was fresh and something new.",
            "review_date": "2021-06-03",
            "source": "rt"
        },
        {
            "content": "Extraction - 7.5/10. The Russo brothers produce and write this hard nosed action drama, directed by newcomer Sam Hargrave. A big time Indian don's son is kidnapped to Dhaka Bangladesh. The don must contract a black market mercenary (Chris Hemsworth in a really kinetic role). Extraction feels like a 80s/90s film on steroids, with the action trying to imitate the action intensity of the John Wick series. If it were made during that time, you can clearly see an Arnold Schwarzenegger or Sylvester Stallone type in Hemsworth's role. Its a movie based solely on a simple concept, and loading that concept with grand and explosive action sequences. Hemsworth is great in this film. His career hasn't been as successful as his other Avengers counterparts, but when given the right kind of material, he can shine. The rest of the cast are good in their respective roles as well. Randeep Hooda, whose predominantly a Bollywood actor, is great as the henchman for the don. Rudhraksh Jaiswal, who plays the kidnapped kid, is decent, while Golshifteh Farahani is cool and intense as the mercenary partner to Hemsworth's character. There's a small cameo by David Harbour, which kind of feels a little convenient towards the predicament for the main characters, but other than that the performances are mostly solid. The action set pieces are great, and you can tell they're done with lot of practise and precision. Many of the scenes are filmed and edited to mimic the now popular \"one shot\" feeling, and it works out, giving an almost video game feeling. The movie is super violent, but it deems necessary considering the subject matter. Outside of the kind of cheesy final scene, Extraction is a great action film, and a great Netflix movie! Definitely go stream it!",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "Chris Hemsworth's best movie that isn't a part of the Marvel Cinematic Universe.",
            "review_date": "2021-05-10",
            "source": "rt"
        },
        {
            "content": "Watchable but predictable.",
            "review_date": "2021-05-09",
            "source": "rt"
        },
        {
            "content": "Extraction is probably the most action-packed thriller of the modern day. This movie is full of explosions, guns, explosions and more guns.\n\nI really enjoy watching movies like this as they are, to me, just entertaining. This is the same with Netflix's most watched original movie to date...Extraction. The reason I think that this is so great is because it takes risks, in many scenes, and events in this feature. However, because action movies today are mostly just that, action movies, the plot, and characters are just knocked down to the under-level and it should be easy to see in this film aswell. Before I get to the negative stuff, I would like to appreciate the director (Sam Hardgrave) for his camera work on this movie, of course he had his influences, but good job to him for his hand-held camera work, specifically during the pseudo-one take in the 2nd Act, it was truly impressive how I noticed no cuts or stitches whatsoever.\nFor our main protagonist, Tyler Rake (Played by Chris Hemsworth), that is where we probably get the closest to an understandable protagonist. He is a lonely man, who just wants all the money he can get to provide himself with, he also lost his son to lymphoma at a young age and split up with his wife. When hearing on these events, I did feel somewhat sympathetic towards the character, but that could be just because Chris H is such a likeable and nice guy. The next character that I want to talk about is the victim of the main event in this movie, Ovi Mahajan (Played by Rudhraksh Jaiswal), we do get a small segment into what his life was like, of course with him being the son of the biggest drug lord in India. This section comes very early on and only last us a few minutes, not really giving us much time to relate to him as much as possible, we also never see him directly with his father in a scene so the only insight we get into their relationship is a small statement from Ovi in the later half of Act 2, implying they do not have a happy relationship, we also learn that he usually plays piano when he gets nervous, trying to give us sympathetic feelings for him. Me personally, I would have liked to have known more about the kid's private life, for example: Who was his mother? Where is she? Why is his father in prison? How does he know Saju?\nThere are many side-characters in this movie that I feel, considering the job they have, were taken out of the equation far to easily. The reason they did this, I do understand, they needed those characters to die just to demonstrate visually how Saju (Played by Randeep Hooda) is as skilled fighter just as much as Tyler Rake. There could have been many other ways to do this other than to kill off all our ‘main' protagonists in the space of 2 minutes, for example, Saju could have killed some Dhakan police officers in an interesting way to show this. If this happened then a much more interesting and investing plot could have taken place, meaning our protagonists could have had to band together to get out alive, or maybe they achieve early on at getting the kid out, but something happens to change that.\n\nFor the most part, this movie definitely achieves what it is trying to do with action, so if you just want a reasonably fun and realistic take on a John Wick style movie, then this is definitely for you, despite it's rather barebone plot.",
            "review_date": "2021-05-03",
            "source": "rt"
        },
        {
            "content": "Dull as dish water in terms of story.  Action flick but didn't really care for a run of the mill movie. Sure an endless amount of hard work went into it but it didn't connect with me.",
            "review_date": "2021-05-01",
            "source": "rt"
        },
        {
            "content": "New age action film- the camera and stunt work were excellent. While Hollywood is busy making films to persuade your political opinions, solid filmmakers like these just want to make exciting stories.",
            "review_date": "2021-04-29",
            "source": "rt"
        },
        {
            "content": "The cinematography of this film is really good! The scenes feel like you're part of the film–similar to a first-person shooting game minus the hand holding a gun. But don't get me wrong, not all scenes are like that. You'll see this during fight and chase scenes. I recommend this movie to people who love action films.",
            "review_date": "2021-04-25",
            "source": "rt"
        },
        {
            "content": "Solid! Action! Cinematography on que! Actors on point! Should've lived. Nextflix boss controlled the ending unfortunately.",
            "review_date": "2021-04-12",
            "source": "rt"
        },
        {
            "content": "I'll admit, I didn't finish the movie. I just couldn't continue after about 30 min.",
            "review_date": "2021-04-12",
            "source": "rt"
        },
        {
            "content": "I have to say I absolutely love this movie. Keep me on the edge of my chair.",
            "review_date": "2021-04-12",
            "source": "rt"
        },
        {
            "content": "Just one long endless fight. I want that part of my life back.",
            "review_date": "2021-04-06",
            "source": "rt"
        },
        {
            "content": "It's constantly the same, they enter a city and they get shot.",
            "review_date": "2021-04-02",
            "source": "rt"
        },
        {
            "content": "The action is terrific and the pacing solid, but the screenplay itself (specifically character development) comes secondary to it.",
            "review_date": "2021-03-31",
            "source": "rt"
        },
        {
            "content": "De las películas con mejores escenas de acción que he visto, además de la intrigante historia que tiene esta película y el final fue espectacular ya que lo confunde ha uno. Muy recomendada.",
            "review_date": "2021-03-29",
            "source": "rt"
        },
        {
            "content": "One of the best movies released last year.",
            "review_date": "2021-03-20",
            "source": "rt"
        },
        {
            "content": "Exaggerated violence and excessive shooting. Entertaining but ultimately a waste of time. Exacerbated nonsense.\nZero effort to tell a good story. Empty script that does not require any interpretation from the protagonist.\n\nES: Violencia exagerada y disparos en exceso. Entretenida pero al final es una pérdida de tiempo. Exacerbada sin sentido.\nCero esfuerzo por contar una buena historia. Guion vacío que no exige nada de interpretación al protagonista.",
            "review_date": "2021-03-17",
            "source": "rt"
        },
        {
            "content": "I dont know who is more braindead, the CRITICS, or the moronic audiences that voted this awesome movie into the 60's?  Very well done action movie.  Do not pay attention to these moronic critics!",
            "review_date": "2021-03-17",
            "source": "rt"
        },
        {
            "content": "good action movie it could use a bit more of drama scenaBut if you're looking for a movie action packed this is the movie for you.",
            "review_date": "2021-03-16",
            "source": "rt"
        },
        {
            "content": "As an action movie it excels with truly excellent choreography and cinematography.\n\nSeems to be targeting the feel of \"John Wick\" and will fall short in most ways, but no reason to avoid this if you want to mostly turn off your brain and enjoy the ride.",
            "review_date": "2021-03-13",
            "source": "rt"
        },
        {
            "content": "At first, a couple of the Indian actors' interactions and Chris Hemsworth's sullen cliff-diving, underwater meditation, made me think this film was going to be akin to a 90's action flick: high on action, low on acting. But I am glad to say I misread it.\n\nThere were no true heroes but redemption came for some hardened family men who knew the world was a dark place. Love and empathy prevailed. Not all of the bad guys were inherently evil, though at least two were pure bastards. I look forward to a part 2 with more multiple bad-to-the-bone encounters between fighters and returning characters. Keep the talking to a minimal and focus on the action like this first film did.",
            "review_date": "2021-03-07",
            "source": "rt"
        },
        {
            "content": "Being a big fan of Chris Hemsworth, I think he sold it in the film. The actions were straight to the point and carefully choreographed. Fight scenes and gunfire were epic, but plot and storyline is amature. Overall I give this film a 3 stars, and the ending is kinda interesting. I like'd to think Tyler did not die after all....",
            "review_date": "2021-03-05",
            "source": "rt"
        },
        {
            "content": "What started as a way to pass the time during the Early weeks of the pandemic turned out to be a nail biting, roller coaster ride with Chris Hemsworth.   A very enjoyable, action packed rescue film that will blow you away.   In addition to solid performances and great action, much of the movie is filmed on a single mobile camera which manages to really make the viewer a part of the adventure.",
            "review_date": "2021-03-05",
            "source": "rt"
        },
        {
            "content": "This film is no good for the industry. It is some money thing for netflix. I am really unhappy after read the fact. Here\nhttps://dubdubi.com/extraction-what-left-behind-the-film",
            "review_date": "2021-03-04",
            "source": "rt"
        },
        {
            "content": "Extraction (2020) – The film has pretty good action and looks very nice for the genre. It also has quite appealing characters but lacks a true standout. The plot is quite generic for the most part but is well executed.",
            "review_date": "2021-02-23",
            "source": "rt"
        },
        {
            "content": "As good as the running gun battles and car chases are filmed, with up close and follow along long shots of the action, is how bad the young actor who plays the kidnap victim is.  His facial expressions are completely incongruous with what is happening on screen, his movements clearly show that he was just trying to hit his marks, even his wide-eyed rapid eye movement does not track the action.  Unfortunately, the movie tries to hard at tugging at the heart strings using this young actor, when fails miserably.  If it had just stuck to the action it would have been a far better movie.",
            "review_date": "2021-02-20",
            "source": "rt"
        },
        {
            "content": "Was gripped from beginning to end. The choreography was brilliant, guns sound real, and the story was amazing. Highly recommend watching if you want a movie night, great from beginning to end. 👌🏻",
            "review_date": "2021-02-16",
            "source": "rt"
        },
        {
            "content": "The action is entertaining and mostly well choreographed. As for the drama, the film  is far too compelled to hold your hand, especially through some of the more weightier moments. Sometimes, its the things left unsaid that are the most impactful.",
            "review_date": "2021-02-10",
            "source": "rt"
        },
        {
            "content": "Chris Hemsworth is good in the lead, shooting and slashing his way through the bad guys. But aside from that, the film is rather bland and forgettable",
            "review_date": "2021-02-10",
            "source": "rt"
        },
        {
            "content": "Extraction is an average action flick that has awesome action, good performances, and a totally \"meh\" plot. But hey, this is exactly what Netflix is for and I'm totally okay with that.",
            "review_date": "2021-02-10",
            "source": "rt"
        },
        {
            "content": "It starts out slow then speeds up. The action is like a non stop ride, you just keep going. I'm the end you don't know If Tyler is alive or was imagination. ",
            "review_date": "2021-02-05",
            "source": "rt"
        },
        {
            "content": "Super mega clichê, mas tem umas cenas de ação, bem filmadas e legais, como se fosse com go-pro.",
            "review_date": "2021-02-04",
            "source": "rt"
        },
        {
            "content": "Jesus Murphy! Did one of these guys key Hemsworth's car?! My God... he wasn't playing around. It's a bit of an average mercenary story, but the action... my God the action!",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "I hate Chris Hemsworth",
            "review_date": "2021-02-02",
            "source": "rt"
        }
    ]
}