{
    "rating": 8.2,
    "release_date": "Invalid",
    "num_reviews": 70,
    "genres": [
        "Hindi"
    ],
    "summary": "Street rappers come of age in Mumbai.",
    "reviews": [
        {
            "content": "Although there may be some length pacing issues, the director nevertheless meticulously documented the metamorphosis from Murad to Gully Boy, eventually delivering an uplifting narrative.",
            "review_date": "2022-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film which is very overrated. I appreciate that it goes for showing the lives of poor in India. And the performances work. But unfortunately it's storytelling doesn't connect with me all that much. And the pace is very slow.",
            "review_date": "2022-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartfelt with a refreshing spin on character flaws. The story challenges perceptions of right and wrong.",
            "review_date": "2021-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It broke my heart to see the girl removing her scarf outdoors. I love my religion and I'm proud to be a Muslim, such scenes get me angry.",
            "review_date": "2021-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Acting, Direction and Script writing\nAfter long time watch a worth Bollywood movie. Satisfied for the money spent on the Cenema ticket. Zoya's direction was great in this movie. I was trying to find an error between the line but there wasn't. Movie has taken the suffering of the life, emotion and at the same time make sure that there was a happy moment which people will not fall on boring feelings. Every single rap lyrics were attached with the characters. Movie has taken 4 female characters to show different aspects of an Indian woman. Alia's character was living in typical Muslim family that she has limited social attachment where it made her bit of narrow mided and at the same time she was bit of understanding since she was educated. Otherhand, Sky was the opposite character that lives in different country and culture who understands the practicality and social requirements. Mother of Murad was typical house wife who compromised her happiness for selfish husband and who's struggling by sacrificing herself. Step mother of Murad was again a typical wife who is just second wife of a married man. These characters give an idea that, the way women had been grown will matter for their behaviours and decision makings. We always having a feeling that, rappers means drug addict or drinkers. Director took that tag line literally away. Many occasions shown that he was not alcoholic and it was accepted within the rappers and he wasn't forced at any occasion. Again, dress code- imagination of a rapper is toned pant, three quarters, bigger t shirts, hats and hoods... Murad was winning his first competition with his normal office dress.\n\nMovie was a very detailed movie which have shown many angles of the characters and life structure of a Gully Boy!!! Loved it.",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely stunning! This is a masterpiece. I have watched it N times but every time I watch it, it inspires me. Great work Ranveer, Alia and others. Good job guys! What an inspiring story man, love it",
            "review_date": "2021-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i,ve never been keen on rap so i tried to watch this film with an open mind  and as i have always been fascinated with india i thought i would give it a go. loved it,performaces were excellent, especially ALIA BHATT, who stole every scene she was in...the video they made in the slums of Bombay,GULLY BOY,was superbly shot and incredibly infectious,,,,,,get out of your comfort zone and watch GULLY BOY,,,gary",
            "review_date": "2020-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unless you belong to nepotism, this movie offers you nothing.",
            "review_date": "2020-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gully Boy is a good film. The cast, songs, cinematography, direction was awesome. But the script is the same old rags to rich story. I don't know why It was sent to Oscars. Many south Indian movies like Jallikkettu, Asuran, Kumblanginights etc. were worthy.",
            "review_date": "2020-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally shit.... (...)",
            "review_date": "2020-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gully Boy is not like a normal Bollywood flick but that's not a positive considering how weird and off-putting this film is. There are some positives sprinkled throughout this film but at some points, I'm asking myself was that subplot necessary or why does it have to be this cringe. D+",
            "review_date": "2020-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film which revolves around story of a GULLY BOY who aspires to become a RAP STAR, which was quite an entry for the BOLLYWOOD into the newest genre of hip-hop hitting the Background Score and the Album Hits. Music has undergone changes from Party Songs, EDM, Remixes and Remakes uptil 2019, but Gully Boy has set up the stage for Music Industry in Bollywood. Director of Photography creates magic with precise arial shots over the Mumbai Slums. A lot of stunts in \"Meri Gully Mein\", designed by Bosco-Ceaser were marvelous and jaw dropping. Some of them were so fluent didnt seem real, if it wasent then commends the handling by VFX Team. The movie mostly stands out in its dialogues with all the Tapori Dialogues failing to catch sometimes but keeps you entertained throughout. But with dialogues limited, the film was most about expressions by Ranveer and Alia. The stellar performance by award winners of 2018, winning hearts again this year. The support cast by Kalki, Siddhant, Vijay Raaz, Vijay Verma on pars with the lead of the film. The story seems a lot more predictable, plots unneeded, actions unjustified, and 150 mins long movie. The direction of the movie was great as the movie justified Murad's story with other characters in his circle. The story showed the true feminism with Alia Bhatt's continuation of her studies. The story sewed to show how relationship of Murad stands out with all the people in his cirle of friends, mentor, affair, girlfriend, family with abusive father, etc. The cliffhanger by Zoya Akhtar was the best part in the film yet she discloses the suspense very next second.",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gully Boy directed by Zoya Akhter is an upbeat, excellent find of underdog dreams that has amusing optimism, natural entertainment and surprising authenticity. Not only is it the most audaciously explorative Hindi film of the year, it's the most raw, too. \nFor a film that frequently comments on the life of poverty and the life of the rich, Gully Boy is an instant crowdpleaser which India sorely needs. Director Zoya Akhter uses even the storytelling as a metaphor, which is... unusual for Hindi cinema.",
            "review_date": "2019-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstaning Movie \nGreat Acting By Ranveer Singh",
            "review_date": "2019-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding film !!!!!! realistic... original....great concept!!! Great performances!!!!",
            "review_date": "2019-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent musical score. Excellent trip into the hip-hop era only better!",
            "review_date": "2019-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Movie Spreads Positivity And Motivates Youngsters Who Really Wanna Achieve In Life ! Murad Is The Representative Of All The Youngsters Who Have Talents But Not The Money ! Murad's Rap Partner Is My Favourite Character ! The Murad's Drug Dealing Friend Shows Us An Unique Way Of Writing As We Cant Judge Him ! Every Character Tells Us A Story About Society ! Murad's Mom Speaks Feminism ! His Dad Speaks Male Dominance ! Alia Bhatt Speaks A Love Of Poor And The Loyalty In Love ! The Music Work Was Awesome ! The Camera Work At Its Best ! Especially The One Shot Takes ! The Negative Is They Only Show The Ignorance For Murad But Not The Struggle He Went Through To Win ! So He Wont Be Remembered Longer ! My Opinion Is Gully Boy Can Win Awards But Not Oscar ! There Are Also Other Better Movies From India !",
            "review_date": "2019-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb picturization of aspirations and struggles with honest intentions....breaking-free from social taboos. Pure entertainment without vulgarity. Despite all the usual temptations available, no force -feeding of so-called liberal-communist construct...No victim-card playing and no injections of secular-communal narrative. Characterization, acting, screenplay and direction....all A-Class. Must watch. And, now maybe it will win an Oscar!!! 😉😉",
            "review_date": "2019-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the Best movie in Bollywood so far. It deserves to be in Oscars. Let the world know about Indian cinema. Thanks all this each and every cast for giving this amazing evergreen truly inspiring movie. Love you Gully Boy. Apna time as Gaya. Bahot Hard.",
            "review_date": "2019-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One doesn't have to be a fan of rap to watch and appreciate this brilliant movie with excellent direction and acting. Definitely Ranveer Singh's best till date.",
            "review_date": "2019-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Talented making Zoya Akhtar, fantastic.",
            "review_date": "2019-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mind you this is Cinema not just any Bollywood flick, unprecedented in every sense of the word, i'll even go out on a limb & claim this as the best fuckin Hindi Film out there, if not definitely up there with some classics. ",
            "review_date": "2019-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being a musical drama, at first I had my skepticism. As many films in the past failed to impress me those who belonged to the same genre. But surprisingly that is not the case with this one. Built and crafted around real life circumstances and everyday struggles ; it perfectly found balance between making a fantasy comes true type of story and a portrayal of a real life rapper. Accompanied with a brilliantly done soundtrack that fits so well with the story, it amazes us in every other aspects well. Outstanding performances from every lead actor, well developed characters, and great cinematography made it great altogether! Though in the first portion of the 2nd half slowed down, it catches the rhythm in the end nonetheless. I have a little complaint about the screen time given to Vijay Raj and Sidhant Chaturvedi's characters ; they deserved much more for their characters in my opinion. The emotional touch could have been better with that. Overall a must watch for those people who loves music, especially Rap/Hip-Hop scene in India. And for those people who have passion about anything, this movie will inspire everyone to make their dream true. Everything is possible if you think so. Believe in yourself that's the true moral comes out of it!",
            "review_date": "2019-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story hanging from passion to work is the best amongst the hit of the film. Singh and Zoya sings along.",
            "review_date": "2019-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie, Acting and cast.",
            "review_date": "2019-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyed the movie, the storyline, lyrics, and vibes are unlike anything dished out from Bollywood, was refreshing to watch something so different. The direction is great, casting superb, Ranveer Singh looked and acted like a gully boy, the supporting cast is also great. \n\nPS: It does seem to be an Indianized version of 8 Mile, but having watched that movie over 15 years back It did not matter.",
            "review_date": "2019-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Indian cinema trying the whole spike lee boys in the hood theme is as much a misstep as when it tried the whole superhero genre.",
            "review_date": "2019-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie which inspires and astonishes from the word go - a Zoya Akhtar masterpiece",
            "review_date": "2019-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ranveer Singh is absolutely Bollywood's latest rising star going places and I must say the same for Alia although his role was remarkably bigger in this movie which is a must see!",
            "review_date": "2019-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The underdog's war to achieve his potential formula well presented with a modern twist.",
            "review_date": "2019-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Hindi adaptation of the 8 Mile (2002).",
            "review_date": "2019-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gully Boy is a traditional story of struggle told through the lens of rap.  Ranveer Singh shines as a young man struggling to break through as a rapper while also managing college exams and a challenging home life.  Alia Bhatt breaks through as his unwavering support, showing depth of character in all of her interactions - her character is a real firecracker!  All of the supporting cast come together to make this one of the most compelling Hindi movies of the season.  This was so good I had to see it twice!",
            "review_date": "2019-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow start but I’m glad that I waited to see the movie. I loved it. Great acting, story and ending.",
            "review_date": "2019-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome film. loved it",
            "review_date": "2019-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, it will give a boost to the underground Hip Hop in india",
            "review_date": "2019-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An inspiring movies of a poor struggling hip hop singer from the sums of Mumbai. \nAlso an interesting love story.\nEveryone is talking about the character Shafeena played by Alita Bhat.",
            "review_date": "2019-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. Well acted and directed. Good story. Inspiring at times.",
            "review_date": "2019-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Great Movie... Hats off to Zoya Akhtar for bringing the story of underground rappers to big screen... Everything was so awesome about this movie. Each and every characters big or small was crafted so beautifully... All the songs goes so well with the script...Never a dull moment. Amazing acting by Ranveer singh, Siddhant Chaturvedi, Vijay Verma...Even Alia Bhatt’s characters was built up so nicely and she was able to live upto the expectionnthe character demanded. ",
            "review_date": "2019-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the authenticity of the movie! Connects audience emotions with peoples emotions & their day to day issues.",
            "review_date": "2019-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie and music with talented actors doing justice to their respective roles.",
            "review_date": "2019-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The real Salim Shady stands up! Ranveer Singh proves that when kept under control, he's as good an actor as any leading man in India. Siddhant Chaturvedi is a standout debut and Alia Bhatt picks up yet another notch in the W column. Of course the rapping was always going to make or break this film, and it absolutely delivers. Kudos to Zoya Akhtar. This is the Hindi film to beat so far this year.",
            "review_date": "2019-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was good fun and surprisingly not cliched as I thought it would be. Dialogue writing could be better but the music, the acting and the heart in the whole movie made up for it. They worked hard to stay true to the reality while making it larger than life and that is to be appreciated whole heartedly. Must watch for lovers of rap but even more important for people who do not know rap and the power of it.",
            "review_date": "2019-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing plot, amazing cast and an amazing movie. Must watch!",
            "review_date": "2019-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie , story, acting and rap.",
            "review_date": "2019-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptionally well made, off beat movie with good music, lovely characters, likeable surprises and great acting. The positivity and understated nature add to the lure.",
            "review_date": "2019-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really great film, simple and realistic. I giving 5 stars just because of supporting characters alone made me watch movie 2 times. I mean character like MC Sher and Moeen very well casted and very well written. Alia Bhatt and RAnveer amazing. That one poetry  in film was so in sync with lyrics and scene.",
            "review_date": "2019-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a slow paced movie. The characters are very well played by Alia and Ranveer but  Siddhant steals the show. Over all average movie with lot of songs to increase the length but no story at all. It's an average movie with a one time watch.The only thing about the movie is some meaningful raps that's it. In between the poetic narrations seems like ZNMD. One time watch",
            "review_date": "2019-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gullyboy is a masterpiece. It's raw, real, authentic and energetic. It is engaging, intense and soft at the same time. Despite of the fact that the movie is shot in the most poverty stricken area in Mumbai, the backdrops used throughout the movie are a visual treat. The cinematography has played a huge role in how the movie unfolds on the silver screen. The movie is creatively shot from an angle of different characters and the nooks and corners of the slum to give it an authentic feel and make the audience perceive the world from the pov of the movie characters.\n\nIt's a musical tale told and directed beautifully with such love and passion for each character. The movie is heartwarming and inspirational.\n\nRanveer has done it once again. He makes me fall in love with him again and again with his marvelous performances. He kept reminding me of Kabir.. Sensitive and lovable character he played in Zoya Akhtar's last film 'Dil Dhadakane Do'. But his performance in this movie is something else. He has shined in each and every scene as an underdog trying to fight his destiny and in the process discovering the artist within.\n\nThe character of Murad is so well written, directed and performed that nowhere in the film he is shown to have an air or swagger about himself or of a hero. He is portrayed to be this frustrated and unsure youth who is going through a phase where he is coming to a realization that he wants to do something else and not be a servant like his father and makes a promise to himself that he will change his reality to match his dreams and that's when he writes the lyrics of ''apana time aayega...' not knowing the rap will actually become a hit and lend him a big break.\n\nRanveer gave his 200% to perform the role of Murad. He has acted and expressed the feelings of dismay, anger, frustration and love with his eyes, body language and subtle gestures and nuances. He is a gem and I don't think any other actor could have performed this role better than him.\n\nAlia is superb as Safeena. Loved her character and her love for Murad. Their love story is also beautifully told. The very first scene of the two together is so pleasant and refreshing. Audience laughed and applauded whenever Alia shined on the screen with her witty dialogues. The biggest applaud I heard was when she recited the 'liver transplant' lines. Kudos to Alia for looking and speaking like the character with such ease.\n\nThe movie also has 4 other powerhouse performances. The characters of MC Sher, Moeen and Murad's parents are all very well written, plotted and performed. Kalki's characterization was OK I think.\n\nThe introducing actor Siddhant Chaturvedi who played Murad's guide/mentor/friend gave an impactful performance. He was really good in the raps 'Gully mein' and 'Sher'. Couple of lines he spoke stuck with me. \"Apane andar ka lava fatt ke bahar aan de...\" and \"Tune likha hai to tu suna... Main apane gaane khud likhata hoon\". There is so much depth in these lines.\n\nAll 18 rap tracks are interwoven in the movie so well. Most of them are played as background scores and help move the storyline forward. But the ones that are actually shot as songs are a treat to the eyes and ears. My favorites are 'Doori' 'Meri Gully Mein' 'Sher aaya Sher' 'Azadi' and of course 'Apana time Aayega'. Just loved the build up of 'Apana time Aayega' and the way it is lined up and staged in the movie. The picturization of this song is amazing as we all know but seeing it on the big screen in the context of the story line is just another experience altogether. Ranveer is electrifying in this very happening and moving rap 'Apana time Aayega'.\n\nMy favorite lines from the movie- \"koi dusara mereko batayega main kaun hai...\" and \"main apani reality change karoonga apane sapano se mel khane ke liye..\"\n\nThe movie is loosely based on the life of Mumbai rappers 'Divine' and 'Naezy' and beautifully put together and expressed by the brilliant film director Zoya Akhtar. Loved every bit of it ï¿ 1/2 1/2'-",
            "review_date": "2019-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zoya Akhtar is known for making \"rich people\" films. She shows lives most people may aspire to but may never actually live. With Gully Boy, she makes an attempt to earn some \"street cred\" and takes us to the streets of Bombay, which of course means, Dharavi. What follows is what you would expect from a film about a struggling artist from such a place - shots of the slums and \"gullys\", small homes, people struggling for basic needs, and so on.\n\nIt is not that it is not done well, but it's just that these montages have become so common, one is almost immune to feeling any sort of emotion when one sees them. Still, Zoya really tries to show the contrast between the two Mumbai's from the eyes of Muraad, the soon-to-be Gully Boy and for the most part, succeeds.\n\nMC Sher, Muraad's eventual mentor, roars onto the screen and stays with you after the movie. His screen presence is beyond what you would expect from a newcomer. But Siddhant, the actor playing the part, stands on his own in front of Ranveer's Muraad. Given their age difference (Siddhant is 25 and Ranveer is 33), it was a clever move to have him put on weight while Ranveer lost quite a few pounds.\n\nSome parts of the movie are laugh out loud funny. A witty dialogue (or rap) here, a bottle being broken on someone's head there. Overall, the movie keeps its serious tone without going full dramatic on you.\n\nThe first half drags though and barely has much to write about. The struggles of the family that barely gets by are so overdone that even though they are necessary in a film like this, you don't want to sit through all of it. The good bits are when there is music and rapping going on screen (or in the background).\n\nAlia plays the female lead and provides some more comic relief from time to time. Her equation with Ranveer is delicately handled. The kissing scenes may make parents uncomfortable (if you make the mistake of watching with them) but they don't take away from the story and actually help show how far back their relationship goes in a subtle way. I kept wishing someone else had played the role instead of Alia though.\n\nThe second half is where the real \"hiphop\" begins, with Ranveer finding his voice and footing as a rapper and standing on MC Sher's shoulders to reach higher. It was a good decision having Ranveer voice all the songs he had to perform throughout the movie. However, for normal dialogues, you never quite lose the feeling that it's Ranveer doing an accent.\n\nThe \"Apna Time Aayega\" song gives you goosebumps because by then, you are invested in Muraad's story, even if you are still distant. Him getting to open for a big name artist, standing on a grand stage is a fitting ending too.\n\nUnlike Zoya's other films, Gully Boy is unlikely to be something you watch again and again. Hopefully, the soundtrack will help keep the movie alive in your mind for a bit longer but as time goes by and you lose context, those tracks are going to be deleted from your phone.",
            "review_date": "2019-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Gully Boy' is a crowd pleasing experience that leaves you thinking, dreaming, and pursuing.",
            "review_date": "2019-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alia Bharti is amazing in this movie. Depiction of slum life is so real that it hurts.",
            "review_date": "2019-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gully boy uses a traditional stereotypic storyline of struggle and ambitions and fuses that with an unconventional journey of a rap star from the slums of Mumbai with great effect. The performances by all actors are fantastic and natural especially Ranveer Singh, Siddhant Trivedi, and Alia Bhatt. The direction by Zoya Akhtar, the story and screenplay is original and loosely based on the true love story of Divine and Naezy but the performances give credibility to the plot. The only downside of the film is the length and it is 30 mins too long.",
            "review_date": "2019-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gully Boy Movie Review: Apna Time Aayega!\n\nWhen you leave the movie theater after watching Gully Boy, all that goes through your mind is APNA TIME AAYGA! and rightfully so! The song is very cleverly written and highly addicting. \n\nReview: [Weï¿ 1/2 1/2(TM)ll keep it as spoiler free as possible]\n\nThe Story\n\nGully Boy is a story about a boy called Murad (played brilliantly by Ranveer Singh) in his 20s who while trying to find his identity has to cope with the harsh reality of life around him.  He finds his outlet by expressing himself through writing rhymes and raps in his little notepad. He lives through emotional pain and poverty and once he finds his passion for rap, he decides to make rap his way out of the slums and make a name for himself. \n\nThe story of Gully Boy is loosely inspired by many rappers from the Indian rap scene but mainly DIVINE and NEASY. The story is not a biopic and even though the character in Gully Boy are all fictional, they feel very real and for that all the credits go to the director and the actors. Gully Boy at no time feels like a movie. When watching, you feel for the characters (each one of them). \n\nThe Actors\n\nLetï¿ 1/2 1/2(TM)s start with Ranveer Singh: Weï¿ 1/2 1/2(TM)ve often described Ranveer Singh as an actor of great potential but with tendencies of overacting quite a bit. This is totally not the case in Gully Boy. Ranveer Singh is in his element here. So much so that you totally buy him in his Murad character and donï¿ 1/2 1/2(TM)t see him as Ranveer Singh and for that, our hats off to the star. He has improved himself so much and is truly ruling over Bollywood right now. Another point that needs to be highlighted is the female lead and characters. Alia Bhatt shines in her role as Safeena and is given a full story arc and proper character development. Actually, speaking of character development, each actor and character have been giving the proper story arch and development that one can make a movie on each character and it would work. MC Sher (played by Siddant Chaturvedi) is brilliant and we would not mind if he would get a spin-off movie on his own. \n\nThe Songs\n\nOMG! Again, the songs are amazing. Each song not only comes at the right time but has a strong emotion connection and carries the movie forward. That said, the best song of the movie has to be Apna Time Aayega. By the time it comes on, the song feels earned that it sends a shivering down your spine. Its emotional and it gives a sense of achievement. Youï¿ 1/2 1/2(TM)ve been on a journey with Murad and youï¿ 1/2 1/2(TM)ve witnessed this song being made during the whole movie. \n\nThe Good\n\nEvery single aspect of the movie is good, there are no bad parts of the movie. Even though the movie is 2.5 hours long, it feels like itï¿ 1/2 1/2(TM)s too short. By the end of it, you feel like begging the director to show a little bit more, to let you spend just a few more minutes with Muradï¿ 1/2 1/2 We really hope that Gully Boy gets a sequel and that Zoya Akhtar comes back for it. She really delivers on the directors end and so do the actors on their end. \n\nShould I watch it? \n\nYES YES YES!!!! 5 out of 5 stars *****",
            "review_date": "2019-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could clearly see the 8 Mile theme and even the same lyrics translated in Hindi in battles, not impressed the lyrical acrobats. Even thought the story line is well thought of, given it has Rockstar's ending, still it didn't make the cut for me.",
            "review_date": "2019-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A difficult film to pull off. Zoya Akhtar ranks us one of the best young generation directors with her entire body of work so far. Anything she touches is worth looking into. She is so perceptive and observant. Someone who doesn't know her as a girl from privilege will wonder how she's pulled off a slum film with such detailing. Ranveer Singh is gold standard. Alia Bhatt is luminescent.",
            "review_date": "2019-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8 Mile in Mumbai. Executive producer rapper NAS supported Bollywood director Zoya Akhtar bringing her vision of a slum kid rising through rap battle ranks to find his voice in Gully Boy. This is one of the best films of any kind that I have seen in a while. Lead male, Ranveer Singhâ(TM)s  titular Gully  Boy, Murad, draws us in with his introversion. Lead female, Alia Bhattâ(TM)s Safeena is banging on the walls of Muslim tradition, in a story that Americans do not see every day, but we all know. Safeena sneeks around and hides her affection for Murad from her traditional parents. There are a raft of great supporting performances, none more so that Muradâ(TM)s street associate Moeen played by Vijay Varma. A rap film has to have that buddy / dealer / hustler who will ends up on the wrong side of bars or the ground, yet who at some critical moment will bring a light of wisdom to goings on.\n \nThe arc of the story has no surprises, but the magic lies in the telling of the story. Akhtar introduces us to Murad and Safeena on a city bus in a visually comfortable dance with no words. I have seen a lot of slick Bollywood productions, and this is somehow better. The claustrophobia and well-worn grime of the Mumbai slums is a vital character here. The camera glides and circles the characters, catching every important nuance so perfectly there are nearly no flaws to find. At one point some westerners on tour of slums, pay to peek in real peopleâ(TM)s homes, gawking at how tiny shacks and shanties can accommodate so many people, out loud, with the residents right there! While I have always found the Bollywood insistence of musical dance numbers a bit awkward, Gully Boyâ(TM)s inserts of them in the context of rap videos seems the most natural I have ever seen. It almost caught me by surprise to realize; oh this is the obligatory dance number. If I have a knit to pick, Singh at 32 is a bit old to be playing the 21 year old of the story. But if the character were older, I would call this casting flawless. The post intermission film is also a little short of the magic of the incredibly amazing 1st half. If Indian tradition permitted, a shorter more edited story would have been even better. \n\nWhat can I say, Story: good, Acting: great, Cinematography: great, Music: great, Directing: Freaking Great!",
            "review_date": "2019-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story, well directed, fine acting - it's a success recipe. There is emphasis on character development. The story flows and builds up well. Ends are tied together well. Overall, loved the movie. Music is AWESOME!",
            "review_date": "2019-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zoya Akhtar does it again...the apple did not fall far from her artistic tree. Ranveer Singh, the audience will look at this work of art on 20 years and laud you for your dedication and talent in telling Dharavi's story. Who said Mega Stars are a dying breed. YOU keep the legend alive!",
            "review_date": "2019-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best acting of ranveer singh totally looks like reality",
            "review_date": "2019-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie worth a watch for rappers in Indian ways lols. 4 and a half stars must watch for great performance for Alia Bhatt and Ranveer Singh. ",
            "review_date": "2019-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movies ever good music",
            "review_date": "2019-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh My God. What a fantastic movie this was. Out-stand-ing!!!",
            "review_date": "2019-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Gully Boy\" is a fully fresh and modern story that Bollywood should be proud to claim. This movie was consistently entertaining and a captivating character piece that is also very entertaining. The movie covers a lot of ground when it comes to social issues, and it feels like it covers just a bit too much. If it focused up a bit more on its central theme and was a tad bit shorter, it could have been a nearly flawless movie. Nonetheless, I appreciated all of the bold statements the movie presented. The lead performance from Ranveer Singh is outstanding and his flawed yet likable character is one I was able to root for from the getgo. Bollywood movies frequently include memorable soundtracks but in this movie, the music really stands out. The lyrics go well with the movie's storyline and every rap sequence was like a shot of adrenaline. I thought it was fascinating to see what the hip-hop scene in India is like and the soundtrack is clearly well thought out. This movie carries lots of emotional weight, showcases strong characters, and is entertaining pretty much all the way through. It has set the bar high for Bollywood in 2019.",
            "review_date": "2019-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Hindi film I've seen in a while. Go watch it!",
            "review_date": "2019-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must watch movie.\nRanvir Singh is now the new super star by the taste of his movie selection",
            "review_date": "2019-02-14",
            "source": "rt",
            "lang": "en"
        }
    ]
}