{
    "rating": 8.4,
    "release_date": "Invalid",
    "num_reviews": 170,
    "genres": [
        "Drama"
    ],
    "summary": "A college professor (Richard Gere) forms a lasting bond with a dog that he finds on a train platform.",
    "reviews": [
        {
            "content": "To allow a dog to live rough, with no constant caregiver, is appalling to me.  This was written as if the dog made this choice.  All pets may have to change owners, but it doesn't mean that you think it's wonderful emotional connection with only one human.",
            "review_date": "2023-03-25",
            "source": "rt"
        },
        {
            "content": "Worth the watch. Stock up on tissues 😢",
            "review_date": "2023-03-16",
            "source": "rt"
        },
        {
            "content": "Loved the dog and the basic story. The story could have made its point in a short—very slow-moving. ",
            "review_date": "2023-02-17",
            "source": "rt"
        },
        {
            "content": "I love this movie and I cry on it every time I watch it... It only shows us that we don't truly deserve dogs.",
            "review_date": "2023-01-29",
            "source": "rt"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (8.5/10) ; Cinematography (8.5/10) ; Plot (8.5/10) ; Acting (7.5/10) ; Pacing (8/10) = 82%}\"",
            "review_date": "2023-01-14",
            "source": "rt"
        },
        {
            "content": "Very emotionally sad true story showing the loyalty and unconditionally love from a dog  that expresses admiration for dogs; you are their everything.",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "I don't how this movie is rated 84%!?!?  It was painfully boring!  Absolutely nothing happens for 3/4 of the movie and then it depresses you for the last 1/4. Jason Alexander what I'd he even there for?",
            "review_date": "2022-12-31",
            "source": "rt"
        },
        {
            "content": "This is such a great movie and very emotional.  I cried towards the end and couldn't stop crying.  A definite must watch.",
            "review_date": "2022-12-12",
            "source": "rt"
        },
        {
            "content": "This is a really sweet story about loyalty. Richard Gere and Joan Allen are great actors but the best actors in this movie are the three dogs who play Hachi, particularly Hachi as a puppy. Lots of tears to be shed but this one does not disappoint.",
            "review_date": "2022-12-03",
            "source": "rt"
        },
        {
            "content": "We started with a simple hello and ended with a complicated goodbye \nThe first half of the Hachi movie is happy to watch but the second half of the Hachi movie is sad which made me emotional at times. What a loyal, loving and devoted dog Hachi was to his owner. After the death of Hachi owner, the family should have tried harder to build a relationship with Hachi to get his love and devotion. The wife of the owner supposedly went back to Subuya station 10 years later and saw Hachi sitting there looking old and still waiting. She could have taken Hachi with her when she left Subuya station to be with Hachi for the remaining days of Hachi life. But instead, she left Hachi at Subuya station and was not concerned what would happen to Hachi. I feel her actions were very selfish and uncaring. Hachi deserved to be loved again, even if it would be for a short period of time because of the love and loyalty Hachi had for his owner. The family should have taken Hachi to the funeral service and let Hachi smell a piece of clothing and shown a photograph of his owner for possible closure for Hachi that his owner died. What I find sad as a human being is from 1925 to 1932, people at Subuya train station mistreated Hachi. It wasn't until the story of Hachi was published in the newspaper that people started to care, provide food, and give attention to Hachi. During those 7 years this could have been when Hachi became sick with cancer and worms and his condition got worse over those 7 years. There was no one really close to Hachi during those years to see or be concerned about Hachi health. Regardless, Hachi would still walk to the Subuya station each day and wait in all types of weather conditions for his deceased owner even when Hachi was getting old. I could not imagine how much pain and loneliness Hachi may have felt after his owner died. I'm so glad Hachi was honoured with a statue of him, him and his owner together. If I could go back to the time period of Hachi from 1925 to 1935, I would have given Hachi a lot of affection, provided food, companionship and a permanent home. Hachi always be remembered over the world for the loving and loyal dog he was. Rest in peace Hachi. WHAt A DOG\n\nSHOULD HAVE.",
            "review_date": "2022-11-11",
            "source": "rt"
        },
        {
            "content": "Wow!! This was really good. Honestly can't remember the last time that I cried during a movie as much as I did with this one. It's just really beautiful, and it's worth a watch. Grab yourself a box of tissues before you start it up though. You are going to need them.",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "This is a good, cute, easy watch. Having watched the whole film, I feel there are some plot holes but its certainly a nice story, a respectable one and I loved that its based on a true story. I was surprised to see richard Gere in it but he does come across as being very much infatuated with the dog. I enjoyed the nice pieces of music played in the background and I would thoroughly recommend this family friendly film, to any and all dog fans.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "I'm watching the IMDb top 250 films. It's not so much that I'm surprised this film made it onto the list, I can understand that if it is a giant wind up . What I'm surprised at is that this film was ever made. Nothing happens. In Japan there was a Dr who bought a dog, died two years later and for the next nine years his dog would go to a train station and wait for him to come home. That's it. That's the story. There's no material for a film. It's a passing anecdote you forget five minutes later. You don't make an hour and a half film that could be covered in twenty seconds. The piano score is meant to render emotion but it's just ridiculous. Absolute waste of time and pointless. Do yourself a favour and never even contemplate watching this. Absurd.",
            "review_date": "2022-08-18",
            "source": "rt"
        },
        {
            "content": "Thank you! I needed that wake-up call. It makes you look at things so differently. It is very emotional, and if you get emotional, regardless if you are a man or a woman, good for you!\nThis movie changed me forever!",
            "review_date": "2022-08-10",
            "source": "rt"
        },
        {
            "content": "This movie made me cry. It's an emotional one, and based on a true story, so keep those tissues ready.",
            "review_date": "2022-06-09",
            "source": "rt"
        },
        {
            "content": "I love real stories but this was surprisingly boring! So repetitive that I wanted to chew my arm off. I kept thinking, with such a cast there must be something more....but there was nothing. And then the biggest insult was that the real story was about a Japanese man and dog! They stole the story just to make it apeal to Americans.",
            "review_date": "2022-05-23",
            "source": "rt"
        },
        {
            "content": "the best film of its kind ever made",
            "review_date": "2022-03-15",
            "source": "rt"
        },
        {
            "content": "Best movie. Can't stop crying",
            "review_date": "2021-11-16",
            "source": "rt"
        },
        {
            "content": "A simple story with touching moments. A story happens at your neighborhood.",
            "review_date": "2021-11-07",
            "source": "rt"
        },
        {
            "content": "Kinda boring, but it sure hit me in the feels, as only a dog movie can.",
            "review_date": "2021-09-28",
            "source": "rt"
        },
        {
            "content": "Although an Americanized version of the true tale of Hachi, this truly portrayed the story of a dog who waited for his beloved owner. They did a good job of showing how if you give love to an animal, you will be loved in return, but they do not understand such things as when a human leaves and does not come back.",
            "review_date": "2021-09-27",
            "source": "rt"
        },
        {
            "content": "It was amazing I loved it with all my heart I always cried at the end when hachi died at the end ",
            "review_date": "2021-08-02",
            "source": "rt"
        },
        {
            "content": "Heartbreaking film based on a true story about a dog who faithfully waits his owners return. Loved watching this film with the family.",
            "review_date": "2021-07-31",
            "source": "rt"
        },
        {
            "content": "Absolutely beautiful movie about the everlasting friendship between a dog and his owner. This touching movie shows the incredible bond that humans and animals can have, as well as the loyalty that dogs have for their owners. The actors do an excellent job of telling this amazing true story, and the dog who plays Hachi leaves the audience with a remarkable message of true friendship, loyalty, companionship, and love.",
            "review_date": "2021-06-26",
            "source": "rt"
        },
        {
            "content": "I just lost my son, so needless to say, this story had me beyond emotional. Such a touching story of love and loyalty. Well acted and great pace.",
            "review_date": "2021-05-30",
            "source": "rt"
        },
        {
            "content": "A movie about a dog, with some humans thrown in for good measure. A well-crafted movie from story to photography to music. Worth the time; bring popcorn and a handkerchief.",
            "review_date": "2021-05-27",
            "source": "rt"
        },
        {
            "content": "This is the kind of movie I turn on because I can't think of anything better to do . It turned out be very enjoyable to watch.",
            "review_date": "2021-05-16",
            "source": "rt"
        },
        {
            "content": "Such a good movie .\nSo sad ... Such a loyal dog",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "This is simple mind numbing mush but I suppose if you love dogs and forced \"awwww\" moments this will be for you.",
            "review_date": "2021-05-10",
            "source": "rt"
        },
        {
            "content": "Not as good as many people make it seem, but it's still a great story.",
            "review_date": "2021-05-09",
            "source": "rt"
        },
        {
            "content": "I have never had my own pet but I have seen how affectionate dogs can be through the pets of various people I know. I think it's irrelevant when watching \"Hachi: A Dog's Tale\" because it is a universal story of friendship and loyalty. This is an emotional movie that took its toll on me, but it was certainly worth watching. The movie does have some tropes that are familiar in this sort of heartfelt dog movie, but I still didn't mind them that much because I genuinely got invested in the characters. I probably would have called the movie unrealistic had it not been based on an actual story, which just blows my mind. Overall, I think it is a profound story that celebrates empathy, kindness, loyalty, and friendship and is likely to touch even the toughest movie watchers.",
            "review_date": "2021-05-08",
            "source": "rt"
        },
        {
            "content": "Now this is why people love their dogs more than they do their fellow humans.",
            "review_date": "2021-05-07",
            "source": "rt"
        },
        {
            "content": "If you need a good cry, this is it ",
            "review_date": "2021-05-05",
            "source": "rt"
        },
        {
            "content": "Loyalty and love succinctly sums up the film. The love so simple, so pure and the loyalty so unfailing, so steadfast that it would melt any steel heart. A movie based on a true story, really moved me.\nFamily film, thank you no nudity no sex. No need to fast forward.",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "I saw the movie twice but I cannot see it again, its too sad",
            "review_date": "2020-12-08",
            "source": "rt"
        },
        {
            "content": "The movie tells the story of a university professor Parker who picked up an Akita dog and named it ‘Hachi'. As Hachi grew bigger, he sent the professor to the station in the morning and waited for the professor to go home with him in the evening. But unfortunate things happened. On that special day, the professor passed away due to myocardial infarction. Hachi did not wait for the professor. What is even more sad is that Hachi waited at the station every day for the next nine years until the professor came back until he died. Hachi, this is a name registered by love. It means extending to the sky and then landing on the earth.\n    Flashbacks, slow motions, long shots, the natural pursuit of depth-of-field shots, all the usual methods used in warm films are included in this movie. The storyline is simple and ordinary, the plot with obvious ups and downs is not the style of this movie, it seems like Listen to a story. The friends and family around me have seen this movie. It's not that I don't want to watch it, I dare not watch it, because I know I can't stop the tears when I watch it. It reminds me of my first dog—Diandian, she is a Chihuahua. The pointed ears, brownish-yellow and white hairs blend well on her. On March 7th, 2017, she left us...but fortunately, she had no illnesses in her life, just because she was old. But every time we think of her leaving, our family will feel sad. Although the story of Diandian is different from Hachi, every time I see a movie about dogs, I think of the days when Diandian is still there. I will never forget her, no matter how long it has passed.\nA scene in the movie impressed me:\nParker and his friend Ken discussed why Hachi didn't pick up the ball.\nParker complained to Ken that Hachi did not want to pick up the ball.\nKen asked Parker: \"Why does the dog pick you up the ball?\"\nParker was a little dazed, and said some reasons indiscriminately, for the cookies, for the fun, to make him happy.\nKen said: \"Akita dog does not like to please humans, except for some special reasons, he will not pick up the ball.\"\nEveryone who has seen this scene said that Hachi foresaw Parker's death. Perhaps this understanding is correct, but I have a different opinion. Looking at it in connection with the previous shots, Hachi is actually just lonely, eager for the company of his master, and doesn't want the master to leave. Human beings have their own family, career, and ideals. For Parker, he needs to go to work, he needs to accompany his family, Hachi is just a small episode in his life, a small corner in his heart. But for Hachi, Parker is its world. \nGood morning, Hachi. Good night, Hachi.",
            "review_date": "2020-10-18",
            "source": "rt"
        },
        {
            "content": "A sentimental and entreteined story, but it is not a really good film.",
            "review_date": "2020-09-23",
            "source": "rt"
        },
        {
            "content": "The most emotional movie we’ve ever seen. Top notch acting and screenplay. You will never forget this movie. Very well done and based on a true story.",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "This Movie is pure heart and soul! No other Movie has touched me as much as this, be sure to take tissues. I hardly cry during a movie but this movie is exceptional and I will not forget this one.",
            "review_date": "2020-09-04",
            "source": "rt"
        },
        {
            "content": "I'm a dog person and love my dog as if she were my child. This film was made to manipulate me, but it's only ok. It's a very predictable story and would have been a better short than feature length because all the noise beyond the main relationship of man and dog is annoying and poorly done. As a dog person I was actually quite upset that everyone pitied and admired Hachi, but no one really provided for him beyond a bite of a hot dog?  Why did the hot dog or train station guy take him home every night and then back the next day? They said they'd care for him but did they even give him a bath or take him to a vet? This was distracting. It just proves that dogs are better than humans.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "Ths movies starts with an Akita puppy breaking lose from his cage when he was being delivered to an address. A music professor takes the dog home and unwittingly changes both their lives.This lovely family drama inspired by a famous true-life case of canine devotion. Richard Gere might not be the first actor you'd cast in a slushy animal saga but he's actually just right for the role, as director Lasse Hallström is determined not to milk the story for cheap sentiment. After a slightly wobbly prologue illustrating Hachi's unlikely journey from rural Japan to commuter-belt America, the film takes its time in showing how this four-legged Akita puppy becomes an essential part of the household of Gere and his skeptical spouse Joan Allen.The following part of the film describes some very lovely,naughty and some sad moments which involve the dog coming to station every day waiting for his deceased owner to arrive and go to their home while playing with him.But the film certainly is affecting, especially when we learn of its inspiration in Tokyo and the exploits of the real Hachiko. The Dog who portrays the affection,love,loyalty towards his master.",
            "review_date": "2020-08-03",
            "source": "rt"
        },
        {
            "content": "My favorite movie. I can watch it over and over again.",
            "review_date": "2020-07-25",
            "source": "rt"
        },
        {
            "content": "Great family movie about the friendship & loyalty of a dog.",
            "review_date": "2020-07-22",
            "source": "rt"
        },
        {
            "content": "Cried like hell.\nOne of the best movies about a dog's love for his best friend.",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "One day there was a movie on TV called «HACHI: A DOG'S TALE», it was a drama, which I was watching for an hour and a half without taking my eyes off the screen.\nThis is one of those films that, having watched only once, remain in memory for a long time. The film is so touching, heartbreaking, realistic, believable and tearjerker that it is impossible to watch a devoted dog waiting for its owner without tears. The film is very thought-provoking, because Hachiko is not just a dog that was waiting for its owner, it is an example of loyalty, love, understanding, care and compassion, feelings that have become rare in our life.\nIt is necessary to note the amazing performance of the film's actors, especially Richard Gere, who played the main character -  Professor. He accurately managed to convey the touching feelings of communication with the dog. I think none filmgoers will remain indifferent to this story!",
            "review_date": "2020-05-19",
            "source": "rt"
        },
        {
            "content": "Be warned--if you like dog stories, this is a 3 hanky movie.But this lovely little film is worth watching if you believe in the incredible power of the  love and devotion a dog can have for a human.",
            "review_date": "2020-05-11",
            "source": "rt"
        },
        {
            "content": "Great movie for dog lovers? Maybe, but thats definitely not what makes this movie great, despite what the high rated critics are saying.\nIts an added bonus for dog lovers,  but the movie depicts psychological aspect about loss and mourning of a loved one, being stuck at a grief stage, you basically could take out the dog and substitute it with a little girl who her father left to war/journey/anywhere honestly, and never came back, but she still remembers the last she saw of him and the promise he made to come back. \nOr a son that left to work/study abroad, leaving leaving family behind, and one of them so close to his heart dies, that he never fully recovers until he himself fades away.\nIts a very emotional movie, and i personally don't have a dog, yet this brought tears to my eyes.",
            "review_date": "2020-05-07",
            "source": "rt"
        },
        {
            "content": "I'm shocked at the critics rating. 64%? That's it? This was one of the best movies centered around a dog ever. Film lovers should see this. And if you own/have owned a dog (or just love animals), bring tissues. I cried my eyes out.",
            "review_date": "2020-04-01",
            "source": "rt"
        },
        {
            "content": "This film is based on a true story about a teacher who finds an abandoned dog and they get to be best friends.\nIt is impressive how the dog obeys its owner.\nI don't recommend this film to people who cry very easily. But the film is fantastic.",
            "review_date": "2020-03-12",
            "source": "rt"
        },
        {
            "content": "Surprised to see 64% .\nIt is one of the best (dog) movies I have ever seen.",
            "review_date": "2020-02-26",
            "source": "rt"
        },
        {
            "content": "You don't forget this one.",
            "review_date": "2020-02-22",
            "source": "rt"
        },
        {
            "content": "This movie is probably one of the best movies I have ever seen. It shows true unconditional love and dedication of a dog. Beautiful and emotional, I was crying half of the movie. True masterpiece.",
            "review_date": "2020-02-01",
            "source": "rt"
        },
        {
            "content": "If you have a dog and or love animals this will get you even if you think you are strong",
            "review_date": "2019-12-10",
            "source": "rt"
        },
        {
            "content": "great heart touching movie.",
            "review_date": "2019-12-09",
            "source": "rt"
        },
        {
            "content": "I can safely say that any dog lover will cry, at this true story of a dogs devotion to its person, the perfect combination of a man and his dog, and the life of both characters.",
            "review_date": "2019-11-19",
            "source": "rt"
        },
        {
            "content": "horrible. a tale of abuse and neglect. the human family abandon the dog.",
            "review_date": "2019-10-12",
            "source": "rt"
        },
        {
            "content": "One of the most poignant and heartbreaking films I've ever seen (this was the rare movie that nearly drove me to tears and I'm a cat person), Hachi: A Dog's Tale has a fantastic performance from the dog playing the titular character and the human actors aren't half-bad either. Bring tissues and paper towels.",
            "review_date": "2019-08-03",
            "source": "rt"
        },
        {
            "content": "A nice tale of dogs' love and loyalty",
            "review_date": "2019-06-17",
            "source": "rt"
        },
        {
            "content": "It gets better each time you watch it. Based on a true story!!!",
            "review_date": "2019-05-20",
            "source": "rt"
        },
        {
            "content": "No spoilers here. Very heart warming story but probably more so for dog lovers than others.",
            "review_date": "2019-03-31",
            "source": "rt"
        },
        {
            "content": "What have you done to my heart",
            "review_date": "2019-01-25",
            "source": "rt"
        },
        {
            "content": "Of all the empowering true stories that this film could have chosen, it had to pick the one that would rely too much on the cutesy aspect and not enough on the engaging story aspect.",
            "review_date": "2019-01-18",
            "source": "rt"
        },
        {
            "content": "Very emotional, heart wrenching movie! Love this film, it's absolutely wonderful",
            "review_date": "2019-01-05",
            "source": "rt"
        },
        {
            "content": "Really good film, and so so sad.",
            "review_date": "2018-12-29",
            "source": "rt"
        },
        {
            "content": "Dont watch this if you are not prepared to cry.A real tearjerker..A touching true story about a friendship between a dog and his master.Always makes me cry.",
            "review_date": "2018-12-26",
            "source": "rt"
        },
        {
            "content": "Hachi : A Dogâ(TM)s Tale \nLasse Hallstromâ(TM)s sappy mutt tale Hachi : A Dogâ(TM)s Tale is based on a true story about a faithful Akita dog called Hachi. Hallstrom transformed the 1930s Japanese true story into a contemporary New England film that easily fulfills that soft spot in your heart. HallstrÃ¶mâ(TM)s effective film uses several visual techniques â\" dogâ(TM)s eye-view black-and-white footage, sped-up time frames â\" to tell the moving tale of great love and respect between college professor Parker Wilson (Richard Gere) and the puppy he rescues on a snowy night. This is a very simple and easy film that quickly engages the audience as it introduces a loyal dog, a man with a loving heart, and a happy yet sappy setting. The relationship of Hachi and Parker intensifies emotions that will surely pull at your heartstrings, which carries throughout the whole film all the way to its bittersweet conclusion. Hachi : A Dogâ(TM)s Tale is sensitively directed and over-sentimental,  and will likely ravish the emotions of dog lovers. Yet the film is as much about the emotional fallout of the death of Parker Wilson as about a muttâ(TM)s unconditional love, loyalty and devotion. You might resent being emotionally manipulated by this film, but I challenge even the most hard-hearted moviegoer not to spill some saltwater while watching it. As a dog owner, I must confess to having had a large lump in the throat and a constant smile throughout. Hachi: A Dogâ(TM)s Tale is a great, big lick to the face, and a welcomed one at that.",
            "review_date": "2018-12-03",
            "source": "rt"
        },
        {
            "content": "The relation between an animal and human is one of the best thing in the world. Animals are to much attracted and loyal to their owners, while human after sometime forget about their Loved ones, animals never forget their Loved one. They even be loyal and love them after death.\n\nThis movie is such a great example, every person should treat their pet nicely and care them, the pet will always be loyal even after death.\n\nJust Loved this movie ??",
            "review_date": "2018-09-14",
            "source": "rt"
        },
        {
            "content": "Hachi: A Dog's Story\n\n\"A dog's loyalty never ends\"\nThe movie I'm going to review today is called Hachi, this movie was directed by Lasse Hallström. It is a drama/familiar movie that takes place in Japan. \n\nTha actors and actresses we can see in the movie are Richard Gere as Parker Wilson, Joan Allen as Cate Wilson, Cary-Hiroyuki Tagawa as Ken and Sarah Roemer as Andy Wilson. All of these actors and actresses are well known and have won at least one award. I think that they all were good at their performance because that made everyone feel the movie.\n\nSo the movie is about a dog and his owner.Everyday the dog went to the train station with his owner and waited for him till he came back. But one day his owner died and the dog didn't know about it so he kept waiting for his owner to come back until one day he died too. I think this is a really good story because it is full of drama and sensitive moments.\n\nThe emotional effect that this movie causes is really huge, because it could be remembered as a very sentimental movie that causes many feelings on the spectators. \n\nIn my opinion this is a really good movie, It has received really good critics from the public for example, an 8,1 out of 10 in IMDb and 63% on Rotten Tomatoes. Personally I will give this movie an 8,5 out of 10. I think that this movie made people very happy because it had the results that everyone expected. I think people should see this movie because it has a really good quality and also it has a really beautiful message. In conclusion people should see this movie because it is really good in graphics and actors but it also leaves a beautiful message.",
            "review_date": "2018-09-07",
            "source": "rt"
        },
        {
            "content": "es una historia muy triste pero muy bella,buenos planos,y un libreto simple que muestra lo mejor de el,algo que se debe ver.",
            "review_date": "2018-08-19",
            "source": "rt"
        },
        {
            "content": "A simple, heartwarming story of a loyal dog that waits for his master after his master's untimely death.  The dog: an Akita. The story is real and took place in Japan in the early 20th Century.",
            "review_date": "2018-08-11",
            "source": "rt"
        },
        {
            "content": "This movie nails the relationship between a dog and his human companion.",
            "review_date": "2018-08-03",
            "source": "rt"
        },
        {
            "content": "Heartwarming, precious and designed to tug at every emotional string you have. Hachi is a perfect Hollywood-0designed remake of a 1987 Japanese film, which was based on a true story in 1920's Japan of a professor whose loyal canine friend waits daily in the same spot at the train station for his master's return from work. However, one day the professor dies while at school and never returns. Hachi returns to the same spot every day for 9 years until he himself passes. If you are even half of an \"animal person,\" much less a \"dog person,\" Hachi will have you teary-eyed with sweetness and sadness. It isn't a perfect movie and is borderline too sappy, but if one views this movie with the right expectations, they don't get much better than this for animal lovers and pet/dog owners.",
            "review_date": "2018-06-18",
            "source": "rt"
        },
        {
            "content": "Historically inaccurate, impressively acted, and definitely sad, Hachi is film that I'm personally mixed about. On one hand, the film demonstrates good acting from the dogs and humans, but the dog sometimes seems like it is lost in the script, and not in a good way. The dog looks like it doesn't know what is happening, and is just there most of the time. Hachi is supposed to be a story that takes placed in 1920s and 1930s. This is modern day. I would have moved the film's score up a lot if the film wasn't inaccurate. The logic is weird. How does a dog get sent from Japan to the United States on airplane being unnoticed and survives. That dog would have freaked out. I am not giving this film a lower score because the story is actually a big gripping, and the fact that Hachi's point of view is different is great. I didn't like watching this film when I did, but still. I would recommend this film to anyone who is wanting to see the film. It's a cute story, but not a cute story I like. 35% goes to Hachi: A Dog's Tale.",
            "review_date": "2018-06-08",
            "source": "rt"
        },
        {
            "content": "One of the better dog flicks you'll see.",
            "review_date": "2018-06-08",
            "source": "rt"
        },
        {
            "content": "Hachi: A Dog's Tale has a good heart, but it's not a feature-length movie. They've stretched the short story so paper thin that it's practically transparent. It's essentially like watching a 90-minute dog video on the internet. However, all the Akita cuteness still can't make up for the slow plot and pacing.",
            "review_date": "2018-05-29",
            "source": "rt"
        },
        {
            "content": "Felt Like A Three-Year Olds Kid's Show Montage, With That Annoying Piano Just Playing Along While A Dog Looks, Sniffs & Wonders Randomly Around. All It Needed Was A Goofy Adult-Narration Going; \"What's Hachiko Thinking!!?\" \"Where Is He Going Now??\" \"Poor Hachiko..He Looks Lost!!\"..All While The Piano Drones Along. Was Pretty Crap, If I Was Having To Watch This At A Cinema, I'd Be Wanting To Be On A Pretty Hot Date. Otherwise, You Just Lost Ya Money. The Only Lovers Of This Film Are Those Whom Like A Combination Of Mr-Richard With A Friendly Dog...So Mostly The Female Variety. A Chick Flick, Which I Found Incredibly Boring!",
            "review_date": "2018-05-20",
            "source": "rt"
        },
        {
            "content": "This movie should’ve got 100 rotten tomatoes this is the best movie ever ",
            "review_date": "2018-05-19",
            "source": "rt"
        },
        {
            "content": "If you are a girl under 13 years old then you will love this crappy movie with a basic plot. ",
            "review_date": "2018-05-13",
            "source": "rt"
        },
        {
            "content": "THIS MOVIE MADE ME CRY SO MUCH OML THIS IS ONE OF MY FAVORITE MOVIES EVERRR WATCH THIS PLEASE BUT YOU NEED TO HAVE SOME TISSUES AND A LIL SNACK MMMMMMMMMM THIS IS SO FREAKIN SAD I LOVE IT SO MUCH",
            "review_date": "2018-05-09",
            "source": "rt"
        },
        {
            "content": "Get ready the box of tissues for this one .... beautiful film",
            "review_date": "2018-02-26",
            "source": "rt"
        },
        {
            "content": "Quality-wise it is not that great, but stories about loyal animals are usually very tender and moving.",
            "review_date": "2018-02-08",
            "source": "rt"
        },
        {
            "content": "Hachi is a movie that has a quiet feel to it, but it hits you with a lot of emotions - how hurtful it must be to faithfully wait, have no closure and be left alone.",
            "review_date": "2017-12-22",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 6.5\n\nA pesar de que el guión deje que desear, Hachi es una historia memorable y entrañable.",
            "review_date": "2017-12-18",
            "source": "rt"
        },
        {
            "content": "I have always been a huge fan of dramas so Hachi: A Dog's Tale, did not disappoint me! The movie is based on a true story that took place in Japan.\n\nThe plot is easy to follow. It's focused on Hachiko's and Parker's(Richard Gere) relationship. The Professor found Hachi from a train station and tried finding his owner, but failed and decided to keep him. Over the year, the pair became very close and Hachi started sending Parker to the train station, waiting for him there until he came back from work. However, one day Parker had a heart attack and never returned. From that day on Hachi returned to the same spot everyday, waiting for his owner until he died of old age. \n\nI find the film to be extraordinary.  I loved every second of it- the incredible acting, fitting music and overall how the story was told. It made it very special and emotional.\n\nThe film is undoubtedly a real tear-jerker. One moment you're laughing and the other, crying. It is worth every single tear! I recommend it to everyone, especially families. It'll find a place in everyone's hearts.",
            "review_date": "2017-12-04",
            "source": "rt"
        },
        {
            "content": "It's unapologetic about what it stands for. I'm a crying mess. A story about loyalty and devotion, \"Hachi\" manages to showcase a dog's never-ending love about its owner and friend. The relationship between the two was well represented and the bond is unquestionable. A well developed story about an animal friend easily manipulates me into loving any movie. \"Hachi:A dog's tale\" has a soul and a heart and its charm can warm even the cruelest of hearts. A beautiful movie!",
            "review_date": "2017-11-25",
            "source": "rt"
        },
        {
            "content": "One of the most endearing films with regard to the human-animal  connection and a testimony to the enduring and everlasting bond that not even death can end.  For those of us who have loved, lost and mourn anyone in our life, human or furry family member, this film gives hope of better times to come.",
            "review_date": "2017-09-26",
            "source": "rt"
        },
        {
            "content": "Único filme que já me fez chorar. Não só isso: me fez chorar duas vezes no mesmo filme. Única obra que conseguiu esse feito. E a história é linda. Eu amo cachorros. Acho que foi por isso que eu fiquei emotivo demais com essa magnificência.",
            "review_date": "2017-08-25",
            "source": "rt"
        },
        {
            "content": "?????? ?? ??? ????? ????? ????? ??????? ?? ????? ????? ??",
            "review_date": "2017-08-18",
            "source": "rt"
        },
        {
            "content": "Saddest most touching  movie I have ever seen",
            "review_date": "2017-08-12",
            "source": "rt"
        },
        {
            "content": "Hachi-My Hero \nHachi: A Dog's Tale is a very touching movie. Even though I have watched it many times, every time I watch, I am touched. The film focuses on a dog, Hachi, and his love for his master, Parker. Hachi uses his lifetime to guard and wait for Parker. He never changes his love, which is very rare in humans. His loyalty makes me feel so precious, and I was touched by his lifetime love for Parker too. \"Heroes\" have a different definition in everyone's mind. In children's mind, \"hero\" may be superman; for the people who love money, their \"hero\" may be Mr. Bill Gates; for me, Hachi is a hero. He showed me what a real hero looks like in the film. \nThe film firstly released in Japan in 2009. Its material from a true story happened in Japan in 1933. The film is directed by Lesser Halls. In the first part of the movie, the professor, Parker, met Hachi. Small Hachi grew up healthily, and established a close relation with Parker. Hachi would go to the station to drop Parker off and wait for him to come back every day. In the second part, Parker died, and Hachi still waited for him every day. At first, the people around Hachi found his behavior strange, but as Hachi kept going to station every day, people were touched by his loyalty and were willing to take care of him. There were even journalist who wrote his story, and made Hachi's heroic deeds spread to the world. People from all over the world sent money to look after Hachi. Hachi become a hero, but not everyone in real life is as lucky as Hachi is. There are many unknown heroes around us, they sacrifice for us every day but we are rarely grateful or recognize. \nParker's wife eventually recognized Hachi was a hero. Ten years after Parker's death, Kate went back to the little town they used to live. When she arrived at the station, she saw Hachi was there. She hugged Hachi and cried, which as if she found a close friend. In the beginning, Kate didn't like Hachi, and didn't want Parker to keep him. Unexpectedly, after 10 years, the dog she hated was the one who has insisted on waiting for her husband. She was moved in that moment, and outside of the film, I was very touched as well, because it is hard to keep doing one thing.\nThe background scene of the film help me get into that moment. The leaves on the trees, change from green to yellow, again change from yellow to green; from spring to winter; from sunrise to sunset; from birth to death; Hachi from young to old, but one thing, the love, can never change. If we miss a person, perhaps only for a period of time, but Hachi uses his whole life to miss a person, which left me inexplicably moved. I would love to have a person can love me like this. Hachi was not a millionaire, and he would not be a superman, but he did an amazing thing, which made him a hero. Loving a person is very easy, but it is not easy to always love a person as Hachi did. A true hero is someone who has a big goal and is willing to put it into practice. They are not afraid of failure, and not afraid of setbacks. They are those who still have a strong sense of purpose, hope, and courage in a difficult situation.\nYear after year, Hachi has been waiting for Parker until him died. The moment he closed his eyes; he saw Parker's smiling face, cried for him \"Hachi, Hachi, goodboy.\" Love is so simple, so pure and loyalty so enduring, which will melt a heart of stone. This film is suitable for all ages, strongly recommended. In the film, you can find the eternal pure love. People have decades of a lifetime, but a dog's life is only a decade. Hachi used his lifetime to love a person. The paths Hachi choose, rather than the powers he is graced with make him a hero. But, is not just him, there are a lot of super heroes all around us. As long as we understand the true meaning of hero, we will find them in real life. They have helped many people and brought many positive influences to our society like Hachi did.",
            "review_date": "2017-08-10",
            "source": "rt"
        },
        {
            "content": "A perfect emotional and heart touching movie i have ever seen\nLoyalty is an expensive word and only few can afford it",
            "review_date": "2017-08-06",
            "source": "rt"
        },
        {
            "content": "Hachi: A Dog's Tale has The making of a manipulative made-for-tv feel, but is at least competent on telling the story in a so-so way",
            "review_date": "2017-07-27",
            "source": "rt"
        },
        {
            "content": "This movie tells the story of a friendship between a man, Parker Wilson (Richard Gere), and a dog he unexpectedly befriends and names Hachi.\n\nHonestly, I don't think I can say much about this movie. Its acting is good: Gere is very likable as are the supporting cast (maybe except Jason Alexander). The pacing for the storytelling is alright. It's only an hour and a half, and it doesn't feel very long (and it doesn't need to be). Its story is a touching one that knows how to make the audience believe the relation between Hachi and Parker.\n\nProbably the biggest criticism I have for the film is that it doesn't offer the audience anything more than the central relation. This can make the movie seem a bit bland and plotless. It's not until the second half that the drama gets more serious, and surprisingly more engaging. If it were not for this second half, this movie would likely be very forgettable, since I myself am not a dog owner (I'm sure dog owners will find more to cherish with this film), and I didn't find anything about the acting or the dialogues that stood out; they were just fine.\n\n\"Hachi\" is a well-done film that chooses to only focus on its central friendship without trying to be too complex. This can work against it sometimes, but its pacing and running time help it be a good enough film to watch.\n7.0/10",
            "review_date": "2017-05-19",
            "source": "rt"
        },
        {
            "content": "A very cute movie which always make me cry.",
            "review_date": "2017-04-15",
            "source": "rt"
        },
        {
            "content": "A bond. Loyalty. Friendship. Life, love, and maybe the sweetest dog ever. A beautiful but difficult film to watch. Who poured salt in my eyes, they're leaking!?",
            "review_date": "2017-03-15",
            "source": "rt"
        },
        {
            "content": "A good emotional film.",
            "review_date": "2017-03-12",
            "source": "rt"
        },
        {
            "content": "Makes me cry every time I watch it!! So sad",
            "review_date": "2017-02-25",
            "source": "rt"
        },
        {
            "content": "COMO LLORE CON ESTA PELI ... :(",
            "review_date": "2016-12-14",
            "source": "rt"
        },
        {
            "content": "Omg what a sad story. I cried nearly all the way through it haha, I'm such a wuss when it comes to dogs",
            "review_date": "2016-11-15",
            "source": "rt"
        },
        {
            "content": "this is a very good movie, is touching",
            "review_date": "2016-10-23",
            "source": "rt"
        },
        {
            "content": "While not a revolutionary movie, it pulls at the heartstrings of any pet lover.",
            "review_date": "2016-10-22",
            "source": "rt"
        },
        {
            "content": "Such a nice story, made me think of my cat Picasso and how much I love her.",
            "review_date": "2016-09-21",
            "source": "rt"
        },
        {
            "content": "A pack of tissue is definitely not enough for me. Best dog movie, there is no need a lot of conversations in this movie and it's enough to make you to cry for non stop.",
            "review_date": "2016-09-07",
            "source": "rt"
        },
        {
            "content": "when a dog in a movie can bring tears in the eyes, that's something special!",
            "review_date": "2016-09-04",
            "source": "rt"
        },
        {
            "content": "If you really like dogs, please watch this movie.You will learn how to build  good relationships with your dogs.You simply need to love your dogs and make them one of the members of your family. Then your dogs will love you and follow you anywhere.\n\nHachi was a Japanese dog.Hachi was born in Japan. He was so loyal to his owner that he was with him everywhere.Today, there is a Hachi's statue at Shibuya station in Tokyo. After this American version Hachi movie, a tatue of the dog, Hachi, was installed in front of Woonsocket Depot Square,NY  where the movie was filmed.\n\nIt was a very nice short film.The story is from Japan.Japanese love this story because Hachi looks like some samurai who was loyal to his lord and died for the lord.  If you love the dogs, please watch this movie.",
            "review_date": "2016-09-02",
            "source": "rt"
        },
        {
            "content": "emotional and beautiful movie, the real best friend of humans.",
            "review_date": "2016-08-29",
            "source": "rt"
        },
        {
            "content": "This is an amazing movie I love the story I think it was played well and love that it was a true story I had heard about the story before and the movie was a great tribute to it although you will cry in the movie it is deeply sad.",
            "review_date": "2016-08-28",
            "source": "rt"
        },
        {
            "content": "oh boy... if you love dogs. and you want to ruin your fucking day.... watch this movie.\ndepressing isn't even the right word.",
            "review_date": "2016-07-29",
            "source": "rt"
        },
        {
            "content": "http://cineptimoarte.blogspot.mx/",
            "review_date": "2016-06-23",
            "source": "rt"
        },
        {
            "content": "So if its harder for a man to forget, its harder for a dog to forget :(\nSad and beautiful...makes you teay eyed towards the end",
            "review_date": "2016-06-19",
            "source": "rt"
        },
        {
            "content": "To me, this is the ultimate dog lover's movie.  It is a simple, yet beautiful story about a loyal dog based on true events.  The cynical people will say it is schmaltzy and manipulative, which isn't necessarily untrue, but it is well done in my opinion.  The dog(s) is beautiful and it is just a nice story.  Highly recommended!",
            "review_date": "2016-06-18",
            "source": "rt"
        },
        {
            "content": "If a movie can make me cry... It deserves 5 stars",
            "review_date": "2016-05-29",
            "source": "rt"
        },
        {
            "content": "Any movie that is able to pull on your heartstrings as well as this movie does deserves a really good rating.",
            "review_date": "2016-04-12",
            "source": "rt"
        },
        {
            "content": "triste pelicula,  pero excelente",
            "review_date": "2016-04-11",
            "source": "rt"
        },
        {
            "content": "I just knew before starting this movie I would cry! It's that kind of story that brings out emotions that even the hard hearted cannot hide. That being said it is a beautiful story that just happens to be based on true events that tug at the heart-strings while it also entertains completely. Richard Gere (Officer and a Gentleman) fits the part well. He and Joan Allen give this humble story a professionalism it needs so it is not just a sappy story reminiscent of Lassie Come Home. I loved it and highly recommend it even if you do cry a bit it's well worth it.",
            "review_date": "2016-04-03",
            "source": "rt"
        },
        {
            "content": "This dog broke my heart in pieces :(:(:(",
            "review_date": "2016-03-25",
            "source": "rt"
        },
        {
            "content": "Warning: Don't watch this movie if you don't want to cry. It will definitely will make you cry.",
            "review_date": "2016-03-24",
            "source": "rt"
        },
        {
            "content": "Obviously, I cried like a girl.",
            "review_date": "2016-03-14",
            "source": "rt"
        },
        {
            "content": "tear jerker for sure",
            "review_date": "2016-03-13",
            "source": "rt"
        },
        {
            "content": "Even the manliest moviegoer likes to have a good cry from time to time.",
            "review_date": "2016-03-13",
            "source": "rt"
        },
        {
            "content": "A slow and depressing movie that's not worth your time or money.",
            "review_date": "2016-03-12",
            "source": "rt"
        },
        {
            "content": "cinegeek.de Lasse Hallström serviert ein Mal mehr gehobenes Mittelmass, diesmal für Hundeliebhaber. Mit viel Eleganz (die man ihm in Slippern gar nicht zutraut) besetzt er Richard Gere in diesem Remake einer japanischen Legende. Hachiko, ein japanischer Akita-Hund holte sein Herrchen, einen Professor täglich von der Bahn ab. Selbst als der Professor bereits verstorben war, wartete Hachiko täglich am selben Platz. Schliesslich starb Hachiko auch an der Stelle. So das Vorbild dieses Films. Dem amerikanischen Musikprofessor Parker Wilson (Richard Gere) läuft in seiner Kleinstadt ein Welpe zu. Kurzerhand nimmt er ihn mit nach Hause. Seine Frau Cate (Joan Allen) ist davon wenig begeistert. Eine Nacht darf der Welpe bleiben. Bald aber sieht sie ein, dass ihren Mann und den Hund, der ihn täglich zum Bahnhof bringt und wieder abholt, ein unsichtbares Band verbindet. Ganz unmodern langsam eröffnet der Film seine Betrachtungen um den Kummer eines Haustiers. Wer bricht an dieser Stelle in Tränen aus? Wer langweilt sich angesichts matschiger Emotionen? Bei mir wars die erste Variante: Ich musste losheulen, denn Hallströms Film ist so aufrichtig und so - einfach schön! mehr auf cinegeek.de",
            "review_date": "2016-03-03",
            "source": "rt"
        },
        {
            "content": "Highly underrated for a Rotten Tomatoes score. This film is a very depressing, heartfelt film and is also a true story. Acting is great, music is great. I can't recommend it enough for people looking for a great story and wouldn't mind getting sad.",
            "review_date": "2016-02-20",
            "source": "rt"
        },
        {
            "content": "It's a beautiful yet simple movie, you will cry,",
            "review_date": "2016-01-18",
            "source": "rt"
        },
        {
            "content": "There goes my heart. Seriously. Endearing, powerful, heart-wrenching, and simple, \"Hachi's\" wonderful use of editing trickery will make you feel as though you've known this dog your whole life.",
            "review_date": "2016-01-15",
            "source": "rt"
        },
        {
            "content": "I really enjoyed this movie, well done.",
            "review_date": "2015-12-11",
            "source": "rt"
        },
        {
            "content": "Was going to buy this when I saw the title, then didn't. It's 2015, why are we still casting clearly white people as Asian characters, in an Asian story?",
            "review_date": "2015-12-05",
            "source": "rt"
        },
        {
            "content": "This movie is an eloquent portrayal of human ignorance imprisoning a dog to live out a decade in confusion, disappointment, and grief as he passes his days waiting for his master to return.  Setting aside the fact that not one of the idiots who supposedly cared for this dog took it upon himself to make the dog a shelter, I want to say, \"Wake up world!\"  There is no \"mysterious\" union here; this was an ordinary dog doing an ordinary thing.  Akita's are fiercely loyal.  It was the human element that was gut wrenchingly noteworthy.  If owners of dogs really loved their dogs they would become more informed about what is necessary to take care of their dogs.  Had the owner been sickly, the dog would have picked up on that and resolved itself to a death situation when the owner failed to show up.  Yes, dogs are extremely perceptive.  However, since this was a sudden death and the owner had allowed this dog to be a crucial part of his daily routine, a perfect storm arose that left the dog confused and locked into a behavior pattern because he knew no different.  We all want to believe the dog was paying homage to his dead master when actually the dog was daily living out his perceived reality:  My master doesn't want to be with me today.\" This dog could have had a happy life bonding with his new family had the owners taken the dog to the dead body of his owner so that he could sniff him and draw the natural conclusion that animals draw.  Yes, he would have mourned the loss but he would have gotten over it and gone on with his life in a much less depressing way.  Shame on us for not becoming more educated about these poor creatures we mercilessly include in our lives for our own selfish reasons. \nIt was obvious that not one person involved with this movie knew the first thing about caring for, training, or even interacting with a dog.  Poorly acted, poorly written, poorly directed mess of a movie that did a true disservice to man's best friend.",
            "review_date": "2015-12-05",
            "source": "rt"
        },
        {
            "content": "Hachi doesn't break any major barriers when it comes to dog films, but it does offer a story that is emotional and heartfelt.",
            "review_date": "2015-12-02",
            "source": "rt"
        },
        {
            "content": "I never cried so much in a movie. And still cry like my heart is being broken into small little pieces everytime I see it.",
            "review_date": "2015-10-31",
            "source": "rt"
        },
        {
            "content": "Well, this brought on the waterworks. Great story that focuses on the dog. Be prepared to cry for over half the movie.",
            "review_date": "2015-10-21",
            "source": "rt"
        },
        {
            "content": "heartwarming movie... I'm a dog lover... and i know my dog was wait for me all the time when i go to school. When i reached home, i could saw its hapiness and excited. Could you imagine when a dog was waited for its owner but its owner was passed away already, what would the dog feel? sad and keep waiting? it was so pity... the loyalty of a dog won't have to be undeniable. Sorry for my grammar mistake and bad english... This was a amazing movie!!!",
            "review_date": "2015-10-20",
            "source": "rt"
        },
        {
            "content": "great family movie - a tearjerker to the nth degree albeit a hair sappy...allstar cast based on lovely japanese story",
            "review_date": "2015-10-12",
            "source": "rt"
        },
        {
            "content": "Teressa rates it 5 Tears",
            "review_date": "2015-09-25",
            "source": "rt"
        },
        {
            "content": "This take will make you cry.",
            "review_date": "2015-09-12",
            "source": "rt"
        },
        {
            "content": "vedry sad ^& emotional",
            "review_date": "2015-09-12",
            "source": "rt"
        },
        {
            "content": "I mean, COME ON. You don't want me to give this 5 stars? HA? Blind recommendation from me >____> T___________T",
            "review_date": "2015-08-21",
            "source": "rt"
        },
        {
            "content": "Don't look at the critic score. I get that it's simple but that might've been the reason why it was such a tear jerker. The movie was so heart wrenching I set up an account just to write a review here. If you are going to watch this(which you should), bring a lot of tissues.",
            "review_date": "2015-08-17",
            "source": "rt"
        },
        {
            "content": "this movie  always  make me cry i love  this movie  but it's  really  sad",
            "review_date": "2015-08-15",
            "source": "rt"
        },
        {
            "content": "A story filled with love and happiness. I honest tearjerker guaranteed to make the manliest of men cry. This story was beyond what I was expect. I actually figured it might be an redo of old yeller or something. This movie really captured the bond that happens between a dog and owner. \n\nThe dog found him, during a time where he really needed it. The dog was fiercely loyal. The dog was also quite the trouble maker. This story was bit slow which is why I am not giving it five stars. The ending shocked me. It was very moving. \n\nI found this in the kid and family section which I guess it is over all appropriate for everyone. Although I wouldn't take children who aren't ready to deal with the topic of death.",
            "review_date": "2015-08-06",
            "source": "rt"
        },
        {
            "content": "I don't really want to break down this film into its specifics, cuz it's such a beautiful story and it really hit me and got me down to tears when I was young, and I think that's what you need to know. The film really captures the quirks and character of Hachiko, and takes you through his whole life, and it's so beautiful and emotional, I don't think you can get through this one without at least shedding a few tears, and for that, I think this film gets a full on 5 stars, even though it's not a perfect film if you'd go into the specifics.",
            "review_date": "2015-07-10",
            "source": "rt"
        },
        {
            "content": "Preserves the beauty of the original.",
            "review_date": "2015-07-02",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2015/06/hachi-dogs-tale.html",
            "review_date": "2015-06-09",
            "source": "rt"
        },
        {
            "content": "Not much of a story.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "DOG LOVERS THIS AINT YOUR MOVIE!!\n\nCan I rate 0 stars?\n\nNormal movies have a good happy beginning but this one is different .\n\nSo I was watching the movie and there is the cutest puppy i have ever seen! Don't mean to spoil it but this movie is sad painted all over  it ð~. The beginning was fine the middle was sad and... ill let you see what the end is for yourself.\n\n\nI. DONT. LIKE. IT. !Â¡!",
            "review_date": "2015-05-30",
            "source": "rt"
        },
        {
            "content": "Hachi is a heartbreaking story about a dog a dog who waits for his master after he passed away\nHachi's emotional effectiveness is heart crushing i cried til my eyes were sore mainly because I am a massive dog lover\n5/5",
            "review_date": "2015-05-27",
            "source": "rt"
        },
        {
            "content": "One Word \"Feelings\" that only matter in life!",
            "review_date": "2015-05-22",
            "source": "rt"
        },
        {
            "content": "saddest movie I have ever watched",
            "review_date": "2015-04-27",
            "source": "rt"
        },
        {
            "content": "Break out the tissues :(",
            "review_date": "2015-04-05",
            "source": "rt"
        },
        {
            "content": "If you're a dog lover, this movie might make you shed a tear or two. True loyalty",
            "review_date": "2015-03-12",
            "source": "rt"
        },
        {
            "content": "Does feeling traumatized because of this movie count as a review?",
            "review_date": "2015-03-11",
            "source": "rt"
        },
        {
            "content": "Excellent dramatic Story. I love so much this movie. Related the story between a man and animal hilighting the devotion of a dog for humam companion. I still saying, the dog is better companion for the man.",
            "review_date": "2015-03-09",
            "source": "rt"
        },
        {
            "content": "\"Hachi\" is a beautiful story because of its simplicity.  There are few films that portray loyalty in such a powerful and simple manner.  Even more powerful is the fact that this story is based on the actions of a real-life dog in the 1920's.  The film never received a theatrical release in the United States but it is not lacking in quality.  It is filled with enjoyable performances by Richard Gere, Joan Allen, Jason Alexander, and the three Akita dogs that play Hachi at three different ages.  The interactions between the actors and dogs never seem to be forced; in fact, the entire thing feels very natural, as if the dogs were raised by the actors themselves.  It is that rare family-friendly film that appeals to all ages, whether it is a child who loves watching the cute puppy or the parent who is moved by the loyalty of this dog.  Every dog owner will be cuddling a little closer with their pup after this one.  \"Hachi\" isn't a very well-known film but delivers the quality acting, tender emotions, and age-wide appropriateness that should make it a staple for every family.",
            "review_date": "2015-02-24",
            "source": "rt"
        },
        {
            "content": "I'm awarding this beautiful, heart-warming film 5 stars because it's one of the most moving films I've ever watched! Overall, it made me smile, laugh and cry. I'm also one to notice soundtracks, and the music in this film was perfect and definitely helped to bring out the emotions. Although I'm not sure if a non-dog lover would react in the same way, it's undeniably still a wonderful touching story of an unforgettable friendship.",
            "review_date": "2015-02-23",
            "source": "rt"
        },
        {
            "content": "NEVER SHOW THIS TO SENSITIVE KIDS IT'S SO SO SAD!",
            "review_date": "2015-02-22",
            "source": "rt"
        },
        {
            "content": "Great story of loyalty!",
            "review_date": "2015-02-21",
            "source": "rt"
        },
        {
            "content": "Very simple in scope yet unabashedly heartbreaking.",
            "review_date": "2015-02-10",
            "source": "rt"
        },
        {
            "content": "Very sad especially for dog lovers",
            "review_date": "2015-02-08",
            "source": "rt"
        },
        {
            "content": "OMG.. One of the saddest movies I have ever seen. A real tear jerker.",
            "review_date": "2015-02-08",
            "source": "rt"
        },
        {
            "content": "Lasse Hallstrom is a good director who's always keen on exploring human stories with an edge. This film focusses more on a relationship between a teacher and his faithful dog Hachi but turns out to be a great film about the love they share for one another and the dedication the dog had in his friend/owner. It's a beautifully shot family film that will melt your heart. A sweet film for the whole family.",
            "review_date": "2015-02-05",
            "source": "rt"
        },
        {
            "content": "It was so beautiful and sad that I cried!",
            "review_date": "2015-01-31",
            "source": "rt"
        },
        {
            "content": "A similar story to Greyfriars Bobby which has had several films made about it, this one is however a much sadder told tale, however extremely well done.",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "Good movie!  Super sad!  :(",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "good movie, but so very very sad",
            "review_date": "2015-01-28",
            "source": "rt"
        },
        {
            "content": "My boyfriend is a jerk for bringing this home.",
            "review_date": "2015-01-28",
            "source": "rt"
        },
        {
            "content": "7.5 - don't watch with a dog lover! If you do, have Kleenex ready..",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "A touching story about a dog named Hachi who waits for nine years for his master (Richard Gere) to return home. This is one of those touching films that have more of a meaning other than, \"Oh that's super sad.\" Hachi the dog represents the loyalty and love he has for his master. One day a college professor (Gere) finds an abandoned puppy and brings him home. He at first looks to give the dog away, but soon grows super attached to him. Several years go by and Hachi (the dog) has grown accustomed to following the professor to his train in the morning and returning in the evening to await him when he returns from work. Unfortunately, one day the professor doesn't return because of a tragic event. Hachi still comes to the spot day after day for nine years. The human element of the movie is its weak point. I never great attached to the characters, but that isn't the real star of the film. You go in this watching the incredibly talented dog Hachi. Overall, this is a rent if this kind of movie floats your boat.",
            "review_date": "2015-01-13",
            "source": "rt"
        },
        {
            "content": "Recommended for all dog lovers. It's a great story.",
            "review_date": "2015-01-10",
            "source": "rt"
        },
        {
            "content": "\"Hachi\" is a very touching tale about a dog and this master. But when you start crying, it's almost too late : you cry till the end.",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "An unexplainably tear-jerking plot which follows a college professor accepting an abandoned dog into his life, and the two soon forming an unbeakable bond. This bond proceeds to remain undeniably strong even after the professor's death. In the last half hour of the movie the anguish of the plot begins to thicken as the faithful akita remains waiting for his owner to return. Hachi is undoubtedly the centre attraction for the film, with great acting by all involved. I challenge even the hardest of hearts to attempt not to weep towards the end of this film, even the bold faced reviewers who rated this poorly. Although unapologetically tear-enducing, this 1 and a half hour emotional journey is a must watch, expecially for dog-lovers.",
            "review_date": "2015-01-02",
            "source": "rt"
        }
    ]
}