{
    "rating": 9.1,
    "release_date": "Invalid",
    "num_reviews": 50,
    "genres": [
        "Chinese"
    ],
    "summary": "Lai (Tony Leung Chiu Wai) and his boyfriend, Ho (Leslie Cheung), arrive in Argentina from Hong Kong, seeking a better life. Their highly contentious relationship turns abusive and results in numerous break-ups and reconciliations. When Lai befriends another man, Chang (Chen Chang), he sees the futility of continuing with the promiscuous Ho. Chang, however, is on his own personal journey and, ultimately, both Lai and Ho find themselves far from home and desperately lonely.",
    "reviews": [
        {
            "content": "Loved it! Reminded me, somewhat, of Midnight Cowboy.\nVery strong characters, wonderful story, poignant relationships.",
            "review_date": "2023-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wong Kar-Wai bittersweet and boldly about the unsuccessful, mutually toxic love of two young Hong Kong boys abroad in Argentina in search of a better life, with a pinch of tango, Astor Piazolla (the seductive compositions \"Prologue - Tango apasionado\", \"Finale - Tangoasionado \"And\" Milonga for Three\" play with the moments of coupling lovers and their separation, and so on), Frank Zappa (\" Chunga's Revenge \"and\" I Have Been in You \"- emphasizing the unstable relationship between Lai Yiu-fai (Tony Leung) and Ho Po- wing (Leslie Cheung), their aggression and love flickering back and forth, Wong's elliptical short story sees them apart and then back together like a dance) and the 1967 hit The Turtles, from which the film took its headline. In some places it is boring, but quite interesting about the hardships of love as a common path to happiness. Well done by cinematographer Christopher Doyle (previously with Wai on \"Ashes of Time, 1994, and later with Phillip Noyce, Yimou Zhang and Jim Jarmush) - pictures from travels, lof andscapes (including impressive photos of Iguazú Falls on the Argentine-Brazilian border) and the poor neighborhoods districts of Buenos Aires. Black and white photography is mixed with juicy, colorful in the right places where the action unfolds.",
            "review_date": "2022-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Soul searching in Buenos Aires.  So this is about two men (Leslie Cheung, Tony Chiu-Wai Leung).  They're romantically involved and vacationing in Argentina.  The trip was supposed to bring them closer together, but when the money runs out and they can't return home to China, they find themselves drifting apart.  This is one that I knew very little about aside from the plot description.  I randomized the Letterboxd Top 250 Narrative Feature Films again (which is quickly becoming my new go-to when I don't know what to watch), and this is the one that was sitting at the top.  Happy Together is not exactly a mainstream film, but if you're a fan of the art house, then hopefully it is already on your radar.  Happy Together is my first experience watching a Kar-Wai Wong film.  To this point, I only knew that he has a lot of clout in the critical community, but I didn't know what he was all about.  Now that I've gotten a taste, I can safely say that he is an auteur.  This is filmed in both black and white and in color, and it has a rather large effect on the general mood of the film as well as with the outlook these characters have on one another.  Kar-Wai Wong also slows down the frame rate at certain times, and I think that is to help to highlight certain moments.  It's a bit of a trippy effect since you hardly see this happen in dramas, but it is effective.  The cinematography is standout and stellar, and even after just one film, I can see why Kar-Wai Wong carries such a reputation as a director.  As far as the actual story goes, it is very slice of life.  These two men are caught in a very toxic cycle, so much so that it's clearly defined when one of them says, \"Let's start over.\"  Once the caretaking aspect is introduced to their relationship, you want it to work out since the dynamic shifts, but you just know it won't be long before a shoe drops because that is how cycles work.  If I were gay, this movie would probably mean more to me.  I'm not even saying that as a detriment, as it is a beautiful film that I appreciated from start to finish, it would just give me an extra level to connect with the story.  I had a similar feeling after I finished watching Brokeback Mountain, and different films will mean different things to different people.  Regardless of your sexual orientation, Happy Together is very much worth a watch.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not a love story. It centers around a man, Fai, bruised by love that now has to live a difficult life where his lost relation lands him. We spend half of the movie with this couple and let's say they are definitely not happy together. Fai lost all trust towards Po-Wing but can convince himself to let it go but also resists to not fall for him again. The second half of the movie follows Fai, alone, slowly (and in a very contemplative way) recovering. It's a slow movie but with interesting art directions, the most jarring it's the smooth transitions between black-and-white and deep colored scenes. None of the stories here will end in a satisfying way but will quietly phase out letting you wanting more.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my new favorite LGBTQ+ films.\nTurbulent couple Fai and Wing take a trip to Buenos Aires with what little cash they have. Although, clearly in love, their destructive relationship sends them spiraling and doing what they must to survive in a foreign country.\nBeautifully shot and acted.",
            "review_date": "2022-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This might seem obvious but it isn't said enough: Wong Kar Wai is absolutely the best at directing relationships, of any kind.",
            "review_date": "2022-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the great tortured romances in film, depicting a relationship not so much as undefined affection but more like a chemical reaction - a fluid balance of love, disgust, comfort, and disappointment. Wong Kar-Wai flourishes in this realm of mood, integrating saturated color and off-center framing to highlight the peaks and valleys of a turbid relationship; as with most of Wong's films, the plot is secondary to the establishment of a linear story, but that ties into the exploration of the love between Leslie Cheung's Ho Po-Wing and Tony Leung Chiu-Wai's Lai Yiu-Fai - relationships are not about an end destination, but the journey, the evolution along the way. Deeply contemplative and wholly engrossing, Wong knows how to keep the atmosphere simmering and the emotions running hot. (4.5/5)",
            "review_date": "2022-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have mixed feelings towards Wong Kar Wai  as a director because while his filmic images are always gorgeous, I have trouble connecting with his stories, which can sometimes be too subtle for me. However, Happy Together is a wonderful exception. The story is simple - a toxic gay relationship between a narcissist and his enabler, with the enabler Fai ultimately leaving and being happy.",
            "review_date": "2021-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moody, sometimes heart wrenching in its depiction of disfunction love and loneliness, honest. Unusually interesting cinematography. Well acted.",
            "review_date": "2021-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1001 movies to see before you die.  This was a romantic drama showing the complexities of the love hate relationship.  The story of two Asians in Argentina helped keep my interest in a place I haven't yet been, then to end in a night market in Taipei was good too.  Although I may not see this again, I do respect it for its uniqueness.  Saw on HBO.",
            "review_date": "2021-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie ever. I could rewatch this over and over again. It's just a simple love story of a couple having a vacation, yet it's so subtle under the director's camera and storytelling skills. Fascinating!",
            "review_date": "2021-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best movie I've ever seen. Love the scene palettes and actors",
            "review_date": "2021-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wong's trademark lyricism and lush visuals are in abundance here, but the emotion of the piece is less precious than usual, more unfettered. But the film also feels disjointed. Sequences you expect to build emotionally feel cut off in the service of Wong's desire to isolate moments of passion or anguish on the fly. Its repetitions play better on repeat viewings. Makes for a typically imperfect yet never boring movie. And it has one of my favorite, most optimistic final shots in modern movies.",
            "review_date": "2021-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's been ages since I saw a  Kar-Wai Wong film. He has done some excellent films and this is known to be a good one. Two guys from Hongkong leaves off to Argentina. They are constantly fighting, giving each other a hard time slacking around. Sometimes there's work, sometimes there's not. They sleep, smoke cigarettes and is pretty much fed up with each other.\n\nThis could be a very flat and boring film, but Wongs way of moving the camera, finding the right angles and positoning helps a lot to make this a good film. Sometimes it's in black and white, sometimes it's not. Sometimes quiet, other times filled with music or backround noise. Always atmospheric. It's not a happy film, but not totally sad. It has some great acting and some true emotion. I guess it's about feeling lonely - in a way most people do every now and then.\n\nIt's a queer movie, but that's not important at all here. It gradfully turns into something better and that's pretty neat for something rather slowly moving. At times I have trouble separating the main characters from one another - a rather typical thing for me when it comes to Asian cinema. Not my favorite from the guy, but somewhere in the middle of the films I have seen from him so far.\n\n7 out of 10 lamps.",
            "review_date": "2020-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute masterful display of being lost, fearing lost, and conflict between goals and relationship",
            "review_date": "2020-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Happy Together is perhaps Wong Kar-Wai's best film--it is coherent from beginning to end, but also distinctly stylistic without crossing a line.",
            "review_date": "2020-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice shots, good music. A big movie.",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly touching, occasionally funny, and colorfully crafted, Happy Together is truly a cinematic gem for those longing for intimate, honest human stories. The acting and writing are superb, and the ending is spectacularly executed. ",
            "review_date": "2019-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To me, this is a love story about captivity and homecoming.",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Happy Together does have a familiar story and characters, but Wong Kar-wai lifted this material with an expectedly terrific direction, the film is emotional and very sensual, I really liked its subplot, the ending was satisfying and it deals with tumultuous relationships and loneliness in a very realistic and heartfelt manner.",
            "review_date": "2016-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "far and away one of the best LGBTIQ movies-ever! amazing to look at & gr8 story too",
            "review_date": "2016-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the emotion of the movie... wong kar wai + doyle = amazing visual",
            "review_date": "2015-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's about the vibe and style, the simple way of saying complicated things; i love those stories who nobody ever said 'i love you' but love is everywhere.\n\nyou are Leslie and I will be Tony.",
            "review_date": "2015-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A poignant portrait of a relationship between two men uprooted from their home country, Happy Together explores the ups and downs, the pros and cons of commitment, as the lead characters careen and collide against each other with their discordant personalities acted out wonderfully by two talented actors.",
            "review_date": "2015-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once again I had the rare opportunity to see this amazing film long before it would find a limited release to the US. It seems even more impossible now that this very open examination of a gay couple came out of Hong Kong.\n\nKar-wai Wong's film is still more graphic and honest than most any gay-themed films you are likely to see. Grounded firmly in reality but filmed and edited with highly intellectual and experimental stylings. It is an unforgettable and dark lament on the challenges of love within a the imposing marginalization of an already marginalized culture. Christopher Doyle's amazing cinematography almost presents itself as a third character in the story. \n\nKar-wai Wong was able to secure intense and often brutal performances from his two leading actors, the late Leslie Cheung and Tony Leung. Cheung had been a hugely pop star in Hong Kong and China in the 1980's. Tony Leung had soared to major stardom within a short time prior to the making of this film. \n\nA startlingly unsentimental \"love\" story, the movie both meanders and propels with rocket-speed. This film is like a sharp edged chair that you sometimes need to grasp tightly to keep us -- never mind the pain. \n\nUltimately this is a part of Queer Film Theory, but it is also a vital glimpse into the conflicts of human need vs. human desire. In some ways this is the profane and foul-mouthed cousin of Ang Lee's overly but achingly beautiful, \"Brokeback Mountain.\"  ...Things have changed in Hong Kong, but this is a story that will wrestle till the end of time -- and it is not limited to a \"gay couple.\"",
            "review_date": "2015-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While visually stylish, the abrupt and fragmented storytelling makes it hard to follow the narrative. In the end of the day, it is pretty fascinating and engaging while being subtle at the same time.",
            "review_date": "2015-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Isn't Wong Kar Wai really interesting? I don't know other director that made gay film out of the blue, but he did. And quite surprisingly, like his other films, it echoed to you. I really admire how he could make something unique out of simplicity, like Chang. And the main characters' relationship is just love-hate at its best. Fav.",
            "review_date": "2014-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We could start over\n\nYiu-Fai and Po-Wing are gay lovers whose life together has reached a rocky patch and they go their separate ways and try to start over.  Yiu doesn't really want to settle down, but shortly after their breakup Po-Wing reappears beaten and emotionally scared and drained.  Yiu is empathetic and supportive but his stance hasn't really changed.  As they continue to live and support each other, they each battle their own inner struggles and directions, which is obviously apart no matter how much they emotionally need each other.\n\n\"Did you say you could read a map?  We're miles off!\"\n\nWong Kar Wai, director of In the Mood For Love, 2046, My Blueberry Nights, The Grandmaster, As Tears Go By, Chungking Express, Ashes of Time, and Fallen Angels, delivers Happy Together.  The storyline for this picture is very deep, unpredictable, and compelling.  The characters are dynamic and the dialogue is pretty good.  The acting is excellent and the cast includes Tony Chiu Wai Leung, Chen Chang, and Leslie Cheung.\n\n\"Your bed has fleas.\"\n\nI absolutely need to see every Wong Kar Wai movie I can get my hands on and was excited to discover Netflix had this picture.  This isn't one of my favorite Kar Wai films, but I always adore how he present and delivers his characters, sub plots, and primary storyline.  His films are always emotionally draining and his characters are always emotionally conflicted with tremendous depth.  While this isn't my favorite movie of his, like all of his others, I consider this a must see for drama and movie lovers.\n\n\"I just want to be with you.\"\n\nGrade: B",
            "review_date": "2014-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully shot and packed to the brim with suppressed anxieties. Engaging about a man far from home, clinging onto what he's got, yet never letting go of his dream. Neither sentimental nor cliche, rather raw and ruthless.",
            "review_date": "2014-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "91% of the audience liked this film while critics gave it a 77%. If you're reading this and you're NOT a legitimate critic who gets paid  for criticizing, then you're probably an audience member... Enjoy the film!",
            "review_date": "2014-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good film. beautiful cinematography",
            "review_date": "2014-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's quite nice, jumps directly to be one of my top ten of \"Gay Interest\" movies, but as usual I cannot easily understand Wong Kar-Wai, he looks always so trustful of what he'd done as it's not usual exactly narrative, but the story was not that \"Happy\" for his fully male movie, that I cannot found the joy expression in the relationship between Po & Fai.  I don't know he was describing why we fall in homosexuality linking this with loneliness.. maybe!\nNicely filmed. I love the editing very much, love the black and white scenes to make the story foggy, misty, not related to specific time. Again red and yellow colors are the masters in colored scenes, I think that means not steady relationship.\nTony Leung one of most favourite actors for Kar-Wai is as cool as always, I think he made a nice duet with Leslie Cheung with all contrasts in the two characters which are mostly straight acting outside their own private life, nice.. I got sick from girlish gay character.\nAnd again... Kar-Wai has a great taste in soundtracks.",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Usually not my favourite, but it is quite  an amazing ride once you are engaged into it. The TaÃ¯wanese ending is very touching. Love it!",
            "review_date": "2013-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may be only the second film I've seen by Kar Wai Wong, but goddamn can he craft an unhappy romance and somehow still give a glimmer of hope even after we've watched the characters break up. It's not a typical romance where they argue for a bit and get back together and life is swell. No, Wong wants the audience to feel their love for one another and then show you that just because you love someone it doesn't mean it was meant to be.",
            "review_date": "2013-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another haunting, hallucinatory tale of loneliness in the big city from Wai.",
            "review_date": "2013-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful, indescribable experience.",
            "review_date": "2013-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Happy Together is a great film that has a story with substance. It's like watching a documentary, where the subject is 'the most dysfunctional Chinese same-sex couple in history.' If you've ever seen the movie 'Taxi Driver' by Martin Scorsese, you'll see that this movie has a similar atmosphere and darkness. The story isn't beautiful, but in the end it felt like I'd seen something beautiful. \n\nYui-Fai (Tony Leung) and Po-Wing (Leslie Cheung) arrive in Argentina to 'start over' with their relationship and take to the road for a holiday. When their relationship drifts apart, they get stuck in Argentina together. They fight, they love, they work, and they struggle to get back on their feet. It's a sad movie, yet you leave feeling happy.\n\nYou see their relationship fall deeper into darkness as they live together in a small apartment for a long period of time. They care about each other sometimes, and despise each other the rest of the time. There's very little narrative, which detracts from a fully emotional connection to the characters and their situations.\n\nHappy Together is gritty, dirty, realistic, and interesting. It gets major points for being daring and original. I don't care which way you spin it, Po did not love Yui-Fai. What they had wasn't love, it was familiarity. They stayed together because that's all they could do, which is why I wouldn't call this a romantic film.\n\nI have a feeling that this story would work better in a novel than it does on film. I put that down to the lack of information we're given about these two men. We don't know much about their thoughts or history.\n\nNothing is apparent, you have to read in between the lines to truly understand them. However, in Happy Together, the whole \"less is more' technique didn't really do any favors to the films overall enjoyablilty.\n\nThe REAL heart and soul came from the friendship between Yui Fai and Chang (Chen Chang). Chang was only a minor character, but for me he made the movie way more enjoyable. His presence gave me something to look forward to, for this movie is full of sadness. He was the light that the film needed.\n\nThe last half hour of the movie really picked up. There was hope and happiness there, and some excellent music and cinematography. I found myself feeling elated, and wanting to find out what happens next. Since the movie left me wanting more (which is a compliment), I'm giving it a solid four stars. It's beautiful, it's real, and it's unforgettable.",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the cinematography, i wish the movie was better but it's just 2 fags pointlessly arguing for almost 2 hours; the charm that held together the previous work of Wong Kar Wai is nowhere to be seen.",
            "review_date": "2013-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Happy Together demonstrates the best that film has to offer: fine acting and creative visuals that offer insights into character that linger long after seeing the film, all with the power to touch the heart. And enough substance to warrant re-watching. ",
            "review_date": "2013-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great film from Wong Kar-Wai. Great style and great acting again by Leung. I think I still prefer Fallen Angels but this is a great movie.",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very deep love story between two very different people. I guess sometimes love is just ain't enough to make a relationship work. I enjoyed it very much though. Great performance by Tony and Leslie.",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Raw & intense, Filled with touching & memorable scenes and ofcourse Doyle's beautiful images",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "â- Do you regret being with me?\n-Damn right I do. I had no regrets until I met you.Now my regrets could kill me. You're trying to put me down? Showing me you're well-off? I don't give a shit. Why did you ask me to come?\"",
            "review_date": "2012-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who needs \"Brokeback Mountain\" when there's \"Happy Together?\" This wasn't my first experience with Wong Kar Wai. More importantly, seeing the film wasn't the first time I considered selling my life and moving to Hong Kong on spec to try to work as his assistant, house painter, or personal fan club leader. His narratives are always simultaneously fantastical and grittily realistic. His character portrayals are achieved with minimal strokes that compel the viewer to fill in the rest just-so and to thus feel the fullness of the decisions/perspectives those characters have. I have never wanted to go to Ushiaia until this film and now I rue the passage of every year that I haven't been. May Wong Kar Wai make as many films as possible. An excellent film to pair with \"Fallen Angels.\"",
            "review_date": "2012-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impressionistic, evocative picture of caustic relationship is beautifully acted, stunningly shot, but meanders in final act.",
            "review_date": "2012-11-04",
            "source": "rt",
            "lang": "en"
        }
    ]
}