{
    "rating": 7.8,
    "release_date": "Invalid",
    "num_reviews": 16,
    "genres": [
        "Hindi"
    ],
    "summary": "Raj and Mita yearn to get Pia, their daughter, educated from a reputed school. When they learn that their background is holding her back, they are willing to go to any lengths to change her fate.",
    "reviews": [
        {
            "content": "A film with a nice balance of humor, heart and story, a definite light hearted must watch film!",
            "review_date": "2022-06-10",
            "source": "rt"
        },
        {
            "content": "Everyone must see it. It shows how our society destroys the main importance of actual education but now a days education is being treated like a business and it's just swallowing the actual talent and many poor peoples are not getting a chance for education for the higher competition of the riches and the marketing strategy of the businessmen. I know education is important but nowadays it's being treated like parents competition and they are pressurizing their kids like anything. This isn't expected. Just leave them like they want to be. Give them freedom and stop business with education. Education is becoming business because of parents like you cause you guys just compete with each other to show wealth and the poor peoples are dying.",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "fresh story \ngreat message in the end\nreflects the reality of today's society..",
            "review_date": "2020-07-05",
            "source": "rt"
        },
        {
            "content": "The story of a common man who is desperately struggling to give his child the best education taking any means possible to accomplish those goals\n        Story flows on how the English language divides our nation into various parts with the English Spoken few makes the elites of them all.Great Story, great comic timing\n    So, if you still haven't watched the movie, don't miss it.",
            "review_date": "2020-05-13",
            "source": "rt"
        },
        {
            "content": "It should be remake in all languages. Exceptional movie!",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "Saket Chaudhary's \"Hindi Medium\" is fun and wholesome because of it's cast- Irrfan Khan is in top form, Saba Qamar is too good and Deepak Dobriyal is entertaining. But the film suffers under the weight of being too \"'lightweight', so much so that the film's first half is hardly afloat. While there's no doubt the film propagates an important message, it'd have been nice to see some more good writing here. Watch it because it's not to be minded, comedy and fun.",
            "review_date": "2020-04-11",
            "source": "rt"
        },
        {
            "content": "\"Hindi Medium\" tackles the education system in India head-on with razor-sharp satire. This is one of those Bollywood movies that get into a social issue but also manages to be entertaining to watch. I liked the movie's premise and it went a direction I did not see coming. I thought the performances were good and there were a few moments were I thought Irrfan Khan was even great. It's a well-intentioned movie that has a lot to say and I would say it is worth checking out for those who enjoy meaningful Indian cinema.",
            "review_date": "2018-12-07",
            "source": "rt"
        },
        {
            "content": "2018-7-1 Don't remember why I put this one in my to-watch list. It was bored at the beginning that I almost left. It's getting better from the middle. Fun and easy to watch.",
            "review_date": "2018-07-03",
            "source": "rt"
        },
        {
            "content": "The movie flatters to deceive. The theme is promising with a brave topic. However, the movie turns too farcical early on and keeps getting worse. The story-writers appeared undecided whether they were scripting a spoofy comedy or a movie with good social messages. In the end, most of the efforts to create scenes to induce laughs turn out tragic and the emotional scenes appear laughable.",
            "review_date": "2018-05-21",
            "source": "rt"
        },
        {
            "content": "Great screenplay. great performances from irrfan khan and deepak dobriyal. addresses a very important and relevant issue in india.\n\nsome gaps: over-dramaticized ending.",
            "review_date": "2018-03-11",
            "source": "rt"
        },
        {
            "content": "Have another glimpse of the heredity of social hierachy in India. ",
            "review_date": "2017-12-20",
            "source": "rt"
        },
        {
            "content": "Great idea and entertaining movie, the ending does drag a bit",
            "review_date": "2017-07-24",
            "source": "rt"
        },
        {
            "content": "The crazy state of Indian schooling is exposed by this film in the most entertaining & relatable way. One of the best scripts put together in Bollywood recently with Irrfan Khan delivering his best work ever! The film is a laugh riot start to end & just perfectly directed. A complete family entertainer.",
            "review_date": "2017-05-22",
            "source": "rt"
        },
        {
            "content": "'Hindi Medium' is a very watchable lighthearted entertainer that uses humor to successfully touch upon a relevant issue.",
            "review_date": "2017-05-21",
            "source": "rt"
        },
        {
            "content": "Irrfan Khan is his usual self with an extremely natural performance that will give laughter as well as emotional jolts to you. All the co-stars complemented Irrfan's performance right upto their little daughter. The storyline is also well weaved. Overall a good watch.",
            "review_date": "2017-05-19",
            "source": "rt"
        },
        {
            "content": "He has done it again. Irfan Khan has single-handedly made sure that Hindi Medium is a good watch. Even in scenes that were not strongly written, he carries them. That is the power of his acting. It does need a bit of editing and there is one song that should have been removed to make the pace of the movie better. Nonetheless Hindi Medium is a movie that needs to be seen. It talks about the education system becoming a business in India and how it is taking the education out of it.",
            "review_date": "2017-05-19",
            "source": "rt"
        }
    ]
}