{
    "rating": 8.3,
    "release_date": "Invalid",
    "num_reviews": 30,
    "genres": [
        "Chinese"
    ],
    "summary": "In this prequel to the original, a rebel policeman sets up the infiltration of Triad gangs and tries bring down a corrupt cop working for the Triad boss.",
    "reviews": [
        {
            "content": "Not as good as the first one. Too confusing to follow.",
            "review_date": "2020-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A prequel that doesn't live up to the original this Thriller is still worth watching.",
            "review_date": "2020-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if I could I would give this movie a 8.25/10.  It is certainly a well put movie, but not a masterpiece like its foremovie. Honestly could be a movie by itself and did not need the first movie to be watched before watching this one. Good music.",
            "review_date": "2014-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One if the darkest films I've seen in a long time...delicously twisted. Hidden gem..not comfortable to watch..but I dare you not to see it through to the end.",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not as good as the first film, Infernal Affairs II takes a tricky concept (a prequel of events from the first film) and still engages with some fantastic acting and a tense story.",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More than worthy companion to its powerhouse predecessor.",
            "review_date": "2013-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twisted. Too many betrayals in the story made it loose it charms. The performances and direction were also not up-to the standard of its predecessor. While still a good movie it just didn't have the intensity of the first one.",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3/5  I watched Infernal Affairs 1 a long time ago and loved it.  I also think it was better than the remake.  I just watched part 2, the prequel, meh, nowhere near as good as part 1.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Francis Ng contributed his best performance, as a gangster.",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a prequel, I'm a little let down. But the focus is on the crime boss and the police chief and their weird relationship. Somehow it works as its own film.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dare I bring up Godfather II references?  This is the best in the series that The Departed was based on and bests the original Infernal Affairs.  The evil boss is a revelation as the \"bad guy\".  If you liked The Departed quickly watch Infernal Affairs I and II and then, just like the Godfather, Aliens, and countless other sequels done too many times pretend that III never happened.",
            "review_date": "2012-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie, mostly for how well it ties in with the first. As a prequel there will undoubtedly be references or aspects alluding to what happens later in the timeline, in the previous movie. In this prequel, these are all very well done, making this one of the best prequel movies I have ever seen. The fact that this movie focuses on the more minor characters from the first one, and more on the overall story than specific people makes this a different film than Infernal Affairs, and a little bit less intriguing because it lacks the same character development than the first one thrived on, but this is still an interesting, exciting film to watch and I recommend it for any and all who have seen the first one.",
            "review_date": "2012-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as perfect as the predecessor, a bit confusing in the middle. Nonetheless, acting and cinematography are top-notch once again.",
            "review_date": "2012-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A strong prequel consisting of the much the same level of quality high tense gang land scenes. The story is a little contrived to fit into the plot of the first but it makes up for this in other aspects.",
            "review_date": "2012-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Take out the 2 young guys (Edison Chan and Shawn Yu) and you have a decent film.",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good bridge from the first to the last part.",
            "review_date": "2012-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as part1",
            "review_date": "2012-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Prequel for Infernal Affairs. Not quite as good. As a matter of fact, I found it much harder to follow. Well done, but the style, and intrigue, that attracted me to the first one was missing in this one. Too bad...",
            "review_date": "2012-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "infernal Affairs Ii plays as an \"internal prequel\", a kind of flashback rarely used for a sequel. The skill required to master this plot is devilish in itself, but on every other level the flick does not delude: amplifying rather than adding to the existing points of view on the story, more Padrino than action flick, it stratifies layer over layer of damnation over the good-intentions paved way, and deepens the already labirintyne texture of the original.",
            "review_date": "2012-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good! As good as the 1st one and it explains a lot about the 1st movie!~",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Set at a slower pace than it's predecessor, this prequel definitely added depth and complexity to the characters and their relations. Don't expect the intricacy and overwhelming turn of events of the first but settle down for a tale led by an innocent looking mastermind.",
            "review_date": "2011-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a particularly captivating film...1hour 49mins? It felt like it dragged on 10 times as much with its over-plot.",
            "review_date": "2011-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As stylish, and a strong prequel in mafia saga.  There's a heavy soundtrack which makes a lot of the drama sequences overbearing.",
            "review_date": "2011-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the second of the 'Infernal Affairs' trilogy, and is a prequel to the events portrayed in the 2002 film Infernal Affairs. Concentrating more on the Triads and the power struggle that ensues when one of their bosses is assassinated. In particular the rise of Hon Sam is portrayed here along with the relationships he develops within the Hong Kong police. More of this later, here's a brief summary first (summary haters, and those that don't wish to know about the plot, please take out another crime boss while I write the next paragraph).\r\n\r\nWhen the main Triad boss, Father Kwun is killed, his son, Ngai Wing Hau takes over the business. The other bosses don't agree at first but soon fall into line when they realise Hau is no pushover. Lower down the pecking-order, Hon Sam is just waiting for the opportunity to move up the ladder. He already has contacts inside the police force, including Inspector Wong Chi Shing, who would dearly love to take him down. Chan Wing Yan is an undercover cop installed in the gang to gain information on their activities. Sam is also grooming a young cop to be his inside man in the Police not realising that this young cop has a serious crush on his wife, Mary. As events progress more and more of the Triad bosses meet grizzly ends and it soon becomes a show-down between Sam, who has survived an attempt on his life in Thailand, and Hau. Will the Police have a say in the outcome though? I'll leave it there so as not to upset the Hong Kong Spoiler Police.\r\n\r\nThis is a pretty well made film with some good performances and quite a nice soundtrack. It is quite violent and some of the violence is quite graphic in places. As I said, good performances, particularly from; Anthony Wong Chau-Sang as Inspector Wong Chi Shing, Eric Tsang who was excellent again as Hon Sam, Carina Lau as Mary Hon, Francis Ng as Ngai Wing Hau, Edison Chen as Officer Lau Kin Ming and Shawn Yue as Chan Wing Yan.\r\n\r\nBecause it concentrates on the workings of the criminal elements, I felt this film was almost trying to be a Chinese version of 'The God Father'. It's clearly not as good as that, but there's enough double-dealing going on to make it a good candidate. I did find it a little too long, but it did keep my attention. Not as good as the first one, but still quite watchable... Recommended.\r\n\r\nMy Score: 7.1/10\r\n\r\nThere are extra bits & pieces (photos, links, trailer and bigger print) on my blog at:\r\nhttp://thoughtsofasteelmonster.blogspot.com/2011/04/film-review-infernal-affairs-ii-2003.html\r\n\r\nEnjoy!... :)",
            "review_date": "2011-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(Watched Thu 31 Mar 2011) Worthy sequel; a bit over-dramatic at times but the pace never drops.",
            "review_date": "2011-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tricky and convoluted at times- this manages to still remain a thrilling viewing experience, an impressive addition to the franchise, and ultimately a beautifully and carefully made movie",
            "review_date": "2011-03-23",
            "source": "rt",
            "lang": "en"
        }
    ]
}