{
    "rating": 2.2,
    "release_date": "Invalid",
    "num_reviews": 150,
    "genres": [
        "Kids&family",
        "Comedy"
    ],
    "summary": "City officials are moving to replace human-robot hybrid Inspector Gadget (French Stewart) with an updated model, the comely G2 (Elaine Hendrix). Like her predecessor, the new inspector must contain master criminal Claw (Tony Martin), who, having busted out of prison, wants to pull off a big gold heist. Young Penny (Caitlin Wachs) also starts shadowing Claw, and soon she forms a crime-fighting trio with her Gadget and G2. Claw had better watch his back.",
    "reviews": [
        {
            "content": "LOL, the funniest 01 hour: and 28 minutes ever!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-12",
            "source": "rt"
        },
        {
            "content": "A film that is much closer to the cartoon, then it previous feature but with a lesser cast. French Stewart is serviceable and the rest of the cast is fun and quirky. Dr. Claw and the rest of mad stand out drawing heavy influence from episode of the cartoon. But gadget and Gang just don't hit. It's a fun and slightly forgettable , watch the cartoon with Don Adams.",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "Eu era tão apaixonada nesse desenho nas minhas manhãs felizes infantis, que delícia, saudosismo puro, entretanto o filme o primeiro filme foi até razoável, esse apesar de ser o mesmo a mesma linha sou tão sonso, chato foi apenas assistível, alteraram o ator protagonista, o que também não ajudou muito, o fofo  Matthew Broderick… Regular para bobinho...",
            "review_date": "2022-12-04",
            "source": "rt"
        },
        {
            "content": "LOL, the funniest 01 hour: and 28 minutes ever!!!!!!!!!!! Starring French Stewart as Inspector Gadget!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-08-05",
            "source": "rt"
        },
        {
            "content": "LOL, funnier than part 1!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-04-27",
            "source": "rt"
        },
        {
            "content": "This is one of the better Disney Direct To DVD movies but not by much but it's harmless entertainment for 88 mins",
            "review_date": "2022-04-26",
            "source": "rt"
        },
        {
            "content": "I love this movie it was what the first movie should have been it was a complete love letter to the series that was enjoyable from start to finish and French Stewart was a picture perfect Gadget he was hilarious and very lovable",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "The first film was a disappointing and mediocre film, but actually was reasonably entertaining. There has been the general impression that the sequel is better than the first film, but I can't agree. Yes, I accept it was more faithful than the brilliant cartoon show, but I still think it was a very poor sequel.\n\nThe script was very very weak, and even lower in laughs than the first film. I liked the idea of Dr Claw escaping from jail, but the pace of this film was way too fast, and lacked energy as well as felt rushed. And the editing was choppy, and the effects substandard.\n\nThe performances were pretty dire. French Stewart proves once again, like he did in the excrement that is Home Alone 4, that he falls well short of the charisma and energy of his character and came across as rather wooden. I didn't like Tony Martin's Dr Claw either. I much preferred Rupert Everett's suave take on the classic villain, and Martin hamming-up came close to embarrassing rather than entertaining. In fact, the only redeeming quality, and this is a slight one, is the talented Caitlin Wachs, who deserved better.\n\nOverall, very poor, don't waste your time. 1/10 Bethany Cox",
            "review_date": "2022-03-24",
            "source": "rt"
        },
        {
            "content": "French Stewart does a decent job at portraying inspector gadget and is infinitely better than Matthew Broderick. However a lack of direction, bad CGI and a terrible screenplay make this  film tough and at times tiring to watch.",
            "review_date": "2022-01-23",
            "source": "rt"
        },
        {
            "content": "The 2003 Disney movie Inspector Gadget 2 was not only a bad movie that ended the live action Inspector Gadget film adaptations but it's misguided as well. Also, when French Stuart was playing Inspector Gadget he has those glitches with his gadgets again and again but it dose not give him an identity. I mean he did OK in the sequel but he's not as good as Mathew Broderick in the first movie. I know it got 21% on Rotten Tomatoes and it did made more money than the second movie but Matthew had a clear character and he competed his mission to stop Scolex and he played not only a great hero and a great villain but he looks like a cartoon character come to life. French seems to have two expressions. Puppy love with G2 and failure to stop Dr. Claw. On top of that not only Mathew played both parts of Inspector Gadget and Robo Gadget but both parts show how fully animated his body could be. With French it always looks like he's restrain by it. Like he's fighting agent it. Every time he's done with a take it looks like he's going to pass out on Caitlin Wachs. I don't necessary blame French for this it's just it wasn't the right casting for the sequel.\nNot only that they also took a look at the first Inspector Gadget movie then they try to apply the same style and humor to a story with characters that wouldn't be compatible with it along with a new cast but ran with it anyway. While the plot dose expand on the Inspector Gadget mythos the characters are all unlikable with how they act and how they preform. Inspector Gadget in this sequel comes off as this stupid and weird character who mugs the camera, the chief yells a lot and Dr. Claw and his gain makes bad jokes like no tomorrow. It's just a recipe for disaster that undermines the point of source material and it doesn't do anything to add to it. On the other hand they didn't use the original cast from the first movie like in most sequels. Though I can imagine how the original cast would be even better in this movie compare to what we did get. French Stewart can be funny depends on who writes for him. But this is not the kind of film he should be taking part in. Other than that this movie did not share the same success as the first Inspector Gadget movie. Not only it didn't went into theaters but it only made $12 million dollars in it's movie making budget and went straight to VHS and DVD. Inspector Gadget on the other hand went into theaters and it made ten times it's box-office budget. So Inspector Gadget 2 was definitely a step back. In all honesty this is a film that's so bad it's unbearable. But I've seen some far worse sequels that doesn't use the original cast from first movies like Kindergarten Cop 2 for example. At best it's just a really bad expansion plot and a bad film over all that should best be forgotten. Better to watch the 1999 Inspector Gadget movie and the 1983 TV cartoon series than watch this sequel.",
            "review_date": "2021-09-11",
            "source": "rt"
        },
        {
            "content": "Felt compelled to write when I saw the low scores. My family had this on continual play for months when my children were young! As a parent it was wonderful to see the brilliant creativity that had gone into crafting this movie! It deserves a much higher score! UNJUST!!!!!",
            "review_date": "2020-11-12",
            "source": "rt"
        },
        {
            "content": "This Inspector Gadget sequel was worse than the first one. French Stewart, Elaine Hendrix, Caitlin Wachs, and the rest of the cast did a terrible job in this movie. The plot to the movie was goofy, ridiculous, and tedious. No wonder this movie was never released in theaters. If you haven't seen this movie yet, don't waste your time. You'll hate it.",
            "review_date": "2020-11-12",
            "source": "rt"
        },
        {
            "content": "Yep, this is terrible. Agreed.\n\nUnlike most, I can say I enjoyed 1999's 'Inspector Gadget'. I didn't like this though. I wasn't necessarily expecting it to be better per se, but I did hear that it's supposedly more faithful to the original television show so I thought there was a possibility it would be, at least, just as good - it isn't.\n\nEverything about 'Inspector Gadget 2' is severely inferior. The cast aren't as noteworthy, there aren't any - even mildly - amusing scenes and the whole vibe of the film is cheap. It even runs for longer, mostly due to it forcing through a hearty narrative with the characters - wholesomeness simply doesn't fit in a production that needs to be 100% silly.\n\nNone of the original cast return, with the exception of D. L. Hughley (Gadgetmobile) - though he is barely in this sequel. Elaine Hendrix ('The Parent Trap') is a decent name/face, her character G2 is possibly the most interesting thing onscreen.\n\n1.5 average rating on Letterboxd, entirely deserved - unlike it's predecessor's score.",
            "review_date": "2020-10-11",
            "source": "rt"
        },
        {
            "content": "43% \"The original cast didn't return to play their respecive roles, overall, it still was a lot of fun\".",
            "review_date": "2020-08-07",
            "source": "rt"
        },
        {
            "content": "this movie is a felonious and unlawful act.",
            "review_date": "2019-12-01",
            "source": "rt"
        },
        {
            "content": "more kooky antics from this cast, but, fun for the family to watch",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "Inspector gadget 2 was kind of okay but it wasn't as good as the first one. French stewart was still good as Gadget. The visual effects were not as realistic in the sequel.",
            "review_date": "2018-08-06",
            "source": "rt"
        },
        {
            "content": "Wait a minute if you think about it Those who like to be a detective and mastery it could be right up your alley",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "Hardly I do not remember this one as well it's been a long time",
            "review_date": "2017-09-05",
            "source": "rt"
        },
        {
            "content": "While the writing is definitely more loyal to the original cartoon this time, the acting still sucks, the characters are still bland and uninteresting, and the special effects are not only horrible, but also incredibly cheesy enough for even LazyTown (which I actually enjoy) to laugh at. I still recommend skipping this one.",
            "review_date": "2017-05-12",
            "source": "rt"
        },
        {
            "content": "The first movie is better than this",
            "review_date": "2017-01-10",
            "source": "rt"
        },
        {
            "content": "Crap! Not that again!",
            "review_date": "2016-11-03",
            "source": "rt"
        },
        {
            "content": "Best film of the 21st century. mind blown. Cured my Osteoporosis. impregnated my wife. 10/10",
            "review_date": "2016-09-01",
            "source": "rt"
        },
        {
            "content": "yo this movie is mad good, who knew? great production design and vibe. reminds me of the delightful french movie Lou! although not as good as that one of course. but this is still quite good. way better than the first one.",
            "review_date": "2016-08-25",
            "source": "rt"
        },
        {
            "content": "Despite it being direct to video, as everyone has stated, it IS more faithful to the bumbling comedy of the original cartoon, which the first movie tried and failed to do. The new actors such as French Stewart are more fitting for the roles and get more chuckles out of the audience than Broderick's bland deliveries and disregard for the cartoon it was based off of.\n\nThere are still some flaws and awkward deliveries, especially with the addition of G2, but is an actually legitimate sequel which is more faithful and funny in comparison, such as having Penny actually contribute something to the plot and Claw case rather than be a side character at best in the first movie.\n\nThat being said, at least it can call itself enjoyably bad instead of just \"bad\", it comes close to being an ok adaptation and will definitely make sure your kids are entertained, at least a little.",
            "review_date": "2015-12-21",
            "source": "rt"
        },
        {
            "content": "waaaaaaaaaaay to cheesy and corny.",
            "review_date": "2015-12-12",
            "source": "rt"
        },
        {
            "content": "Having its cast mainly replaced, the actors are a lot hammier, the comedy is still predictable and the effects do look somewhat cheaper. However some of the writing does follow the cartoon more this time than the first movie and although not everything makes sense it feels more like an extended cartoon episode. So that kind works in its favor.\n\nFor my full review of Inspector Gadget 2 (2003), check it out on this IMDB link: http://www.imdb.com/title/tt0301454/reviews-51",
            "review_date": "2015-11-20",
            "source": "rt"
        },
        {
            "content": "Straight To Video Sequel Was Alright And Did Good For The Budget Given",
            "review_date": "2015-10-16",
            "source": "rt"
        },
        {
            "content": "It works where the first movie fails: It stays true to the original cartoon, and the humor comes from the fact that it is in fact live action actors acting like cartoons, and it knows this. It does what it's wants to, and it, for the most part, works.",
            "review_date": "2015-09-28",
            "source": "rt"
        },
        {
            "content": "This Wasn't That Good.But This Was Better Than The First One.C",
            "review_date": "2014-06-02",
            "source": "rt"
        },
        {
            "content": "had nothing to do with the first and a little too AF touch with reality",
            "review_date": "2014-04-11",
            "source": "rt"
        },
        {
            "content": "More funny than the first movie, Inspector Gadget 2 is a very outrageous live-action movie than the original one.",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "Better than the first!",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "Nostalgia once again clouds my judgement. Just... don't watch this movie. It was hard for me to say it, but yeah, don't watch it.",
            "review_date": "2014-02-05",
            "source": "rt"
        },
        {
            "content": "Childhood favorite! More like a remake instead of a sequel though,this is vastly different than the first,this a lot more colorful and fun",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "It is shit, but at least its more faithful to the source material then that shitty Matthew Broderick flick.",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "If you want to see a good movie involving robots as the central character, stick with The Terminator or Robocop, because this movie doesn't even come close to watchable entertainment. It somehow acts even more stupid than the predecessor.",
            "review_date": "2013-06-07",
            "source": "rt"
        },
        {
            "content": "Eh, not as bad as the first one.",
            "review_date": "2013-05-21",
            "source": "rt"
        },
        {
            "content": "I own this on DVD in a two movie pack along with:\n* Inspector Gadget (1999)",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "Better than the first movie but not by much. It is essentially just a live-action cartoon and not a very good one at that. At least it makes better use of its characters than the first one did and is more faithful to the cartoon show.  Besides those aspects, there is nothing else worth recommending here. Mediocre at best movie.",
            "review_date": "2013-05-15",
            "source": "rt"
        },
        {
            "content": "i love this movie great cast  the crew did a good job  this is a winner  like the first one",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "This sequel is even worse than the first movie, if at all possible. Inspector Gadget rounds up the gang to catch a criminal and prove he is still number one. The whole film seems to be built to be ridiculously childish.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "I like to give lengthy reviews, but the original matthew broderick one was good. This was shit. I dont know why I still have it in my collection.",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "As if the first movie was bad enough, Disney and DiC made a direct-to-home sequel. While it's closer to the cartoon it's based on (like Gadget is bumbling, Penny solving cases, Claw's face is not shown, etc), it's still horrid to sit through. I honestly think it's a bad idea to make a live action movie based on a cartoon I don't think kids watch today.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "No wonder it was straight to DVD, it is an unnecessary sequal to the average Inspector Gadget starring Matthew Broderick in 1999! And that movie was 100 times better than this garbage!",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "Still liked it. Even though the first one was still better.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "Sadly better than the original.\nAnd thats about all I have to say about that.",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "Alright, I'll give the first movie a free pass. It was dumb and stupid alright but kids loved it and that's what matters. I remember seeing this in a cinema and the whole crowd BOOED. Even kids. This isn't even a Gadget film, it's essentially Agent Cody Banks in disguise. Avoid.",
            "review_date": "2012-12-18",
            "source": "rt"
        },
        {
            "content": "why do they try and revive great movies with crap sequels (see pretty much every horror movie ever made!)",
            "review_date": "2012-12-03",
            "source": "rt"
        },
        {
            "content": "Some people may not like it but come on, this movie is like Mission Impossible 4 compared to the awful original! Inspector Gadget 2 is actually pretty funny, has better casting than the original, and is way closer to the cartoon. But the female gadget was just a mistake. Rating: 71%/ Overall: Ok and Good",
            "review_date": "2012-09-28",
            "source": "rt"
        },
        {
            "content": "Bad, just...bad. Grade: F-",
            "review_date": "2012-09-17",
            "source": "rt"
        },
        {
            "content": "and i thought the original was a joke. disney seems to like churning out sequels to 'hit' movies without any sense of direction or any idea what the plot should be. \r\n\r\nall they probably say is \"okay, i want to make a sequel to Mulan, Inspector Gadget so let's get started. dont worry about the script, we'll write it after we finish filming. and i know! We'll add the latest pop music styles into the soundtrack to attract the teenagers! they'll love a Disney straight-to-DVD sequel to a movie who's original was bad anyway if their favourite songs are slapped loudly against the colourful blur of unfunny slapstick and childish action!\"\r\n\r\nThis is the inevitable world of almost every Disney Movie sequel. Now that i've made my long point, Do Not See This Movie.",
            "review_date": "2012-09-12",
            "source": "rt"
        },
        {
            "content": "French stewart  fantastic!",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "not as good as first 1",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "the first one is better",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "THIS is what the first Inspector Gadget movie should've been.",
            "review_date": "2012-07-27",
            "source": "rt"
        },
        {
            "content": "Female gadget, yeah right. Thank goodness it's the end of the bad series of films. French Stewart, I am disappointed.",
            "review_date": "2012-07-12",
            "source": "rt"
        },
        {
            "content": "it wuz ok, but i liked the 1st one better :)",
            "review_date": "2012-06-24",
            "source": "rt"
        },
        {
            "content": "God damn you French Stewart",
            "review_date": "2012-06-17",
            "source": "rt"
        },
        {
            "content": "Don't watch this it's Horrible\nF",
            "review_date": "2012-05-25",
            "source": "rt"
        },
        {
            "content": "First one is still better!",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "Plot: Far worse than the first.\r\nSpecial effects: Bad.\r\nInspector Gadget: Self-absorbed idiot.\r\nInspector Played by French Stewart: Should have been good.\r\nClaw: Horribly done.\r\nCast: just about completely switched around fro the first.  That is very notable.\r\nConnection to the cartoon:  WAY better than the first!\r\nAlso, who is Baxter?  Where's Brenda, Gadget's love?  It may be more enjoyable for kids than the first.  But altogether, it was just a bad movie.",
            "review_date": "2012-04-19",
            "source": "rt"
        },
        {
            "content": "Plot: Far worse than the first.\r\nSpecial effects: Bad.\r\nInspector Gadget: Self-absorbed idiot.\r\nInspector Played by French Stewart: Should have been good.\r\nClaw: Horribly done.\r\nCast: just about completely switched around fro the first.  That is very notable.\r\nConnection to the cartoon:  WAY better than the first!\r\nAlso, who is Baxter?  Where's Brenda, Gadget's love?  It may be more enjoyable for kids than the first.  But altogether, it was just a bad movie.",
            "review_date": "2012-04-19",
            "source": "rt"
        },
        {
            "content": "Awesome movie. Will there be any sequel to it, like an Inspector Gadget 3?",
            "review_date": "2012-02-28",
            "source": "rt"
        },
        {
            "content": "HEY THIS ONE STICKS MORE TO THE CARTOON THAN THAT GOD HORRIBLE MATTHEW BRODERICK MOVIE.",
            "review_date": "2012-02-19",
            "source": "rt"
        },
        {
            "content": "A terrible screenplay,  overly colorful and ugly CG,  bad comedy,  and absolutely not Inspector Gadget.",
            "review_date": "2012-02-03",
            "source": "rt"
        },
        {
            "content": "Not nearly as good as the original",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "It's like little kids took some crayons and scribbled all over the movie.",
            "review_date": "2012-01-21",
            "source": "rt"
        },
        {
            "content": "The first one was atleast 100 times better this movie is trulie awful",
            "review_date": "2012-01-21",
            "source": "rt"
        },
        {
            "content": "inspector Gadget 2 is one of the best movies ever",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "better than the first piece of crap that came out but still not that good.",
            "review_date": "2011-12-28",
            "source": "rt"
        },
        {
            "content": "BAD BAD BAD BAD BAD BAD BAD",
            "review_date": "2011-11-11",
            "source": "rt"
        },
        {
            "content": "I have to say French Stewart fit the role of Gadget the best, They should have cast him in the First one instead of Matthew Broderick aka Farris Buller.",
            "review_date": "2011-11-01",
            "source": "rt"
        },
        {
            "content": "This is stupid. Anybody who thinks this is good is wrong and idiotic. Whoever could possibly think that this piece of crap has some potential should have their brain opened, roasted, and then eaten.",
            "review_date": "2011-10-26",
            "source": "rt"
        },
        {
            "content": "Having Tony martain has Dr Claw really was an improvement, also its a  camp appeial to the cartoon series.",
            "review_date": "2011-10-25",
            "source": "rt"
        },
        {
            "content": "Shouldn't have been made",
            "review_date": "2011-08-16",
            "source": "rt"
        },
        {
            "content": "This movie is the epitome of suck.  Bad as could be.  Worse than worse. Horribler than horrible.  Possibly my least fave movie ever (at least, one of them).",
            "review_date": "2011-08-06",
            "source": "rt"
        },
        {
            "content": "My ex boyfriends nickname for his...",
            "review_date": "2011-06-28",
            "source": "rt"
        },
        {
            "content": "I have nothing good to say about this movie. I really enjoyed the first movie, thinking Matthew Broderick brought the right amount of seriousness to the role in order to make the character \"believable.\" French Stewart is NO Matthew Broderick. His over the top portrayal ruined this film from the outset. The acting from the others is nothing to write home about either. Claw was pathetic. The storyline was cliched, and I did not see the need to animate the car. All that being said... my 10 year old enjoyed it, but my 7 year old had no interest in it even though she adored the original.",
            "review_date": "2011-06-18",
            "source": "rt"
        },
        {
            "content": "A much better film than the original.",
            "review_date": "2011-06-05",
            "source": "rt"
        },
        {
            "content": "Haha. Matthew Broderick didn't even return for this straight-to-DVD kid's crap.",
            "review_date": "2011-06-04",
            "source": "rt"
        },
        {
            "content": ".....NOOOOO!!! I loved the original; what the heck happened?! I don't get it: the original was nothing like the TV show, but it was awesome. This one is exactly like the TV show, but it's terrible. The TV show was good, but this isn't. Plus, Gadget (who is technically human) falls in love with a robot...it's creepy and weird.",
            "review_date": "2011-05-26",
            "source": "rt"
        },
        {
            "content": "Inspector Gadget 2 is the sequel to the 1999 Inspector Gadget movie. This one went straight to DVD and if you actually watch the movie, you'll know why. IG2 supposedly picks up a few years after the first movie though, you wouldn't even know it. This movie moves in a completely different direction that it's hard to imagine it's a sequel. The tone of the movie has become more light-hearted and campy. Inspector Gadget is once again a clueless idiot who can't control his now glitched-ridden gadgets, Dr. Claw's face is never seen and his voice is rapsy, Penny and the dog Brain do most of the actual work although Penny does become a damsel in distress toward the end. Basically, this movie is much closer to the tv show. Infact, it feels like your actually watching a Live-Action version of the show with some elements incoporated from the first movie. Even some of Claw's henchmen from various episodes of the show appear in this movie. Along with the change in tone, there is also a change in the cast. NONE of the original actors and actresses come back for this movie with the exception of D.L. Hughley who returns to voice the GadgetMobile. A couple of new characters are introduced such as Baxter, played by Bruce Spence who seems to be a scientist of sorts and friend of Gadget's, and G2 played by Elaine Hendrix who is basically a female version of Gadget and is intended to become his replacement. She also becomes Gadget's new love interest. There is no explanation as to what happened to Brenda from the first movie. As I said, it's hard to imagine that this is a sequel. It looks and feels like a completely different movie and it might as well be. It proves that what works in animation, doesn't necessarily work on film. All in all,  It's a good movie to throw on for the kids but otherwise, I wouldn't bother with IG2.",
            "review_date": "2011-05-26",
            "source": "rt"
        },
        {
            "content": "It was good, but did not have the same feel as the first and the old actor was better, however this movie did have pretty decent comedy and was closer the the animated series then the first",
            "review_date": "2011-05-19",
            "source": "rt"
        },
        {
            "content": "surprisingly better than the first, but nothing special",
            "review_date": "2011-04-02",
            "source": "rt"
        },
        {
            "content": "French Stewart is brilliantly cast as bumbling Inspector Gadget in the sequel that tries to correct the style of the previous movie. A great movie for fans of the show.",
            "review_date": "2011-03-22",
            "source": "rt"
        },
        {
            "content": "ahh not bad but really kind of dumb i really liked the 1st 1 better",
            "review_date": "2010-11-19",
            "source": "rt"
        },
        {
            "content": "better than the first piece of crap that came out but still not that good.",
            "review_date": "2010-11-05",
            "source": "rt"
        },
        {
            "content": "I didn't think this film was that bad. In fact, I think it's better than the Matthew Broderick version. French Stewart I think did a better job that Broderick and this brought back the charm of the television show, but unfortunately never truly compelled me.",
            "review_date": "2010-10-14",
            "source": "rt"
        },
        {
            "content": "Kids will enjoy the slime and wrongful arrests.",
            "review_date": "2010-08-24",
            "source": "rt"
        },
        {
            "content": "A sequel to an already bad film.  French Stewart is a horrible replacement for Matthew Broderick.",
            "review_date": "2010-08-07",
            "source": "rt"
        },
        {
            "content": "it's a real step down from its predecessor\r\nmore aimed at the pre-teen to toddler crowd\r\nthe special effects are half-decent too\r\nFrench Stewart doesnt feel like he should fit the role but G2 by Elaine Hendrix does just fine\r\nPenny gets a more active role this time around which is an improvement\r\nthe whole film is just too hokey and cartoonish though\r\nur kids will get more enjoyment out of it but it does remain faithful to the TV show more than anything",
            "review_date": "2010-07-29",
            "source": "rt"
        },
        {
            "content": "I don't like to stereotype, but this is your typical factory kids movie.  Not a ton of plot, and this one didn't catch me as that enjoyable.  Not horrible, just rather average.  I liked the plot between the two Gadgets, but the mix of unrealistic plot ideas (not believing Penny still, and kicking Gadget back off) and the humor just seemed a bit annoying to me.  Overly slapstick without the followthrough good humor.",
            "review_date": "2010-07-26",
            "source": "rt"
        },
        {
            "content": "Not as good as the first one, The female inspector and the love story did not seem to fit the idea of Inspector Gadget, and it didnt seem consistiant with the first movie, but overall it was okay",
            "review_date": "2010-07-02",
            "source": "rt"
        },
        {
            "content": "I think this film should be used as a replacement and upgrade from the sleeping pill. Great for kids...but adults...it will put you to sleep!!!",
            "review_date": "2010-04-20",
            "source": "rt"
        },
        {
            "content": "a completely different style to the first film. this one is very much more for smaller kids and was why i didn't really like it.",
            "review_date": "2010-03-29",
            "source": "rt"
        },
        {
            "content": "Mattew Bodrick was better even thoo he does annoy me",
            "review_date": "2010-03-20",
            "source": "rt"
        },
        {
            "content": "more corny than the orginal why a sequel in the first palce I know straight to video well this one should of never been made neither should've the first one the cartoon is so much better",
            "review_date": "2010-02-22",
            "source": "rt"
        },
        {
            "content": "Really corny, terrible acting, awful story, and bad directing. Terrible movie.",
            "review_date": "2010-02-20",
            "source": "rt"
        },
        {
            "content": "OMG...Wasn't the first one enough?  I can't believe I watched either one of them...\"",
            "review_date": "2010-01-28",
            "source": "rt"
        },
        {
            "content": "I'm sorry, but I have no idea how this was able to pass as a sequel, because the logic behind everything in this film makes no sense. Each and every cast member acts completely different than they did in the first film, and although the first movie was not very good, this fails upon everything the first one did correctly. By not showing Claw's face, they stay true to the television show, but everything else has nothing to do with it and is all very silly and made up. The writing is atrocious, the film is very unfunny, and the visual effects are disgusting. \"Inspector Gadget 2\" is one of the worst films I've seen!",
            "review_date": "2010-01-27",
            "source": "rt"
        },
        {
            "content": "I can't believe that I thought that the first installment was lame. Don't believe that it can't get any worse, because it can.",
            "review_date": "2009-12-28",
            "source": "rt"
        },
        {
            "content": "NO. Way too much like the old cartoon, and the romance with an android is rather awkward.",
            "review_date": "2009-12-02",
            "source": "rt"
        },
        {
            "content": "Even though the film follows more to the original 1980's cartoon, the differences from this movie and the original 1999 \"Inspector Gadget\" overshadow it to much and cause this movie to be resistible.",
            "review_date": "2009-11-23",
            "source": "rt"
        },
        {
            "content": "A much improvement on the original",
            "review_date": "2009-11-01",
            "source": "rt"
        },
        {
            "content": "Inspector Gadget 2 fails even harder than the first one. Even though I think French Stewart plays a good Inspector, and the plot is pretty good, everything else is pure Disney direct-to-video awfulness.",
            "review_date": "2009-10-10",
            "source": "rt"
        },
        {
            "content": "Super movie!!Better than the 1st, which seemed too adult and unfaithful to the TV show.",
            "review_date": "2009-10-02",
            "source": "rt"
        },
        {
            "content": "oh my dear, this is an insult to the good inspector gadget",
            "review_date": "2009-09-27",
            "source": "rt"
        },
        {
            "content": "Nothing to spechial here.This movie is just another forgettable kids movie.You will see it and forget about it.",
            "review_date": "2009-09-21",
            "source": "rt"
        },
        {
            "content": "Inspector Gadget 2 doesn't deserve a review, especially considering how much it is insulting the classic TV series of the Titular character. No amount of decent acting can save Inspector Gadget 2 from its horrible humour and completely boring plot. I loved Inspector Gadget as a child, and it serves as an incredible insult to me and any other fan of the robot Inspector.",
            "review_date": "2009-09-20",
            "source": "rt"
        },
        {
            "content": "Mucho menos divertido con mas hoyos en la historia comparado al original lo unico bueno y salvable de la pelicula es la reaparicion del Gadget movil que le da mas gracia de ahi en fuera nada",
            "review_date": "2009-08-06",
            "source": "rt"
        },
        {
            "content": "First one is still better!",
            "review_date": "2009-07-22",
            "source": "rt"
        },
        {
            "content": "La primera parte fue mala pero esta vino a confirmar que aun se pueden hacer cosas peores",
            "review_date": "2009-07-10",
            "source": "rt"
        },
        {
            "content": "Awful stuff, I'm sorry but French Stewart has absolutely no range whatsoever",
            "review_date": "2009-06-11",
            "source": "rt"
        },
        {
            "content": "wasnt as good as the 1st one but still good",
            "review_date": "2009-05-17",
            "source": "rt"
        },
        {
            "content": "Awful movie. So bad that the people making it couldn't even get the actors from the original movie to reprise there roles! French Stewart made an awful Inspector Gadget. The hole G2 or whatever she is supposed to be was just ridiculous. And now the dog talks. Are you serious??!! And another thing about this movie is you don't even see that Claw guys face only his claw hand. Wow how retarded is that. Maybe cause this movie is so bad that they were to embarrassed to show the audience that they suck so bad at making movies that they couldn't even get the guy who played that Claw guy in the original 1999 movie and instead they got a really crappy guy to replace him. This movie is a embarrassment. Stewart doesn't even try at this movie. And neither does anybody else who made this craptastic movie. The special effects were cheap. Only the young audience from ages 4-10 will like this awful movie. That's because kid's at that age don't have enough brain cells to know what movies are good like The Dark Knight and what movies are bad like this. Even I used to like this crappy movie when I was little but now since I grew up my taste in movies got better. If your an adult who saw this film and liked it you must have no brain cells at all and you must be a complete idiot. One of the worst movies ever made in the history of man kind.",
            "review_date": "2009-04-26",
            "source": "rt"
        },
        {
            "content": "A closer adaptation to the cartoon, and does a superior job at hding what The Claw looks like.",
            "review_date": "2009-04-03",
            "source": "rt"
        },
        {
            "content": "Worst hero movie ever",
            "review_date": "2009-03-28",
            "source": "rt"
        },
        {
            "content": "Man, this movie was worse than the reviews (and the reviews were really bad). I thought that the first was bad enough, but when I saw this I was shocked. I can't even believe that someone could make a movie this bad, I mean I could probably make a better movie with a camera about shoelaces. This movie was a big waste of time and I sooooooo regret watching it. If only I could give it 0 out of 10. Good thing Matthew Broderick didn't sign up for this movie cause then he would be completely humiliated and considered a bad actor. The only reason I rented this movie was to see if it was worse than the first, which sucked. Anyways, I don't recommend this movie to anyone unless you're a 3 - year old idiot who eats his snot.",
            "review_date": "2009-03-27",
            "source": "rt"
        },
        {
            "content": "I liked this one, it felt more like the cartoon than the first film. Predictable, yes, but it's a Disney movie, they really can't go outside of the whole happy ending thing.",
            "review_date": "2009-03-22",
            "source": "rt"
        },
        {
            "content": "I thought the first one was better.",
            "review_date": "2009-03-03",
            "source": "rt"
        },
        {
            "content": "Cheesy, horrible, definetly not funny at all. Stay away from this garbage.",
            "review_date": "2009-03-02",
            "source": "rt"
        },
        {
            "content": "it`s even wors than the first one!!!",
            "review_date": "2009-02-23",
            "source": "rt"
        },
        {
            "content": "I began it and there was no way I was going to finish it. Lame, lame, lame.",
            "review_date": "2009-01-08",
            "source": "rt"
        },
        {
            "content": "I absolutly agree, this was the 2nd worst movie I have ever seen, 2nd only to \"You Dont Mess With the Zohan.\" It didnt have the same cast and that is what killed it, because it was all down hill from there.",
            "review_date": "2009-01-02",
            "source": "rt"
        },
        {
            "content": "no conseguÃ­ durar 15 min",
            "review_date": "2008-12-29",
            "source": "rt"
        },
        {
            "content": "I have to admitt I didn't follow very well the movie, cause I was here in the same time.\n\nBut anyway, that's a character that I love since I was a child, watching the cartoon series on TV.\nIt's amazing all the gadgets he has in a normal size body. Lol\n\nIntroducing a new model, who seems way better than him made me think to Terminator 2 and 3, Robocop 3 or 4, and some others.\n\nThe special effects seems cheap sometimes. For example when the ropes wind itself around people, it's not very well done.\n\nSome funny ideas made anyways this sequel be a not bad moment of watching; even if, - like for the 1st -, I can say that Inspector Gadget deserves better movies. With all those gadgets, we can imagine for him so better stories...",
            "review_date": "2008-12-20",
            "source": "rt"
        },
        {
            "content": ":fresh: [CENTER]I really do admit that this is better than the first one. It has a lot of better humor in it.[/CENTER]",
            "review_date": "2008-12-19",
            "source": "rt"
        },
        {
            "content": "Really French Stewart? You know better.",
            "review_date": "2008-12-13",
            "source": "rt"
        },
        {
            "content": "divertida , llena de aparatitos a los chikos les encanta",
            "review_date": "2008-12-13",
            "source": "rt"
        },
        {
            "content": "I liked Inspector Gadget 2 almost as much as I liked the first one. While not quite as funny as the first, this movie is still a fun movie to watch that the entire family can enjoy together. I gave this movie 4 stars because it's a fun movie that is good entertainment. Unfortunately, it does take away from the Inspector Gadget cartoon that I loved growing up, which I had so hoped the movie series would be based on. It seems like this movie had a bit less to it then the first one, I think it's safe to say that this is one Disney series that a third film will not be made in.",
            "review_date": "2008-11-30",
            "source": "rt"
        },
        {
            "content": "Who thought of making a sequal without all the actors who made the first great?  Mathew Brodric though not the perfect choice, was still the best choice for the sequal especially after who they picked instead. This movie just sucks.",
            "review_date": "2008-10-31",
            "source": "rt"
        },
        {
            "content": "This movie is a thumbs down.",
            "review_date": "2008-10-13",
            "source": "rt"
        },
        {
            "content": "Tries to make the film similar to its animated show but ends up creating a film which is more disappointing than the original. The CGI effects are terrible, many plot holes from the first film are unanswered and French Stewart fails to capture the same quality performance that Broderick achieved as Gadget.",
            "review_date": "2008-08-29",
            "source": "rt"
        },
        {
            "content": "When Dr. Claw (Tony Martin) escapes from prison, It's up to Gadget (French Stewart) and a new ally called G2 (Elaine Hendrix) to capture claw and put a stop to his evil plans once and for all.\n\nalso stars Mark Mitchell, Bruce Spence, Sigrid Thornton, Caitlin Wachs and D. L. Hughley.",
            "review_date": "2008-08-28",
            "source": "rt"
        },
        {
            "content": "I feel bad for French Stewart. He only gets parts in sequels, and because of this, no matter how hard he tries, he can't seem to ever get a decent break. He's not a bad actor, he is a rather good gadget, but hes not the same character as Broderick was, and it shows.",
            "review_date": "2008-08-27",
            "source": "rt"
        },
        {
            "content": "Not as good as the first.",
            "review_date": "2008-08-07",
            "source": "rt"
        },
        {
            "content": "There’s nothing wrong with the casting—French Stewart pulls off Gadget well even if he lacks the sharpness of Don Adams’s voice—but the pace of this sequel is so arduous that I wonder even if children will be entertained. Cheaper Australian ﬁlming and the usual Disney “aw” factor mean that this is a charmless movie.",
            "review_date": "2008-07-19",
            "source": "rt"
        },
        {
            "content": "I found this to be an entertainng movie, French Stewart is very well suited to the roll.",
            "review_date": "2008-07-19",
            "source": "rt"
        },
        {
            "content": "it should be called inspector trash-it why did i ever watch it",
            "review_date": "2008-06-16",
            "source": "rt"
        },
        {
            "content": "Un carnaval de situaciones ridiÂ­culas de esas que te dan ganas de mirar para otro lado de la pura verguenza ajena. Un inspector Gadget mas caricaturizado que la misma caricatura en la que se inspira. Una trama que hasta un crio con deficit atencional resuelve... Â¿para que sigo? \r\n Le doy una estrella porque la Gadget mujer igual estaba wena.",
            "review_date": "2008-06-03",
            "source": "rt"
        },
        {
            "content": ":rotten: Okay. The first one was just junk and they decided to make an even more terrible movie. Well, I will give it to them since to the first movie might have made some money, but that is not a justication to make an even worse fill of junk. Well, you know pretty much tell a movie is bad when it comes directly to DVD and it doesn't even contain the same cast from the previous film. I hope that an Inspector Gadget 3 isn't in the works unless they reboot the whole movie fanchise with better actor and a much better plot/script.",
            "review_date": "2008-05-20",
            "source": "rt"
        },
        {
            "content": "I like this one better than the first.",
            "review_date": "2008-05-04",
            "source": "rt"
        },
        {
            "content": "Holy crap this film was stupid and pointless",
            "review_date": "2008-03-26",
            "source": "rt"
        },
        {
            "content": "Ah gosh! This was so pointless and stupid! Why the crud did they even bother with this? None of the original actors, and a pretty cruddy plot and special effects. The only person I recognized was the guy from Mad Max.",
            "review_date": "2008-03-17",
            "source": "rt"
        },
        {
            "content": "Really good reminds me of being little.",
            "review_date": "2008-03-17",
            "source": "rt"
        },
        {
            "content": "It's weird and a bit stupid!! NO way as good as the first movie!!",
            "review_date": "2008-02-26",
            "source": "rt"
        },
        {
            "content": "I love this movie I think the way it was done was awesome.",
            "review_date": "2008-02-22",
            "source": "rt"
        },
        {
            "content": "no where near as good as the first",
            "review_date": "2008-01-24",
            "source": "rt"
        },
        {
            "content": "So bad it becomes amost... fascinating...",
            "review_date": "2007-12-27",
            "source": "rt"
        }
    ]
}