{
    "rating": 9.3,
    "release_date": "Invalid",
    "num_reviews": 150,
    "genres": [
        "Russian"
    ],
    "summary": "When Nazi invaders destroy his Russian village and kill his family, 12-year-old Ivan (Kolya Burlyayev) is placed in a German prison camp. Ivan escapes from the camp and crosses back over to Russia, and comes under the care of Capt. Kholin (Valentin Zubkov), who wants to send Ivan to military school. Ivan refuses, requesting that he be allowed to use his powers of stealth to return to Germany to spy on the Nazis and avenge the killing of his family.",
    "reviews": [
        {
            "content": "This film was quite good 👍🏼",
            "review_date": "2022-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully filmed masterpiece with stunning cinematography and a great story with powerful performances, make this a wonderful work to behold. The debut film from Andrei Tarkovsky is a real gem and was a true moment of arrival for Tarkovsky in the world of cinema.  He would go on to make many masterpieces that are towering works of art!  This a simple story of childhood in wartime, is deeply moving and powerful.  It's so universal in it's telling of the human condition and specifically how war ravages everyone and the devastating impacts on children.",
            "review_date": "2022-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alright, this was my introduction to Tarkovsky. I see the greatness in direction and photography, the crazy camera angles and transitions, the shots that are never banal in exploiting depth and shadows, the masterful use of dreams and sounds to tell more than you can see, the great B/W that fits perfectly the muddy environment. I get it.\nBut I would never rate this movie as awesome. First, the story is quite incoherent, secondly, too many segments are just rambling with incomprehensible symbolism. Every sequence involving Masha doesn't make any sense, the well sequence too, and the apples on the carriage... If you show me something it has to be functional to the movie. If I don't get it even on a second viewing, you fail as a director (of course for me, a random guy leaving reviews on RT; I'm sure that Tarkovsky's memory will remain unscathed and movie junkies will continue to get off with this one).\nStill, I recommend this movie for its historical value: doing this in '62's USSR is quite remarkable.",
            "review_date": "2022-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky's first feature film sidesteps the active, 'hot' parts of warfare to emphasize the chilling moments of quiet between the bullets when the mind starts to wander. The director implements the dreamlike atmosphere that would become his most prominent trademark in later years to present a jagged and fractured narrative in emulation of his protagonist's psyche, caught between the happy memories of his earlier years and the cruel vengeances that he now doggedly seeks as a front-line scout; in the warmer years of the Khrushchev Thaw, Ivan is now a victim of a larger conflict fighting with venom as his fuel, rather than a dogged youth who overcomes adversity through the hot-blooded beating heart of communism in his chest. \n\nDevastating and tragic without being in the least bit superficially violent, Ivan's Childhood is simultaneously dirty and beautifully shot even though it lacks anything in the way of grand tracking shots, with Tarkovsky's cinematography conveying an almost alien nature to the landscape in his efforts to display a world of conflict that molds and reshapes the innocent mind into something far more warped and irredeemable. One of the most accomplished feature directorial debuts of all time, with elements that would continued to be refined in Tarkovsky's later masterpieces. (4/5)",
            "review_date": "2022-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My second favorite film of all time, and I'm a 52-year-old movie junkie.",
            "review_date": "2022-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Other than Orson Welles' Citizen Kane, it's difficult to think of a more accomplished directorial debut than Andrei Tarkovsky's Ivan's Childhood.  Set on the Russian front during World War 2 as the German army advances, a young Russian boy seeks revenge for the killing of his family by conducting reconnaissance work for the Russian army.  Other than a handful of POV shots that feel out of place, Tarkovsky shows his mastery of composition with a steady stream of beautifully framed shots of the theater of war mixed with sometimes surreal flashbacks of Ivan's childhood.  It's a beautiful film that foreshadowed the greatness of what was to come from Tarkovsky.",
            "review_date": "2021-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andrei Tarkovsky's feature directorial debut is very straightforward and lightweight in comparison to his later work. However, this World War II drama is brutal and haunting in its depiction of the casualties of the war, and rewarding and engrossing in its depiction of human relationships, and it features some of the distinctive directorial traits that would define his career in the years to come, like beautiful cinematography, ambitious storytelling, poetic visuals, cruel and dark atmosphere, and a deep exploration of humanity and religious beliefs.",
            "review_date": "2021-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie, while it never should be entertaining, did not keep my attention. Schindler's list, while a much less subtle film, kept my attention. This did not. I typically really like visual poetry and symbolism - Eraserhead is my favorite movie - but this film came off very vague and at the points I did understand it, quite sexist. All in all it was hard to make heads or tails of this movie. The cinematography was great though.",
            "review_date": "2021-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Ivan's Childhood' is arguably the harbinger of Tarkowski's greatness, his first long feature, the one that announced what a long lasting impact he will have on the world of cinema. Evidently much more structurally disheveled than it could have been, the film lacks discipline with Tarkowski's overreliance on beautiful, effective, albeit sometimes misplaced dream sequences.\n\nHowever, the gravity instilled in each and every shot is perfect for moody war filmmaking, the heavily nuanced characters develop fascinating dynamics amongst them and the ending being absolutely haunting is an understatement.\n\nMoreover, 'Ivan's Chilhood', the first good glimpse into what some call one of Europe's most engrossing cinematic minds, is a technical achievement as much as it as emotional and obligatory watch. One cannot help but wonder what this film would have looked like without any political restrictions. Maybe more thoroughly polished and shinier, but perhaps not as effectively heart-breaking.",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ivan's Childhood was directed by Andrei Tarkovsky and was released in 1962.  This film centers around the life of an orphaned child solider during World War II, from the perspective of his reality verses his dreams.\n What makes this movie worth watching is the stunning performance given by the main character Ivan (Nikolai Burlyaev).  He snatches your attention from the beginning of his performance until the end. The acting in this film is un parallel.  Ivan's character takes up his whole space in his scenes and he gives a strong, and unforgettable performance.  He clearly stands out from the rest of the cast, making the adults in the film seem like amateurs.  Seeing a child, while equally seeing what seems like a seasoned and capable solider is an amazing experience.  A scene that stands out, is when Ivan is running on the beach.  There is no dialogue in this particular scene but Tarkovsky uses a rear camera angle and light to convey a sense of freedom for Ivan.  Seeing him running through the sparkling water, unburdened by the world as a child should be really draws in the viewer and makes you long for a carefree life for Ivan as much as he did\nOne element that could have made this film stronger would be to give a little more backstory on some of the characters.  You see the dynamics change with each person Ivan interacts with and it would have been helpful to the film to get a deeper understanding of how those bonds were formed.\n.  History enthusiast, especially those who have studied the impact of World War two in Europe, would really enjoy this film. If you are very sensitive to children's issues or the ravages of war, I wouldn't recommend watching this film.  Certain parts of this film, especially the end, are very raw and graphic.  You get a real look at what is means to be in the middle of a war-torn country and how no one is spared, not even the children.  The horror of having children act as soldiers is a reality that thankfully most of us are removed from, but this film brings in front and center.  Overall, this is an amazing film.  It has somewhat of a surprise ending, but the journey through the film is well worth is.  \nThe director's use of lighting, shapes, symbols, and setting adds an entire cast of \"silent actors\" to the film, adding as much depth to the film as the actors.  This film is artistic and impactful as would be a great pick to watch. I would give this film 4.5 out of 5 stars!",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A child with a dark past and a lust for vengeance, a soldier haunted by the scars of war, eerie dreams and flashbacks that ring with insanity: all of this and more awaits you in Tarkovsky's acclaimed work, Ivan's Childhood. Produced in 1962, this film is an intense experience that will likely leave you feeling… unfulfilled. If you like happy endings, stay as far from this film as you can.\n\tWhat makes this film fantastic is the feeling that at any moment, something could go wrong. When there is music playing, it's tense. When the characters are flirting, there's an eerie electricity that can't quite be explained. When a character experiences a flashback, there's always an unnerving sensation that the scene will suddenly become dangerous. The brilliance of Tarkovsky's direction comes in his decision to combine the seemingly harmless dream world with the destructive reality of war, thereby creating a constant feeling of chaos. For example, in the scene where the nurse (Masha) is flirted with by a Captain (Captain Kholin), Masha seems always on the edge of running away. When he kisses her, it's an uncomfortable moment, and the scene right after is of her walking aimlessly through a dark wood. There is always a feeling of unrest.\nThough the film is a powerhouse of cinema, its weak points come in the form of its complication. In other words, it's not an easy watch. Unless you're aware of the fact that you're watching an in-depth art piece of a film, you may find yourself scratching your head at the intensity of it all. While this does not take away from the beauty of the film, it does narrow its audience to those who will appreciate its meaning. One of the audiences who may not appreciate it would be, for example, small children, though if you enjoy taking your children to Russian war films by all means take them to see this one as well.\nOverall judgment of the film? It is astounding. The tone of the movie is fascinating and it's hard not to get wrapped up in the peril of Tarkovsky's directing. I would gladly give it 4.5 out of 5 stars.",
            "review_date": "2020-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky is a real genius of film making. This was the only Tarkovsky movie I have not seen, as well as it was his shortest. I am amazed by how he has put so much meaning in just a 1 and a half hour movie. Well established characters, great narrative and plot. After the first 10 minutes you are very interested in how everything will go and what to expect, as you can not predict anything. The camera angles in this movie is the real gem, as the operator puts them in interesting positions, uses zoom the right way and makes perfect running scenes. This movie is very realistic and shows WWII just how it is, not as good as \"Come and See\", but pretty well! The explosions, the people, the slightest detail, most interesting of which were hairy armpits of Ivan's mother, as usually women tended to shave them for movies, they are not here, as this is just how it would have been in real life, people didn't have time for things such as that, christian people. This is one of the best WWII movies I have ever seen, as it is very creative and unique, I have not seen anybody else do something even close to this picture and it is all because of Tarkovsky. A real must-see and a 10/10 without any doubt. For such time, with that amount of time and with that small cast a movie like that is truly amazing. Don't waste your time thinking about whether to watch it or not, every single Tarkovsky movie is a masterpiece and this one is not an exclusion.",
            "review_date": "2020-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another masterful work by Tarkovsky. The ending scene is simply hypnotizing.",
            "review_date": "2020-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even in the first films of Tarkovsky you can see his emerging style and a great attention to details. Beautifully shot.\nThe film stands out from the most of WW2 films made in Soviet Union, which were usually easier to digest and more propaganda-like, showing only the best qualities of the soldiers, leaving all the bad things happening at war behind the camera. That's what Tarkovsky's film is opposite to.",
            "review_date": "2019-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the films that you know is â~important' when going in and the fact that it is Russian and concerns a lot of men in the military served to further alienate me. Watching the film I found it remarkably easy to connect with as it never tries to be bigger than the story of three different men, or boy in one case, and their struggles during a few days in the war. Tarkovsky seems to understand how to challenge the idea of war without devolving into rambling monologues or painfully self righteous dialogue instead he gives us flawed but simple characters who have human concerns. I would recommend this to people because it manages to convey a simple idea well and for an art-house classic it's accessible and short.\n\nIvan Bondarev, Nikolai Burlyayev, swims to a military post where he meets Lieutenant Galtsev, Evgeny Zharikov, who is initially resistant to accepting him. Lieutenant Colonel Gryaznov, Nikolai Grinko, is Galtsev's superior and he urges him to accept and protect Ivan. It is quickly revealed that Ivan's family was murdered by German soldiers and he was able to escape. A love triangle develops between Galtsev, local nurse Masha, Valentina Malyavina, and his direct superior Kholin, Valentin Zubkov. Ivan is determined to get revenge for the murder of his family members but will come to a tragic end. Throughout we see flashbacks to Ivan's life on the beach and his loving mother running ahead of him.\n\nThe most affecting moments for me were the flashbacks as we see him remember the warmth and comfort that came with his mother. The final scene in the film is a flashback of sorts as we understand that Ivan has been hanged, we see his head spinning, the contrasting of this with his memory of a day in which he and his mother ran, carefree, down a beach was utterly depressing. The idea of clinging to family is relatable to all audiences and the sharp divisions between the joy he felt as a child and the pain and fear he faces as he forced to become an adult due to the war.\n\nThe dialogue is sparing and well used as it conveys subtle details like the fact that Galtsev is attracted to Masha without directly saying it. Ivan's attempts to convince those around him that he is capable of taking down those who murdered his family are obviously in vain but screenwriter Vladmir Bogomolov captures the speaking style of a twelve year old well. The tone of the film is remarkably breezy while not turning away from the harshness of war and it manages to tell the smaller stories of the characters' lives without becoming too caught up in them or not developing them enough.\n\nThe cinematography is impressive as Vadim Yusov, who would go on to work with Tarkovsky several more times, uses moody black and white to display just how hard life in Russia was at that time. The flashbacks are always shown as sunny as there is a brightness and a softness to the shots of the beach that are completely different to the harsh angles and lines of the military outpost. All of this seems obvious but it is an obvious visual cue done well which causes it to have more effect than if the film had a complex and hard to understand visuals. The score is also minimal, Vyacheslav Ovchinnikov manages to illustrate the points that Tarkovsky attempts to make with each scene and never calls out a moment with excessively dramatic music. The near perfect technical execution of this raises it from good to great as Tarkovsky proves with just his first feature film that he can assemble great talent.\n\nThis film manages to show the audience why war is bad more articulately than most films I have seen. A big part of this is the brevity because you never become tired of these characters and you get the simple message without extraneous scenes and dialogue. Having recently watched Dances with Wolves (1990) I was thrilled to see such a short but meaningful film that is expertly crafted. This is one of those pictures that stays with you, I know the final shots will haunt me.",
            "review_date": "2019-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It did take me a while to really get into this film. The first time I saw it I was really bored by this movie. I did learn to appreciate this film the more I understood more about Tarkovsky's style of slow cinema. Once you understand him more, you'll probably appreciate this movie more.",
            "review_date": "2019-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ivan's Childhood is an impressive debut from Andrei Tarkovsky, building an intense and sad anti-war depiction of innoccences lost on the battlefield.",
            "review_date": "2019-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, Andrei was really flexing his creative muscles in this one. An incredibly  personal story set inmidst the war. Every stillframe could be printed and would make for amazing wall art. Brillant camerawork from Wadim Jussow and extraordinary transitions make the movie float from scene to scene and create an exuberant experience that won't allow you to blink even once.",
            "review_date": "2018-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "we had to watch a few Tarkovsky films for a class and i was amazed by this. especially after watching Nostalghia. this was more concrete and real but still playing with the theme of memory and it is also more aesthetically pleasing in the midst of war. it reminded me of The search with montgomery clift but this is like the harsh reality version.",
            "review_date": "2018-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The contrast between Ivan's attitude and the one of the soldiers is brilliant, just like Tarkovsky's filmmaking, even in his first feature film.",
            "review_date": "2017-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ivan's Childhood has a couple of unnecessary sequences and the titular protagonist isn't as likable as he should have been, but this is a very good debut for Tarkovsky as Nikolai Burlyaev delivered a very strong performance, the story is well told and pleasantly straightforward and the film is so beautifully shot with some striking imagery and its exquisite visual quality is surely its standout aspect.",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.3/5\n\nPure soviet poetry thats goes deep into the war theme to explore and present the many ideas that stem from being under such a surreal and detailed lens.",
            "review_date": "2017-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now famed director Andrei Tarkovsky was for-hire on Ivan's Childhood, and some of that lets itself creep into the film. But what is great is really great.",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Atmospheric. Haunting. At times trippy. But such a good movie",
            "review_date": "2017-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's his first and his best movie.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mesmerizing and poignant debut of Tarkovsky, the right view of Soviet cinema on the WWII conflict.",
            "review_date": "2016-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ivan's Childhood is so absolutely unflinching and wholly self-assured you'd think it was the work of a director at the peak of his career. But no, it's a young director's debut feature and it contains some of the most stunning and inventive cinematography and cinematographic storytelling you'll find anywhere. I honestly don't know if I have ever seen a more powerful realization of war's destruction of innocence.",
            "review_date": "2016-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ivan's Childhood (Ivanovo Detstvo) is everything that I love about cinema. The cinematography, the direction, the unique transmissions and the atmosphere are what makes this war film like no other. I would describe this as a sinister fairy tale with a sense of poetry. What makes this even more impressive is that this is Andrei Tarkovsky first major film and we already got our first taste of Tarkovsky haunting vision.\n\nNikolai Burlyayev is one of the best child actors I've ever seen in a movie. He completely blew me away in this, as he is the one that delivered all the hard hitting emotions that happens around him. It's pretty heartbreaking to witness shell shock from a young boy.\n\nThis is definitely worth seeing. It's absolutely unmissable.",
            "review_date": "2016-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the many masterpieces of Tarkovsky's mildly short career and the one that started it all (full length wise) with amazing imagery, camera work, script, acting, poetic symbolism and genuine emotion that made Andrei notorious in the industry.",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully shot and heart-wrenching story of a boy growing up in Russia during WWII.  The movie seamlessly flips back and forth from Ivan's blissful youth to his current life as a Soviet scout.  Ivan's Childhood is a timeless and sobering look at the effect war has on children.  Although he's only 12, Ivan is easily one of the most mature characters in the film.  His character is multi-faceted and well portrayed in one of the best child performances I've seen.  His flashback scene to the death camp was so intense, it nearly had me in tears.  The other performances in the movie were decent, but none stood out especially.  The romance with Gasha also confused me a bit. It served it's purpose in highlighting love's ability to thrive in any environment, but it felt forced and didn't really lead to much.  I will say, however, that the forest romance scene had one of the most beautiful shots in the movie.  The cinematography was actually excellent in general, definitely one of the highlights of the movie for me.  As far as war movies go, this is definitely one of my favorites and I can see why it became such a classic.",
            "review_date": "2016-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The hand held camera work, editing, pacing and acting performances collide to make poetry. The propaganda reel ending is really the only blemish.",
            "review_date": "2016-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "superb  cinematography and dream sequences",
            "review_date": "2016-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Often times visual poetry, i tried to keep up with \"Ivan's Childhood\" however felt that much of it soared right over my dome.",
            "review_date": "2015-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a beautiful war movie. This is early Tarkovsky, back when he wasn't as cerebral. It's an introspective war movie, and from time to time, it amazingly captures the dreams of a young boy at war. The cinematography here might be the very best from Tarkovsky.",
            "review_date": "2015-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was my first time watching this first feature film from master filmmaker Andrei Tarkovsky.  It follows a 12yr old Russian boy as he navigates enemy lines during WWII.  This is easily one of the most beautifully shot B&W films I've ever seen, and that only adds to its power.  This is a tremendous film and any serious film lover needs to see it!",
            "review_date": "2015-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have a feeling Tarkovksy's about to become my favorite or second favorite director.",
            "review_date": "2015-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Signs of the brilliance to come.",
            "review_date": "2015-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A poetic war-drama film shows sadness and haunting vision of war by a 12-years-old boy, it's simple but explorative.",
            "review_date": "2014-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the Soviet Union we get a WWII drama built around 4 eerie dream sequences. It's that interchange between waking & dreaming that gives this film a poetic dimension that many other war films lack.",
            "review_date": "2014-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fifty years later, there's not much left to say, except I guess that all the things they say about it is true. Surreal, haunting, and tense.",
            "review_date": "2014-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great work of art for those days indeed..",
            "review_date": "2014-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is no lack of war pictures depicting the distortion of human mind. But few are able to combine this horror with an innocent child filled with hatred like Tarkovsky did. Beautiful cinematography.",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably Tarkovsky's most accessible film, it none the less uses simplicity to it's advantage. Beautiful often haunting imagery is produced through a highly kinetic and almost dizzying camera. I imagine like most of Tarkovsky's work I'll need to see it again for fuller understanding. If you are interested in this amazing filmmaker's work. Ivan's Childhood is a great place to start!",
            "review_date": "2014-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really beautiful film. Tarkovsky, like Malick at his best, knows when to hover on something beautiful, and there are unforgettable images in this film. Ivan is played by a really magnetic child actor in Nikolay Burlyaev, who commands the screen with a force reminiscent of Jean-Pierre Léaud in The 400 Blows. Very typical sad, patriotic Soviet war film plot, but this is a cut above the mass and really is great. Definitely a must see.",
            "review_date": "2014-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ivan's Childhood (1962) - 8,5\n\nTarkovsky could hardly come up with a better debut. Ivan's Childhood is yet another wonderful work from the Russian master. Moving and heart-breaking movie where a 12-year-old orphan risks himself on the front lines of the Second World War. For Ivan's young and corrupted mind, there is no worthwhile purpose except fighting the enemy of war, and the vengeance of his dead loved ones is a first order priority. Early love and happy childhood with his mother were ephemeral miracles now conserved in his memory; the war has become the only reality for Ivan. Similarly to The Bridge (1959), directed by Bernhard Wicki, Ivan's Childhood exerts a contrast between those two distinct realities to underline the absurdity of warfare and its costs. The Russian movie is a more intelligent, original and emotional cinematic experience, and is no less powerful in its anti-war message--if one chooses to see it that way--despite the fleeting combat sequences and not being as raw or graphic as The Bridge. Ivan's Childhood is, ultimately, more absurd and painful by throwing into the scene a 12-year-old child who has to duck the enemy practically alone. We fear and feel for him just like his adult comrades. Great acting by a very young Nikolai Burlyayev who later appears in Andrei Rublev. Very good acting overall, beautiful cinematography and inventive camera work. Based on a short story written by Vladimir Bogomolov, Ivan's Childhood is a powerful movie that deserves classic status. Even though this is Tarkovsky's first feature film and a few rough edges making itself noticed, it engages me in a poetic dream almost as effortlessly as the other masterpieces from the Russian genius. Highly recommended!",
            "review_date": "2014-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably, Tarkovsky's worst picture. But still a fine work.",
            "review_date": "2014-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ivan's Childhood is a fine, well crafted picture that showcases the subtlety of Andrei Tarkovsky's work. The film is brilliantly crafted with a simple, yet terrific story and it shows that you can pull off something truly wonderful with using the simplest ideas and putting them to a phenomenal style of filmmaking that elevates the film to art. Beautifully done, Tarkovsky crafts another stunning drama that resonates due to its strong characters, powerful story and breathtaking direction. I've said many times before that Tarkovsky was a master of his art, and here, he crafts something that delivers an impressive hour and a half of brilliant entertaining. Here the cast deliver some thoroughly powerful performances. This is another standout picture from a director who clearly is able to push the cinematic medium into new territory that has elevated films significantly. What I loved about the film the most was the idea behind the story, and the way it unfolds. Tarkovsky yet again delivers a stunning work and it's a well crafted work that is exciting, engaging and delivers a dramatic story well worth your time. The film is shot in beautiful black and white and it adds so much to the tone, atmosphere and feel of the movie. This is a stunning piece of cinema that ranks among the finest foreign films ever made, and it is captivating from the first frame onwards. I heavily recommend this film to anyone looking for a truly outstanding piece of cinema, and it's a movie that resonates with its message, and to me it was the loss of innocence due to a tragic occurrence of the main character, and Andrei Tarkovsky captures everything through his lens and in turn creates a stunning and haunting, yet beautiful portrait.",
            "review_date": "2014-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best looking movies I have seen, every frame was picture perfect.",
            "review_date": "2014-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a minor film by Tarkovsky, but it's through this that I can visibly see how much influence he has on Belar Tarr.",
            "review_date": "2014-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First Tarkovsky film, a story inmersed in the WWII with the poetic touch of the Russian director.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andrei Tarkovsky's first feature film is a poignant, suspenseful anti-war film.",
            "review_date": "2013-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extraordinarily beautiful movie. This is Tarkovsky's first feature film so we can see difference, but also familiar images (water sounds, horses, ed cetera.),  between his later achievements and this one. One of the differences is simple non-linear plot unlike Tarkovsky's other movies which are far more meditative and thoughtful. Nevertheless, I even think, in some strange way, this is its strength. Absolutely recommended!",
            "review_date": "2013-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Master Russian director's Andrei Tarkovsky's incredibly haunting World War Two masterpiece. The film is very bitter but also very poetic. Ivan is a precocious and vivacious child about age 10 with an idyllic childhood who is immediately forced to become toughened and hardened as he becomes a child soldier in the epic struggle against the demonic Nazi killers. The Nazi forces are never seen in the film but their presence is nevertheless terrifying, to the point that just the sight of a swastika gave me the shudders. It gives a great glimpse into what the war ( which killed one out of every 8 Russian men, women, and children) must have been like for the children and the women who fought against the Nazi's. The only weakness in the film may be that the female soldier, a teenager named Masha, is not a fully developed character in the film. This film will haunt me for a long time, truly unforgettable.",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Through poetic and innovatively creative cinematography as well as the philosophical depth of the dialogue, Tarkovsky's film feels like an achievement with its fresh portrayal of an original concept within the war genre and a genuine portrayal of a stolen childhood. Certainly one of the strongest anti-war films ever made, Ivan's Childhood is also the fulfilment of many of the themes which the filmmaker dealt with throughout his career.",
            "review_date": "2013-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only thing that keeps this movie from getting a five-star rating is the heights director Andrei Tarkovsky would scale after this assured and powerful debut that make Ivan's Childhood look immature by comparison.",
            "review_date": "2013-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Atmospheric, poetic, beautifully framed, and a completely devastating depiction of a loss of innocence. Tarkovsky was so talented.",
            "review_date": "2013-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IVAN'S CHILDHOOD, released in 1962, was Soviet director's Andrei Tarkovsky first feature film. An adaptation of a short story by Vladimir Bogomolov set in World War II, its protagonist is a 12 year-old orphan (Nikolai Burlyayev) on the Eastern Front whose small size allows him to scout German positions undetected. Ivan's missions have been useful to the army, but officers Lt. Col. Gryaznov (Nikolai Grinko), Capt. Kholin (Valentin Zubkov) and Lt. Galtsev (Evgeny Zharikov) would like very much to send him to a military academy to get him away from the front, especially as the final offensive against the Germans is imminent.\n\nThe action in the film plays out between two of Ivan's ventures across the river Dniepr into German-held territory. It depicts the difficult life of the soldiers at the front and the destruction that war brought to the Soviet village whose damaged buildings now host the army. Ivan's back story is revealed elliptically through comments among the soldiers, dream sequences or flashbacks. A subplot involves Kholin's disturbing attempts to seduce Nurse Masha (Valentina Malyavina) and, in stark contrast to earlier Soviet treatments of the war, suggest that in wartime one's own fellow soldiers can just as dangerous as the enemy.\n\nAs far as Tarkovsky films go, this is still an immature work. You'll find nothing of the slow, almost ritualistic pacing that marks his later films, and this comes in at a compact 90 minutes. Still, a few shots (tracking shots of a wall, Ivan flipping through a book of religious art) seem like mature Tarkovsky in embryo, and the prominent use of religious iconography (crosses, fresco) is already here. Vadim Yusov's cinematography is memorable, with its several \"layers\" of view in certain shots, and the prominent framing of shots with broken timber beams that seem to hinder the characters. I was however very disappointed that at the end, the film segues into basically a Soviet anti-German propaganda film, complete with archival footage of the Soviet capture of Berlin. It is like some completely different filmmaker took over.",
            "review_date": "2013-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A 12-year old orphan boy works as a scout for the Russian army during WWII, journeying alone into Nazi territory to gather intel on troop positions. Beautifully shot B&W war drama with tasteful dream sequences.",
            "review_date": "2013-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Monday, March 25, 2013\r\n\r\n(1962) Ivan's Childhood\r\n(In Russian with English subtitles)\r\nWAR\r\n\r\nDepressingly sad account of 12 year old Russian boy's determination to work alongside the Russian army against the Nazis with the motivation of occasional flashbacks of his sister and mothers last days.\r\n\r\n(Contains spoilers) \r\nAlthough I have the most utmost respect for the director Andrey Tarkovskiy who has directed this film, I can't come to terms to liking this film since the end contradicts the beginning where the young boy submits important information about the Nazis invasion in terms of completely destroying Russian villages only to wanting to go back doing undercover work for them again, only that he did not make it out this time- this scenio alone is unrealistic and at the same time  understandable since 1) this was Tarkovsky's first film debut and 2) when he made this film he made it under another fascist leader by the name of Nikita Khrushchev who somehow encouraged the 'Cold War'. In my opinion, this film is a propaganda picture since the boy wanted to continue to fight for the Russian's cause even though he's way too young to do anything does not seem realistic to me.\r\n\r\n2 out of 4 stars",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extraordinary film.  A true work of art.",
            "review_date": "2013-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anrei Tarkovsky's best work about a boy working in the Russian army agains the German forces.  The film highlights what war does to innocence in a way we haven't seen before, and does it in Tarkovsky's usual slow, thoughtful style that has been both his undoing and his greatest tool in future films.  Here he sticks to a straight narrative and tells a war story from a boy soldier's perspective, and shows us just much war can change us while we struggle to keep who we are intact.",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The contrasting beauty of the nostalgic childhood versus the brutal, drab, and dreary landscape of world war 2. The loss of innocence and tragedy that ensues is a more grounded film from Tarkovsky while the cinematography is something of a spectacle, creating sharp and distinct objects in the foreground and background create an entrapping sensation that is ominous and effective. Ivan's Childhood is worthy of many re-watchings due to its beauty and on the surface simplicity.",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andrei Tarkovsky's IVAN'S CHILDHOOD [1962]; \"All attributes of childhood.....Had gone irretrievably out of his life\"- Andrei Tarkovsky- \n\nOne of the most celebrated master filmmakers of the 20th century; the films of Russian Director Andrei Tarkovsky are some of the most revered works of art in world cinema. One of the great directors most celebrated films is his debut feature from 1962 titled IVAN'S CHILDHOOD. Depicting the harrowing and dehumanizing effects of war upon innocent children; IVAN'S CHILDHOOD shows this all too familiar tragedy through the experiences of the main character of Ivan. \n\nPLOT: Opening in a tranquil dream sequence depicting a content small boy and his mother. The boy then wakes up hiding in a barn but far from his appearance in his dreams. The boy is another countless victim of the Second World War; he then returns to the Soviet lines where it is revealed that he is a reconnaissance scout for the Soviet forces. Upon reporting to his commanding officer who holds much affection for him; Ivan (Nicolay Burlyaev) horrified to learn that the Commanding officer intends to send him to a military academy for his own safety. Being both stubborn and orphaned by the invading German Forces refuses the commanding officer offer and blinded by hate remains on the front lines.\n\nTHOUGHTS: Tarkovsky's depiction youth being destroyed by the horrors of war is a profound and nightmarish film. Anchored by arguably one of the best performances by a child actor I have ever seen in a film; IVAN'S CHILDHOOD is a moving film. Unlike a conventional War film, no grand battle scenes are seen in this film. But what is in the place of that convention is a stark, intimate, barren and harrowing drama. With most of the film focusing on Ivan's harmonious dreams/memories cross cut with the bleak experiences the character on the Front Lines; makes this film all the more compelling. \n\nOne of the film's most haunting scenes is when during German shelling on the Soviet lines. Ivan is left in a cellar where he beings to play; however the play isn't innocent. Ivan while the sound of shelling is heard in the background begins acts out \"an advance\" on the enemy, which is then intercut with his nightmarish memories and shot and edited in a feverish manor. Afterwards one of several officers who Ivan looks up to comes into the cellar to see if he is all right. The Officer tells Ivan not to be afraid, then the camera zooms into Ivan's face who response that he is not afraid. That scene alone perfectly depicts in my eyes that Ivan is no longer a normal child anymore. \n\nAs for my rating of this film despite it being one of the most mature and powerful directorial debuts of all time; I'm torn on the rating. While in the process of typing this review I'm torn between an 8.5/10 and a 9/10 rating. Despite the powerful story, I found parts of the film to be slightly distracting from the main focus of the film. For example the subplot involving a young Nurse and her possible romantics with several suitors (including Ivan's Officers) I feel was a bit pointless. I understand what that subplot was trying to get across that even the most seemingly normal human emotions are tarnished by warfare, including blossoming romances.  But considering the strength of the characterization of and the experiences of Ivan made that subplot a bit unnecessary.  \n\nOverall aside my misgivings over the overall purpose of the subplot and my rating for this film; this is one of the finest directorial debuts I have seen to date. Most of the great masters of cinema when it comes to their debuts; most where only just finding their footing as filmmakers. With this film and Tarkvosky; for the most part of this film it felt like that this was the work of an experienced filmmaker, not a directorial debut. This is one film I will have to revisit again; an 8.5 /10 rating.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first true film (aside from student films, such as his provocative adaptation of Hemingway's The Killers) of a master of cinema, Tarkovsky's Ivan's Childhood already exemplifies the aesthetic that will make Tarkovsky a truly original cinematic force.  While he is attempting to emulate the aesthetic of contemporary Soviet films like The Cranes are Flying, Tarkovsky also begins developing his lingering, long take aesthetic that forces the viewer to focus both upon the images of the characters and the environments in which they exist and act.  A harrowing, beautiful, tragic, and at times even funny exploration of WWII in the Soviet Union, Ivan's Childhood explores how war affects the lives of entire nations not just the soldiers on the front lines.  A profound exploration of patriotism, grief, and desire, Ivan's Childhood alternates between realistic war scenes and surrealistic dream sequences that display both the inner and outer worlds of a child scarred by the brutality of war.  Haunting and unforgettable, Ivan's Childhood announces the arrival of one of cinema's true masters.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exquisitely rendered wartime portrayal of lost innocence, that through it's visual poetry and textures creates a humanistic tale that is at times as sweet as it is devastating. Through Tarkovsky's lens, a memorable and haunting vision is realised.",
            "review_date": "2013-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting commentary on World War II, as a young soldier/spy named Ivan (he's about 12) checks in at a checkpoint, where a young lieutenant is confounded by this boy and what he's been through. Soon, they are met by superiors, and then... what happens next? It's just a wee bit confusing, but Ivan's Childhood IS beautifully shot and contains some fantastic scenes. The whole of it I guess, is, War is Bad. Interesting ending with the \"Germans are Evil\" newsreel bits.",
            "review_date": "2012-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest debut films I have ever witnessed. An instant classic with brilliant direction and unforgettable dream sequences. Don't miss it.",
            "review_date": "2012-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Soviet cinema's master is Andre Tarkovsky. One of his masterpieces is Ivan's Childhood.",
            "review_date": "2012-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ivan's Childhood is absolutely heartbreaking. It progresses as a political statement on war and human involvement, whilst indulging in the horrors of being a child and how they are corrupted by it. It is the first Pan's Labyrinth, but without the fantasy. The child actor is daring and serious in his role and audiences may just need a tissue or two to face the reality of the end of the film.",
            "review_date": "2012-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So, this is my second Tarkovsky film in as many days and I start to see some patterns and techniques.\n\nFrom what I've seen, I want to emphasize especially one point. He's a master of implying. His characters don't talk that much and to be honest, his images are expressive but not very strong narrative means. But what he does best is dropping certain lines or even words that multiply to a greater truth. Ivan's life is not pictured very detailed and he doesn't talk too much about it either but we get a very good idea of how he's been for his mere 12 years. Moreover, it's BECAUSE we don't see everything that we get an even greater feeling about Ivan's devastating life and experiences.\nThe ending is sad, I agree, but other scenes are even more effective when Ivan implies he's seen death camps (or even been there) and we can sympathize with his feeling only by looking at his face and in his eyes (also props to the performance of the young Nikolai Burlyayev) and without ever seeing the actual cruelty he encountered.\nThus Ivan's Childhood becomes one of the most effective war films I've ever seen and I rate it even higher than Stalker.\n\nIt's perfectly possible that this little debut film will become my favourite piece of work in Tarkovsky's oeuvre but let's see and wait for Andrei Rublev, Solyaris and The Mirror.",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Synopsis: Determined to avenge his family's death at the hands of the Nazis, 12-year-old Ivan joins a Russian partisan regiment as a scout. He becomes indispensable for his ability to slip inconspicuously through enemy lines.\r\n\r\nIt's easy for me to forget the wide variety of styles one can find within the body of just one director's filmography.  Directors such as Martin Scorsese and Kubrick have experience in a vast array of differing genres.  Even the great Kurosawa who spent a large portion of his filmography in the Jidaigeki, imparts vastly differing temperaments to say \"Seven Samurai\" compared to \"Ran\".  My first (and until now only) film from acclaimed russian director Andre Tarkovsky I had the pleasure of watching was the sci-fi picture Solaris.  A long film of philosophical ideas wrapped in an experimental, languid, and intellectual package.  So heading into my second Tarkovsky film, \"Ivan's Childhood\" (the director's debut), I was expecting something quite similar.  Needless to say I was in for a pleasant awakening.\r\n\r\nThe style of Solaris and Ivan's Childhood couldn't be more different.  Solaris has a hefty 2 1/2 hours plus runtime and takes sweet liberty with every minute whereas Ivan's Childhood is brief and contains a much quicker pace.  Solaris is a challenging experimental work while Ivan's Childhood is drastically more conventional.  If one didn't know better, one would assume the two are from different artists.\r\n\r\nBut the same level of genius can be found in both.  Ivan's Childhood has moments of extraordinary surrealism as Ivan recounts the horrors of his early childhood.  At the same time the film has a haunting atmosphere as Tarkovsky delves deep into the mind and life of the 12 year old military scout.  All these brief moments are constantly wrapped in striking images that rival the best that black and white cinematography has to offer.\r\n\r\nAndre Tarkovsky is hailed today as one of the greatest directors to ever live.  With Ivan's Childhood, his debut feature, he wasted little time demonstrating why.",
            "review_date": "2012-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing cinematography. Very interesting story. Nikolai Burlyayev, gives one of the strongest performances I've seen from a child actor.",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Tarkovskiy picture which is artistically very accomplished but again I really struggled to get into. The story was very insular in comparison with the events of the time which made it a little inconsequential despite the power of the imagery.",
            "review_date": "2012-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that deserves its 3 titles.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is perhaps the best film based on war that I have seen... filled with unforgettable images... The Russian master simply sucked me in...",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The amazing cinematography demonstrates what \"the poetry of film\" really is.",
            "review_date": "2012-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andrei Tarkovsky shows the promise of his later works \"Andrei Rublev\", \"Solaris\", and \"Mirror\" in this early effort.  The dream sequences are unsettling.",
            "review_date": "2012-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This haunting, dream-like war film serves as a wonderful introduction to the work of Russian film-master, Andrei Tarkovsky.",
            "review_date": "2012-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky's first major film and one of my few b/w flicks. This different war film is very poetic and include some fantastic child acting. The boy is incredible in his role as Ivan. The story is interesting and lovely and as always Tarkovsky presents stunning cinematography.\n\nIt was a bit disappointing at first but later on it turned better every minute. I feel this is quite typical for his films, they need some time to sink in. A fine story that is very sad but still very beautiful. There lies some dreamyness over it and not only when it's dream sequences go on. We get some amazing scenes here, and I belive the scene with the cute army girl, Masha in the woods is the best. All the birch threes in black and white and the way the camera moves..man, I'm getting chills. This is film art.",
            "review_date": "2012-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anrei Tarkovsky's best work about a boy working in the Russian army agains the German forces.  The film highlights what war does to innocence in a way we haven't seen before, and does it in Tarkovsky's usual slow, thoughtful style that has been both his undoing and his greatest tool in future films.  Here he sticks to a straight narrative and tells a war story from a boy soldier's perspective, and shows us just much war can change us while we struggle to keep who we are intact.",
            "review_date": "2012-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In one of the most unforgettable visual debuts for a director Andrei Tarkovsky vividly portrays the effects of war on a child. Very beautifully shot showing Tarkovsky is a master of the poetic and the sublime right from the start. The war seems to be a little too overshadowed at parts but is still a great debut film for a director.",
            "review_date": "2012-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky's first film = one amazing war film. Must of been a huge influence on one of the most powerful war films I've seen - 'Come & See'",
            "review_date": "2012-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just the idea of a child struggling to survive during a war displays many themes. But the genius of Tarkovsky is his ability to explore these themes with such a subtle hand. The soldiers around Ivan understand his revenge and in a way envy that he has the ability to actually fight for something. Rather than treating Ivan as a nuisance he is a valuable commodity to them as a reconnaissance specialist. If that isn't a ringing endorsement for the audacity of war and the complete disregard it has for human beings then i don't know one. The film is shot like a nightmare playing with shadows in a disturbing way. The flashbacks are brutal. They are so magnificently crafted that I actually started to hope for them to be real and when your jolted back to reality I felt leveled. A truly remarkable film, what a debut!!",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the Criterion Collection Spine Number 397, this is a excellent Russian film about a young boy who is actually a spy for the Russians against the Germans in WWII. A very capturing story. In Russian with English subtitles.  The child is an excellent actor, afraid of nothing. A good Black and White Film. A treasure in this collection worth 4 1/2 stars",
            "review_date": "2011-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film causes us to consider the Soviet contribution to the outcome of WWII. The consensus estimate is that they lost over twenty million people, compared to less than a half million for the U.S. From most of what we see of WWII in the movies it is the U.S. that is portrayed as the prime force in the Allied victory, but the Russians can claim the victory with equal or greater authority.",
            "review_date": "2011-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The great thing about this film is that if you were to take any frame from the movie and put it in an art gallery, it would work. Every shot is genius and atmospheric. After rewatching this film, I felt I needed to re-review it, as I don't think I appreciated the brilliance of it the first time round. The story of Ivan, a young Russian boy who is unhealthily determined to avenge the murder of his family by Nazis, is perfectly executed by Tarkovsky's masterful approach. It is difficult to summarise the key features of what makes this film so very interesting, but I urge people to watch it, and it deserves a place in any top 50 list.",
            "review_date": "2011-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky paints a portrait of a child plunged into a nightmare of violence and darkness in his deeply disturbing and effecting feature debut. It's the kind of film that takes its time in crawling under your skin, but once it's there it doesn't fade quickly, and the sounds and images of its finale remain long after the movie ends. Part of what makes the film so startling is Nikolai Burlyayev's performance. It is one of the most mature and genuine child performances I have ever seen. Burlyayev convincingly portrays a child who has grown up much too fast after his mother was killed by the Nazis and he was thrust into the Russian army with a lust for vengeance as a spy, his prepubescent body able to be stealthy within the swampy enemy territory. It is the violence behind his eyes that makes his story truly frightening; he knows not the politics of the war he fights in and instead is only concerned in killing. The most incredible element of the film, though, is Tarkovsky's vision, one so polished and refined that the horrifying images that fill it look almost beautiful in their darkness. He photographs the natural world as if it were another planet, or rather as if it were the exact translation of the mind, where every detail in the foreground is crisp but in the distance their is only a hazy nothingness. To watch this film is to be swallowed by it.",
            "review_date": "2011-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky's most experimental and accessible film has some neorealist elements a la \"Germany, Year Zero,\" but the style and poetic depth of it all establishes the director's unique, wonderful art and separates it entirely from the more pessimistic Rossellini film. Rather than merely depressing the audience, the director works to move and sadden with visuals of striking beauty. A wise choice. Tarkovsky himself said that the completion of this film marked the end of his \"apprenticeship.\"\r\n\r\n9.5",
            "review_date": "2011-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To me the best, most powerful war movies are the ones that condense the horrors of wartime all the way down to the personal stories, particularly ones that involve the most vulnerable and innocent. And this might be like top 3 material. Visually, it's as stunning as it is spare and the ending is pretty devastating. That Masha stuff seemed half-baked though. Nevertheless, beautiful movie.",
            "review_date": "2011-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky's first film is a beautiful B&W exploration of the effects of war (in this case WWII) on a child.  Its lyricism is undercut at times by some abrupt transitions.",
            "review_date": "2011-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky's poetic composition is a masterpiece to the senses. The loss of innocence is the central topic, not the war itself. Extraordinary dream sequences and a dreamlike, dancing rhythm address our attention towards Ivan's past dreams and idealistic hopes, like if he was living a double life: in real life, he serves as a spy and rejects to go to school with a personality made of steel, and in his dream life, he returns to his mother and plays in the way his heart yearns for. This incredible debut already featured the director's filmic trademark, especially in the scenes involving Masha.\r\n\r\n99/100",
            "review_date": "2011-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "such images, such symbolism, such photography, all in a debut film. Maestro i bow down to you. Films on war have moved me, impressed me, influenced me but have never haunted me. Use of torch light, use of trolleys, Use of silhouettes, use of fire, use of water, use of nature, you have taught us all.",
            "review_date": "2011-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky's most accessible film... haunting story, and i love this boy's performance. their Russian sounds so beautiful here.",
            "review_date": "2011-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every scene was gorgeous as a picture. What a great movie.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andrei Tarkovsky's first feature doesn't have much plot, but it's worth seeing for the evocative, black-and-white cinematography alone.\n\n\"Ivan's Childhood\" (sometimes known as \"My Name Is Ivan\") focuses on a 12-year-old boy who acts as an spy for the Russian army during World War II. His small size and unlikely age give him an advantage. He is a hardened, insolent lad whose parents and sister are dead -- nothing is left for him beyond the war.\n\nThe story opens as he swims across a boggy river, returning from a dangerous mission. Russian soldiers suspiciously take him into custody, but gain respect for him after his military status is verified.\n\nThe plot doesn't go much further than this, and mostly details the interim until the child's next assignment. Screen time is spent on intense conversation, picturesque wandering through war-ravaged landscapes and a few low-budget dream sequences (mostly serving to show the boy's longing for his late mother). Apples, fractured wood and a forest of white birch trees are among the memorable visual elements, though we also get Tarkovsky's most aggravating quirk: his eternal fascination with water. Rippling water, running water, dripping water...he loves it all. A few scenes are practically torture, due to the nagging plip-plop of unseen droplets. What purpose do they serve?\n\nAnother strange feature is a lazy subplot involving a pretty nurse named Masha and the soldiers who are gently attracted to her. It leads nowhere useful. But the film's shot compositions are gorgeous, and the imagery does a fine job of putting us inside Ivan's head (the young actor is quite solid, by the way).",
            "review_date": "2011-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: 3.7/5. A very good debut film by Tarkovsky. Performances are good too. I loved the dream sequences, and the camera movement through the trees. Just a wonderful film about the life of a boy.",
            "review_date": "2011-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't find anything wrong with it.  Amazing debut that proves Tarkovsky came to features a fully formed, mature artists.  Really stunning.  I can't wait to watch it again.",
            "review_date": "2011-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9.0/10\r\n\r\n            It takes a gifted filmmaker to truly respect the visual medium that is film. They say that most filmmakers just don't have a grasp on this concept; and for the most part, I agree. But I also agree that there are artists who understand that a film needs to look good to be entertaining; and these are the people who make highly respectable works of art. Andrei Tarkovsky started his career the right way with his debut feature \"Ivan's Childhood\"; a dark, poetic, and beautiful portrait of a youth who grew up during war-time. Some of my favorite films have similar attributes; brilliant visuals, and a timely story about children influenced by violence and war. \"Ivan's Childhood\", however, is one of the most brilliant films ever made, at least when it comes to films about rough childhoods. This is a film without comedy and without what most would call \"joy\". It's a cold, powerful, and nearly heartless film. But maybe that, as well as Tarkovsky's spot-on direction, is what makes it such a memorable and worthwhile experience. Whilst watching the film, I couldn't help but feel like this is one of the highest-budget film debuts I've ever seen. The picture (especially with its semi-recent Criterion Collection release, which restores the picture to its best quality) looks fantastic, and NOTHING about the film gives off a \"low budget\" feel. Its spectacular filmmaking, story-telling, and visualization. It's never a \"war\" movie (as some have described it), but more so a full-on drama; and a perfect one from the looks of it. I loved \"Ivan's Childhood\" because it is historic, inspiring, and influential. It makes us all kind of wish that we were born with the sort of visual genius that Tarkovsky was born with; but the reality is that wishing will not get us anywhere. You must be skillful to be a painter, and the same goes for a filmmaker. Tarkovsky is a natural-born filmmaker in the best sense of the phrase; a beautifully poetic man creating beautifully poetic films. His first film is brilliant; and I highly recommend that everyone see it. It's never over-long, which is surprising considering the story it tells, although it gets everything accomplished in its 95-minute run-time. It's a treasure; a gem. And that's what I love about it.\r\n\r\n        The film has a story; and it's a story of many layers. It is the tale of a young boy who was born and raised in war-time; World War II, to be precise. He lives in fear with a hint of ambition; longing to help serve his country. It's a sad film in the end; a tragic tale of loss and youth that shall not be forgotten after you've experienced it. I have watched \"Ivan's Childhood\" twice now, and let me tell you; I finally feel like I've seen the film in all its beautiful entirety. The story is told slowly but delicately; savoring room for little details, symbolism, and beautifully haunting imagery. Tarkovsky seems to have a gift for each of these things, and that probably why I'm pondering looking into more of his work soon. \"Ivan's Childhood\" is a powerful dose of youthful story-telling; and it is engaging both emotionally and in its narrative style. But what seems to take center stage here is the style; and in that sense, this film is a masterpiece in that department. The most unforgettable aspect of the film is how Tarkovsky's imagery blends in so well with the suitably bleak and dark story-line. I find it masterful, and I find \"Ivan's Childhood\" to be a complicated but unforgettable tragedy of a film. Some may think it is a mess, but if it is one, then it's a beautiful mess. They say that you cannot have a good film without a good story and that is true. I will tell you up front that \"Ivan's Childhood\" does have a story, and it's a damn good one. But half of the story is told through what we can see rather than what we can hear. If you find that you and your five senses are closely in-tact, then \"Ivan's Childhood\" is most definitely for you. Just don't doze off, since there's too much to see here for you to be sleeping on the job. Tarkovsky is talented; and I adore talented artists. Thus, I liked \"Ivan's Childhood\".\r\n\r\n       I found that Nikolai Burlyayev was very hard to ignore as Ivan. There was a haunting, nigh demeaning quality about the actor that elevated both his character and his performance to pure greatness. As I have expressed, I loved this film. Everything about it was completely arresting in a bleakly visual sort of way. Burlyayev's performance only does so much as help this film be better than it already is; and there's something very, very special about his efforts. He's a part of what makes \"Ivan's Childhood\" so darned intoxicating.\r\n\r\n         \"Ivan's Childhood\" has no regrets when it comes to expressing filmic art in the most bizarre, dark, but beautiful ways. I've seen worse when it comes to graphic war depictions, but \"Ivan's Childhood\" simply does not linger on such a thing; not even for a moment. The story does not care about the details of the war, but more-so the impact that the events have on its character. Ivan was surrounded by daily violence and eternal fear. We are shown how this affected him to great extents; and this is definitely what makes the film as powerful of a knock-out as it truly is. The cinematography is absolutely breathtaking; I'm not going to lie about that. Tarkovsky nearly demands that this film be visually awesome; and some of the shots are just plain intimidating. But that's why they're so darned unforgettable. The film also has a relentless, consistent sense of dread going on throughout. The film makes use of its visual style as well as the score to create a perfect atmosphere, and quite frankly, it creates a perfect film as well. I've seen a lot of great films in my time, but \"Ivan's Childhood\" is great because it has shown me something that few other films truly have; pain, sadness, and power. Sure, we've all seen a little bit of each. But seldom do we see them together. Ah, hell; look at me. Only one film in to his career, and I'm already praising Tarkovsky as if I'd known his career for years. It sort of feels that way, now doesn't it? I adored this film for its artistic merit and its stunning visual mastery. It is a visual masterpiece. And that's enough to make it great.\r\n\r\n       I've been watching some seriously depressing films lately. That's not to say that \"Ivan's Childhood\" is a masterpiece as far as depressing films go, since it's not even THAT depressing of a movie (or at least not enough of one to turn away those who despise general on-screen depression), mostly since it's a masterpiece in many other things. But it's a gritty film; relentless in its emotional impact and powerful in its story-telling. There is no other film quite like it, and frankly, that kind of statement only applies to some of the best films out there. I love \"Ivan's Childhood\". I loved the story, I loved the visuals, and I loved Tarkovsky's wondrously ominous sense of direction. It's official; the guy is a genius. But then again, his work has proved to be influential, so he must be, right? Yes, right; he must be a great man. He must have been one, at the least. However, despite my personal love for this film, Tarkovsky didn't seem to share the same sort of admiration. He complained that the film was a disappointment, and that the script wasn't as he had wanted it to be. All I can say to that is; oh well. There are people who can appreciate it, and it's too bad that the director himself cannot. But I'm sure that Tarvosky learned to love his debut as time went on. But then again; so did most people. This film has aged very well. It's the kind of movie that will never age anything more or less than well; and that's saying a whole lot of good when regarding the thing. It's dark, seductive craft is not to be missed; and I feel that \"Ivan's Childhood\" should be seen by just about everyone; although it is not FOR everyone. None the less, it's a classic. I will now go on to watch other Tarkovsky masterpieces. Wish me luck there.",
            "review_date": "2011-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The opportunities to watch Tarkovsky movies are rare, but I've been lucky this time at ICA in London. The grand Russian movie-maker's debut film: a sensitive, magnificently filmed war movie playing on Russia's Western front in WWII. Grand art. No insistence on bombs, shootings, blood, not much noise. Rather a reflection on the pshychology of war, on stolen childhoods, missed opportunities for fatherhood or love. Death constantly in the way. Nazi crimes ever-present in the background. The landscapes are grand  tableaux - in sepia - worth of Russia's grandest 19th Century artists.",
            "review_date": "2010-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really surprised me at just how amazing it was. Beautiful and scary.",
            "review_date": "2010-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best debut films I've ever seen. Every shot in here is straight beauty. The apple cart sequence is particularly stunning. Tarkovsky is king.",
            "review_date": "2010-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A not perfect, but very powerful film about the cruelty of war and the loss of innocence, Tarkovsky's first major film is easily his most accesible one.",
            "review_date": "2010-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bleak and grim. One of the greatest anti-war films of all time. It's not full-blown Tarkovsky but it's still amazing.",
            "review_date": "2010-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best work of Tarkovsky's. The film doesn't only emphasize the purposeful motive behind its subject, but also composes a true, and somehow powerful, ideal form of cinematography.",
            "review_date": "2010-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "And you thought your childhood was hard.  My Name Is Ivan (or Ivanâ\u0080\u0099s Childhood, depending on who youâ\u0080\u0099re talking to) is about a twelve-year-old boy who serves as a spy for the Russian Army, as he is small enough to pass unnoticed behind enemy lines.  This movie paints such a vivid picture of Russia in wartime.  The monochromatic photography is beautiful, and Tarkovskyâ\u0080\u0099s camera work is spell binding, especially whenever he chooses to go for a disorienting shot.  It is a visionary art-war film; from the dream sequences to Ivanâ\u0080\u0099s story, it is all gripping because the artistâ\u0080\u0099s touch is there.  There is a lot to be said in the way of subtleties here; everything isnâ\u0080\u0099t spelled out for you, and you as an audience member have to do your share of the work figuring out implications.  It does start to move slowly about two thirds of the way through, but this is a real treat should you get the opportunity to see it.",
            "review_date": "2010-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the cinematography's stark black-and-white contrast with shades of German Expressionism and PATHS OF GLORY, the stars of this film are cinematographer Vadim Yusov and his team. They embed images in the mind the way Robert Krasker does in THE THIRD MAN, with freshness, resourcefulness and insight. The images are where the power lies â\u0080\u0093 an airplane sticking out of the sand, an applecart spilling its contents along the beach, a soldier kissing a nurse as he uses his legs to suspend both of them over a trench. But while the pictures are haunting and beautiful and unique, they canâ\u0080\u0099t make up for the storyâ\u0080\u0099s lack of compulsion. In the barrage that is the genre of war films (and especially those set in WW2), this kind of melodrama rightfully falls to the wayside. The film doesnâ\u0080\u0099t find its emotional core until the final moments, which, granted, are heartbreaking, but are also too late to offer a lasting impact. While there may not always be truth in the old idiom â\u0080\u009cActions speak louder than words,â\u0080\u009d in a movie like this more action certainly canâ\u0080\u0099t hurt. See this for the photography. Donâ\u0080\u0099t hope for much story-wise.",
            "review_date": "2010-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky is amongst the greatest directors ever and so few know about him.  I had never heard of him 130 days ago now I have watched six of his films This movie is less accessible than all but andrei rublev.  Most directors make films whilst Tarkovsky has made a brilliant body of art.",
            "review_date": "2010-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gorgeous visuals and moments of surreal brilliance mark Andrei Tarkovsky's poetic debut.  Produced well into the great Soviet thaw, Ivan's Childhood, a WWII drama centered around a 12-year old boy performing clandestine operations, is actually simultaneously one of his most accessible pieces, and one of his most striking.  The dream sequences were all exquisite, definitely displaying a creativity rivaling that of the other New Wave directors.  The cinematography was also exquisite, capturing the tranquil beauty of a flooded forest, or of flares simultaneously imparting the beauty and violence of war.  There were also other moments of style, such as a particularly elated moment of still passion that are truly unique.  The integration of actual footage from the war was also successfully accomplished.  The visual representation of life as a dream and whether reality feels any more real is intriguing, as well as an early example of one of my favorite film themes, present in such contemporary films as Inception and El Laberinto del Fauno.",
            "review_date": "2010-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "while it is not as contemplative as Tarkovsky's latter efforts, but it is, probably one of his most intense film. And considering that this is his debut feature,well, makes this even more remarkable",
            "review_date": "2010-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just didn't do much for me.  the little boy was incredibly good, really good actor. but he disappears for like half of the film and you only ever see him again at the end in a rather, surprising manner.  the bit with the general and the girl seemed pointless, and much of the store felt unbaked.  shot very nicely, and visuals were harrowing of the war but didn't feel it was anything special.  i think it might be just a tad overrated for its own good.",
            "review_date": "2010-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grade: A\r\n\r\nThis is Andrei Tarkovsky's feature film debut, and it is undoubtedly a masterpiece. This is a film about a 12 year old Russian boy whose parents and sister are dead because of the War (or Germans in his mind); anger and vengeance consume him, and he hates the German's with a passion. Set during WW2, this film is as relevant now as it was back in 1962 in Russia. Today we take Tarkovsky's artistic expression on the screen for granted; but in that post Stalin environment, Tarkovsky and his colleagues were very aware of their newfound freedoms in the art of cinema, after years of censorship and a fledgling film industry in Russia. This is a war film above all else, but with Tarkovsky helming, that \"all else\" takes a prominent spot next to the war aspects. The film is very much about our individual duties in war, and what is expected of different kinds of people in certain situations of war. \r\n\r\nIvan is a child soldier, and a willing one at that; in fact, war is all he knows, and any recollection of affection is mainly through his dreams, when he recounts memories with his mother and sister. Ivan' utopian like, brightly lit dreams are a stark contrast to the dark, dirty, war torn landscapes of his real life. How should a child live? Like Ivan in his dreams....not like a man-child consumed with a thirst to kill for vengeance, which is what he is in his waking life.\r\n\r\nIvan's mentor is Captain Kholin (Valentin Subkov), who is like the opposite of Ivan; immature and war weary, who happens to have a gun, but doesn't care much for it. He is Ivan's friend, as Ivan so direly needs one. Corporal Katasonych (S. Krylov) is like a surrogate father figure for Ivan, who may or may not adopt the boy. These influential figures in Ivan's life try to keep him on the straight and narrow, and even want him to go to military school for education; but for Ivan, revenge cannot be put on hold, for it is a full time job.\r\n\r\nWe meet Ivan in a dream; after the dream we see him in a jungle like setting trying to get past the enemy all alone. At a Russian post, he meets Lieutenant Galtsev, the superior officer at the post; Galtsev is about 20 or so, yet he comes to see Ivan as the inspiration, the one who is awe-inspiring and worthy of being revered. He comes to admire him and he even considers Ivan a friend. Even if Galtsev doesn't voice his thoughts, the camera and the acting do all of the things that words don't need to.  \r\n\r\nIn fact, the camera is master in this film. The Standard socialist realist aspects are there, at times, however Tarkovsky is too ambitious it seems to restrict himself from other techniques; he uses memories, dreams, oblique angles, and symbolic lighting. Non-diegetic sound is also used to contrast the visuals with the thought patterns of Ivan, evoking his confusion, torment, and anger. Ultimately this is a film that could be called \"realism\", but in fact isn't completely, because it's at the partial mercy of Tarkovsky's mind, and his feelings on the subject, therefore inviting an uncommon subjectivity and perspective on the world portrayed; I say only a partial mercy because later in his career Tarkovsky chose projects that were more easily moulded to his personal vision, even if that made them more complex films. This is a War Film adapted from a short story, even if Tarkovsky is moulding it and adding to it as he see's fit.\r\n\r\nA sub-plot involves a girl named Masha, the only girl we see at the post. She is there to provide medical aid mainly, but the film spends time following her in a few choice scenes in between Ivan's plot, as men admire her and attempt to seduce her, or instead just ogle at her. A beautifully shot scene in a forest with Masha and Captain Kholin is ambiguous, tense, and makes us question the real true nature of Captain Kholin. She also meets an old school mate in a scene, and also encounters Galtsev in another. The way she handles all of these situations, and what she seems to gain, are interesting to watch, and provide a kind of counterpoint to the male story of Ivan.\r\n\r\nThe film is powerful because it is true, and doesn't pull cheap punches. This stuff happened to millions of kids, even if they didn't all react like Ivan. What happens to Ivan is so sad, so terrible, and at the same time so true and so profound. The dream sequence at the films end (is this dream of Ivan's, or is this Galtsev thinking about his friend)shows Ivan with his sister on a beach; as far as short dream sequences go, this is one of the best . This dream threw me off for a little while, as it ends the film. But with a little time to reflect on it, its meaning is quite powerful, even if it breaks the boundaries of the films direct material; Tarkovsky is an artist, he isn't content with making just another film. He has succeeded here in creating an artful masterpiece, with a visual meaning that is multiplied by the various associations one could make between all the separate images. To watch this film once would be sufficient, but for some multiple viewings are required, as it can be difficult to follow at times, and the editing jumps force us to rationalize and become participants in the film; for a Tarkovsky film it is on the simpler end though. \r\n\r\nI will add this to \"TheArshMan's Top 100 Films of All Time List\" in the next couple days or so. Many may say this film doesn't explore the German side enough, and that they are simply an off screen entity that is hated by the Russians. I don't call that a bias of Tarkovsky's or the material; that is a bias of Russian Soldiers and the public during WW2; the film reflects that bias to a degree. Above all that however, the film is about the effects of war on children, and which side is right or wrong is not at all an objective of the film. We need to heed films like this, and others, as a Great War may not be as far off as some people believe; then, again, children like Ivan will die, or live on with the motive to kill. We should have learned to expand peace; instead we expanded war in the name of peace. There are plenty of angry Ivan's alive today, and guess where they live? And guess what Anderson Cooper calls these people on CNN, or Glenn Beck or whoeverthefuck?  People make these discussions complicated, but they are not. Americans and Canadians, we can't feel these things, like really feel them. We don't have the capacity, because there are no bombs above our heads falling down, only a golf ball and a guy yelling \"FOUR\". Good night and good luck...tonight, the Tiger Woods scandal...",
            "review_date": "2010-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andrei Tarkovsky's masterpiece is perfect from start to finish the direction and cinematography play off each other brillantly. The story is about a young boy in Russia during World War II and the obsticles that are created that he must overcome.  The stark black and white photography make this film extremely powerful not to mention the realistic acting that fits in perfect.  One of those rare occurances that a film is perfect and not one thing should have been changed, highly recommended!",
            "review_date": "2010-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ivan is a young boy working as a spy for the Red Army.  The Red Army goes Blue for a moment and offers Ivan a semi-normal childhood.  Unfortunately, Ivan isn't buying.",
            "review_date": "2010-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ivan's Childhood provides an unusual combination of psychological realism and haunting, surrealistic imagery.",
            "review_date": "2010-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dream poetics in the Thaw.",
            "review_date": "2010-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps Tjarkovski's easiest accesible film, which is good since if I was a dwarf, my name would be Sleepy. Not as slow as many of his other films, but still very 'atmosphere driven'. Beautiful in it's black and white contrasts and some great cinematography. A very 'crouching hero with flying daggers' or whats their name moment in the birch forest.",
            "review_date": "2010-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cinematography here is stunning, and Burlyayev is impressive as the young protagonist. The film is at its best when he is on screen, except for in the final act of course, whose power comes from Ivan's absence.",
            "review_date": "2010-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Contemplating giving this film a 5 star rating. My first Tarkovsky film I've seen, and I can't wait to see more. A beautiful film with a very impressive performance from the kid who plays Ivan. The way Tarkovsky weaves reality, dream, and memory is unlike I've experienced before, very subtly magical...with vibes of a kinder Bergman, and a purer Fellini, with a sensibility like Truffaut.",
            "review_date": "2010-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the movie I had to watch. its interesting that the boy is killed by war and adults who is behind the war, but boy's death is praised in the film.his death remain innocence and beauty.",
            "review_date": "2009-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andrei Tarkovsky's feature length debut is a near masterpiece about a child's innocence lost during wartime.\nThis is easily Tarkovsky's most accessible film. It is shot in beautiful b&w by his fantastic cinematographer Vadim Yusov (Andrei Rublev, Solaris; I think that says it all) and boy are the images quite stunning. The story is more or less non-linear although not quite on the level as his later film The Mirror and has many dream sequences, one of which starts the movie off perfectly.\nIt is a powerful tale about the young protagonist who wants to avenge his family by spying for his homeland against the Nazis.\nTarkovsky's talent to create such striking images is shown this early on in his prolific film career. There are plenty of images that give competition to his subsequent masterpieces (Andrei Rublev, Solaris, The Mirror, Stalker).\nThe young actor who plays the title role is exceptionally good. The only flaw it does have is the score. A few parts were pretty good but on the whole it wasn't that great. sometimes being a little distracting even. Most, if not all of Tarkovsky's signature style is laid down in this film but he would take all that even further with his epic masterpiece that was his followup to this film, Andrei Rublev. Great debut by one of the greatest filmmakers to ever contribute to world cinema. 9/10",
            "review_date": "2009-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky's first major film is this wonderful drama about the loss of innocence and the horrors of war as seen through the eyes of a Russian orphan boy, and each shot is beautifully crafted, leading to a most poignant, devastating ending.",
            "review_date": "2009-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful film, like watching a poem on the screen, every shot is breathtaking. Tarkovsky's first feature about war, and the affects it has on children.",
            "review_date": "2009-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky's first major film is a wonderful piece of work, each take beautifully crafted, leading to a most poignant, devastating ending.",
            "review_date": "2009-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some solid creative flares, beautiful photography, etc., but the core of the piece seems rather flimsy to me.  If this film has any ultimate point to get across, its what the evil Germans did to poor Russia and what the brave Russians did to fight back.  And yes, the Germans absolutely did horrible things and yes, countless Russians (including children) showed incredible bravery and fortitude in fighting back - all these things are undeniably true.  However, all countries have plenty of blood on their own hands. Pointing the finger at the other guy, while giving your own kind the thumbs up, is the easiest, most convenient thing in the world to do.  Even when not distastefully done, even when true, even when a pro-peace comment is thrown into the mix - i just don't see the value in it.  I know people have suffered and i know that they want their stories told, but unless I'm willing to look at myself and my kind as a contributor to a problem as universal as war, I might as well stop pretending that I'm somehow trying to help solve it.",
            "review_date": "2009-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film happens to be Tarkovsky's first full feature and we can really appreciate the greatness, already - a sign of things to come. Splendid cinematography is present and the story manages to avoid the banal faults of what you would expect in a war story. The spirituality and poetic images will stay with you for a long time - the beach scene, a dream sequence, with horses eating apples probably is one of the most striking and memorable ever made.",
            "review_date": "2009-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarkovsky's first. A bit different from the later films but you can see a master at work already here.",
            "review_date": "2009-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was horribly disappointed with this movie. However its still a great film.",
            "review_date": "2009-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully shot and poetic.",
            "review_date": "2009-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solidly and continually interesting drama that",
            "review_date": "2009-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I revised it after reading what Tarkovsky had written in his book Sculpture in Time about it. It was a great start hinting his vision clearly but not completely. I liked the output of the collabaration between Tarkovsky and Vadim Yusov as a cinematographer, it had begun beautifully in black and white, especially because the simple way of lighting that Vadim Yusov had focused on while shooting the vision of Tarkovsky in his debut.",
            "review_date": "2009-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a movie titled \"Ivan's Childhood\", I wish that Tarkovsky focused more on the childhood of said Ivan, instead of focusing on that romance between the two soldiers.",
            "review_date": "2009-07-04",
            "source": "rt",
            "lang": "en"
        }
    ]
}