{
    "rating": 4.1,
    "release_date": "Invalid",
    "num_reviews": 71,
    "genres": [
        "Holiday",
        "Comedy"
    ],
    "summary": "A curmudgeonly kitty (Aubrey Plaza) helps a little girl find the spirit and charm of Christmas, in a holiday adventure.",
    "reviews": [
        {
            "content": "No esperaba nada y me termino divirtiendo. Todo lo que podía imaginar antes de verla de ser para chicos, floja, barata y llena de memes esta ahí pero a la vez la película aprovecho eso y lo uso como recurso de humor. Me termine riendo bastante así que banco, ideal para pasar el rato en época de fiestas.",
            "review_date": "2022-12-30",
            "source": "rt"
        },
        {
            "content": "This movie was pretty funny and has a better story than Grumpy gives it credit.",
            "review_date": "2022-12-17",
            "source": "rt"
        },
        {
            "content": "The Kids Loved It, We watch it every year. This movie may not be perfect, but its a good memorial for grumpy cat. RIP internet legend.",
            "review_date": "2022-11-14",
            "source": "rt"
        },
        {
            "content": "This movie was a cashgrab on a popular meme, a meme I never liked, but it was far better than it had any right to be.  It also ended a meme that outlived it's welcome by over a year. Why did I see it? Because one of my Youtube reviewers said to give it a chance. It's definitely better than Pixels, Emoji Movie, & all those talking dog christmas movies combined.",
            "review_date": "2022-10-27",
            "source": "rt"
        },
        {
            "content": "Don't understand the poor reviews. It's a parody, what do people expect?",
            "review_date": "2022-10-25",
            "source": "rt"
        },
        {
            "content": "An enjoyably terrible Christmas special, Grumpy Cat's Worst Christmas Ever boasts scenes of random, unexplained weirdness, a very basic plot, overdoses on meta humour and has the usual schmaltzy, sentimental tone clashing with the grouchy nature of the late Tardar Sauce but Aubrey Plaza's improv allows for a few funny jokes to make it into the movie. At least you can say Grumpy Cat remained faithful to the memes that made her an icon, so she didn't become a complete sellout. Doesn't make this \"so-bad-it's-good\" made-for-TV Christmas movie any better, though.",
            "review_date": "2021-12-24",
            "source": "rt"
        },
        {
            "content": "Goofy, silly, predictable, lame bad guys, self-aware, and that's what makes it actually enjoyable. It's a goofy story but the jokes are good for a family movie. The lame characters are are actually enjoyable in their own way. The movie, for all its silliness has heart and the Christmas spirit in it. It's like a Hallmark Christmas movie but more entertaining and some laughs.",
            "review_date": "2021-12-21",
            "source": "rt"
        },
        {
            "content": "Best Christmas movie about a famous cat starring comic genius Aubrey Plaza ever made. A holiday classic that will become more important for generations to come.",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "An absolute must see! A true masterpiece! I cannot describe how much this movie changed my life!!! PLEASE WATCH THIS MOVIE!",
            "review_date": "2020-12-15",
            "source": "rt"
        },
        {
            "content": "For what it is it is fine. Grumpy Cat's Worst Christmas ever isn't excruciatingly bad. In fact I did laugh a little bit",
            "review_date": "2020-12-14",
            "source": "rt"
        },
        {
            "content": "Best movie ever PERIODT",
            "review_date": "2020-06-26",
            "source": "rt"
        },
        {
            "content": "This has become one of my favorite Christmas movies. It's edited for good fast self aware jokes and I love Aubrey Plaza and her interpretation on Grumpy. This is a good example of a modern Christmas movie.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "Meme: The Movie. We're at that point, people.",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "It plays with the fourth wall perfectly, and Aubrey Plaza is perfect for this role.",
            "review_date": "2019-01-29",
            "source": "rt"
        },
        {
            "content": "The only thing good about this movie is the Grumpy Cat. The voice over, plot line, casting, everything else, is cheap and cringy.",
            "review_date": "2018-12-02",
            "source": "rt"
        },
        {
            "content": "I don’t care what anyone says-I adore this movie! Grumpy and Aubrey Plaza are the greatest!",
            "review_date": "2018-12-01",
            "source": "rt"
        },
        {
            "content": "Best Christmas movie ever.",
            "review_date": "2018-11-25",
            "source": "rt"
        },
        {
            "content": "Yes!!!! Another actually good Lifetime movie, if not great.",
            "review_date": "2018-07-22",
            "source": "rt"
        },
        {
            "content": "absolutely love it. now part of my Christmas movie tradition.",
            "review_date": "2018-01-13",
            "source": "rt"
        },
        {
            "content": "Alright look. It's obviously low-budget, low-quality, cringe-inducing... the list goes on. But HEAR ME OUT. This movie KNOWS. It totally gets that it's not fooling anyone, not you, not even *itself*. But it's still going to give you its all anyway. It's not about the talent or skill of the actors, or tastefulness or presentation. What's REALLY going on here is that *they had fun making it*. Nobody goes into a Lifetime Original Movie thinking it's going to be a worthwhile investment of their time, let alone their AUDIENCE'S time - that's right, I was talking about the *staff* of this flick there. But dammit, they tried. Some may say \"they should not have tried\", but I say to you, this was inevitable. And of all the possible grumpy cat movies that could have flopped unceremoniously into your cable box, I promise you that this is the best outcome of them all. If you don't like it, no one can fault you... but if you find that sweet spot, where you can get in on the joke, where you buckle down and realize that we're all in this crapsack world together, you will actually find yourself laughing WITH these folks instead of just turning it off. I say give it until Grumpy Cat describes what a mall is, and if that doesn't make you think \"... okay, maybe I want to hear a little more\", go ahead and shut it off, no harm no foul. But if you can get just that far in, this might just be a worthwhile watch for you.",
            "review_date": "2017-05-15",
            "source": "rt"
        },
        {
            "content": "A funny self deprecating movie with enough cheese to become my christmas favourite",
            "review_date": "2017-01-24",
            "source": "rt"
        },
        {
            "content": "This movie is hilarious! The story about the idiot rock musicians and the greedy mall owner are not the reason to watch the movie; they are decidedly pedestrian. What makes this movie so terrific is the running MST3K-like commentary from Grumpy Cat. Had me in stitches.",
            "review_date": "2017-01-01",
            "source": "rt"
        },
        {
            "content": "This movie is truly awful.  It is just bad.  However, it is almost like a car crash that you can't quite look away from.  This will never be a classic Christmas movie, but I sadly have to admit that it did get me to laugh a few times.  I can't recommend it, but I will say that if you like awful movies, you might find some cringe-worthy fun with this one.",
            "review_date": "2016-12-07",
            "source": "rt"
        },
        {
            "content": "\"Grumpy Cat's Worst Christmas Ever\"  is as generic and forgettable as any modern Christmas film. Most of the characters were dull and unimaginative. You are constantly bombarded with poorly constructed fourth- wall breaking and distasteful merchandise advertising, making the movie appear to be nothing more than a blatant cash-grab. Ironically, Grumpy Cat herself lacks interest in the film she stars in and calls it a \"Terrible movie.\" (To which, I agree with her).",
            "review_date": "2016-06-26",
            "source": "rt"
        },
        {
            "content": "I love this movie!  Aubrey Plaza is the perfect Grumpy cat.  It's not Shakespeare, but it's fun, cheesy, and meta.  Along with It's a Wonderful Life and Scrooged, it's found it's way into my yearly Christmas must watch list!",
            "review_date": "2016-03-31",
            "source": "rt"
        },
        {
            "content": "I watched a bit. Maybe it's one for the kids. The memes are amusing, so I wasn't entirely sure what to expect with this one. But no, not for me. I also didn't really like the voice of the cat.",
            "review_date": "2016-01-31",
            "source": "rt"
        },
        {
            "content": "This was terrible. The jokes were terrible, and the voice actress for Grumpy Cat read her script terribly.\n\nBetter off as a bad internet meme or at least just a cute cat.",
            "review_date": "2016-01-03",
            "source": "rt"
        },
        {
            "content": "The self deprecating meta humor & the fact that the movie practically reviews itself should please any fan of \"so bad it's funny.\"",
            "review_date": "2015-12-24",
            "source": "rt"
        },
        {
            "content": "I love Grumpy but she deserves a better movie than this. Seeing her is cute but the story is forgettable and not as funny as it could have been.",
            "review_date": "2015-12-08",
            "source": "rt"
        },
        {
            "content": "Plaza was great as Grumpy Cat, but this is definitely a cheesy kid film with a few adult situations thrown in.",
            "review_date": "2015-11-04",
            "source": "rt"
        },
        {
            "content": "If you hate Christmas, decent cinema, & like seeing Aubrey Plaza make terrible voice acting decisions- this is the movie for you",
            "review_date": "2015-10-23",
            "source": "rt"
        },
        {
            "content": "Movie could have been so much more but was intentionally made bad. I don't know why. Probably watch this once every 10 years.",
            "review_date": "2015-09-17",
            "source": "rt"
        },
        {
            "content": "This is film type i like, it is bad commercial and it knows it, makes fun with it, and sarcasm, a ton of sarcasm. I love it. Very low budget B movie just for funz of it. \nWorth watching.",
            "review_date": "2015-03-07",
            "source": "rt"
        },
        {
            "content": "Loved it!! Need more Grumpy Cat movies!",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "Just the fact that this movie was based on a meme made me watch it. I don't think I watch it again though. It had some laughs but the whole movie felt cheesy and I just ignored the plot.",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "This is in no way supposed to be a good movie, in fact it relishes the fact in being a bad one. Very much the product of the internet age we live in but kind of in the way that someone who doesn't understand it would do it. Far too meta but not as bad as I thought it would be and far from the worst thing I've seen all year. Aubrey Plaza adds a level of enjoyability with her mostly improvised voice over and stops it from being a pointless bore. Far from terrible but in noway good.",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "so so movie may have been better with no commercials just to reduce time",
            "review_date": "2015-01-02",
            "source": "rt"
        },
        {
            "content": "Cute movie. I really enjoyed it but my only problem is that they could of got a better voice for grumpy cat than Audrey Plaza.",
            "review_date": "2014-12-29",
            "source": "rt"
        },
        {
            "content": "Fun for young kids but thin story.",
            "review_date": "2014-12-29",
            "source": "rt"
        },
        {
            "content": "GRUMPY CAT'S WORST CHRISTMAS EVER:(B+) \nI hadn't really followed this enterprise, at all... and despite knowing that Aubrey Plaza would voice the grumpster, here. I was quite skeptical. \nThankfully this was far more entertaining than expected... sure it has a hokey hallmark sheen to it, but it seems to exist, purely for Grumpy (Ms. Plaza) to effectively poke holes thru it all... without being too fatiguing about it, thankfully. There were also enuff grumpy non sequitur cut aways (mostly clever), to keep things interesting, when the pace nearly dragged. \n Apart from a mind numbing, gawdawful Steel Panther/Spinal Tap-esque subplot that added absolutely NOTHING (but irritation) to the story, I was quite amused and totally recommend the movie.",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "Let's take a picture that people have seen on the internet and make it a cult leader. Then take said cult leader and put it in its own movie. If this is a christmas movie, then convert me to Judaism.",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "worst xmas movie ever, i mean th\\ats what the cat said, but that cats a bit fucking grumpy, its not that bad",
            "review_date": "2014-12-26",
            "source": "rt"
        },
        {
            "content": "Commercial diarrhea.  Avoid.",
            "review_date": "2014-12-26",
            "source": "rt"
        },
        {
            "content": "Overall, a blatant cash-in of an internet fad that already had it's dead horse beaten enough.",
            "review_date": "2014-12-26",
            "source": "rt"
        },
        {
            "content": "Nothing like having a talking cat and its mouth not move with it. This movie was just stupid and lacking. The script was lacking and had cheesy dialogue for the cat to say.",
            "review_date": "2014-12-23",
            "source": "rt"
        },
        {
            "content": "Half-assed and a quarter.  Aubrey Plaza really phoned this one in with her higher whiney vocal range instead of her lower \"give no fucks\" vocal range.  She could have even Janet Snakeholed it up a bit in the dramatic fantasy segments, but nope.\n\nMegan Charpentier is pretty natural for a kid actress, and Russell Peters as the inciting incident Santa is the highlight of this weird, embarrassing effort.  The metatheatrical jokes are awkward and annoying, but they kinda won me over in the end, especially with the dig at Lifetime's typical programming.\n\nI have to say though, I'm pretty much over the Grumpy Cat pheno-meme-on.  Tardar Sauce isn't grumpy; that's just the way her face is shaped (http://vimeo.com/groups/184633/videos/54953791), and her owners can't pretend that the genesis of her name isn't obviously an off-color joke.",
            "review_date": "2014-12-17",
            "source": "rt"
        },
        {
            "content": "An absolute waste of time and resources. Stick to the Grumpy Cat memes instead.",
            "review_date": "2014-12-14",
            "source": "rt"
        },
        {
            "content": "this movie is hysterical, aubrey plaza is an absolute riot as grumpy cat lol",
            "review_date": "2014-12-12",
            "source": "rt"
        },
        {
            "content": "Was a pretty bad storyline, Grumpy Cat's voice was not how I imagined it, too gimmicky. Which is a shame because the YouTube star is fun for everyone",
            "review_date": "2014-12-12",
            "source": "rt"
        },
        {
            "content": "I never would have watched a Lifetime Channel Christmas movie except that I read a review that said Aubrey Plaza was voicing Grumpy Cat. The film is  a rather lame hybrid of \"Doctor Dolittle\" and \"Home Alone.\" Grumpy Cat is an unwanted pet in a mall pet store where all the pets can talk to one another. When two bumbling criminals break into the mall over Christmas, it's up to Grumpy Cat and a girl who can talk to her and identifies with her grumpy outsider personality to outwit the bad guys through Macaulay Culkin-like antics. That part of the film is pretty lame, but Aubrey Plaza's snotty delivery of Grumpy Cat's various interjections are enough to have made me enjoy this TV movie. I also appreciated that the film made fun of itself and holiday films in general, which helped not make the film too much of the usual Christmas sappiness.",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "Should be titled worst Christmas movie ever.....couldn't make it to the second half but the first half was worse then troll 2 in regards to bad movies.....",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "This is very juvenile...and horrible (Subtitle suggestion: \"Also The Worst Grumpy Cat Movie Ever! And Hopefully the last.)",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "If they hadn't scored Aubrey Plaza for this, it would be much much worse.  Her ad libbing throughout the movie (including trashing various plot points as they occur) makes this movie watchable.  Not \"Laugh out Loud\" funny, but entertaining.  You hate this movie?  Grumpy Cat does to.  Don't expect any dazzling writing, directing or acting.  You came to see the f***ing cat, you're gonna get the f***ing cat.  Ironically it's equally as entertaining as the internet meme.  If you don't like the meme then why are you watching this in the first place?  Critics take this movie more seriously than the movie itself does.",
            "review_date": "2014-12-06",
            "source": "rt"
        },
        {
            "content": "Watch this movie it's funny love it this movie is rated PG!!!!!!!!! TRUST ME",
            "review_date": "2014-12-05",
            "source": "rt"
        },
        {
            "content": "Never once did I imagine an interenet meme becoming a film, but then again, ideas are few to none these days, so here it is. I will admit, I felt obligated to view this film, but I am glad I did. Is \"Grumpy Cat's Worst Christmas\" ever the worst movie ever? No, but it is not very good either. The film begins ver self-aware and continues on that notion throughout, but the film becomes a little repetitive and annoying. Having about a million fourth wall jokes get's a little old, even if you are trying to be aware. There are films out there with the smarts to do it right, and althoug this makes a slight attempt, it still comes off as a ham-fisted sloppy comedy. I really loved Aubrey Plaza's voice, and here monotone voiceover acting is what made this so enjoyable. With some very bland writing, a cliched plot, and characters that children may not even care about, \"Grumpy Cat's Worst Christmas Ever\" tries really hard, and while it does have it's clever moments, it ultimately falls short. Underwhelming, but not unexpected.",
            "review_date": "2014-12-05",
            "source": "rt"
        },
        {
            "content": "It was dumb and cheesy but I enjoyed it. I thought it was lightweight, but cute and sardonic. Grumpy was adorable and the witty lines were apropos for the meme.",
            "review_date": "2014-12-04",
            "source": "rt"
        },
        {
            "content": "Terrible terrible horrible Christmas movie with grumpy cat???? Grumpy cat??? Why does a cat need its own movie, this isn't Garfield.",
            "review_date": "2014-12-02",
            "source": "rt"
        },
        {
            "content": "Somehow it's not horrible.",
            "review_date": "2014-12-02",
            "source": "rt"
        },
        {
            "content": "In the vein of \"UHF\", a contrived plot to spotlight a popular personality into. In this case: A CAT! So for adorable-ness alone this gets 4 stars. However, I laughed much more than I thought I would, so I do give it a positive review regardless of the fact its a TV movie starring a cat that is trying to sell its audience merch. What's more American than that? It passes the Bechdel test, but sadly is lacking people of color in its cast.",
            "review_date": "2014-12-01",
            "source": "rt"
        },
        {
            "content": "I wouldn't have sat through five minutes of this movie if my children would have let me turn it off. Awful.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "Actually pretty funny.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "This is a big what the Frick moment for me. This movie's trying to be like The Smurfs movies, the Transformers movies and the Alvin and the Chipmunks movies, but it kind of backfired.\n The story is nothing special here, it's just Home Alone INA mall with a girl and a iconic cat. That's literary what it is. But I do like the movie's humor. Some jokes are funny in the first act, but the remaining are just pop culture references and fourth wall jokes that are kind of funny but then it gets annoying real fast. But the joke I hate the most is it's marketing joke. It markets you to buy these merchandising once your done seeing the movie, this is just The Cat in the Hat all over again. \n The visuals are pretty much the same but worst. There's barely any of them and some of them are pretty cheesey, they're corny, they're hammy, their pretty much a chessey ham sandwich with a side of corn. \n The characters aren't that engaging either. First we got Crystal, who's this down to earth character with a heart of gold but doesn't have any friends. Then we got the cop and the thrives who are pretty annoying and all they do is be evil and make pop culture jokes. Guess who does what. Finally we got Grumpy Cat, who's just grumpy and that's it, no description why just that she's grumpy. And about 80% of the movie is her making jokes. \n Grumpy Cat's Worst Christmas Ever should have hinted to me it'll be a pretty bad movie.  Nothing here works as a movie and it's mean spirited tone doesn't help either. Hopefully, Hollywood won't make a sequel to this like Grumpy Cat said. What's next Hollywood would make a movie on Pewdiepie or Tetris or something.\n\nStory: 5/10\nVisuals: 2/10\nCharacters: 5/10\nTotal: 5/10",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "Perfect spoof of Lifetime and Christmas movies. Aubrey Plaza's sarcastic performance plus the continual sassy remark to the audience directly makes Grumpy Cat's Worst Christmas Ever the funniest movie you'll see in a long time. This movie is terrible, don't get me wrong, but in its own way it's perfect.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "All I have to say is that is a lifetime movie! People are rating it like it was release to the big screen. It was good for what it was.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "Not the worst Christmas movie I ever saw, but definitely a forgettable one to say the least. The only bright spot was Grumpy being such a frump and spout wise cracking remarks. \n\nAnd to the movie's credit, it was honest with what it was: A marketing gimmick. A terrible one at that, but at least the movie didn't try to lie about its true purpose.\n\nWith that said, I doubt I'll ever want to see this stupid flick again. Not even Grumpy, as funny as she was at times could not save it. It was just a trainwreck with a plot we've seen pretty much every year at Christmas time.\n\nAnd yet, it'll most likely get a sequel. Ugh...",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "Lol cute movie. They could of done a better job casting the voice of grumpy cat though.",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "A successful attempt at turning an Internet meme into a feature length movie for the first time!",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "I hated it. Home Alone meets corny Lifetime movie",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "Very Unappealing and so hard to watch, Grumpy Cat's Worst Christmas ever is very unoriginal, annoying and unfunny so much so that not even grumpy cat's funny face can save the movie.",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "For the over-the-top comedy it was supposed be, it was ok. We laughed and groaned at the corny jokes. If you like Tarder, it's cute enough.",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "awful film that is a mess.  the movie was advertising to me to buy stuff.",
            "review_date": "2014-11-29",
            "source": "rt"
        }
    ]
}