{
    "rating": 2.6,
    "release_date": "Invalid",
    "num_reviews": 140,
    "genres": [
        "Kids&family",
        "Comedy",
        "Animation"
    ],
    "summary": "Messy and mischievous Marmaduke has a big heart but can't stay out of trouble! Does he have what it takes to shine in the swanky dog show world?",
    "reviews": [
        {
            "content": "atrocious, heinous, barbarous, these are all words used by the same person (me) to describe this movie, not only is Pete Davidson in it, there's bad scripting, bad voice acting and overall bad animation, its like most of Pete's lines were just off the dome, and lets not forget abt marmaduke, he was so weird, the fact that he was as big as a kangaroo was scary, and how much dept he caused his family. I think only a visually impared, deaf person could like this movie. there was just SO much wrong with it. and there were also some continuity errors, like in one of the very first scenes when marmaduke caused a tsunami, the dad said \"diggity dang that dog\" HE DIDNT EVEN SEE THE DOG. and if i had to cover the character designs, this would be an entire essay. but all i have to say is that this is a TERRIBLE MOVIE, do NOT recommend",
            "review_date": "2023-04-26",
            "source": "rt"
        },
        {
            "content": "Best movie ever! Terrible animation, bad outdated jokes, so good! 5 stars!",
            "review_date": "2023-04-22",
            "source": "rt"
        },
        {
            "content": "it sucks so much to the point I think I would give it a negative number if I could",
            "review_date": "2023-04-18",
            "source": "rt"
        },
        {
            "content": "whoever animated this should never touch a mouse again! 🔥🔥🔥💯💯💯💯",
            "review_date": "2023-04-18",
            "source": "rt"
        },
        {
            "content": "Watching the trailer was making everyone wanting to not exist in to this movie and people who watch this ask and made god question why and yea including atheists too",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "the best movie ever on earth better than puss in boots the last wish!!!",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "The animated is better than that horrible remake",
            "review_date": "2023-04-09",
            "source": "rt"
        },
        {
            "content": "i dont even need to say",
            "review_date": "2023-04-06",
            "source": "rt"
        },
        {
            "content": "A true masterpiece, an inspiring story about a compassionate and loving dog against insurmountable odds. Top tier animation, and amazing plot. Makes so called \"mAsTeRiEcEs\" like The Sawshank Redemption and Forrest Gump look like trash like the mediocre mess that is things like The Godfather and Breaking Bad. Totally worth the four hundred hemorrhages I got when Marmaduke farted",
            "review_date": "2023-03-25",
            "source": "rt"
        },
        {
            "content": "If you gave this a good review, you've either never seen an actually good movie or are writing from a mental hospital.",
            "review_date": "2023-03-21",
            "source": "rt"
        },
        {
            "content": "the dog is attractive",
            "review_date": "2023-03-19",
            "source": "rt"
        },
        {
            "content": "What even is this pile of rat vermin?",
            "review_date": "2023-03-18",
            "source": "rt"
        },
        {
            "content": "it got half a dollar less then mucklorna",
            "review_date": "2023-03-05",
            "source": "rt"
        },
        {
            "content": "My grandson loves it",
            "review_date": "2023-03-04",
            "source": "rt"
        },
        {
            "content": "Honestly looks more like a bad YouTube short animation.",
            "review_date": "2023-03-01",
            "source": "rt"
        },
        {
            "content": "Marmaduke was a spectacular piece of cinematography, some may say a work of art. The plot of a dog who was doubted his whole life due to his lackluster looks wins over the hearts of all those who visit the dog show, his rival: a snarky poodle is trying to sabotage his success. At the end of the day he comes out victorious. The sheer amount of jokes in this movie is quite appealing, it enticed me to the point where I watched this cinematic masterpiece nearly 40 times! Everyone should watch this movie, kids, parents, elders, & anyone alike. All attempts at hilarious comments landed perfectly. All in all this movie is five stars.",
            "review_date": "2023-02-27",
            "source": "rt"
        },
        {
            "content": "No. Just. No. I... No.",
            "review_date": "2023-02-19",
            "source": "rt"
        },
        {
            "content": "I shall breaketh thoueth revieweth chaineth of zero stareths.",
            "review_date": "2023-02-19",
            "source": "rt"
        },
        {
            "content": "This movie is so good how could you hate a dog?",
            "review_date": "2023-02-19",
            "source": "rt"
        },
        {
            "content": "Absolutley brilliant. I love when marmaduke said \"it's marmadukin' time\" and marmaduked everywhere. Cinematic masterpiece right here. Chefs kiss 👌👌👌",
            "review_date": "2023-02-15",
            "source": "rt"
        },
        {
            "content": "Wost movie i ever watched it has a 1999 budget",
            "review_date": "2023-02-13",
            "source": "rt"
        },
        {
            "content": "such a good mivie me woved it i wa sooooooo god 5o5",
            "review_date": "2023-02-09",
            "source": "rt"
        },
        {
            "content": "Best movie ever 💯💯💯💯💯",
            "review_date": "2023-02-08",
            "source": "rt"
        },
        {
            "content": "Pete Davidson phoning it in ha ha so refreshing. Take some acting classes you lazy lottery winner. Absolutely dreadful watching and I bet your kids hate it too. ",
            "review_date": "2023-02-06",
            "source": "rt"
        },
        {
            "content": "I love where Marmaduke says \"that's what the point of the mask is\". Truly a life changing film.",
            "review_date": "2023-02-06",
            "source": "rt"
        },
        {
            "content": "this movie sucks, not to mention pete davidson is in it.",
            "review_date": "2023-02-04",
            "source": "rt"
        },
        {
            "content": "A 2022 film with toy story 1 graphics and incohesive \"jokes\" while still trying to appeal to kids like illumination's version of the Grinch. This movie is… something.",
            "review_date": "2023-02-04",
            "source": "rt"
        },
        {
            "content": "This anamation is worse than Earwig and the Witch.",
            "review_date": "2023-01-31",
            "source": "rt"
        },
        {
            "content": "This may well be the worst movie ever. Don't expose yourself or your kids to this.",
            "review_date": "2023-01-27",
            "source": "rt"
        },
        {
            "content": "I puked at how terrible the animation was, -22/10",
            "review_date": "2023-01-21",
            "source": "rt"
        },
        {
            "content": "Super cute and funny my son really enjoys it🥰 we watched it three time in a row.",
            "review_date": "2023-01-19",
            "source": "rt"
        },
        {
            "content": "Absolute disappointment, one of the worst movies i've honestly ever seen in my life.",
            "review_date": "2023-01-17",
            "source": "rt"
        },
        {
            "content": "so great should be100000000000000000 5-star revews",
            "review_date": "2023-01-17",
            "source": "rt"
        },
        {
            "content": "This movie was life changing!! I love the part where Marmaduke said\"It's duking time\" and Marmed everywhere!",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "bruh. the worst thing ever.",
            "review_date": "2023-01-12",
            "source": "rt"
        },
        {
            "content": "There are some movies that are so bad, they're good. This is not one of those movies. The fact that Pete Davidson (whose work I generally enjoy) and JK Simmons (whose work I generally love) star in this film is absurd. I wonder if either of them had read the script before showing up to record.\n\nThe animation is subpar (the body proportions are creepily . . . off), the voice acting is rough (sounds like reading the script), and the mouths regularly don't match with the voices. I honestly hope to never watch this movie again.\n\nI usually go with the best, but I have to do the worst for this film:\n\nWorst Character: Phil\nWorst Scene: The Talent Show\nWorst Quote: \"Bacon. . . b b b . . . bacon\"\nWorst Song: \"The Marmaduke Rap\"\n\nNote: \"Marmaduke\" is best described using the facepalm emoji.",
            "review_date": "2023-01-11",
            "source": "rt"
        },
        {
            "content": "As much as I love Brian Hull's voice talent, this is not a good way to go when your career's just beginning (After Hotel Transylvania 4)",
            "review_date": "2023-01-07",
            "source": "rt"
        },
        {
            "content": "if i had to pick between watching this or sit in jail for 20 years i would pick jail",
            "review_date": "2023-01-05",
            "source": "rt"
        },
        {
            "content": "loved it so funny!!!!",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "I really love Marmaduke from 2022, because it will be one of my favorite movies ever.",
            "review_date": "2022-12-30",
            "source": "rt"
        },
        {
            "content": "this movie is booty they r making bad movies on purpose /srs",
            "review_date": "2022-12-28",
            "source": "rt"
        },
        {
            "content": "Life changing. Best movie I've ever seen 10/10",
            "review_date": "2022-12-27",
            "source": "rt"
        },
        {
            "content": "Wow I mean just wow what kind of brain dead producer decides that this is good to go well f*** them cause I could have been watching bone the greatest book series of 2010 but instead we have marmaduke the the literal fart of a movie where the biggest plot point all in all the worst movie in three years of bad movies",
            "review_date": "2022-12-24",
            "source": "rt"
        },
        {
            "content": "sussy balls amogus ejdnsfejskdnfekjsn bruh.\n\nI can't believe they watched the movie before releasing it and still released it.\nit was bound to get 0%.",
            "review_date": "2022-12-18",
            "source": "rt"
        },
        {
            "content": "Absolutely amazing, the animation was jaw dropping, and the dialogue was SO FUNNY! An absolute must see among peers. It has the most amazing ending, I loved it when the guy did that thing! (you'll know what I mean soon)",
            "review_date": "2022-12-15",
            "source": "rt"
        },
        {
            "content": "Is this a fetish movie or something? There was literally farting and burping every minute in the hellish movie.",
            "review_date": "2022-12-12",
            "source": "rt"
        },
        {
            "content": "this movie was very very very very very very very good when marmaduke farted I could smell it through the screen and my dad even came back with the milk!! 😏😏",
            "review_date": "2022-12-09",
            "source": "rt"
        },
        {
            "content": "This movie gave me a tingling feeling that only my uncle can give me. It was so refreshing to watch a beautiful work of art that this movie is after this horrible year so far for cinema. I truly think the only bright spots this year for cinema were this masterpiece and the amazing Morbius.   \n\nThis movie has some of the quirkiest and goofy jokes i've ever heard that had me laghing and giggling all night long. Especially when Marmaduke farted the many times that he did I just couldn't stop giggling. The animation was so high quality I completely under stand the 6 morbillion bit coin they spent on it. \n\nI applaud Netflix and Pete davidson for making Marmaduke come to life from the screen. I kid you not I could smell the farts from the screen every time he farted and they were so good. I have rewatched this movie 689 time since it's release and it was amazing every time. 100/10 must watch!",
            "review_date": "2022-12-05",
            "source": "rt"
        },
        {
            "content": "It's absolutely horrible.\nFirst of all the character designs are goofy like the mom's design tried to ripoff a Pixar mom.\nSecond of all the story is boring, and also why does the dog trainer fight the dog?\nThird of all the movement bruh the movement like some characters hop other's walk funny. okay that is my review I know it sucks but bye.",
            "review_date": "2022-12-05",
            "source": "rt"
        },
        {
            "content": "How bad can a movie be? The animation is horrible and I can't remember any jokes.",
            "review_date": "2022-12-03",
            "source": "rt"
        },
        {
            "content": "worst movie i've seen. like ever. and why is Pete Davidson in this movie",
            "review_date": "2022-11-30",
            "source": "rt"
        },
        {
            "content": "Thhiis muuvie is te bes thin me has evrey seeeen MAlethramlalarddukee is sooooooooooooo goods becuz Mahrsgarimaliduke is so funny andd al of the kid luvs him sooooo much, becuz i realy wan to smel/lik marlihgramadukeess tos and wen the traener did the meggga kic. marhajukaremesduke was like u beter cuver yoer ise becuz marimalikseduke is my babi boi and wen hi faerted al the kids wur lik oh this toca toosday fart diablo crunchy delicious poopy droopy sloopy smelly household pasty chicken nugget supreem and Me andd Marma d Want tooo lowkey be their, like yummy fertss marimeralarrlduke and let mi feeel dose toess.",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "It seems like a comedy written by someone trying to think of what other people would think is funny. The story is bland, but at least it follows a point a to point b approach, and the ending is confusing. The animation is also not very good but based on how long it took to make this movie, the animators weren't given enough time to make things work well. It was a bad idea that was executed poorly and should have been given much more time to come to fruition. There's a reason most animated movies take four years, not one.",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "I have a no idea of why they let a 6 year old right this show.",
            "review_date": "2022-11-25",
            "source": "rt"
        },
        {
            "content": "im not 2 month old anymore, im now 2 years old",
            "review_date": "2022-11-25",
            "source": "rt"
        },
        {
            "content": "Animation is poor and story line is very predictable. Can you give us a break, Marmaduke?",
            "review_date": "2022-11-22",
            "source": "rt"
        },
        {
            "content": "This is a bad movie overall. The animation is bad. The storyline is bad. And even the jokes are bad. My kids hated it I hated it all of us hated it.",
            "review_date": "2022-11-21",
            "source": "rt"
        },
        {
            "content": "There are no redeeming qualities in this movie. This is the most tedious children's film I have seen in my life. The plot and characters are very confusing as well, and it's almost impossible to understand what message this movie is trying to deliver.",
            "review_date": "2022-11-18",
            "source": "rt"
        },
        {
            "content": "There is nothing good about this movie. This is the most unamusing children's movie I have ever watched, probably because it makes little to no sense.",
            "review_date": "2022-11-18",
            "source": "rt"
        },
        {
            "content": "One of the worst animated movies I've ever seen.",
            "review_date": "2022-11-16",
            "source": "rt"
        },
        {
            "content": "I cannot even begin to describe how perfect this movie is Everything about it is amazing the voice acting the animation the characters and the plot. it is the best movie i have ever seen and am hoping for a sequel",
            "review_date": "2022-11-14",
            "source": "rt"
        },
        {
            "content": "How is this movie as bad as it is!?",
            "review_date": "2022-11-06",
            "source": "rt"
        },
        {
            "content": "the animation was so weird and nothing made sense to me",
            "review_date": "2022-11-05",
            "source": "rt"
        },
        {
            "content": "Marmaduke is possibly the best movie I have ever seen in my life, it is truly a masterpiece with unbelievably amazing writing  Shakespeare may have written Romeo and Juliet but he could never have written something as powerful and incredible as Marmaduke. The characters, the dialouge, the plot, everything is structured so perfectly, Marmaduke has changed my life for the better. 10/10 would recommend, absolute masterpiece, I would have never expected this from a kids movie.",
            "review_date": "2022-11-01",
            "source": "rt"
        },
        {
            "content": "God tier man. Why this is bad? No Bru this movie slaps. Even the the characters are built like giraffes the ate broccoli, this slaps🖐",
            "review_date": "2022-10-27",
            "source": "rt"
        },
        {
            "content": "Horrible movie, bad graphics, horrible acting, and why is Pete Davidson in this movie?",
            "review_date": "2022-10-22",
            "source": "rt"
        },
        {
            "content": "the animation is horrible and is a copy for scooby",
            "review_date": "2022-10-16",
            "source": "rt"
        },
        {
            "content": "Bullshit do not watch unless you're a little kid who would eat anything up",
            "review_date": "2022-10-13",
            "source": "rt"
        },
        {
            "content": "why are people hating this is cracked",
            "review_date": "2022-10-07",
            "source": "rt"
        },
        {
            "content": "It was just terrible",
            "review_date": "2022-10-06",
            "source": "rt"
        },
        {
            "content": "This movie changed my life. Before this movie, I had severe depression and was on the verge of ending it all. Then, I decided to watch one more movie, and landed on the 2022 classic of Marmaduke. I watched it and instantly I was hooked. It brought me back to my childhood, all the happy memories flooding my brain. I laughed, I cried, I laughed again, and I cried again, it was the most beautiful moment of my life. When the movie ended I sobbed of joy, knowing now I had a reason to keep going, I had Marmaduke. Thank you Marmaduke, I owe you my life.",
            "review_date": "2022-09-27",
            "source": "rt"
        },
        {
            "content": "Best movie I have ever seen. It's impressive how god tier every element of it is. I cried throughout the whole movie, the voice acting is incredible, the soundtrack is perfect, the symbolism and worldbuilding are expert... This truly is the Dark Souls of Japanese Shoot em Ups.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "This movie was life changing and I think if you don't see it you will be left in the shadows, before I watch this movie I could lift 10kg, I'm now benching 3,000kg. I have also recently got back with my model girlfriend and my dog came back from its grave all because of this spectacular movie!!! Thank you for your time. 😘😘",
            "review_date": "2022-08-27",
            "source": "rt"
        },
        {
            "content": "This movie is so terrible I think it gave me chronic diarrhea. Do not watch this unless you are suicidal.",
            "review_date": "2022-08-27",
            "source": "rt"
        },
        {
            "content": "it was very bad and also the animation was awful. there were also too many fart jokes.",
            "review_date": "2022-08-26",
            "source": "rt"
        },
        {
            "content": "changed my life for the better i got so inspired by the fart jokes and marmaduke was so funny after watching i got a job got married and had kids and retired all in a week!\nthey both died the day they were born but they had a good run at least they saw marmaduke too\ni died and wrote this in the afterlife pp poopoo",
            "review_date": "2022-08-25",
            "source": "rt"
        },
        {
            "content": "That was Fantastic, Marmaduke is very good movie.",
            "review_date": "2022-08-24",
            "source": "rt"
        },
        {
            "content": "One of the worst movies I've seen on Netflix the jokes were awful the movie would drag and the movie was all over the place -10/10",
            "review_date": "2022-08-24",
            "source": "rt"
        },
        {
            "content": "The humans don't Evan walk they hop",
            "review_date": "2022-08-24",
            "source": "rt"
        },
        {
            "content": "This movie sucks never make the mistake of watching this movie The animation looks like 20 years old The jokes aren't even funny at all this is just a stupid cash grab if you want to watch a movie with your kids never watch this movie",
            "review_date": "2022-08-21",
            "source": "rt"
        },
        {
            "content": "This movie is absolutely horrible.",
            "review_date": "2022-08-21",
            "source": "rt"
        },
        {
            "content": "I hated it. It's not funny, the animation is horrible and it barely has a story. If you want a dog movie, watch secret life of pets. (which is pretty horrible too but much better)",
            "review_date": "2022-08-19",
            "source": "rt"
        },
        {
            "content": "Horrible animation and trashy plotline. There are questionable scenes that will make you lose brain cells. I feel bad for Pete Davidson. 0 stars.",
            "review_date": "2022-08-18",
            "source": "rt"
        },
        {
            "content": "Amazing movie, personally my favourite of all time. The deep and intricate plots really tie the whole thing together as well as the amazing world building. What a twist at the end, just amazing.",
            "review_date": "2022-08-17",
            "source": "rt"
        },
        {
            "content": "I would rather fight the strongest man I the would then look at this film again",
            "review_date": "2022-08-14",
            "source": "rt"
        },
        {
            "content": "Truly a movie if I had to be real with yall",
            "review_date": "2022-08-12",
            "source": "rt"
        },
        {
            "content": "This movie slapped harder than me at the oscars\nWhen the marmadussy let out that devious gas I marbed so hard\nthis movie changed my life and forever will change my life MUST SEE",
            "review_date": "2022-08-11",
            "source": "rt"
        },
        {
            "content": "Why? To think that this could be a half medeocre film, one would have to have had their brain frozen with liquid nitrogin. Marmaduke represents why I can't feel happiness. I stayed up watching this piece of horrendous garbage with my closest friend, and still that did not make it anywmore tolerable. All in all, I hope the people who made this grand atrosity will feel great shame for this. Ben.",
            "review_date": "2022-08-03",
            "source": "rt"
        },
        {
            "content": "I'd rather eat my own rat-infested toes than have to watch another second of this absolutely atrocious excuse of a kid's movie.",
            "review_date": "2022-08-02",
            "source": "rt"
        },
        {
            "content": "Dear God, no, put him back in the doghouse!",
            "review_date": "2022-07-25",
            "source": "rt"
        },
        {
            "content": "Maybe the worst movie I've ever seen. The animation is just unpleasant and horrendous. It feels like the voice actors did not want to be in the movie and wanted to kill themselves. This movie is an embarrassment to cinematic entertainment. My 5 year old would think the same way.",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "It's the worst animated movie that Netflix has ever released. This should have never been made. Anyone who made this movie should be ashamed of themselves.",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "I found this movie to be a bit of a surprise to me. Despite what everyone else may think, I believe this movie was a great decision from Netflix and Pete Davidson. Great voice acting work and pretty decent animation. Along with a great story!",
            "review_date": "2022-07-18",
            "source": "rt"
        },
        {
            "content": "the worst film I've ever seen, the animation style is disgusting, and the comedy isn't funny, this is supposed to be a kid's film but I don't see how a kid could enjoy this film either.",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "The only way you can enjoy this movie is if you have a fart and/or inflation fetish\n\nor maybe if you really really REALLY enjoyed the character design in the adams movie",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "The art style disgusts me so much, I could not finish it, it hurt so so bad so ugly...  Guy is lowkey kind of hot though. iykwim",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "Honestly this was a great film. Statistically, it was as goated as Morbius.",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "What a masterpiece of a movie, this is nothing short of a wonderful way to completely waste your life, what ever happened to the bad movies. So far this year we've only been blessed with the spectacular masterpieces of Marmaduke and Morbius. Bring Marmaduke to cinemas😐",
            "review_date": "2022-07-16",
            "source": "rt"
        },
        {
            "content": "This was just horrible, not even fun horrible.",
            "review_date": "2022-07-16",
            "source": "rt"
        },
        {
            "content": "Story is not engaging.  Animation is barely up to the standards of the late 90's.  Voiceover mixing is poor.  Music is out of place and unoriginal.  I don't know how much Netflix spent on this but the only animated movies I have seen them churn out so far (that they didn't purchase from the major studios) were nailbitingly bad.  This was no exception.  I'm afraid they don't have long to survive without being acquired.",
            "review_date": "2022-06-18",
            "source": "rt"
        },
        {
            "content": "You are in worst Animation I ever had!",
            "review_date": "2022-06-16",
            "source": "rt"
        },
        {
            "content": "This movie is awful. The animation is terrible and I can't believe they had Jk Simmons in this movie. I love Jk Simmons but he's too good for this garbage \"film\". If you can even call it that. The animation is terrible and every characters are god awful and the character designs are unappealing and let's not forget about the annoying racist stereotype characters as well. This even has vore in it...in a kids movie. What were they thinking? This is nothing but a soulless fetish film that makes no sense at all. The plot to this is just awful as well, this movie makes no sense at all. This movie deserves to be burned in a pit of fire. DO NOT WATCH THIS MOVIE!!! THIS MOVIE IS TERRIBLE!!! So yea, this movie is not animation or a film, it's just a hot steaming pile of dog turd they think would be entertaining for a 2022 movie. That's how bad it is.",
            "review_date": "2022-06-08",
            "source": "rt"
        },
        {
            "content": "Before watching Marmaduke, I was a drug addict and I was cheating on my wife, but after watching this masterpiece I started seeing the beauty of life and changed myself for the better",
            "review_date": "2022-06-01",
            "source": "rt"
        },
        {
            "content": "The film should be a cartoon reboot series.",
            "review_date": "2022-05-30",
            "source": "rt"
        },
        {
            "content": "I would rate this 0 stars. A sorry excuse for animation. No effort put into this. poorly directed.",
            "review_date": "2022-05-28",
            "source": "rt"
        },
        {
            "content": "They should have left this Marmaduke in a hot car",
            "review_date": "2022-05-27",
            "source": "rt"
        },
        {
            "content": "This movie is outrageous!",
            "review_date": "2022-05-24",
            "source": "rt"
        },
        {
            "content": "(0/0)\nWorst film I have ever watched!\n\nOh, my, where do I even begin with this film?\n-In the first few minutes of the film, we see Marmaduke being barricaded in his room, where the owners selfishly lock up their dog in a room, and for what? Misbehaving?\n-Watching Guy kick Marmaduke in his, let's say... groin... shows that the producers and the studio who have produced this film are promoting and normalising animal cruelty. I mean, what am I even watching?!\n-The training scene? The concept behind it was the only good moment in the film because it referenced Nintendogs, but the production company executed it poorly as it was just filler!\n-How is watching Marmaduke getting injured funny? It isn't.\n-$100 is way too expensive for dog shampoo, the most expensive for that product is around $60-70.\n-Plot Hole: How does Marmaduke even know who Zeus is?!\n-Zeus isn't even a good villain! What type of villain even lures somebody into eating a lot of food?\n-Marmaduke's burping and farting are created using green smoke clouds. Speaking of, that isn't even good.\n   It is also worth noting that Marmaduke's farting had potentially killed a lot of wildlife for how big it was. Realistically, a big fart would kill everyone in the entire planet's population, as seen in \"SML Movie: Jeffy's Coma\".\n-The animation drops in frame rate in most scenes, and the characters' arms and legs are pretty thin, not matching the character's proportions. Even their necks and legs make the human characters look taller than they usually should in real life. The animation even looks like a cheap, bland video game released for a Nintendo 64, Dreamcast, Nintendo GameCube, PlayStation 2, PlayStation or XBOX console.\n\nOverall, this film is just nothing but nonsense; I recommend watching another film with a simple story. I could have rated it 0/5 stars, but Rotten Tomatoes' possible rating is 0.5 out of five.\n-Nakiebra \"Keebie\" Palmer",
            "review_date": "2022-05-23",
            "source": "rt"
        },
        {
            "content": "worst movie ive ever seen becuase the characters desighns dont work it looks like half a tothpik along with much more",
            "review_date": "2022-05-23",
            "source": "rt"
        },
        {
            "content": "poorly animated and bad jokes. the part where marmadukes stomach was just moving is somewhat disturbing. not very interesting storyline too.",
            "review_date": "2022-05-23",
            "source": "rt"
        },
        {
            "content": "It lands right smack-dab in the middle of Uncanny Valley. A disappointing stain on the history of digital animation.",
            "review_date": "2022-05-23",
            "source": "rt"
        },
        {
            "content": "I give it a 5/5 awesome movie although the animation style is like 20 years old it still has a good story and a great message the message you wonder the message is even though someone was bad doesn’t mean they are bad",
            "review_date": "2022-05-22",
            "source": "rt"
        },
        {
            "content": "\"eh bowss, I have a cancer!\"\n             -Pink guy, the man who has more braincells then Netflix higher ups right now!",
            "review_date": "2022-05-22",
            "source": "rt"
        },
        {
            "content": "Worst movie of the year so far, it makes the 2010 live action Marmaduke movie look like a cinematic masterpiece compared to this mess",
            "review_date": "2022-05-22",
            "source": "rt"
        },
        {
            "content": "satan made this, but unlike morbius, this wasn't an amazing 666% amazing hit.\n0/10 no zakir naik.",
            "review_date": "2022-05-21",
            "source": "rt"
        },
        {
            "content": "It was an animated disaster, and I hate it! I hate it even one bit!",
            "review_date": "2022-05-21",
            "source": "rt"
        },
        {
            "content": "The plot could have been written by a 2 year old and it would have been better. No one deserves to sit through an hour-thirty of the pure garbage that was this movie.",
            "review_date": "2022-05-21",
            "source": "rt"
        },
        {
            "content": "One for the kids. The young ones at that...",
            "review_date": "2022-05-20",
            "source": "rt"
        },
        {
            "content": "it was the BEST MOVIE IV'E EVERY WATCHED",
            "review_date": "2022-05-19",
            "source": "rt"
        },
        {
            "content": "It's uncomfortable to watch.",
            "review_date": "2022-05-19",
            "source": "rt"
        },
        {
            "content": "It was REALLY bad. Bad music, boring voice acting, disgusting animation, and overall, a piece of shit.",
            "review_date": "2022-05-17",
            "source": "rt"
        },
        {
            "content": "I can't believe Netflix approved of this movie to be on their service as for netflix films I'm not surprised in it's horrible quality, most netflix things are mediocrity at best, but honestly they should have just said that this movie was destroyed in a fire so it would have never seen the light of day. Dont waste your time watching it. Watch the Original if you want an actually good Experience.",
            "review_date": "2022-05-16",
            "source": "rt"
        },
        {
            "content": "Enjoyable animated story that's fun for the family to watch of this beloved cartoon character brought to life on the big screen.",
            "review_date": "2022-05-16",
            "source": "rt"
        },
        {
            "content": "Really, the acting is ok but the movie, producers, script itself is poor. Wasted 1hr on this!!",
            "review_date": "2022-05-15",
            "source": "rt"
        },
        {
            "content": "Hands down one of the worst movies I have seen. And most of the 5* reviews are made by 12 year old monsters.",
            "review_date": "2022-05-15",
            "source": "rt"
        },
        {
            "content": "Worst movie ever no explanation.",
            "review_date": "2022-05-13",
            "source": "rt"
        },
        {
            "content": "I think Netflix is better to put Marmaduke down after this Trainwreck\nHere is my full review\nhttps://youtu.be/3J_h9M9WG44",
            "review_date": "2022-05-13",
            "source": "rt"
        },
        {
            "content": "Once in a lifetime do you get the pleasure of watching a movie such at Netflixs 2022 movie Maramaduke. I feel like my eyes were blessed while I was shows nothing but greatness. Marmy Duke really makes me feel like I am being thrusted right into the center of the action. There are two scences in marhama Dhuke that I find really amazing. The first scene is the opening Water oh no oh no maharaja Duke why did you have to jump in there now everyone is dying and all the kids are dying becaue you just drowned the universe Mahrama Dhukjue whyyyyyyy whyyyyy i cant even believe that marhmyu Juke even would do that oh my godddd everyone is dead and all the kids are crying. The second scene that really stood out to me was the Maharahama benihana duke farting so much in the trophy and then the guy was like This is me on Taco tuesday and then Mohogany Duke ripped a fat juicy wet wet turbo action juicy lawnmower supreme diablo sauce taco tuesday oh my god nobody can even breathe there is so much marmammoth duke ( Lowkey tho I wanted to be the air when so I could smell Marharamk hallmark Duke Bellisse bussy) (Asking for a friend tho but like jk asking for myself though (PleASe someone turn my friend into the air by Mararajahah DUKE) (But lowkey tho but when i say my friend I totally dont mean me)( But i totally do mean me tho (Sike) (Not sike). P.S- I Mean my friend PS2- I dont mean my friend.  - Love Marma D",
            "review_date": "2022-05-12",
            "source": "rt"
        },
        {
            "content": "This movie was a MARMA-DUKEY of an experience. I haven't laughed this hard since my pet hamster named Hampty explosive sharted into the microwave and cooked himself. My favorite part of this movie was when the dog named MARM of the DUKE, made a little dukey and then said \"UUUUHHHHH OOHHHHHH!!\". This will easily go down as one of the films that was made. THIS WILL SAVE NETFLIX FROM BANKRUPTCY.",
            "review_date": "2022-05-12",
            "source": "rt"
        },
        {
            "content": "Marmaduke is one of the movies I've ever seen! I love when Marma Duke farted and then he said Uh Oh!",
            "review_date": "2022-05-12",
            "source": "rt"
        },
        {
            "content": "Great movie great cast so funny animation is on point best movie of the year will definately rewatch and recommend to my friends",
            "review_date": "2022-05-12",
            "source": "rt"
        },
        {
            "content": "This movie is an absolute abomination, I can't believe that Netflix looked at this and even approved it",
            "review_date": "2022-05-12",
            "source": "rt"
        },
        {
            "content": "This is one of the greatest movies I've every seen, the only movie that I think compares to this one is Morbius, but this one might be even better than Morbius, I'm not sure I might have to give it a few hundred rewatches before I can make a decision. This movie no doubt will bring Netflix's stock price all the way to the moon and I cant wait to see it. I'll just leave this here MARMADUKE (Marmaduke 2022) SWEEEEEEEEEEEEEEEEEEEP!!!!!!!!!!!!!!",
            "review_date": "2022-05-12",
            "source": "rt"
        },
        {
            "content": "Yeah, well the mediocre Marmaduke live action was better. THIS LITTERALY HAS NONE/SILLY PLOT AND THE CHARACTERS LOOKS LIKE A MOBILE GAME ONES.",
            "review_date": "2022-05-11",
            "source": "rt"
        },
        {
            "content": "The 2022 version of Marmaduke is EVEN WORSE than the 2010 live action Marmaduke movie. Don't watch this. Read the comic strip and the 1981 animated TV series instead!",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "Marmaduke sucks! Kenny the Shark from Discovery Kids had it better than that!",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "This is the absolute worst film to ever be made. \n\nWarning (!) Spoilers:\nFirst being BEYOND over,  the animation was terrible, and there was no meaning to this film\n\nFirst, the film being beyond over, what I mean by that is when (SPOILERS) marmaduke first jumped into the pool and suddenly the whole neighborhood or universe got covered in water. Seriously? That was so unnecessary, way too over, and not funny at all same goes to the part where marmaduke randomly went and pooped on the trophy, the amount of farts that was spread was beyond over.\n\nSecond, the animation being really terrible, where are we? In the 2000? The animation is just like these terrible animations you would watch YouTubers ranting about. There's not much to say about the animation right now but all I could say is that ONLY IF YOU PUT WAY MORE EFFORT ON THE ANIMATION THEN THE FILM MAY HAVE BEEN A LITTLE BETTER.\n\nAnd last which I consider the LEAST is that there was no meaning to this film, are you kidding me right now? My mother likes to watch movies at cinemas that provide great meaning to it, but instead my mom wasted her money for this trash. (SPOILERS!!) after guy quit training  marmaduke, then after while when marmaduke came, all who watched the movie know when guy refused to train marmaduke for the embarrassment he has done, marmaduke SERIOUSLY TRAVELS SOLO WITH HIS BARE LEGS AND HANDS TO MANY COUNTRIES IN A DAY THEN STARTS TRENDING ON THE MEDIA?! ARE YOU JOKING ME? MARMADUKE IS A DOG WHY WOULD REPORTERS REPORT THIS ON THE MEDIA AND MAKE THIS GO VIRAL?! And when marmaduke came back after \"PROVING\" he isn't just any dog without skills, out of NO WHERE A WHOLE CROWD APPEARS BEHIND HIM ENCOURAGING MARMADUKE?! And the part I hate the MOST when the kid calls guy a FAILURE and was about to walk away, guy eventually feels MOTIVATED? BY BEING CALLED A FAILURE WOW EVENTUALLY THE KID SAVED EVERYONE'S LIVES BY CALLING GUY A FAILURE AND GETTING HIM BACK TO TRAINING MARMADUKE JUST BECAUSE NO ONE HAS EVER CALLED HIM A FAILURE. \n\n\nIf I could rate this film a 0 I gladly would but I can't.\nPlease do NOT waste your money or time watching this TERRIBLE FILM!",
            "review_date": "2022-05-08",
            "source": "rt"
        },
        {
            "content": "This spits in the face of the live action movie that i grew up with. Disappointing.",
            "review_date": "2022-05-07",
            "source": "rt"
        },
        {
            "content": "That was awful terrible animation, voice acting is not very good Pete Davidson sucks but J.K Simmons was a good voice here and overall the movie was just awful",
            "review_date": "2022-05-07",
            "source": "rt"
        },
        {
            "content": "The movie didn't have good quality  and animation",
            "review_date": "2022-05-06",
            "source": "rt"
        }
    ]
}