{
    "rating": 8.7,
    "release_date": "Invalid",
    "num_reviews": 30,
    "genres": [
        "Hindi"
    ],
    "summary": "Benares, the holy city on the banks of the Ganges, deals out cruel punishment for those who do not respect moral traditions. Deepak, a young man from a poor neighborhood, falls hopelessly in love with a young girl from a different caste.",
    "reviews": [
        {
            "content": "The movie was set in the valleys of Ganges... focussing a two sided story of a young woman and a young man...The story was appealing and every character has equal roles in making film more beautiful...The movie discusses about social taboos and casteism in India...The director,Neeraj ghaynwan has put a great effort to make the movie more of a masterpiece.... Because the story strictly has it's politics showing the complexity and pressure due to  societal conditions in India. Or in other words I can say it's a journey through grief and complexity in an indian context. The acting of debut artist Vicky kaushal was praiseworthy. As I mentioned the movie discusses social conditions in India as well as about sexual morality.. We can clear see how caste and money divides indian society in this movie.\nOverall the movie was great❤️",
            "review_date": "2020-07-19",
            "source": "rt"
        },
        {
            "content": "Best movie I have ever seen.",
            "review_date": "2020-06-25",
            "source": "rt"
        },
        {
            "content": "a brilliant movie. not in the list of the best Indian movie on my list but surely up there with the best!",
            "review_date": "2020-05-04",
            "source": "rt"
        },
        {
            "content": "At once a both smart and powerful film, Neeraj Ghaywan's \"Masaan\" is a very fine film for our generation. A youthfully entertaining drama about love and curiosity, this is a film which shall be remembered not for how it rattles our tranquility, but for how it shakes the core of your heart. And that's the best compliment I can afford for an Indian film in recent times. It's the best Hindi film of the year- and easily the most compelling one. Don't miss it.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "যাই বলবো কম হয়ে যাবে। \nBeyond of my words.",
            "review_date": "2019-12-22",
            "source": "rt"
        },
        {
            "content": "Underrated masterpiece.",
            "review_date": "2019-11-16",
            "source": "rt"
        },
        {
            "content": "One of the greatest masterpiece ever made in the history of Indian Cinema.",
            "review_date": "2019-01-20",
            "source": "rt"
        },
        {
            "content": "if you want to see a lot of drama this is the movie. I like the predictible final. good actings.",
            "review_date": "2018-10-26",
            "source": "rt"
        },
        {
            "content": "Massan, I really liked the movie, It captures the rhythm of rural Indian town with its hopes and passion perfectly. It is a part of the new generation of indie films which are bringing realistic and sensible drama to the Indian cinema. Good direction and screenplay with some beautiful shots of Banaras. The casting is superb, got a few of my favourite performers, the ones who are great character actors.",
            "review_date": "2018-10-02",
            "source": "rt"
        },
        {
            "content": "Welcome to the beautiful part of Bollywood, actors like Sanjay Mishra, Vicky Kausal and Richa Chaddha were at their best in this movie.",
            "review_date": "2018-07-29",
            "source": "rt"
        },
        {
            "content": "Heartbreaking and beautiful.",
            "review_date": "2016-08-04",
            "source": "rt"
        },
        {
            "content": "Extremely superb movie. Brilliant direction, outstanding acting, heart quenching emotion, etc just can't stop appreciating the movie. Perfect relevance to the social mindset. Bonus: Fantastic music",
            "review_date": "2016-06-16",
            "source": "rt"
        },
        {
            "content": "One watches movies like these and begins to rightfully think, why do these creative masterpieces not earn the millions, the commercial catastrophes end up earning in a week?",
            "review_date": "2016-05-24",
            "source": "rt"
        },
        {
            "content": "A superb story with interesting characters quite well interpreted into a movie. Lots of taboo topics for the conservative Indian culture but well dissected here. Very unlike a Indian movie with a realistic story line and very real. A great watch and showing the true potential of Indian cinema",
            "review_date": "2016-05-03",
            "source": "rt"
        },
        {
            "content": "Deeply claustrophobic, which I would assume is the intent. It chokes, and asphyxiates, without any relief. I often wonder how to engage with this form of cinema, where any enjoyment in the filmmaking feels impossible and voyeuristic.",
            "review_date": "2016-03-29",
            "source": "rt"
        },
        {
            "content": "The serious romantic story that restores your faith in true love, being a one woman man, a good father, a good son and daughter. Justice has been done with the story by great direction, production and acting by everyone. anyone can watch this movie. And it will leave you amazed with the life you always wanted to live while growing up but got distracted on your way with all the hype and judgemental society.",
            "review_date": "2016-03-28",
            "source": "rt"
        },
        {
            "content": "A very refreshing movie... very realistic about life in India (maybe setup in 1980s)... This is how the movies should be made and watched... Great Job.. It is not a typical commercial/formula movie though if you are looking for that.",
            "review_date": "2016-03-23",
            "source": "rt"
        },
        {
            "content": "Lovely lyrical directorial debut. An indo-French production which juxtaposes the old with the new- a society in flux- beautifully filmed and ending on a redemptive note through all the sadness .  Flawed- the pace does flag at times and the plot lines may be a bit pat- but lovely to watch.",
            "review_date": "2016-02-06",
            "source": "rt"
        },
        {
            "content": "heart touching story with great acting & incredible direction. recommended.",
            "review_date": "2016-02-06",
            "source": "rt"
        },
        {
            "content": "It's amazing how simple, yet complicated hinterland can be. Some visuals were really surprising that shows how little we know about the world around us.",
            "review_date": "2016-01-04",
            "source": "rt"
        },
        {
            "content": "dark, depressing and touching",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "'Masaan' is the latest triumph in the wonderful artistic surge that Indian cinema has seen in the last two or three years. The film tells two tragic stories with brutal realism; yet it also contains much joy and romance, and the latter don't feel any less real. This is a work of beautiful sensitivity and sincerity from first-time director Neeraj Ghaywan.",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "vThe beginning starts from an end. A simple plot very well written and directed with life. The casting is simple but their performances are extraordinary. 2 Thumbs Way Up . A Must Watch for those who are passionate about pure cinema.",
            "review_date": "2015-12-18",
            "source": "rt"
        },
        {
            "content": "Masaan is what we call original. It is what Bollywood could have been.\nThumbs up!!",
            "review_date": "2015-12-06",
            "source": "rt"
        },
        {
            "content": "Masaan - A Wonderful work of art. It has been ages since I watched something as emotionally captivating as this. This is a film that every cinema lover ought to watch. I can't say enough good things about Masaan. Richa Chadha and Sanjai Mishra nailed it, while other new/ young actors were at par, wonderful screenplay and good story telling. I fell in love with the way writers connected the title - Masaan (crematorium) to the lives of lead characters. Hats Off to Phantom Films - Highly Recommended. 4/5\n\n#ILoveBollywood #NotEverythingInBollywoodIsShit",
            "review_date": "2015-11-25",
            "source": "rt"
        },
        {
            "content": "Superb Movie All-round",
            "review_date": "2015-11-14",
            "source": "rt"
        },
        {
            "content": "Masaan is a beautifully scripted, powerfully acted, sensitively crafted drama, that starts on a stark note depicting the irreversible damage done to individuals when they are robbed off their personal freedom and in midst of its dark setup, the story finds a subtle way to place a young bud of hope.... One of the few movies that refuse to leave you long after credits roll...",
            "review_date": "2015-11-09",
            "source": "rt"
        },
        {
            "content": "Incredibly complex and emotional story of romance, sex, caste, grief, police brutality, family, shame, and Indian societal structure as it's changing in modern times. A truly evocative, visually gorgeous, well acted, and thoroughly thought out movie on complex topics.",
            "review_date": "2015-08-18",
            "source": "rt"
        },
        {
            "content": "For more exciting reviews visit my website www.KalpeshPrajapati.com\n\nMasaan is an excellent movie filled with emotions.  Love, lust, hate, desire, angst, fear, depression, excitement, embarrassment, shock, surprise, sorrow - You name it and this movie not only has it but also outstandingly presents it on screen as well.\n\nThis wouldn't have been possible without the outstanding performance of the actors in this movie. Sanjay Mishra has already proved his talent of performing serious roles in earlier movies and he does it again. Richa Chaddha too is outstanding in her no-nonsense role. The new comers have also done their part really well.\n\nThis movie has 2 stories running is parallel, still none of them loses focus for even a minute. The cinematography is outstanding to such a level that it will make you feel the story is real.\n\nThe nuances of lower caste house and their discussions, the helplessness of a common man harassed unnecessarily by ..... Continue reading on http://kalpeshprajapati.com/category/movie-blog/",
            "review_date": "2015-08-10",
            "source": "rt"
        },
        {
            "content": "Masaan in its English translation means crematorium, but the film, in its wider release, is named Fly Away Solo. This dichotomy of tone between the translations can be seen throughout the film and that is where Neeraj Ghaywan scored in his brilliant debut feature. The film is uplifting but heartbreaking, reflecting on both sorrow and hope and thus transcends to something that can be as refreshing as the morning air.\n\nIn Masaan, the story, set in Banaras, is woven around two primary protagonists, Deepak(Vicky Kaushal) and Devi(Richa Chadda). One of them faces tragedy early in the film, and the other one sees its devastating form later. But, predictably, and here 'predictably' should not be taken in a negative way, both of their lives converge; one finding closure through struggle and another solace amidst loneliness.\n\nMasaan is not plot-driven, but character-driven; the like we see in Iranian and Romanian new wave films. It is not much of a story-telling than portrayal of life on screen. Life and the elements that control it; namely society, religion, family, love and death. This is where Masaan triumphs. It is hard yet poignant, heartbreaking and yet poetic; because life is all of those.\n\nMasaan dwindles on life and death like its name. Death is a prominent figure in the story and And it is not only two protagonists' eyes we see life at Banaras through; we see it through the eyes of Vidyadhar Pathak too. A guilt-ridden and simpleton father struggling to protect his daughter, Devi. Pathak's attempt to diminish the distance between him and his daughter is one of the key points of this film.\n\nWriter Varun Grover and Director Neeraj Ghaywan deserves all the accolades and plaudits they received in the film festival circuits. Masaan creates a flurry of small yet memorable characters in form of Jhonta, a boy working as apprentice in Pathak's shop, Sadhya Ji, Devi's colleague in Railway office and the antagonist Police Inspector Mishra. All of them were necessary elements that framed the picturesque story in Masaan.\n\nVicky Kaushal and Richa Chadda led the performances by churning out superlative display. Kaushal's portrayal was simple and charming while being in love and effortlessly devastating in front of death. Chadda was subdued but strong, much like her character. However, it was veteran actor Sanjai Mishra who shone as Pathak. His nuances while Pathak was trying to remain strong in trying times were impeccable and bound to bring a tear or two when he broke down. Special mention for Pankaj Tripathi who played Sadhya Ji.\n\nMasaan is one of those films where everything clicks. If you praise writing, direction and performances of actors, you cannot simply leave the cinematography and music of the film. \"Tu Kisi Rail Si...\" and \"Man Kasturi R...\" would definitely strike a chord of melancholy in viewers.\n\nMasaan is a beautiful of piece of lives in a world you definitely would not want to miss from experiencing.\n\n4.5/5",
            "review_date": "2015-07-30",
            "source": "rt"
        }
    ]
}