{
    "rating": 7.9,
    "release_date": "Invalid",
    "num_reviews": 7,
    "genres": [
        "Japanese"
    ],
    "summary": "Shuhei's erratic mother feels threatened when he starts to awaken to a world beyond her distorted control, sending the family hurtling toward tragedy.",
    "reviews": [
        {
            "content": "This is one of those films where you just want to reach in and slap some sense into some of the characters.  I must admit, however, to do so would remove the sublime tragedy underlying the story.  If you're looking for an uplifting feel-good story look somewhere else.  But if you appreciate realistic drama I recommend this one.",
            "review_date": "2022-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely Fascinating",
            "review_date": "2021-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, not terrible, not great either. Characters and storyline are pretty one dimensional - I guess that's the point.",
            "review_date": "2021-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Digs deeply into how relationships can be as toxic as other addictions.  Family & society fail as the slow grind of life takes every minute of this movie to tell the story.",
            "review_date": "2020-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Akiko (Masami Nagaswa) is mother to Shuhei (Daiken Okudaira). At the beginning, we see Akiko (who is 7) and Shuhei playing; his mom allows him to play hooky from school so that they could spend the day together. As the film progresses, we begin to see more clearly who Akiko is: She is a mess, a woman who has drinking problems, a chronic gambler who constantly loses any money she has, is narcissistic, and manages to find ways to get Shuhei to do what she wants – begging for money and food, staying by himself eating uncooked noodles when she runs off with a man.  No matter how messed up she is, she manages to attract men (if not the right ones). The film advances 5 years, where we see Akiko has never gone to school and is begging and stealing to support his mother. The film is mesmerizing, even if it is difficult to watch. Nagaswa has to be the worst mother in film; I was trying to find one who is close, and I think it probably is Mo'Nique's portrayal of the girl's mom in Precious, but Nagasawa is clearly worse. She is a wonderful actor and manages, in spite of her vileness, to keep the viewer fascinated with her. Okudaira is also really good (as is the boy who plays the younger version of Shuhei); he has been ensnared in this codependent relationship with his mother and, in spite of her self-centeredness and emotional abuse toward Shuhei and others, stills love her. She is, after all, his mother. The film gets a thumbs-up from me; it is well-acted and convincing, even if it is a bit of a downer and a bit too long. It is sad, but it captured my attention and got me rooting for a boy whose life was mostly a lost cause.",
            "review_date": "2020-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must see movie!  Japanese family values are at stake.  Sad results.",
            "review_date": "2020-11-07",
            "source": "rt",
            "lang": "en"
        }
    ]
}