{
    "rating": 2.4,
    "release_date": "Invalid",
    "num_reviews": 130,
    "genres": [
        "Kids&family",
        "Comedy"
    ],
    "summary": "Government agents and a beautiful thief (Kelly Lynch) pursue a myopic millionaire (Leslie Nielsen) who unknowingly possesses a valuable gem.",
    "reviews": [
        {
            "content": "It tries to makes us care about anything that isn't Leslie nelson, but in reality the funny part are all him. Every scene he steals, While the FBI, the CIA and his nephew drag. I have nostalgia for this one saw it growing up many times from the video rental store. I like it for one reason some scenes are funny does it hold up, not really.",
            "review_date": "2022-12-20",
            "source": "rt"
        },
        {
            "content": "13 going on 30 is great mark Rudd also is super sexy.",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "All ages; LOL!!!!!!!!!!!!! Funny and original. I miss Leslie Nielsen (who plays Mr. Magoo better).",
            "review_date": "2022-04-12",
            "source": "rt"
        },
        {
            "content": "I guess for kids it's amazing but if you have more that 6 years for sure you are not going to enjoy this movie.",
            "review_date": "2022-02-21",
            "source": "rt"
        },
        {
            "content": "Based on the UPA cartoon and starring Leslie Nielsen as Mr. Magoo. Leslie Nielsen was perfectly cast as the title character and does a good job in that role. The beginning and ending of the movie is animated in the traditional UPA style with Mr. Magoo who is voiced by Greg Burson. I enjoyed that transition from animation to live action. I also enjoyed the first third of the movie as the plot was being set up. But the last half of the movie went off the rails with too much going on and some characters and plot just disappearing until the very end. There is a white actor who dresses up, in disguise,  as an Indian and that didn't age well. There is also the question of how Mr. Magoo represents blind people. The latter was less of a concern for me as that is the heart of the original cartoons. There is a disclaimer at the beginning and end of the movie addressing both these issues. I did have one big laugh in this movie, when Mr. Magoo was cooking a chicken. But there should have been more with Leslie Nielson as the lead. This may have been a director issue. They had outtakes during the credits and even they were not funny. Hard pass this movie.",
            "review_date": "2021-11-14",
            "source": "rt"
        },
        {
            "content": "Leslie Nielsen is funny, but that’s about it. Special effects are bad. Script is bad. Story is bad. Hence the bad rating. ",
            "review_date": "2021-02-25",
            "source": "rt"
        },
        {
            "content": "A great movie with plenty of laughs that you can enjoy with the whole family. Leslie pulls off another great flick with his Naked Gun-esque.\n:)",
            "review_date": "2020-11-09",
            "source": "rt"
        },
        {
            "content": "1.8 average rating on Letterboxd? Ouch! I agree it's not good, but damn that's low.\n\nLeslie Nielsen is definitely the best part of the film, he plays the titular character very well. Jennifer Garner is also involved, but the support cast are all rather slack. The premise isn't, at least in my opinion, the worst I've ever seen but it's certainly pretty lacklustre and messy.\n\nI don't actually think 'Mr. Magoo' is 'that' awful though, except for the scene featuring brownface of course. Overall, it's a simple watch - one that doesn't take much attention. Probably worth watching only for Nielsen, and perhaps the dog.",
            "review_date": "2020-10-08",
            "source": "rt"
        },
        {
            "content": "Even the great Leslie Nielsen can't rescue this all around mess.",
            "review_date": "2020-10-06",
            "source": "rt"
        },
        {
            "content": "This movie was so boring not good at all not a laugh at all just puts you to sleep",
            "review_date": "2020-07-12",
            "source": "rt"
        },
        {
            "content": "Works well enough for fans, but it only has one joke.",
            "review_date": "2020-07-07",
            "source": "rt"
        },
        {
            "content": "Not only is this an objectively bad movie, but no one's even mentioned that one of the characters dresses in brownface as an Indian man in one scene. I was quite uncomfortable when I saw that, and I would be beyond embarrassed to show this movie to any child. Ironically, despite the immature nature of the comedy, there was not a single child present in the movie.",
            "review_date": "2020-06-04",
            "source": "rt"
        },
        {
            "content": "I went with 2 stars on this movie, I know a lot of people didn't like this movie but I did. Based on the cartoon of Mr.Magoo I thought that it was cute sure it was not all that funny but it held my interest and attention I have seen this movie a few times. Mr.Magoo is not everyone's cup of tea, watch it see if you like it if not that's fine too.",
            "review_date": "2019-12-31",
            "source": "rt"
        },
        {
            "content": "Poorly unfunny made comedy based on the Mister Magoo character of the 1940's movies -1960's TV series. Starring Leslie Nielsen, who I simply loved, hated him in this.",
            "review_date": "2019-12-12",
            "source": "rt"
        },
        {
            "content": "Considering that the cartoon is seen nowadays as just a cheap excuse for making jokes about \"ha ha, all blind people are idiots\", perhaps it was inevitable that this would be considered one of the worst cartoon-based live-action films of all time. And given that this was before the Alvin and the Chipmunks phase and in a world where these adaptations such as The Flintstones and the James Gunn-written Scooby-Doo features were at least trying to be good movies, that's saying a lot. Leslie Nielsen could've worked in the title role and he does look the part of a character whose design is impossible to 100% replicate entirely in live-action anyway but he's given such an awful script that it's downright depressing to see him in a movie like this. It's not too hard to see why this movie drew the wrath of a ton of blind advocacy groups. There's also a closing disclaimer which is sure to have people saying \"that's rich, coming from a movie whose premise relies on one joke: the title character can't see\" Definitely a low point in a subgenre that's already full of stinkers to begin with.",
            "review_date": "2019-09-29",
            "source": "rt"
        },
        {
            "content": "Leslie Nielsen is Mr Magoo in this movie. I grew up watching the cartoon. My kids and I were doubled over on multiple occasions. Leslie's delivery doesn't disappoint. ",
            "review_date": "2019-07-29",
            "source": "rt"
        },
        {
            "content": "I think Leslie Nielsen did a decent job as Mr. Magoo but the movie as a whole just becomes dull at some point.  This is one that you can skip, there are better Disney movies out there and definitely, better comedies!  Go watch The Naked Gun instead!  I rate it 2/5  OR   4/10",
            "review_date": "2017-07-31",
            "source": "rt"
        },
        {
            "content": "i love this moive lol i could care less what others think about it. was a kid and saw wow. so much tears from this stuff lmao. but no one go's look at the cartoon when its the same thing like the moive duh",
            "review_date": "2017-05-13",
            "source": "rt"
        },
        {
            "content": "Nearly unwatchable. (See what I did there?)",
            "review_date": "2017-03-09",
            "source": "rt"
        },
        {
            "content": "The humor and acting are extremely lame and lazy (even from Leslie Nielsen himself), and the story is the most one-note ever put on film. Definitely one of the worst live-action films based on a cartoon.",
            "review_date": "2016-12-24",
            "source": "rt"
        },
        {
            "content": "Visual gag driven to the point of being totally intolerable. Mr. Magoo forces the legendary late Leslie Nielson to play along in a mess that's painful from start to finish",
            "review_date": "2015-10-10",
            "source": "rt"
        },
        {
            "content": "This may have been the worst movie of the year...painful to watch.",
            "review_date": "2015-05-10",
            "source": "rt"
        },
        {
            "content": "I have this video as well.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "One of the worst family comedies of all time.",
            "review_date": "2015-02-11",
            "source": "rt"
        },
        {
            "content": "Waste of a good cast. Stupid far fetched (that's the way it's suppose to be, but...) movie that's not funny. Worst movie that I've seen with Leslie Nielsen. I'm sure there's worse!",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "Pretty bad movie. Not the funniest, not the smartest, but its faithfulness to the original cartoon with a great performance from Nielsen save this from being incredibly terrible.",
            "review_date": "2014-04-07",
            "source": "rt"
        },
        {
            "content": "When a priceless stolen gem accidentally lands in Magoo's (Leslie Nielsen) hands, a sinister plot is hatched by the thieves to get it back at all costs. That means clueless Mr. Magoo is in the centre of a perilous predicament he's not even aware of!Pitted against a dangerous, sexy jewel thief (Kelly Lynch) and her dim-witted sidekick, Magoo has only his blind faith in his nephew Waldo and his bulldog Angus to keep him out of harms way. \n\nalso stars Matt Keeslar, Nick Chinlund, Stephen Tobolowsky, Ernie Hudson, Jennifer Garner, Malcolm McDowall and Miguel Ferrer.\n\ndirected by Stanley Tong.",
            "review_date": "2014-01-09",
            "source": "rt"
        },
        {
            "content": "It's hard to make good comedy films all the time as Leslie Nielsen proves here.",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "Every xmas I feel the need to watch any old rubbish. Object achieved for 2013 then with this load of tripe.",
            "review_date": "2013-12-21",
            "source": "rt"
        },
        {
            "content": "Bad. Borderline awful. I want my 90 minutes back!",
            "review_date": "2013-12-14",
            "source": "rt"
        },
        {
            "content": "Mr. Magoo is a funny film!",
            "review_date": "2013-11-27",
            "source": "rt"
        },
        {
            "content": "Long story short, Mr. Magoo wasn't a Disney live-action comedy film for the whole family. But the worst moment in any Disney movies, it's Mr. Magoo, fly upon a boat, over a waterfall, with a bride dress.",
            "review_date": "2013-10-17",
            "source": "rt"
        },
        {
            "content": "This Film Got A ''Two Thumbs Down'' On Siskel & Ebert.",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "In the late 90s, Leslie Neilsen had some awful films he was in, like Spy Hard and this wretched comedy. Disney had the same. Their live action films were awful, such as The Big Green and Meet the Deedles. But maybe the worst Neilsen and Disney comedy was the one and only Mr. Magoo.\nMr. Magoo, a classic cartoon about a blind elderly man, was never really funny to me or anybody I know. The one joke was all it was centered on and the formula for this joke, which wouldn't be funny in any cartoon, didn't work well. The film doesn't work any better, as Neilsen plays Magoo, a canned vegetable entrepreneur, who stops some bumbling jewel thieves along with his nephew Waldo. The film's jokes are so cheesy and old that it's near impossible to laugh. Magoo goes in several disguises in one scene and none of them are funny. The whole movie is a disgrace to the world of cinema, and that's all I can say.",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "just bad; definitely in the bottom half of nielsen's career, and that's saying something",
            "review_date": "2013-06-13",
            "source": "rt"
        },
        {
            "content": "Another silly cartoon turned into an unfunny movie with very few laughs and a story that seems like it was thought up in a few minutes",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "I was seven or eight years old when I saw this in theaters, and back then I thought it was the single funniest thing I have ever seen in my life. Looking back at it now as an adult, I can see why I loved it so much then. Do I like it now? No. Though if I am in the mood, I can watch it for nostalgic reasons.",
            "review_date": "2013-05-15",
            "source": "rt"
        },
        {
            "content": "I saw this as a child when it came out, and have loved it ever since. Yes it's ridiculous, yes, it's stupid, but I loved it because of that. It's funny and complete pants, in a good way.",
            "review_date": "2013-04-15",
            "source": "rt"
        },
        {
            "content": "Ah, this movie Mr. Magoo! Even though people think that this movie is a complete utter waste of time. It does have it's moments that make this movie funny. I can go through some of the bad first and then the good so it can please everyone. Mr. Magoo's first bad thing I would have to say is the cartoon opening. I don't know what it does for the movie except give us this classic funny animation, but to me it just seemed out of place and made the pacing of the movie weird in the beginning and at the end. Another thing that makes this movie bad is the director Stanley Tong's choice for making this film complete with a childlike mentality. It was like Tong was trying very hard just to appeal to children and no one else, this made the laughs between other characters not as good, it once again made it feel out of place like it didn't belong at all. The good about this movie is that for one there is a decent cast behind it...Leslie Nielsen, Nick Chinlund, Ernie Hudson, Jennifer Garner, Malcolm McDowell, it is a good list and they act pretty well despite the corny dialogue at times. Plus the story is, to me at least, engaging enough to see how a bumbling old blind man can clear his name from being a jewel thief and the actually crooks who bungled the mission because they were both going to turn on each other so they have to get through first to the accident prone Magoo to get it; which is quite funny. I also love the interactions between F.B.I. Agent Stupak, and C. I. A. Agent Anders as they argue over which one of them will solve the case first and receive all the acolaydes. Plus Leslie Nielsen is a little watered down as Mr. Magoo being that this is a kids movie, but he does have classic moments that only he can make which is when he is trying to sneak in to Austin Cloquet's headquarters to find out more about the diamond he accidentally had he has to become one of the nortorious gangster buyers Ortega Peru. Once he's inside he sees that all the mobsters have tattoo's and wanting to look normal he takes a magic marker and he draws one on his chest that looks ridicoulus, lol! Classic. So, if you get the time check the movie out, you may like it, you may not, but the choice is up to you. A 7 out of 10.",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "Mr. Magoo may not be my favorite cartoon, but it's leaps and bounds ahead of this idiotic movie!",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "A Great Famliy film, ya gotta love Leslie Nielsen!",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "Nielsen's charisma and some perfectly fine gags make this run-of-the-mill, late 90s Disney-cartoon-adaptation a little more tolerable than most of its peers. Doesn't mean you should see it.",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "I enjoyed this movie for Leslie Nielsen's zany performance, and McDowell's classic bad guy performance!!!",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "f off mate, naked gun was good but now ur pushing it!",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Mr. Magoo is not funny. It's poor slap stick with a shoddy script and characters that aren't even attpetive to be made intresting. Once in a while there is an okay stunt or scene, but when you put a painfully upnoxious cartoon sound effect over it, it looses all comedic value. And at the very end of the film where there is a disclaimer that \"the film was never intended to insult people with poor eye sight\", how is anyone with bad sight able to know that when the message is written in poor lettering. I wish i was visually impared so i wouldn't have to watch this movie again",
            "review_date": "2012-12-02",
            "source": "rt"
        },
        {
            "content": "Mr. Nielsen, you are better than this.",
            "review_date": "2012-09-26",
            "source": "rt"
        },
        {
            "content": "Why would Peru disguise himself as Magoo?",
            "review_date": "2012-09-26",
            "source": "rt"
        },
        {
            "content": "too long and too drawn out. the film could have ended half an hour earlier if the filmmakers were smart enough. but, aside from that, the film is over the top hilarious, stupid, and some scenes are smart. leslie nielson is the perfect man for the job of mr magoo, but he is let down by sometimes predictable storyline plots which is too fantastical to be believable. still, it's aimable comedy.",
            "review_date": "2012-09-12",
            "source": "rt"
        },
        {
            "content": "The classic Mr. Magoo is loveable and aims at avoiding to offend the blind or near-blind in the fun loving, flimzy movie. Filmed in British Columbia its best to be celebrated at the Razzies or on a rainy day (when their is nothing else to watch).\nLeslie Nielsen, is an actor who is either brilliant or abysmal depending on the material, veers towards the cliff.",
            "review_date": "2012-08-23",
            "source": "rt"
        },
        {
            "content": "When I was a kid, this film of Mr. Nielsen took me to laugh-out-loud days of my life... This was kinda thrilling actually... Every time he reaches the edge of the roof from a high storey  building...",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "I saw this one it originally came out, and thought it was a very bad film that didn't have anything going for it. This is one of Leslie Nielson's worst films, and it is an awful train wreck of a film with bad, stupid humor. This film is a total waste of time and it has absolutely no redeeming qualities about it. This is a stupid film from start to finish, one that really has no good comedic elements. This is sloppy filmmaking, and you can see that the end result wasn't too important for the filmmakers. I hated this film so much, and if you have the misfortune of seeing, it's one of those films that you wish you'd forget about. The film awful and with a poor script and poor performances, it fails at being a memorable comedy. The film should never have been made, and it falls flat more often than succeeds. This is a dreadful film definitely not worth your time. Considering that Nielson was in this, you'd think it would be funny. Unfortunately this is his worst performance ever, and it is a pointless comedy that just isn't funny. This film was bad, and had nothing going for it. With a poor script, poor acting and poor directing, this is one of the worst comedies that you could watch. Avoid this and watch something actually funny instead. Mr. Magoo is not a film worth watching, and it should be avoided. Watching paint dry was funnier than this film, and it is still to this day one of the worst comedies that I've seen, simply awful.",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "poor Leslie Nielsen, i feel sorry for that man for being in such a gigantic piece of dog shit movie that is not funny, and that is insulting to its nations in all sorts of ways, and it was one of the a box office disaster. It's not your fault, Nielsen, it's just numbers of very bad and horrible writing as well as directing. We'll miss you, Leslie. R.I.P.",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "Even as a youngster I never wanted to see this.",
            "review_date": "2012-05-29",
            "source": "rt"
        },
        {
            "content": "just ok version of UPA's classic anime character",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "Hillarius!!!!!!!!!!!!! LOVE IT",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "Between 2 and 2.5. Just to enjoy. Silly and not very funny, but watchable. Mainly for little kids.",
            "review_date": "2012-04-06",
            "source": "rt"
        },
        {
            "content": "Horrible idea and execution with Nielsen as the only slightly redeeming element. It fails to do what Nielsen's other slapstick movies excelled at and that's hammering you with a constant range of gags and letting the weak ones tide you over to the decent ones. The decent are far too few and long gaps break any goodwill those that worked can carry.",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "Watching Mr. Magoo I remember thinking \"o my God, this is so stupid.\"",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "expecting sumthing better but this is still quite a fun movie 2 watch.",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "i thought this movie was cute but really bad, nobody should go see. it is so cheasy and yet funny cheasy style. there is no shooting even though there are guns it is so wierd how they just dont fire though. i really dont think people will like it. sure there is a couple scences that is funny but that is it.",
            "review_date": "2012-02-06",
            "source": "rt"
        },
        {
            "content": "After Naked Gun he was not that good anymore. It is better to watch 100 min an empty bin instead this movie!",
            "review_date": "2011-07-26",
            "source": "rt"
        },
        {
            "content": "it is bad and a shame the talent involved didn't pick up on the poor script. Regrettably watched the entire film.",
            "review_date": "2011-07-18",
            "source": "rt"
        },
        {
            "content": "A complete disaster. Younger viewers may enjoy it though.",
            "review_date": "2011-06-24",
            "source": "rt"
        },
        {
            "content": "the best part is the windscene",
            "review_date": "2011-05-19",
            "source": "rt"
        },
        {
            "content": "Based on the old cartoon, Leslie Nielson plays Mr. Magoo, a clueless myopic millionaire who has to solve the case of a stolen ruby from his museum.  The CCTV footage makes him look like he was in on it so now he must hunt these ruthless jewel thieves down in order to clear his name. Coming along for the ride are his dog, Angus and his nephew, Waldo. There are more laughs in the original Mister Magoo cartoons but if you're looking for something light and silly then this may be the film for you. Also starring Kelly Lynch, Ernie Hudson, Jennifer Garner, and Malcolm McDowell!",
            "review_date": "2011-05-18",
            "source": "rt"
        },
        {
            "content": "Leslie Nielsen portraying Mr. Magoo is the only thing good about this movie. He'd did an amazing job, but too bad the rest of the movie didn't follow suit.",
            "review_date": "2011-04-24",
            "source": "rt"
        },
        {
            "content": "Disney took a chance and although they failed to impress critics and\nthe majority of Magoo fans, it still has a little charm to it. The movie is silly fun that makes Magoo look like he can handle anything that's placed or thrown in his way, even though he can't which makes it all the more unrealistic for a live-action cartoon.\n\nFor my full review of Mr. Magoo (1997), check it out on this IMDB link: http://www.imdb.com/title/tt0119718/reviews-49",
            "review_date": "2011-04-20",
            "source": "rt"
        },
        {
            "content": "Just like any other movie of this genre it looks more like a series of sketches rather than like a continuing narrative but Mr. Magoo had some undeniable charm in it what kept me going.",
            "review_date": "2011-04-17",
            "source": "rt"
        },
        {
            "content": "Not Leslie Nielsen's best work.",
            "review_date": "2011-04-12",
            "source": "rt"
        },
        {
            "content": "Leslie Nielsen portraying Mr. Magoo is the only thing good about this movie. He'd did an amazing job, but too bad the rest of the movie didn't follow suit.",
            "review_date": "2011-03-07",
            "source": "rt"
        },
        {
            "content": "It is certainly not a movie that would win an award for best story, but it was funny.  Not as funny as Naked Gun or Airplane, but Leslie Nielsen played the part of Magoo well.",
            "review_date": "2011-01-20",
            "source": "rt"
        },
        {
            "content": "Leslie Nielsen is great",
            "review_date": "2010-12-23",
            "source": "rt"
        },
        {
            "content": "obviously, this movie was not the most intellectually-stimulating, but i watched it multiple times as a child and absolutely loved it! let's remember that it's for little kids and not all you cynical adults",
            "review_date": "2010-11-28",
            "source": "rt"
        },
        {
            "content": "I love Leslie Nielsen and, you will probably disagree with me, its is just my opinion, but I honestly don´t agree with many of the negative reviews towards this movie. It may not be a great masterpiece and some of the performances are really weak, \"Mr Magoo\" is dum, silly and it made me laugh and that´s the main purpose, even if it is dim witted!",
            "review_date": "2010-11-25",
            "source": "rt"
        },
        {
            "content": "Liked this about 1/3 as much as I thought I would. 1/8. 1/16th.",
            "review_date": "2010-11-23",
            "source": "rt"
        },
        {
            "content": "When I was like 9 or 10 I used to love this film. But today its dated and stupid with bad acting. The bloopers at the end are funny at least with Leslie Nelson.... All well may be worth a watch to burn time.",
            "review_date": "2010-11-16",
            "source": "rt"
        },
        {
            "content": "I couldn't even finish this movie. It tries so hard to be funny that it utterly falls flat.",
            "review_date": "2010-10-12",
            "source": "rt"
        },
        {
            "content": "The nadir of Neilsen's career. Stick to the genius of the cartoon, avoid this like the plague.",
            "review_date": "2010-09-05",
            "source": "rt"
        },
        {
            "content": "if your blind and hear this movie it might be better............",
            "review_date": "2010-08-22",
            "source": "rt"
        },
        {
            "content": "I think they did a pretty good job of bringing Mr. MAgoo to life, but they could've done something more to elicit more and better laughs.",
            "review_date": "2010-07-12",
            "source": "rt"
        },
        {
            "content": "It falls flat. You can easily tell by how Mr. Magoo is going of the cliff.",
            "review_date": "2010-05-26",
            "source": "rt"
        },
        {
            "content": "the funniest part was the PC announcement at the end right before the credits.",
            "review_date": "2010-04-21",
            "source": "rt"
        },
        {
            "content": "Hilarious, This is one funny movie that you can watch over and over again.",
            "review_date": "2010-03-20",
            "source": "rt"
        },
        {
            "content": "Mr.Magoo is an eccentric millionaire with very bad eyesight who refuses to use eyeglasses and therefore always gets into trouble. During the museum robbery he accidentally gets a priceless gem called the Star of Kurdistan, and begins to trace the way for the arch-criminals whose idea was to steal the gem - Austin Cloquet and Ortega \"The Piranha\" Peru, while two federal agents Stupak and Anders lead the manhunt for Mr.Magoo himself.",
            "review_date": "2010-03-16",
            "source": "rt"
        },
        {
            "content": "It gets a bad rap for no good reason. Mr. Magoo is a silly good time. Leslie Nielsen is cast well as the title character. It's funny and entertaining. (First viewing - Late childhood)",
            "review_date": "2010-02-15",
            "source": "rt"
        },
        {
            "content": "wow i like hem so mush",
            "review_date": "2010-02-01",
            "source": "rt"
        },
        {
            "content": "Sitting on the tv and watching the couch for 90 minuates is more entertainig then this.",
            "review_date": "2010-01-31",
            "source": "rt"
        },
        {
            "content": "Ah, Leslie Neilson... why?",
            "review_date": "2010-01-08",
            "source": "rt"
        },
        {
            "content": "Mr. Magoo had potential to be pretty good and offers up a few pretty good jokes but fails to impress its audience on a few different levels.",
            "review_date": "2009-12-28",
            "source": "rt"
        },
        {
            "content": "a ridculously unfunny comedy.",
            "review_date": "2009-12-27",
            "source": "rt"
        },
        {
            "content": "lol i have a friend i call that way!!! cuz he drives horrible :p",
            "review_date": "2009-12-27",
            "source": "rt"
        },
        {
            "content": "I couldn't laugh at all about this crap called comedy.Jesus Christ,this movie is so lame.",
            "review_date": "2009-12-13",
            "source": "rt"
        },
        {
            "content": "The film was kind of dumb, but I enjoyed it.",
            "review_date": "2009-12-05",
            "source": "rt"
        },
        {
            "content": "I love Steve Martin and I remember the cartoon from when I was a kid.",
            "review_date": "2009-11-07",
            "source": "rt"
        },
        {
            "content": "This is it. I'll say it again. This... is... it. Everyone has one movie that they will remember forever as the single worst cinematic experience they have ever undergone. For that, this movie holds something of value. For everything else, there is nothing here of any merit whatsoever. Just a bad movie, plain and simple.",
            "review_date": "2009-09-28",
            "source": "rt"
        },
        {
            "content": "I haven't ever watched the cartoon of Mr. Magoo, but I always heard what it was about. I don't know why, but when I heard about Leslie Nielsen (one of the best comedy actors there is) starring in \"Mr. Magoo,\" I wanted to see it.\r\nMr. Magoo is a VERY visually impaired and wealthy man. He unfortunately gets involved in the middle of a plot that deals with thieves stealing extremely valuable jewels. Whether Mr. Magoo successfully gets out of the middle of the action or not, one thing's for sure, he sure needs a new eye doctor.\r\n\r\nUnlike what I've read from some of the other reviews, I didn't think that Leslie Nielsen did a bad job at all in \"Mr. Magoo.\" I do agree that the movie seems generic and that it is somewhat pointless, but I still moderately liked it. Mr. Magoo isn't trying to be funny, but he is, since he is nearly blind. You will see him do such things such as go fishing and catch a man, but think that he has a lunker of a fish, take what he thinks is a skiing detour, but that is actually the edge of a cliff, and a lot more.\r\n\r\nI thought Leslie Nielsen did a great job of acting like he was nearly blind, and the rest of the people in the film did ok, but not great, with the exception of the dog, who was brilliant.\r\n\r\nAs for the movie itself, \"Mr. Magoo\" isn't one of the best comedies and it's not one of the funniest, but I did think parts were hilarious. But there were also many parts that tried to be funny, that didn't even make me grin. All in all, it's a mixed bag of laughs and failed grins. If you're a fan of comedy movies and Leslie Nielsen films, I would recommend renting \"Mr. Magoo\" before buying it. NOTE: That was my Amazon review from the year 2001.",
            "review_date": "2009-09-14",
            "source": "rt"
        },
        {
            "content": "A funny movie, Leslie Nielsen is good but unfortunately he's usually better than the films he's in.",
            "review_date": "2009-08-30",
            "source": "rt"
        },
        {
            "content": "Do not take this movie seriously, that is the prime advice I'll give before watching this movie. Because this movie does not take itself too seriously, but sadly, if that has worked for some movies, for this one, it doesn't work too well, in part, because it has nothing to boast. Leslie Nielsen is a comedy actor that depends too much on scripts, either way, he's brilliant, or either way, he's below mediocre. His lead in this movie may give you an idea.",
            "review_date": "2009-08-25",
            "source": "rt"
        },
        {
            "content": "WHO WOULD'VE THOUGHT LESLIE NIELSEN COULD ACTUALLY PLAY A DECENT MR MAGOO",
            "review_date": "2009-08-08",
            "source": "rt"
        },
        {
            "content": "SEEN IT\r\nREVIEW COMING SOON",
            "review_date": "2009-07-27",
            "source": "rt"
        },
        {
            "content": "what a total mess, to think that I used to love Mr. Magoo.",
            "review_date": "2009-07-04",
            "source": "rt"
        },
        {
            "content": "not exactly a very good film and most people hate it, though it was an amusing fun watch for me that brought back memories from the first time I saw it",
            "review_date": "2009-06-27",
            "source": "rt"
        },
        {
            "content": "Nielsen is pretty watchable in almost anything including trash like this.  This is good proof that old classic cartoons should not be adapted to live-action.\r\n\r\nOh!  And how's this for irony?  The original cartoon was made by UPA a production team comprised of animators who went on strike from Disney.  Now, this film is produced by Disney!  Is that odd or what?",
            "review_date": "2009-05-28",
            "source": "rt"
        },
        {
            "content": "Not leslie Nielsen's best movie. A lot of daft scenes playing on Magoo's blindness. Mildly funny but no more than that. A lot of very poor actors in this one too.",
            "review_date": "2009-05-24",
            "source": "rt"
        },
        {
            "content": "Not as cute as the original cartoon.",
            "review_date": "2009-05-19",
            "source": "rt"
        },
        {
            "content": "I remember watching this on a plane ride..I might just be stupid though",
            "review_date": "2009-04-04",
            "source": "rt"
        },
        {
            "content": "Leslie's trying but this is awful.",
            "review_date": "2009-03-31",
            "source": "rt"
        },
        {
            "content": "I'm a big fan of Leslie Nielsen, this movie was hilarious. I remember watching it when I was eight back then I didn't understand much of the humor. Now it's hilarious when I watched it again. Leslie Nielsen is a jewel, he will never be forgotten.",
            "review_date": "2009-03-25",
            "source": "rt"
        },
        {
            "content": "A Great Famliy film, ya gotta love Leslie Nielsen!",
            "review_date": "2009-03-16",
            "source": "rt"
        },
        {
            "content": "When Leslie Nielsen's just going through the motions, you know you've got a bad film. Mr. Magoo wasn't even a good cartoon, too. Why did this get greenlit?",
            "review_date": "2009-03-05",
            "source": "rt"
        },
        {
            "content": "I think its a pretty fun movie!",
            "review_date": "2009-02-13",
            "source": "rt"
        },
        {
            "content": "I haven't ever watched the cartoon of Mr. Magoo, but I always heard what it was about. I don't know why, but when I heard about Leslie Nielsen (one of the best comedy actors there are) starring in \"Mr. Magoo,\" I wanted to see it.\r\n\r\nMr. Magoo is a VERY visually impaired and wealthy man. He unfortunately gets involved in the middle of a plot that deals with thieves stealing extremely valuable jewels. Whether Mr. Magoo successfully gets out of the middle of the action or not, one thing's for sure, he sure needs a new eye doctor.\r\n\r\nUnlike what I've read from some of the other reviews, I didn't think that Leslie Nielsen did a bad job at all in \"Mr. Magoo.\" I do agree that the movie seems generic and that it is somewhat pointless, but I still moderately liked it. Mr. Magoo isn't trying to be funny, but he is, since he is nearly blind. You will see him do such things as go fishing and catch a man, but think that he has a lunker of a fish, take what he thinks is a skiing detour but that is actually the edge of a cliff, and a lot more.\r\n\r\nI thought Leslie Nielsen did a great job of acting like he was nearly blind, and the rest of the people in the film did ok, but not great, with the exception of the dog, who was brilliant.\r\n\r\nAs for the movie itself, \"Mr. Magoo\" isn't one of the best comedies, even of the year, and it's not one of the funniest, but I did think parts were hilarious. But there were also many parts that tried to be funny, that didn't even make me grin. All in all, it's a mixed bag of laughs and failed attempts. If you're a fan of comedy films and Leslie Nielsen films, I guess I recommend seeing it, but not before you watch all the greater ones.",
            "review_date": "2009-02-09",
            "source": "rt"
        },
        {
            "content": "WHO WOULDN'T LOVE A MOVIE WITH LESLIE NIELSEN IN IT ?",
            "review_date": "2009-02-03",
            "source": "rt"
        },
        {
            "content": "A relatively decent adaption of the classic cartoon. Nielsen is obviously a child at heart.",
            "review_date": "2009-01-20",
            "source": "rt"
        },
        {
            "content": "For a simple and straight to the point comedy, it delivers. Sure it is silly and slapstick, but its expected of this type of movie. Short length of the movie is a wise decision. Leslie Nielsen is indeed a master of silly comedies. Jennifer Garner also has a bit role. The story is about the rare jewel been stolen and the FBI and CIA thinks Magoo is behind it. Through bumbling here and there, all truth is reveal.",
            "review_date": "2009-01-19",
            "source": "rt"
        },
        {
            "content": "Saw this ages ago. Cute movie",
            "review_date": "2009-01-16",
            "source": "rt"
        },
        {
            "content": "YES!!! PERU IS MAGOO!!!!",
            "review_date": "2009-01-14",
            "source": "rt"
        },
        {
            "content": "dis movie made me laugh hard",
            "review_date": "2008-12-23",
            "source": "rt"
        },
        {
            "content": "A harmless enough attempt with a well-chosen Leslie Nielsen leading the way (albeit blindly). Sadly, as with Inspector Gadget, the lack of any real laughs or proper story makes Mr Magoo a complete mishit. Fans of Nielsen and/or Magoo will find lots to enjoy though.",
            "review_date": "2008-12-17",
            "source": "rt"
        },
        {
            "content": "That guy is.... weird as hell thats all  i can say.",
            "review_date": "2008-11-24",
            "source": "rt"
        },
        {
            "content": "Oh my God. I was on a two-hour bus trip and had the choice to watch this movie or stare out the window. The cartoon at the beginning was funny. Five minutes later, I chose the window.",
            "review_date": "2008-11-17",
            "source": "rt"
        },
        {
            "content": "Oh my God.  I was on a two-hour bus trip and had the choice to watch this movie or stare out the window.  The five-minute cartoon at the beginning was funny.  Five minutes later, I chose the window.",
            "review_date": "2008-11-14",
            "source": "rt"
        },
        {
            "content": "Pretty lame and unfunny.",
            "review_date": "2008-11-10",
            "source": "rt"
        },
        {
            "content": "This is that guy with a big nose. Absolute hilarious. =)",
            "review_date": "2008-10-23",
            "source": "rt"
        },
        {
            "content": "Good casting, bad movie.",
            "review_date": "2008-10-03",
            "source": "rt"
        },
        {
            "content": "this film is so funny",
            "review_date": "2008-09-20",
            "source": "rt"
        },
        {
            "content": "I can't believe they even tried this one.",
            "review_date": "2008-09-15",
            "source": "rt"
        },
        {
            "content": "yuck didn't like it.",
            "review_date": "2008-09-10",
            "source": "rt"
        },
        {
            "content": "aweful, made me want to vommit in my socks and smear it over my eyeballs. Nielsen's worst!",
            "review_date": "2008-09-06",
            "source": "rt"
        },
        {
            "content": "Just recently I re watched this movie, and I laughed like I did when I was a kid.  This was such a fun movie and I hope that others will give it a chance and sit through the whole thing.",
            "review_date": "2008-08-31",
            "source": "rt"
        }
    ]
}