{
    "rating": 9.4,
    "release_date": "Invalid",
    "num_reviews": 329,
    "genres": [
        "Fantasy",
        "Anime"
    ],
    "summary": "This acclaimed animated tale by director Hayao Miyazaki follows schoolgirl Satsuke and her younger sister, Mei, as they settle into an old country house with their father and wait for their mother to recover from an illness in an area hospital. As the sisters explore their new home, they encounter and befriend playful spirits in their house and the nearby forest, most notably the massive cuddly creature known as Totoro.",
    "reviews": [
        {
            "content": "Easily one of my favorite movies.  Some scary parts but after seeing it a few times it was great to watch. Great animation, and great imagery!!",
            "review_date": "2023-04-11",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is always a great experience full of nostalgia and comfort. With subtitles, I do like when subtitles include honorifics, which the films usually do not include",
            "review_date": "2023-03-29",
            "source": "rt"
        },
        {
            "content": "I love this movie. It is an emotional story of childhood innocence set against a sad narrative about life and death within one's inner circle.",
            "review_date": "2023-03-27",
            "source": "rt"
        },
        {
            "content": "Although it could be classified as a children's film where almost nothing happens, Totoro is a landmark film for both Studio Ghibli and animation in general, especially with Hayao Miyazaki at the helm.",
            "review_date": "2023-03-02",
            "source": "rt"
        },
        {
            "content": "I am a huge Studio Ghibli/Miyazaki fan, and My Neighbour Totoro is no exception. In fact it is one of my favourites from them. There are so many wonderful things about My Neighbour Totoro. It is very simple in story and character but it is all very beautiful, charming and touching. The animation is typical Ghibli, ethereal-looking and just ravishing to watch, while the music is one of my favourite scores in a Ghibli film. The story is simple, but I loved the simplicity, it had such a pleasant atmosphere to it, and the characters are engaging with great chemistry together. I have very little to complain about the voice acting either, everybody did a fine job. In conclusion, in my opinion this is an animated classic. 10/10 Bethany Cox",
            "review_date": "2023-02-19",
            "source": "rt"
        },
        {
            "content": "Very cute. I want to sleep on Totoro's furry belly. I just want to hug that grey fur on him. I love catbus, I need a catbus.",
            "review_date": "2023-02-07",
            "source": "rt"
        },
        {
            "content": "An incredibly beautiful film from beginning to end. My Neighbor Totoro is filled with great themes, storytelling, and music. The musical score is so good and perfectly captures the feelings this movie gives off. The characters are very well written and you really care for them. The animation and scenery is stunning and you can't keep your eyes off of it. This movie was so ahead of its time. I'm so happy I decided to watch this. Overall, this is a masterpiece and can be enjoyed by everyone of all ages.",
            "review_date": "2023-01-25",
            "source": "rt"
        },
        {
            "content": "Great comfort movie, amazing soundtrack.",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "In many ways a simplistic movie which lends a certain realness and atmosphere to the experience. The animation is intensely beautiful, I really like the combination of the scenic backgrounds and the expressive character animation. The story is very much about childhood and I thought the child characters' actions and quirks rang very true in a way that I've never really seen before – It's honestly one of the movies greatest feats. The experience really stuck with me.",
            "review_date": "2022-12-28",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever. It pulls me in and makes me a child again with a child's imagination. Absolutely love everything about it.",
            "review_date": "2022-12-14",
            "source": "rt"
        },
        {
            "content": "This movie is the best animated movie I've ever seen .\nSpoilers ahead \nThe way it displays emotions of kids , charecters that just make sence like the naibors boy being a terible guy but also not being a villain.\nThe creacures that live in the forest.\nI wached this movie for the 1st time when I was about 6 - 8 yo and I still remember how I felt doing the secene when Totoro shows up at the bus stop.\nThis movie is 100% worth watching .",
            "review_date": "2022-11-19",
            "source": "rt"
        },
        {
            "content": "Amazing ! I love every minute of it. It just lets you enjoy life little moments without throwing action and drama in your face every second like most kids movies. The kids also 😍 love it",
            "review_date": "2022-11-17",
            "source": "rt"
        },
        {
            "content": "It's good for what it is. It could definitely use a plot though.",
            "review_date": "2022-11-07",
            "source": "rt"
        },
        {
            "content": "Is a amazing japanese studio ghibli movie, not because is weird, is also cute 9.5/10",
            "review_date": "2022-11-01",
            "source": "rt"
        },
        {
            "content": "the best movie i have seen ever this is a must watch for anyone who havent seen is 10000000/10 a masterpiece",
            "review_date": "2022-10-18",
            "source": "rt"
        },
        {
            "content": "This film shows a beautiful portrayal of the love of family. You can really feel a connection of the children and the father as well as his compassion for them. You can see the chemistry between the sisters as well which is helped since they are voiced by Dakota and Elle Fanning. It is stuns me how accurate the depiction of children is in this film. From their curious nature to their actions in the face of struggle, it honestly feels like children are real and not played up to be a spectacle of cinema. The music is very simple yet beautiful which is very reflective of the narrative as well. The namesake of the film, Totoro, introduces the children to the cute and quirky spirits of the world. It can be said that he was merely a vessel of their childlike wonder and care for each other as a family. The ending is the only issue I can find with the film simply because it wasn't put in as a major plot point until the final third of the film.",
            "review_date": "2022-10-17",
            "source": "rt"
        },
        {
            "content": "It's so good. Magical and sweet. Great animation. One of my favorites.",
            "review_date": "2022-10-11",
            "source": "rt"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (9.5/10) ; Cinematography (10/10) ; Plot (9/10) ; Acting (9.5/10) ; Pacing (8.5/10) = 93%}\"",
            "review_date": "2022-09-27",
            "source": "rt"
        },
        {
            "content": "Charming, as Ghibli's films usually are, but story wise and (once again) let down by the beauty of the animation overtaking the story.",
            "review_date": "2022-09-25",
            "source": "rt"
        },
        {
            "content": "Easily one of the best Ghibli films.",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "Lighthearted story with lovable characters, beautiful artwork , and significant message. An eternal Ghibli masterpiece from Miyazaki !",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "An absolute gem from Studio Ghibli.",
            "review_date": "2022-08-17",
            "source": "rt"
        },
        {
            "content": "Compelling story and characters. Beautiful background artwork.",
            "review_date": "2022-08-11",
            "source": "rt"
        },
        {
            "content": "It is a pretty light hearted movie. Very pretty visuals and fun story line. Nice movie to just relax and watch. Very easy watch and can brighten your mood.",
            "review_date": "2022-08-10",
            "source": "rt"
        },
        {
            "content": "Um filme muito fofo sobre família. Marcou época.",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "Hayaos best movie that i've seen. Also the only one that wasn't utterly garbage. This one was cute and less creepy than the others.",
            "review_date": "2022-07-16",
            "source": "rt"
        },
        {
            "content": "While this is technically a rewatch, I watched when I was very young so didn't remember this at all. Anyway, it was a really charming movie, but not quite the masterpiece this site makes it out to be.",
            "review_date": "2022-07-03",
            "source": "rt"
        },
        {
            "content": "It is catchy, funny and exciting to see this movie it is really interesting to see how amazing it was and it is worth to must see.",
            "review_date": "2022-06-14",
            "source": "rt"
        },
        {
            "content": "K This movie is fire right here. Saw spirited away was like Studio Ghibli is overhyped. Now this movie right here proved me wrong. Great work guys. Peace ✌",
            "review_date": "2022-06-11",
            "source": "rt"
        },
        {
            "content": "Fofinho. Gostei bastante!",
            "review_date": "2022-06-08",
            "source": "rt"
        },
        {
            "content": "I was thoroughly surprised at how little screentime was ultimately given to the title character in this. Totoro was the character I'd heard the most about through the zeitgeist when I decided to watch all the Ghibli movies and yet he's only actually seen for a few minutes. The movie was great for what it was, with believable characters and well-written dialogue and an excellent balance of other ingredients (the sick parent, the kind granny, kids unironically enjoying vegetables). I think I enjoyed Fireflies more for its emotional depth and plot, but this one was more well-rounded & provided excellent contrast with its generally upbeat tone.",
            "review_date": "2022-04-29",
            "source": "rt"
        },
        {
            "content": "The characters warmed my heart. So cute! Ends too soon...",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "A movie that constantly begs the question, \"Am I high right now?\"",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "Magic, innocence and charm. This animation can compete with anyone, even from this era, it is not for nothing that it is and will be an icon for this legendary animation studio, if you like animation, it is a must-see film.",
            "review_date": "2022-01-19",
            "source": "rt"
        },
        {
            "content": "A simple but heartwarming tale that wonderfully highlights the graces of childhood.",
            "review_date": "2022-01-18",
            "source": "rt"
        },
        {
            "content": "The most boring film of Studio Ghibli. 3/10",
            "review_date": "2022-01-09",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro tells a charming, straightforward, emotional story about childhood, with fantasy characters like Totoro thrown in for good measure. The plot of the film is non-existent, and we spend the majority of the time watching the characters go about their regular lives in the countryside. And Totoro, as well as the film's fantasy elements, are wonderful, but they don't occur as frequently as you might expect. It may not be Hayao Miyazaki's most ambitious film, but it is the most entertaining one that both children and adults will love.",
            "review_date": "2022-01-08",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is such a cute film! The animation is marvelous! It features sister love, nature, and friendship with Totoro and others. I love that it has the climax instead of just cutesy all the way. One thing I find the flaw is that I wish the movie is longer.",
            "review_date": "2022-01-05",
            "source": "rt"
        },
        {
            "content": "This was fantastic! Really good for it's time!",
            "review_date": "2021-12-16",
            "source": "rt"
        },
        {
            "content": "The legacy of the beloved titular character, Totoro (Frank Welker), outshines the rest of the Studio Ghibli film. Watching the film in 2021, I caught myself waiting, scene after scene, for the Snorlax-like creature to return to the screen and take me away into a land of wonder and amazement. However, much of the film centers on two sisters, Satsuki (Dakota Fanning) and Mei (Elle Fanning), whose family has recently moved out of the city and into the countryside. Miyazaki and Studio Ghibli in general are masters at capturing those difficult-to-describe moments of childhood. Here, the excitement of moving to a new house — a house which, everyone in the family hopes, is haunted. Of course, it wouldn't be a Miyazaki story about those formidable years of youth if a child's imagination wasn't involved. Only Satsuki and Mei can see Totoro, the other miniature.. uh… Totoros(?), — What is a Totoro, anyway? — and the cat-bus (my personal favorite character), while their father (Tim Daly) and the other townsfolk cannot. The only conflict concerns their sick mother (Lea Salonga), who is bedridden in a hospital, and a sudden message on the state of her affliction. The animation was so impressive that my co-viewer (and fiancée) didn't believe that it was made in 1988 — I told her she needs to watch Akira — most notably, the translucent mini-Tots. The bus-stop scene (the one that adorns the cover/poster) is worth the price of admission alone, and I'm surprised it wasn't some stand-alone short from which the full-feature had sprouted. I can see this film appealing much more to children than adults — I don't always feel that way about Disney/Pixar films anymore — which is who the film is made for, anyway. It's a tame adventure, for Ghibli standards, and offers a sibling story that won't rip your heart out — I'm looking at you, Grave of the Fireflies. While Totoro outshines the story as a whole — a new line of Totoro-inspired handbags is what made my co-viewer want to watch the movie.. — it's still a fun ride without any of the depressing stuff \"children's\" movies seem to require nowadays.",
            "review_date": "2021-12-01",
            "source": "rt"
        },
        {
            "content": "dark magical sad realistic and fantastical just like other ghiblis. what makes the really good ones like this is the mixing of real life n childhood fantasy. love the nature scenes so pretty. who didnt dream of flying or magical forests or animal friends? great for adults n kids like 5 n up.",
            "review_date": "2021-09-25",
            "source": "rt"
        },
        {
            "content": "Excellent fun and feel good movie that would recommend to anyone and everyone truly brilliant with catchy song too.",
            "review_date": "2021-09-25",
            "source": "rt"
        },
        {
            "content": "As simply soft, innocuous, and squishy as the endless toys it has inspired.",
            "review_date": "2021-07-25",
            "source": "rt"
        },
        {
            "content": "What an adorable film. This definitely ranks up there with the best of Miyazaki's work. I definitely enjoyed this adorable and fun romp. It was such a good time. I will definitely watch this one again!",
            "review_date": "2021-05-02",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro, apart from having little to no plotline, is a heartwarming childhood story and contains some of the best movie scenes I have ever seen. Also, Joe Hisaishi's music score is a good portion of the movie's greatness.",
            "review_date": "2021-04-19",
            "source": "rt"
        },
        {
            "content": "Those who do not like this movie have never known love",
            "review_date": "2021-04-14",
            "source": "rt"
        },
        {
            "content": "A wonderfully fantastical film with a character you cant help but want to hug. Beautiful visuals and great characters are what studio ghibli does best",
            "review_date": "2021-04-03",
            "source": "rt"
        },
        {
            "content": "Tiene una trama muy simple, pero la animación es muy buena y la música es agradable; un clásico del Studio Ghibli.",
            "review_date": "2021-04-03",
            "source": "rt"
        },
        {
            "content": "This movie gets you even more once you read up on all it's background. It is one hell of an adventure to watch it for the first time. read up on all the hidden messages and rewatch it again! One hell of a ride anything but boring.",
            "review_date": "2021-03-24",
            "source": "rt"
        },
        {
            "content": "It's very likely that every single thing that can be said about this movie has been said already, and in a more eloquent fashion.\nStill, this dreamy fairytale abandones the plot-driven tradition of film making and, instead, adopts a situation-driven homage to the innocence of a simple life. The very sort of innocence only children can truly grasp, until they forsake it in the name of growing up and becoming cynical.\nBut do not be confused, the most remarkable thing about this movie is, precisely, that it refuses that well known trope, so abused by other studios and storytellers: the adults portrayed in this masterfully animated piece of art aren't cynical; their kindness knows no limits, their humbleness allows them to admit there's a whole world out there that cannot be perceived by their eyes, and their honest amazement and embracing of the sheer innocence of their kids can make anyone wish they had grown up in such a place.\nStructure wise, this film is longer than one would expect it to be. However, that is precisely the point. Miyazaki knows his craft, so he lets every situation to develop, so the viewer can not only perceive the point of view of each character, but, also, to interact with their own evoked emotions, to be a part of the story. \nThe filmmaker achieves this by complementing such masterful storytelling with a breathtaking cinematography. This movie is gorgeous, vibrant and filled with panoramic shots that make you want to be in that small post war Japanese Town. \nIn the end, this movie is one of the very few that can, and will, make you feel happy for no reason. \nAll you need to do to achieve that, is to let go of your cynicism, to be another of the adults of the story. \n\nOh, and, please, watch it in Japanese.",
            "review_date": "2021-03-20",
            "source": "rt"
        },
        {
            "content": "As bad as cats. Do not recommended. At least in cats you get to see the hottie james cordon.",
            "review_date": "2021-03-12",
            "source": "rt"
        },
        {
            "content": "Very little happens, but it's brilliantly uncynical and so enjoyable to watch ",
            "review_date": "2021-03-05",
            "source": "rt"
        },
        {
            "content": "Woahhh. A simple story of two children moving into a home in the rural area. Most of the story revolved around the children interacting with Totoro, and the many fun magic from it. This is such a relaxing and fun movie. I enjoyed the kids having fun and also the lively animation. The theme of childhood imagination was emphasized, and I very loved this. Even more, the story let the adults imagine as I was thinking about whether Totoro is real. Overall a beautiful that reminds audience about the good childhood days where not a lot of things matter yet and imagination was wild. 8.5/10",
            "review_date": "2021-02-10",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all times. Great family entertainment and voice cast. I have seen it at lease 12 times.",
            "review_date": "2021-02-07",
            "source": "rt"
        },
        {
            "content": "I love this movie. And the story is amazing",
            "review_date": "2021-01-31",
            "source": "rt"
        },
        {
            "content": "I totally loved this movie. Totoro is nothing but tenderness, and this movie reminded me of what it means to be a child, in the sweetest possible way!",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "Knowing that Totoro is one of Studio Ghibli's most iconic characters going in, you'd think that this movie would be one of their masterpieces, along with Spirited Away. However, I found myself underwhelmed after viewing it all the way through, put off by its overly cartoony characters, story, and being just a bit too cutesy for my taste.",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "It's a fun film that I absolutely wonderful during the first watch, but after a second watch some of the images are just weird.     I feel like some of the parts where Totoro or the \"catbus\" were smiling were just plain weird.",
            "review_date": "2021-01-18",
            "source": "rt"
        },
        {
            "content": "For a simple, straightforward film, there are a lot of cultural things that have to be understood. It's going to take some studying before it sinks in.",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "Perfect pace of discovery and imagination. Captures the innocence of childhood with all its simple joys. Bliss.\nA really unique film. Which is rare.",
            "review_date": "2021-01-01",
            "source": "rt"
        },
        {
            "content": "A friendly and entreteined movie that tells us a nice story with good messages. The animation is really good for the year it was, and still looks pretty well. You will definitely have a good time watching it.",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "Weeeeelll... its not the best Ghibli movie in fact the craracters are a littleweird or sometimes annoying, and the rythm is a little slow but a little enyoyable",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "The ultimate anime movie for families.\n\nHayao Miyazaki's anime family fantasy film My Neighbor Totoro (1988) is simply delightful in every moment. Miyazaki's direction captures the innocence and simplicity of childhood. These two sisters move to a new home and just entertain themselves with a few adorable surprises along the way with no conflicts. Joe Hisaishi's score is my favorite aspect of My Neighbor Totoro as his tender synth and piano heavy symphony casts a warm blanket over this gentle picture. Hisaishi's soundtrack is phenomenally well composed as he fits the bright and playful tone of Totoro.\n\nMiyazaki's writing is sweet and dreamy as he lets you identify with two adolescent girls having fun and worrying about their sick mother in the hospital. It's very pleasant and realistic with a wonderful fantasy element of magical wood spirits. My Neighbor Totoro has that Summer afternoon feel with a breezy 86 minute run-time that never feels wearisome. Takeshi Seyama's editing is cut to a relaxing pace to just let you enjoy all the pretty imagery from Studio Ghibli's stellar hand drawn animation. Mark Henley and Hisao Shirai's cinematography features plenty of wide shots of the forest with lush greenery everywhere.\n\nTotoro is such an iconic figure in anime that Hayao Miyazaki's Studio Ghibli uses him as their logo. This fuzzy creature is the cuddly namesake of the movie. All the wood spirits are funny little guys that I really love. I loved Dakota Fanning and Elle Fanning's voice acting for the two lead characters: Satsuki and Mei. I wish I saw My Neighbor Totoro as a boy. \n\nI think My Neighbor Totoro may be the cutest movie I've ever seen.",
            "review_date": "2020-12-23",
            "source": "rt"
        },
        {
            "content": "Beautiful animation. There is a surreal quality to this film. Sweet story.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "I know what movie I'm definitely showing to my children",
            "review_date": "2020-11-26",
            "source": "rt"
        },
        {
            "content": "I wish I saw this movie growing up. Touching and whimsical. Still entertaining even though I'm older now.",
            "review_date": "2020-11-12",
            "source": "rt"
        },
        {
            "content": "08.11.2020 ---------",
            "review_date": "2020-11-09",
            "source": "rt"
        },
        {
            "content": "The animation is gorgeous, and the story is heart-warming. It portrays a portion of japanese culture, as well as a very important childhood element.",
            "review_date": "2020-11-05",
            "source": "rt"
        },
        {
            "content": "Totoro delivers not only a diversion for the younger audience, but a charming, heartfelt, joyful story for adults. Go check out this new adventure for you as soon as possible.",
            "review_date": "2020-10-22",
            "source": "rt"
        },
        {
            "content": "So cute and beautiful story.",
            "review_date": "2020-09-21",
            "source": "rt"
        },
        {
            "content": "Delightful and heartwarming.",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "So hopefull, incredible animation.",
            "review_date": "2020-09-17",
            "source": "rt"
        },
        {
            "content": "The kind of film that stays with you afterwards...",
            "review_date": "2020-09-15",
            "source": "rt"
        },
        {
            "content": "I used to overlook this one and thought that it's only for kids. The story is actually much deeper than it might first seem. And the plot itself is actually really genious. Nothing much happens in this movie - yet still much happens. My neighbour Totoro is a really heartwarming and timeless classic. It's mainly happy but it also has its sad tones.",
            "review_date": "2020-09-08",
            "source": "rt"
        },
        {
            "content": "It's one of my favorites, and helps me relive childish wonder.",
            "review_date": "2020-09-02",
            "source": "rt"
        },
        {
            "content": "Ok anime kids movie. This is my second ever anime movie I've ever watched it so far they're all just ok. I want something big, something that makes me feel something. This movie is just an easy watch. I would go crazy if I saw this in a theater because I would want to check my phone but for a kids movie it's pretty entertaining. But I would not recommend anybody I know this because it's not great. It's decent.",
            "review_date": "2020-09-02",
            "source": "rt"
        },
        {
            "content": "\"My Neighbor Totoro\" is one of those rare movies that genuinely works because of how simple it is. The movie does a great job of creating pure magic and wonder for all ages. This movie just filled me up with a warm feeling that made my day. The movie also has a very memorable score that adds to the magical feeling of the story. This is one of the purest and innocent movies out there that is a great showcase of just love and kindness. Overall, I have liked a few other Studio Ghibli movies maybe a bit more on technical and storytelling levels, but this is one of the few I can see myself watching again simply as a mood booster.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "I love My Neighbor Totoro. It is one of the greatest films of all time, a Miyazaki masterpiece. Just remember to watch it in the original Japanese with subtitles. Never dubbed, always subbed.",
            "review_date": "2020-08-27",
            "source": "rt"
        },
        {
            "content": "A true classic. This one is timeless.",
            "review_date": "2020-08-25",
            "source": "rt"
        },
        {
            "content": "TV, R2.8.22\nWhat did you think of the movie?",
            "review_date": "2020-08-23",
            "source": "rt"
        },
        {
            "content": "Toro,oh Toro! It's a classic Ghibli movie that you can enjoy Both immersed in IMAX or on the comfort of your couch with with a small TV. It has the child like fantasy that you can't help but indulge in. As with, most Studio Ghibli films you never regret watching it, for the first our thousandth time.",
            "review_date": "2020-08-22",
            "source": "rt"
        },
        {
            "content": "heartwarming, sentimental masterpiece that captures the simple grace of childhood",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "Sweet story combined with beautiful animation make this a real treat. The story focuses on the value of family, community and the beauty of nature. I cared for my younger sister when our mother was sick, so I especially enjoyed the funny relationship between sisters Satsuki and Mei.",
            "review_date": "2020-08-15",
            "source": "rt"
        },
        {
            "content": "The character that was so iconic that it became Studio Ghibli's mascot. It is one of the earliest masterpieces of the Hayao Miyazaki Collection, a heartwarming animated fantasy film in which two girls move to the countryside and have adventures with wondrous forest spirits like Totoro, a giant rabbit-like creature. The incredible animation style and the imaginative and whimsical world of this particular filmmaker is always remarkable and despite the lack of a defined plot, the cuteness and the magic hold the story together.",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "Ghibli is a land of magic very possible to commoners like us.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "Basically the definition of a feel good movie. There's just so much to like about it from the adorable animation to the heartwarming story to the likable characters. It's just a good time.",
            "review_date": "2020-08-02",
            "source": "rt"
        },
        {
            "content": "9.3. Miyazaki and Studio Ghibli are able to animate imagination onto the screen. My Neighbor Totoro is such a simple movie, yet it still evokes so many emotions from something that is much more than a childhood movie. Though the main protagonists are children, the optimism displayed in the movie create a feel good sense that is sure to make anyone warm.",
            "review_date": "2020-08-01",
            "source": "rt"
        },
        {
            "content": "Na primeira vez que assisti achei horrível, mais com o passar do tempo fui me apaixonando completamente",
            "review_date": "2020-07-30",
            "source": "rt"
        },
        {
            "content": "It is, without any question, charming, but also rather pointless. The plot has barely anything to do with Totoro and is otherwise very much uninteresting. I don't see where the description \"magical adventure\" applies. Towards the end it gets dragging.",
            "review_date": "2020-07-29",
            "source": "rt"
        },
        {
            "content": "While it boasts beautiful animation, My Neighbor Totoro is nothing more than visuals, where things just kinda happen without any actual storylines.",
            "review_date": "2020-07-28",
            "source": "rt"
        },
        {
            "content": "La pelicula en si es disfrutable para niños y con una trama bien desarrollada",
            "review_date": "2020-07-21",
            "source": "rt"
        },
        {
            "content": "Best movie ever! Great storyline and art! A must see!",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "A beautiful animation that captures the innocence and enchantment of the world during childhood.",
            "review_date": "2020-07-06",
            "source": "rt"
        },
        {
            "content": "Perhaps I might be biased towards classic Ghibli, but I can't help but get caught up in the quality of the animation, the inventiveness, and the sheer beauty of these films. When American animation decided that it no longer wanted to be the world leader in the industry and began cranking out unremarkable or explicitly bad films just to cash a check, Japan came right on their heels for the top spot, unquestionably taking the medium to new creative heights. My Neighbor Totoro is one of the great representatives of this trend, blending a wonderfully simple narrative with completely original fantasy elements and intertwining a degree of melancholy that saves the film from falling into pandering territory. This has to be the most tonally distinct dual billing in film history, being released alongside Grave of the Fireflies. Talk about completely different ends of the spectrum, but they ultimately oddly complement one another. (5/5)",
            "review_date": "2020-07-04",
            "source": "rt"
        },
        {
            "content": "Sensational film with really interesting story, characters and message.",
            "review_date": "2020-07-03",
            "source": "rt"
        },
        {
            "content": "Whenever I watch this and Castle in the Sky, I feel a sense of joy in my heart. I don't know what it is but there is always something studio ghibli does that makes their movies like what they are now Classic entertainment.",
            "review_date": "2020-06-27",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is an imaginative, beautifully animated adventure with a sweet heartfelt story at its core. ",
            "review_date": "2020-05-29",
            "source": "rt"
        },
        {
            "content": "This movie not only is beautiful but the tale it tells is one for all ages",
            "review_date": "2020-05-22",
            "source": "rt"
        },
        {
            "content": "Honestly, I think it's not my type of movie. With some slow and boring parts (in my opinion) this is the kind of film that a little kid or someone with a lot of patience should enjoy. \nAnyways, something that cannot be ignored is the beautiful design and textures. The images are a complete artwork (specially taking into account the year that was released).",
            "review_date": "2020-05-17",
            "source": "rt"
        },
        {
            "content": "Not without a little bit of charm but nothing happens in this film and the kids voices are infantile and irritating enough for you to want to switch off immediately.",
            "review_date": "2020-05-16",
            "source": "rt"
        },
        {
            "content": "A compelling portrayal of child inocence and imagination with masterful and heartwarming results.",
            "review_date": "2020-05-12",
            "source": "rt"
        },
        {
            "content": "Maybe the plot is not too obvious. But I am sure this movie will arouse your childhood memories created by the story of this movie. I'd like to say this movie is enchanting and cheerful.",
            "review_date": "2020-05-11",
            "source": "rt"
        },
        {
            "content": "quiero un funko pop de Totoro",
            "review_date": "2020-05-05",
            "source": "rt"
        },
        {
            "content": "This is the first Studio Ghibli film I ever watched. As I was watching, dreaded the idea that maybe we were leading up to either the death of the mother, or that maybe they were alluding to a mental condition. Both turned out to be wrong which was a relief. Couldn't help but wish that I saw this movie as a kid though; rthe vibe reminded me of old anime I did see as a kid like Princess Sarah etc. Found the kids, and of course cuddly Totoro and the cat-bus very memorable.",
            "review_date": "2020-04-29",
            "source": "rt"
        },
        {
            "content": "Still a great film today with very peaceful of rural area and how people lives in the countryside.",
            "review_date": "2020-04-28",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is a Studio Ghibli hit well ahead of its time. Emotional and enchanting, it transports you to another world. Miyazaki gets the feel-good just right. Neighborly love!",
            "review_date": "2020-04-27",
            "source": "rt"
        },
        {
            "content": "Hayao Miyazaki's reminiscence of his own children with nostalgia and children fantasy about a pair of sisters managing their disquietude for their sick mother with the eponymous giant grey tree-dweller is timeless innocence agelessly enchanting.",
            "review_date": "2020-04-24",
            "source": "rt"
        },
        {
            "content": "Visionario, delicato e mai banale.\nUna narrazione pulita e vera, credibile nonostante il tocco magico.\nSolamente in alcuni tratti i dialoghi tra le due sorelline si fanno un pochino ripetitivi e il finale a mio avviso è leggermente stringato.",
            "review_date": "2020-04-18",
            "source": "rt"
        },
        {
            "content": "Ok anime kids movie. This is my second ever anime movie I’ve ever watched it so far they’re all just ok. I want something big, something that makes me feel something. This movie is just an easy watch. I would go crazy if I saw this in a theater because I would want to check my phone but for a kids movie it’s pretty entertaining. But I would not recommend anybody I know this because it’s not great. It’s decent.",
            "review_date": "2020-04-13",
            "source": "rt"
        },
        {
            "content": "Uno dei film di Miyazaki più belli. Dove gli ambienti sono descritti con precisione e dolcezza, viene mostrato il rapporto che ha l'uomo con la natura che lo circonda. È già storia del cinema, con momenti di malinconia e dolcezza che commuovono lo spettatore.",
            "review_date": "2020-04-13",
            "source": "rt"
        },
        {
            "content": "Impressive animation.",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "Ah what a joy this movie is - artful and simple. The flow of the plot, the vivid imagination of a child and the joint creation of an alternate reality merging with the current reality seamlessly were brilliant. Full marks to the Miyazaki and the team for this!",
            "review_date": "2020-03-28",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is cute, simple, funny and beautifully animated.",
            "review_date": "2020-03-26",
            "source": "rt"
        },
        {
            "content": "Every time you see the name Miyazaki in the beginning of a movie you look at a great product!",
            "review_date": "2020-03-25",
            "source": "rt"
        },
        {
            "content": "\"My Neighbor Totoro\" is the greatest kids movie of all time.",
            "review_date": "2020-03-21",
            "source": "rt"
        },
        {
            "content": "It was created the same year I was born, but I just watched it 31 years later. I found it boring at first and prompted to quit watching yet ending up finishing the whole movie without knowing that.",
            "review_date": "2020-03-19",
            "source": "rt"
        },
        {
            "content": "It would be easy to simply say this is a story of a family moving to rural Japan with two curious daughters and a mother who is sick in the hospital. But it is so much more than that. The images and music paint a picture of the deliberate pace of life in rural farming communities before TV and smartphones. People took walks in the forest and met their neighbors. They rode bicycles through the countryside and they allowed that magic can happen when you see the world through the eyes of a four year old. There is no real conflict to be resolved here, no villain, no violence. People are generally kind to one another. Grownups are trustworthy and children trust them. It rains and people share umbrellas. This is almost a meditation for adults who watch it and for very young ones, it moves at a pace that lingers on things like tadpoles in a puddle. ",
            "review_date": "2020-03-01",
            "source": "rt"
        },
        {
            "content": "My introduction to Miyazaki's films and this movie has held a special place in my heart ever since.\n\n5/5.",
            "review_date": "2020-02-20",
            "source": "rt"
        },
        {
            "content": "A delightful and heartwarming adventure that will please both adults and children.",
            "review_date": "2020-02-04",
            "source": "rt"
        },
        {
            "content": "The story is simple but it's full of fantastic imagery, iconic characters, and magical moments. A cute, uplifting, and enchantingly beautiful movie for kids.",
            "review_date": "2020-02-04",
            "source": "rt"
        },
        {
            "content": "This movie may be slow at time, but that doesn't mean that this movie doesn't have likeable characters, a fun plot and beautiful animation.",
            "review_date": "2020-02-01",
            "source": "rt"
        },
        {
            "content": "Every detail in MY NEIGHBOR, TOTORO is used as a treasure. It brings in love, joy, and happiness while telling its main story about the bond between two sisters, and it doesn't stop once it gets to the second half. Oh look, a Cat-bus!",
            "review_date": "2020-01-16",
            "source": "rt"
        },
        {
            "content": "Honestly I don't understand why anyone would like this film, the plot is sub-par and there is no original character design. They really should look at Disney films for so they can understand what a good character is.",
            "review_date": "2020-01-13",
            "source": "rt"
        },
        {
            "content": "Very nice and chill movie. Filled with all kinds of spirits and adventures, it has something for everyone. Kinda slow though.",
            "review_date": "2020-01-07",
            "source": "rt"
        },
        {
            "content": "Often I think of this as an animated film almost without conflict, yet it still works. Of course, that isn't actually true. It's just so gentle that you can be forgiven for remembering it as having no conflict.",
            "review_date": "2019-12-25",
            "source": "rt"
        },
        {
            "content": "Riveting movie for children. Darker in parts than expected, but worthy for helping children identify with life not always being easy.",
            "review_date": "2019-12-20",
            "source": "rt"
        },
        {
            "content": "Magical. Nothing much to say beside this. Magical.",
            "review_date": "2019-12-04",
            "source": "rt"
        },
        {
            "content": "you will probably cry",
            "review_date": "2019-11-26",
            "source": "rt"
        },
        {
            "content": "this movie is so cute i love it but i'm not saying its the best i just like it 100/10 ",
            "review_date": "2019-10-11",
            "source": "rt"
        },
        {
            "content": "It's just one of the best kids movies of all time ",
            "review_date": "2019-09-19",
            "source": "rt"
        },
        {
            "content": "Simple yet charming and sincere. This is a film to be appreciated for its warming details while also offering a meaningful message under the sweet surface.",
            "review_date": "2019-08-19",
            "source": "rt"
        },
        {
            "content": "an absolutely fantastic movie that will surely be beloved by adults and children alike. beautiful visuals and masterful storytelling make this film a classic. Totoro will always hold a special place in my heart.",
            "review_date": "2019-08-17",
            "source": "rt"
        },
        {
            "content": "At First I Didn't Enjoy It, but I rewatched and thought it was absolutely INCREDIBLE! If you haven't seen it, you are totally missing out!",
            "review_date": "2019-07-29",
            "source": "rt"
        },
        {
            "content": "Brings good memories and feelings from our childhood.",
            "review_date": "2019-05-22",
            "source": "rt"
        },
        {
            "content": "Movies stick with us for different reasons. Some make us cry and we feel the intense drama. Some make us laugh so hard until it hurts. Some movies can do both of them and one of those is My Neighbor Totoro. A legendary film from the great Hiro Miyazaki. When I do my list of top one hundred favorite movies of all-time, this one will be way up there.\n\nCharacters\n\nMeet Satsuki, she is a rambunctious child who lives with her father while her mother recuperates in the hospital. Mei is her younger sister who is such a sweetheart. She has so much energy and cuteness that shines through. They live near a kind lady who they name granny. The voice acting is impeccable. No one over does it and every line is delivered with perfect pitch and timing. The characters are like the ones you usually see in a Miyazaki movie, the understanding dad, the wonderful mom, and the relatable and cute kids. Does this take away from the characters? Nope, they are so real and likable, you don't even notice. They are normal people who we can relate to, and see the world through Satsuki and Mei's eyes is quite an experience. Totoro and his companions are great. They have personality and great design. You will never forget the cat bus. Yes, you heard me, a kitty cat bus! It's sooo cute you'll wish there really was a kitty cat bus! Oh the horror! Make it real!\n\nStory\n\nThe story is simple and it works. A father and his two kids move out to a small home, so they can visit their mom (his wife), more often. Mei goes into the woods and she finds a creature named Totoro. She tries to convince her sister and father that she found him, but he doesn't appear. Is this all in Mei's head? The story does deepen when mom gets sick. Satsuki and Mei try to find a way to see her see if she is ok. This is so relatable to any child. Who wouldn't want to rush to the hospital to see their mom if she was supposed to go home, but gets sick? Mei and Satsuki also try to find out what is Totoro's deal. Is he a friend? Watch and see.\n\nDirecting\n\nAs usual, Miyazaki does his typical perfect job directing the animation with vibrant colors, wonderful character design, and a smart screenplay. I love how Miyazaki makes his characters look like regular people, instead of the typical anime tropes. It makes their situations more relatable. There are quiet moments in this movie that are spectacular. Miyazaki respects the audience's intelligence. He knows we can handle quiet moments and lets us fill in the blanks on what's going on. Audiences don't need zooming cameras and in your face loudness in order to compel us. Give us a good story and characters we can relate to, and we can have the patience to watch any movie.\n\nScreenplay\n\nThe screenplay maybe my favorite part of this movie. When Mei tells her dad and Satsuki that she saw Totoro, we could've gotten the same, \"Sure you did, you are nuts.\" tropes we've seen a thousand times. Instead, we get a caring father and sister who really want this to be real for Mei. That is such a breath of fresh air to see in a family movie. The story has enough depth, but doesn't bog down the story will too much plot. Instead, the screenplay focuses on the journey for Satsuki and Mei. This is perfect! It keeps it simple and relatable without drowning out the spirit of what makes this movie so good. It is pure magic. Simple, sweet and gentle. This is one of the best screenplays for any movie, I've ever seen. Miyazaki wrote this masterwork of a screenplay and should've gotten an Oscar nomination for it.\n\nFlaws\n\nI can't really name any to be honest. Maybe the running time, which is eighty-seven minutes long. I would have loved if this movie had been four hours long! Maybe, that's the sign of a great movie. It leaves you wanting more! This is a near perfect movie that delights with sights, sounds, heartfelt moments and hearty laughs.\n\nFinal Thoughts\n\nMy Neighbor Totoro has become a huge cult hit and it is easy to see why. The gorgeous visuals, adorable characters, charming story and sweet tone will make this a family favorite for decades to come. Ninety-nine percent of big Hollywood animated movies pale in comparison to this movie. If you are looking for adorable, and wholesome family entertainment that is also a great movie. Look no further than My Neighbor Totoro, one of the best movies, (not just animated, but movies period), ever made.\n\nMy Score: 4 stars. One of the best animated, no, movies PERIOD, of all time. A charming classic that you will love and watch many times without the magic wearing off.",
            "review_date": "2019-05-06",
            "source": "rt"
        },
        {
            "content": "A charming movie, quite slow-paced in comparison to the other Miyazaki movies",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "The start of Studio Ghibli is as heart-warming as it is adorable.",
            "review_date": "2019-04-28",
            "source": "rt"
        },
        {
            "content": "A timeless umbilical of ghibli and Japanese culture, my neighbor Totoro is Haywood Miyazaki's staple into cutely animated, intelligent family entertainment.",
            "review_date": "2019-04-24",
            "source": "rt"
        },
        {
            "content": "The last 20 minutes were great, but there was another 60 minutes to watch to get to it. My Neighbor Totoro is an anime that lags in the beginning and middle; but who's ending is extremely engaging. However, its still a good movie. The animation was great, the characters were good, and the score matches it tone. But that tone was too tender to stomach, the environment was doubtful and best, the screenplay was fragile, and there was no real plot to drive the picture. Overall solid, but not amazing.",
            "review_date": "2019-04-23",
            "source": "rt"
        },
        {
            "content": "Visually enchanting with the most ambient music. The songs are otherworldly, creating a safe haven. My Neighbour Totoro gives you a passageway out of reality.",
            "review_date": "2019-04-14",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro lives up to its cult classic status, with a heartwarming story and beautiful animation.",
            "review_date": "2019-04-07",
            "source": "rt"
        },
        {
            "content": "Really beautiful and special.",
            "review_date": "2018-12-24",
            "source": "rt"
        },
        {
            "content": "A great anime for all ages and generations",
            "review_date": "2018-11-26",
            "source": "rt"
        },
        {
            "content": "A timeless film that will be a classic forever. This movie is a family classic that can be watched at anytime. Highly recommend anyone who hasn't seen this classic!",
            "review_date": "2018-10-15",
            "source": "rt"
        },
        {
            "content": "With Studio Ghibli season on Film4 in full swing we continue to enjoy these offerings as a family.  This is a bizarre treat, one part family drama (move to a new house, Mother in hospital) and one part bizarre, trippy fantasy.  I keep watching these films thinking there's no way my children will want to follow and enjoy the complicated plotting and yet, as with me they both love them.  Again even my 2 year old was engrossed and engaged throughout and we've all been talking of 'Totoro' just as we did 'Arrietty' and 'Ponyo'.  These truly are the classic family films of our era (even if this one was 1988!), I really recommend dipping your toe in the water.",
            "review_date": "2018-08-20",
            "source": "rt"
        },
        {
            "content": "greatest movie along with fairytail dragon cry",
            "review_date": "2018-08-17",
            "source": "rt"
        },
        {
            "content": "An absolutely beautiful slice of life anime movie. Very family friendly and one of Studio Ghibli's best films",
            "review_date": "2018-08-16",
            "source": "rt"
        },
        {
            "content": "Charming, breathtaking, funny, and cute. The story is so magical and truly transports you into the world of Totoro.",
            "review_date": "2018-08-10",
            "source": "rt"
        },
        {
            "content": "I was really skeptical when I first started watching because the pace of the movie was so slow going in, but by the end I was in love with the story. It can be a little bit weird at times, but it has to be one of the most charming animated movies I've ever seen.\n\nThere's a really strong heart at the core of this movie that just reminds you how it was to be a little kid, since most adults just can't remember anything after they were six years old",
            "review_date": "2018-06-14",
            "source": "rt"
        },
        {
            "content": "I can't describe how delighted am I after I've just finished watching this movie. This is the best movie that captured the childhood very accurately. The children characters behave so realistically that I couldn't believe my eyes while watching them play, cry, laugh, or doing anything. I didn't felt like I was watching a child in front of me, but I felt like I was watching my younger self; I felt like I was watching myself as a child, or as if my childhood memories were being displayed before me. Even if I haven't done that particular thing the characters do, I somehow felt that my younger self would do the exact thing. If that means anything, it's that Hayao Miyazaki has captured The essence of childhood like now one did.\n\nBut the greatest thing about My Neighbor Totoro isn't how realistic it feels, but it's the fabulous message it delivers, and the thing that is more fascinating is the way it delivers this message. I really shouldn't spoil anything about this gorgeous film, but it delivers a message about facing the fear; the fear of everything, and the fear in all its kinds and levels. Miyazaki merged this message with the story in a gleefully brilliant way.\n\nI shouldn't call it delivering the message, though. Instead, I should call it merging or combining the message with the story, or rather I should say that Miyazaki created an entire story from a message! It's really amazing that this film has no real plot!\n\nHayao Miyazaki proved that it's not even necessary for a movie to have an antagonist, or at least not a common one, as I mentioned above, the story itself is about a message about facing the fear. And I didn't feel at any time throughout the movie that I need an antagonist or a usual problem to be invested in the movie. I was engaged and hooked from the very beginning of the movie till the end credits scene, which is very cool, by the way.\n\nThe thing is that at the third act the movie changed completely in terms of the plot; it turned from a plot-free movie to a movie that has a real plot and a very serious problem. The plot and its problem didn't come from nowhere; they are attached very well to the story from its beginning, and it's been appeared later that the plot is kinda share the same message of the story, but the problem is that the movie changed a great deal when it moved from its second to the third act. I felt as the movie betrayed itself after promising, and spectacularly managing to keep the audience on the edge of their seat with a story devoid from typical plot issues and obstacles. Yes, I've been engaged again and invested in the story with its plot because I cared about every single character, but it took me a little time, and I really felt a bit uncomfortable and annoyed with this inconsistency.\n\nOverall, I can say that My Neighbor Totoro is an imaginative tale that every parent should enjoy it with his/her child. Because I think that the moral of the story is actually as, if not more important to parents.\n\nI personally prefer My Neighbor Totoro to Spirited Away, but if I'm going to be honest with myself, Spirited Away is the better film; just slightly better. Looking forward to see more works from this genius filmmaker.\n\n(8.5/10)",
            "review_date": "2018-06-05",
            "source": "rt"
        },
        {
            "content": "If a bit long at first, My neighbor Totoro's charming character moments more than makes up for its early flaws.",
            "review_date": "2018-05-13",
            "source": "rt"
        },
        {
            "content": "this is one of the best movies I have ever seen! I cannot recommend this cinematic masterpiece more!",
            "review_date": "2018-05-09",
            "source": "rt"
        },
        {
            "content": "Simple and charming.",
            "review_date": "2018-04-27",
            "source": "rt"
        },
        {
            "content": "Capturing the beauty of childhood through nature with heavy doses of spiritualism, this enchanting animation is everything that a children's movie should be. It proves that experience can be gained from non threatening situations, and that learning can occur while preserving innocence. It's a welcome break from Western approaches to the genre, avoiding any gloom whatsoever in favor of playful wisdom.",
            "review_date": "2018-04-19",
            "source": "rt"
        },
        {
            "content": "Just a really pleasant kids movie.\n\nI had no idea what to expect from this movie, went into it just knowing that there's a big creature in it and that it's a famous Ghibli movie.\nSlowly came to realize that it's pretty much a movie directed at mostly kids. There was no dark twist or big crisis.\n\nThe animation was extremely well done. It's always good to see. The music was for me the highest point of this movie. It was always beautiful and mesmerizing. The story was very adequate, worked well enough. The characters were pretty much all good people. The magical elements of the movie were beautifully done, very creative.\n\nThe tone of the movie really worked for me. Felt very languid and relaxed. It felt like I was soaking up the summer. This movie was a pretty good reminder of what it's like to be a kid. Nice little nostalgia inducing movie.\n\nThey only thing that maybe disappointed me a bit was the rather flat nature of the plot progression here. All the story elements were pretty much tame, if we take everything we're shown at face value. I guess that's due to the unambitious nature of the movie. It's not out to tell a heartbreaking human drama or something of the sort, it just captures its own little tame tale. And that's fine. But because of this it also didn't really stay in my mind a whole lot.",
            "review_date": "2018-04-09",
            "source": "rt"
        },
        {
            "content": "Totoro was barely in this movie. Extremely underwhelming, barely any plot. The animation was amazing but overall this should not have been a full-length feature film. I am a huge Studio Ghibli fan but after watching this movie again for the first time in a few years I have realized how little Totoro you see for a movie that is called 'My Neighbor Totoro'.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "A beautifully drawn heartwarming masterpiece, some of studio Ghibli's finest work.",
            "review_date": "2018-03-26",
            "source": "rt"
        },
        {
            "content": "easily the best miyazaki film. this is because it brought immense nostalgia with it soooo this review is biased !",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "a brilliant work of art and story",
            "review_date": "2018-01-26",
            "source": "rt"
        },
        {
            "content": "Very impressive animation and scenes of awe and wonderment make My Neighbor Totoro an enjoyable anime movie for kids and adults.",
            "review_date": "2018-01-24",
            "source": "rt"
        },
        {
            "content": "True it does not exceed Spirited Away when put side by side, but still a masterpiece nonetheless. It's gentle. It's soothing. It's enchanting. It's everything I wanted in my childhood.",
            "review_date": "2017-12-25",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 5.5\n\nUna de las películas más sobrevaloradas de la historia, el argumento de esta película es extremadamente infantil y no digo que no se puede disfrutar, siempre y cuando no seas mayor de...no se, mientras aun seas un niño inocente.",
            "review_date": "2017-12-18",
            "source": "rt"
        },
        {
            "content": "Lovely and simple, but contains a lot more that what meets the eye. My Neighbor Totoro is one of those movies that you don't watch just to watch it, there will always be a new motivation and new meanings to be found.",
            "review_date": "2017-12-01",
            "source": "rt"
        },
        {
            "content": "One of the best children's movies of all times, and by \"children's movie\" I mean it has something for all of us.",
            "review_date": "2017-11-27",
            "source": "rt"
        },
        {
            "content": "I watched \"My Neighbor Totoro.\"This movie was Japanese animation and directed by Hayao Miyazaki and Studio Ghibli in 1988. It is the very famous movie in Japan. And this is one of the popular movie in Ghibli and also loved by many generations of people.\nThis movie's main characters are \"Totoro, and it is a mysterious animal, \"Satsuki\", she is a girl who is very steady, and\"Mei\", she is younger sister of Satsuki.\nFirstly, Satsuki and Mei and their father moved to countryside for their sickly mother. In the new their house, they were surprised because suddenly \"Makkuro Kurosuke\" appeared. \"Makkuro Kurosuke\" is black dust however they has eyes and also move anywhere. It's very mysterious... However the two girls were enjoying the house. One day, Mei found a very small load while playing alone and she walked through the load. In the place that she reached, she found a very big animal that has never seen. The animal named \"Totoro\" by Mei. After that they sometimes met Totoro, and they helped by Totoro. \nI personally think the best scene of this movie is the scene that Satsuki was searching Mei. Satsuki tried to her best running to find Mei. And Totoro & Nekobus helped her and she could find Mei. I was very moved in this scene, and you will be too.\nI think the writer wants to tell you children's pure heart. This is because only children who have pure heart can see and meet Totoro. There is a phrase in the music \"Kodomo no toki ni dake anata ni otozureru fushigina deai\". This means A mysterious meeting while only you are child. I love this phrase so much and the phrase make me excited. Adults can't see Totoro. I am 19 years old yet, so I might be able to see Totoro. I really want to see Totoro. If you want to remember your pure heart, I recommend \"My neighbor Totoro.\"",
            "review_date": "2017-11-14",
            "source": "rt"
        },
        {
            "content": "Hayao Miyazaki is the famous movie director of Studio Ghibli and My neighbor Totoro is one of the most famous movies in Japan especially. When I watched this movie, I could feel nostalgic because the movie reminded me of hanging out with my friends during my childhood. For example, I often played with my friends in a park which is called KAIGARAYAMAKOUEN(shell mountain park) or in Tokyo when I was a child and there was some trouble. The movie of Totoro also has one big problem, so I personally think if you watch My neighbor Totoro, you can connect the movie with some your memory.\nBesides, the story is written by child's perspective so I could back to my childhood while I was watching it.\n\nTotoro also has a lot of unique expression of Ghibli. For example, the movie has beautiful green pictures and many emotions of characters. Especially, \"Wind\" is one of the most important things in Totoro because when the emotions of characters are changed by something, \"Wind\" will blow. This is my most interesting point in Totoro. I can enjoy watching the movie every time.\nSatsuki, Mei and their father moved to a farm village because of the their mother's disease. One day, when Mei played by herself, she found Totoro and she built a good relationship with Totoro and another day, Satsuki also found it. So far the story had progressed smoothly but in their summer vacation, they received a bad message about their mother from a hospital. Then Mei tried to go to the hospital by herself. I think this part was the most important section because the atmosphere of this story was changed. (of course, \"Wind\" was blowing.) Besides, as I wrote, I could remember my childhood and feel the pure heart of Mei because children usually love their mother. Incidentally, I will go to see my mother even in my case. lol\n\nIf you watch a movie of Ghibli, you can see beautiful pictures, changes in emotion of characters and so on as I wrote above but My neighbor Totoro teaches us \"What is the pure heart of children.\"This meaning is that we can just feel it but it is usually difficult for us, adults, to remember the feelings of children in our life. However, Totoro has an ability to remind us of our own childhood. So I want you to watch this movie to feel the same feeling as me. Also, children and adults can enjoy watching it together and be moved by the movie. I hope you will watch My neighbor Totoro.",
            "review_date": "2017-11-13",
            "source": "rt"
        },
        {
            "content": "A pure fun movie that will make even the most cynical of movie goers happy My Neighbor Totoro is one of Studio Ghibli's best work to date",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "This is a very good movie for all ages",
            "review_date": "2017-10-24",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro doesn't go to the creative lengths of some of Miyazaki's other work, but it is nonetheless a beautifully animated and sweet feature that's a lot of fun to watch.",
            "review_date": "2017-10-12",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is an animated movie that was produced by Hayao Miyazaki that was released in Japan during 1988 and then re-released in America during 1993. My Neighbor Totoro was released through Studio Ghibli, a company that is famous for what most would call masterpieces like Spirited Away, and Ponyo that has swayed the hearts of many through a combination of story, music, and animation. While the movie was not heavily received during release it is now considered an international phenomenon. My Neighbor Totoro is a film about two girls and their first days moving into a new house so that the girls and their father could live closer to their sick mother. It then delves into the girl's adventures of moving in and meeting their neighbors, spiritual and human. When they are first coming into the house they meet soot sprites, reminiscent of dust bunnies, but living creatures. These soot sprites are their first experience with spirits before they end up meeting three Totoros, these creatures whom are said to be guardians of the forest, as the girls go upon their day, along with a cat bus that is reminiscent of the Cheshire cat from Alice in wonderland.\n\nDespite being a Studio Ghibli film, My Neighbor Totoro is oddly different from the usual formula of using music and animation to progress a great story that can hit at the hearts of young adults. Instead, it seems like Miyazaki had designed this to hit at an emotion that was forgotten by many animators, nostalgia. This focus on nostalgia and letting the audience know that you can grow up without losing that innocent mindset causes Miyazaki to focus more on character building and world building.\nTo start it off, almost all the story is told from the point of view of children characters, and the few times that you see it from adults they talk about the situation from what they imagine as a child. By choosing this direction, Miyazaki sets the feeling of the being a child's perspective and be so tolerant of the kid's talking about spirits bringing in the idea that they can still grow up and mature without having to lose the imagination that they would have. You also have the choice of a watercolor background to be reminiscent of what we would imagine in a flashback to childhood and maybe even the magical nature that is the childhood imagination. On top of the water color background you have the music which while simple, in lyrics and sounds, lets you know exactly what mood the scene is supposed to bring in. The design of the spirits that they meet bring this in too, though one might not imagine.\n\nThe biggest complaint about this film is that critics will say that there is little to no plot in the story. While I cannot say that I disagree with this statement, I will say that having a plot like what most people expect from a Studio Ghibli film is perfect for this film. What most people tend to forget about when watching this is that this is a story of Miyazaki's past, and this story is meant to remind people of the past that one will most certainly forget about as an adult who is busy working. Forcing this movie to have a more intricate plot would backfire and be less nostalgic than the movie ended up being. The second issue that people talk about is that people think that the movie is childish, and while it is true that it is a childish piece, it is a piece that is supposed to bring out the magical nature of childhood, so this has to be expected. What these people miss is that unlike other cartoons, this is a movie that does not talk down to its adult audience, but in fact brings them in by being there.\n\nIn the end, My Neighbor Totoro is still a magical piece of Miyazaki's that will last upon the ages like that of Mickey Mouse and Winnie the Pooh. With the biggest message of this piece telling us that while we can grow up in age that we do not have to lose the innocence and love in order to do so.",
            "review_date": "2017-10-09",
            "source": "rt"
        },
        {
            "content": "Wildly imaginative with catchy songs, it will delight younger kids for whom things don't really need to make sense. The story of the genesis of this classic in the DVD extra materials is interesting in that it reflects the origins of the animator - and has led to a real Japanese Land Trust. (The Extras show video of real scenes recreated in the film.) It's not the classic that is \"Grave of the Fireflies,\" heartrending & poignant adult animation ABOUT children that never leaves you; this is FOR children - and is delightful in its own unique non-Pixar world. I mean really, a cat-bus? But that's what makes it unique & fun & imaginative in a way appreciated by those for whom everything & anything is possible!  | - Norm de Guerre",
            "review_date": "2017-09-17",
            "source": "rt"
        },
        {
            "content": "Despite the fact I used to watch anime in my youth, I have never seen a Studio Ghibli film (I tried watching \"Spirited Away\" back when it came out in theatres but its grotesque visuals scared the shit out of my 4 year old self). But due to their popularity I finally decided to catch up and I have to say, what a solid and memorable beginning for a studio. \"My Neighbor Totoro\" tells a simple but effective story filled with imagination, the animation is top notch, the creature design is simple but memorable, the setting is quite beautiful, and overall it is quite charming and entertaining.",
            "review_date": "2017-07-22",
            "source": "rt"
        },
        {
            "content": "Classic, if not a little dull.",
            "review_date": "2017-07-10",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is not merely a children's film, but a looking-glass scrutiny of a child's mind. Themes of innocence, imagination, and visual memories ooze from the film's beautiful images.",
            "review_date": "2017-07-09",
            "source": "rt"
        },
        {
            "content": "A great anime classic! Great voice work as well as animation.",
            "review_date": "2017-06-22",
            "source": "rt"
        },
        {
            "content": "I love this movie so much. It has a good atmosphere and the characters are extremely likable. This story is also creative. This movie can capture your emotions and feelings too. The animation is really nice too. I just really love this movie. Definitely worth a watch. It has something for everyone. It's also pretty relatable too. They did a really good jobs with this movie. A+",
            "review_date": "2017-06-19",
            "source": "rt"
        },
        {
            "content": "Totoro is so chill. It is for young kids mind you, however the subtlety and beauty is why this is a classic.",
            "review_date": "2017-06-19",
            "source": "rt"
        },
        {
            "content": "Odd anime tale #amsterdam #imdbtop250",
            "review_date": "2017-06-15",
            "source": "rt"
        },
        {
            "content": "A family in Japan went to live in the mountain because the mother needs natural remedies to cure her disease. Her husband is in a rural house with his daughters. But the youngest gets lost in the forest and her sister run after her. They meet an animal called Totoro who is a god of of the forest, then they have a fantastic adventure.\nIn my opinion is an artwork and a fantastic choice for a day out with the family, or if you don't know what film to see.\nThe best moment is the end, but you need to see it to know why.",
            "review_date": "2017-06-12",
            "source": "rt"
        },
        {
            "content": "Reminds me of Alice in Wonderland, with a very large Cheshire cat. A simple story of a young girl dealing with own family struggles, with the fantastical animals aiding her along the way.",
            "review_date": "2017-05-23",
            "source": "rt"
        },
        {
            "content": "Beautiful, magical animated film!!!",
            "review_date": "2017-05-21",
            "source": "rt"
        },
        {
            "content": "The story doesn't have much substance and the two main characters can get a little annoying at times, but the very pretty animation, really lovable animal side characters (particularly the titular character), and the overall positive atmosphere are enough to make this a decent Miyazaki flick for kids.",
            "review_date": "2017-05-13",
            "source": "rt"
        },
        {
            "content": "What  a fun, creative, and colorful way to open with credits. Really cool to see how old fashioned it still is the way the family in the movie is living. The way they wash their clothes and dry them and even how they take a bath. The family seems very happy and tight knit but I wonder if they do have a mother. It's really cute and funny to see how the big sister looks like her mother and the little sister looks like her father.\n\nOf course, as always, the animation is wonderful and the artwork and colors are beautiful. Again, you can see in this movie, the love, respect, and fascination that Miyazaki has for nature. The creatures in this movie are really cute. The music is brilliant. It compliments what's on screen so well. Both beautiful and whimsical.\n\nBeing that the little sister is very young, and still has an active imagination and has nothing to do, I start to wonder if she's creating these creatures in her head. Kind of like what children do when their outside playing.\n\nTo see how Totoro enjoys the raindrops falling on his umbrella put a smile on my face. And then his reaction afterwards. The cat bus! Oh my god. When I saw that, that was amazing. When they made the plants grow, that was so beautiful. Almost teared up.\n\nOverall, wonderfully beautiful and meditative film about childhood and family relationships and a big bear-looking creature called Totoro. I love Miyazaki films. They have this almost magical and whimsical feel about them that no other types of movies have. They also feel nostalgic. All I know is that I will keep watching his movies again and again.",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "Totoro is one of the cutest characters I've ever seen. If you like cute animated films, watching it is almost a MUST!",
            "review_date": "2017-02-24",
            "source": "rt"
        },
        {
            "content": "Allow me to be a detractor for a minute and say that My Neighbor Totoro wasn't as great as everyone led me to believe.\n\nLet's not mince words, here, but the movie certainly is acceptable, if not adorable. The characters are likeable, the animation is decent, and there it quite some sentiment going on. However, I would like to see more \"plot\" in the film. In other words, there were some things that dragged on quite a bit and the elements seem too character-focused for my taste. The safest think I can say about this movie is that it isn't \"my cup of tea\", but if a simple and character-center plot sounds like your thing, then, by all means, go for it.",
            "review_date": "2017-02-21",
            "source": "rt"
        },
        {
            "content": "My Neighbour Totoro was written and directed by Hayao Miyazaki, and is\nthe third animated feature film from the critically acclaimed Studio\nGhibli. It stars Noriko Hidaka and Chika Sakamoto as Satsuki and Mei,\ntwo sisters living with their father in rural Japan. The story is based\naround the two young girls as they move to a new house to be closer to\nthe hospital where their mother is currently living. Satsuki and Mei\ntry to make the best of their situation through a positive outlook, and\na curiosity about the world around them. This curiosity leads the\nyounger sister Mei to stumble across a magical world within the forest\ninhabited by various friendly spirits including the \"keeper of the\nforest\" Totoro. \n\nFull Review available on my blog:\n\nhttps://erindaniellethompson.wordpress.com/2017/02/10/my-neighbour-totoro/",
            "review_date": "2017-02-12",
            "source": "rt"
        },
        {
            "content": "One of my faves of Miyazaki's with just the right amount of whimsy and real-life, even if the plot is essentially non-existant.  The kids love it too.",
            "review_date": "2017-02-03",
            "source": "rt"
        },
        {
            "content": "Not really as good as I expected it, but the charming animation and a simple yet enthralling story still make 'My Neighbor Totoro' a funny and heartwarming ride.",
            "review_date": "2017-02-02",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro touches the heart and piques the imagination. That's what makes it one of the best family films of all-time.",
            "review_date": "2017-01-31",
            "source": "rt"
        },
        {
            "content": "Disappointment, being a fan of Studio Ghibli and having heard so much about the movie expected much more. The water color animation is gorgeous, specially considering it was made in 1988 but it was the confusing story where nothing much happens which was a let-down. Frankly it was boring.",
            "review_date": "2017-01-11",
            "source": "rt"
        },
        {
            "content": "magical. no other way to put it.",
            "review_date": "2017-01-09",
            "source": "rt"
        },
        {
            "content": "This movie looks absolutely beautiful!  The animation is quite amazing.  The story itself is a little weird, but it is interesting enough that I am sure the whole family will enjoy it.  It may be an older movie, but it looks stunning in high definition.  If you like these kinds of movies, you should watch this one.",
            "review_date": "2016-12-31",
            "source": "rt"
        },
        {
            "content": "Not sure what I expected... it's a cute family film with some lovely art-work and whimsical ideas.",
            "review_date": "2016-12-25",
            "source": "rt"
        },
        {
            "content": "One of my new favorite movies. Absolutely loved it.",
            "review_date": "2016-12-13",
            "source": "rt"
        },
        {
            "content": "No plot and a little slow, but super cute and fun.",
            "review_date": "2016-12-10",
            "source": "rt"
        },
        {
            "content": "A very sweet movie.  Totoro is adorable!  I felt like it borrowed a bit from, or was influenced by, Alice in Wonderland - but it doesn't hurt it at all, just made me reminiscent.",
            "review_date": "2016-11-22",
            "source": "rt"
        },
        {
            "content": "Great movie, beautiful animation provides a unique story, cute characters, and an unforgetable film. Once Again Miyazaki proves he is an amazing director.",
            "review_date": "2016-10-19",
            "source": "rt"
        },
        {
            "content": "Una obra maestra de la animación. Hermosa, creativa, una trama tierna y simple, con personajes entrañables, que desemboca en un inesperado climax. Perfecta para ver en familia.",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "Amazing... Truly phenomenal!\n\n10/10 or 5 stars",
            "review_date": "2016-09-20",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 5.5\n\nUna de las películas más sobrevaloradas de la historia, el argumento de esta película es extremadamente infantil y no digo que no se puede disfrutar, siempre y cuando no seas mayor de...no se, mientras aun seas un niño inocente.",
            "review_date": "2016-08-31",
            "source": "rt"
        },
        {
            "content": "Activates one's kid like wonder, but the plot is far from riveting",
            "review_date": "2016-08-20",
            "source": "rt"
        },
        {
            "content": "From the brilliant \"Walt Disney of Japan\", Hayao Miyazaki, comes a wonderful soothing film that everyone will simply embrace. My Neighbor Totoro is a film that should be able to put a smile on any viewers face, and without a doubt, it'll take you on one of the most whimsical and the most fantastical journey's ever. Nothing compared to Miyazaki's 'Spirited Away' or 'Princess Mononoke,\" but still a fantastic piece of cinema that can be considered a classic.",
            "review_date": "2016-08-15",
            "source": "rt"
        },
        {
            "content": "Very cute and great for the whole family or even by yourself.",
            "review_date": "2016-08-13",
            "source": "rt"
        },
        {
            "content": "Simple, yet fully satisfying. There's no obvious bad guy or any other typical children's nature movie. A simple story told of a small family moving into a new house that just happens to be located near a forest with a powerful spirit living in it. Some have said the film is a metaphor for depression and even death. I can see points to where that might have some weight, yet I choose to believe in the humbleness of the premise and how it's presented. A movie for the entire family with good characters and lots of heart. That's all you really need.",
            "review_date": "2016-08-01",
            "source": "rt"
        },
        {
            "content": "Perhaps not the most entertaining anime but, certainly a influence into out-of-the-box thinking and fantasy. The sheer beauty and respect for life and nature, as well as the hidden world of minors. A masterful dreaming adventure.",
            "review_date": "2016-07-24",
            "source": "rt"
        },
        {
            "content": "Absolute masterpiece. Having seen many of the studio ghibli films, I view this to be the best. Fantastic storyline, amazing artistry and touching characters.",
            "review_date": "2016-07-17",
            "source": "rt"
        },
        {
            "content": "A wonderfully satisfying children's film!  A Japanese animated film produced by Disney, this is certainly not your standard Pixar/DreamWorks animation.  \n\nThe beauty of the simplicity of the plot set in rural Japan, involving a father establishing a home in the country with his 2 young daughters, while the mother is in hospital, serves as the basis.  However, throw in Totoro, a strange and friendly forest creature and fantasy merges with reality in a bizarre, comedic and entertaining way!  \n\nIn fact, the creatures are so strange that this film is so differentiated from American productions and so many questions are left unanswered.  Yet we feel that this is perfectly fine.  We realize that loose ends need not always be explained. \n\nAlthough light on action and details, there is never a dull moment.  My two young children enjoyed this film along with me.  However, it is not comparable to the complexities in most American children's masterpieces such as \"Up\" and others, yet similarly satisfying in a more grassroots manner.",
            "review_date": "2016-07-17",
            "source": "rt"
        },
        {
            "content": "Beginning was cute and funny but then it got SOOO BORING!!!!",
            "review_date": "2016-07-16",
            "source": "rt"
        },
        {
            "content": "Favourite film ever:D",
            "review_date": "2016-06-09",
            "source": "rt"
        },
        {
            "content": "A film full of imagination.",
            "review_date": "2016-06-08",
            "source": "rt"
        },
        {
            "content": "amazing. Humorous, deep, spectacular with great hand drawn animation and thought provoking moments.It turns a simple, sweet and at points sad plot beautiful.",
            "review_date": "2016-06-05",
            "source": "rt"
        },
        {
            "content": "One of the greatest animated movies I've seen. The imagination of Miyasaki shines brightly in this family-friendly film. Besides, there's Catbus, and Catbus makes any movie awesome!",
            "review_date": "2016-05-28",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is a classic anime film.It has a great story, great characters, and stunning animation in some shots. I give it a 4.5/5 stars.",
            "review_date": "2016-05-22",
            "source": "rt"
        },
        {
            "content": "My Neighbour Totoro is another wonderful effort by Studio Ghibli.  It is a brilliant examination of childhood exploration and leaves you longing for simpler days.  The animations were great and Totoro and the Catbus were great creations.  They were absolutely adorable.  I would love a life-size Totoro cushion or Totoro onesie.  The music in my Neighbour Totoro was also great.  I was just a little sad that this film was as short as it was.  Totoro is such a great character that it would have been nice to learn more about him.  But then again, perhaps not knowing anything about him is what makes him such a great character.  \n\nRead my full review here: http://goo.gl/CImmIA",
            "review_date": "2016-05-04",
            "source": "rt"
        },
        {
            "content": "I'll say something i'd never think i would say as criticism for a kids movie: Hayao Miyazaki 'My Neighbor Totoro' is too cute, too cuddly, too friendly, too heartwarming , too affectionate, for me to enjoy fully. I did think it was a good and entertaining film, but up until the last 20 minutes (when the story finally gets some engaging, emotional gravitas) it was almost nauseating how cutesy this film was. \n\nThe story is simple, the characters are simple, and frankly every scene without Totoro, or any other fun and creative fantasy creature, is just a plain, but sentimental depiction of childhood.\n\nI give it 4 stars simply because i love the animating style of Miyazaki and that style shines as always in this movie too, every scene with a fantasy creature in it is highly creative and fun (With the busstop scene being the pinnacle of this movie for me), and it's entertaining. I know being too cute and sentimental is a strange criticism, but that really is my only complaint of this film.",
            "review_date": "2016-04-28",
            "source": "rt"
        },
        {
            "content": "Hayao Miyazaki uses his memorable characters to show us that we can find friends in unusual places.",
            "review_date": "2016-04-14",
            "source": "rt"
        },
        {
            "content": "It's amazing how he tells a story that doesnt invove an antagonist, just 2 sisters living a new and amazing experience. Miyazaky grounds you with amazing detail on every little thing, from the trash under the house to the dirt in their feet from playing and running just to blow your sense of reality away with amazing and fantastic magical things happen suddenly but in small dose. LOVE IT good for all the family no matter the age.",
            "review_date": "2016-03-31",
            "source": "rt"
        },
        {
            "content": "Best art I've seen in a movie in a long time. It's a really cute movie as well.",
            "review_date": "2016-03-30",
            "source": "rt"
        },
        {
            "content": "It wasn't bad, just not my thing.",
            "review_date": "2016-02-23",
            "source": "rt"
        },
        {
            "content": "a happy amazing movie and finally a family friendly anime movie",
            "review_date": "2016-02-21",
            "source": "rt"
        },
        {
            "content": "Strange but totoro amazing",
            "review_date": "2016-02-05",
            "source": "rt"
        },
        {
            "content": "Great classic!!!! I Say: A movie in the year, maybe.... the best year of the animated movies. With Totoro, and the drama of Isao Takahata in japan, and the vs. of The land Before time and Oliver and Company. Also Roger Rabbit. The great year in the industry, only classics, and totoro also.",
            "review_date": "2016-02-02",
            "source": "rt"
        },
        {
            "content": "I don't particularly care for anime movies. I have seen most of the popular ones and I'm not impressed. I consider Japan's most famous anime directors overrated and the list includes Hayao Miyazaki (keeping him company are: Momoru Hosoda, Isao Takahata, and Satoshi Kon). So, you can imagine that I didn't have high expectations going in; boy was I wrong.\n\nTonari no Totoro needs no introduction, it is the face of studio Ghilbi, its first release alongside Hotaru no haka, and it is referenced  and spoofed in other works constantly. \n\nDuring the first minute of the movie, the experienced viewer identifies the familiar studio Ghibli animation and the newcomer is left wondering how a movie released in 1988 can still look so beautiful, while Miyazaki introduces us to our two heroines, Satsuki (10) and Mei (4), as their father drives them to their new residence, in a rural village. \n\nAfter a few minutes more, we are quick to realize the main characteristic of the movie: This is a story being told while looking through the eyes of a kid. If you think you have heard that one before, allow me to make a distinction; Miyazaki managed to capture the way a kid views the world, in such a way, that it doesn't feel like a story written for kids by adults, but it feels like the accidental filming of a kid's dreamy state of mind. \n\nI will take this point even further; I don't think this is a kid's movie. I recognize, of course, that it has all the elements a kid's movie should have, but I'll insist. I can not imagine a kid older than 6 liking this movie. Most kids will find it unexciting, opting instead for a show that triggers are pulled, or princesses are getting crowned. \n\nI cannot imagine myself up until my late teens liking this movie. Instead I can easily imagine myself saying the Greek equivalent of, \"well, that was a waste of time\" or \"nothing fucking happens\". Indeed the movie seems uneventful at first glance, but there is a distinct shadow of death and loss looming throughout  the movie; Its existence maybe be lost to the younger audiences, but it appeared to me as a potent a \"villain\" as any. \n\nBut it is high time I get to what makes this movie great. After the Kusakabe family steps out of the car, having reached their new home, we, the audience, realize that we have stepped in a magical world. The interesting part is that this magical world feels familiar and I was quick to be filled with nostalgia; watching the two sisters rush to fetch a bucket of water reminded me the first (or, at least, one of the first) times that I watched running water. Those of you who discard these feelings of nostalgia, I ask you to remember the first time that you came across a small river. And then try to imagine who happy and excited you were.\n\nThat brings us to the main point of why Tonari no Totoro is so great; It doesn't coerce nostalgia from us with its imagery, but it reminds us how perfectly happy we were with the simplest of things: The shade of a big tree, a path to the woods, and some folklore. \n\nContinuing, we are introduced to the countryside and its denizens, human and magical, but most of all we experience a sense of harmony between man and nature, so seamlessly interwoven, that it puts preachy environmental-friendly works (including ones from Miyazaki) to shame.  \n\nThe feelings of euphoria and harmony continue, while the two sisters meet and interact with the spirit world and combat the shadow of loss with their own childlike (I mean that in a good sense) way. The ending is simple but fulfilling. \n\nMy new favorite anime movie. 9.0/10.  If you like this one, my second and third favorites Hotarubi no Mori e (8.5/10) and Ookami Kodomo no Ame to Yuki (8.0/10) share some traits.",
            "review_date": "2016-01-10",
            "source": "rt"
        },
        {
            "content": "The whole family will appreciate the realistic drama interwoven with innocent, dreamlike fantasy sequences. Miyazaki's animation is charming with great attention to detail.",
            "review_date": "2016-01-09",
            "source": "rt"
        },
        {
            "content": "A heartfelt and feel-good animated offering.",
            "review_date": "2016-01-07",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is a great example of the anime genre, showing the fun and lighthearted tone that the genre can have. Anyone can find something enjoyable. The film has managed to stay popular since its release almost 30 years ago and become a cult movie for the anime genre, which is saying something. If you enjoy anime or even just animation in general this movie is a must see for you.",
            "review_date": "2015-12-04",
            "source": "rt"
        },
        {
            "content": "This early film from Studio Ghibli is a sweet, family-friendly story.",
            "review_date": "2015-11-27",
            "source": "rt"
        },
        {
            "content": "Another masterpiece by Miyazaki. My Neighbor Totoro is nothing short from a charming and heartwarming animated sensation worthy of remembrance.",
            "review_date": "2015-11-21",
            "source": "rt"
        },
        {
            "content": "Beautiful, full of colors, simple story but speculate film. Full of fantasy whose features were created by clever and inventive way.",
            "review_date": "2015-11-18",
            "source": "rt"
        },
        {
            "content": "A really enjoyable film. A great film to add the Hayao Miyazaki collection.",
            "review_date": "2015-11-12",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is a very cute cartoon about 2 little girls who move to the country and befriend some magical forest creatures. The best thing about this movie is that the family feels very realistic. The way they talk and play with one another is exactly as I would expect a real family to act. I also love Totoro and the other creatures of the forest, because they are so adorable. The animation is in a very classic hand-drawn style and gives me flashbacks to the cartoons I watched in my childhood, which certainly makes me smile. If I was still a child I could see myself just adoring this sweet story, and the lovable forest spirits. However, as an adult without kids, I find it kind of simplistic and uninteresting. Also the story lacks a traditional structure, so there's no clear protagonist to connect with, or antagonist to root against, or really any growth or change for the main characters. That's not necessarily a fault, but it made it even harder for me to form an emotional attachment to the events taking place. I hate to take My Neighbor Totoro to task very much, because it is an extremely well-made film and is quite heart-warming. For the target audience it's probably delightful, I'm just not in that target audience.",
            "review_date": "2015-11-11",
            "source": "rt"
        },
        {
            "content": "A very heartwarming story about two innocent young girls on a strange yet wonderful adventure at their new home! It starts out pretty slow but the slow is actually good and the buildup towards the middle of the movie makes things a lot quirky and strange but all of it is just that, too good to be true. If you're a fan of Studio Ghibli movies and you have not seen this yet, I strongly recommend watching My Neighbor Totoro and I finally know why it's a such a good movie. You have to see it to believe it!",
            "review_date": "2015-10-28",
            "source": "rt"
        },
        {
            "content": "My favorite Miyazaki film. Absolutely wonderful.",
            "review_date": "2015-10-25",
            "source": "rt"
        },
        {
            "content": "it is awesome you gotta watch",
            "review_date": "2015-10-04",
            "source": "rt"
        },
        {
            "content": "Charming and memorable",
            "review_date": "2015-09-18",
            "source": "rt"
        },
        {
            "content": "Founded in 1985, Studio Ghibli, the Japanese animation film studio has never looked back. Ghibli has become the pioneer for Japanese animation and has even influenced animation as an industry itself. Hayao Miyazaki is the figure that has particularly shaped anime films for he has directed classic after classic after classic. But with Miyazaki retiring, there is potentially a damaging future ahead for Ghibli because Miyazaki has been the driving force behind its rise. He directed Ghibliâ??s first film ever in Castle in the Sky, all the way through to 2013 with his last film The Wind Rises. All the best Ghibli productions in the form of Princess Mononoke, Kikiâ??s Delivery Service, Howlâ??s Moving Castle and Ponyo have all been touched by the hands of Miyazaki that is how special the guy is! Ghibli, and fans of anime, will truly miss Miyazaki for he was their heart and soul. His greatest creation released in 1988, My Neighbour Totoro, undoubtedly helped bring Japanese anime to the world with a timeless storyline of adventure and wonderful fictional characters. Japanese animated films have grown since Totoro, which perhaps has been the catalyst for Ghibliâ??s future successes. Anime films that came after Totoro were allowed to receive worldwide notice. Some may consider Spirited Away the greatest of Miyazakiâ??s creations and best of all anime films, but it would not have been given the time of day to strut its stuff and win the Best Animated Feature of 2002 without My Neighbour Totoroâ??s influence upon the world. Japanese anime is what it is today for the impact My Neighbour Totoro has had on the world that Ghibli has recognised this and made Totoro their poster boy to which the world can identify with.\n \nMy Neighbour Totoro tells the tale of two young girls, Satsuki and Mei, who have moved to the countryside with their father in order to be closer to their mother who is suffering from a long-term illness in a nearby hospital. Once there, Satsuki and Mei explore and integrate themselves into the surrounding nature and wildlife not knowing that the spirit of the forest lurks nearby. One day, Mei meets and befriends and large creature that roars and is interpreted as â??Totoro.â?? Satsuki and Mei bond and interact with Totoro and the array of friendly forest spirits in postwar rural Japan, until Mei disappears and Totoro, along with his friends, must come to the aid of Satsuki and help find her sister. My Neighbour Totoro does not present itself as spectacular entertainment, but instead it reveals itself as a warm, cuddly film that the whole family can enjoy. Despite this, the film can become slightly boring as it takes a long time to fully grasp our attention. Our attention is only captured once Totoro reveals himself and the bond between the characters develops. The film thrives off of being itself and not over-the-top in its depictions as itâ??s about family, nature, relationships, love, the passion for adventure and the ability to lose yourself in the mysteriousness of the world. Every kid will love this film for its sheer sense of exploration and playfulness and may even instigate a fascination of adventure in them rather than the technological inspirations most kids today only know of. \n \nSatsuki and Mei are two young girls whose adventurousness can be felt and reminisced in most of our childhoods. They are so lifelike as they go through stages all children go through from sadness, to ecstasy, curiousness and assurances to their many questions. They do have an irritating side to them as they constantly shriek at one another, however, their bond as sisters in which they do everything together and at the end go to lengthy distances to look after one another makes them admirable characters for they appreciate wildlife, have a sense of adventure and most of all love one another. Totoro, a spirit of the forest, can be described as a giant-furry-cute thing that looks almost like something out of PokÃ©mon, which is also made by Japanese peopleâ?¦ they sure do love their weird animal creations! Totoro is a big round blob that appears scary and powerful but is so friendly and human loving in nature that he easily falls into your good books. He has become over time such a culturally important figure to many people, as he is a cuddly toy for young children, on the shelves of many mature adultsâ?? homes and has even been seen in Toy Story 3 as a doll. Totoro is a magical creation for he captures the awe-inspiring nature of all of our childhoods. He, along with his miniature buddies, are genuinely as loved as Tweetie, Pikachu or Winnie the Pooh for the joy they have brought the world and continue to do so. The Catbus is another creation of Miyazakiâ??s, but unlike Totoro is some weird looking animal. The thought of a bus-shaped giant cat that has furry seats and windows inside his stomach is truly bizarre. This animal has the potential to give you nightmares but nevertheless remains a remarkable creation that will stick in your mind for its sheer WTF-is-that factor.\n \nMy Neighbour Totoro is a special film for it is not about conflict and violence; it has a different agenda, an agenda that allows the characters to explore, investigate and grow into this vast world with amazing creatures. If you compare My Neighbour Totoro to films of today, or even animated films of the past few years, it is a unique, fascinating film that doesnâ??t need a goodie or a baddie, but the fascination of life itself to entice you in. Unless you live in a secluded countryside house by yourself, you are going to be influenced by technology and the machinations of the city, and therefore Totoro has developed in my eyes as a criticism of society today for children that prefer to surf the web rather than run about and play with animals in our natural landscapes. Adventure in todayâ??s terms is not using your imagination to experience the beauty of the unexplored world, but instead to feel self-conscious about yourself that you have to please other people and have online exploits. My Neighbour Totoro proves to you that you donâ??t need anything other than yourself, your boundless imagination, your determination to want to explore and your wonder at the remarkability of life to truly have fun in this world.\n \nThe Verdict:\n \nMy Neighbour Totoro is perhaps the greatest of all Studio Ghibli films for its lasting storyline, sense of adventure and loveable characters have endured it in hearts of many.\n \nâ??â??â??â??â??â??â??â??â??â??     9/10",
            "review_date": "2015-09-17",
            "source": "rt"
        },
        {
            "content": "A sweet child and family-oriented story where exploration reigns supreme and forest spirits watch over you and make the difficulties of life not seem so bad.",
            "review_date": "2015-09-07",
            "source": "rt"
        },
        {
            "content": "A great film, but NOT THIS VERSION. Don't be fooled. Watch the original dubbed version. Far superior to this one.",
            "review_date": "2015-09-03",
            "source": "rt"
        },
        {
            "content": "One of my all time favorites.  Beautiful.  The theater near my house recently played this Hayao Miyazaki film from 1988! (it's 2015 now)   I sat near a very young girl, maybe 4 years old, and her eyes were lit up the entire time.  This film takes you into dreamland and you feel innocent and childlike.  Very comforting for the soul.",
            "review_date": "2015-08-16",
            "source": "rt"
        },
        {
            "content": "Whimsical, Heartwarming, and Enchanting. One of the best children's movies I've seen yet!",
            "review_date": "2015-08-15",
            "source": "rt"
        },
        {
            "content": "Leisurely pacing and predictability are unable to ruin My Neighbor Totoro; its solid dub and lovely animation coupled with its immersive world manage to sufficiently satisfy. Verdict: B",
            "review_date": "2015-08-11",
            "source": "rt"
        },
        {
            "content": "I enjoyed the movie but there wasn't conflict in the movie. The ending wasn't really an ending. Mei stole the movie IMO.",
            "review_date": "2015-08-04",
            "source": "rt"
        },
        {
            "content": "My watchthroughs of the Miyazaki films continue with this one. It is more simpler than the other Miyazaki films i have seen. If look at it through the eyes of a kid then its perfect. Very good one.",
            "review_date": "2015-08-01",
            "source": "rt"
        },
        {
            "content": "An instant classic & standard setter for anime films, \"My Neighbor Totoro\" is an amazing portrait of childhood innocence.",
            "review_date": "2015-07-22",
            "source": "rt"
        },
        {
            "content": "Simply one of the greatest films about childhood ever made.",
            "review_date": "2015-07-05",
            "source": "rt"
        },
        {
            "content": "Cute, fun, and just beautifully animated. Not the strongest story, but it doesn't need to be a complicated story. Different, charming, and doesn't rely on a big scary monster or villain. Wonderful!",
            "review_date": "2015-07-04",
            "source": "rt"
        },
        {
            "content": "The main appeal comes from the fantasy elements and the animal characters. There was not much else to it. 'Spirited Away' does a much better job of creating a fantasy world than this movie does.",
            "review_date": "2015-07-02",
            "source": "rt"
        },
        {
            "content": "Totoro didn't interest me much but I think kids would love it.",
            "review_date": "2015-06-13",
            "source": "rt"
        },
        {
            "content": "Not my favourite Miyazaki's film but I still enjoyed it. The lovely thing about this movie is - it has no fights, no scary monsters, no villains. Just love, cute kids and of course, Totoro. Overall, My Neighbor Totoro is a good family animation.",
            "review_date": "2015-06-08",
            "source": "rt"
        },
        {
            "content": "remarkably enjoyable!",
            "review_date": "2015-06-07",
            "source": "rt"
        },
        {
            "content": "Kooky, but fun.  A big squirrel/bunny named Totoro helps two youngsters cope with having a sick mother.  Re-watching this after so long is just magical.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "Totoro is one of Studio Ghibli's finest. It manages to pass off as suitable for children with plenty of fun, play and exploration, while also exploring themes of deforestation and loss of life. Younger viewers can enjoy the company of these mystical creatures while older viewers are given room to contemplate whether they even exist. My Neighbour Totoro is a perfect family film and one of the best animes ever made.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "A must-watch movie that will bring you a joy. The story-line is light and understandable for kids",
            "review_date": "2015-05-10",
            "source": "rt"
        },
        {
            "content": "A sweet and heart-warming story. Beautifully drawn with rich colors. It makes me want to relive my childhood once again..",
            "review_date": "2015-05-06",
            "source": "rt"
        },
        {
            "content": "One of my all-time favorites. I watched it as a kid and my daughter watches it and now my son watches it. Simple and sweet story for children with very little conflict or negativity. A wonderful movie.",
            "review_date": "2015-04-28",
            "source": "rt"
        },
        {
            "content": "The film that got Studio Ghibli off the ground is a great Miyazaki movie.  While some may find it slow and hard to get involved in since it lacks a physical antagonist it is still one of Miyazaki's best films and introduced us to characters like Catbus and of course Totoro, who became Studio Ghibli's symbol.",
            "review_date": "2015-04-25",
            "source": "rt"
        },
        {
            "content": "Just LOVE this movie, I can't stop watching it.",
            "review_date": "2015-04-18",
            "source": "rt"
        },
        {
            "content": "9.5 out of 10:\n\nBeautifully animated and heartwarming, this movie can be really cute.",
            "review_date": "2015-04-09",
            "source": "rt"
        },
        {
            "content": "one of the warmest movies ever.",
            "review_date": "2015-03-29",
            "source": "rt"
        },
        {
            "content": "I love My Neighbor Totoro, it's a fun and peacefull film that is defenately not \"to much.\" Although there are mostly pros to the movie, there are also a couple cons.",
            "review_date": "2015-03-24",
            "source": "rt"
        },
        {
            "content": "This movie is the best! Adorable kids, a lovable troll, and a freaking cat bus! A cat bus, you guys! What's not to love?",
            "review_date": "2015-03-21",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful and charming animated films ever and well deserving its status and following.",
            "review_date": "2015-03-21",
            "source": "rt"
        },
        {
            "content": "Det bedste studio Ghibli nogensinde har produceret!!!",
            "review_date": "2015-03-16",
            "source": "rt"
        },
        {
            "content": "Una película que puede parecer bastante simple, y que quizás no tenga una trama totalmente centrada donde todas las acciones de los personajes transcurran alrededor de ella, pero la película es mágica por sí sola; desde su animación hasta sus personajes con ese toque de inocencia y encanto que sólo puede darle Hayao Miyazaki.",
            "review_date": "2015-03-12",
            "source": "rt"
        },
        {
            "content": "One of the most delightful movies I have ever seen and it left me with a big, stupid grin on my face. Enjoyable in almost every aspect.",
            "review_date": "2015-03-06",
            "source": "rt"
        },
        {
            "content": "Good. 7.8/10. B+.\n\n\nHayao Miyazaki makes a beautiful looking movie that captured the innocence of childhood respectively, even if the conclusion is sudden and unsatisfying.",
            "review_date": "2015-03-03",
            "source": "rt"
        },
        {
            "content": "This movie ended and my son said two things: \"Please say it's not over!\" and \"I wanna watch it again!\" Enchanting hardly covers it. Magical, real and wonderful.",
            "review_date": "2015-02-27",
            "source": "rt"
        },
        {
            "content": "just straight up delightful",
            "review_date": "2015-02-24",
            "source": "rt"
        },
        {
            "content": "This is my third Miyazaki film, and I loved it as much as the previous two. My Neighbor Totoro is a much easier watch then the others I've seen, but there's certainly nothing wrong with that. It's a gorgeous, enjoyable hour and a half experience, and I actually felt a little bummed out when it ended. This film is so easy to get into, with almost a relaxing vibe to it. As expected, the music is top-notch and really contributes to the entire thing. That's the one thing I've noticed with the Ghibli movies I've seen, the score is always phenomenal. In addition to that, the characters are so charming and easy to love. There's a reason Totoro has become the face of Ghibli. A totally iconic and memorable character. I love this film!",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "Always loved this film. A firm favourite of mine!",
            "review_date": "2015-02-09",
            "source": "rt"
        },
        {
            "content": "Satsuki is one of the sweetest and most caring girls in the world, and the girls are so kind of heart and optimistic that obviously the cutest forest friends in the world would befriend and help them in times of need.  Gorgeous visuals and very well-written story.",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "The first few minutes may be a bit cutsy with these two little girls running around, but overall, My Neighbor Totoro is a classic, it captures childhood and living in the countryside so well, it feels real though its animation. Miyazaki puts such amazing detail in how these characters move. I understand some people not liking it after hearing all the hype, but I think this is a must watch.",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "Baffling, joyful and beautiful. Aka, pure Miyazaki. Full review later.",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "This movie is a great film for the whole family I recommend that everyone should watch it.",
            "review_date": "2015-01-28",
            "source": "rt"
        },
        {
            "content": "I now understand the want for a giant Totoro bean bag.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "Showcasing a stunning colour pallet, this lovely and inviting children's fable is a gentle celebration of imagination and the strength of community. Gorgeously told, losing none of its impact in way of English dubbing (sisters Dakota and Elle Fanning voice our young protagonists with tender authenticity), 'My Neighbour Totoro' triumphs in its simplistic storytelling as well as its depiction of masculinity. The dad here represents one of the most genuine portrayals of fatherhood ever depicted on screen. An overall beautiful production. \n\nAlternative Australian title: 'My Neighbour Totoro'.",
            "review_date": "2015-01-11",
            "source": "rt"
        },
        {
            "content": "A really charming and heartwarming film that keeps you hooked from beginning to end. Lovable characters, great animation and great voice acting. I just wish Totoro was in the movie more, I love that furry bugger.",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "Watch this with the child in you.",
            "review_date": "2015-01-07",
            "source": "rt"
        },
        {
            "content": "This is widely regarded as one of the finest family films ever made, and it's hard to disagree with that statement. Beautifully animated, it's heart-warming and sentimental, and has been deliberately made to be completely conflict-free, focusing instead on the beauty of nature and the wonder of childhood. Beautiful stuff.",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "Starring: (English Voice Cast) Dakota Fanning, Elle Fanning, Frank Welker, Tim Daly (Japanese Voice Cast) Noriko Hidaka, Chika Sakamoto, Hitoshi Takagi\nDirected By: Hayao Miyazaki\nRated: G\n\nA father moves his two young daughters out into the country, to be closer to their hospitalized mother. The girls soon find out that their new house and the surrounding woods are home to some strange creatures like soot sprites and the friendly, furry, giant Totoro.\n\nThanks to a group in my town called Cinema 100, I was able to see this on the big screen at one of my local theaters this week. This is my personal favorite of Hayao Miyazaki's films that I have seen (Though I would say Spirit Away is his masterpiece). So naturally you have probably guessed that it will be getting a positive review, and you would be right. Unfortunately I have only seen the english dubbed version, but I'm sure the original Japanese version is just as good if not better. Therefore I think I can safely recommend both versions.\n\nFrank Welker is one of the most talented voice actors you probably don't know, but have more than likely heard. He's voiced everything from Fred Jones in most versions of Scooby-Doo, to feral cats on The X-Files, to the monkey Abu in Aladdin. He's the guy who has brought Totoro to life (in the english version at least) and is the high point of the cast. It amazes me the different range, style, and completely non-human sounds he can make.\nDakota and Elle Fanning do a great job voicing the sisters and work great together because, well they are sisters in real life so that defiantly helps them have a believable relationship when interacting with each other.\n\nLike I said, I love this movie. The Bus Stop scene is one of my favorite scenes in all the movies I've ever watched. There isn't much plot to speak of, but it's a beautifully simple story. The hand drawn animation is stunning and makes me continue to miss that style and I wish we could go back to it. It's a great family film for both the young and old alike. If you don't mind foreign language films, give the original version a try if you can find it. If not, you can't go wrong with the 2005 Disney dubbed copy.\n\n10 Reels Out Of 10\n\n\"Neat, I've always wanted to live in a haunted house!\"",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "Very Cute movie. Great characters, visuals and atmosphere.",
            "review_date": "2015-01-02",
            "source": "rt"
        },
        {
            "content": "There's not too much of a story here, but I supposed you could call this emotionally driven. The main emotion of course being childhood joy as we simply watch two younger girls run around, play, and discover friendly spirits. I feel that this movie can be summed up in one scene where the large spirit Totoro lets out a large roar, with the girls looking at one another, smiling and giving their own \"large\" roars back.- Adorable, innocent, and joyful.",
            "review_date": "2014-12-21",
            "source": "rt"
        },
        {
            "content": "Beautiful, wonderful movie. I really love this movie",
            "review_date": "2014-12-20",
            "source": "rt"
        },
        {
            "content": "This is going to be the strangers and the most weirdest thing I'm about to say but I wish Totoro was real so I can sleep one it's fury tummy, it just looks so comfortable.\n\nThe story is about two young girls who find that their new country home is in a mystical forest inhabited by a menagerie of mystical creatures called Totoros. They befriend O Totoro, the biggest and eldest Totoro, who is also the king of the forest. As their girls' mother lies sick in the hospital, O Totoro brings the sisters on a magical adventure but also helps them to understand the realities of life. \n\nMy Neighbor Totoro (or Tonari no Totoro ) is a anime film with: No scary monsters, no villains, no evil adults and not like the other three act structure, and that could surprise a lot of people who are expecting the same third act in animated movie. This movie was beyond loved for being the best animated film ever made and that's from die hard fans of Hayao Miyazaki and moviegoers everywhere, and I can see easily see why, because this movie in opinion is one of the most griping, beautiful and the most stunning anime that actually give me butterflies deep inside of movie, and that's rare for me.\n\nThis may sound over the top or over doing it but I don't Hayao Miyazaki is a god of anime and storytelling to the big screen. I only seen some of Miyzaki films but after watching spirited Away and this movie I want to more of this guys work, I found out that Hayao Miyazaki last film was The Wind Rises which I need to watch sooner or late, but it's a same to hear that, but the good things must come to a end. \n\nI absolutely loved the animation in this film, I mean how can put it into words without messing up my words. It's better to watch and experience the creative animation standing out from any other animated films, and just let the wonderful character's that are fully of joy and life can easily win you over by the first sentence.\n\nFor problems... I don't have any, yeah no problems with this film. I was glued in by the world that Miyazaki created. I was locked in from start till the very end.\n\nOverall My Neighbor Totoro is different and the film doesn't shy away from that, it's a brilliant film and it's more then a kids film even adults can dig this movie.",
            "review_date": "2014-12-11",
            "source": "rt"
        },
        {
            "content": "A swell film for young kids :)",
            "review_date": "2014-12-10",
            "source": "rt"
        },
        {
            "content": "I liked it, I can't say its great as everyone says it is",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "This is a rare movie, one that's set up as too good to be true. The movie has very little conflict and therefore would leave you to believe that it's just a cheesy and naive family movie. However this movie has a weird kind of, for lack of a better word, magic to it. The combination of the characters/creatures, beautiful and scenic animation, an equally beautiful score to match it, and the countless moments linking them all together make this movie into something new. It changes your thinking from \"our world isn't like this\" to \"why isn't our world like this?\" It's one of the most irresistible movies I've ever seen, one that I couldn't stop smiling throughout. The beauty in this movie is something that will stick with me for a long long time.",
            "review_date": "2014-11-21",
            "source": "rt"
        },
        {
            "content": "A heartwarming and cute movie for all ages! A graceful movie that captures the simple wonders and curiosity of young childhood.",
            "review_date": "2014-11-17",
            "source": "rt"
        },
        {
            "content": "A simple, yet beautiful film about one of the most difficult, and yet most magical, summers two sisters experience.  It had special meaning for my family, because at the time my girls saw this movie, I was hospitalized and my husband and two daughters went through similar trials as the characters in the movie.  My oldest daughter especially found the movie helpful for her.  It will always be a special movie for us.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "Cute little movie. I like it.",
            "review_date": "2014-10-21",
            "source": "rt"
        },
        {
            "content": "Cute imagination but very slow story.",
            "review_date": "2014-10-17",
            "source": "rt"
        },
        {
            "content": "I love this movie. It's one of my favorite Miyazaki films and it's a very sweet story. It's kind of hard not to fall in love with the characters.",
            "review_date": "2014-10-11",
            "source": "rt"
        },
        {
            "content": "A lovely and genuine affair that does not fail to charm, or to enlighten.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "If you want to feel happy, you watch a Miyazaki film. You can't go wrong with Totoro.",
            "review_date": "2014-09-26",
            "source": "rt"
        },
        {
            "content": "Not usually the biggest Miyazaki fan, but maybe I just needed to try out one of his kid movies. I could actually figure out what was going on in this one, and it was sweet and whimsical, if still a bit slow.",
            "review_date": "2014-09-08",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is a timeless masterpiece. This movie is so full of life, beautiful in its childish innocence, amazing take on wild and stunning imagination, perfect in its simplicity, that you had no choice to fall in love in its pure story, and feel a fuzzy warm butterflies on your heart.",
            "review_date": "2014-09-08",
            "source": "rt"
        },
        {
            "content": "I expected a classic.  It was decent, just not much plot, action, or conflict.  Whimsical and well-animated, though.  Captured childhood with a nostalgic brush.",
            "review_date": "2014-09-07",
            "source": "rt"
        },
        {
            "content": "Very cute movie. Hop on the cat Bus.",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "Extraordinary animation of Hayao Miyazaki. Among other adjectives accompanied by timely exclamation points can list: magic, tender, deep, fun, painful, contagious, provocative, beautiful ... \n\nIt is amazing how in Tororo are even more evident the unique qualities that only genius artists can achieve. Here the magic is deeply linked to the forces of nature, and everything that fascinates can also at the same time scare. \n\nBesides the unique look (in its simplicity) and intense charisma (especially the Tororo own and younger sister Mei), the Ghibli studios once again touch on complex issues like loss and accountability, without sacrificing poetry, and especially unrestrained imagination. \n\nFor those who coast cartoons, and art in general, we have a legitimate representative of a flawless and unforgettable work.",
            "review_date": "2014-09-01",
            "source": "rt"
        },
        {
            "content": "Great story of familial love and the faith of little children! The kids loved it.",
            "review_date": "2014-08-29",
            "source": "rt"
        },
        {
            "content": "Miyazaki directs human emotion of all stages of life with unbelievable finesse. Totoro is magical, heartfelt and emotional, and also just a joy to watch. But you all knew this already. What I was really surprised by is the darkness it portrayed, and the way children deal with problems that are far larger than themselves.",
            "review_date": "2014-08-27",
            "source": "rt"
        },
        {
            "content": "Miyazaki's calling card. A simple story about a family who moves to the country side and encounters colorful spirits. This movie is just 100% atmosphere. Very little story to be had here. Instead we get some of the most well written and well animated sisters ever to hit the screen just interacting and living their life. It truly is just a joy to watch. You won't leave thinking you've seen something magnificent or grand, but more like you'd just spent time with some good friends.",
            "review_date": "2014-08-08",
            "source": "rt"
        },
        {
            "content": "AMAZING! I loved this movie and I have seen it like a gazillion times!! I own it on DVD :D",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "Perfectly joyous throughout; everything is magical from the music to the animation.",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "I don't get the hype. I like Studio Ghibli films but this one and Ponyo are not my favorites.",
            "review_date": "2014-07-23",
            "source": "rt"
        },
        {
            "content": "This is a really wonderful film.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "i saw this movie and i was like wat da fuck then i kinda got the concept of alice in wonderland because the catbus and totoro was the white rabit",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "A warm, sentimental masterpiece that captures your nostalgic childhood.",
            "review_date": "2014-07-05",
            "source": "rt"
        },
        {
            "content": "The older fox studio edit dubbed vhs still remains intact on my shelf today! Its also very remembered, fans alike can enjoy over and over the story as it unfolds. I sound like the narrorator. I'm also a miyazaki fan since my first movie . Spirited away! Never gave it a second thought. What a wonderful iconic figure! Very talented. That's how it s done .",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "Still my favorite movie of all time (Tied with Kubrick's 2001: A Space Odyssey, which is a different experience altogether).",
            "review_date": "2014-07-02",
            "source": "rt"
        },
        {
            "content": "My Neighbor Totoro is an absolute treat of a film, with gorgeous animation, whimsical, imaginative, and charming creatures and set pieces, and an overall adorable movie.",
            "review_date": "2014-06-26",
            "source": "rt"
        },
        {
            "content": "06. My Neighbor Totoro\n\nFor many people, 'Ghibli' means 'Totoro', as this was not only the film which jump started Miyazaki's career, but was also a key influence in spreading Japanese animation around the world. And while the gentle pace didn't initially fair very well, it eventually exploded thanks to the release of cuddly Totoro dolls, one of the company's greatest character achievements (yet still second to Catbus), continuing to stand as Ghibli's mascot to this very day. But it's not all about the peaceful, mystical forest animals, but rather the two girls' curiosity as they are forced to come to terms with the realities of life when their mother falls seriously ill in the hospital and their upbeat dad is left to raise them by himself. And yet even while this aura of death follows the plot around, it also exposes the wonders and warmth of our earthly experiences, revealing mystery and fantasy without conflict or suspense, a different formula-less approach in comparison to some of the studio's similar projects. As almost any critic with a heart will agree, this is essential viewing whether you know Ghibli or not, encouraging the growth of children vicariously through the hope of these characters, which is pretty profound for something so simple. \n\nTo read the rest of my 'Worst to Best: Studio Ghibli' list, click here: http://juicenothing.blogspot.co.uk/2014/06/worst-to-best-studio-ghibli.html",
            "review_date": "2014-06-25",
            "source": "rt"
        },
        {
            "content": "Beautiful, heart-warming and cute. My Neighbor Totoro illustrates the importance of imagination, family, the environment and love through the simplicity of childhood",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "3rd best hayao miyazaki film. A",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "It's hard to top Spirited Away, especially when it's the first Miyazaki film I viewed, but My Neighbor Totoro is truly lovable. And even if it could have used more emphasis on it's title character, and more of an adventurous feel, it's still a work of art.",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "Stunning, and delightfully amusing; Miyazakis poignant, and original vision is showcased along with great voiceovers from both Fanning sisters. Kids everywhere will fall in love with this movie, and possibly spark a sense of nostalgia for adult viewers.",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "You never get tires of Totoro. Even though it looks like a little kids movie it's so cute and loving and great no matter how old you are! You get obsessed with Totoro!",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "'My Neighbor Totoro' is one of my favourite Studio Ghibli movies, and is an entertaining anime. The environments is beautifully drawn and the soundtrack in this movie is highly enchanting. Similar to 'Howls Moving Castle' and 'Spirited Away,' this film has many imaginative ideas and the Catbus is pretty awesome, I highly suggest this movie to anyone.",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "One of the most adorable and realistic movies depicting the relationship between two sisters I've ever seen.",
            "review_date": "2014-06-10",
            "source": "rt"
        },
        {
            "content": "I really love this movie! One of the best anime films of all time. ^^",
            "review_date": "2014-06-08",
            "source": "rt"
        },
        {
            "content": "Not my favorite of Miyazaki's but definitely up there and brilliant nonetheless.",
            "review_date": "2014-05-30",
            "source": "rt"
        },
        {
            "content": "I'm sorry but I just don't get this movie. I mean sure the typical Myazaki animation is always nice, and I know the whole focus is supposed to help viewers look back on their childhood. However, the creepy and Pedophilic looking smiles in this kept me from enjoying it.",
            "review_date": "2014-05-27",
            "source": "rt"
        },
        {
            "content": "I can't remember the last time I watched an anime, but My Neighbor Totoro made me feel like a kid again and had me smiling almost throughout it's entirety. I might do a full review, if I'm not too lazy.",
            "review_date": "2014-05-26",
            "source": "rt"
        },
        {
            "content": "This and KIKI are my favorite Miyazaki films. \nI adore this film for many things, but the best part is the relationship between Satske and Mei, and in turn their relationship with Totoro. I love these sisters, and I especially love how their characters fit together like puzzle pieces. Their dialogue and exchanges are genuine and heartfelt, and because of this, this might be one of Miyazaki's most honest films. The other characters are fun and memorable, particularly Totoro and Granny, and do I even have to mention the gorgeous animation? I can understand why this film is a little grating for some, as it doesn't have much of a narrative, but this makes the film all the more realistic at its attempt to portray how magical childhood can be. I adore this film; I've seen it dozens of a times and I'll probably see it another dozen more. WATCH THIS FILM!\n\n\nPS, give this film props for getting the Fannings to play Satske and Mei, which adds realism and heart to their characters.",
            "review_date": "2014-05-23",
            "source": "rt"
        },
        {
            "content": "this story just put a big smile on your face! it is really hard not to love Totoro.",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "Five Stars simply aren't enough--100 stars wouldn't be.  I am not hesitant to say that no children's film can match My Neighbor Totoro, an absolute masterpiece that ranks alongside if not above every other example of the genre.  A seemingly simplistic childhood fantasy film, Totoro manages to capture the essence of childhood wonder and whimsy while also commenting in a thoroughly intelligent way upon how this disconnect from childhood has led to many of the problems in the adult world.  A profound film about nature, family, and community, Totoro manages to be simultaneously critical and heartwarming.  It is a truly rare film and perhaps the greatest testament to Miyazaki's genius.",
            "review_date": "2014-05-14",
            "source": "rt"
        },
        {
            "content": "Totoro. Flying cat bus. Not much else to note.",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "One of the rare films which doesn't try to \"tell\" you a story, rather, let you experience it firsthand.",
            "review_date": "2014-04-28",
            "source": "rt"
        },
        {
            "content": "It's hard to believe it's 1988 animation. Master Miyazaki.",
            "review_date": "2014-04-25",
            "source": "rt"
        }
    ]
}