{
    "rating": 3.1,
    "release_date": "Invalid",
    "num_reviews": 104,
    "genres": [
        "English"
    ],
    "summary": "Rob Anderson is all set to marry the girl of his dreams, but can't quite get to the altar. He finds himself caught in a time loop, waking up naked in a hotel elevator over and over again.",
    "reviews": [
        {
            "content": "Really enjoyed watching this tonight - Wayans physical comedy and facial expressions had me in stitches - would definitely recommend.",
            "review_date": "2023-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's amazing. I don't know what magic this work of art carries, but it makes me rewatch it after 1 week... I've watched it 7 times already",
            "review_date": "2023-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest movie in the world? No. The greatest Marlon Wayans movie? Also no. But it was pretty funny, with some heartfelt moments that really tie it all together. Great cast, and could even be worth a second watch.",
            "review_date": "2023-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So dumb and repetitive.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's goofy, but made me laugh out loud.  And the music was good.  Who says every movie has to be groundbreaking or intellectual?  I got a kick out of it!",
            "review_date": "2022-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a good movie! Why do people hate on it just because it's weird. That's the point. He is naked because they thought it would be funny! AND IT IS!",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super unoriginal, and is too long.",
            "review_date": "2021-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Give Marlon Wayans some requite recognition for being naked for 2/3 of the film regardless of how repetitive of this film's direction",
            "review_date": "2021-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The truth is, Naked is an entertaining film that has good moments and that on average it has been carried out correctly without standing out in any area, it is predictable at a certain point, especially in the second part of the film.",
            "review_date": "2021-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So cringe and so much inconsistency. Awfully written. I actively went out of my way to find who directed this movie just so I could avoid all of theirs from now on.",
            "review_date": "2021-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it. If you want to watch Citizen Kane, watch Citizen Kane. If you want to watch Ghostbusters, watch Ghostbusters. If you want to see a kind, funny man overcome a million obstacles to true love, watch Naked.",
            "review_date": "2021-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie I've ever watched, Extremely predictable with nothing new to offer, inconsistencies in the plot and very poor story development and subpar humour. A total waste of \"time\", I want my 1h30m back. \n\nSeriously would not recommend, Even ironically.",
            "review_date": "2021-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "TERRIBLE/10 \nIf you're watching this movie for fun let me tell you that it is NOT fun. The movie is a disaster; the pacing of this movie does not make sense and the character development is terrible. There are A LOT of annoying plot holes \nI wanted to stop watching it but sadly i did. The only good thing that I'm getting from this is saving others from not watching it. (please don't watch it)",
            "review_date": "2021-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd have preferred reading a Chetan Bhagat novel than watching this movie. This movie made me wanna gouge my eyes out like Oedipus did after sleeping with his mother. I absolutely hated it. I wish there was an option for giving no stars.",
            "review_date": "2021-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is one of the fresher Romcoms I have encountered. My wife and me thoroughly enjoyed it.",
            "review_date": "2020-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This hilarious \"White Chicks\" humour with a mix of GroundHog Day storyline. I loved watching this film and the LOL moments.  Following the story of Rob Anderson (Marlon Wayans) and how he can't get to his wedding day, we learn all the people he mets on his way and who is out to sabotage his wedding.",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So cliché, not funny, no story in it, just a simple plot like all other « comedy-drama » movies",
            "review_date": "2020-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is without a doubt the worst Netflix movie I have ever seen, bad, terrible and horrible.",
            "review_date": "2020-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "don't hate me I may be the only one on earth who likes this movie",
            "review_date": "2020-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a generally funny ride with a good amount of heart. But, although the movie is reasonably short, clocking in at not even an hour and forty minutes, it really drags at some points. The acting was good, but nothing super special. The actors were not very memorable, people that could easily be replaced by a whole new cast and the movie would be no different. This is not a bad film by any count, but not great.",
            "review_date": "2020-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised how much i much i liked this movie.",
            "review_date": "2020-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, Silly, action packed, feel good movie. Not going to win academy award, but great rental for Wednesday night. I loved it. ",
            "review_date": "2019-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't give 0 stars because the system doesn't allow me",
            "review_date": "2019-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only interest is written : \"Marlon Wayans\" + \"Naked\"",
            "review_date": "2019-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bill Murray would be proud of this updated Groundhog Day",
            "review_date": "2019-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was a pretty funny and silly little Rom Com",
            "review_date": "2019-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very unpopular opinion, it was hilarious.",
            "review_date": "2019-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "could not give a lesser rating",
            "review_date": "2019-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I personally thought it was really funny and entertaining. I don't know why people didn't like it",
            "review_date": "2019-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do you have Allstate if not click or call",
            "review_date": "2018-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "when i thought the movie was nearing its end i paused it.. it had been half an hour",
            "review_date": "2018-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Would not recommend. So stupid, and so bad that I eventually gave up watching. I sat through over an hour waiting for a laugh, and I was continuously disappointed. Stupid, poor writing, terrible plot. Not worth any rating at all but I have to put at least a half star. ",
            "review_date": "2018-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not a great movie. But I don't regret spending the time to watch it.\nNothing especially new or original. But quite a few funny jokes",
            "review_date": "2018-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty funny i was surprised how much i liked this film i couldn't stop laughing",
            "review_date": "2018-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly wish I could rate this less than half a star. This movie was awful. I hated it. Its so bad that it makes me angry. This is supposed to be professional writing? I expect better from Netflix. Shame shame shame.",
            "review_date": "2018-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie, and so did the rest of the family! OK, so it's not an oscar contender, but if you want to see a funny comedy on a Friday night, this is worth seeing!",
            "review_date": "2018-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "intresting consept. but not that well exucudet 2.8/10",
            "review_date": "2018-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a fun movie, mind you, it's not great or a laughter ride but does manage to give you enough laughs to make it enjoyable.",
            "review_date": "2018-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every bit as funny, pointless and inexplicable as Ground Hog Day.",
            "review_date": "2017-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No award winner but I really appreciate the universal appeal..It wasn’t a “black comedy” a “white comedy” or a “chick flick,” it was a little of all",
            "review_date": "2017-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny movie, interesting story.",
            "review_date": "2017-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marlons Wayans is sure on the decline of his career. He really should've made a White Chicks 2. Regina King tried to make an appearance in this movie but wasn't strong enough to bring the whole film together. As you watch you wonder, \"Why is this even on Netflix?\" The 0% actually means alot. After the Haunted Houses I never want to watch the Wayan's again.",
            "review_date": "2017-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its funny at times and does have a good story. To bad that story is predictable...",
            "review_date": "2017-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not Ghostbusters, Groundhog Day, or Caddy Shack, but this comedy is solid and I'm truly confused about the hate it is getting. It's not raunchy, it doesn't go to any extremes but goofs around with its story. It's a pizza and beer movie that will give you a good 90 minutes of chuckling.",
            "review_date": "2017-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ignore the negative reviews, this movie is a funny, feel good film that touches the heart.",
            "review_date": "2017-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "He's back at it again.  So this is about a soon-to-be-married man (Marlon Wayans).  It's finally the big day, so it is a time of stress as you can probably imagine, and it doesn't help that wakes up in an elevator completely naked after a night of heavy drinking.  To further exacerbate things, he's caught in a Groundhog Day situation, but it's not the same day he has to relive, it's the same hour, so he has got a lot of failure in store.  Now I always like to have a respectable worst of year list when the end of the year rolls around, so I do find myself knocking on the doors of Wayans and Sandler come every year.  With Naked, I geared up, expected the worst... and to this movie's credit, it's not the worst thing I've ever seen.  I know that is damning Naked with faint praise to be sure, but I was expecting the worst with this, and I don't think you can blame me for preparing for that.  Now it isn't a secret that I'm not the world's biggest Marlon fan.  I think it is even worse because I know he has got the talent, and choosing not to use his ability is a bigger sin than just simply being incompetent.  It's always about the foolishness with him, and even here, when he is making an ass out of himself, it doesn't work, either.  I don't know if this has anything with this being a Netflix original, but he is far less over the top than he tends to be.  Also, there is actually a running story to this instead of it being a random collection of movie references, so it does help keep the movie moving, which I appreciated.  Ironically enough, even though you would think this would be way more risqué due to the title, it actually ends up being one of his tamer comedies with a small degree of heart to it.  Even though there is that welcome but unexplained sci-fi element to this, it still is not enough to merit you watching this.  There are questions that go unanswered, like why this successful woman would be with him, or how he managed to get anything done within the hour.  Even with repetition to perfection, there are still too many items on his laundry list for him to be able to make this wedding successfully happen.  It's still not funny, it's just not offensive like his other movies.  Is this one of the worst movies of the year?  No, and it's not going to make my bottom 10 list.  Is it something you should use your valuable time on?  No, don't be silly.",
            "review_date": "2017-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best thing that can be said about naked is it's better than both of the haunted house movies. The movie actually starts off decent and shows sign that it could be funny but the gags run short and the jokes become stale. All in all the pretty forgettable comedy doesn't even hold a candle light to Groundhog Day.",
            "review_date": "2017-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are some good moments in the beginning. For example, the scene where the police asks Rob if he has any enemies, and Rob can't think of anything, despite the first ten minutes of the movie being dedicated to showing how many people hate him.\nThe ending completely ruins the movie. Naked borrows the concept of groundhog day, and borrows the ending as well, and just like groundhog day, they start out with an unlikable protagnist that's supposed to grow into a better person during the loop. But Rob's growth is very forced. Why does he decide to stop being so immature? Because he talked to his mom, and his stepfather... How does he prove he's no longer immature? By repeating what they said, literally ad verbatim. \nAnother serious problem with the movie is its villains: Vicky and Cody. They are  cartoonishly villanous, and not in a funny way. Vicky is the evil white ex-girlfriend, cody is the evil white ex-boyfriend, and the ending dedicates a few minutes to exposing their evil plans to everyone, and their idiotic plans are foiled. It's like scooby-doo, and it completely ruins the dramatic tone they tried to set up for the ending.",
            "review_date": "2017-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't know why people give this movie negative reviews. I really enjoyed it, it was so funny that I laughed in tears. Come on people, don't be harsh on a chilling movie.\n ??",
            "review_date": "2017-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I decided to watch this movie cause the trailer was a bit funny and there is not too many movies on Netflix that I've been interested in that I haven't seen already. So a month ago, August 11 when the movie was first released on Netflix, I watched Marlon Wayan's film Naked. (I know that sounds wrong) Even though I hate Marlon Wayan's movie, I decided to watch it. Ugh. I don't hate the guy, but he can't make a good movie. Scary Movie was good but that was 17 years ago. Naked is very slow paced, very unfunny, and has a couple annoying characters. Naked is another Groundhog Day type of movie this year. 2017 we have Before I Fall, Naked, and Happy Death Day coming up. I also forgot to tell you this movie is annoying to its characters to its stupid storyline. The only positive I can say is I like the relationship between Marlon Waylans, oh I mean Rob Anderson, and his wife Megan Swope. And they get married during the movie. Ssshhh Spoiler Alert! 0.5/5 stars. One of the worst movies of 2017 so far.",
            "review_date": "2017-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It cheers up my day, damn funny. Watch it guys",
            "review_date": "2017-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Altogether ridiculous, cheesy and just plain strange: \"Naked\" can be assumed to be as odd as the Netlfix description describes it to be, yet without the laughs that you would expect.",
            "review_date": "2017-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most emotional, heartwarming, and poignant films of the entire century, and possibly millennium. The artfully crafted dialogue juxtaposed with the humorous setting and occurrences help the movie's characters delve into the deeper meaning of love and marriage, and how to make it all work.",
            "review_date": "2017-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid and not very thought through.. Big holes in the story, and not creating the neediness to find out the answer to those questions..",
            "review_date": "2017-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's basically a micrometer Ground Hogs Day., But still worth watching?",
            "review_date": "2017-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its narrative formula wears thin long before the movie's over and there's barely a chuckle to be found throughout, Naked is another Netflix original misfire and a huge waste of time.",
            "review_date": "2017-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lacking the grace, charm and integral humor it's predecessors once had, the subtle \"Groundhog Day\" genre of film is getting stale, and this film is starting to show it.",
            "review_date": "2017-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More than occasionally funny, but near unforgivably derivative.  If there\u0092s nothing original under the sun, there\u0092s no shame in ripping off Groundhog Day every now and then, but when you centre your plot around a man-child finding his way to supposed maturity through the love of a good woman, you\u0092re really squandering whatever goodwill you get by paying homage to a classic.  Watchable, but you don\u0092t need a degree in film studies to spot markers in the first act are going to be reversed by the third.",
            "review_date": "2017-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "better viewed on fast forward, and abandoned before the end of the first episode.  I wanted to like it, but it was poorly produced",
            "review_date": "2017-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was very funny. LOL! :D",
            "review_date": "2017-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was really funny, I liked it a lot. It was similar to think like a man and the wedding ringer, I personally thought it was better.",
            "review_date": "2017-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an overall funny and encouraging moviie.",
            "review_date": "2017-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worse movies i have ever seen, I'm so amaze how this Wayan guy, could't realize that this movie wasn't funny, I'm sure they have tallent, I'm sure they have friends, maybe they can find a good joke writer, but men! this is pure shit, not a single bit make me laught, I just don't understan why they think this is funny, I mean they are professinals, they actually do this for living... and Netflix, jeez, you are doing a good job bringing god series and some movies and I thanks that, but you have to be more selective.",
            "review_date": "2017-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I give it a 1/5 just because I generally like the Wayans Bros. El film gaw 1000 Mabrouk wel yoom be3ed nafso we its his wedding day kaman..sara2o fekra menena akheran hahahah- e7na sara2na el fekra kolaha we homa sara2o 7etet eno his wedding lol. Not as funny as expected.",
            "review_date": "2017-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the idea that they used, someone makes a fool of himself, but on repeat. The only problem is, this idea has been used up to the point where it is near impossible to enjoy. \"Naked\" is a very poor film, besmirching the good name of a great film \"Groundhog Day\". Using petty humor, poor and overused themes. It was a struggle to force myself to watch it and would not recomend doing so to anyone else.",
            "review_date": "2017-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started off promising but quickly went downhill and never recovered. Unfunny, repetitive and at times just boring.",
            "review_date": "2017-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, nothing special but if you want a laugh, watch this!",
            "review_date": "2017-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man this movie was hilarious. Comparing it to Groundhog's Day is lame! Smoke a blunt and watch this. My mans Marlon was switching back and forth in bikini bottoms ?????? crine!",
            "review_date": "2017-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Netflix hasn't had the greatest track record for releasing original films. I'm just being honest here, but I truly believe they need to choose better projects in terms of film. Naked is one of their latest outings, and while it's not a train wreck by any means, it's not all that good either. When it comes to comedies (or any genre of film for that matter) it really needs to be worth watching from start to finish. The issues with this movie is the fact that there are some standout moments, but just as many moments that fall flat. Here is why Naked may actually be worth your time for a few laughs, but you won't be wanting to revisit it afterwards. \n\nFrom Groundhog Day to recent releases like Before I Fall, the idea of having someone relive events has become somewhat of a trend lately. While this idea seems to be overdone, just look at home may times other premises have been done even more. Personally, this aspect definitely didn't bother me too much, so I was just hoping for a few laughs.  Following Rob as he is reliving the morning of hid wedding over and over again, he utilizes the time to win over the approval of his soon-to-be father-in-law and learns to be a better man than he was before the marriage. On its surface, this plot sounds generic, and while it most certainly is, it has its moments. \n\nThe jokes throughout this movie are very hit-or-miss, but the jokes that do hit work very well. I found myself chuckling pretty hard at some of the scenarios, so that's enough props to give this film a mild recommendation. Aside from that aspect, a lot of the humour also falls flat, making for a few awkward sequences as well. Naked is a very inconsistent film with dumb plot points and an incredibly predictable conclusion, which sort of takes away from the comedy that does work, but I'm not going to be too picky about a film like this. This is a comedy that sets out to deliver a few solid jokes, having nothing deeper or larger to gawk at. For these reasons and more, it's fine for what it is. \n\nMovies of this nature can earn a pass for feeling repetitive, as long as the payoff is worth the wait, but Naked heavily suffers from this element. Right down to reusing some of the same footage over and over again in order to show that the day is repeating, I found certain tactics and editing choices to be quite lazily done throughout the majority of this movie. Still, the continuity is really what matters in the end, and I didn't find myself nitpicking that aspect very much. Each time I begin to speak about a poor element that this film had to offer, I can also come up with a positive, so I'm very torn overall. \n\nIn the end, I can recommend this film to anyone who is out for a few cheap gags, but I would just as quickly tell them to avoid it. Naked is the type of film that people will have no recollection of it ever being made, but it'll be a nice watch for a few laughs on a rainy day. It has a few great gags, some pretty terrible ones, a plot that feels forced for its inevitable conclusion, even though it works, and the film as a whole feels like it was made in order to employ these very talented actors/actresses. I'm a big fan of both Marlon Wayans and Regina Hall when they're at their best, and while they do deliver some fine performances here, they're just not given enough to work with. Overall, Naked is the type of movie that works just as much as it doesn't. It's hard to warrant a recommendation, but you won't hate yourself for watching it.",
            "review_date": "2017-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd say this movie showed a little bit of potential, I wished it would've tapped in more on the plot instead of the humor, because I felt the humor fell flat on it's face however there was a joke which was either irony or pure coincidence but he got knocked out then the elevator said \"L\" (yes I know that's lobby but it was ironic to me) anyways, the humor relied heavily on banter between the characters even though there WAS some scenes with good comedic timing such as the bell scene, also, the characters I thought were played pretty well considering how dry the plot and pace of the movie was, jesus if you cut out all the filler scenes this movie would be like 30 minutes long, I liked the Allstate guy and I was waiting for it to be an Allstate ad but it never was anyways pretty long n not that good movie but it showed potential 2/10",
            "review_date": "2017-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For what it is (a silly comedy romp) Naked is absolutely fine. It's clearly riffing on the Groundhog Day concept, but at a greater degree than I at first realised. It's a remake! Perhaps Tiddes should stick to adaptations in future.",
            "review_date": "2017-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad movie. Though its \"Groundhog Day\" concept could have worked well with the plot, the result is a mostly unfunny retread of familiar themes whose sole shining element is Wayans.",
            "review_date": "2017-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The storyline is so boring and anticlimactic it was actually hard to get through. Would not recommend.",
            "review_date": "2017-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it's not the most original thing the concept is endearing enough to carry the movie through the bad comedy. \nGrade: D+",
            "review_date": "2017-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical Wayans movie, it was stupid",
            "review_date": "2017-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has been getting a lot of hate. Too much hate if you ask me. I didn't think the movie was that bad. I just thought of it as a forgettable, guilty pleasure comedy. The best part of the movie by far was Marlon Waynes. I thought he had some funny moments and was a great presence on screen. Although this movie has some rough parts, I actually laughed in a few scenes. It was actually pretty funny believe it or not. Unfortunately this movie makes no sense whatsoever. You have no idea why the stuff that happens to the main character is happening because it's so ridiculous. The movie is also predicable as hell. Forty five minutes in I had a basic idea of how it was going to end, and for the most part I was right. There were also some weird and awkward scenes that weren't to bad but just something that kind of bugged me. Overall, it was a fine and forgettable movie, it wasn't anything special but it's an okay throwaway movie.",
            "review_date": "2017-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible! Writing is the worst and it's not even that funny.",
            "review_date": "2017-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's should've been better than this",
            "review_date": "2017-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie looks a cold version of the ground hog day, but it is a genial a bit silly version of edge of tomorrow. Wayans has used the last of his charisma (and body) to bring out an enthusiastic performance marred by thinly written plot and characters. Decent time pass movie that has couple of genuinely funny moments.",
            "review_date": "2017-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even as a Marlon Stan, I couldn't fuck with it lolol",
            "review_date": "2017-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's difficult to find a real comedy in Naked, It's works better when the movie is a full romantic comedy, the groundhog day style input here work in the beginning, but become really hard to follow throught after so many loops. I think if you don't have nothing to watch in a saturday afternoon, maybe this comedy could work, but expect nothing extraordinary. (2,5/5)",
            "review_date": "2017-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny moments, but definitely not perfect. Marlon makes the best of it, but that\u0092s not saying much.",
            "review_date": "2017-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Been almost four days since my last review.  Not that anybody cares, but I'll explain it anyway.  I was without electricity from 7 pm Saturday (prior to when I usually watch movies) until 9 pm Sunday.  I didn't watch a movie the day it came back because I, literally, had not slept a wink and I was literally about to die.  Well, not really, but still.  And on Monday, I started watching The Out of Towners (the remake with Goldie Hawn and Steve Martin) and I haven't finished watching it.yet.  So here we are, the first movie I review in days and this is what we're left with.  I'll be honest, watching the trailers to this film, I thought it looked absolutely awful.  I've never been the biggest Marlon Wayans fan.  I just think a lot of his films rely on lazily, and poorly, constructed skits barely held together by some form of gimmick.  White Chicks had the Wayans dress up as, you guessed it, white chicks.  Little Man had Marlon in the body of a baby and acting like one.  This one has him repeating the same hour over and over again after he wakes up naked in this elevator on the day of his wedding.  This is a concept that we've seen plenty of during the years since Groundhog's Day's release.  Edge of Tomorrow, Source Code, Run Lola Run and the film that this is a remake of, Naken (a Swedish comedy).  I didn't know that this was a remake of a film at the time I watched this yesterday.  But, doing my research, apparently the original movie was also negatively received when it came out.  And I guess that the whole idea of a man being stuck on a time loop after he wakes up naked in an elevator is a, visually, interesting concept.  What I mean by that is that there's this belief that naked men are funny.  And what better to distract from the fact that your script is lame being relying on male nudity, right?  Having said all of that, with my thoughts on the trailers out of the way, this wasn't nearly as bad a movie as I would have reasonably expected.  It's never what I would call a good movie and it's not even really that funny, but I didn't hate this in the slightest.  The concept is certainly very low-brow and it's not like its attempts at humor are that much better, but I didn't mind watching this for however long it did last.  Honestly, watching some of the scenes here, I think that Marlon Wayans is a better comedic actor than he generally likes to show in his films since, again, his style is a little more over-the-top and relies a lot of gimmicks, shtick and slapstick.  This movie definitely has a great percentage of that, but there's also scenes where Marlon actually shows something.  I'm not saying it's much or that it even lasts that long to begin with, but I feel that he would be so much better if he toned things down and relied on his comedic timing.  I'm not saying he would be great or anything of the sort, but he would be perceived a lot better than he currently is.  The movie, obviously, doesn't have a massive budget and you can just feel that from the look and execution of some of the scenes.  It just feels amateurish in parts.  I think one of the things this film does well is keep Rob's goals focused on getting to his wedding and marrying the woman of his dreams.  While there's distractions and 'small' subplots, for the most part, the movie focuses on that.  And, because of that, there's a strong sense that, even if they spend very little time together in film, that Rob really does love Megan.  I would not have guessed that they would've gotten that one right, but they managed to pull it off.  The pacing of the flick is fine, but it's not anything to write home about.  I feel parts of it felt longer than the probably should have, but it's not a super long movie anyway.  I will admit that I did chuckle at some scenes but, again, this isn't really that funny of a movie.  You could say that it failed at what it set out to do, and I wouldn't disagree with that, but I can say that I was never bored by this in the slightest.  Two stars is still very much a negative rating and I'm not recommending this at all, particularly when Groundhog Day still exists, but I wasn't bothered by this at all.  That's not a seal of approval, for sure, but it could have been so much worse.  Don't really have much else to say about this, it's got a low-brow concept and its execution is more miss that hit, but it's also a better movie than I expected.  It's not better by much, but it's still better.  I wouldn't tell you to watch this, but if you did decide to do it, it's a movie that will take up 90 minutes of your time, but it's not something you'll remember by the same time the day after that.  It's ok, but completely inconsequential and forgettable.  That's the best way to sum this up.",
            "review_date": "2017-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The main difference between Naked and Groundhog Day is that Naked tries to be funny, Groundhog day just...is. Marlon Wayans is talented and Naked is a definite step up from 50 Shades of Black and a Haunted House, but a stumble down from the superior efforts of White Chicks and Scary Movie from the Wayans' heyday. Solo Marlon just doesn't seem to work, unless he's working with Darren Aronofsky. The film is essentially Groundhog Day for idiots, but it's definitely not the worst comedy I've ever seen. The funniest moments in the film were truly before the whole time loop thing happened and Wayans was able to deliver deadpan and straight jokes instead of running around naked or riding around on a motorcycle. My advice for him would be to calm down.",
            "review_date": "2017-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's your usual Rom-com but if you know the movies Marlon does he makes the movie entertaining and even with the groundhog day feel the movies goes over well.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not gonna have you bending over out of breath laughing but, it was good nonetheless. Keeps you entertained just enough. It's a love story/comedy. Perfect for one of those nights with your girl grabbing a pizza and watching so goofy a** movie while you sip a beer/wine and have a goofy giggle. Solid 3 stars. Cliched? (Yes) Stupid Funny? (yes) something to pass the time on a nice rainy or cold night with your boo thang.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a ok movie. It wasnt really that funny and I was expecting it to be hilarious but it really wasnt. It was ok.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a huge fan of Marlon Wayans. His physical comedy is on par with some of the great classic comedians like Eddie Murphy, Steve Martin, Jerry Lewis, Martin Short, Richard Pryor, Jim Carrey, and even Dave Chapelle. No, hes not a stand up comedian, but his work in film is near as great as these actors. I'm not sure why some reviewers don't view his work under various lenses of the comedic film genre over time, but I think if they did, they might have a different view of his work. Since his days on his show, to films like Senseless with David Spade, to his Scary Movie days, on to A Haunted House and its sequel, he has proven adequate to excellent storytelling, well defined characters, and laugh out loud comedy. In addition, with Naked he revives a seemingly dormant genre: the romantic comedy. If you are a fan of Marlon Wayans you will definitely enjoy this movie. If you enjoy comedies, rom coms, and know how to suspend disbelief for the sake of comedy, then you will enjoy this.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was a good movie. The time loop concept is always interesting if done correctly. Sometimes I think marlon is a little too silly in his movies but in this one he touched on some more serious themes. Worth a watch :)",
            "review_date": "2017-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Naked is a good movie for people if like a good comedy and romance movie",
            "review_date": "2017-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it's not a movie that you're dying to laugh about, it's not boring at all, and it holds your attention to the end, and it's still a beautiful lesson in marriage and union between two lovers.",
            "review_date": "2017-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amusing yet there was no laugh out loud moments for us , my wife felt asleep while watching it .. hang over meets groundhog day with a too predictable story with more mistake s that you can count. Not something I would watch again, one of those see the trailer and you saw the whole movie kind of project.",
            "review_date": "2017-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had a good laugh watching this movie. No boring parts.",
            "review_date": "2017-08-11",
            "source": "rt",
            "lang": "en"
        }
    ]
}