{
    "rating": 8.9,
    "release_date": "Invalid",
    "num_reviews": 70,
    "genres": [
        "Japanese"
    ],
    "summary": "In this anime film, Jubei, a highly skilled ninja, is coerced into slaying his own clan of warriors. After begrudgingly killing his fellow swordsmen, he becomes a roving hired assassin. During his travels, he must face off against an organization of demonic ninjas known as the Devils of Kimon, who are plotting to take power of Japan's government. The Devils will stop at nothing, and have the power to annihilate entire villages. Now, only Jubei and a shogun spy named Dakuan can stop them.",
    "reviews": [
        {
            "content": "One of the best Japanese animation films ever made. The imagination and creativity is second to none. I'd rank it up there with Akira and any other classic anime any day.",
            "review_date": "2023-02-21",
            "source": "rt"
        },
        {
            "content": "The style of this anime movie is off the charts. Even though the animations and style are very much dated from the early to mid 90's, it still looks beautiful. That scene with the rock guy and Kagero was pretty weird, he was basically having his way with her. I like Jubei, he's got this chill lone wolf kind of vibe. The world this movie takes place in is brutal, violent and unforgiving; it's pretty dark. It's also oddly sexual. There's men having their way with women, soldiers getting cut in half by big rock dudes. It's crazy! I like the little old man who keeps popping up and helping Jubei, he's definitely the comedic relief. That snake girl Jubei encounters at the hot springs looked deadly. It seems like in this world monsters and shadow demons exist.\n\nThat's messed up how the old man manipulated Jubei into working for him by poisoning him with a ninja star. Woah, that shadow ninja, Shijima, looked sick. Man, the concept designs for some of these characters is so creative and unique. The snake girl, the shadow ninja, the wasp guy with a hive on his back. That blind swordsman was pretty cool, too bad he died so quickly. That was cool how they used in this movie the same sound they use in the third Exorcist movie when the iconic jump scare happens. I love the character development and relationship between Jubei and Kagero, they're both interesting characters. Kagero is holding something deep within her that seems to be burdening her and Jubei is this patient and controlled dude.\n\nI like how Kagero used a falcon to deliver the message to the chamberlain. That was ironically symbolic how Gemma was turned into a gold statue by all the melted gold and then sank to the bottom of the ocean into the dark abyss. That's poetic justice right there since he wanted to take all the gold for himself and form a clan in order to become the most powerful dark shogun. Although I kind of wish Jubei had done it with Kagero, I commend him for having such control and strong-will to not do it. That's a true Sigma mindset right there. As for Kagero, I wish they hadn't made her so helpless and weak, especially when they were trying to make her seem like a strong independent badass. But I guess her weakness is what made her human in the end.\n\nNinja Scroll was an awesome anime movie. The animations, the art style, the concepts and ideas are all there. I didn't care too much about the story, but maybe I just have to watch it again to appreciate it more, it just felt pretty underwhelming and generic. There's some imagery in this movie that's very striking and unforgettable, it stays with you. I do have to say though, I felt like they could've made better use with some of the sound effects, or better yet, they could've been more creative and inventive with them. Also, this world is very oppressive towards women, which I guess makes sense for the particular time period of Japan, but still. There's sort of like a disregard for women, like they're disposable and usable objects that should be sexualized. Other than that, I thought it was great! If you're an anime fan, definitely check this one out. I'm definitely watching this one again.",
            "review_date": "2022-10-11",
            "source": "rt"
        },
        {
            "content": "If you need blood, sex, & violence then look no further. There's a Tarantino-esque vibe going on here and I love it.",
            "review_date": "2022-06-19",
            "source": "rt"
        },
        {
            "content": "The quintessential 90's grim and edge with the most extreme but \"tasteful\" sex and violence. Forget the notion of pacing in the story; we've got to figure out how to smash these eight \"ninjas\" against our protagonist. The rule of cool is prevalent in every scene in regards to everything from gold casually melting and solidifying on a whim to almost every character's abilities. And those abilities are so well animated, with such vibrant high-contrast color schemes, fast rapid animation, pointy outlines, and long chins. It is wonderful. It is especially glorious how sexually everything is presented. The libido of this movie is high in the clouds. The story, honest to God, tries to construct a romance between Kagero and Jubei, but it is so fleeting that it almost seems like an excuse to separate them in the third act.",
            "review_date": "2022-05-27",
            "source": "rt"
        },
        {
            "content": "An absolute classic.  This older styled anime just has something special about it",
            "review_date": "2022-01-30",
            "source": "rt"
        },
        {
            "content": "Even though the plot and characters are shallow the action and animation are so mesmerising that it's one of the best gateway animes",
            "review_date": "2021-09-28",
            "source": "rt"
        },
        {
            "content": "I saw this movie a couple of times as a teen, and I was never impressed much by it, but jump forward 25 years and I am ready to pronounce this to be a classic.  Maybe it is all of the lazy modern animation I am subjected to nowadays, but \"Ninja Scroll\" just looks beautiful.  The choice of camera angles is inspiring and the animations are genius.  I can totally understand if the story isn't for you (beware of the multiple rape scenes), but if gore doesn't bother you, I think the tale is very well put together where every character plays an important role in the outcome.  I give it a B, next time you're in the mood for a movie, this one won't disappoint.",
            "review_date": "2021-08-22",
            "source": "rt"
        },
        {
            "content": "The single best anime I've ever seen. Jubei is smart, funny, and deadly.",
            "review_date": "2021-07-29",
            "source": "rt"
        },
        {
            "content": "The art style feels very distinct and memorable amongst all the other anime's of seen.",
            "review_date": "2021-06-30",
            "source": "rt"
        },
        {
            "content": "It's a masterpiece anime of all time. Best Ninja - Shinobi anime ever made by Japanese movies.",
            "review_date": "2021-04-04",
            "source": "rt"
        },
        {
            "content": "One of the best anime/manga films ever made.",
            "review_date": "2020-09-26",
            "source": "rt"
        },
        {
            "content": "One of the greatest anime of all time. It is in the pantheon of the very best alongside. Akira and Ghost in the Shell.",
            "review_date": "2020-07-21",
            "source": "rt"
        },
        {
            "content": "What makes this masterpiece so amazing? Well let's start with what it doesn't have. No cheesey voice acting, no cheesy childish anime, no censorship. What it offers is heart felt dialouge, great animation, great story telling, and characters that everyone can relate to, and perfect action! It is my absolute favorite anime to date. A must see for everyone that is a fan of the genre.",
            "review_date": "2020-06-07",
            "source": "rt"
        },
        {
            "content": "As far as anime's go - I consider this one of the best action anime's ever made.",
            "review_date": "2020-03-13",
            "source": "rt"
        },
        {
            "content": "Ninja Scroll is one of the top anime of all time. It's as good now as when I first saw it over 2 decades.",
            "review_date": "2020-02-01",
            "source": "rt"
        },
        {
            "content": "It delivers so much in first few minutes, that it just sets a standard that is too high for it's own good, no matter how good the rest of the movie and it's action scenes are, it never tops it's first few minutes, I wouldn't say it overcooks it but it exhausts the action in first minutes as such that you feel nothing for the rest of the movie and at the end, no matter how good they are",
            "review_date": "2019-12-27",
            "source": "rt"
        },
        {
            "content": "An iconic anime that I am glad that I finally got to watching. Ninja Scroll is one of those films that does have a plot. And while it goes by fast and most likely is better understood with multiple viewings I'll try and keep it simple. Set in the past the film is about the Yamashiro clan that are secretly mining gold and sending it to the Shogun of the Dark (who is sending them protection). The Shogun is collecting the gold so that he can overthrow the current government and rule over Japan. One day a boat carrying the gold runs aground into the Mochizuki territory (a neighboring clan). In order for them to keep this secret the Shogun sends the Eight Devils of Kimon (his sort of personal mercenary group) to kill the villagers in the Mochizuki village. So, the Mochizuki clan sends in their own group of ninjas to investigate why the villagers all died (rumors spread it's a plague). But unfortunately this group of ninja's are killed by the Devils. Only one person survives a young ninja named Kagero (Emi Shinohara) who is taken captive. Fortunately, for her a traveling mercenary named Jubei Kibagami (Koichi Yamadera) and saves her. Jubei is soon after blackmailed by a government agent named Dakuan (Takeshi Aono) to work with him to defeat the remaining Devils. And that's basically the story in the most simplistic way I can say. Jubei has history with the leader of the Devils and for the most part it works. The anime is very violent and has some pretty intense adult moments. It's definitely not a movie for the younger viewers, but I enjoyed this one a lot. It has some very cool action sequences and while it's aged a bit I found myself really enjoying the animation. The film works and as one of the films that popularized anime in North America this is a must watch for fans of anime!",
            "review_date": "2019-07-06",
            "source": "rt"
        },
        {
            "content": "Brutal, controversial, and blood-drenching beautiful, is a high-echelon piece that must be watched, if your suspension of disbelief can transcend the political correctness that plagues the industry nowadays.",
            "review_date": "2019-05-16",
            "source": "rt"
        },
        {
            "content": "With enough gory sword fights and grotesque monsters here to last an entire season of television, but nary enough coherent narrative or compelling characterization for a whole movie, this is practically the Platonic ideal of a teenage boy's anime fever-dream, filled to the brim with bloodshed, brutality, and boobs.",
            "review_date": "2019-04-07",
            "source": "rt"
        },
        {
            "content": "One of those classic anime films of all time.",
            "review_date": "2019-03-16",
            "source": "rt"
        },
        {
            "content": "Fantastic everything and watchable for all time. \n\nb-panther the quickening the movie is dirt that wont be noticed\nmeanwhile, Dont even stream it for free, You wont get rid of the memories.",
            "review_date": "2018-07-01",
            "source": "rt"
        },
        {
            "content": "Outstanding, simply outstanding. Gorgeously animated with an entertaining, no-messing-about story that has fantastically kinetic action sequences, an array of memorable and unique characters, and even a hint of a touching side to it, 'Ninja Scroll' has everything you could possibly want from a film of the genre. What the rather simple 'good-guys vs bad-guys' plot lacks in intelligence, it more than makes up for with the relentless pace and wonderfully crafted atmosphere that leaves you little time to dwell on it. Dark, gory and riveting, 'Ninja Scroll' is easily up there with the best that old-school anime has to offer, although it may be a bit over-the-top and crude for some.",
            "review_date": "2018-06-24",
            "source": "rt"
        },
        {
            "content": "Jubei Ninpucho is cleverly structured and although it is not an inherently complex narrative, it features a very thoughtful approach for presenting vital background information. Together with the mostly great animation, this makes for a thrilling viewing for anime fans and fans of (Japanese) action movies. There are some minor drawbacks, like characters that could be more fleshed out and the uneven animation quality - however, the movie succeeds in telling the story it wants to tell and uses very creative visual effects for telling a mature story.\nOverall 7/10\nMy Review: https://movie-discourse.blogspot.de/2018/05/jubei-ninpucho-jap-1993.html?view=flipcard\n\nTwitter: Max4Movies",
            "review_date": "2018-05-13",
            "source": "rt"
        },
        {
            "content": "Beautiful animation, but nothing else.",
            "review_date": "2017-07-04",
            "source": "rt"
        },
        {
            "content": "I dig this movie. I am looking to watch it again with my boys that's how hot this movie is.",
            "review_date": "2017-03-12",
            "source": "rt"
        },
        {
            "content": "The best anime feature movie ever...voice acting in the english soundtrack is amazing... i actually love it",
            "review_date": "2017-03-05",
            "source": "rt"
        },
        {
            "content": "An almost perfect blend of sex&violece.Still manages to be a thinking mans action film and shows that true strength is found by living by one's moral code.",
            "review_date": "2016-08-29",
            "source": "rt"
        },
        {
            "content": "One of the best cinematic animes of the 90's!",
            "review_date": "2016-08-08",
            "source": "rt"
        },
        {
            "content": "This was much better when I was 12. Watching it now and it looks atrocious.",
            "review_date": "2015-11-25",
            "source": "rt"
        },
        {
            "content": "Not recommended for people who get upset when anime isn't nice to them.",
            "review_date": "2015-04-12",
            "source": "rt"
        },
        {
            "content": "Classic action packed anime set in feudal Japan.",
            "review_date": "2014-12-19",
            "source": "rt"
        },
        {
            "content": "Its unbridled surreal/supernatural elements play off in a setting that takes itself all too seriously. This makes for an intriguing, well animated piece that is worth looking at.",
            "review_date": "2014-12-13",
            "source": "rt"
        },
        {
            "content": "Full of graphic violence, gratuitous sex and nudity, and badass animation, Ninja Scroll is Anime escapism at its finest.",
            "review_date": "2014-11-19",
            "source": "rt"
        },
        {
            "content": "Awesome Japanese manga!! Very bloody",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "Solidly paced, gory and action packed; although not perfect the movie's elements remind me of what exploitation films deliver with repulsive imagery in entertaining ways.",
            "review_date": "2014-10-22",
            "source": "rt"
        },
        {
            "content": "A masterpiece between Japan animation movies!!",
            "review_date": "2014-07-29",
            "source": "rt"
        },
        {
            "content": "A beautifully drawn Japanese  animated (amime) film that well written and action packed set in fantasy feudal Japan. A masterpiece among Japanese anime films.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "hands down,  the best anime movie of all times. 1 of my top 5 faves.",
            "review_date": "2014-05-09",
            "source": "rt"
        },
        {
            "content": "Great artwork!  Great action!",
            "review_date": "2014-04-02",
            "source": "rt"
        },
        {
            "content": "Exceptional anime with great action & story. Is an anime all other samurai anime are compared to. Worth owning.",
            "review_date": "2014-03-10",
            "source": "rt"
        },
        {
            "content": "Violent, yes! Entertaining, yes! Completely awesome, YES!",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "A superb highlight of anime cinema, though not quite matching up to the milestone works of Otomo or Miyazaki.",
            "review_date": "2013-12-28",
            "source": "rt"
        },
        {
            "content": "Depraved, violent, awesome.  Rewatching it made me realize how unique and well-developed the characters were, esp. the villains.  Quite touching in a cheesy way too.",
            "review_date": "2013-12-13",
            "source": "rt"
        },
        {
            "content": "4.5/5  One of my first and definitely one of the best anime movies ever made...still.  Action, mystery, romance, fantasy, tragedy, all rolled into one.",
            "review_date": "2013-11-15",
            "source": "rt"
        },
        {
            "content": "Ninja Scroll is a great way to be interested in Anime.",
            "review_date": "2013-11-11",
            "source": "rt"
        },
        {
            "content": "\"The only sound you'll hear, is the sound of your own voice screaming.\" Saw this one on a whim, just cuz a few people have recommended it, and since I have a positive bias towards the samurai stuff. Was very pleased to see that it was entertaining as hell and actually full of heart and soul. It is extremely gruesome, so, umm, don't eat a big meal beforehand. Hard to believe this is already 20 years old. Felt like a precursor to all those 'demons and dark magic' anime, but maybe I just haven't seen enough of those to tell. Yeah, twas great fun.",
            "review_date": "2013-10-26",
            "source": "rt"
        },
        {
            "content": "this anime has so much sentimental value to me as is was the first anime I had ever seen. I bought it on VHS back in 1994 and was blown away. I get Shonen Jump alpha every week. I love Japanese manga and anime. get the Viz media app from the play store, if you're a manga fan you won't be disappointed.",
            "review_date": "2013-09-28",
            "source": "rt"
        },
        {
            "content": "Animated sword-slashing violence never looked so good",
            "review_date": "2013-08-18",
            "source": "rt"
        },
        {
            "content": "Better than a lot  Ghibli",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "Ninja Scroll is a very old anime, and you can tell by the visuals that this is the case. However, I found this anime to have stood the test of time quite well. I prefer newer animation styles by a land slide but I didn't mind watching this, the only problem was the chins. Seriously, the chins take up half the characters faces, maybe it's just me but this really irritated me, it's worst on the lead female of the film. She has some sex appeal and there are 1 or 2 situations where that is definitely exploited but that chin really put me off... chins aside some of the background art is beautiful and the gore is really over the top and it's great. It has a solid storyline however the ending feels like it happened too early. Picture yourself playing a game and the map shows that you're half way to the end and then the boss suddenly appears and shortly after the credits roll. That's what the ending feels like. None the less the story line was good, the enemies were good and the voice acting was alright. The characters weren't exactly memorable however they weren't weak. I would recommend this film to anyone who is bored and looking for a gory action anime.",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "Ninja Scroll can be watched again and again. I loved it so much. I saw it when I was a kid, about 20 years ago. It was awesome then, and it's awesome now. There's never a dull moment.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "This is Mad House best film to date and one of the best animated films there is. The samurai action is mind-blowing and the story is not bad either. There's no animation yet that can topple this classic.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "An unrelenting and brutal classic cinematic masterpiece of anime whose echoes resound throughout the history of the medium. Violent, dramatic, and powerful, this one is not easily forgotten. Any western viewer should find this one easily accessible even if they are not fond of anime but love sword & sorcery or action.",
            "review_date": "2013-07-26",
            "source": "rt"
        },
        {
            "content": "Clásico donde los haya, no hay un minuto de desperdicio en el metraje.",
            "review_date": "2013-07-02",
            "source": "rt"
        },
        {
            "content": "Along with Ghost in Shell, Akira, Princess Mononoke, and Spirited Away, this is easily one of the top 5 Anime movies ever made. Very influential, dark, and noir. A must see film, and certainly a required watch if you like anime. Show this movie to someone who thinks all anime are cutsie movies, and watch their jaw drop to the floor and say \"wow.\"",
            "review_date": "2013-06-25",
            "source": "rt"
        },
        {
            "content": "Don't let the generic title and its age stray you away from this gem, as this is one of the best Anime movies out there. Blood gushing, limb slicing, and adultery scenes packed with a melodramatic story. With all of this asserted, this movie is not recommended for the young audience. The animation still fairs out well today, and the fight scenes are strongly choreographed, especially the epic final fight \"Gemma, die in your golden hell!!!\".",
            "review_date": "2013-06-23",
            "source": "rt"
        },
        {
            "content": "Manga at its finest!",
            "review_date": "2013-06-04",
            "source": "rt"
        },
        {
            "content": "one of my favorite animated movies",
            "review_date": "2013-05-25",
            "source": "rt"
        },
        {
            "content": "Second amine I watched and another true classic this is a much watch.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "Awesome, havent seen it in a while but i remeber it being very good.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "Without a doubt one of the finest anime films of all time.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "this is the movie that first turned me on to watching anime.",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "Its not surprising to find that this film gets 100% on the rotten tomatoes. Travel to a world of mysticism and swordplay. but be warned this movie is extremely violent. it truly depicts a time with no law. ( even though its fantasy) kingdoms ruled by fiendish warlords, demons and the atrocities they reap. non stop action, great sound with wondrous animation. Ninja Scroll has got it all.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "Wow.  That's all I can say about this one.  And awesome.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "period ninja anime at its best. one of the greatest action movies of all-time both animated or live action. A must see.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "http://chambilkethakur.tumblr.com/post/45579603156/ninja-scroll-anime-movie",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "After awhile, the anime porn becomes annoying.",
            "review_date": "2013-03-15",
            "source": "rt"
        },
        {
            "content": "Possibly the greatest manga film ever made. \nIt has all the elements you would want in a Japanese animation. Demon like creatures, political intrigue and a shed load of violence. \nIf you liked Akira then you are going to love ninja scroll!!",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "A masterpiece that has stood the test of time.",
            "review_date": "2013-02-20",
            "source": "rt"
        },
        {
            "content": "oo yea thats the stuff",
            "review_date": "2013-01-24",
            "source": "rt"
        }
    ]
}