{
    "rating": 8.2,
    "release_date": "Invalid",
    "num_reviews": 50,
    "genres": [
        "Italian"
    ],
    "summary": "During a dinner party, seven friends decide to play a dangerous game. The attendees place their cellphones on the table and agree to make all texts and calls public in an attempt to prove that they have nothing to hide.",
    "reviews": [
        {
            "content": "Those who the movie presents as everyday italian citizens are at best unrealistic characters with unbelievable customs, or badly played figures with ridiculous jobs, or worse just pure assholes. The plot on the other hand is just a premise that wouldn't go anywhere with normal characters and the conclusion is... unpredictable, to be generous.",
            "review_date": "2021-09-19",
            "source": "rt"
        },
        {
            "content": "Delightful, fast fresh and smart",
            "review_date": "2021-08-23",
            "source": "rt"
        },
        {
            "content": "This comedy drama starts with the intriguing premise of seven upper middle class friends at a dinner who decide to put every phone call on speakers, and read out loud all the messages and emails they get during the evening... \"How many couples would break up if they examined their partners' phones?\" asks one of the heroines of this unusual evening, the same one who, after an unexpected discovery, would spit in her friend's face. The true face of some of the friends gets exposed during the twist in the last 10 minutes, which added to a good impression.",
            "review_date": "2021-04-24",
            "source": "rt"
        },
        {
            "content": "Masterfully acted, this powerful Italian drama shows how a movie set in one room in a two hours span can still be captivating, absorbing and full of clever plot twists.",
            "review_date": "2021-04-16",
            "source": "rt"
        },
        {
            "content": "L'élite del cinema italiano si raduna per un film intenso, pieno di colpi di scena e con un finale spiazzante, giostrato perfettamente.\nTutto gira intorno ad una sceneggiatura densa di dialoghi serrati e taglienti, e ai rapporti che si incrociano tra i vari personaggi.\nL'idea non è del tutto originale ma lo sviluppo è notevole; tanto che verranno poi eseguiti diversi remake in tutto il mondo.",
            "review_date": "2021-03-10",
            "source": "rt"
        },
        {
            "content": "interesting, fresh, intriguing and intoxicating. an excellent proof of cinema",
            "review_date": "2021-01-19",
            "source": "rt"
        },
        {
            "content": "A good movie to consider watching if you like clever dialogues. Most of the film is based in one apartament without any scene changes whatsoever, and although it starts a little funny and silly, the more the movie progresses, the more serious it becomes, which is why I liked it. It shows that not a single person existing is able to speak of himself as of who he actually is, how we love to \"guard\" ourselves behind these perfect life scenarios, which we imagine in our heads. It shows that in some cases, there are things that could expose the truth and truth will always be exposed. But most important question is \"Will somebody forgive your truth, even if it's very disturbing? Can love manage to get a person through that?\". As I have already stated, the movie is based on dialogues. Obviously they are not like any of Tarantino's, but they are worth a mention, as they keep the viewer entertained and interested in what could possibly happen next in this, at first look, obvious happily ending movie. What the director basically does is he just takes all your expectations and throws them into the garbage can, as he nails the transition from a regular comedy to a serious drama perfectly. All the actors are playing amazingly, the setting is believable, and, most importantly, it's modern and realistic. Such scenario could happen to anyone and could lead anyone into deep thoughts about what they are doing wrong about their lives, especially those people who are having affairs and are lying about their love. Every single lie and every single choice counts, as it could destroy someone's entire life. A great movie to consider watching, strong 8/10 because of how interesting it was to watch and how well acted it is, although it is not a must watch masterpiece.",
            "review_date": "2020-11-02",
            "source": "rt"
        },
        {
            "content": "amazing movie, and instant cult, they have already done at least 6 remakes",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "A wonderfull surprise.",
            "review_date": "2020-05-11",
            "source": "rt"
        },
        {
            "content": "دراما إيطالية عن مجموعة من أصدقاء العُمر وزوجاتهم تجتمع لعشاء وتتفق على ممارسة لعبة من خلال استكشاف أسرار الهاتف الشخصي لتتكشّف فيها أسرار شخصية وخبرات مدفونة، سرد ف منتهى الذكاء حول تحليل العلاقات والأسرار وتعقيدات النفس البشرية يقرب بين الأصدقاء ويصدم البعض، والأهم أن العمل يعرّف على حقيقة البشر.",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "Humoristisch wat-als van-de-regen-in-de-drup verhaal",
            "review_date": "2020-03-31",
            "source": "rt"
        },
        {
            "content": "Un film fantastico, boom. Possiede una narrazione e una regia da invidiare. Tutto è pensato, fatto non solo per divertire.",
            "review_date": "2020-03-15",
            "source": "rt"
        },
        {
            "content": "It was quite interesting, I really enjoyed it and even though the issues were a bit extreme it was on point how people all have secrets to destroy many of their relationships.",
            "review_date": "2019-11-20",
            "source": "rt"
        },
        {
            "content": "L'idea è buona, il film anche. Niente di trascendentale, quindi tutti questi re-make in lingue differenti proprio non si spiegano.",
            "review_date": "2019-07-03",
            "source": "rt"
        },
        {
            "content": "\"nice\" ending",
            "review_date": "2019-01-13",
            "source": "rt"
        },
        {
            "content": "Finalmente un film italiano che dimostra una maturità fuori dal comune. Non si tratta della solita commedia, anzi, vengono proposti temi molto interessanti che sfociano in un pessimismo che fa da base alla pellicola. C'è un equilibrio perfetto tra tutti i personaggi, ben caratterizzati ed interpretati, inseriti in un contesto molto realistico e convincente. Questo garantisce una forma diversa di intrattenimento, che come altri film si incentra più sulla caratterizzazione dei personaggi che sul coinvolgimento visivo. Il finale inaspettato chiude alla perfezione un gran film, garantendo un messaggio profondo e moderno che merita di essere accolto da ogni tipo di spettatore.",
            "review_date": "2018-12-17",
            "source": "rt"
        },
        {
            "content": "Film commedia italiano diverso dal solito, finalmente direi! L'ora e mezza è passata velocemente e il tutto è gestito da Genovese in maniera impeccabile; il ritmo è costante e la visione non risulta essere mai pesante, mi è sembrato di essere in quell'appartamento con loro e di vivere il tutto in prima persona. Ottimo il cast, in particolare Leo, Battiston e la Foglietta. Non a caso i personaggi migliori a mio parere. Con questo film Genovese critica il fatto che ormai la nostra vita è sui telefoni, su uno schermo nero, e ovviamente anche il fatto che tutti dovremmo farci di più gli affari nostri, perchè molte volte è meglio così. Divertente e spiritoso, Genovese ha fatto un lavoro magnifico.",
            "review_date": "2018-08-31",
            "source": "rt"
        },
        {
            "content": "I didn't expect to be so good. It was a surprise. Great screenplay and cast. That should be the future of Italian cinema, not cinepanettoni or stupid comedies.",
            "review_date": "2018-08-08",
            "source": "rt"
        },
        {
            "content": "Uma espécie de roleta russa tecnológia entre um grupo de amigos. Em vez de armas . telemóveis. Danke, D.",
            "review_date": "2018-08-03",
            "source": "rt"
        },
        {
            "content": "I loved every moment of this movie. The plot is great, the ending is unexpected. It seems like there is a number of versions made. The italian screenplay was the best for me. This is a must see movie.",
            "review_date": "2018-07-02",
            "source": "rt"
        },
        {
            "content": "Una tremenda película que sorprende a cada minuto. Increíble. Una historia imperdible. De lo mejor del cine europea. Una originalidad única",
            "review_date": "2017-12-23",
            "source": "rt"
        },
        {
            "content": "Mobile phones seem to play the role as a Pandora box in this movie from which all the dirty and dark hidden secrets fly out, disturbing the peace on the surface. However, the cracks of the relationship between the three couples, and among the bunch of friends, are already there. Mobile phones are more likely to act as the analyst that accelerate the rate of breaking the relationship, which project the situation of most of the relationship at the edge in reality. After this intense movie, I discussed with my boyfriend regarding two questions (1) before they started the game, which couple he thought had the most serious issue of their relationship; and (2) after the game, which couple? We came to a consensus that regarding question one, the couple of Lele and Carlotta, while in terms of question two, the Rocco and Eva. Can you guess why?",
            "review_date": "2017-08-27",
            "source": "rt"
        },
        {
            "content": "Great script!\n\nThis very unconventional film is hilarous. You will not notice how fast the time flies. Everything is well planned and you will not guest the finale.",
            "review_date": "2017-07-23",
            "source": "rt"
        },
        {
            "content": "Hasta cierto punto original.",
            "review_date": "2017-07-23",
            "source": "rt"
        },
        {
            "content": "Una película que puede parecer un poco lenta en su principio, pero después de los primeros 20 minutos toma un ritmo que hasta que te hace pedir que se detenga esa montaña rusa de emociones y de eventos inesperados que terminan el mejor desenlace posible.",
            "review_date": "2017-07-18",
            "source": "rt"
        },
        {
            "content": "if it explained less, and puzzled more,",
            "review_date": "2017-06-10",
            "source": "rt"
        },
        {
            "content": "Very good film with an original plot. Solid acting which was needed given the entire film takes place in an apartment, essentially around a dinner table. It twists and turns and shows how people can have a hidden life. It is also interesting to see the responses to the exposure of such lives and can lead you to question just how you or your friends would react in such circumstances.",
            "review_date": "2017-06-04",
            "source": "rt"
        },
        {
            "content": "Funny and serious, gripping, theater play-like.",
            "review_date": "2017-06-03",
            "source": "rt"
        },
        {
            "content": "Ridiculously truthful and kindly disturbing portrait of human nature. And that appartment... I want to live in.",
            "review_date": "2017-04-23",
            "source": "rt"
        },
        {
            "content": "Review (1~5)\n\n#TrailerFraudIndex (lower, better): n/a\n\n#Content: Script 5 | Acting 5 | Cinematography 5 | Film Editing 5\n\n#Visual: Costume Design 4 | Makeup & Hairstyling 4 | Scenic Design 4 | Lighting 4 | Visual Effects n/a\n\n#Sound: Score & Soundtracks 4 | Sound Editing & Mixing 4\n\n#Overall (1~10): 8",
            "review_date": "2017-03-13",
            "source": "rt"
        },
        {
            "content": "muy buena,muy interesante 9/10",
            "review_date": "2017-03-09",
            "source": "rt"
        },
        {
            "content": "This looks at first like a Bergman-style analysis of relationships, the characters forced claustrophobically together until the truth is out. But it belongs in a stream of Italian films that seem to apologise for questioning traditional concepts of marriage, gender, sexuality and family. Despite an efficient script and quality acting, it is forced, and has its eye to an invisible censor. It is saying 'Oh, I am so shocked', but no modern, first world viewer can be greatly surprised at what happens. The male characters consist of three heroes, their faults forgivable, plus an attractive anti-hero. You could see in these men a religious theme of the holy trinity plus the devil. But it never cuts unflinchingly deep as Bergman would have done; for example, is it really saying that God or Christ could be gay? The women are fallen, made ridiculous, or heart-broken; they end up diminished, and not powerful at all: compare Autumn Sonata, Scenes from a Marriage, or Persona; or the biblical stories of women.  The screenplay dodges direct accusation by giving equal time and space to all of the characters, and placing them more or less symmetrically. It is an intellectual exercise, good to look at, with clever twists, like a competent, allegorical painting. There is little involvement for the audience; without an emotional dénouement the ending was a problem, and it resorts to a glib device. Along the way, cut-and-paste pictures of an impossibly huge moon are a hilarious pointer to the film's problems with sincerity - watch for the unmoving clouds. Perhaps this show is telling us where modern Italy is at; or where someone thinks it should be, laced with generous doses of guilt. Maybe it holds up a documentary mirror to bourgeois society more generally. Maybe it is saying to mind your morals in the age of social media. If you are not too bothered about intellectual honesty, or about being fed a subliminal religious or moral lesson nodding to conservative authority, then you can sit back through this like a good soap, and chuckle and tisk your way along at the self-inflicted tribulations of a group of well-off people, all of it presented in a lush interior, or classically handsome streets, and delivered with the inimitable Italian talent for style.",
            "review_date": "2017-03-05",
            "source": "rt"
        },
        {
            "content": "A flawed movie, interesting idea handled in a very 'feel good' way. Heavy handed soundtrack broadcasts the required emotion. Some unnecessary symbols _the eclipse -ridiculous we get the point. Unfortunately the direction seems to play to the obvious a bit much. A great idea at the heart of this movie such a shame it was cooked with too much sugar and not enough salt.",
            "review_date": "2017-03-04",
            "source": "rt"
        },
        {
            "content": "dare we and would we want to bare our lives to our best friends through what we receive on our phones over a dinner party? this is a timely reminder to live honestly and love courageously.",
            "review_date": "2017-02-16",
            "source": "rt"
        },
        {
            "content": "excellent screenplay and acting by a bunch of \"old friends\" that goes to show that the games these middle-agers play on their phones can be a lot more costly than what their kids can chalk up on GooglePlay/Apple Store",
            "review_date": "2017-02-16",
            "source": "rt"
        },
        {
            "content": "A very contemporary, intriguing movie! A dialogue driven ensemble piece that is full of surprises. Makes you really think about the way we relate to our smartphones and what would happen if we were fully transparent about our phone calls and text messages. Has won lots of awards around the world. Loved the ending! This is worth making a special effort to track down and see.",
            "review_date": "2017-02-01",
            "source": "rt"
        },
        {
            "content": "the last lesson was maybe to directly written, compared to the discret text of the whole, but an excellent story",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "Perfetti sconosciuti è solo un film su come la tecnologia riempie la nostra giornata? No, non è così. Questa pellicola, per mezzo del gioco proposto da Eva, esplora le dinamiche e le 'regole' di ogni relazione, sentimentale e non. Si inizia con piccoli accordi, come organizzare una partita di calcetto senza avvisare l'amico di sempre, magari un po' scarso come giocatore. Si continua con scelte di vita discutibili. Si finisce con il portare alla luce relazioni clandestine, enormi incomprensioni frutto - anche - di trascorsi taciuti e non affrontati. Tutto all'ombra romana di un'eclissi di luna.\n\nNell'arco di un'ora e mezza, di un'eclissi, ogni legame viene spezzettato, analizzato ed esposto agli occhi degli altri, mostrando come buona parte della quotidianità e dei rapporti si basa su silenzi, più o meno significativi e sull'illusione di conoscere ogni sfaccettatura della propria metà. E' giusto, quindi, affermare che siamo fatti della stessa sostanza dei segreti? Il dubbio resta, un altro se che si aggiunge ad uno svolgimento che a tratti ricorda Sliding Doors e sì, forse, anche Inception con la criptica scena dell'anello lasciato rotolare sul tavolo.",
            "review_date": "2017-01-04",
            "source": "rt"
        },
        {
            "content": "The concept is interesting enough, not very original, though but maybe the fact that the characters discuss matters we all have in mind, more or less, about modern society and the role of technology in human relationships, is what makes it appealing. Still, didacticism and some over-the-top situations spoil the fun at times.",
            "review_date": "2016-12-19",
            "source": "rt"
        },
        {
            "content": "A movie you could enjoy",
            "review_date": "2016-11-26",
            "source": "rt"
        },
        {
            "content": "Perfetti Sconosciuti [Genovese, 2016] Well, that's pretty fucked up, isn't it? 7.5/10",
            "review_date": "2016-11-12",
            "source": "rt"
        },
        {
            "content": "povestea m-a tinut pana la final, great story cu mai multe twisturi.",
            "review_date": "2016-10-23",
            "source": "rt"
        },
        {
            "content": "Good movie...interesting topic. Technology is messing with our lives.",
            "review_date": "2016-09-18",
            "source": "rt"
        },
        {
            "content": "Per essere un vero capolavoro avrebbe dovuto non esagerare nella maniera in cui ha fatto. Ok tutto, ma che in un gruppo di amici ci siano tante cose di questo genere diventa surreale e crea solo fastidio per l'eccesso dj pedanteria.",
            "review_date": "2016-09-02",
            "source": "rt"
        },
        {
            "content": "Divertentissimo ma affronta anche temi di grande attualità senza essere banale.",
            "review_date": "2016-08-12",
            "source": "rt"
        },
        {
            "content": "Is your cell phone safe to make a transparency?\n\nUsually the films based on the dinner party associate with either family or the friends reunion and sometimes business related affair. But there's always a reason for such gathering like it might be a wedding, funeral, anniversary, a school reunion, getting a job or promotion, victory celebration et cetera. In this film, it was some long time friends meet which seems its their regular thing to do often. This tale covers one such fine evening to reveal what they actually do. A limited cast and one night event based film that cleverly and cautiously covers sensitive topics of the married life and trust of the friendship.\n\nIt has been almost a year since my last Italian film and now I'm happy for choosing this. I was not certain that I would like it till I saw it. So I would say same to you that see it first and then judge the product. This is really a good comedy-drama with a dark tone. We all adapted the modern way of life and gadgets makes so easy to accomplish things around us. In that, cell phones might come the first. Carrying it all the time became only next to wearing clothes, surely an artificial/digital sense of man. It also has some flaws, like it may land you in troubles as it's a part of AI, not human. I think it is easy to forecast a man's future by checking out his phone rather than his horoscope.\n\nSeven friends, including three married couples and one single man gather for a dinner party. They have been doing it for a very long time and that's where they all can share each others current life affair. Having some laughs and serious discussions, it defines the strength of their relationship. Every occasions won't be the same, there's always a first time for everything. That's how the event comes crashing out.\n\nWhile the party was going smooth, unexpectedly a game emerges that they all must place their phones on the table to prove they have no secrets from each other. Incoming and outgoing calls, texts, emails, everything must be heard by everyone at the table. What do you think would happen? Before saying anything, just place yourself in that position and do you think you can get away with a clean slate? Obviously tough to answer that, only practical observation would bring the result.\n\n\"He's seeing a therapist, not a whore! Come on!\"\n\nEverytime when there's an alert for an incoming call or message, the atmosphere gets more tense and as a viewer I went blinkless. It is not about what people hid from others, it is the reaction in the room when their secret was exposed. This is when adults become teenagers who try to explain the stuff when their parents find out their secrets. And so the friends become complete strangers. Because friends must back each other in the bad times, but in this scenario, it was totally out of the proportion regarding their action. Okay, if we push away the friendship, then how's the married one should take it. Feels very simple, since everyone involved in something, it has turned out to be a complicated affair.\n\nLike I said I've seen plenty of similar themed films, but this one was something unique in a simple way. There's a vast difference between what do you witness in the opening compared to how it concludes. A bad mouth can spoil a beautiful occasion, but now it is avoided since people learnt to shut their mouth. Just remember the film 'August: Osage County' and this film was no way close to it as a story, but developed to the next gen, the digital troubles the mankind had set to face. This film revealed how much a cell phone would cause trouble, then think what would happen with the robots of the tomorrow. Surely in 20-30 years from now, a similar film will be made with the bots.\n\nAt some point, I thought it might be the Italian version of the 'Coherence' for inclusion of lunar eclipse in the plot. I'm not going to say anything about that, you'll get it in your watch. There's no end twist, but it was an unexpected final scene. By then you will understand the meaning of the title. Awesome screenplay and well performed actors, this is one of the best films of the year so far. This is not a sci-fi or a thriller or a visual spectacular, but a smart little drama and I'm sensing that somebody might consider it for a remake. I know everyone won't like as much I did, but I won't end my review without recommending it. If you like talk movies, sure you does enjoy it.\n\n8.5/10",
            "review_date": "2016-07-14",
            "source": "rt"
        },
        {
            "content": "7.7/10, my review: http://wp.me/p1eXom-2vB",
            "review_date": "2016-07-06",
            "source": "rt"
        },
        {
            "content": "Ne avevo sentito parlare veramente bene e le aspettative erano veramente alte, nonostante questo pericolo il film mi è piaciuto anche se non ho trovato il capolavoro (o quasi) che mi aspettavo.\nIl film ricorda le commedie francesi di questi ultimi anni: dialoghi serrati tra persone chiuse in uno spazio limitato in cui sono \"costretti\" a confrontarsi con loro stessi e l'ipocrisia della società.\nSecondo me il regista pecca di troppi sentimentalismi in momenti topici del film, in cui la fotografia \"smarmella\", i dialoghi si fanno un po' troppo moralisti e parte una canzoncina strappalacrime di sottofondo (succede davvero).\nFortunatamente il finale non segue questa china ma riesce a risolvere una situazione in cui si stavano alzando sempre più i toni e che sembrava non essere più gestibile dignitosamente (a meno di non voler fare una puntata della D'Urso al cinema).\nnonostante queste pecche il regista (e gli sceneggiatori soprattutto), provano a creare una commedia più matura ed interessante rispetto alla media nazionale e ci riescono (il che è il più grande pregio del film).",
            "review_date": "2016-03-19",
            "source": "rt"
        },
        {
            "content": "The usual modern Italian comedy: over-acted, exagerated, unreal.",
            "review_date": "2016-03-16",
            "source": "rt"
        },
        {
            "content": "I padroni di casa sono Rocco (Marco Giallini) ed Eva (Kasia Smutniak). Rocco è un personaggio molto umano e sensibile, di professione fa il chirurgo plastico ed è sposato con una psichiatra in tilt che, al momento, non sa se è innamorata del marito e non riesce a capire la figlia adolescente. Poi, all'opposto, ci sono Bianca e Cosimo (Alba Rohrwacher ed Edoardo Leo), una coppia appena sposata, innamoratissima, lei veterinaria, timida, educata, riservata e ben voluta da tutti, l'ultima \"arrivata\" nel gruppo di amici; Cosimo fa il tassista ma è un uomo da mille idee che cambierebbe lavoro ogni giorno, convinto di fiutare\naffari sempre: potrebbe aprire un negozio di sigarette elettroniche come un allevamento di cani. Lele e Carlotta (Valerio Mastandrea e Anna Foglietta) fanno coppia da anni: lui è un funzionario che lavora in un ufficio legale di una grande azienda privata, luogo dove ha conosciuto la moglie. Carlotta è una donna che si dedica completamente ai loro due figli: per la famiglia ha lasciato il lavoro. Anche loro hanno un profondo segreto. Infine, c'è Peppe, interpretato da Giuseppe Battiston, un professore di ginnastica, licenziato per esubero e\nattualmente alla ricerca di un lavoro. La sera in cui si svolge la cena avrebbe dovuto presentare agli amici la sua nuova fidanzata ma, all'ultimo momento, si presenta da solo perché lei si è ammalata. Ognuno di questi personaggi, attraverso il gioco in cui è coinvolto, tirerà fuori da se stesso e dagli altri un segreto importante, un \"non detto\" ma, anche, la consapevolezza che pur\nconoscendosi tutti da tempo si ritroveranno ad essere dei \"perfetti sconosciuti\".",
            "review_date": "2016-03-10",
            "source": "rt"
        }
    ]
}