{
    "rating": 2.8,
    "release_date": "Invalid",
    "num_reviews": 250,
    "genres": [
        "Comedy"
    ],
    "summary": "Clownish police officers (Bubba Smith, David Graf, Michael Winslow) are on the lookout for a three-ring circus of thieves.",
    "reviews": [
        {
            "content": "When the first installment was already bad in agonizing ways, the second was as pleasant as Ebola, the third a copy and paste of the jokes of the first, the fourth a terminal cancer, the fifth is less pleasant than a kick, now it comes the 6 that all razzies deserve.",
            "review_date": "2021-07-06",
            "source": "rt"
        },
        {
            "content": "It was ok overall, but not as good as some of the other sequels in the series as the team is up to their usual tricks in their fight against crime",
            "review_date": "2021-07-03",
            "source": "rt"
        },
        {
            "content": "If you have to babysit rotten brats for a day and you just want to get paid. Make them watch the whole movie series. That's all what they are good for. I wouldn't show anyone I like any of the sequels.",
            "review_date": "2021-03-27",
            "source": "rt"
        },
        {
            "content": "1989:  A group of thieves are committing crimes all over town.  The police force combine again with Harris and Proctor to work together to bring the thieves down.  The thieves report to a mystery leader, who seems to know the squad's every move.   The sixth outing is passable, but it feels like most of the jokes are retreads or stretches.  Giving more attention to four of the cops (Hightower, Tackleberry, Jones, and Nick Lassard) towards the end, in the pursuit of the bad guys was a good move.  We've seen most of this before, though.\n\nCameos:  Original MTV video jockeys Alan Hunter and Mark Goodman appear in two scenes as businessmen.  \n\nStars:  Bubba Smith, David Graf, Michael Winslow, Matt McCoy, George Gaynes, and G.W. Bailey.",
            "review_date": "2020-06-17",
            "source": "rt"
        },
        {
            "content": "Though there are some funny jokes, they are few and far between. With regards to everything else, the story is bland and predictable, the action sequences are cheesy as hell to the point of reaching an unbearable limit and the main twist is not that hard to see coming. It just keeps getting worse and worse, man.",
            "review_date": "2019-08-04",
            "source": "rt"
        },
        {
            "content": "The first real dud IMHO. Still mildly amusing though.",
            "review_date": "2018-06-08",
            "source": "rt"
        },
        {
            "content": "The series becomes a total cartoon by this point. Suffers from the lack of Guttenberg. It's one of the weakest entries, but there's still some fun bits in it.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Can we please work together to make sure Police Academy 6 has more than 0% score?  The Wilson Heights Gang would approve.",
            "review_date": "2017-07-28",
            "source": "rt"
        },
        {
            "content": "Bad fucking movie, just awful. And I love them.",
            "review_date": "2017-06-13",
            "source": "rt"
        },
        {
            "content": "This movie was alright, not as good as the original. Still funny and entertaining.",
            "review_date": "2016-12-29",
            "source": "rt"
        },
        {
            "content": "The gang is back and must track down jewel thieves. Silly stupid sequel.",
            "review_date": "2016-06-15",
            "source": "rt"
        },
        {
            "content": "Awesome taking down a mastermind.",
            "review_date": "2015-11-06",
            "source": "rt"
        },
        {
            "content": "Police Academy 6 is the same as all of the other ones, the jokes are old, the series is PG, all that can happen to a perfect standalone comedy.",
            "review_date": "2015-05-14",
            "source": "rt"
        },
        {
            "content": "I really checked out of this series years before this installment but my dumb ass couldn't leave well enough alone.",
            "review_date": "2015-04-18",
            "source": "rt"
        },
        {
            "content": "Recruits save the city that's under siege, duh.",
            "review_date": "2015-03-08",
            "source": "rt"
        },
        {
            "content": "Now I hate to admit it but this is my favourite sequel, the old favourite characters are still here but some are gone but they've never been better since the first original movie. They each steal the screen and lap it up. The action scenes are dull and very redundant but the jokes are slightly (If just a little bit) better. It's very childish and at times a little embarrassing from some actors but it strangely works. The script might be weak but it feels like the actors improvise and are better without the storyline. It's Michael Winslow that again gets the best scenes and probably his best in the series. Weak storyline but impressive gags.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "With a talented cast, however with a poor script, without funny and no sense jokes, predictable and with an unoriginal story. It is so possible that this movie interest somebody like it's possible a chicken has teeth.",
            "review_date": "2014-12-25",
            "source": "rt"
        },
        {
            "content": "With a talented cast, however with a weak argument with no funny and no sense jokes and predictable and no original story,  it's so possible that this movie interest somebody like it's possible the chicken's has teeth.",
            "review_date": "2014-12-25",
            "source": "rt"
        },
        {
            "content": "Better then 5 not as good as the first 4 but still really funny.",
            "review_date": "2014-07-31",
            "source": "rt"
        },
        {
            "content": "Beating a dead horse, Police Academy cranks out a sixth installment of crazy shenanigans with City Under Siege.  When the Wilson Heights Gang proves to be more than Capt. Harris can handle the Mayor sends in Commandant Lassard and his team to help.  The acting is just terrible, and has gone way beyond slapstick and into outright buffoonery.  Every joke has been so overplayed throughout the series by now that there's no fun or joy in anything being done here.  Police Academy 6: City Under Siege is a stale and humorless comedy that's DOA.",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "I would still watch this one again because I'm a big fan of this series but this was a much weaker film than its predecessors.  The jokes seemed more tame and without much effectiveness.  It was halfway between good and bad...",
            "review_date": "2014-03-27",
            "source": "rt"
        },
        {
            "content": "I found it difficult to keep watching this film. By this entry in the Police Academy series, it was hard to find anything remotely entertaining, or funny about it.",
            "review_date": "2014-01-07",
            "source": "rt"
        },
        {
            "content": "Police Academy can go fucking die.",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "Number six and the plots keep getting simpler each time round. This time its a gang that are on a crime spree and its up to our boys n girls in blue to save the day. Naturally someone is behind this whole operation so be prepared for a truly ball bustin' twist...nah not really.\n\nYet again I am amazed at the continuity of these films and the fact all of the cast are still present and correct...bar Guttenberg who went AWOL after number four. This time round we have all the regular officers plus Fackler makes a welcome return and Nick Lassard is still here replacing Mahoney.\n\nFirst time ever we actually have a PA film where there aren't any training sequences, this time its all about the main team going up against a trio of super criminals. The criminals are actually quite good too I might add, totally cliched of course but they are meant to be equals for three of the main PA characters. One guy is a huge bald fat biker looking dude, his strength is errr...strength, so he goes up against Hightower. Then we have a slim athletic guy who is good at martial arts and gymnastics, guess who he goes up against. And finally a smooth well dressed ladies man type who is a sharp shooter and dead eye with guns...yep, Tackleberry.\n\nThis film relies more on bumbling cops n robbers type of stuff, Harris and Proctor getting set up and constantly missing the chance to make a simple arrest. Not so many pranks, nudity or rudeness, just simple childish [i]Pink Panther[/i] styled buffoonery but more idiotic and predictable if that's possible.\n\nKenneth Mars tries to liven up the film with his cartoonish Mayor character but it falls flat. You can see they are trying to capture the madness he brought to 'Young Frankenstein' but it just doesn't work, too stupid and not funny. I did like Gerrit Graham as the aptly named Ace (the sharp shooter criminal) and the little showdown between the three criminals and three officers, the best bit in the film really. Bailey does well again as Harris but the few pranks are way too infantile this time.\n\nOver all its not a bad film really, its still better than number four and about on par with number five. I do like the darkly lit, noir-ish visuals they attempt in this one, clearly going for that Bogart-like detective quality in places. The whole thing is actually more akin to a typical pulp comic book adaptation, along the lines of [i]Dick Tracy[/i] or 'The Shadow'...albeit a very dumb simplified version. So kudos for that approach, not great by any means but a fair effort bearing in mind this is the sixth film.",
            "review_date": "2013-09-01",
            "source": "rt"
        },
        {
            "content": "I must admit for a sixth film in a comedy series you don't expect much plus the fact that the previous 5 arn't nothing great, But this one is pretty good and not as silly as you think, Still a few tired gags but worth watcing.",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "Are we done with these yet??????????",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "This is the last one that I watched. I used to like this series as a kid but even between the age of 9 and 12 I realized that this one was super weak.",
            "review_date": "2013-01-17",
            "source": "rt"
        },
        {
            "content": "More of the same good old signature Police Academy fun.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "Standard film, mediocre, nothing further, worth one watch or two.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Lassard's team help uncover the man behind a city crime wave.  Manages a couple funny moments late such as Jones fighting as a robot and Proctor driving a city bus but this one really struggles to come up with material.  I would have recommended another trip back to the Blue Oyster.",
            "review_date": "2012-11-20",
            "source": "rt"
        },
        {
            "content": "I can not wait to see this movie again.",
            "review_date": "2012-10-02",
            "source": "rt"
        },
        {
            "content": "too many  of these lol",
            "review_date": "2012-09-12",
            "source": "rt"
        },
        {
            "content": "as the series goes on the jokes become tired and lame.  Time to put it to sleep please nurse",
            "review_date": "2012-08-08",
            "source": "rt"
        },
        {
            "content": "I own this in a seven movie pack along with:\n* Police Academy (1984)\n* Police Academy 2: Their First Assignment (1985)\n* Police Academy 3: Back In Training (1986)\n* Police Academy 4: Citizens On Patrol (1987)\n* Police Academy 5: Assignment Miami Beach (1988)\n* Police Academy: Mission To Moscow (1994)",
            "review_date": "2012-06-24",
            "source": "rt"
        },
        {
            "content": "This series just isn't f***ing funny anymore!",
            "review_date": "2012-06-14",
            "source": "rt"
        },
        {
            "content": "Definitely the worst Police Academy movie! Haven't they got tired of playing the same characters with exactly the same jokes over and over again? There was not plot at all and no action scenes. What the heck was the character played by Kenneth Mars? They should have stooped long time ago with these movies.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "not the best but it had good bits",
            "review_date": "2012-05-14",
            "source": "rt"
        },
        {
            "content": "the whole set of these are funny as hell....",
            "review_date": "2012-04-09",
            "source": "rt"
        },
        {
            "content": "They're all simply hilarious.",
            "review_date": "2012-03-02",
            "source": "rt"
        },
        {
            "content": "The Grads are going undercover in the city to unmask the mastermind of crime.",
            "review_date": "2012-02-26",
            "source": "rt"
        },
        {
            "content": "This one wasn't that funny... I guess it's getting kind of old now.",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "When this one came out, it finally awoke the awakening movie fan in me, whose tastes were just starting to mature. This was the one that made me realize how dreadful this series was and that not all comedies are created equal. For this, I thank the makers of Police Academy 6: City Under Siege. Probably not the reaction they were hoping for, but at least it made me feel something, right?",
            "review_date": "2012-01-13",
            "source": "rt"
        },
        {
            "content": "It was better than the previous one.  Nothing new in terms of content but it was fun to watch.  Some scenes were funny and some weren't so funny.",
            "review_date": "2011-12-18",
            "source": "rt"
        },
        {
            "content": "Even though this movie didn't rate too well there were still the usual Police Academy funny parts",
            "review_date": "2011-10-02",
            "source": "rt"
        },
        {
            "content": "I actually thought this was slightly better than number 5, only marginally though. The biggest issue I had with number 5 was the scattershot plot, or non existent plot for that matter. This film tends to be okay, but suffers when the humour is pushed to 11. The film doesn't work as a whole. It's nice to see some of the returning faces, but overall the franchise has been sucked dry at this point. Unnecessary film, definitely. The bad guys are like a group of man children and it just doesn't work well. At this point of the series the films had gone fill kid mode and it was not the correct move. There are some memorable moments here with stunt work and set pieces, but it is surrounded by too much that doesn't work. 22/11/2019",
            "review_date": "2011-09-25",
            "source": "rt"
        },
        {
            "content": "Which one was this again?? Ah yes the sixth instalment of this gritty fly-on-the-wall documentary following Mahoney and chums (without Mahoney). Daniel O'Donnell once again takes over his role as the not-so-lovable-rogue cop. Even cheesier than the previous 15 films but still has its funny moments. Worth watching if you have say a year or so off work . . .",
            "review_date": "2011-07-14",
            "source": "rt"
        },
        {
            "content": "This is a laugh free zone from beginning to end. The last to feature a full contingent of the original cast, with Fackler returning one last time even though he's been absent from the previous two films and he seems to be solely here to fill out the numbers and add some awkward comic relief, in fact he's largely absent from the films conclusion. Everyone else is poorly served by the script and character traits that were funny once upon a time have been run into the ground by this point. McCoy is also most poorly served as he's still being given warmed up leftover's of Guttenberg's old gags. From here Smith (Hightower), Ramsey (Hooks), McCoy (Nick Lassard), Mahler (Fackler), Robertson (Hurst) and Kinsey (Proctor) all had the good sense to avoid the next installment and you should take a leaf out of their book and avoid this one to.",
            "review_date": "2011-06-28",
            "source": "rt"
        },
        {
            "content": "Meh, kind of sad that the most organized storyline was the least entertaining.",
            "review_date": "2011-06-11",
            "source": "rt"
        },
        {
            "content": "Love the series but you gotta run out of ideas sooner or later",
            "review_date": "2011-04-06",
            "source": "rt"
        },
        {
            "content": "This installment of the franchise brings a more story driven film but with fewer returning characters. It's also extremely predictable and, for those who have seen the other films, repetitive. While the strength of Bubba Smith and the auditory fx of Michael Winslow are put to more use, it is just more of the same we've seen through the previous 5 films.\nMcCoy has left behind his Guttenberg clone roots and become a real cop in this film. While there were signs in previous films, it isn't until #6 that his character becomes the brains of the operation.\nIt is at this point in the franchise that you quickly realize that if you took what was good about each film in the series and put them together into one film, you'd probably have a very good comedy.  Makes you wonder if perhaps they should... I'm going to say it... remake Police Academy",
            "review_date": "2011-03-13",
            "source": "rt"
        },
        {
            "content": "Really enjoyable for a sixth  film. Adds in a who done it aspect. And Fackler returns!!!",
            "review_date": "2011-02-20",
            "source": "rt"
        },
        {
            "content": "Comment peut on etre aussi pathetique? Rien n'est drole, rien de detestable non plus, juste... c'est mal foutu, mal joue, et surtout ininteressant au possible.",
            "review_date": "2011-01-31",
            "source": "rt"
        },
        {
            "content": "Silly kid friendly addition with the gang trying to stop a gang of thieves attacking a city. The usual lot appear apart from guttenberg doing there gag then moving on. Least winslow gets to do his hendricks which is the best bit. This should have been the last one just bareable but then they made............",
            "review_date": "2011-01-08",
            "source": "rt"
        },
        {
            "content": "Following in the footsteps of its predecessors, another comedy value police academy movie. The city is under siege from a small gang continually breaking into and robbing jewellers and intent on causing crime and disorder, lassard and his team step up to find the mastermind behind it all. Turns out the mastermind is one of their own..",
            "review_date": "2011-01-05",
            "source": "rt"
        },
        {
            "content": "\"Police Academy 6 : S.O.S...ville en état de choc\"",
            "review_date": "2011-01-01",
            "source": "rt"
        },
        {
            "content": "Just when you thought the series couldn't get any worse...Police Academy 6: City Under Siege! It's the same recycled story as the previous five films. At this point the series has grown really, really tiresome. The only thing that seperates this film from the rest is that it's somewhat of a mystery of who the villain is.",
            "review_date": "2010-12-14",
            "source": "rt"
        },
        {
            "content": "i know why people dont like this one, but its probably one of my favourates from the crop... i love the way the bad guys match up with the jones, tack and hightower... this was the one i realised that proctor was a must in a police academy.",
            "review_date": "2010-11-29",
            "source": "rt"
        },
        {
            "content": "Yet another Police Academy sequel. Can't. Stop. Flogging. Dead. Horse! Still, having said that, City Under Siege is undeniably superior to Miami Beach if for no other reason than it doesn't rely on a gimmicky change of location and enormous amounts of padding. Sure the same old characters and gags are recycled... again... and the staleness is unquestionable but the plot is kinda fun in a tongue-in-cheek way and once again they somehow manage to sneak a number of genuinely funny gags in amongst the sea of duds - again almost exclusively thanks to G.W. Bailey and Lance Kinsey (Harris and Proctor), though as in Miami Beach the goofy villains also provide a couple of good laughs. So, that's it for the 80's 6-films-in-as-many-years Police Academy run. All that's left is Mission to Moscow, and with only a handful of familiar characters returning, another gimmicky change of location and a universally infamous reputation, things are looking bleak.",
            "review_date": "2010-09-26",
            "source": "rt"
        },
        {
            "content": "The Best of the sequels",
            "review_date": "2010-09-18",
            "source": "rt"
        },
        {
            "content": "What can you expect from the sixth movie in a comedy action series?  Not much, so don't expect much.  The story is okay, but the jokes are old.",
            "review_date": "2010-09-06",
            "source": "rt"
        },
        {
            "content": "Review #316 Comedy\r\n\r\nDefinately should've been the last stop for this franchise.",
            "review_date": "2010-08-31",
            "source": "rt"
        },
        {
            "content": "Grossing less than $11 million dollars at the box office, and being the only Police Academy film to not debut at #1, Police Academy 6: City Under Siege marked the decline and death of the franchise.  People say âthe final nail in the coffinâ a lot about shit like this.  Iâm pretty sure they donât nail coffins shut anymore, so maybe they should shut the fuck up.  (I mean, they lock or something now, right?)  First off, it was the reviews â Police Academy films usually got 0 stars.  Even fan-favorite, Citizens on Patrol (part 4), was one of the worst rated films of all time.  Maybe people started listening to critics.  Which is ironic, because if theyâre stupid enough to listen to critics then theyâre obviously stupid enough to have a lot of fun at a Police Academy movie.  Anyways, I would be fighting for the final entry in the franchise if this one had been just a little better.\r\n\r\nThis is definitely not the worst, but the âleast bestâ of the franchise, or however you want to put it.  Maybe you could put it this way - âit had far less nails in it than the last coffinâ.  Do whatever you want, I donât care.  Itâs interesting, because City Under Siege actually had a good premise, and you finally started getting to know the characters instead of them just doing their jokes that they always do so well in every movie.  When Motormouth Jones finally said something serious in this one it was the first time I realized that he never had a personality before.  He was just a walking joke the whole time.  Which was fun; he always had me laughing my ass off.  I didnât notice.  I didnât care.  But I realized the rest of the cast was like that as well.  So, it seems they were trying to make the characters more interesting heroes at the expense of the jokes.  Which in turn made a lot of the movie boring.  \r\n\r\nThe villains were pretty awesome.  Wisecracking and carefree, they seemed to be having more fun than the heroes in this one, and they gained my sympathy.  Which you should never have for the villains in a film.  The finale had great fights between each of them and their obvious match-up from the heroesâ side.  Hightower fought the big guy, who was just as strong as him.  Jones (who has always done karate in every film for some reason, ever see the guy shoot a gun?) fights the acrobat.  Tackleberry fights the gun expert.  Matt McCoy does a good job again at trying to play the hero.  I said âtryingâ.  They seem to have pushed him into the background to let the veterans shine more.  He was supposed to be Steve Guttenbergâs replacement as leading man.  Agent Fackler is a welcome return to the team, who seems to have been absent for 2-3 movies.  (Fackler is the one I mistakenly listed as accident-prone in a previous review.  Itâs everyone AROUND HIM that suffers from bad luck and unfortunate mishaps when heâs around.  They took this to the highest degree in this one.)  Captain Harris and Proctor are just there to become the butt of many jokes again.  Almost too much so.  That was OK (overusing them) in the last film because the jokes were funny as fuck.  Not here.  I was hoping the mysterious villain would be revealed to be Mauser, Harrisâ replacement during part 2 and 3.  But no, it was exactly who you expected it to be.  They call that âproverbial nails hammered into the predictability coffinâ or something.  Or they donât.  I donât want to know about it, really.    \r\n\r\nRating: 3 Beers.  Maybe a shot.  But definitely not âno tomatoesâ.  I donât know what the fuck is up with this âRotten Tomatoesâ website I keep hearing about.  But I think my beer ratings are way more awesome than something as clichÃ© and old hat as tomatoes (remember people used to throw them while booing?)  I give Rotten Tomatoes 0 beers.  How about that?",
            "review_date": "2010-08-11",
            "source": "rt"
        },
        {
            "content": "Our favourite police men are called together to deal with a gang who rob banks and jewelers. Using their various talents as well as their extraordinary luck, the crooks stand no chance against our men and women wearing blue...",
            "review_date": "2010-07-16",
            "source": "rt"
        },
        {
            "content": "One thing you notice about this movie is the abundant reliance on those one note characters. Matt McCoy gives up on being a Guttenberg replacement and is now left as an actual serious cop. He isn't a lot of fun, as everyone around him is quirky or funny.",
            "review_date": "2010-07-07",
            "source": "rt"
        },
        {
            "content": "so bad towards the end, but at least this one has a story which is half decent.",
            "review_date": "2010-07-04",
            "source": "rt"
        },
        {
            "content": "I think the story line has perked up a bit. Not the best but I still love the series!",
            "review_date": "2010-06-21",
            "source": "rt"
        },
        {
            "content": "Started getting old after the 3rd movie....Big MEH",
            "review_date": "2010-06-12",
            "source": "rt"
        },
        {
            "content": "Thank you finally over!",
            "review_date": "2010-05-27",
            "source": "rt"
        },
        {
            "content": "One of the vilians kept screaming out my actact thought on this film \" oh, crapola\". This film is a tonne of Crapola and the jokes are not that funny anymore. 3/10",
            "review_date": "2010-05-11",
            "source": "rt"
        },
        {
            "content": "I didn't see any of the releases after this one so for now this is the worst Police Academy movie.",
            "review_date": "2010-04-27",
            "source": "rt"
        },
        {
            "content": "It's definitely better than Police Academy 5 ^.^",
            "review_date": "2010-04-03",
            "source": "rt"
        },
        {
            "content": "A career nadir for all involved!",
            "review_date": "2010-03-21",
            "source": "rt"
        },
        {
            "content": "Winslow is amazing, his stand up comedy is still funny to this day!",
            "review_date": "2010-03-14",
            "source": "rt"
        },
        {
            "content": "I love the Police Academy movies and though i did not mind this one the movies just go more and more down hill after each one, still did not mind this one though with some funny moments but far from being the best.",
            "review_date": "2010-02-18",
            "source": "rt"
        },
        {
            "content": "Las situaciones comicas de \"Police Academy\" y los personajes estereotipados pero graciosos, comienzan a decaer en esta cinta que posee momentos graciosos, pero mas escasos que en las anteriores entregas.",
            "review_date": "2010-02-16",
            "source": "rt"
        },
        {
            "content": "Police Academy Trilogy is a great Piece of tasty Cake but the I was shocked by the last part \"Mission Moscow\"",
            "review_date": "2010-01-14",
            "source": "rt"
        },
        {
            "content": "I love the Academy series but the later films just dont have the same magic as the original 3. Decent enough to watch once or twice.",
            "review_date": "2010-01-09",
            "source": "rt"
        },
        {
            "content": "What can you expect from a movie directed by someone named Peter Bonerz!  One of the worst of the series!",
            "review_date": "2009-12-24",
            "source": "rt"
        },
        {
            "content": "(*): Thumbs Down\r\n\r\nI keep asking myself, \"Why did I even bother...\"",
            "review_date": "2009-12-23",
            "source": "rt"
        },
        {
            "content": "The franchise was by now running out of steam and it shows in this one. As with the later entries, you do get the occasional laugh but nowhere near as you had in the first 4 movies.",
            "review_date": "2009-12-19",
            "source": "rt"
        },
        {
            "content": "Knowing that this set of movies made it this far confuses me. It has to be because of the cult following that they can still make money from this film. And how they still manage to keep some of the original characters from the very first. Again, some of the same cast, new people and cheesy story line.",
            "review_date": "2009-12-02",
            "source": "rt"
        },
        {
            "content": "forgotten film as its the 6 outing but this is a good film that in my eyes is as good as the first  sort of!!!",
            "review_date": "2009-11-25",
            "source": "rt"
        },
        {
            "content": "not a bad movie!  It was like quircky funny harris is there but one of the lead characters are not here anymore.  Thank god they got rid of whats his annoying ass.",
            "review_date": "2009-11-21",
            "source": "rt"
        },
        {
            "content": "You might laugh at times. Cast is a little crowded, and the comedy seems to stay with one person and thats harris.",
            "review_date": "2009-11-18",
            "source": "rt"
        },
        {
            "content": "Last of the good Police Academy movies",
            "review_date": "2009-11-11",
            "source": "rt"
        },
        {
            "content": "The Funny Sixth Part of the Police Academy Series",
            "review_date": "2009-11-06",
            "source": "rt"
        },
        {
            "content": "just like 7 with a little more story but in my book still terrible worth one watch then again it seems to be the only one thats on tv and its on all the time",
            "review_date": "2009-09-15",
            "source": "rt"
        },
        {
            "content": "Not as good as the first films.",
            "review_date": "2009-08-30",
            "source": "rt"
        },
        {
            "content": "Something has got to be wrong if you have someone named \"Bubba\" cast in this movie (ha! ha!). Not one of the best one's that for sure.",
            "review_date": "2009-08-15",
            "source": "rt"
        },
        {
            "content": "This was so atrocious that I as a fan of the series PUKED MY GUTS OUT!",
            "review_date": "2009-08-02",
            "source": "rt"
        },
        {
            "content": "Of all the Police Academy movies. . . this one was DUMB AS HELL!!!",
            "review_date": "2009-07-12",
            "source": "rt"
        },
        {
            "content": "gotta love PA series",
            "review_date": "2009-06-19",
            "source": "rt"
        },
        {
            "content": "Although this sequel has a few more laughs than #5 (which is actually saying something), this one made me finally say \"Enough is enough!\" and thus, I won't be seeing any more new \"Police Academy\" movies after this one. This time around, the famous duffuses in blue try to figure out who is behind a huge city crime wave. I suppose the outright goofiness here somewhat helped too, but you can only take overplayed idiocy so far.",
            "review_date": "2009-06-06",
            "source": "rt"
        },
        {
            "content": "One of the more fun sequels... complete with some of our favorite characters back for another round of goofy, dimwitted humor.  If the \"6\" in the title isn't warning enough, don't hold your expectations too high and you will probably have a good laugh or two.",
            "review_date": "2009-06-05",
            "source": "rt"
        },
        {
            "content": "The sixth of the series just reuses the same jokes from the other police academy movies, few of which are still funny.  The only thing that was good about this one was that no one knew who the bad guy was, so it at least had a mystery going for it.",
            "review_date": "2009-05-02",
            "source": "rt"
        },
        {
            "content": "The funniest thing about this wretched piece of crap is that the directors name is \"Bonerz\".  That's pretty much the level of humor going on in this waste of film anyways so I might as well have made the joke.  Even the great Lance Kinsey and G.W. Bailey pairing can't save this one from sinking to depths so low the franchise would never recover.",
            "review_date": "2009-04-14",
            "source": "rt"
        },
        {
            "content": "Appropriately, this is the last Police Academy movie.",
            "review_date": "2009-03-09",
            "source": "rt"
        },
        {
            "content": "Oddly darker in tone and the return of Sgt Fackler makes for some good sight gags. Cruelly ignored by critics, this is one of the better of the series; high on laughs and plot.",
            "review_date": "2009-03-09",
            "source": "rt"
        },
        {
            "content": "The plot exist to get from one unfunny gag to another.  The equivalent of DATE MOVIE and all it's awful ilk.",
            "review_date": "2009-03-05",
            "source": "rt"
        },
        {
            "content": "At least they are back in the city for this one.",
            "review_date": "2009-02-27",
            "source": "rt"
        },
        {
            "content": "Another case of dying a slow death.",
            "review_date": "2009-02-26",
            "source": "rt"
        },
        {
            "content": "I remember as a kid loving to see Hightower against that big dude and Tackleberry and the gun expert trying to show each other up. It kind of stuck with me.",
            "review_date": "2009-02-18",
            "source": "rt"
        },
        {
            "content": "pretty good but not as good as the others",
            "review_date": "2009-02-17",
            "source": "rt"
        },
        {
            "content": "- on dvd -\nWow this is awful. It made me laugh once though. It has a twist which is something new to the series. However, the twist is shit.",
            "review_date": "2009-02-09",
            "source": "rt"
        },
        {
            "content": "Ahora estos extraños policías van tras unos asaltantes y continua de capa caída la saga",
            "review_date": "2009-01-27",
            "source": "rt"
        },
        {
            "content": "Police Academy is hilarious! I love the whole series!",
            "review_date": "2008-12-29",
            "source": "rt"
        },
        {
            "content": "I don't know what it is about this one that makes it very slightly better than some of the other Police Academy sequels.  Perhaps because the director's last name was 'Bonerz'.",
            "review_date": "2008-12-28",
            "source": "rt"
        },
        {
            "content": "Funny, but else it was just stupied.",
            "review_date": "2008-12-23",
            "source": "rt"
        },
        {
            "content": "Some funny parts but has really dropped off from the original.",
            "review_date": "2008-12-07",
            "source": "rt"
        },
        {
            "content": "SelkeÃ¤sti paras nÃ¤istÃ¤ jatko-osa parodioista. TÃ¤ssÃ¤ ei sentÃ¤Ã¤n koulutettu mummoja tjms. :P",
            "review_date": "2008-12-03",
            "source": "rt"
        },
        {
            "content": "With the 6th installment of the series the jokes have all but run dry and anything that hasn't already been used is at a premium. Still City Under Siege provides a good family movie with a few chuckles along the way. Too bad the writers couldn't come up with some more fresh humor for the last Police Academy!",
            "review_date": "2008-12-01",
            "source": "rt"
        },
        {
            "content": "creo que esta es la mas comica de todas",
            "review_date": "2008-11-15",
            "source": "rt"
        },
        {
            "content": "When your best gag is a subtle in joke you're in trouble.",
            "review_date": "2008-11-10",
            "source": "rt"
        },
        {
            "content": "Mm. Not so great like the other ones. But still, it was pretty funny this one too :)",
            "review_date": "2008-11-01",
            "source": "rt"
        },
        {
            "content": "the whole set of these are funny as hell....",
            "review_date": "2008-10-29",
            "source": "rt"
        },
        {
            "content": "i love all police academy traditional comedy",
            "review_date": "2008-10-17",
            "source": "rt"
        },
        {
            "content": "At what point did they decide the world needed 6 of these?",
            "review_date": "2008-10-15",
            "source": "rt"
        },
        {
            "content": "When it comes to silly comedies, there is such as thing as too dumb, and this comes dangerously close to hitting that mark.",
            "review_date": "2008-09-25",
            "source": "rt"
        },
        {
            "content": "wow, soo many sequils and it's still good. great movie",
            "review_date": "2008-09-13",
            "source": "rt"
        },
        {
            "content": "ok, this one REALLY SUCKED, but still a Classic compared to ANY will farrell movie",
            "review_date": "2008-09-08",
            "source": "rt"
        },
        {
            "content": "all the police academy films are funny!",
            "review_date": "2008-08-28",
            "source": "rt"
        },
        {
            "content": "When a metropolitan crime wave is afoot, our bumbling heroes take to the streets to discover who is head of the crime wave and put a stop to it.\n\nstars Bubba Smith, David Graf, Michael Winslow, G.W. Bailey, Leslie Easterbrook, Matt McCoy, Bruce Mahler and Marion Ramsey.",
            "review_date": "2008-08-28",
            "source": "rt"
        },
        {
            "content": "its like a bad episode of scooby doo. its no way near as good as the rest of them although it is my most memorable on simple for the monster truck.",
            "review_date": "2008-08-22",
            "source": "rt"
        },
        {
            "content": "The worst so far and worst by far. I guessed who the gang boss was within ten minutes. Hated the whole idea that Tackleberry/Hightower/Jones each had a bad guy that was equally as good as them at something. The reasoning behind \"Operation Chaos\" was terrible and overall the whole film just felt like a really bad extended Scooby Doo episode. Especially de-masking the villain which made it even more Scooby-esque. All it missed was the \"pesky kids\" line at the end.",
            "review_date": "2008-08-13",
            "source": "rt"
        },
        {
            "content": "I don't even remember which one this was, but does it matter?",
            "review_date": "2008-08-05",
            "source": "rt"
        },
        {
            "content": "After this came Mission to Moscow. Compared to that, this is awesome.",
            "review_date": "2008-08-05",
            "source": "rt"
        },
        {
            "content": "When one mentions police academy, of course one's first thought is of high quality film productions exploring the darkest reaches of man's existence.  PA6 is no exception, the relationship between the cadets and mauser mirrors that of man and nature.  The finer moments evoke Kubrick, Antonioni and Leone.  Some good fart jokes too!",
            "review_date": "2008-07-11",
            "source": "rt"
        },
        {
            "content": "Six? This one doesn't have The Guttenberg though... I'm extremely disappointed!!!",
            "review_date": "2008-07-11",
            "source": "rt"
        },
        {
            "content": "Peter Bonerz (must be a stage name) directs this embarrassing sequel, where the kooky cops are trying to stop yet another crime boss.",
            "review_date": "2008-07-09",
            "source": "rt"
        },
        {
            "content": "I'm pretty sure I watched this...why?!",
            "review_date": "2008-07-07",
            "source": "rt"
        },
        {
            "content": "This film, apart from being very samey as the rest - but is also very predictable.",
            "review_date": "2008-06-26",
            "source": "rt"
        },
        {
            "content": "Not as bad as they say, but still an average comedy. The jokes are dumb (yes very very dumb), but it's definetly watchable. The last sequel however is pretty boring and bad.",
            "review_date": "2008-06-24",
            "source": "rt"
        },
        {
            "content": "by now, you should now what to expect.",
            "review_date": "2008-06-23",
            "source": "rt"
        },
        {
            "content": "i think ..... it s gay",
            "review_date": "2008-06-17",
            "source": "rt"
        },
        {
            "content": "Knowing that this set of movies made it this far confuses me.  It has to be because of the cult following that they can still make money from this film.  And how they still manage to keep some of the original characters from the very first.  Again, some of the same cast, new people and cheesy story line.",
            "review_date": "2008-06-16",
            "source": "rt"
        },
        {
            "content": "they get lamer and lamer",
            "review_date": "2008-06-11",
            "source": "rt"
        },
        {
            "content": "Another funny movie in the series of the police academy.",
            "review_date": "2008-06-07",
            "source": "rt"
        },
        {
            "content": "One of my favourites in the series! The film is very good considering its the 5th sequel! McCoy is better in this one, & sees the return of Fackler! The darker storyline makes the film more credible, and the fight between the crooks & the team, especially Jones. \"Target human Mission Destroy\"",
            "review_date": "2008-05-31",
            "source": "rt"
        },
        {
            "content": "More of the same, but that's okay!",
            "review_date": "2008-05-31",
            "source": "rt"
        },
        {
            "content": "should have stopped with 2",
            "review_date": "2008-05-28",
            "source": "rt"
        },
        {
            "content": "The franchise was by now running out of steam and it shows in this one. As with the later entries, you do get the occasional laugh but nowhere near as you had in the first 4 movies.",
            "review_date": "2008-05-25",
            "source": "rt"
        },
        {
            "content": "not bad did expect better, lot of cheesy jokes",
            "review_date": "2008-05-12",
            "source": "rt"
        },
        {
            "content": "Thats right another police academy movie, do you know whats worse than this one? the crappy cartoon they made.",
            "review_date": "2008-05-11",
            "source": "rt"
        },
        {
            "content": "no mahoney= not good",
            "review_date": "2008-05-06",
            "source": "rt"
        },
        {
            "content": "Better than the fifth in that it actually HAS a plot.",
            "review_date": "2008-05-01",
            "source": "rt"
        },
        {
            "content": "Review will be written when/if re-watched (Probability: Zero).\n\nFirst viewing: 03.10.1997",
            "review_date": "2008-04-28",
            "source": "rt"
        },
        {
            "content": "They should have stopped with like the 3rd movie!!!!",
            "review_date": "2008-04-27",
            "source": "rt"
        },
        {
            "content": "This is ok but not as funny as the rest.",
            "review_date": "2008-04-24",
            "source": "rt"
        },
        {
            "content": "i do not know how anyone could not watch the police academy series!! this and mission to moscow are the only ones i remember watching though!!",
            "review_date": "2008-04-14",
            "source": "rt"
        },
        {
            "content": "http://facebook.flixster.com/static/images/rating/ni.off.gif\nNot Interested",
            "review_date": "2008-04-13",
            "source": "rt"
        },
        {
            "content": "they made a 6th one?",
            "review_date": "2008-04-04",
            "source": "rt"
        },
        {
            "content": "enough of the sequels!",
            "review_date": "2008-03-28",
            "source": "rt"
        },
        {
            "content": "Same jokes as always. Just another movie.",
            "review_date": "2008-03-22",
            "source": "rt"
        },
        {
            "content": "like i said in an earlier review, the original police academy was the only good one. when you see that a movie is in its sixth installment, you usually pass it up, but since i like to be a critic, i watched it anyways. im sorry i did cuz it was bad.",
            "review_date": "2008-03-18",
            "source": "rt"
        },
        {
            "content": "Honestly, I've seen almost all of these movies.",
            "review_date": "2008-03-14",
            "source": "rt"
        },
        {
            "content": "One of my favourites in the series! The film is very good considering its the 5th sequel! McCoy is better in this one, & sees the return of Fackler! The darker storyline makes the film more credible, and the fight between the crooks & the team, especially Jones.  \"Target human Mission Destroy\"",
            "review_date": "2008-03-13",
            "source": "rt"
        },
        {
            "content": "The best ever out of all in the police academy series! It deliever the best of the best of comedy!",
            "review_date": "2008-03-12",
            "source": "rt"
        },
        {
            "content": "this aint bad still funny jokes and stunts",
            "review_date": "2008-03-08",
            "source": "rt"
        },
        {
            "content": "a good police academy movie that has some good jokes",
            "review_date": "2008-03-07",
            "source": "rt"
        },
        {
            "content": "Like all of the sequels, this is a mind-numbing and pointless experience.",
            "review_date": "2008-02-29",
            "source": "rt"
        },
        {
            "content": "Even within the highly improbable context of the Police Academy universe, this one goes beyond the beyond in terms of complete idiocy. Even the most slapstick of films have either some degree of realism or/and humour. This one fails miserably on both counts.",
            "review_date": "2008-02-26",
            "source": "rt"
        },
        {
            "content": "I absolutely love this movies",
            "review_date": "2008-02-24",
            "source": "rt"
        },
        {
            "content": "No way as funny as the others",
            "review_date": "2008-02-21",
            "source": "rt"
        },
        {
            "content": "4 was too much- why did they even bother with 2 more?????????",
            "review_date": "2008-02-18",
            "source": "rt"
        },
        {
            "content": "funny. a little dark humour that alot of people may not like .i thought it was really good .But i keep watching them over and over again.i was a kid when it first started.Now i have a gerater appreciation for different levels of comedy.Ithink it is needed in this movie!!!",
            "review_date": "2008-02-17",
            "source": "rt"
        },
        {
            "content": "Had some amusing gags but I think they tried to make this too much of a mystery film than a comedic one.  Definately was the darkest of the series.",
            "review_date": "2008-02-12",
            "source": "rt"
        },
        {
            "content": "amazing how they made so many",
            "review_date": "2008-02-10",
            "source": "rt"
        },
        {
            "content": "I think this was my favorite",
            "review_date": "2008-02-05",
            "source": "rt"
        },
        {
            "content": "Kanskje den av filmene jeg har sett flest ganger. Lengs siden naa, men har bare gode minner.",
            "review_date": "2008-02-05",
            "source": "rt"
        },
        {
            "content": "easily the best of the bunch",
            "review_date": "2008-02-01",
            "source": "rt"
        },
        {
            "content": "No more now..please..",
            "review_date": "2008-01-31",
            "source": "rt"
        },
        {
            "content": "my all time i love police academy. but this part 6 disappointed me.",
            "review_date": "2008-01-31",
            "source": "rt"
        },
        {
            "content": "these just keep getting worse and worse.... and it wasn't all that good to start with",
            "review_date": "2008-01-28",
            "source": "rt"
        },
        {
            "content": "These movies are all the same.",
            "review_date": "2008-01-21",
            "source": "rt"
        },
        {
            "content": "another action-packed sequel, as the police squad take on a mysterious crime lord.  features more confident leader m- ccoy, a darker tone, the same talented ensemble in what would be the final brilliant police academy.  :: salutes ::  (=",
            "review_date": "2008-01-17",
            "source": "rt"
        },
        {
            "content": "While it contains some great classic scenes, such as the non-lethal shootout, PA6 is no where near as good as the prequels.",
            "review_date": "2008-01-17",
            "source": "rt"
        },
        {
            "content": "Oh, how the series faltered ...",
            "review_date": "2008-01-10",
            "source": "rt"
        },
        {
            "content": "Wow, I have to give these guys credit - I thought they had already hit rock bottom. Little did I know that they had begun to dig...",
            "review_date": "2008-01-09",
            "source": "rt"
        },
        {
            "content": "These movies got progressively worse...",
            "review_date": "2008-01-01",
            "source": "rt"
        },
        {
            "content": "So bad I never bothered with the last one. Not a decision that I regret for a second.",
            "review_date": "2008-01-01",
            "source": "rt"
        },
        {
            "content": "i still can't believe that this franchise survived past number 4. nothing here that you haven't seen in previous ones.",
            "review_date": "2007-12-29",
            "source": "rt"
        },
        {
            "content": "Police Academy is great....",
            "review_date": "2007-12-29",
            "source": "rt"
        },
        {
            "content": "Still losing it, lost it three movies ago..",
            "review_date": "2007-12-26",
            "source": "rt"
        },
        {
            "content": "There goes the same worst ones again. The jokes are spread further apart and the quality of writing seems down. Many of our favorite characters from previous films were missing.",
            "review_date": "2007-12-25",
            "source": "rt"
        },
        {
            "content": "\"We believe you guys, so we wont dispute you. But if you're lying to us, we'll come back and shoot you. Word\"!",
            "review_date": "2007-12-23",
            "source": "rt"
        },
        {
            "content": "It seems the series had a little bit of steam left before it died off. This one is a bit darker, focusing on a mysterious crime lord and three adept criminals who seem to elude the cops for the majority of the movie.",
            "review_date": "2007-12-19",
            "source": "rt"
        },
        {
            "content": "this wasn't the best in the series, but i did enjoy it for the fact that its characters remained to what they do best as entertainers.",
            "review_date": "2007-12-17",
            "source": "rt"
        },
        {
            "content": "Most of the early police academy movies weren't implausible, but this one started to move into its own little universe of amazing cops who cannot get hurt. And how can police academy be good without Steve Guttenberg?",
            "review_date": "2007-12-15",
            "source": "rt"
        },
        {
            "content": "They should have stopped after #4!",
            "review_date": "2007-12-13",
            "source": "rt"
        },
        {
            "content": "It's pretty laboured stuff at this point, certainly to try and squeeze just a little more cash from a paying audience hoping to get what the first few films supplied, but inevitably disappointed.",
            "review_date": "2007-12-07",
            "source": "rt"
        },
        {
            "content": "Cet episode ci se la joue un peu trop David Fincher, pas suffisamment Ivan Reitman.",
            "review_date": "2007-12-03",
            "source": "rt"
        },
        {
            "content": "One of the crappier Police Academy flicks.",
            "review_date": "2007-12-03",
            "source": "rt"
        },
        {
            "content": "no more please leave a great film alone",
            "review_date": "2007-12-03",
            "source": "rt"
        },
        {
            "content": "I lost count of how many there are.",
            "review_date": "2007-11-29",
            "source": "rt"
        },
        {
            "content": "i've seen 'em all and they're all the same thing pretty much. so i'll rate them as a whole instead of individually.",
            "review_date": "2007-11-28",
            "source": "rt"
        },
        {
            "content": "A new low for the series... I laughed a bit when Jones came out as the robot.",
            "review_date": "2007-11-27",
            "source": "rt"
        },
        {
            "content": "Steve Guttenberg knew best when he bailed after part 4. This would easily be the worst of the franchise... if it weren't for part 7!",
            "review_date": "2007-11-15",
            "source": "rt"
        },
        {
            "content": "The post-Guttenberg era...",
            "review_date": "2007-11-14",
            "source": "rt"
        },
        {
            "content": "Det er rett og slett fantastisk godt gjort at de klarte å holde dette gående så lenge, og med en slik kvalitet. \"City Under Siege\" er like god som noen av de beste filmene i serien, og av en eller annen grunn føles dette ikke litt tynnslitt en gang. Det skulle derimot vise seg å ende her. Fiaskoen som ble del 7 skulle vise seg å være slutten for en ellers utrolig bra serie med komedier.",
            "review_date": "2007-11-12",
            "source": "rt"
        },
        {
            "content": "stopped being funny at three...",
            "review_date": "2007-11-12",
            "source": "rt"
        },
        {
            "content": "I thought this one would be the last in the series, but no. Its still full of stupid jokes and retarded situations, but it is still funny.",
            "review_date": "2007-11-09",
            "source": "rt"
        },
        {
            "content": "Where is a suicide bomber when you need one?",
            "review_date": "2007-11-09",
            "source": "rt"
        },
        {
            "content": "my god i thought the second one was horrible but they just kept making more and more",
            "review_date": "2007-11-09",
            "source": "rt"
        },
        {
            "content": "[b][img]http://i17.photobucket.com/albums/b76/Linko05/MovieCovers2/PoliceAcademy6.jpg[/img]\n                                                                           Police Academy 6: City Under Siege (1989)[/b]\n \nThis isn't one of the best sequels but like the rest of the sequels it's the characters that make it worth watching regardless of how cheesy they are.",
            "review_date": "2007-11-09",
            "source": "rt"
        },
        {
            "content": "Saw this movie in the theater the day it came out. I think I was in first grade. I remember enjoying it...",
            "review_date": "2007-11-08",
            "source": "rt"
        },
        {
            "content": "one of the best police academys - Monster Truck FOR THE WIN!!!",
            "review_date": "2007-11-08",
            "source": "rt"
        },
        {
            "content": "Michael Winslow is incredible!",
            "review_date": "2007-11-07",
            "source": "rt"
        },
        {
            "content": "the worst of the lot, only the original is worth seeing and 2-4 purely for Bobcat Goldthwait only",
            "review_date": "2007-11-07",
            "source": "rt"
        },
        {
            "content": "More and more as this series progressed, the bit players were given more and more to do. No Bobcat, no Guttenberg and Winslow barely squeaks a megaphone sound effect. The final 3 sequels really are a chance to enjoy some good Harris & Procter action. Aside from that, there is not much to love.",
            "review_date": "2007-11-06",
            "source": "rt"
        },
        {
            "content": "not the best but it had good bits",
            "review_date": "2007-11-05",
            "source": "rt"
        },
        {
            "content": "The first one I ever saw so it gets an extra half star. The most senseless one in the series. There's a nice mix of monster trucks and male acrobatics, IN THE SAME SCENE!!!",
            "review_date": "2007-11-03",
            "source": "rt"
        },
        {
            "content": "Peter von Baghin voisi pakottaa katsomaan koko sarjan Clockwork Orange-tyyppisissÃ¤ olosuhteissa. Ns. \"muut tekijÃ¤t\" saattavat vaikuttaa arviooni hivenen.",
            "review_date": "2007-11-02",
            "source": "rt"
        },
        {
            "content": "all the police accadamy movies were funny back in the day",
            "review_date": "2007-11-01",
            "source": "rt"
        },
        {
            "content": "and to think i used to looove this rubbish when I was younger...",
            "review_date": "2007-11-01",
            "source": "rt"
        },
        {
            "content": "nearing the end of the series sadly the comedy ran out in 4",
            "review_date": "2007-10-30",
            "source": "rt"
        },
        {
            "content": "they get dumber and dumber as they make more of these movies.",
            "review_date": "2007-10-26",
            "source": "rt"
        },
        {
            "content": "A surprise cameo or two can't help this one.  Smells like a cathouse at low tide.",
            "review_date": "2007-10-25",
            "source": "rt"
        },
        {
            "content": "Las situaciones comicas de \"Police Academy\" y los personajes estereotipados pero graciosos, comienzan a decaer en esta cinta que posee momentos graciosos, pero mas escasos que en las anteriores entregas.",
            "review_date": "2007-10-24",
            "source": "rt"
        },
        {
            "content": "Enough!!! So bad even Guttenburg didn't ome back",
            "review_date": "2007-10-23",
            "source": "rt"
        },
        {
            "content": "i love the police academy",
            "review_date": "2007-10-22",
            "source": "rt"
        },
        {
            "content": "It,s good,but not one of the better ones in the serie",
            "review_date": "2007-10-18",
            "source": "rt"
        },
        {
            "content": "This is actually a pretty funny movie. Definitely more childish in humor, but this is a plus.",
            "review_date": "2007-10-17",
            "source": "rt"
        },
        {
            "content": "It's not as bad as Police Academy 2, but it is bad.",
            "review_date": "2007-10-10",
            "source": "rt"
        },
        {
            "content": "täysi tähti koska, 7 on vielä valovuoden verran paskempi",
            "review_date": "2007-10-09",
            "source": "rt"
        },
        {
            "content": "This is actually not so bad. It's one of my favorite sequels in the series. All in all a good movie.",
            "review_date": "2007-10-05",
            "source": "rt"
        },
        {
            "content": "My Favorite of the Police Academy Series.",
            "review_date": "2007-10-03",
            "source": "rt"
        },
        {
            "content": "My favorite part is when that guy makes all those noises. He cracks me up big time, like when he does Jimi Hendrix or that scene where he pulls out the guys brain and starts playing the violin, only he didn't really pull out the brain, he was just pretending. He's like a mime but better.  5 STARS!",
            "review_date": "2007-10-03",
            "source": "rt"
        },
        {
            "content": "Le dÃ©clin commence Ã  se faire sentir. Une bonne franchise qui aurait du arreter Ã  5",
            "review_date": "2007-10-03",
            "source": "rt"
        },
        {
            "content": "Getting a bit silly now",
            "review_date": "2007-10-02",
            "source": "rt"
        },
        {
            "content": "They really should have quit. The first ones rule.",
            "review_date": "2007-09-30",
            "source": "rt"
        },
        {
            "content": "A Childhood favourite",
            "review_date": "2007-09-29",
            "source": "rt"
        },
        {
            "content": "A loose whodunnit plot didn't even make the same old recycled jokes bearable. The only scene that drew a slight grin from me was a superflous rapping scene that was so awful that it was comical.",
            "review_date": "2007-09-28",
            "source": "rt"
        },
        {
            "content": "How did they make this many and there is one more, sadly I've seen them all.",
            "review_date": "2007-09-26",
            "source": "rt"
        },
        {
            "content": "Wow...and it just keeps going.",
            "review_date": "2007-09-25",
            "source": "rt"
        },
        {
            "content": "*shrugs*  The first few movies are a guilty pleasure... after that, it becomes a sin...",
            "review_date": "2007-09-24",
            "source": "rt"
        },
        {
            "content": "Not as good as the rest!",
            "review_date": "2007-09-24",
            "source": "rt"
        },
        {
            "content": "these films loose the plot after the fourth",
            "review_date": "2007-09-24",
            "source": "rt"
        },
        {
            "content": "good oldie, but not as good as the first four.",
            "review_date": "2007-09-23",
            "source": "rt"
        },
        {
            "content": "waaaay too many of these movies",
            "review_date": "2007-09-20",
            "source": "rt"
        },
        {
            "content": "I dont like any of these movies.",
            "review_date": "2007-09-20",
            "source": "rt"
        },
        {
            "content": "if i could give it no stars i would",
            "review_date": "2007-09-20",
            "source": "rt"
        },
        {
            "content": "I love this series... LOL!",
            "review_date": "2007-09-20",
            "source": "rt"
        },
        {
            "content": "these just got worse with time!",
            "review_date": "2007-09-17",
            "source": "rt"
        },
        {
            "content": "This is the final one right.",
            "review_date": "2007-09-15",
            "source": "rt"
        },
        {
            "content": "WITHOUT STEVE (MAHONEY) THIS MOVIE IS A SHIT",
            "review_date": "2007-09-13",
            "source": "rt"
        },
        {
            "content": "this is one of the better ones",
            "review_date": "2007-09-12",
            "source": "rt"
        },
        {
            "content": "Police Academy 6 - Nobody gives a fuck",
            "review_date": "2007-09-11",
            "source": "rt"
        },
        {
            "content": "No more sequels.\r\nIt got bad after #4.",
            "review_date": "2007-09-10",
            "source": "rt"
        },
        {
            "content": "haha, en av de beste i serien.",
            "review_date": "2007-09-10",
            "source": "rt"
        },
        {
            "content": "I think I watched this like 10 times as a kid. :S",
            "review_date": "2007-09-07",
            "source": "rt"
        }
    ]
}