{
    "rating": 8.7,
    "release_date": "Invalid",
    "num_reviews": 270,
    "genres": [
        "Fantasy",
        "Anime"
    ],
    "summary": "In this entrancing tale by renowned Japanese animator Hiyao Miyazaki, World War I flying ace Marco Pagott mysteriously turns from a man into a pig after all his comrades die in battle. Now known as Porco Rosso, the pilot continues fighting air pirates while, on the ground, flirting with a gorgeous club singer. After an attack by a brash American pilot, Porco meets confident Fio, who repairs his plane with her girl mechanics, and sees him for who he really is.",
    "reviews": [
        {
            "content": "The greatest 1.5 hours of Japanimation ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-13",
            "source": "rt"
        },
        {
            "content": "It's a gorgeously animated and scored movie. Unfortunately, in my opinion, this wonderful presentation cannot elevate aggravating characters and a witless plot that goes haywire with the themes it's trying to bring across. Trying to portray plane warfare as a lively, cute, and family-friendly affair while making numerous references to the effects of war on the population is simply inapt. It's so jarring to see anti-war stances paired with pirates launching grenades into the crowds as a gag. But I suppose they're just kind-hearted oafs. Kidnappers, possibly murderers, but at least they aren't fascists, which would've made them evil, right? Miyazaki loves his dreamers. And Porco might be the only tangible character in this entire movie. Everyone else is a caricature. From the stereotypical tomboy girl boss reenacting the To Kill a Mockingbird scene to an American \"cowboy,\" who wants everything and wants it now, everything in the movie is callow and overly romantic, which some would definitely point out to be the intent. Except we know Miyazaki's other movies (not Howl's Moving Castle) can do these themes and storylines much better.",
            "review_date": "2023-02-09",
            "source": "rt"
        },
        {
            "content": "So great and beautiful",
            "review_date": "2023-01-22",
            "source": "rt"
        },
        {
            "content": "Like any other Hayao Miyazaki film, \"Porco Rosso\" has plenty of charm and imagination. I think the movie has a premise that is definitely unique but the story itself didn't really draw me in. The movie is gorgeously animated and many sequences took my breath away. The scenic nature of a lot of the scenes was what I liked most about this movie. Overall, it is not my personal favorite film from Studio Ghibli, but I still think it is a sweet and well-natured one that I liked enough to check out once.",
            "review_date": "2022-12-26",
            "source": "rt"
        },
        {
            "content": "Makes you want to travel to the Mediterranean ASAP even in a time of war and pirates. Porco is a glutton only for living where a \"better\" man has died and the feast that is this film has me empathetic for the dead.",
            "review_date": "2022-11-30",
            "source": "rt"
        },
        {
            "content": "The spectacle of the dogfights is the real backbone of this film and are done extremely well. There is a lot of detail where you can see Hayao Miyazaki's focus and love of aviation. There are many memorable characters that Porco interacts that further establishes his world. The air of political tensions in Italy before WW2 work to complicate the story and leave an uneasiness in the air that continues until the end of the film. The ending works with the themes of the film and it sends off with a great message at the end of sticking to your morals and the mutual respect or rivals.",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (7.5/10) ; Cinematography (9.5/10) ; Plot (6.5/10) ; Acting (7.5/10) ; Pacing (7.5/10) = 77%}\"",
            "review_date": "2022-09-27",
            "source": "rt"
        },
        {
            "content": "A great film on its own. It's in the mix compared to the other Ghiblis though. The Heaven scene is still one of the most moving scenes in any animated film.",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "Another Ghibli banger!",
            "review_date": "2022-08-17",
            "source": "rt"
        },
        {
            "content": "Esse filme me surpreendeu MUITO, eu não esperava nada, tinha muito preconceito, mas na verdade é muito legal.",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "Sublime rappresentazione cinematografica della illimitata fantasia del maestro Miyazaki.\nNon tra i migliori del regista, ma comunque splendido film di animazione. Il tutto gira intorno alla storia di Marco Pagot\\Porco Rosso, pirata dell'aria, che vive la di fuori degli schemi, al di là del potere costituito. Opera coerente che racconta la libertà, in modo divertente e sfacciato.",
            "review_date": "2022-07-20",
            "source": "rt"
        },
        {
            "content": "I guess this is when pigs fly but also when they stand up against fascism?",
            "review_date": "2022-06-23",
            "source": "rt"
        },
        {
            "content": "I actually thought this was better than most of the Ghibli movies that preceded it. Perhaps it was refreshing that the story was more grounded in reality than the rest, or it was Keaton's excellent voice acting reminding me of a noir detective, or it was the well-animated action sequences, or the nice Rosie the Riveter vibe of the second act, or it just was their solid execution of the three-act story structure with a really perfect introductory scene. The music was more subdued than what suits my tastes but they raised the volume some on the action scenes. The only issue I really had was the subpar southern accent from Elwes, who surprised me with that as I'd thought his German one in Shadow of the Vampire was top-notch!",
            "review_date": "2022-05-11",
            "source": "rt"
        },
        {
            "content": "Charming, romantic, heroic. My favorite Ghibli film but that may be for my strong bias of planes. Strong female roles were quite refreshing to me especially when the movie acknowledges it's bias against women and goes against it.\n\nA tale of redemption for a pilot with wounded honor.",
            "review_date": "2022-01-20",
            "source": "rt"
        },
        {
            "content": "Porco Rosso is an engaging, enjoyable picture with magnificent aircraft action sequences, subtle comedy, and an intriguing drama, especially when it comes to Porco's past as to why he was a pig. Characters like Porco Rosso's (Shûichirô Moriyama) reserved demeanor, Fio's (Akemi Okamura) charisma, and even the villains and supporting characters are so entertaining to watch whenever they appear on screen. Although it lacks the emotional highs and brilliance of other Ghibli films, this is such a fun ride that you forget about the problems while viewing it.",
            "review_date": "2022-01-13",
            "source": "rt"
        },
        {
            "content": "What a strange premise, to make a movie about Italian WWI fighter pilot who at some point in the past has been turned into a walking, talking anthropomorphic pig. But the strangest part of it is that it works, and really, really well at that. I mean, the overall story is great, captivating and humorous, with fully-fleshed, intricate characters (well, some of them, at least) and depth that is rarely found in this kind of family animation. Even some other Ghibli offerings, from the studio known for the depth of their feature productions, do not establish such interesting themes as those that we can find here, from the nature of man or of bravery to the weirdness of late, prolonged love. I especially admire that they decided here not to dwell on the topic of Porko's transformation, but instead glided gently over it, with marvelous grace. I was surprised by how much I liked this movie.",
            "review_date": "2021-11-24",
            "source": "rt"
        },
        {
            "content": "This movie is fucking adorable, y'all. It's an interesting swerve for Studio Ghibli, playing on some noir tropes without losing its heart, fantasy, or political message. I watched the English-dubbed version (I know, please don't chastise me) and although Michael Keaton wasn't the voice I imagined when I first saw pictures from this movie, it grew on me and worked quite well.\n\nThe film makes an effort to tear down some misogynistic attitudes, especially in fields like engineering, and it gets maybe 3/4s of the job done, but for a 1992 film, I suppose that's pretty good. Unfortunately, it back peddles a bit of this by introducing an awkwardly-large-age-gapped relationship involving a girl who is explicitly described as being underage. I think they intended this to feel like a sort of irrational teenage crush, but it made me uncomfortable.\n\nI also wish they would have explored more of the backstory and development of our characters. It's hinted at why Porco is a pig, but although it's arguably the biggest question throughout the movie, it's never directly addressed. And although our characters claim to have gone through some growth and their words somewhat reflect that, their actions still seem to be inline with the flaws they were originally introduced with.\n\nIt lays a LOT of really good groundwork with amazing animations, scores, and concepts. It's also got a clear anti-war and anti-fascist message, with one of my favorite quotes from any movie: \"I'd rather be a pig than a fascist.\" But it all could have led somewhere a whole lot more satisfying. Regardless, this is one of the most unique Studio Ghibli films I've watched and I would have to recommend it.",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "I'm sorry but hard to get into this one at parts. In the beginning I thought it was silly and some of it was, but it did get better. The villains (air pirates) and the American was corny, ending felt unfinished, much left unexplained, sexist, and kind of gross (age diff btw porco n fio). Some of they flying parts were boring. It def was diff I will give it that and I enjoyed the gruff Porco character and the anti-fascism. The older i get the more I identify with characters like him. It was like a studio ghibli leon the prof or sin city but Italian circa 1930s cartoon kinda vibe.",
            "review_date": "2021-10-16",
            "source": "rt"
        },
        {
            "content": "Extremely silly, but in a good way.",
            "review_date": "2021-08-18",
            "source": "rt"
        },
        {
            "content": "Another of Hayao Miyasaki's great films. This one is set in 1930's Italy and revolves around an Italian World War I ex-fighter ace, now living as a freelance bounty hunter chasing \"air pirates\" in the Adriatic Sea. However, an unusual curse has transformed him into an anthropomorphic pig. The animation is, as usual, breathtaking and impressive and the story never disappoints with its distinctive Miyasaki style. A homage to early aviation with amazing flight sequences. Funny humor, romantic, full of heart and well-scored.",
            "review_date": "2021-08-04",
            "source": "rt"
        },
        {
            "content": "Myazaki's renewned use of fantastic elements in a realistic setting, sometimes feels more truthful than \"real\" movies.",
            "review_date": "2021-07-19",
            "source": "rt"
        },
        {
            "content": "It hints at a much better story never told ",
            "review_date": "2021-07-12",
            "source": "rt"
        },
        {
            "content": "What a beautiful film. This is definitely my second favorite Miyazaki film. What an enchanting story and such a love-letter to the films of the second World War. I highly recommend this film!!",
            "review_date": "2021-07-08",
            "source": "rt"
        },
        {
            "content": "In one of Miyazaki's earlier animated films, the central character is the brave pilot Porco Rosso, whose face is turned into a pig's by the curse. He's fighting against pirates in the Adriatic Sea in the 1930s, in the midst of the fascists' rise to power… This movie delighted me with its excellent animation, dialogues and even sharp social comments. There is also a hint of a love story, but as this is Miyazaki, don't expect anything too conventional or predictable. Expect an unusual story, with plenty of humor and you won't be disappointed.",
            "review_date": "2021-05-13",
            "source": "rt"
        },
        {
            "content": "Porco Rosso is, at first glance, confusing. A pig flying a plane isn't what you see every day. Indeed it's true. Every part of the movie is interesting and intriguing. Some characters may not be as enjoyable as others, and the tone of some scenes clashes with others. Nonetheless, the scenery is soothing and beautiful and the flight scenes are eye-catching and keep you glued to the screen.  Why I'm not giving it 5 stars is because there's a problem with Porco: himself. Why is he a pig? We don't know. Either way, this movie is beautiful and soothing, definitely a re-watch",
            "review_date": "2021-04-19",
            "source": "rt"
        },
        {
            "content": "When can a film be cons a masterpiece? This is the question I asked myself before viewing this film. After it was finished, I had my closest answer; a masterpiece is defined not only by it's visual athletics, but by the way it can connect with it's audience. A masterpiece will not just keep its viewers engaged, but it will change them internally and toggle with their mindset and emotions in a beautifully emotional manner. Porco rosso pretty much fits my definition of a masterpiece; the animation is flawless and emersive, the artwork is stunning and abs breathtaking, the story is powerful with strong themes and messages throughout its plot, and the musical score is simply ear caviar; a delicacy for the mind and soul. I absolutely love this film, as it is, to me, a masterpiece. However, it is still not a perfect masterpiece, hence why I am not giving this film a full 5 stars. The ending, or lack there of, is short and feels unfinished. If there were only a few more minutes given to the end to fully wrap up the story, this film would be absolutely perfect. However, even with it's rather abrupt ending, this movies is still a masterpiece, and one of my favorite films made yet.",
            "review_date": "2021-02-20",
            "source": "rt"
        },
        {
            "content": "Marco Polo in the sky. During the time before the WWII, where there were many seaplane pirates, a mysterious ex-air force turned pig pilot Porco Rosso was brave enough to stop them. Now preparing to fight the American's ace, Porco enlists the help of a young mechanic. \n\nThe premise of this movie was very unique, and I had a great time appreciating flying in the sky, and how cool it was. The best part was the main pilot, Porco Rosso. He was badass like a boss, and I enjoyed his witty and snappy sentences. \n\nAs for the historical aspect, the story promoted feminism at the time by showing the women doing the hard work of designing and assembling a seaplane. This is very similar to the situation in the US, where most of the men were in combat while the women were essential in providing resources for the war. \n\nMy issue with the movie was that I wanted more character development to the female characters. Because of this, I was not as much invested in the romance as I wanted to. \n\nOverall, a pretty entertaining historical piece. 7.5/10",
            "review_date": "2021-02-13",
            "source": "rt"
        },
        {
            "content": "With over twenty masterpieces spanning more than a quarter of a century it’s a tall order to decide which is Studio Ghibli’s best film, and no matter which answer you would give you’ll always have another amazingly passionate fan telling you “No, _____ is the best Ghibli film ever made,” and they’re probably not wrong in their reasonings either. But when it comes to the most fun Ghibli movie ever made there is not a doubt in my mind that Porco Rosso takes the cake. With a spectacular plot and beautiful animation as always, this film also offers a rare flair of nostalgia in identifying all the voice actors of your past childhood character favorites such as Beetlejuice, The Dread Pirate Roberts (or Westley if that’s your preference) Jimmy Neutron, Daisy Duck, Robert from Everybody loves Raymond, Megara from Hercules, Captain Gantu and Jumba from Lilo & Stitch, Squilliam, Squidward, Patrick Star AND SpongeBob. It’s also an interesting factoid to know that all of those SpongeBob characters were in this film together seven years before they were any of their famous Nickelodeon characters.",
            "review_date": "2021-02-07",
            "source": "rt"
        },
        {
            "content": "More story than most Ghibli movies, but surprisingly light despite the subject matter.",
            "review_date": "2021-01-10",
            "source": "rt"
        },
        {
            "content": "A portly hero flies into your heart.\n\nHayao Miyazaki's romantic aerial adventure anime Porco Rosso (1992) is a surprisingly pleasant watch from the master director of anime epics. Porco Ross flies by for 94 quick minutes thanks to Hayao Miyazaki and Takeshi Seyama's sharp cuts within dog fights and brief encounters. I never thought I'd see a pig fly outside of a Pink Floyd album cover, but Porco Rosso sends a pig up in the air with stylish fashion and a pretty red plane. Porco Rosso is a cool character, aimlessly surviving life's twists and tragedies by forgetting as the wind hits his face midair. He is a remarkable pig. As Porco says, \"A pig that doesn't fly is just a pig.\" Hayao Miyazaki's direction is as engaging and entertaining as any of his beloved anime pictures.\n\nMiyazaki's writing for Porco Rosso is fascinating as he simultaneously tells the tale of when pigs fly by virtue of an Italian army pilot scarred by the sheer volume of pilots dying around him during the wars, then cursed to appear as a pig. But, as Porco says, \"I'd rather be a pig than a fascist,\" so he remains on the run from Italian Secret Police. It's a charming story that feels like a whimsical animated version of an old film noir complete with a subtle romance between our enigmatic hero and his femme fatale. He balances the mystique of Porco's past and inner longing for love with a narrative about ace pilot Porco Rosso collecting bounties on sea pirates harassing ports and cruises for treasure. I like that Porco befriends his new engineer Fio as well for some added humor and adventure.\n\nPorco Rosso is a wondrous film that once again captures Miyazaki's well established love for aeronautics with his numerous flying machines in a majority of his pictures. Seeing all the phenomenal hand drawn animation from Studio Ghibli for all of Porco Rosso's aerial combat sequence is very impressive with planes weaving in and around one another as bullets shoot everywhere like hail from the bluest skies. Mark Henley and Atsushi Okui's cinematography utilizes heavy amounts of far wide shots to keep your eyes on the action in the air with the occasional close-ups for character emotion translated to the audience. Porco Rosso just looks amazing with these bright reds on the plane and Fio's hair, plush pinks on Porco's pigskin, and lush blues for the ocean seawater.\n\nJoe Hisaishi's score is triumphantly exciting to contribute to Porco Rosso's sweeping epic nature, but also playful for all the comedic bits scattered around like the wind through Fio's hair. Hisaishi's music has long caressed Miyazaki's films with a warm tone and loving gracefulness and Porco Rosso is no exception. Kazutoshi Sato's sound design is excellent with flares of noise for explosions, whirring sounds for bullets just missing planes, and thunderous jolts for plane engines firing off. Katsu Hisamura's production design is beautiful for the oceanside diner, every seaside port, and even Porco's secret cove hideaway.\n\nMichael Keaton's voice is perfect for the pig ace pilot Porco Rosso. His deep voice is serious enough to be believable as an experienced wartime flying pilot. He makes Porco's every word carry weight with Keaton's commanding presence and dark gravitas. I like his pig noises he throws in to ensure Porco is also funny alongside his straightlaced pig pilot persona. Susan Egan is stunningly perfectly cast as Gina. Her sultry voice is full of longing and loss that feels comparable to Keaton's dour Porco Rosso voice acting. I really enjoyed the bright and fiery vocal performance from Kimberly Williams-Paisley as Fio Piccolo. Her perky personality and passionate delivery about plane engineering are convincing as the ever astute optimist Fio.\n\nCary Elwes is excellent as the annoying American antagonist pilot Donald Curtis. He is cocky and sexist enough to be loathsome and an apt opposite to Porco's charming nature. Although, Michael Keaton pulls off Porco's sexist comments about Fio's well, so that he feels likable by the end still. Brad Garrett's sea pirate captain Mamma Aiuto Boss is very funny and expressive. Lastly, David Ogden Stiers is excitable and energetic as Fio's Grandpa Piccolo.\n\nIn all, I simply adored Porco Rosso's cute comedy and playful heart. You can tell that Miyazaki's love of planes and honorable fights scorches Porco Rosso with a heartfelt tenderness like Porco's plane engine exploding.",
            "review_date": "2020-12-25",
            "source": "rt"
        },
        {
            "content": "When humans are inhuman it's better to be pig.",
            "review_date": "2020-12-04",
            "source": "rt"
        },
        {
            "content": "My personal favourite Ghibli... I love this film",
            "review_date": "2020-11-09",
            "source": "rt"
        },
        {
            "content": "One of my favourites from Ghibli. Such a funny, mature and surprisingly deep story about a flying pig. I love every character in this movie! And the animation and Hisaishi's music are top notch.",
            "review_date": "2020-09-13",
            "source": "rt"
        },
        {
            "content": "My least favorite Miyazaki film so far. It still had gorgeous animation but the tone was off. It didn't seem goofy or fun enough to be a kid's movie, while also not being serious enough for a more adult take. It missed the mark for me.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "It has problematic plot points and an unattractive premise, but features impressive and vivid animation, stunning flight sequences, and a thrilling and engaging narrative, but it's far from being among Studio Ghibli's best works.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "Notably less effective than some of Miyazaki's earlier efforts, but still exuding much of his characteristic charm. I think Porco Rosso seems like something of a reduced effort given that it doesn't quite dive into the whimsy as much as previous outings, the world is less original (though beautifully rendered), and the established stakes/\"serious\" elements are less profound. Where this film succeeds brilliantly is through its exploration of flight and aviation - a passion that Miyazaki has integrated into all of his major features, often creating moments of pure cinematic joy. In comparison to other classic Ghibli, Porco Rosso is less than stellar, but it still beats most animation of the '90s on the whole. (4/5)",
            "review_date": "2020-07-08",
            "source": "rt"
        },
        {
            "content": "This movie is an absolute banger and totally slept on. I watched it for the first time recently and it shot straight to the top of my personal ranking of Ghibli movies. The animation is great, the characters are fun and the plot and pacing are stronger than a lot of other Ghibli movies. 1000% recommend to anyone young or old.",
            "review_date": "2020-06-19",
            "source": "rt"
        },
        {
            "content": "Sensei Miyazaki is a gift to humanity and the last stop for us not to turn pigs, yet.",
            "review_date": "2020-04-26",
            "source": "rt"
        },
        {
            "content": "Ho amato notevolmente la prima ora dell'anime; interessante, graficamente notevole e anche originale.\nIl finale invece mi ha lasciato decisamente perplesso, specialmente se confrontato agli altri dello studio Ghibli.",
            "review_date": "2020-04-22",
            "source": "rt"
        },
        {
            "content": "Top 3 animated movies",
            "review_date": "2020-04-07",
            "source": "rt"
        },
        {
            "content": "I was so excited to finally watch this movie but good god this wasn't my thing. I found it to be quite boring and didn't even finish it.",
            "review_date": "2020-03-22",
            "source": "rt"
        },
        {
            "content": "Porco Rosso turns its uniqueness into universal themes and creates a range of peculiar and lovable characters.",
            "review_date": "2020-03-01",
            "source": "rt"
        },
        {
            "content": "While it certainly wasn't terrible, it was the only Ghibli movie to have completely lost my interest during the movie to the point where I stopped paying attention. It's ok but definitely the worst Ghibli movie.",
            "review_date": "2020-02-03",
            "source": "rt"
        },
        {
            "content": "best ghibli movie ever.",
            "review_date": "2020-01-01",
            "source": "rt"
        },
        {
            "content": "Porco Rosso Pros: - Strong Voice Acting - Amazing Directing - Beautiful Animation - Magnificent Cinematography - Great Editing - Brilliant Pacing - Outstanding Musical Score - Decent Screenplay - Fine Story Cons: - Disappointing Climax Overall Grade: A- (9/10)",
            "review_date": "2019-06-22",
            "source": "rt"
        },
        {
            "content": "Fun and romantic, a great adventure and spectacular animation. Loved it.",
            "review_date": "2019-05-12",
            "source": "rt"
        },
        {
            "content": "It started well but then... what happened?",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "While watching Porco Rosso, I felt a lot like the title characterï¿ 1/2\"emotionally detached. Maybe I was expecting too much from this Studio Ghibli film, but I found the humor to be lacking and the animation similar to any Saturday morning cartoon. The plot also felt like it was circling the runway most of the time instead of taking action. With the exception of a few scenes, this is only an average film.",
            "review_date": "2019-03-14",
            "source": "rt"
        },
        {
            "content": "Primo film di Miyazaki che riesce a piacermi? Sono un po' emozionato in effetti. Un bel film alla fine, complice anche il fatto che riesce a non incastrarsi troppo nei canoni orientali del cinema.\noink.",
            "review_date": "2019-02-04",
            "source": "rt"
        },
        {
            "content": "My least favourite Ghibli movie. Great antifascist message, still a miss for me.",
            "review_date": "2018-12-24",
            "source": "rt"
        },
        {
            "content": "A largely overlooked entry in the Hayao Miyazaki catalog, about a wartime fighter pilot (turned bounty hunter) who's been cursed with the face and body of a pig. I'd skipped this one for years because the director deemed it \"foolish\" and, to be honest, it just didn't look all that interesting. You'd think I would know better.\n\nAs with all prime Studio Ghibli entries, it brims and bustles with life, gladly bearing a joyful appreciation for the small things and an admiration for those who seek adventure. Air force captains, sky pirates, lounge owners, engineers... each pursue excitement in their own characteristic ways, which often overlap unexpectedly. Rosso himself is a tough nut to crack, only vaguely alluding to the curse that transformed his appearance and maintaining an emotional distance for much of the story. In some ways, that's refreshing - one might expect the search for a cure to dominate the plot, when that's far from the case - but it also makes him a tricky, and often underwhelming, lead character. His unwanted, self-appointed sidekick, a spunky young designer named Fio, is much more in the mold of the classic Ghibli protagonist.\n\nMiyazaki and company also take special care to hammer out unique identities for each airship in the story, though these do generally take a back seat to their colorful pilots. The director's lifelong ties to avionics (his father was an aeronautical engineer) and his deep-rooted understanding of their natural, graceful motion are almost as clearly evident here as they would be twenty years later, in the more personal The Wind Rises.\n\nVibrant and energetic, stimulating and surprising, this has everything one might expect from the famed Japanese animation house. Perhaps a half-step below their very best, largely due to the reticent lead and an abrupt climax, but still an excellent selection for all ages to share and enjoy.",
            "review_date": "2018-07-24",
            "source": "rt"
        },
        {
            "content": "Vibrantly stunning, filled with wonderful heart and glorious delight, Hayao Miyazaki's triumphant tribute to human flight is a treat for all ages, fueled by pitch-perfect voice work led by the charming voice of Michael Keaton, this is a cinematic experience for the ages.",
            "review_date": "2018-04-12",
            "source": "rt"
        },
        {
            "content": "One of the few Miyazaki films set in the real world. Delivers a fun film full of memorable characters.  contains several interesting metaphors and symbolism as usual for a Miyazaki film.",
            "review_date": "2018-03-18",
            "source": "rt"
        },
        {
            "content": "A huge improvement from Hayao Miyazai's previous work, \"Porco Rosso\" is an exciting, twisted tale about a pig who can fly a plane, and he's good at it too! With fun characters popping out left and right, you can't help but smile and laugh as the story flies along. The story is imaginative, the animation is crisp, and the voice performance from the main cast makes up for the film's third disappointing act. What I mean by that is that when the story finishes, it feels incomplete and unsatisfying. You were hoping for some serious, intense dogfight between the protagonist and antagonist, but instead it falls under the Looney Tunes action sequence were nothing feels serious or rewarding. Nevertheless, there's more positives than negatives, so that's a win in my books.",
            "review_date": "2018-02-12",
            "source": "rt"
        },
        {
            "content": "Porco Rosso is more creative and risky than some of the more childish Miyazaki films and as a result, the movie is a funny, interesting, and, at times, emotional venture whose likable and sympathetic characters make for a fun watch.",
            "review_date": "2017-10-30",
            "source": "rt"
        },
        {
            "content": "Neat story about an Italian war pilot. His not the average war pilot as he is under a curse making him look like a pig. He accepts it, but he does not like it. He is more hidden and is not proud of his looks.\n\nHe got many friends to support him as he still catches bad guys and air pirates. This job is dirty but pays well, so being under the radar and spending money on wine and good food seems fitting for a guy like Porco.\n\nIt looks very good, and it's got a lot of humor, heart and the usual love story. Nice villains and a very cool anti-hero as a main character. \n\nAnother amazing world opened up by Hayao Miyazaki with an ace story, wonderful characters and superb animation. Probably not as \"other world opening\" for children as many other of his films, but this is especially a treat for grown ups. Supercool intro too - multiple languages typed out simoustaniously - even Arabic, backwards compared to the other texts - way cool.\n\n8 out of 10 propellers.",
            "review_date": "2017-08-01",
            "source": "rt"
        },
        {
            "content": "Stunning reminiscent scenes coupled with traces of feminism; Porco Rosso well-captures the spirit of adventurism and heroic virtue.",
            "review_date": "2017-06-27",
            "source": "rt"
        },
        {
            "content": "The 90's for some reason was a wonderful time for animation and in this movie, it shines through. Fucking beautiful animation, so smooth. Those little girls the pirates capture are so cute. They cut the, what would be a very serious situation and tension, into something comedic and lighthearted, I love it. As soon as she said, when you were human, I could already see an interesting backstory forming. \n\nReally cool to see a bounty hunter who's a pig. Watching this movie and really taking it in, I can't help but think how awesome it would be to be able to fly a plane and be able to traverse the sky. The American's plane looks slick. The colors are nice on it.\n\nPorco is awesome. So sly and cool. Porco's got a great friend there. The one in Milan who's in the Air Force. That's a solid friend. Ahhhh! Seeing that flashback of Porco and Gina together was perfect. It put a smile on my face.\n\nThat part with the planes going to heaven was so beautiful and ethereal. Great metaphors in this movie like how Porco, being a pig, doesn't fight for honor, he fights for a paycheck. Sort of like how \"pigs\" in our modern world would act upon. \n\nOverall, another wonderful Miyazaki film with beautiful animation and vibrant colors. The story was told beautifully. There wasn't really any dull or boring moments. It was a very fun and entertaining movie to watch with a good amount of laughs. Loved it!",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "ultra thin with a hazy voice over ending, what?",
            "review_date": "2017-01-03",
            "source": "rt"
        },
        {
            "content": "Porco Rosso lacked the initial character appeal without knowing enough about it, but having watched it finally, I was wrong. This may become my favorite of Ghibli films. It's just as dreamy and fun as a signature Miyazaki, but has a deeper yet not overt touch of melancholy. With an aim more for adults, this movie makes me suddenly nostalgic for the people I didn't know in an era I didn't live in. In a movie that tastes like wine with bullets overhead, a pig certainly did fly.",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "A masterfully directed anime hidden gem. A classic. Ghibli at its best!\n\n9.9/10- So nearly perfect!",
            "review_date": "2016-09-13",
            "source": "rt"
        },
        {
            "content": "Delightfully silly with very serious undertones, including a surprising message about overcoming misogyny in a \"Man's world\".",
            "review_date": "2016-09-02",
            "source": "rt"
        },
        {
            "content": "This movie was fantastic, another great animated movie by this great studio, full of heart & adventure.",
            "review_date": "2016-08-08",
            "source": "rt"
        },
        {
            "content": "Porco Rosso suit deux très bons films de Miyazaki Hayao, Mon Voisin Totoro et Kiki la Petite Sorcière. Heureusement, Porco Rosso est du même acabit, sans pour autant s'encombrer d'une intrigue solide. Suivant l'histoire d'un pilote surdoué italien à tête de cochon, le sixième opus de Miyazaki est une comédie dramatique souvent très drôle et parfois touchante, avec des personnages très bien troussés, une animation à tomber et encore une fois, un score de Joe Hisaishi qui confine à la perfection. Prenant son temps mais ne durant qu'1h30, Porco Rosso fait partie de ces films qui ne racontent pas grand-chose mais le font bien.",
            "review_date": "2016-07-12",
            "source": "rt"
        },
        {
            "content": "A wonderful tale of an Italian pilot that has decided to give up his military duties to be protection for hire against pirates. The voice talent and direction in the film are flawless and the animation is spectacular. While some people may find it a bit too slow to grab them. I found the pacing to be quite good and fits the style of the time that they were in.",
            "review_date": "2016-06-12",
            "source": "rt"
        },
        {
            "content": "I enjoyed this film from master animator Hayao Miyazaki, but I wouldn't consider it one of his best, not even top 5.  The animation is solid, story interesting, and voicework solid, but i just didn't fully connect with it and I had some pacing issues with it.  I did particularly enjoy the voicework of Michael Keaton and Cary Elwes though.  Worth checking out.",
            "review_date": "2016-04-08",
            "source": "rt"
        },
        {
            "content": "It may not reach Miyazaki's precious emotionally-involving heights, but this addition to his repertoire of flying films is nonetheless action-packed, funny, and dazzling with flexible animation; with still a touch of suitable fantasy in it's real-world setting.",
            "review_date": "2016-01-03",
            "source": "rt"
        },
        {
            "content": "Entertaining and a grand adventure.",
            "review_date": "2015-12-26",
            "source": "rt"
        },
        {
            "content": "Of all films that emerged from Hayao Miyazaki's illustrious career, only a few of them are particularly well-known in this country's public consciousness, which is quite sad because some of the lesser known films are brilliant (such as The Cat Returns for example). Porco Rosso, while not as good as some of those films, certainly displays its own unique quality. The film itself calls back to the early days of aviation, which, for me, enters the same territory that would later be explored by Miyazaki's swan song The Wind Rises. Perhaps that's because I saw that movie first. However, there are very stark differences between the two. The Wind Rises had a distinctly romantic view of its subject matter, while this film centres on a decidedly more down-to-earth protagonist. In the film, Porco Rosso is presented as a former ace pilot who shoots down pirates for pay, but he is clearly not without a moral compass. In fact, as the film develops, Porco Rosso develops as a multi-faceted character, and a rather likeable one as well, mainly because in spite of being literally and metaphorically a pig, he doesn't act like one in the strictest sense. The plot is quite well told, and you can get the sense of the interactions with the other characters informing Porco's own perspective. However, I feel that the story ended rather abruptly, as though Porco's story hadn't quite finished yet. Instead, the film closes with one of the other characters narrating from her point of view, and we don't even see those events taking place at all. Also, the film never really explains how the main character was cursed to look a pig, why he was cursed to begin, and how he's supposed to lift that curse. It's hinted at, but with no real explanation. Of course, I may just be nitpicking, but those details matter just as much as the substance does. The characters themselves make the film a lively experience, and they certainly give the film a sense of humour on plenty of occasions. The wonderful thing about it is that it's not too serious, but it's not too comical either. The film also seems to be fond of the empowering picture of women at work, with one of the film's central characters eager to prove herself capable. It seems to be a recurring trend in Miyazaki's films, and I think that sends a very positive message compared to the likes of Disney, whose view of women seems stuck in the Victorian age. For the English dub of the film, they picked a spectacular cast, with Michael Keaton (of Beetlejuice fame) providing the voice of the main character. It's a little unrealistic, but I'll let it slide because his acting in this film is quite magnetic. As finessed as the acting are, we can always count on the skill of the animation team at Studio Ghibli, who take animation and turn it into what might as well be fine art, and this comes into good effect with the stylish dogfights that take place throughout the film. It's no classic, but I think it's a real shame that this film is overlooked so often. It's a wonderful film with real character, and even if there are things you could nitpick at, I could easily look past that, especially because the film actually delivers on the sense of freedom, flight and adventure.",
            "review_date": "2015-12-21",
            "source": "rt"
        },
        {
            "content": "Charming animated film by Miyazaki whose laid back style is both it's greatest strength & weakness.  Miyazaki crafts a fun story with great characters and beautiful flight scenes, but he never adds any real drama to the piece.  There is some gravitas to Porco's past & his curse, along with his relationship to the two females in his life, Gina & Fio (typical Miyazaki, fully fleshed out & independent).  Plus, it does have a nice charm to it, with even the air pirates being more cartoonish than dangerous (even kidnapped school girls aren't afraid of them).  However, it never seems to go anywhere (the film takes place in fascists Italy but never really addresses it) leading to a somewhat anti-climatic ending.  Overall, not the best of the Miyazaki films but by default, still makes it one of the better animated movies ever made.",
            "review_date": "2015-10-05",
            "source": "rt"
        },
        {
            "content": "I really dig that pig.",
            "review_date": "2015-09-20",
            "source": "rt"
        },
        {
            "content": "Loved this film! It had me smiling from beginning to end. ð???",
            "review_date": "2015-09-19",
            "source": "rt"
        },
        {
            "content": "If nothing else, this dreary, uninspired time waster shows the power of slapping a famous name in front of something. Its heart is in the right place, but nothing else.",
            "review_date": "2015-09-03",
            "source": "rt"
        },
        {
            "content": "Most underrated Ghibli movie",
            "review_date": "2015-08-20",
            "source": "rt"
        },
        {
            "content": "Continuing watching the Miyazaki films now we are here. I have to say what a good movie. Loved the whole solo plane guy, also liked the whole post world war 1 era.",
            "review_date": "2015-08-07",
            "source": "rt"
        },
        {
            "content": "It's a light quirky piece but is enhanced by Miyazaki's ever present sentimentality.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "Porco Rosso looks gorgeous and majestic just like other Studio Ghibli's animations. The problem is that the tone of the movie lost at some point.\nIs Porco Rosso worth watching? Sure, it is.\nThe first hour of this film is so lovely and enjoyable because of its creative imagination. Porco Rosso might not be Hayao Miyazaki's best effort but the animation still looks beautiful. Story is simple, enjoyable and straightforward.\nIn the end, I would say Porco Rosso is a delightful fantasy-drama animation about the life of a pilot.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "To sum it up in one sentence: Porco Rosso is a charming and underrated Miyazaki classic.",
            "review_date": "2015-07-06",
            "source": "rt"
        },
        {
            "content": "Miyazaki toma toda su pasión por los hidroaviones, el código de honor de los pilotos y a su usual apoyo al género femenino durante los tiempos antes de la guerra en \"Porco Rosso\" con personajes sumamente carismáticos y divertidos al estilo del gran Studio Ghibli.",
            "review_date": "2015-07-02",
            "source": "rt"
        },
        {
            "content": "best pig movie since babe",
            "review_date": "2015-06-22",
            "source": "rt"
        },
        {
            "content": "\"Porco Rosso\" is a heartfelt and exciting film that  benefits from its creatively designed animation and a story that touches on deep and multi-dimensional themes on identity and feminism.",
            "review_date": "2015-04-18",
            "source": "rt"
        },
        {
            "content": "Entertaining in every sense of the word. Some great dogfight scenes, a fantastic performance from Keaton and the rest of the cast, and very well paced, knowing when to slow down at just he right moments.",
            "review_date": "2015-04-13",
            "source": "rt"
        },
        {
            "content": "My 2-year-old daughter calls this \"the pigs flying movie\", and she's not wrong. In one of Miyazaki's funnier films, we are given a great anti-hero in Porco who is equal parts Humphrey Bogart and Harrison Ford. The tone is light, the adventure is fun and exciting, and the whole thing goes down smooth. Not a bad place to start if you are a Miyazaki virgin.",
            "review_date": "2015-03-24",
            "source": "rt"
        },
        {
            "content": "Insert flying pig joke here. Great movie though.",
            "review_date": "2015-03-17",
            "source": "rt"
        },
        {
            "content": "i liked this film, it was beautifully animated. Miyazaki's films are like bits of nostalgia for me for films i've seen long ago but cannot quite remember. there's a quietness to them and the soft music usually sends my brain to some happier, more carefree time i've forgotten about. it's a nice film, not his best, but i still got that nostalgia from here.",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "Even though this is not Studio Ghibli's best, it is still pretty darn good. I love the characters, the humor, the story, the animation, the atmosphere, even the dub (which my friends hate) I didn't mind. What it lacks in ambition it more than makes up for in charm.",
            "review_date": "2014-12-23",
            "source": "rt"
        },
        {
            "content": "The beauty and the beast like aspect though symbolic is very unnecessary here, however with that said the characters whether layered or simply entertainingly goofy, on top of stunning visuals, and some good action makes this movie worth your time.",
            "review_date": "2014-12-21",
            "source": "rt"
        },
        {
            "content": "filled with such a beautiful details as always",
            "review_date": "2014-12-13",
            "source": "rt"
        },
        {
            "content": "Enjoyable animated movie from Studio Ghibli about a fighter pilot that protects the skies from pirates",
            "review_date": "2014-10-14",
            "source": "rt"
        },
        {
            "content": "What does it say about Hiyazaki that a movie this damn good and beautiful is a bit of a disappointment?",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "What's that woman Gina up to?  I don't get it.",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "It baffles me that I've put this off for so long. It's early classic Miyazaki, don't be dissuaded by the lack of an attractive lead, there's lots of gold here. This movie sure is a winner.",
            "review_date": "2014-09-15",
            "source": "rt"
        },
        {
            "content": "This movie makes you want to go into this world and live the live of the characters. The world it builds fills you with charm, delight, and adventure.",
            "review_date": "2014-09-14",
            "source": "rt"
        },
        {
            "content": "Review In A Nutshell:\n\nThough I intend to watch all of Studio Ghibli's films, I am aware that not every single one of their films would appeal to me. I thought Porco Rosso was that film. Man was I wrong! If there was a single word to describe this film, it would be fun. I had such a great time watching this, similar to the experience I had with Howl's Moving Castle, but the film does have some flaws that prevent me from bumping my score higher.\n\nPorco Rosso is less about its story and more about its titular character and the journey he goes through. The film doesn't set itself with a goal that our character has to achieve but instead gives us more of a diary entry type of story. We are simply watching a stage of this character's life and the sudden complications that suddenly dawned on him during this time. Of course being great cinema, Hayao Miyazaki, the film's writer and director, gives the film a sense of purpose but the characters of the film aren't aware of it. Miyazaki allows the film's revelations to appear naturally and not interfere too much with the characters, which I personally loved as it allowed me to just simply watch this with very little thinking effort and yet I was still able to pick up some significant elements along the way. Porco Rosso is not as subtle in its metaphor as say, Spirited Away or My Neighbour Totoro, but I was completely fine with it as what Miyazaki delivered in its surface was entertaining enough that even if it was symbolically empty, I would have still had a great time with this.\n\nThe film's highlight is certainly its central protagonist as he is the only element in this film that slightly goes outside of reality. Miyazaki uses the film's fantasy as a metaphor for the true-to-life unappealing qualities of men; greedy, egotistic, condescending and sexist. Miyazaki doesn't makes all of these qualities stand itself out through a big giant scene like many films that contains the same type of protagonist, he instead sprinkles his personality evenly throughout the film, subtly reminding us that though he is a talented and cool character, he sometimes can be an ass. In creating this character, it seems that Miyazaki has taken influences to the typical characters found in the Golden Age of Hollywood films; or a more contemporary reference would be Han Solo from the Star Wars trilogy. I was able to have fun with this film as I enjoy watching characters with rude personalities, even if they don't let themselves be redeemed in the end. Though most of the film covers Porco Rosso, Miyazaki still gives the film enough time to cover other characters. I was particularly impressed with the film's female lead, Fio, as she is just so damn charming with her idealistic and virtuous values. Watching Fio and Porco exchange dialogue was probably the best parts about this film as their difference in personalities were used in such a constructive way by allowing development for both characters.\n\nMy issue with this film lies in the climax as it starts off strong with its plane conflict and high stakes but transitions to a more intimate and physical direction that felt really out of place. The only thing I could commend it for was the laughs it produced. It may not frustrate me as much during subsequent viewings but for now, I couldn't help but feel a little disappointed.\n\nPorco Rosso is certainly a more grounded film in comparison to Miyazaki's other works and it is certainly far from his best work but it still possesses his trademark charm that allow it to be a worthy entry by the studio and director.",
            "review_date": "2014-09-10",
            "source": "rt"
        },
        {
            "content": "Review In A Nutshell:\n\nThough I intend to watch all of Studio Ghibli's films, I am aware that not every single one of their films would appeal to me. I thought Porco Rosso was that film. Man was I wrong! If there was a single word to describe this film, it would be fun. I had such a great time watching this, similar to the experience I had with Howl's Moving Castle, but the film does have some flaws that prevent me from bumping my score higher.\n\nPorco Rosso is less about its story and more about its titular character and the journey he goes through. The film doesn't set itself with a goal that our character has to achieve but instead gives us more of a diary entry type of story. We are simply watching a stage of this character's life and the sudden complications that suddenly dawned on him during this time. Of course being great cinema, Hayao Miyazaki, the film's writer and director, gives the film a sense of purpose but the characters of the film aren't aware of it. Miyazaki allows the film's revelations to appear naturally and not interfere too much with the characters, which I personally loved as it allowed me to just simply watch this with very little thinking effort and yet I was still able to pick up some significant elements along the way. Porco Rosso is not as subtle in its metaphor as say, Spirited Away or My Neighbour Totoro, but I was completely fine with it as what Miyazaki delivered in its surface was entertaining enough that even if it was symbolically empty, I would have still had a great time with this.\n\nThe film's highlight is certainly its central protagonist as he is the only element in this film that slightly goes outside of reality. Miyazaki uses the film's fantasy as a metaphor for the true-to-life unappealing qualities of men; greedy, egotistic, condescending and sexist. Miyazaki doesn't makes all of these qualities stand itself out through a big giant scene like many films that contains the same type of protagonist, he instead sprinkles his personality evenly throughout the film, subtly reminding us that though he is a talented and cool character, he sometimes can be an ass. In creating this character, it seems that Miyazaki has taken influences to the typical characters found in the Golden Age of Hollywood films; or a more contemporary reference would be Han Solo from the Star Wars trilogy. I was able to have fun with this film as I enjoy watching characters with rude personalities, even if they don't let themselves be redeemed in the end. Though most of the film covers Porco Rosso, Miyazaki still gives the film enough time to cover other characters. I was particularly impressed with the film's female lead, Fio, as she is just so damn charming with her idealistic and virtuous values. Watching Fio and Porco exchange dialogue was probably the best parts about this film as their difference in personalities were used in such a constructive way by allowing development for both characters.\n\nMy issue with this film lies in the climax as it starts off strong with its plane conflict and high stakes but transitions to a more intimate and physical direction that felt really out of place. The only thing I could commend it for was the laughs it produced. It may not frustrate me as much during subsequent viewings but for now, I couldn't help but feel a little disappointed.\n\nPorco Rosso is certainly a more grounded film in comparison to Miyazaki's other works and it is certainly far from his best work but it still possesses his trademark charm that allow it to be a worthy entry by the studio and director.",
            "review_date": "2014-09-10",
            "source": "rt"
        },
        {
            "content": "Miyazaki's most underrated and under acknowledged film. This is Miyazaki beginning his peak with wonderful writing, story telling, imagery, and characters. One of my all time favorite movies, and one of the three that make up my \"God\" tier of animated features.",
            "review_date": "2014-08-08",
            "source": "rt"
        },
        {
            "content": "A lighthearted treat, fun and engaging throughout. Has Miyazaki's signature curiosity and some strong themes.",
            "review_date": "2014-07-26",
            "source": "rt"
        },
        {
            "content": "13. Porco Rosso\n\nAll things considered, Porco Rosso is fairly cheesy. Its lesson-less execution relies heavily on energetic action-packed sequences and in that regard, is impossible to work out just who the target audience is supposed to be. But even when considering these flaws, the thrill is carried by the main character alone, Porco himself. Once an Italian World War fighter ace, now a freelance bounty hunter, Porco lives on a desert island awaiting contract jobs to chase air pirates, all the while having to deal with a pesky curse which has transformed him into an anthropomorphic pig. Surreal enough for you? But even if this spell is never explained, Porco is hardly ashamed of his disfigurement-on the contrary, he works with it, maintaining just enough charisma and smugness to keep the ladies falling head over heels for him, and his reputation badass. It may be an exercise in indulging Miyazaki's obsessions (feminist ideals, anti-fascist undertones, aviation overload) but nothing detracts from the overall sense of humour which rides high right until the very end where questions are left unanswered and talks of a sequel have run wild ever since. When pigs fly though, am I right, guys? \n\nTo read the rest of my 'Worst to Best: Studio Ghibli' list, click here: http://juicenothing.blogspot.co.uk/2014/06/worst-to-best-studio-ghibli.html",
            "review_date": "2014-06-25",
            "source": "rt"
        },
        {
            "content": "great movie. I just love all films from this studio.",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "Great movie with great animations. I loved the characters and their personalities as well (Miyazaki manages to make every character, even the antagonists, seem human and likeable). The movie seemed to be unexpectedly short, though, with only a few minutes given to any explanation of how Porco is, well, a pig, and I got almost no closure from the end. But, what else can you expect - This isn't Hollywood where every ending is clear-cut, romantic, and perfect! Overall, great movie though - I just liked how it was done, though the plot could be worked on.",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "It has less metaphor than some of Miyazaki's film, and I don't really get what Miyazaki tried to say in this film, but Porco Rosso reminds us that watching films aren't always about finding answer.",
            "review_date": "2014-05-29",
            "source": "rt"
        },
        {
            "content": "Despite a somewhat underwhelming ending, Miyazaki's high flying yarn is still a barrel of old fashioned matinee fun. Great animation, great music, great voice work, great action setpieces for an animated film, it's just all lovely.",
            "review_date": "2014-05-27",
            "source": "rt"
        },
        {
            "content": "The animation is great as always, but this film lacks the enjoyment, creativity, and themes of Miyazaki's other films. Probably my least favorite of his films.",
            "review_date": "2014-05-26",
            "source": "rt"
        },
        {
            "content": "Full review later...",
            "review_date": "2014-05-23",
            "source": "rt"
        },
        {
            "content": "Along with The Castle of Cagliostro, this is easily Miyazaki's funniest film and it's one of his most underrated films. It's in my top 5 Miyazaki list. I love it!",
            "review_date": "2014-05-17",
            "source": "rt"
        },
        {
            "content": "This film is incredible.\nMiyazaki captured the romantic spirit of the Adriatic air-pirates in a way that I've never seen elsewhere.\n\nThe mythical nature of porco as a pig, with a controversial background and a mysterious curse, is also indelible.\n\nThe only \"professional critic\" who gave this a \"rotten\" review also gave all of Miyazaki's other works the same rotten tomato. Clearly the guy just doesn't get it.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "bought it, loved it, gonna cosplay it!",
            "review_date": "2014-04-28",
            "source": "rt"
        },
        {
            "content": "Very fun and entertaining",
            "review_date": "2014-04-25",
            "source": "rt"
        },
        {
            "content": "\"If you make money from war, you're scum. If you can't make money from bounty hunting, you're an idiot!\"",
            "review_date": "2014-04-13",
            "source": "rt"
        },
        {
            "content": "I at first wrote this film off as really boring with its premise--airplanes shooting each other during or after WWI, but as with most Studio Ghibli films, they masterfully render a great story among the historical background with lots of character-building dialogue and animation that's filled with attention to detail, like the wings shining against the sunlight, or just how the characters and even things like an engine being test run move beautifully.",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "I like PORCO ROSSO more every time I see it. It's a rousing nostalgic adventure tale, beautifully and vigourously animated. It's a frothy adventure though, that carries within themes of identity, devotion, honor, integrity, and strength of character.",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "Stills holds up even after 22 years.",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "One of Miyazaki's weaker efforts, but it's still an above-average flick. It's just that the themes don't quite gel together, and the movie sags in places.",
            "review_date": "2014-03-15",
            "source": "rt"
        },
        {
            "content": "Porco-Rosso is a beautiful underrated Miyazaki movie. Still the master animator has reached greater heights both before and since.",
            "review_date": "2014-03-14",
            "source": "rt"
        },
        {
            "content": "una perla nel meraviglioso mondo del grande Maestro Miyazaki",
            "review_date": "2014-03-13",
            "source": "rt"
        },
        {
            "content": "Another lovely Miyazaki movie.",
            "review_date": "2014-03-01",
            "source": "rt"
        },
        {
            "content": "A masterful anime that surprised me with its themes, attention to detail and humor. It's worth watching, in fact any anime fan should give this a viewing.",
            "review_date": "2014-02-26",
            "source": "rt"
        },
        {
            "content": "A strange, but good Miyazaki flick. We never really know why the main character turned into a pig and that was one thing that bothered me. It's silly and fun and has a lot of cool flying sequences. \n\nGrade: B-",
            "review_date": "2014-02-20",
            "source": "rt"
        },
        {
            "content": "So pigs really can fly :P. So much for the saying, \"When Pigs Fly\"!",
            "review_date": "2014-01-31",
            "source": "rt"
        },
        {
            "content": "The far more lesser known film from Hayao Miyazaki but is a more adult/complicated character & film for that matter.\n\nBasically the story of a retired WWI sea planer gone bounty hunter for Italian Sea Pirates...but he is a pig.\n\nDespite Porco Rosso physical appearance he is a well drawn out character that goes on a interesting journey. He befriends a young passionate engineer that helps him grow. It's a simple that is very different to his previous and after works.",
            "review_date": "2014-01-20",
            "source": "rt"
        },
        {
            "content": "A cool story that features one of Miyazaki's most interesting and enigmatic characters.",
            "review_date": "2014-01-10",
            "source": "rt"
        },
        {
            "content": "The funniest Miyazaki film. I didn't expect this movie to as hilarious as it was; Miyazaki has done many genres and while not all of them are totally serious and dramatic, none of them were straight comedy either. Porco Rosso is comedy before an action/adventure flick and it knows this; it never takes itself too seriously. There are a dozen pig puns, lots of goofy characters, and plenty of comical moments but when the film takes time to be a little more dramatic, it does it with flying colors. This is something I'd like to see in films more, the comedy is almost over the top but the drama is just the right amount to get you to be invested in the character. Another thing I like about this film is there is no bad guy, no antagonist, no one that has to be defeated; sure there conflicts between people but nothing was too serious. Even in the scenes where someone could've died you knew nobody was going to actually die; if anyone did something that seemed unfair or mean, it was just part of business, it was just people going through life. Maybe I'm looking to deep into this but that's just what I got from the film and I'm sure a lot of people will interpret it another way but one thing we can all agree on is Porco Rosso is another Miyazaki legend.",
            "review_date": "2014-01-10",
            "source": "rt"
        },
        {
            "content": "tremendous visuals and a story that subtly touches on so many social matters today such as gender equality, faith in humanity and love .",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "If you were to ask me for a list of 5 words that describe Hayao Miyazaki, the word \"pretentious\" would definitely make the list. Up to this point, every single one of his movies (that I've seen) has been so self-serious, so ostentatious, and so self-assuredly brilliant. Which isn't inherently bad. I mean, I did like Castle in the Sky, and I loved Princess Mononoke. Until Porco Rosso. With this movie, Miyazaki isn't shooting to be the smartest guy in the room. He's not shooting to make the most deep and thought provoking movie. No, he's simply trying to make a movie about a sardonic, condescending, and sassy swine. And he does a surprisingly good job of doing it! Princess Mononoke still remains Miyazaki's most well made movie, but at the end of the day, Porco Rosso might be my favorite of his. In a vacuum, it's still number two. But I can't lie, I really liked this movie!\r\n\r\nThe story follows the rivalry between Porco Rosso (\"The Crimson Pig!\") and Donald Curtis, a high-flying American pilot. After Porco lives to be the only survivor of a dogfight, he is cursed into being a human pig. He continues to fly, and eventually runs into Curtis. Porco looses this first round, but with the help of some unlikely friends, fixes up his plane and sets out for a rematch.\r\n\r\nI love the setting of the story. It takes place between the first and second world wars, so it really has that \"40s movie\" flair! I can't help but like an animated movie with biplanes! Like I mentioned at the beginning of the review, the whole thing is a lot less pretentious than Miyazaki's other work. Number one, it clocks in at around an hour and a half. Usually, these Miyazaki movies drag on and on, but I didn't get that feeling from Porco Rosso. Plus there aren't any deep attempts to rock your world with with heavy handed \"save the trees\" moments. Some would negatively call it Miyazaki's least ambitious effort, but I don't see this as a bad thing at all. In fact, the movie's relatively concise execution is a huge plus in my eyes.\r\n\r\nAnother thing I love about this movie is that it doesn't take the classic route of making the main character all conflicted by his physical deformity. This movie could have very easily been about Porco struggling with his outer (and inner) pig, but that's not what the movie is going for. Porco just accepts the truth that he's a pig. He's not emotional about it. In fact, he's kind of smug about the whole thing! Porco really gives Ashitaka (from Princess Mononoke) a run for his money when it comes to best main character in a Miyazaki movie.\r\n\r\nThe main drawback to this movie is the last 10 minutes. After the climatic dogfight between Curtis and Porco peters out, they have a really dumb and slap-stick-y fist fight. Oh if only the movie had ended with the dogfight! I was more than willing and ready to crown this the best Miyazaki movie I have seen, but then this scene happens... Still, considering my track record with this filmmaker, one complaint seems rather petty.\r\n\r\nLike all the other Miyazaki films, everything on the production side of things is very well done. The animation is excellent. The musical score by Joe Hisaishi isn't up to par with his best work, but it certainly isn't bad. I can't really comment on the vocal performances, because I only watched the English subtitled version. But on a whole, the production is very solid.\r\n\r\nI was a little more than pleasantly surprised by this movie! Who knew that the second best Ghibli movie I've seen would be about a fighter pilot ... pig. I don't know, just thinking about the movie brings a smile to my face! With a simple plot, excellent main character, fun setting, uncharacteristically unpretentious storytelling, and a surprisingly satisfying ending; Porco Rosso marks the first time I've been genuinely (and happily) surprised by a Miyazaki/Ghibli movie!\r\n\r\n\"A pig's gotta fly.\" 8/10",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "When I read the premise I didn't think this would be my cup of tea but I was surprised as I did really enjoy it. I really enjoyed the feminism and questions of morality and identity, even if it did actually get a bit cheesy at times, and it was a reasonably entertaining yarn with plenty of the bizarre woven in. I found it lacked the depth and magical nature of some of Miyazaki's others and the relationship between Porco and Fio was especially questionable, as many of the central relationships in his film's often tend to be. I feel I never fully connected with any of the main characters and yet I still related to it's themes and enjoyed the plot so it must have been doing something right!",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Takes you masterfully back to a never existent time--Great story, wonderful characters, fantastic animation!!",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "Miyazaki may know nothing about aircraft design, but he knows how to tell a good story.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "Se sale del estilo de miyasaki",
            "review_date": "2013-12-31",
            "source": "rt"
        },
        {
            "content": "Among Miyazaki's classic films, this may not be the best, yet it's the most unique.",
            "review_date": "2013-12-06",
            "source": "rt"
        },
        {
            "content": "1940's Fantasia Is My Tenth Favorite Film.",
            "review_date": "2013-12-05",
            "source": "rt"
        },
        {
            "content": "Of the films that Miyazaki aimed at adults this one is superb and captures the things that Miyazaki does best. A solid story, natural dialog, stunningly beautiful scenery and memorable characters. The fantastic plays a much smaller role than in other films, Porco's porcine predicament is understated and that's the only nod in the direction of the fantastic. Other than that the story revolves around early planes and their pilots, war and piracy, honor and love. A very good movie. Porco: \"I'm a pig. I don't fight for honor. I fight for a paycheck.\"",
            "review_date": "2013-11-29",
            "source": "rt"
        },
        {
            "content": "Its a bird! Its a plane! No! Its a masterpiece!",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "Miyazaki's films of have the ability to seem absolutely unique yet ordinary at the same time. Porco Rosso is perhaps the most clear-cut example of this that I have seen so far. It contains the requisite humour and warmth without really stretching the boundaries of his own comfort zone.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "Miyazaki indulges himself in his passion for seaplanes with this very enjoyable project of most personal interest, an always entertaining film that benefits from a beautiful soundtrack, a spot-on sense of humor and, even better, a lot of heart.",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "awesome movie right here.",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "Does anyone ever need to say more than, Miyazaki ?",
            "review_date": "2013-11-04",
            "source": "rt"
        },
        {
            "content": "An animation film aimed at adults. This tale was so fun to watch, Porco was a delight. Hayao Miyazaki's world are so beautifully drawn you can get lost in them and the story is so good it's always an entertaining ride.",
            "review_date": "2013-10-16",
            "source": "rt"
        },
        {
            "content": "Easily the most underrated (or at least overlooked) of all the Miyazaki movies. It's kind of hard to explain, but the characters are very likable, the action scenes are quite enthralling, and there is a good amount of (but not overdone) charming romance thrown in there. It's just beautiful.",
            "review_date": "2013-10-05",
            "source": "rt"
        },
        {
            "content": "ONE OF MY FAVOURITE GHIBLI FILMS.\n\nGenius.",
            "review_date": "2013-09-28",
            "source": "rt"
        },
        {
            "content": "Beautiful. Wonderfully entertaining. And of course, kick ass",
            "review_date": "2013-09-27",
            "source": "rt"
        },
        {
            "content": "This is indeed a charming film from Hayao Miyazaki, especially since this is one out of two of his films that has a main protagonist that is a male character. It's funny for it's plot-driven moments, and enjoyable as expected from Studio Ghibli.",
            "review_date": "2013-09-20",
            "source": "rt"
        },
        {
            "content": "Miyazaki steps outside his normal movie themes and tries something new with Porco Rosso.  It does contain other Miyazaki cliches like having a flying sequence and the presence of a pig, but it feels fun and inventive.  The movie has a somber tone while also having a humorous side to it which does balance the movie very well.",
            "review_date": "2013-09-16",
            "source": "rt"
        },
        {
            "content": "Mas um eterno clássico do mestre Hayao Miyazaki.",
            "review_date": "2013-09-14",
            "source": "rt"
        },
        {
            "content": "Beautiful and touching",
            "review_date": "2013-09-12",
            "source": "rt"
        },
        {
            "content": "Great Ghibli kid movie!",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "Great, one of the best movies ever made.",
            "review_date": "2013-08-20",
            "source": "rt"
        },
        {
            "content": "Usually, I wouldn't bash Miyazaki's works, but Porco Rosso, is surely one of those films that gets a little bit of a bash. What I mean by this is that it is one of those films that looks like it's a good movie, but then you realize just how fortunate you are to that what you are watching which is simply OK, it's not bad it's not good, it's just OK.\n\nSo we have an air bounty hunter named Porco Rosso, who for some reason has a face of a pig, where he got this form, it'll be explained in later of the movie, but, I can't spoil it for you. He's a bounty hunter living in Italy, trying to make the best out of life that he could use. There isn't much sort of a plot per se, again one of those, \"mid-life crisis\". There are characters that seem important but they are a little bit forgettable. And, well yeah, I'm going to have to address the elephant in the room; I think the animation is a little poor.\n\nI mean give it a little credit that they at least tried to bring something new to the table, but, the animation can be a little bit choppy, I'm mean it's not terrible, but there are Ghibli films that have better animation than that, for example, Castle in the Sky, you could point out the every single character's lip movement. And here when they laugh or show a different emotion, all them seem to do is jump-edit the laugh. I don't know if Japan was going through an economic crisis at that point, or maybe that's the best that they could get, but, yeah the animation, not really a fan.\n\nIs there a difference between the dubs? Not necessarily, they are kind of the same. The only differences that I could make out was that you got Michael Keaton as Porco Rosso, Cary Elwes, (the guy who played Westley in The Princess Bride), Meg from Hercules, that other guy from Everybody Loves Raymond. I mean I have to say that this is probably not one of the best choices of voice actors and I thought that they could get someone a little bit better, but, yeah. I think this is not one of the best choices of actors. \n\nBelieve it or not, I like the comedy. The comedy hits its mark spot on. I mean you have an anthropomorphic pig who knows that he's selfish, destructive air pirates, a cocky movie star, a girl who tries to prove a point, and believe it or not, the comedy is probably the best part if not the only part of the movie that is likable.  There are a few things that don't work, but, for the most part it works pretty well.\n\nThe way they use planes is pretty good, not the best flight sequences I've seen, trust me there are better, their OK though.\n\nI was actually getting into the music, I mean you have Joe Hisaishi doing the score again, and there are a few memorable tunes, but, they quickly get slow as the movie slows down and in the end picks up the pace again. It's not memorable, but at least it's pretty good.\n\nI bashed this movie long enough, and, I think the movie for the most part is fun. Just fun. I mean it has something for adults to enjoy, I'm not exactly sure if kids could understand it, but for the most part these are one of the films that I would just throw into the OK category.\n\nIf you're still interested check it out, and if you're not, then skip it. That's all I can say for this film.\n\nMore Ghibli Month is coming your way, stay tuned for the next review tomorrow!",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "More movies need to be like this.",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "\"Porco Rosso\" is the best Miyazaki film, and that's saying a lot. It's got a masterful script, a shit-ton of beautiful shots, a touch of old-time homage, and it somehow lives up to the magic of the rest of the Miyazaki filmography without a speck of supernaturalism other than its down-to-Earth, cursed protagonist. Not to mention, it's got wit sharper than Ashitaka's arrows: \"Heavenly Father, we give you thanks for putting bread on our table, and for giving us work when we were on the brink of bankruptcy. And please forgive us for building a fighter plane with the hands of women\".",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "I absolutely love this film's premise: a pig who is a seaplane pilot. And while it isn't entirely interesting to start of with, Porco Rosso does eventually turn out to be a marvellous, very entertaining film.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "Hayao Miyazaki swiftly fuses imagination with real history, alongside lovable characters and a sharp storyline. Porco Rosso is easily one of Studio Ghibli's most underrated works",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "It still has that enigmatic feeling of nostalgia and childhood happiness that is present in almost all of Miyazaki's movies, but the character development and the narrative aspect of \"Porco Rosso\" sort of vanish as the story progresses.",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "Miyazaki's loving tribute to early aviation. The story is more male-oriented, straightforward, and based in reality (set between the two World Wars) than some of his other works, but still retains that vintage Miyazaki magical feel that we all know and love. The title anthropomorphic pig (who ladies strangely fawn over) and his sidekick, a young mechanic girl named Fio, make for a greatly fun duo and play off each other nicely. Miyazaki really demonstrates his love for planes and there is a breathtaking fantasy sequence involving a fleet of planes flying above the clouds that alone makes the film worth a one-time viewing. It's not as profound as some of his other works like 'Spirited Away' but it still works wonderfully as a nice undemanding action/adventure, although it is admittedly far from his best work. The first hour of the film was excellent but the climax was pretty weak (sinfully teasing at an epic airplane fleet battle that never takes place) and the closing epilogue narration felt extremely rushed (also contains a gimmicky \"The end?\" line that you'd think Miyazaki would be above at doing). Despite a weak ending, 'Porco Rosso' remains a quality effort from the master himself.",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "What a brilliant piece of filmmaking by director and animator extraordinaire Hayao Miyazaki, in which our hero, Porco Rosso, makes his living by defending the good citizens of cruise ships against air pirates.  The score is quite brilliant and the story is both affectionate and thrilling.  Every attention to detail has been made in the making of this film.  Initially I had qualms about going to see a cartoon movie, but they were dispelled in the first five minutes.  The early scene of the taking hostage of a party of Japanese schoolchildren is quite hilarious.",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "Miyazaki's wonderfully fluid animated feature Porco Rosso is a thoughtful look at a jaded fighter pilot and his (reluctant) quest to self-betterment that serves as an excellent metaphor for the positive/negative effect people can have on our lives and the importance of understanding how our experiences shape our personality.",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "Miyazaki's three central motifs (anti-war, environmentalism, and strong female characters) appear in nearly every one of his movies. But his true talent lies in his ability to craft original and captivating stories around the foundation of these themes.",
            "review_date": "2013-06-13",
            "source": "rt"
        },
        {
            "content": "Not the best, but there's something specially charming about this film, even if it's not as childish as other by Ghibli.",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "Esta mucho mejor de lo que me esperaba, muy buena! aunque Miyasaki tiene mejores películas",
            "review_date": "2013-05-02",
            "source": "rt"
        },
        {
            "content": "It has the filling of being a 4-star. But thanks to some moments with a heartening spirit, the humor, and the coolness Michael Keaton brought to his titular character, the greatness of \"Porco Rosso\" soared Ghibli back to the 4.5-star run, despite the limited storyline when there's a plead for more. Another wonderful storytelling that's entertaining, smart, funny and cool with sweetness and some little, acceptable silliness. (A)\n\n(Full review coming soon)",
            "review_date": "2013-04-25",
            "source": "rt"
        },
        {
            "content": "A pig pilot joins forces with a young female mechanic, flies around for a bit and has a bit of a scuffle with an American. Genius from Miyazaki as always.",
            "review_date": "2013-04-17",
            "source": "rt"
        },
        {
            "content": "A departure from past Miyazaki themes with adult leads, more action and nostalgia for classic Hollywood.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "Awesome movie loved it",
            "review_date": "2013-04-04",
            "source": "rt"
        },
        {
            "content": "While it's not as memorable as Miyazaki's other work, that doesn't make Porco Rosso any less of a fun film with an enjoyable and imaginative story, fun characters and one of the most underrated soundtracks to a Studio Ghibli picture; and props to Michael Keaton's strong performance in the English dub. While the story does get drug down a little bit by the third act and the fact that some aspects aren't really explained all that well, Porco Rosso is still definitely worth your time if your a fan of Miyazaki films or simply animation in general.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "Even though its one of Miyazaki's weaker stories, it's still trumps anything Disney's put in the last few years.  And no I don't consider this or any other studio ghibli film Disney, even though they have the rights to release the films in NA.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "Cinderella in a biplane.",
            "review_date": "2013-03-20",
            "source": "rt"
        },
        {
            "content": "Nothing amazing, but very fun.",
            "review_date": "2013-03-05",
            "source": "rt"
        },
        {
            "content": "Obra maestra. Y no miento cuando hablo de aviones... :-DDDD",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "An absolute gem of a film.. The animation is dazzling as per usual when it comes to Studio Ghibli.. The story itself is very lighthearted and I can't help but smile and laugh while watching it. However, even with that being said, there is some spectacular character development in Porco Rosso that you might not expect in such a playful film. This is something that I think a lot of animated films lack, and even a lot of live action films lack as well, but even amidst the playful atmosphere of this film, there are clearly serious and tangible themes that really hit home for me and made me appreciate the characters and the gravity of the story even more! This film has an almost perfect balance of humor, action, and raw emotion all intertwined with a magnificent story; it's definitely one of my favorite animated films.",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "Definitely one of Miyazaki's films that are more fit for adults, but that doesn't at all mean it's bad. I had a lot of fun watching Porco Rosso. It was intense, engaging, fun, funny, and full of heart. I hear that Miyazaki actually wants to do a sequel, and...yeah, I can see that. The ending did open up for one.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "So absurd - but completely amazing and enjoyable.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "The weakest of Miyazaki's work.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "To be honest, good anime but weird",
            "review_date": "2013-01-21",
            "source": "rt"
        },
        {
            "content": "Picturesquely animated magical realism that brims from start to end with empowered females and whip-smart dialogue.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "I liked this one better than most of Miyazaki's movies, Porco Rosso isn't great nor is it as beautiful, the the script is excellent.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "Semplicemente eccellente!\nAmazing!",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "Miyazaki turns whatever he touches into gold. This is a fantastic movie abut a flying boat pilot in the early twentieth century.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "Wow, what an under-rated Miyazaki.  I've always seen far less publicity for it, yet it is just as excellent or even better than many of the other Miyazaki films.  I was pleasantly surprised.",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "This has some problems, but it's still loads better than the average animated movie. A lot of fun, but one of Miyazaki's lesser films.",
            "review_date": "2012-12-21",
            "source": "rt"
        },
        {
            "content": "Aviation, salmon, wine and porcine hero",
            "review_date": "2012-12-17",
            "source": "rt"
        },
        {
            "content": "As a lover of animated films this one has to be one of my favorites. Porco Rosso is a comical story of love and life lessons. Nothing less to be expected from Hayao Misaki and Studio Gibley.",
            "review_date": "2012-12-04",
            "source": "rt"
        },
        {
            "content": "Words can't describe how much I love this film. Anime fans must watch it and it's a great film to show kids.",
            "review_date": "2012-12-01",
            "source": "rt"
        },
        {
            "content": "A masterpiece in the animation genre, very mature. Porco Rosso is a great tribute to aviation filled with nostalgia. It took me back to Corto Maltese's adventures. Hayao Miyazaki's best film alongside Spirited Away. A must see.",
            "review_date": "2012-11-29",
            "source": "rt"
        },
        {
            "content": "My favorite Hayao Miyazaki film as of late!  Porco Rosso is definitely not to be missed by fans and is nearly as entertaining and endearing for children as it is for adults!  Just kidding!  Unless your kids are complete brats they will be decently entertained.  Just don't let them notice how much you are enjoying it.  Once again Miyazaki manages to craft a story that is innocent yet poignant, magical yet based squarely in reality and beautifully realized.",
            "review_date": "2012-11-24",
            "source": "rt"
        },
        {
            "content": "I liked it, but it wasn't as good as his other films.",
            "review_date": "2012-11-23",
            "source": "rt"
        },
        {
            "content": "One of my Miyazaki favourites!",
            "review_date": "2012-11-17",
            "source": "rt"
        },
        {
            "content": "While not the most ambitious of Miyazaki's works, Porco Rosso is a loving tribute to aviation and all of Miyazaki's passion for the subject matter shines through with lovingly creative scenarios, memorable and endearing characters and in my opinion one of the most stunningly beautiful portrayals of Italy on film.",
            "review_date": "2012-11-02",
            "source": "rt"
        },
        {
            "content": "I would like to see this movie once again with an alternate ending, and maybe a bit of a different setting.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "Siguiendo con mi ciclo de animación, sigue en turno Hayao Miyazaki y su magistral film titulado Porco rosso. Si Iron Giant era una genial película, que no abandonaba su esencia familiar, con Porco Rosso, pasa todo lo contrario, claramente es una caricatura y tiene momentos que pueden agradar a los niños, pero la película tiene temas maduros y momentos que transpira cine clásico y violento en algunos casos. Posiblemente sea una de las películas de animación mas maduras que existan. Una obra maestra en todo su esplendor.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "really fun, and I love the sea \"pirates\"",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "What worked so well was the fact that Miyazaki didn't rub the film in the audience's face. It just played through, tight.",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "Awesome story and great setting.",
            "review_date": "2012-09-19",
            "source": "rt"
        },
        {
            "content": "1 of the best Studio Ghibli movies and one of the most unseen as well. Porco Rosso has every genre in film making rolled into 1 in this. Amazing flight sequences, funny humor, fast paced action, romance, and as always with  Miyazaki movies, a heart filled moral. A most see.",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "Pigs can indeed fly! Charming, delectable, optimal. Wildly entertaining, yet insightful and thought-provoking. Highly enjoyable and imaginative.",
            "review_date": "2012-08-30",
            "source": "rt"
        },
        {
            "content": "Porco Rosso fell short of great my expectations. Its hard to live up to high standards when your track record includes: Kiki's Delivery Service, Princess Mononoke and the award winning Spirited Away.\nEvery talented Director/ artist has their falls... Porco Rosso was Hayao Miyazaki questionable and least favorite films. Only Miyazaki could create a pilot who happened to be a porcine and with political intentions to say the least.",
            "review_date": "2012-08-22",
            "source": "rt"
        },
        {
            "content": "Alright so a little after seeing Ponyo, I got to this Miyazaki film. So here's my review for Porco Rosso.\r\n\r\nPlot: Porco Rosso is a man that has been cursed which turns him into a pig. Since then he has become a famous bounty hunter in the Adriatic Sea in the interwar period, defending people from airborne pirates. One day the pirates hire an American fighter pilot named Curtis to help them get rid of Porco. Porco tries to fly away from them to Milan for repairs to his plane but Curtis shoots his plane down and leaves believing he's dead. So Porco has to sneak to Milan despite the fact that he's wanted all over Italy to repair his plane and get back at Curtis.\r\n\r\nI think I'm starting to make it officially my point of view that a very well done Miyazaki film is a film that gives us a world/story that is so unique and creative and sometimes complex that I have to watch it twice to make sure I understand everything before reviewing it. So that would fall in line to part of why I particularly like Howl's Moving Castle, Castle in the Sky, Kiki's Delivery Service... maybe it's that way with Spirited Away (I am not sure if the times that I saw it years ago would really count for a couple of reasons) and I expect to feel the need to do that for that when I get to Princess Mononoke. Porco Rosso was a movie that I had to watch twice before reviewing it so, yeah it's a good movie. The story is creative, the setting is pretty cool particularly when we get more into Porco's past, the comedy if enjoyable and the characters (especially the Mamma Aiuto gang) are very fun to watch. There are a couple of things that I wish they got into more like how exactly Porco got his curse and all of that, but at the same time I'm kind of alright with it because that kind of makes the world of Porco Rosso still something of a mystery more or less which make it a little more interesting. Plus, (as per usual) we get a nice cast in the Disney version to this film with Michael Keaton, Cary Elwes, Susan Egan, Brad Garrett and David Ogden Stiers.\r\n\r\nCharacters:\r\nPorco Rosso: Normally I wouldn't be too big about a bounty hunter with a dark past or something like that since character more or less like that has been done plenty of times before, but I admit that this was not the case here. I think that's mostly because his past is more unique with the fact that it's mostly about him being turned into a pig and how we don't find out about every single thing about who he was before the events of the film. So that helped me care more about Porco and therefore be more willing to enjoy how he's a guy who looks after himself and yet has a sort of soft side about him.\r\nMamma Aiuto Gang Boss: Personally I liked the Mamma Aiuto Gang Boss the best because he was really hilarious. It seemed like everything was going wrong for him and he'd keep yelling at the top of his lungs over it and combining that with the animation to this movie made him a lot of fun to watch.\r\n\r\nMusic; Short answer. Well done just like any other Miyazaki film.\r\n\r\nAnd that's my review for Porco Rosso. It's a creative, funny and all around an entertaining film though and through.",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "Oh yes, I remember this one. Like Miyazaki's Castle in the sky, this one definatly shows his fascination with flying contraptians, in this, Planes from WWI. With a bit of history behind, I was immediatly invested what was going to be presented. The story is mediocre, but it's just the wild imagination and character interactions that save it from boredom. But what keeps us more invest is our main character himself, voiced by Micheal Keaton (Who has the amazing ability to be the mysterious character, such as his take on Batman). We don't get alot out of him, but it's enough to keep watching to know what happens next.",
            "review_date": "2012-07-26",
            "source": "rt"
        },
        {
            "content": "History and fantasy combine for a wonderful anime experience. The characters are splendidly human (even though the protagonist is a humanoid pig), and in the final evaluation come as friendly and helpful. Great storyline involves love, loss, and a struggle to overcome fears.",
            "review_date": "2012-07-24",
            "source": "rt"
        },
        {
            "content": "You will never go wrong with Studio Ghibli. Ever.",
            "review_date": "2012-07-21",
            "source": "rt"
        },
        {
            "content": "It was good and nice but I didn't like it that much. It was not like a Miyazaki Movie. The feminism in it was not like how Miyazaki used to present it and it was not having the beauty we usually see in Miyazaki's Works.",
            "review_date": "2012-07-21",
            "source": "rt"
        },
        {
            "content": "Not for children says Miyazaki. Porco Rosso is probably one the most serious characters he's created. A very touching story.",
            "review_date": "2012-07-20",
            "source": "rt"
        },
        {
            "content": "Another great movie from Hayao Myazaki and Studio Ghibli. The anime is excellent and the story is easy to follow. The only thing I did not really like was Michael Keaton's voice for Porco Rosso, at least in the beginning, eventually as the movie goes on, focus falls on the movie itself. The action sequences in flight were outstanding, and Myazaki really is a master of his craft. Great movie to watch multiple times.",
            "review_date": "2012-07-17",
            "source": "rt"
        },
        {
            "content": "One of the best of Miyazaki.",
            "review_date": "2012-07-15",
            "source": "rt"
        },
        {
            "content": "Perhaps the most well-rounded of all the Ghibli films, though no less charming or accessible as the more well known entries. As with my favorite forms of animation, teeters between adult and childish themes without drowning in either.",
            "review_date": "2012-07-14",
            "source": "rt"
        },
        {
            "content": "Absolutely amazing movie!",
            "review_date": "2012-07-14",
            "source": "rt"
        },
        {
            "content": "In spite of having poor characterizations and some bad lines, Porco Rosso is a fun, often humorous, well scored, and exciting film.",
            "review_date": "2012-07-13",
            "source": "rt"
        },
        {
            "content": "Not as well known as some of his other features, but this is still unbelievably charming (what Miyazaki film isn't?).  It goes without saying the animation is beautiful with a few extremely thrilling sequences, but the main draw of the film is the humor, wit, and charisma that the screenplay imbues these characters with.  Many of the Miyazaki staples are here:  flight, pigs, grown men who act like children, and women usually being the most intelligent and reasonable of characters in a pig headed (literally in this case) man's world.\n\nThis isn't up there with masterpieces like 'Princess Mononoke' or 'Spirited Away', but this is a unique and captivating bit of animation that has something that both kids and adults can enjoy that doesn't insult the intelligence of either.  In other words, it's Miyazaki and you must watch it.",
            "review_date": "2012-07-05",
            "source": "rt"
        },
        {
            "content": "Porco Rosso is a problematic movie. The animation is as wonderful as usual for the studio, the characters are memorable, I loved the relationship between Fio and Porco, the locations of the film are different and interesting and the film is so well scored and charming and endearing for the most part. However, I have to agree with Miyazaki himself that this is an adult film for children and it thus felt odd both conceptually and tonally. It struggled with its tone too much, the first act is somewhat rushed and the third act is silly leading to one of Ghibli's more humble offerings.",
            "review_date": "2012-06-25",
            "source": "rt"
        },
        {
            "content": "Good film. Miyazaki is never a let down.",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "Taking a different noir approach, this was a great film from Miyazaki. He didn't have as much of the phantasmagoria I love, but I still very much enjoyed the animation and plot. I rewatched this a few years ago, and it made me increasingly nostalgic for old school animation (i.e. non-CGI)",
            "review_date": "2012-06-21",
            "source": "rt"
        },
        {
            "content": "good action and adventure in thisone, doesnt live up to miyazaki's later films",
            "review_date": "2012-06-18",
            "source": "rt"
        },
        {
            "content": "Wouah, je retombe en enfance. C'est vraiment un petit bijou, et le fait que ce soit probablement même le moins bon film de Miyakazi me fascine davantage. En effet, Miyakazi nous fait revivre nos ardentes passions liées aux dessins-animés, tout en se servant de ceux-ci pour nous faire passer de puissantes morales. Que vous soyez adultes, adolescent ou enfant, vous n'aurez d'autre choix que d'adorer les aventures de ce pilote-cochon qui brave les intempéries du ciel pour combattre les pirates aériens, et pour combattre l'amour qu'il éprouve pour la belle Gina...\n\n-Porco, why did you turn into a pig?\n-All middle-aged men are pigs.\n\n-Why don't you join Italian Airforce, Porco?\n-I'd rather be a pig than a fascist.",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "kinda a rough ride Porco Rosso doesnt stick with you like most anime films",
            "review_date": "2012-06-05",
            "source": "rt"
        },
        {
            "content": "The most charming movie of Miyazaki's career. Makes me feel warm, cold, cool, light, heavy...",
            "review_date": "2012-06-04",
            "source": "rt"
        },
        {
            "content": "Off the beaten track where Miyazaki is concerned. I loved and hated the ending, and that the mystery of the curse is never explicitly answered.",
            "review_date": "2012-05-30",
            "source": "rt"
        },
        {
            "content": "Though not overly familiar with Studio Ghibli, I have seen enough of their films to know when they are giving us something special (My Neighbor Totoro) or something rather underwhelming (The Secret World of Arrietty). It is safe to say that Porco Rosso falls in to the first category; another beautifully animated film from Ghibli.No matter where a Ghibli film may stray to, one thing you can always rely on is the quality of the animations. Though Porco Roso doesn't boast the originality or beauty of Spirited Away, it is still a visually stunning film. The inventiveness of the dozens of planes in the movie is fantastic, it reminded me a little of some of the cars from Wacky Races, but the ideas displayed in these designs shows that the enthusiasm for aviation expressed by Fio was replicated by Ghibli's team of artists.What is also striking about this film it isn't condescending to its audience (which one would expect is largely the under 12s), it deals with themes of sexism and lust uncompromisingly.The character of Porco Rosso is given a Humphrey Bogart/film noir style which is an utter delight to watch. One of the best Studio Ghibli films I have seen yet.",
            "review_date": "2012-05-26",
            "source": "rt"
        },
        {
            "content": "Sweet, good-natured story. Not Miyazaki's best, but still fun",
            "review_date": "2012-05-21",
            "source": "rt"
        },
        {
            "content": "Simply beautiful. Miyazaki is a visual poet.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "A movie by Hayao Miyazaki/ Studio Ghibli, about a pilot in France who has been turned into a pig.  Starts out a bit slow.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "It's funny how renowned directors like Martin Scorsese and Steven Spielberg are extremely well-known for their works and still some of their finest, critically acclaimed works go unnoticed by audiences and the die-hard fans. In Scorsese's case, Alice Doesn't Live Here Anymore could be a perfect example and in case of Spielberg it's The Color Purple. And in case of Hayao Miyazaki's, it's Porco Rosso (Meaning \"Crimson Pig\" in Italian).\n\nAt the time of it's production, this film was going to be a short film for the Japanese Airline that tells the story of a middle-aged ace pilot from 1930's Fascist Italy who was cursed to become a pig. As it turns out, the film became a full-length feature. After seeing all 9 out of 10 Miyazaki films, this was my final one. What I felt during Porco Rosso was that Miyazaki tackles more bold issues, much bolder than his other films. Porco is not a children's character but one of those guys who drinks a lot, smokes a lot i.e. he represents perfectly an old dead beat pilot trying to find nothing but peace in his life. He is not a character you could learn something from, not a usual theme in Miyazaki's films. What is his role then? In the film it's chasing pirates, running away from the air-force, getting involved in ridiculous fights, etc. Miyazaki offers a different point though by saying that every middle-aged man is a pig and Porco Rosso in this film is simply resembling to that fact.\n\nSo this was about Porco Rosso (His real name is Marco Pagot). The other characters like Gina his love, the pirates, the American aviator who challenges Marco to a combat and there's Fio the cute girl who repairs Marco's plane were captured as usually marvelously by Miyazaki's lavish brushstrokes. The story takes place after World War 1 in the Adriatic sea. Thus Miyazaki was challenged to draw a totally different culture which he pulls off successfully. What more lovely about this film is that it stays completely true to history (The war, I mean) and uses this as one of the driving forces in the film. It's just wonderful as it is with all Miyazaki films. Though I have to say that this film is more confusing and subtle in it's way of storytelling. Because Miyazaki also tackles completely newer themes that are even different from other animated films in the world, both fans and non-fans are in for a treat. \n\nMy conclusion is that Miyazaki triumphs yet once again in his stellar career and has made the most \"unique\" animated film I have ever seen proving why I am a very huge fan of his. The Most underrated Studio Ghibli film yet Highly recommended.\nVisit my facebook page: www.facebook.com/filmsthemostbeautifulart",
            "review_date": "2012-05-15",
            "source": "rt"
        },
        {
            "content": "Incredibly fun! It wasn't entirely what I expected from a movie about a pilot pig, but it was what I expected from the great Miyazaki!",
            "review_date": "2012-05-15",
            "source": "rt"
        },
        {
            "content": "Great, great, movie.",
            "review_date": "2012-05-10",
            "source": "rt"
        },
        {
            "content": "Dovrebbe essere il migliore film di Miyazaki. L'ambientazione lo rende, probabilmente, piu' simile ad un film che ad un cartone (anche alcune inquadrature mi parevano poco cartone e piu' film). Secondo me chiamarlo maestro e' troppo, anche se i suoi film sono sempre dei bei prodotti. Personalmente preferisco i film Pixar, non per quanto riguarda la tecnica digitale, ma proprio per i contenuti e le emozioni che trasmette che trovo piu' profonde e toccanti.",
            "review_date": "2012-05-01",
            "source": "rt"
        },
        {
            "content": "Kind of a feel good cartoon, very classic. Reminds me of like a \"Ducktale\" animal themed based on pig life and the animation spores the era of Talespin with animals and animation alike. GOOD FOR KIDS",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "It was so cute.  I enjoyed it alot.",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "loved it. beautiful scenes of blue sky.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "It took me a while to get why he was drawn as a pig. He was a man who became a pig, that needed redemption to be a man again. Oh, it's an \"every guy\" story, I identify and get it now....This was yet another amazingly creative story from Japan. The finale was simply hilarious.",
            "review_date": "2012-04-15",
            "source": "rt"
        },
        {
            "content": "I'm not an anime fan, but this is good.  Really good.",
            "review_date": "2012-04-06",
            "source": "rt"
        },
        {
            "content": "One of my favorites!",
            "review_date": "2012-04-03",
            "source": "rt"
        },
        {
            "content": "The weird tale of a dog-fighting aircraft ace who happens to be a pig. Brilliant in its absurdity and wonderfully animated as ever.",
            "review_date": "2012-04-03",
            "source": "rt"
        },
        {
            "content": "Porco Rosso (or Crimson Pig, if you prefer) tells the story of a former Italian World War I fighter pilot named Marco who carries a curse that has transformed him into a pig man. Now a flying bounty hunter for hire, he roams the skies, ridding them of gangs of air pirates and pining for his human sweetheart Gina. When a rival pilot named Curtis shoots him down and attempts to sway Gina's affections, Marco must quickly get his hands on a new biplane and go head to head with Curtis, meanwhile evading the Italian air force who are out to arrest him. Filmmaker Hayao Miyazaki has brought us many fine animated masterpieces over the course of his career, many of which are some of the greatest films ever made. But one of the first of those films that future fans of Studio Ghibli are bound to see first is this one. The main reason being that it's the most accessible, and also the most whimsical in nature; but at the same time, it isn't. Despite the character spouting about being nothing more than a pig in nearly every scene, you tend to forget about it and just accept him as a human character. He's the only truly fanciful element to the story being told, but it's handled in such a way that we're invested one hundred percent in his him because he's so relatable. It should go without saying that this is a beautifully animated film from start to finish. It's not the best in the Studio Ghibli canon, but it's one of my favorites.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "Una de mis favoritas pelÃ­culas de Miyazaki",
            "review_date": "2012-03-28",
            "source": "rt"
        },
        {
            "content": "Main character is cool. Bad guys are dumb and funny. The animation is pretty neat and has strange moments of poetry. A lot of fun.",
            "review_date": "2012-03-24",
            "source": "rt"
        },
        {
            "content": "Another excellent Miyazaki film. Are you surprised?",
            "review_date": "2012-03-22",
            "source": "rt"
        },
        {
            "content": "THIS is my favorite Miya film.",
            "review_date": "2012-03-21",
            "source": "rt"
        },
        {
            "content": "An Italian WWI pilot, sporting a piggish face thanks to a mystical curse, is running from both sky pirates and the fascist secret police in this Hayao Miyazaki feature. \"Porco Rosso\", after getting attacked by an arrogant American mercenary,  is forced to hire a teenage girl to overhaul his fighter plane. This arrangement leads to a madcap duel, a classically themed romantic sublpot, and a lot of crazed chase scenes. For this film, Miyazaki mixes amiably goofball humor with his usual brand of sumptuously detailed visuals and affecting character construction. The result is one of my favorite efforts by Studio Ghibli",
            "review_date": "2012-03-18",
            "source": "rt"
        },
        {
            "content": "5/10: In my opinion, definitely not one of Miyazaki's best Ghibli films. The animation is great (as usual), and the homage to Hollywood 1920's adventure style movie is brilliant, but unfortunately the story and characters are just plain average.",
            "review_date": "2012-03-13",
            "source": "rt"
        },
        {
            "content": "The harder attempt Miyazaki makes in making a close-to-reality movie, the less interesting they become. Porco Rosso is one of those movies. The only thing that separates it from pure realism is the animalized main character that could simply be considered as human. I don't see a point  using a pig face for the main character.",
            "review_date": "2012-03-06",
            "source": "rt"
        },
        {
            "content": "I saw the French release with unset subtitle so it was hard to understand...",
            "review_date": "2012-03-04",
            "source": "rt"
        },
        {
            "content": "Who would think a movie with a pig could be so good. Or better yet so great!",
            "review_date": "2012-03-01",
            "source": "rt"
        },
        {
            "content": "A pig-headed pilot who fights seaplane pirates in the Adriatic. A premise like this in the hands of Miyazaki could not have yielded better results. The dogfights, humor, and scenery flow together perfectly.",
            "review_date": "2012-02-29",
            "source": "rt"
        },
        {
            "content": "Definitely the funniest out of Miyazaki's lineup, it's a brilliant mix of fantasy and reality.",
            "review_date": "2012-02-28",
            "source": "rt"
        },
        {
            "content": "Loved this movie. I don't know much to say about it, I loved it all and all and is probably one off if not the best movie I have ever seen.",
            "review_date": "2012-02-27",
            "source": "rt"
        },
        {
            "content": "When Rotten Tomato made the list of best animated movie of all time....they DEFINITELY forgot Porco Rosso! It is my personal favorite out of Studio Ghibli. Even the critics gave this an outstanding 100%. People should really check this one out, I highly recommend it!",
            "review_date": "2012-02-21",
            "source": "rt"
        },
        {
            "content": "Miyazaki at the peak of his game, he delivers a charming, hilarious movie about honor, love, and sea-plane pirates.",
            "review_date": "2012-02-20",
            "source": "rt"
        },
        {
            "content": "Michael Keaton's stiff vocal performance is pretty distracting for the first half of the movie, but you will love the visuals and the general humor of the movie.  This might be the funniest film that Miyazaki has ever cranked out, not just because of how strange the movie is, but because the script is actually surprisingly hilarious.  The animation, as always, is spectacular.",
            "review_date": "2012-02-18",
            "source": "rt"
        },
        {
            "content": "This is a middling Studio Ghibli film. While it is better than some of the company's other movies, it's far from great.",
            "review_date": "2012-02-16",
            "source": "rt"
        },
        {
            "content": "My favorite Miyazaki film.  A straightforward story about a lonely, hard-edged but loyal and good-hearted hero...you could draw some personality comparisons to Wolverine, but packaged for a younger crowd.",
            "review_date": "2012-02-13",
            "source": "rt"
        },
        {
            "content": "Probably my favourite film of all times.",
            "review_date": "2012-02-05",
            "source": "rt"
        },
        {
            "content": "odd but entertaining nevertheless.",
            "review_date": "2012-02-03",
            "source": "rt"
        },
        {
            "content": "Better than most movies about anthropomorphic pig aviators during the great depression...",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "Probably my least favourite Miyazaki film. It's not especially bad, but it's not especially brilliant either. I might have given it four stars, were it not for the horrible fight scene at the end.",
            "review_date": "2012-01-22",
            "source": "rt"
        },
        {
            "content": "One of the best from Studio Ghibli a superb story of adventure, morals, love etc.. A superb watch",
            "review_date": "2012-01-21",
            "source": "rt"
        },
        {
            "content": "It's a movie about a WWI vet who's a pig. How can you go wrong?",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "Some great entertainment with substance.",
            "review_date": "2012-01-06",
            "source": "rt"
        },
        {
            "content": "Wah!! LOL SO FUNNY!! Really not at all what I was expecting xD",
            "review_date": "2011-12-14",
            "source": "rt"
        },
        {
            "content": "En kyl pitäny.. oli jotenkii ruma ja masentava",
            "review_date": "2011-12-09",
            "source": "rt"
        },
        {
            "content": "It is just not my type ~~",
            "review_date": "2011-12-08",
            "source": "rt"
        },
        {
            "content": "Not the usual Miyazaki, more witty, more funny, less magical. Worth watching ! The French voice of Porco Rosso is Jean Reno's, and it fits perfectly.",
            "review_date": "2011-12-04",
            "source": "rt"
        },
        {
            "content": "Now I may be wrong, but I felt like this movie dragged on for a little too long.",
            "review_date": "2011-12-04",
            "source": "rt"
        },
        {
            "content": "Brilliant artwork of Miyazaki's masterpiece. every single second of watching this movie was enjoyable. I can't say \"my favorite movie\" from Miyazaki, because all of them are so amazing! I can't wait for a sequel for this movie!",
            "review_date": "2011-11-28",
            "source": "rt"
        },
        {
            "content": "This movie sounds stupid but it's brilliant",
            "review_date": "2011-11-27",
            "source": "rt"
        },
        {
            "content": "In contemporary film, you could set a decent standard in most films and you would end up sorely disappointed. With a Ghibli/Miyazaki film, you could set the most impossibly high standard for any film and it would probably be able to meet it. Porco Rosso is my fifth Ghibli movie all the way though (fourth Miyazaki film) and it was everything I loved in a Miyazaki movie: detail to art, character development, research, music, and so much more.",
            "review_date": "2011-11-26",
            "source": "rt"
        },
        {
            "content": "My husband and I quite enjoyed it. It really brings a valuable message across. I loved the animation and the characters. It has a great storyline - I do recommend watching it.",
            "review_date": "2011-11-21",
            "source": "rt"
        },
        {
            "content": "One of the best themes of Hayao Miyazaki is that everyone has good in them. There are never any true enemies; everyone becomes a friend by the end. This is a wonderful movie that left me feeling sad that it was over. One of Miyazaki's best.",
            "review_date": "2011-11-20",
            "source": "rt"
        },
        {
            "content": "the ending is pretty confusing..",
            "review_date": "2011-11-18",
            "source": "rt"
        },
        {
            "content": "wtf i can't believe this and kiki are miyazaki films...well i can see some resemblances but still, it's nothing like spirited away",
            "review_date": "2011-11-07",
            "source": "rt"
        },
        {
            "content": "Incredible work of art. I couldn't believe that it had to end; I sat through the credits, just waiting for more.",
            "review_date": "2011-11-04",
            "source": "rt"
        },
        {
            "content": "Awesome! Well worth watching.",
            "review_date": "2011-11-03",
            "source": "rt"
        },
        {
            "content": "magic and adventures. Miyazaki nailed it again",
            "review_date": "2011-11-02",
            "source": "rt"
        },
        {
            "content": "Dos palabras: Estudio Ghibli",
            "review_date": "2011-10-30",
            "source": "rt"
        }
    ]
}