{
    "rating": 2.6,
    "release_date": "Invalid",
    "num_reviews": 30,
    "genres": [
        "Mystery&thriller"
    ],
    "summary": "Jason Kemp (Christopher Reeve) is a quadriplegic who passes the time spying on his neighbors from his window. By chance he catches one of them, Julian Thorpe (Ritchie Coster), beating his wife and reports it to the police. He later becomes certain that Julian has killed her, but fails to convince his nurse or his friends of any foul play. Meanwhile, Julian has discovered that Jason is privy to his crime, and is conniving to take care of him as well.",
    "reviews": [
        {
            "content": "Takes too long to get going and when it does it is a poor retread of the original.",
            "review_date": "2023-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The version they actually showed was the original Hitchcock version, not the 1998 version.  We still enjoyed it, just wasn't what we expected (or was advertised).",
            "review_date": "2020-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and suspenseful",
            "review_date": "2020-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very suspenseful!  Loved the actors and scenery!",
            "review_date": "2020-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i thought that this movie was pretty good because Christopher Reeves played a good role most people wont agree but i havent seen the original film but yeah",
            "review_date": "2016-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting is bad, for a thriller the suspense is not well executed. Overall the film feel extremely lazy.",
            "review_date": "2016-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one if Christopher  Reeves  best  movies",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I ran into this on Netflix, a movie starring Daryl Hannah and Christopher Reeve after his paralyzing accident. In it, Reeve's optimism, drive, and work ethic shine through. I think he enjoyed making this. Hannah's character is a balanced counterpart to Reeve.\n\nIt's a suspenseful remake of an earlier film that I don't recall seeing. His condition no doubt led to numerous script changes, making it more his own.\n\nOverall, the storyline works, although it's perhaps a bit slow at times. It picks up toward the end as Jason Kemp comes face to face in a harrowing confrontation with a killer that he's been stalking turning the tables to stalk him.\n\nIf you want to catch another glimpse of the now departed Reeve, formerly Superman back in the 70s and 80s, here you go.",
            "review_date": "2015-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't expected to achieve Hitchcock's mastery, but it delivers the thrills while offering a new twist in the middle of the modern update, even if it's shorter and slightly less-focused towards a mostly resolving end. Also, what really adds into the thrilling fear is Christopher Reeves' fragile, real-life condition that deepens the reality of the classic and showing that he still performs fine with the same charisma. So basically, it's a good benefitting remake that's a little less to the original. (B+)\n\n(Full review TBD)",
            "review_date": "2015-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was never going to be a patch on the original and it is weak overall but an interesting ending just about saves this TV version of Hitchcock's classic from being a complete disaster.",
            "review_date": "2013-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While maybe not as good as the original, CHRISTOPHER REEVE gives a better performance than most actors today. A shining achievement!",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a brave move to remake Hitchcock, and for the most part this succeeds, far better than Van Sant's Psycho remake. Whilst sticking to the basic premise of Hitch's original this version at least attempts to do something different it and plays to Reeve's strengths. With solid support from Hannah and Forster, its just a shame that the filmmakers didn't try to raise the bar a little more as this looks and feels like a TV movie, so whilst not the classic that the original is there are worse ways to spend an hour and a half.",
            "review_date": "2012-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent reworking if the Hitchcock classic doesn't have the wit and humor the original had.",
            "review_date": "2012-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Christopher Reeve is legitimately excellent in this remake of the Alfred Hitchcock classic, but he's the only great thing in it.  While the screenplay tries to play around with the basic building blocks of the original's plot, it eventual devolves into a straight rehash, one done with none of the cinematic virtuosity that Hitchcock's original had in spades.  Not an atrocity like the PSYCHO remake, and fans of Reeve should check it out, but it's entirely mediocre.",
            "review_date": "2012-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent Slow Burn Thriller, Which Shows That You Do Not Have To Be Able To Walk, To Command The Screen With Such A Great Performance. This In Which Reeve Gives Here, Him Being In The Weelchair At The Time Made His Performance Totally Convincing. A Great We Crime Thriller Made For TV.",
            "review_date": "2012-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "horrendous re-make of a classic!",
            "review_date": "2012-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock is turning in his grave",
            "review_date": "2012-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the original. However, it is well done and entertaining in its own right. Defiinitely worth a watch.",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may not be as good as Alfred Hitchcock's masterpiece thriller but \"Rear Window\" (1998) benefits from great atmosphere and you can see the original references scattered all over this capable remake.",
            "review_date": "2011-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember watching this online with my brother and praying to God it didn't ruin Rear Window for me. It didn't, but its an unnecessary sloppy remake of a movie that in no way needs to be redone.",
            "review_date": "2011-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lifetime Movie. I loved Christopher Reeve in all his movies. But seeing him in this was nothing then enjoyment. In someways its like the class \"Rear Window\". But this was just for pure enjoyment. I like it.",
            "review_date": "2011-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awful remake of the james stewart film",
            "review_date": "2010-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i saw this movie it was good poor christopher reeve.he will always be superman to me.",
            "review_date": "2010-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good on it's own. Compared to the original? Pure crap. This borders on an exploitation film.",
            "review_date": "2010-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nowhere near as atmospheric as Hitchcock's classic, but offers Christopher Reeve a chance to give a solid performance after his near-fatal horse riding accident.",
            "review_date": "2010-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was ok,but not as good as the original",
            "review_date": "2010-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Will the real Rear Window please stand up...I think this is the 3rd remake of this movie.",
            "review_date": "2010-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few times that a sequel manages to remake the original without being a half-assed carbon copy. Reeves uses his disability to his advantage in the remake of the classic Alfred Hitchcock film Rear Window. In this version the main character is paralyzed (obviously) and relies on his house and caretaker to keep him alive. When he witnesses a murder from his window he is determined to solve it. \r\n\r\nGreat performances and a well worked revision of an already told story.",
            "review_date": "2010-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(First viewing - Teen years)",
            "review_date": "2010-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It,s pretty good adption of hitchcooks version..The human warmth and sympathies enlivened by seeing Christopher Reeve back at work in his wheelchair cannot quite make up for the miscalculated and rather un-tense spin the filmmakers have put on one of Hitchcock's greatest movies. Certainly, the spirit of the project does not seem to have been to improve upon or even repeat Hitchcock's recipe, and the showcase of life-support and mobilizing technology that Reeve uses is put forth frankly as the film's raison d'être. The medium of television was to give these miraculous inventions a proper and popular visibility so that physically disadvantaged viewers and their families might have some awareness of the systems potentially available for their use. Then again, the Reeve character is a conspicuously wealthy one, so there is some question as to which of the units installed in his apartment would be accessible to less privileged patients.\n\nIf the film's educational ambitions seem, then, a little misjudged, its credentials as cinema are far shakier. There is a poignance to the handing over of this story to a character who is not merely waylaid and voyeuristic, like James Stewart was in the original, but who feels he may never be able to do the things?dancing, working, lying down comfortably on a bed?that the objects of his gaze perform each day without a thought. The action in the satellite apartments around the focal point is not quite as witty as the vignettes described by Hitchcock, but it is the portrayal of those more central events that suffers the most and, resultingly, brings down the film.\n\nDirector Bleckner (also of television's Serving in Silence, with Glenn Close) fails to recall that much of what made Hitch's plots so tantalizing and frightening is that the crimes and perversions almost always happened in incongruously public, clean, or unassuming places: hotel showers, diplomatic banquets, art galleries. Here, the woman whose disapperance drives Reeve to think she's been murdered is the wife of an abusive bruiser, and is herself a graduated alcoholic. The husband even walks around in black T-shirts with stylized demon graphics emblazoned on the front, and we see him threatening the residents of other apartments, so the maximum space between fantasy and reality?a vicious lout killed his wife, or a vicious lout did not?is not as interesting (or as compromising of the Reeve character) as when Stewart risked impugning a man who betrayed no real signs of being capable of murder, or of being notable for any particular reason.\n\nDaryl Hannah, obviously no Grace Kelly, is written into a role as Reeve's architect co-worker, and by being let off the hook of following in Kelly's epicene footsteps, manages to put in a likable turn that is one of the warmer elements of this Rear Window. Her snooping around the Thorpes' apartment (they are renamed?and why de-ethnicized??from the Thorwalds of the original) is a bit sloppier than what Kelly achieved. Reeve's own e-mail bullying of his cross-courtyard neighbor is so wildly reckless that by all rights?and even by the strong suggestion of a too-early scene when Julian Thorpe meets Reeve's gaze across the courtyard?he should have been at best reported and at worst revenged-upon well before the climactic finale.\n\nJackie Brown's Robert Forster, whose participation in the Psycho remake classifies him as a staple of Ersatz Hitch, has little to do as Detective Moore, and Ruben Santiago-Hudson has a particularly discomfiting role as Reeve's Caribbean male nurse with whom he exchanges patois greetings and broad \"Yah, mahn\" jibes. All very strange, and that's to say nothing of the easy and questionably tasteful scares the first chapter of the movie gets out of tubing \"pop-offs\" on Reeve's oxygenator that a flustered nurse/intern doesn't know how to fix. It establishes more vulnerability around Reeve's condition and is, I am sure, a credible concern of people dependent on such technology; this particular film's use of the instance as a suspense-builder just struck me as a little off-the-mark.\n\nI doubt Rear Window will have much of a life in the video stores, with the classic blueprint right nextdoor on the shelf, and though a well-intentioned bit of Hollywood hooey, it's hooey indeed. Hopefully Reeve will find other projects that accommodate his artistic potential even as they allow for and call attention to his physical limitations.",
            "review_date": "2010-01-12",
            "source": "rt",
            "lang": "en"
        }
    ]
}