{
    "rating": 1.5,
    "release_date": "Invalid",
    "num_reviews": 150,
    "genres": [
        "Sci-fi"
    ],
    "summary": "Greedy corporation Omni Consumer Products is determined to begin development on its dream project, Delta City, which will replace the derelict Detroit. To achieve this end, O.C.P. is employing armed forces to bully residents out of the city, under the guise that they are just doing their part to reduce crime and root out thugs. After RoboCop (Robert John Burke) joins the civilian resistance, he sustains severe injuries but recovers to battle advanced ninja robots developed by O.C.P.",
    "reviews": [
        {
            "content": "not even close to living up to its hype. Yes, it's a tiny bit better than the original, but it's still far superior to the second movie, which I always thought was incredibly cruel. This film feels more similar to Verhoven's original than the second one and has an unexpectedly large amount of heart. Not too seriously, please.",
            "review_date": "2023-02-14",
            "source": "rt"
        },
        {
            "content": "i love the scene there the big robot says eat lead suckers thats one of my favorite scenes ever",
            "review_date": "2022-11-10",
            "source": "rt"
        },
        {
            "content": "This is insulting  to anyone with an IQ higher than 60",
            "review_date": "2022-10-21",
            "source": "rt"
        },
        {
            "content": "I hate everything about this movie ",
            "review_date": "2022-10-08",
            "source": "rt"
        },
        {
            "content": "F \nThis film is one of the worst sci-fi films ever made after watching the second film this film just felt bad and I will never watch this movie again \n1/5",
            "review_date": "2022-09-11",
            "source": "rt"
        },
        {
            "content": "Terrible; I've seen better film on teeth",
            "review_date": "2022-08-23",
            "source": "rt"
        },
        {
            "content": "Probably the worst of the 3...the gore and violence of the first 2 all but gone and with it the attraction of the film in the first place.",
            "review_date": "2022-06-12",
            "source": "rt"
        },
        {
            "content": "um filme com momentos divertidos.",
            "review_date": "2021-11-14",
            "source": "rt"
        },
        {
            "content": "One star because it has one redeeming quality, the line: \"My friends call me Murph. You can call me Robocop.\"",
            "review_date": "2021-10-03",
            "source": "rt"
        },
        {
            "content": "This movie is exactly would you would expect to find on Sci-fi Channel or SpikeTV at 1am back in the day. Its good in its own bad way.",
            "review_date": "2021-08-02",
            "source": "rt"
        },
        {
            "content": "Still better than RoboCop 2 and the remake though. I still think bizarrely the second installment is the worst of the franchise, how did it manage that with an \"R\" rating and feel more \"PG-13\", I'll never know. Literally just watch the original and stop there. This one did have some black humor that amused me though.",
            "review_date": "2021-07-19",
            "source": "rt"
        },
        {
            "content": "It's not bad, but it's not good",
            "review_date": "2021-07-11",
            "source": "rt"
        },
        {
            "content": "As usual, the sequel made havoc that stopped coming the 4th.",
            "review_date": "2021-06-14",
            "source": "rt"
        },
        {
            "content": "For any fan of robocop i would recomend it,but it is best suited for a younger audiences than the first two.Frank miller story is great but not executed as it should have been.cch pounder bring shuch a great performance without her the movie would be unwachable",
            "review_date": "2021-05-11",
            "source": "rt"
        },
        {
            "content": "It's bad enough that Peter Weller doesn't reprise RoboCop. It's bad enough that RoboCop 3 kills off (spoiler alert) Anne Lewis (played by Nancy Allen). It's bad enough that audiences sees product placement once more. It's bad enough that RoboCop 3 is the exact opposite of the first RoboCop.  The worst thing about this movie is that studios tried to make one of the most violent franchises of the 1980s be more family-friendly and toned it down to be a PG-13 movie. To the studios, director, writers, and producers, you are under arrest for making such an abomination. Dead or alive you're coming with me.",
            "review_date": "2021-04-28",
            "source": "rt"
        },
        {
            "content": "The RoboCop sequels took all the wrong lessons from the first movie. The unabated threat of a corrupt and powerful government using brute force on its citizenry should feel much scarier than this movie does. It focuses more on being a silly exaggeration of a PG-13 action movie than on being a great satire…and even then, it doesn't have enough courage to lean into that entirely. Still better than the remake, though.",
            "review_date": "2021-01-25",
            "source": "rt"
        },
        {
            "content": "i think Robocop 3 is a bit underrated, its not violent anymore and the clever satire that the first two has is now gone. but its still an decent action flick. Robert Burke did well replacing Weller as Robocop, its very weak but pretty decent and entertaining movie",
            "review_date": "2020-12-24",
            "source": "rt"
        },
        {
            "content": "Robocop is my jam man i love the story wish it had peter Weller",
            "review_date": "2020-09-05",
            "source": "rt"
        },
        {
            "content": "This third Robocop movie was just as terrible as the second movie. Robert John Burke, Nancy Allen, Rip Torn, and the rest of the cast did a terrible job in this movie. The plot to the movie was tedious and tiresome. It's like the cast and crew were trying too hard when this movie was made and it turned out to be a total bomb. If you haven't seen this movie yet, don't waste your time. It's not worth it.",
            "review_date": "2020-07-18",
            "source": "rt"
        },
        {
            "content": "I think this is underrated. I enjoy these films and thought the 3rd and final installment was a great completion. Yes Peter Weller was not cast, and that was okay. The new tech for Murphy being a jet pack was an awesome addition helping to turn the table. Yes the movie did not live up to the previous two and I wouldn't naturally give a full five stars, maybe more like 3.5 to 4, but this low of a rating needs to be offset because lets face it, the movie was enjoyable and I don't believe I'm the only one who thinks so :)",
            "review_date": "2020-07-11",
            "source": "rt"
        },
        {
            "content": "Not only is the clever satire gone the film  doesn't even feel like Robocop.",
            "review_date": "2020-07-09",
            "source": "rt"
        },
        {
            "content": "What a great robocop trilogy",
            "review_date": "2020-06-14",
            "source": "rt"
        },
        {
            "content": "This movie should have never been made. simple as that",
            "review_date": "2020-05-14",
            "source": "rt"
        },
        {
            "content": "\"Look how they massacred my boy\". (0.5/5)",
            "review_date": "2020-03-20",
            "source": "rt"
        },
        {
            "content": "I'm just defending it that's all",
            "review_date": "2020-02-04",
            "source": "rt"
        },
        {
            "content": "RoboCop 3 has competently filmed action scenes and Peter Weller's replacement does a serviceable job in the titular role but this PG-13 sequel's unimpressive special effects, use of '90s movie cliches and clashing tones that fail to appeal to either young or old demographics make this a low point for this cyberpunk superhero franchise.",
            "review_date": "2020-01-26",
            "source": "rt"
        },
        {
            "content": "My favourite RoboCop Film",
            "review_date": "2019-12-20",
            "source": "rt"
        },
        {
            "content": "This is a good example of where you need to leave things as they are because the formula is working! Unfortunately they didn't and the current 3% score says it all. Even that is being generous. Poor acting and poor story. Truly awful!",
            "review_date": "2019-09-22",
            "source": "rt"
        },
        {
            "content": "Definitely the weakest of the series. Going PG-13 is one of the many problems with this movie. ",
            "review_date": "2019-08-03",
            "source": "rt"
        },
        {
            "content": "Its just painful to watch at times.",
            "review_date": "2019-07-24",
            "source": "rt"
        },
        {
            "content": "This is actually an intriguing way to end the series but it still has no sense to its context of what it is supposed to be",
            "review_date": "2019-05-18",
            "source": "rt"
        },
        {
            "content": "The last of the trilogy which feels utterly pointless and is very boring.",
            "review_date": "2019-04-01",
            "source": "rt"
        },
        {
            "content": "This is the last great Robocop film to me, no matter what others say. It is worth a third and final chapter in the Robocop trilogy. Even Jon Lovitz, the Jay Sherman guy, would never say “It Stinks” to Robocop 3.",
            "review_date": "2019-03-10",
            "source": "rt"
        },
        {
            "content": "It's a good movie it has good one liners,a great score provided by basil polduris,and some intresting ideas sadly why i didnt give it a five is because robert john burke is just not peter weller,he try's his abosolute best but can't compare",
            "review_date": "2018-12-17",
            "source": "rt"
        },
        {
            "content": "Even after what we know from director Fred Dekker's account, the film is a sloppy and barely an excuse for this type of condescending to your audience.",
            "review_date": "2018-07-23",
            "source": "rt"
        },
        {
            "content": "Christ what a boring movie. I know an action movie of the calibre of the Robocop franchise has failed when I'm yawning and bored to tears throughout the whole movie. Also a lot of eye-rolling moments and parts that were supposed to be emotionally charged just had me burst out laughing at how stupid it was. And the fucking kid. Why the kid? Why in gods name is there a kid playing a major protagonist role in a Robocop movie? And she's a fucking genius computer wiz? Can we all just agree that the kid computer wiz trope is fucking stupid and never works? (save for maybe Cowboy Bebop). I mean, yeah there's kids in the second one, but the movie is brilliant in making the only major kid character a crime boss. It's so over-the-top, but somehow it works. I guess if you're a huge robocop fan like I am this is worth the watch, just to see how exactly NOT to do a Robocop movie. Also why the fuck is this pg-13???",
            "review_date": "2018-07-16",
            "source": "rt"
        },
        {
            "content": "Lol, I need those 2 hours if my life back...",
            "review_date": "2018-01-16",
            "source": "rt"
        },
        {
            "content": "Terrible horrid horrible movie.",
            "review_date": "2018-01-13",
            "source": "rt"
        },
        {
            "content": "Worst RoboCop film of all time, BAD. RoboCop & RoboCop 2 got this character right, hey who wants to see RoboCop get beat by 2 Ninja-Bots? Fred Decker needs to be smacked for embarrassing this character & directing this awful travesty.",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "I didn't think \"RoboCop 3\" was boring. People think it was, but I didn't think so. I enjoyed it a whole lot better than anyone else in this world. I know that Peter Weller never got a chance to play Alex Murphy/RoboCop one last time.\nBut Robert John Burke made a different robotic movement. Even the script has written was wrong and failed, but that was okay. Anyway, a mixed review and thumbs up for me \"RoboCop 3\".",
            "review_date": "2017-12-23",
            "source": "rt"
        },
        {
            "content": "Without a doubt Robocop 3 is cheesefest if there ever was one. Thats not to say there wasnt a great ammount of potential with their story, and im not sure if it was rushed into production, or if there was other production issues, but given enough time to actually flesh out their story I think Robocop could have ended with a bang instead of a wet fart. The story is promising, and even at times gives you a feeling of ALMOST getting pulled in. The number one problem is not getting Peter Weller back to play Robocop. No one has ever done Robocop better than him. And our \"stand in\" (i cant even remember his name) puts forth as good of performance as I believe he can, but when I see him move around it literally looks like a guy walking around clumsily in the giant suit. He just didnt have the acting chops to pull it off realistically. The whole Japanese company buyout of OCP was completly unnecessary, and while the idea of a Robocop flight pack seemed cool at the time, it was sorta tacked on for no real reason at all other than to sell action figures. Films like this at this time all suffered from this problem, hense the PG-13 rating for a HARD R franchise. Oh the days when rated R movies were marketed to children. This also goes for Robocop's completely meaningless hand cannon... litterally... he takes off his hand and puts on this giant cannon of a... thing. More nonsense to sell toys. If they could have found a way to keep Wellar as Robocop, spent more time perfecting the story and less time trying to shoehorn in as much toy merchandise that had no real purpose in the movie they might have actually had something here. But instead we get a watered down, SOFT PG-13 feature length toy comercial. After watching it for the first time in YEARS... its a little better then I remembered... but not much.",
            "review_date": "2017-12-14",
            "source": "rt"
        },
        {
            "content": "Should have left it alone smh!",
            "review_date": "2017-12-05",
            "source": "rt"
        },
        {
            "content": "Robocop is great - part 3 is not. \nGo watch the original instead of torturing yourself with this trash.",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "Robocop fights a robot ninja assassin and gets a jetpack.  I think this is the best robocop out of the entire series. It has a coherent plot rather than just pointless violence.  I didn't care that much for the other two.",
            "review_date": "2017-10-04",
            "source": "rt"
        },
        {
            "content": "One of the worst action movies ever made, Robocop 3 makes the terrible choice to replace Peter Wellers with someone else whose name I can't remember and don't care about. The action is...okay, but the ninja robots are just stupid. The supporting cast do their best with a bad script, and honestly the only good things in this movie are the introduction of Robocop's Gun Arm and jetpack. Unfortunately, gadgets aren't enough to save this movie from a boring story and the limits of a PG-13 rating.",
            "review_date": "2017-09-28",
            "source": "rt"
        },
        {
            "content": "It is hard to top the original Robocop, While Robocop 3 did not top the original it was pretty decent, I liked Robocop's weapon arm and jetpack, it made him look like a badass, but my main complaint is that Robocop did not seem like the main character, I mean over 13 minutes into the movie and we only got to see toy Robocop. A good movie but many flaws",
            "review_date": "2017-08-29",
            "source": "rt"
        },
        {
            "content": "The best robocop of all time, this movie is art.",
            "review_date": "2017-07-13",
            "source": "rt"
        },
        {
            "content": "Not as bad as people say it is, but still a watered down version of what's come before.",
            "review_date": "2017-04-25",
            "source": "rt"
        },
        {
            "content": "Coming from someone who enjoyed both Robocop one and two, I can certainly say that three is by the worst in the series. Robocop 3 feels lazy and amateurish. \n\nEverything from the absence of Peter Weller, to the retreading of plot points covered in the first two movies already. The film has horrible one liners, average action sequences that lack the bloody, gritty punch of the original, and humor that has no satirical bite. \n\nThe film also introduces a little kid who's incredibly good at hacking for some reason, and has Robocop form an emotional bond to him with no context as to why. My guess is to make the film seem more family friendly, which was an incredibly stupid choice. \n\nThe film does still have some good looking practical effects. Robocops armor still looks great, and the ED 209's still look pretty good. The film is also mostly fun to watch because of how hilariously bad most of it is. \n\nThe first Robocop had dark humor, good performances, and bloody, well made action sequences. Robocop two was lacked a lot of the humor, but still had good action sequences, and Weller reprising his role. \n\nRobocop three has none of that. The actor standing in for Weller does a horrible job delivering his lines and has no charisma. The action scenes are bland and lazy, and the humor and more family friendly aspect they were going for hurts the film horribly. Watch the first two and forget this one exists.",
            "review_date": "2017-04-23",
            "source": "rt"
        },
        {
            "content": "This is where they turned the series into a kid's comic book movie.  In all that it loses its way and gets too cartoony.  Still, it's still fairly entertaining if you just want a bit more of RoboCop action.  Easily the weakest of the series though, which is strange considering all the talent involved...",
            "review_date": "2017-04-17",
            "source": "rt"
        },
        {
            "content": "Underrated and pg 13 didn't matter. This coming from a guy who loves blood and gore. Second best movie in series. The reboot is the most horrible piece of shit. Don't listen to nerds. Watched this first time since I was a kid thinking it would suck cause of idiot critics, but turns out to be great. Lots of heart. Tear jerking scenes. Awesome action. Great one liners. Great pacing. Memorable characters and scenarios. Really pumped up after watching this",
            "review_date": "2017-04-03",
            "source": "rt"
        },
        {
            "content": "A decent core concept that's brought down by an array of bad ideas. The 80's had a weird trend of making R-rated movies that were in many ways aimed at children (the Rambo sequels, the first 2 RoboCops, much of the slasher craze), RoboCop 3 is perhaps an inevitable by-product of that era, a bloodless entry in a franchise once full of carnage.\nCertainly, there are other issues here. There is much less humour and much more (daftly executed) sentimentality, awful performances (save some decent work from Rip Thorn who's doing what he always does), and did we really need an obnoxious kid hacker who does considerably more than the titular character?",
            "review_date": "2017-03-10",
            "source": "rt"
        },
        {
            "content": "Nothing doing here. A cynical, cheap looking sequel that offers little worth seeing, awful characters and terrible special effects. \"I wouldn't buy that for a dollar\" (or 5 cents).",
            "review_date": "2016-10-01",
            "source": "rt"
        },
        {
            "content": "Robocop vs Robo-Ninjas",
            "review_date": "2016-09-11",
            "source": "rt"
        },
        {
            "content": "Doesn't feel like a robocop movie at times.The film is more wackier and much more clichéd. I like it better than the 2nd film personally, but it's still a bad flick.",
            "review_date": "2016-08-10",
            "source": "rt"
        },
        {
            "content": "Seen yesterday , again ...not great , just entertaining enough to see one time ! SOMDVD",
            "review_date": "2016-06-19",
            "source": "rt"
        },
        {
            "content": "Yeah this movie is pretty God damn bad",
            "review_date": "2016-06-13",
            "source": "rt"
        },
        {
            "content": "My friends call me Murphy.  You call me...Robocop.\n\nOmni Consumer Products hope to build a commercial city to replace Detroit and they begin forcing people out of their homes and towards their new city.  A group of revolutionaries form to stop the corporate takeover attempt.  The local police force are caught in the middle of the two sides and must take a stance, including Robocop, on which side of the battle they'll take.\n\n\"How my I help you, officer?\"\n\"By resisting arrest.\"\n\nFred Dekker, director of Night of the Creeps, The Monster Squad, and an episode of Tales from the Crypt, delivers Robocop 3.  The storyline for this picture was very average with some great action scenes, funny one-liners, and random use of our characters.  The acting is on par with the two previous pictures.\n\n\"Chicken shit! I'd eat a bullet, myself. Less showy.\"\n\nI came across this on HBOGO and decided to watch it again for the first time in a long time.  I always enjoyed this movie, probably more than the second film by a hair, but in a \"so bad it's good\" kind of way.  Overall, this is an okay addition to the science fiction genre that is worth watching once for fans of the genre and/or series.\n \n\"All right, if you gotta \"RoboCop,\" you got an AlienCop? Huh? You gotta GhostCop?\"\n\nGrade: C",
            "review_date": "2016-06-03",
            "source": "rt"
        },
        {
            "content": "Fred Dekker directs the final installment of the \"RoboCop\" series with \"RoboCop 3\" released in 1993.  This film greatly reduced the amount of gore in an attempt to garner a \"PG-13\" rating when Orion Pictures realized kids like RoboCop.  How many kids are really going to understand what's going on in this picture, which is bad but an improvement over the second installment.  Peter Weller doesn't return as the title character, instead Robert John Burke is the cyborg cop here to protect the innocent and uphold the law.  There really isn't much of a difference between Burke and Weller in terms of performance since there is very little emotion the character ever portrays.",
            "review_date": "2016-04-25",
            "source": "rt"
        },
        {
            "content": "2.5/5  Robocop 3 had potential but wasted it.  The story was interesting, but the scaled-down violence and the lame 3rd act bring the movie down.",
            "review_date": "2016-04-18",
            "source": "rt"
        },
        {
            "content": "Nesse filme Robocop virou piada!",
            "review_date": "2016-04-01",
            "source": "rt"
        },
        {
            "content": "This 3rd installment of the hit classic \" Robocop \" film was very good, we know that this movies are going to be good once we see it. It had great action scenes and good paced. The only thing I did not liked was the PG-13 rating, the others have been R, and the actor of Robocop should have been from the last 2, that's the only mistake but in the other hand the movie was great and its definitely a classic. So for this being a good 3rd installment, I give \" Robocop 3 \" a B-.",
            "review_date": "2016-03-26",
            "source": "rt"
        },
        {
            "content": "ahahha this is ... GARBAGE",
            "review_date": "2016-03-07",
            "source": "rt"
        },
        {
            "content": "Not only that it's shit, It's also the worst Robocop film ever!\n\nScore: 1.5/10",
            "review_date": "2016-01-30",
            "source": "rt"
        },
        {
            "content": "RoboCop 3, is the worst movie, in the series and movie history. Doesn't make any sense with the whole story, and is just a terrible movie in general.",
            "review_date": "2016-01-26",
            "source": "rt"
        },
        {
            "content": "It started off with an interesting story and the n it just lost me. I don't like Robocop's new voice and the story just bored and barely kept my interest. 2/5",
            "review_date": "2015-12-15",
            "source": "rt"
        },
        {
            "content": "I enjoyed it. Graphics threw me off while he was flying around but that wasn't until  the last 5 minutes of the movie.",
            "review_date": "2015-11-27",
            "source": "rt"
        },
        {
            "content": "\"RoboCop 3\" is definitely the worst movie of the \"RoboCop\" trilogy. The film directors tried to make scenes cool by RoboCop shooting the top of a car to exit it. \"RoboCop 3\" is very difficult to watch it is a cheesie movie with terrible acting, boring action scenes and plot holes. Also if you are planning to watch this movie do not watch the trailer first, it'll spoil the whole movie for you.\n\"RoboCop 3\" is a bad movie and I give it a 2/10",
            "review_date": "2015-11-03",
            "source": "rt"
        },
        {
            "content": "Many years ago, I was almost addicted to the first two Robocop films, hence I was sure I would have seen this completion of the trilogy. Somehow it has totally bypassed me though, yet I'm not a bit disappointed. Having waited all this time, it's not a patch on the other two, and the action, the stars, and the general storyline have all petered out into nothing. This is summed up by the fact that one of the main characters is killed off near the beginning, no doubt due to their realisation that the film is going to be crap. I believe it has tried to continue where the others left off but to be honest it's very difficult to follow what's going on. Whereas in the past films, the villains have been influential in the success of the movie, in this one they are weak, unmemorable and hardly portrayed throughout. The main stars have been drafted in from nowhere and other than the inclusion of Robocop himself, a neutral would not realise that this is actually a second sequel as opposed to an Independent action movie in its own right. It's basically scenes of poor acting, followed by lots of gunfire repeated throughout and it just gets boring. On this evidence, they should have stopped at two episodes, whilst it was still a successful 80's franchise. In reality though, I suspect like me, many people were not even aware of this ones existence due to its poor showing. I've never seen a review with such a poor critics rating (3%), but I'm not even sure it deserves that. Definitely not recommendable, even if you are a super fan of the series.",
            "review_date": "2015-10-25",
            "source": "rt"
        },
        {
            "content": "Best RoboCop of the first 3. There is no city government of Detroit. Its all been foreclosed on & liquidated by what is now a giant multi-national conclomerate. It hires a private mercenary force \"REHAB\" to evict the last of the low income residents who rebel with the privatized cops all quitting to help defend the last of affordable housing called \"Cadilac\" village.",
            "review_date": "2015-09-28",
            "source": "rt"
        },
        {
            "content": "Yeah....I am just going to pretend that this movie never existed. ",
            "review_date": "2015-08-19",
            "source": "rt"
        },
        {
            "content": "It's... the worst of the series!",
            "review_date": "2015-07-28",
            "source": "rt"
        },
        {
            "content": "The lowest point on the franchise.",
            "review_date": "2015-07-14",
            "source": "rt"
        },
        {
            "content": "One of the worst sequels I've ever seen. The green screen was shit. Everything was done 100% wrong in this movie. This and Jaws: The Revenge are the two of the worst sequels I've ever seen well, besides Spy Kids 4, Daddy Day Camp",
            "review_date": "2015-06-25",
            "source": "rt"
        },
        {
            "content": "It's pretty horrible",
            "review_date": "2015-06-06",
            "source": "rt"
        },
        {
            "content": "They ran out of steam on the last one of the franchise. Roboslop.",
            "review_date": "2015-05-02",
            "source": "rt"
        },
        {
            "content": "Not as horrible as I was expecting but pretty brutal.",
            "review_date": "2015-04-21",
            "source": "rt"
        },
        {
            "content": "This is the only RoboCop movie that I don't like. I like the cheesy classic RoboCop movies but this one took it way too far. Not to mention those hilariously poor action scenes and the idiotic plot that totally goes nowhere.",
            "review_date": "2015-02-28",
            "source": "rt"
        },
        {
            "content": "By and large, this movie was essentially a rehash of the previous RoboCop films, stripped of nearly everything that made the original RoboCop film great, and anything that made RoboCop 2 even slightly worth watching. Although I'll admit that the movie has its fair share of enjoyably silly moments, the whole experience felt scaled down, and this has a detrimental effect on the overall quality of the film. The acting was noticeably sub-par, and what didn't help is that they recast RoboCop. For me, the absence of Peter Weller from the title role is the worst part, because Weller was able to really deliver good performances as the title character. This film's version, however, seems far more lifeless than previous incarnations, and no hints of personality can change that. The production values were decent, but they seem very outdated, especially in the more CGI-heavy scenes, which suffer a kind of redundancy that usually happens in the third movie. The action would be a redeeming quality, except much of it has been neutered, presumably to attract a wider audience. There's really nothing much left to say, except that it was a poor exercise at rehashing a movie that had already tapped whatever potential the series had. Although, as far as pointless movie sequels go, I'd say that there are far worse films out there.",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "Seriously, avoid at all costs! No where near as good as the first 2. Peter Weller was smart not reprising his role as Robocop for this very BORING flick that's worthy of being mocked by the MST3K crew. 0 out'ta 10 stars.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "Enjoyed this movie. Kinda a guilty pleasure. Had some ok action. Decent movie overall.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "Worst in the franchise do not see",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "After reading Frank Miller's Robocop- I finally understand why this movie was made... about half of this movie follows the graphic novel and half of robocop 2 follows the graphic novel. Both films could've easily been combined to make one film that sort of had the spirit of Miller's book but instead they decided to cash in on 2 bad films instead of making 1 good one.",
            "review_date": "2014-12-25",
            "source": "rt"
        },
        {
            "content": "Still a good instalment but no Peter weller as Robocop people were not happy about that but it's a ok film with a good storyline and great acting.",
            "review_date": "2014-12-21",
            "source": "rt"
        },
        {
            "content": "Much better than the second film. I actually liked it a lot.",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "This was terrible OMG worst then the reboot LMAO",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "Ok, this movie had ALOT of flaws, I mean ALOT.. But it didn't stop me from liking it! It's kinda on the same level with 2.. This movie was pretty entertaining!",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "Has a few enjoyable action sequences, but RoboCop 3 is painfully weighed down by terrible writing, sub-par acting, and poor treatment of its characters.",
            "review_date": "2014-08-31",
            "source": "rt"
        },
        {
            "content": "BAD. BAD. BAD. INCREDIBLY BAD. Where is the Gore? Where is the action? Where is RoboCop, the Real RoboCop? This is not RoboCop, he is not idiot like in this film! he can't fly! Oh my god! What have you done with him, guys? I can't believe it. RoboCop is flying...that effect made me cry...WHY? WHY? Neither entertaining...i don't know, but it is one of the worst sequel i never seen. BAD. BAAAD.",
            "review_date": "2014-08-31",
            "source": "rt"
        },
        {
            "content": "Man, with three of these sci-fi films, that near feature is getting a whole lot nearer, and it's still nearly 50 years away from 1993. It might not take Detroit that long to reach total dystopia (I joke, but Detroit already hit the bankruptcy they were predicting to happen in 2035 in 2013), because at the rate destruction is going on over there, the filmmakers could have just stood around Detroit and waited for a building to collapse before they started rolling, then they wouldn't have blown so much money that they didn't get back to go watch them demolish some buildings in Atlanta, Georgia, for the Winter Olympics. RoboCop needs to be less concerned with the financial crises of Detroit in this film, and more concerned about the financial crisis faced by this bomb of a film... and about how there's someone else in his RoboBody, or whatever you call it! Yeah, Peter Weller finally bailed out (Poor Robert John Burke still had his face remolded like Weller's, though), and Nancy Allen is still stuck, but for the only so long, because she got out of this train wreck as quickly as she could. I don't know, maybe the Rotten Tomatoes critics thought it would be cute to see if they could get the approval rating of \"RoboCop 3\" down to 3%. I mean, come one, this is our third outing with a cyborg police officer, so did the filmmakers really expect our patience with something like this to hold up for a third installment? ...Well, I didn't, but here I am, that one other jerk who actually likes the film (Leave some room in that sinking credibility ship for me, David Nusair), which isn't to say that I can't see where a lot of people are coming from.\r\n\r\nOne can debate if this film is quite as overlong as the longer and convoluted \"RoboCop 2\", but because it doesn't try so hard to bloat its narrative, this fluffy affair kind of outstays its welcome at about 105 minutes, fattened up around the edges by a little too much filler, and even some excess in material. The material at least feels excessive once the storytelling finds itself spending too much time with each segment, to where a sense of progression is retarded by major plot points' taking too long to be touched upon, if not by focal unevenness. If nothing else is consistent about the storytelling, it's formula, because a lot of the laziness of this film is reflected in the taking of a once-unique premise and interpreting it in a hopelessly derivative, very '90s action plot, complete, of course, with cheese. The fluff of the film has been viciously condemned, but, honestly, I don't really find the cheesiness of the film quite as cloying as people say, and yet, it's impossible to deny that this film is just plain corny, with more than a few supporting performances which range from flat and borderline embarrassing, and make lame lowlights in dialogue and humor all the more aggravating. The story itself gets a little cheesy, not exactly being asinine, like many say, but nonetheless being either too fluffy or too overblown, to where most any form of dramatic value which was found in the predecessors is lost. The final product compensates with thorough entertainment value, at least in my apparently questionable opinion, but this isn't anything memorable, nor is it especially intriguing while it occupies your time, and bombards you with excess, clichés and cheese. I can't promise the readers that they will stand among the odd men out, but as one of the odd men out, I feel that there is plenty of entertainment value to embrace, with the help of technical proficiency.\r\n\r\nNow, we all know just how lazy these \"threequels\" in a late-'80s/early'90s action film can get, so I even expecting the effects to be questionable, unprepared for them to look about as clean as they ever had in this series, being, not quite as technically ambitious as, say, \"RoboCop 2\", but flashy and convincing enough to help sell this futuristic world, and, of course, compliment action. You always had action to fall back on the predecessors, and although you don't have the flashy gore to fall back on here, there are still plenty of dynamically staged, technically exceptional and entertaining brawls and shootouts which, at the very least, marks heights in entertainment value, even if they don't do as much as they could have for a sense of consequence. Everyone is talking about how they had the nerve to dial down the violence and disturbances for a PG-13 rating, and although I don't find that this film is losing too much of an edge, the action is bloodless, although it is nonetheless fun, and even more recurrent. With that said, the action is still far from consistent, and entertainment value cannot thrive on it the whole way, at least enough for you to get past how silly, overblown an formulaic this film's premise is, but, honestly, there's still plenty of color, maybe even intrigue to this story for Fred Dekker and Frank Miller to do justice with a script that is uneven and, at times, terribly cheesy and trite, but admittedly with more than a few funny moments to help memorable set pieces in keeping liveliness consistent. The film may be overdrawn, but it's never all that draggy, and if the story is as stupid as they say it is, I find a little difficulty in noticing, as structural pacing is kept up enough to establish color, or at least a potential for color to be explored by Dekker, as director. Dekker, as director, can make or break the engagement value of this film, and although his degree of inspiration is questionable, he never lets things slow down, keeping flashy enough with visuals and tight enough with his execution of the script to keep entertainment going through and through, and pretty high. With patience, one can find the film to be plenty of fun, and although it doesn't quite deliver on entertainment value quite like its predecessors, there is enough liveliness to make this a perfectly decent, if overblown fluff piece.\r\n\r\nBottom line, the film a little too long and even a little uneven, getting about as overblown with a silly, thin premise story as it does with conventions and cheesy fluff, but where this film could have fallen flat as the tremendous misfire many still claim it to be, fine effective, fun action, colorful scripting highlights and lively direction manage to save \"RoboCop 3\" as an inconsequential, but fun capper to the cult classic saga.\r\n\r\n2.5/5 - Fair",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "I don't know what they was thinking",
            "review_date": "2014-07-11",
            "source": "rt"
        },
        {
            "content": "This one was pretty stupid.  Had a hard time paying attention.",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "So bad it'll peel the paint of the walls!",
            "review_date": "2014-07-01",
            "source": "rt"
        },
        {
            "content": "It's not that bad at all. It doesn't look as obsolete as the second shitty movie and this one at least pays real homage to the first masterpiece part in every possible aspect from the very visual style - the cameras' work, everything (despite of course the PG-13 circumstance).",
            "review_date": "2014-06-22",
            "source": "rt"
        },
        {
            "content": "I can see why people despise this entry. But my nostalgia keeps me held to it. I still find it fun to watch even though it's dumb down more for younger audiences. It's just fun to watch Robocop.",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "starting to run out of gas",
            "review_date": "2014-06-03",
            "source": "rt"
        },
        {
            "content": "Robocop's third outing is so dire that by the mid point it has become a colossal, incoherent bore. Murphy (now played, poorly, by Robert John Burke) now protects a ragtag group of rebels who have been evicted from their homes by OCP, but something is deeply wrong with the plot when the hero spends most of the movie doing nothing while on the fritz. Fans of the first two film will also cry foul at the violence and language being sanitized for younger viewers. Fred Dekker's seemingly incompetent direction (this has to date been his last directing credit) leads to awful performances all round, and dull, poorly executed action scenes and special effects. Robo 3 is as deadly as they come in the world of franchise killers...",
            "review_date": "2014-05-19",
            "source": "rt"
        },
        {
            "content": "What they've tried to do is take one of the most violent films ever and turn it into a kids film. They removed everything that made the first film so great.",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "I wish I could give this movie a 6th star.",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "Awesome movie!!  It was action-packed, intense, and entertaining!!  The movie had some cool action scenes!!  It won't have you glued to the screen the entire time like the first 2 Robocop movies did!!   The cast was great!!  Robert John Burke was just as awesome as Peter Weller as Robocop!!  You could barely tell the difference!!  If you want this movie to live up to the hype of the the first 2 Robocop movies, than you may be very disappointed!!  It was pretty slow at times!!  If you want to seat back and enjoy a popcorn flick with very bad and cheesy fight scenes at the end, than this is must-see!!",
            "review_date": "2014-03-21",
            "source": "rt"
        },
        {
            "content": "see to view the reboot",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "I hate this movie so much",
            "review_date": "2014-03-06",
            "source": "rt"
        },
        {
            "content": "i am a really big robocop fan wasn't so sure i wanted to see the remake but so glad i did went to go see i saw it twice\n in the theatre great movie",
            "review_date": "2014-03-03",
            "source": "rt"
        },
        {
            "content": "horrible story, horrible acting.  Lewis was the best one......",
            "review_date": "2014-02-28",
            "source": "rt"
        },
        {
            "content": "Robocop 1 = Terminator\nRobocop 2 = Terminator vs Transformers\nRobocop 3 = Iron Man\nRobocop 4 = Iron Man x 1984",
            "review_date": "2014-02-27",
            "source": "rt"
        },
        {
            "content": "Robocop flies. even Peter Weller couldn't be bothered with this one.",
            "review_date": "2014-02-20",
            "source": "rt"
        },
        {
            "content": "I can't believe they made me actually want a remake.but they did it.",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "worst movie I have ever seen",
            "review_date": "2014-02-14",
            "source": "rt"
        },
        {
            "content": "I still gotta give it this much props even though it was short out of expectation.",
            "review_date": "2014-02-13",
            "source": "rt"
        },
        {
            "content": "ah. What do you want me to say? did I like it? because  I honestly dont really know how to answer that.O - O",
            "review_date": "2014-02-11",
            "source": "rt"
        },
        {
            "content": "This film is not the greatest and bookends a sad decline in the Robocop trilogy.  In general, the story is good as it continues with the arc of OPC's attempt to privatize and own Detroit City, which is a concept I enjoy.  However, like Robocop 2, the fail to delve into the human story of Robocop enough.  Also, this film has toned down violence and a child side-kick, making it feel very diluted compared to the first film.  The special effects are not great and detract from the film.  It does have a few funny lines here and there, but in the end, it just doesn't hold up to the rest of the series.",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "it is somehow a bad movie",
            "review_date": "2014-02-07",
            "source": "rt"
        },
        {
            "content": "Robocop 3 the death of a francise, enough said.",
            "review_date": "2014-02-07",
            "source": "rt"
        },
        {
            "content": "The bite from the original has gone, leaving only generic action, cutesy kids, jetpacks and moralising on the virtues of family - but whatever happened to Fred Dekker?",
            "review_date": "2014-02-07",
            "source": "rt"
        },
        {
            "content": "RoboCop 3 is the weakest and last fainting gasp of the series. While not technically terrible, Robo 3 is just nothing reliable and works on stuff seen already in many other movies, all but the first two RoboCop movies.\r\n\r\nThe story is bland and boring, the new characters are nothing special, RoboCop has no evolution, the action is dull, the effects are dull, the villain is boring, the lack of crudeness is highly noticeable, and the ending is as sporadic as the other two movies. I really never felt that this movie tried anything, it never got my attention, I never felt comfortable, I never felt alive, I never felt anything. I take movies as experiences, and sadly, RoboCop 3 was just an unnecessary and empty experience. It doesn't feel human, it doesn't deliver any emotion, not even bad ones...and that's humanely insulting.\r\n\r\nIt does have one or two good things, but they are buried by the movie's emptiness and never gets to reach the surface. This is a movie that literally leaved me with nothing, and I'm sure I'll soon forget that it exists. This was just a plain dreadful experience, even if it technically wasn't painful at all...it just felt all ghostly, never alive or interested on anything. My friends call me Maineutral, but this movie can call me \"dead\", as dead as the day is long.",
            "review_date": "2014-02-05",
            "source": "rt"
        },
        {
            "content": "I'd say forget the critics, this is far better than the first, popcorn movie at its best! Frank Miller has overdone himself with this fabulous story, coming from a lousy script of the previous film. The villains are even better, who better to counter Robocop than Japanese Cyborg Ninjas, too bad they are short-lived in their encounters. Plus we get to see Robocop gets an upgrade, a flight suit and an awesome firepower gun hand.",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "No Peter Weller?! there is no god!!!:(. D",
            "review_date": "2014-02-03",
            "source": "rt"
        },
        {
            "content": "It sucks it's very weird",
            "review_date": "2014-02-02",
            "source": "rt"
        },
        {
            "content": "An Underdeveloped Script, Toned Down Action, Laughable Script, Bad Performances, Aimed At A Younger Audience, An Absence Of Peter Weller. This Film Is A Disaster, But Watchable. This Film Kicked Of A Viewable Decent Short Lived TV Series, Which Tod Down The Violence Further, Before Resurrecting As Prime Directives A 6-Hour Mini-Series, Which Brought The Action Level Up Again But Nowhere Near The Standards Of The First 2 Films.",
            "review_date": "2014-01-29",
            "source": "rt"
        },
        {
            "content": "What did I watch?  Whatever it was, it was not a film.  This sequel to the also extremely terrible Robocop 2 follows a rebellion of Detroit citizens in order to prevent their homes from being taken by OCP military officials.  This turns Robocop into a major joke by rehashing story elements, containing lots of clichÃ (C)s that are also poorly executed thanks to an awful script by director Fred Dekker and Frank Miller.  What surprises me is that Miller is a very talented writer (also created Sin City and co-wrote as well as co-directed the film adaptation, which was really good, and he degrades himself to writing a cringe worthy follow-up to an undisputed classic.  The film also has many elements and story points that feel forced, unrealistic, and more towards generic sci-fi.  The film also suffers from bad acting, especially from Robert John Burke, who replaced Peter Weller, as Robocop, who sounds nasal, no doubt about it.  Another detraction is the poor dialogue that make this film completely laughable, unlike the humor in this film that completely undermined the sophistication of the original.  The film doesn't have the intelligence of the original in terms of satire, graphic violence, and of course, which was stated before, humor.  The PG-13 rating reveals that they knew this would flop, and toned down the beloved graphic violence and language in order to have a wider audience, but that never worked, since the film flopped and caused Orion Pictures to go bankrupt and shut down for good.  Poorly executed, and disgraceful.  Never see this movie.  EVER!",
            "review_date": "2014-01-26",
            "source": "rt"
        },
        {
            "content": "I heard terrible things about this movie so I was skeptical about watching it. In truth this is a fairly enjoyable film, its not the greatest film ever but I thoroughly enjoyed it and I think is the strongest of the sequels. Murphy was recast but it doesnt matter as this was a damn enjoyable film as OCP go head to head with the rebels who they tried to make homeless. Die hard fans in all honesty should like this but if you are an action fan theres nothing wrong with enjoying this one",
            "review_date": "2014-01-24",
            "source": "rt"
        },
        {
            "content": "all i can remember from this film is that i did not enjoy it, and i would not re-watch it even for nostalgia's sake.",
            "review_date": "2014-01-21",
            "source": "rt"
        },
        {
            "content": "L'idée de départ était bonne.",
            "review_date": "2014-01-16",
            "source": "rt"
        },
        {
            "content": "If a zero star was available a zero star it would have gotten. Peter Weller had sense enough to get out after two, the PG-13 doesn't help, & the script arrived D.O.A. I just pretend this film never happened & it's a shame an iconic film like the original Robocop has to end like this.",
            "review_date": "2013-12-28",
            "source": "rt"
        },
        {
            "content": "A very unnecesary sequel...",
            "review_date": "2013-11-17",
            "source": "rt"
        },
        {
            "content": "There was a time when the only Robocop movie I had seen was the first one, I wish that was the way it stayed. Robocop 3 sees a Japanese takeover of OCP which has taken over Detroit completely. That's an interesting idea, however, it just gets dumb by the third act. It was a promising idea but never took off into a good movie.",
            "review_date": "2013-10-25",
            "source": "rt"
        },
        {
            "content": "un excelente final para esta tgrilogia",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "too many clichés ... and.... nah.. something is missing :P",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "There are but a few isolated scraps of enthusiasm and intrigue left in this dried-up, third entry of a series that has turned from laudable to laughable.",
            "review_date": "2013-09-13",
            "source": "rt"
        },
        {
            "content": "Why no Peter Weller?",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "More good natured, and kid friendly this last installment is at least not messy or wreaks of cash in.  Unfortunately this movie lost almost everything that made the first film great.  The satire is barely there, the more edgy tone is gone, and Peter Weller is gone.  What we're replaced with is an actor that plays Robo awkwardly, and hijinks that panders to a more family friendly crowd.  This is just a weak film all around with only marginal entertainment value.",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "Robocop adopts a new family and joins an underground resistance to battle the merciless OCP and Kanemitsu Corporations. Can he aid the people of old Detroit against these corporations and defeat their evil ninja robots called Otomo?. This movie is really really terrible I mean just a lame action flick with the worst actor to play Robocop.",
            "review_date": "2013-06-18",
            "source": "rt"
        },
        {
            "content": "memorable for the cheese factor.",
            "review_date": "2013-06-10",
            "source": "rt"
        },
        {
            "content": "the robocop trilogy gets old by this film but its still alright",
            "review_date": "2013-05-28",
            "source": "rt"
        },
        {
            "content": "Great cast, better than the 2nd, still not as good as the first",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "At least the second TRIED to respect the first film. This one just fucks it all up. Not necessarily a horrible movie but certainly a bad and predictably unnecessary one. The gore, the satire, etc, it's all gone. The movie aims to be a very cheesy, comedic, and sentimental action flick that just bored me to sleep.",
            "review_date": "2013-05-14",
            "source": "rt"
        },
        {
            "content": "PG-13?  Anne Lewis dies?  Peter Weller isn't Alex Murphy/Robocop?  Robot Ninjas?  Ed-209 treated like a puppet?  Robocop driving a PINK CADILLAC?  Yeah, this was trash.  To its credit the premise could've worked if they didn't make the mistakes I mentioned, but it is what it is.  My only fond memory of this film was the action figures I owned of it when I was younger, that's about it.  Needless to say, Robocop 3 is the weakest of the trilogy in nearly all aspects.",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "case of too much in one movie and although that can be a good thing but it isn't here :/  really just came up with a sequel to cash in on this franchise when they shouldn't of",
            "review_date": "2013-04-29",
            "source": "rt"
        },
        {
            "content": "Reminds me of a cheap version of Terminator 3",
            "review_date": "2013-04-19",
            "source": "rt"
        },
        {
            "content": "This is one of those films that is so hated beyond reason that it is amazing. When approaching this film for the first time, I was very aware of the criticisms given towards it. It is hard to avoid how hated this move is. I put off seeing this film for years. After finally seeing this film, I have to say that people's complaints are about as 2-dimensional as they come. They complain the actor is different: out of all the iconic roles, this one can easily be handled by another actor. Peter Weller is amazing, but playing a robot with a heart and a concealed face can be accomplished by another actor (and he wont even look different).  People complain that he can have a gun on his arm or get a jetpack--he is mostly machine and this one is set in the far future, so those arguments are invalid. People complain this is a boring people revolution film--you mean the plot-line that the first fil, sets up and is the entire premise of OCP.  \n\nIn reality, this is the only of the sequels to fulfill the promise made in the first one: to explore the humanity remaining in Robocop and really delve into the corruption of complete and total power (Delta City). Unlike the second or even most of the first film, this one has heart AND stakes. Ann Lewis' death isn't spontaneous, but built up with real purpose. It is the moment that defines Robocop as a human inside the machine. The Pg-13ness of it doesn't matter because this isn't an action film. It is a political sci-fi film. And I am sorry, but Anne Lewis' \"PG-13\" death is more powerful than any death in either of the first two movies.  People are upset by Robocop not killing endless amounts of \"scum\"--that's because this isn't about that. This one is through and through about Robocop finding his humanity.  It deals with real issues rather than being a smart, tongue-in-cheek action comedy.  It isn't even about Robocop. It is about the world of Robocop.\n\nIs this a B-movie? Yes, but if you think the first two are not such, than you aren't paying attention. So why is this so hated...its because no one expected or wanted a Robocop movie like this. People never like getting what they don't expect or hope for. If people could just remove their obsession from the first one, they could see that this isn't about being another Robocop movie. This is a film that is the best kind of sequel. It takes what worked about the first and goes in an entirely new direction. There can never be another Robocop, and why would you want a rehash? This film takes elements of the first and reworks them for a new purpose. Much like Dark Knight Rises, people expected a Batman 3, but instead got a dystopian sci-film set in Gotham. This doesn't make it bad. It makes it different.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "This movie is lacking a lot.. Dosen't live up to others at all.. You have new robocop ?! Also it's pg13 ?! Come on ... Where's  the blood ? Gore ? This story is meh as well .. Cops are fighting for sections of Detroit ? With the community helping as well , gang warfare ? Detroit WHaT ?!  Just lost me all together..",
            "review_date": "2013-04-02",
            "source": "rt"
        },
        {
            "content": "The disappearance of Peter Weller as the main protagonist in the film is quite tragic, and it definitely has an effect on the film.",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "the poster made me not wanna see the movie",
            "review_date": "2013-03-14",
            "source": "rt"
        },
        {
            "content": "The \"Omni Consumer Products (OCP)\" has tightened its grip on Detroit, to the point that the police department is now a division of the company. With the help of OCP's new Japanese owners funding everything, it appears that the dream of tearing down Detroit and replacing it with the advanced \"Delta City\" will finally happen. However, there are a citizens who have taken it upon themselves to fight using any means necessary -- including using violence and weaponry. \r\n\r\nTo tighten their grip on the citizens, \"OCP\" employs \"Rehab Teams\", which are basically military police headed by a maniacal leader named \"McDagget\" who employs even greater violence to try to bring the rebels to his brand of justice. However, after the death of his partner at the hands of the \"Rehab Team\" lead by \"McDagget\" himself, the rebels have a new partner in their fight -- \"RoboCop\" (Robert Burke). \r\n\r\nThis is not the greatest way to end the cult favorite movie trilogy. It is probably the most forgettable of the entire series in fact. \r\n\r\nAlthough the story is pretty good, the script is not the best. And because of the weak script, the performances are only fair. \r\n\r\nThe one thing that seriously hurt this movie is that it is PG-13, while the others were rated R. Because of the rating, the action sequences are very much less violent than the other two, and the language is toned down quite a bit. I believe they were trying to market \"RoboCop\" to a more broader audience at this time. They released a cartoon series for television, and had \"RoboCop\" come to the aid of a professional wrestler known as Sting in a heavily hyped appearance on a World Championship Wrestling pay-per-view telecast (the PPV was even titled \"Capitol Combat '90: The Return of RoboCop\"). If you ask me, this was a serious mistake like when they turned \"Rambo\" into a cartoon. \r\n\r\nAnother problem with this film is that the budget is lower than the previous instalments. The first movie was known for the incredible special effects, make-up and obvious stop-motion effects. In first movie had major splatter when the \"bullets\" hit their target, that was obviously missing in this film. \r\n\r\nNone of the performances stood out, with a slight exception of Burke, who takes over the title role from Peter Weller. There was also some problems with the development of the new characters introduced in this movie. \r\n\r\nSad to say, I can only recommend this one if you happen upon it on HBO or On Demand. It's not the perfect movie, but it is pretty much watchable.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "You know how the first two RoboCop films were ultra-violent affairs of varying quality? They both had funny moments, and they both had blood and bullets flying everywhere? Say goodbye to those with RoboCop 3, a film that went for a PG-13 rating. The filmmakers removed any sort of comedy -- whether that was done to keep it family friendly or not is up for debate -- and all of the action has been significantly toned down. So, yes, the kiddies can see this but anyone who saw the first film, and the second one, too, I suppose, will want to give it a miss.\n\nDetroit is still a war zone in RoboCop 3, although the drug from the second film is not to blame. OCP, the evil corporation from both earlier films, is driving people from their homes with their \"Rehabilitators\" -- people who force people into quarantine zones so that the company can flatten houses and build apartment buildings. It's cleaning up the city in its own way, although it seems immoral to anyone who is actually watching it.\n\nRoboCop (now played by Robery Burke instead of Peter Weller, not that it matters considering you rarely get to see his whole face), is also cleaning up the streets in the way that cops normally try to. His partner, Anne (Nancy Allen reprises her role, for a brief time), is also there, although they're more sympathetic to the rebel forces that are forming. Eventually, and soon enough into the film for it not to be a major spoiler, Anne is killed and RoboCop joins the \"good\" guys in order to take down the corporation that has caused everyone just so much grief.\n\nFrom here, you can pretty much see where the film is going to go. The only new element is that OCP has been taken over by a Japanese company, so the villain that will actually challenge RoboCop -- considering bullets and ordinary weapons are grossly inefficient in dealing with him -- is a ninja played by Bruce Locke. Yes, we're at the point in the series when we're having the barely mobile robot getting involved in hand-to-hand combat scenes with a ninja. Oy vey.\n\nHow did nobody not think that this would be a bad idea? The first two films had guns and guns and more guns because they at least understood that the hero couldn't participate well in close combat situations. He can't even run; how is he supposed to have a fist fight? You've got to give the film credit for at least trying something different -- and it was no doubt done in an attempt to remove some of the bloody violence to acquire that PG-13 -- but this was simply the wrong way to go about it.\n\nIt didn't have to be this way, either. RoboCop actually gets a couple of upgrades this time around -- which I won't spoil -- and it would have been easy to make up a way to make him more mobile. This would have allowed for him to at least hold his own the fight scenes. Instead, we just watch the ninja run around, occasionally hit, do a flip every now and then, while RoboCop does nothing back. It's a stupid, stupid decision to have this as the final major action scene in the movie, and it makes the one from last film look genius in comparison.\n\nThe first couple of films had a sense of humor. While the first was far more enjoyable, the second almost matched it in terms of being funny. I can't remember one scene or line from RoboCop 3. The only somewhat dark moment came when a businessman, while talking to his wife, decides to jump out of a building, killing himself. The first or second film might have played it for a laugh; this one does it for shock -- except it's not shocking and it's quickly forgotten by everyone.\n\nI'd like to find a positive in the movie but I just can't. Perhaps saying that Robert Burke reminded me a lot of Peter Weller is a positive? Can we use that? Once the mask is on, it doesn't matter who is behind it. In fact, I'm almost surprised they took it off at all, as it wouldn't have been hard to leave it on for the entirety of the movie. If anything, Peter Weller was smart for not deciding to return for this installment, and I have to wonder if he tried to get his co-stars out as well. Most of them return, so if you like series continuity, at least there's that!\n\nRoboCop continues to be a boring character, although at least we go back to how he ended the first film and have him at least able to emote a little bit. He's decidedly more human than robot in this film, which at least makes him a little likable. But he's wooden, has difficulty being harmed -- although he does get hurt by this one in a way that didn't hurt him in a previous installment, which was weird -- and is just a less mobile, less powerful version of, say, Superman.\n\nAll of the freshness that was in the series is gone by this point. RoboCop 3, like a lot of third installments, is the worst in the bunch, and has very few, if any redeeming features. It made me hate the lead character more than I thought I could, even though it returned him to the way he ended the first film. The action and humor have both been toned down, removing exactly what made the first film -- and to a lesser extent, the second, too -- special. Don't give this movie even a second of consideration; it's an all-around dud.",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "Urggge this movie is terrible even one of my friends at a hobby shop called imperial hobbies in Richmond said this movie is terrible the characters just ticked me off.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "good movie for its time.  some of the special effects was kinda cheesy but I liked it.",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "With Detroit corrupt, Police are the bad guys and the only way to stop them is the resistance, and Robocop. A step up from number 2, but that's not saying too much.",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "Can we please forget this film happened? Anne Lewis deserved SO much better. :'(",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "What a horrible end to this trilogy.  The director seems to have no idea what Robocop was about.  The acting was atrocious, and was edited with a blindfold and butterknife.",
            "review_date": "2013-01-20",
            "source": "rt"
        }
    ]
}