{
    "rating": 9.0,
    "release_date": "Invalid",
    "num_reviews": 35,
    "genres": [
        "Hindi"
    ],
    "summary": "The life of Indian Army Capt. Vikram Batra, awarded with the Param Vir Chakra, India's highest award for valor for his actions during the 1999 Kargil War.",
    "reviews": [
        {
            "content": "Again india has out done them selves at making a spectacular movie. Totally captivating movie ..just down right best War movie we have ever seen, even though we had to read the subtitles it was like the actors were speaking our language..",
            "review_date": "2023-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good watch! Sidharth was great because I sat to watch the film with low expectations of him. His performance was convincing and sincere, and this has made me decide that I'm also going to watch Brothers (2015) next week! However, I wish the direction sat well with me. Loved the supporting cast!",
            "review_date": "2023-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "shabbir boxwala sir, choose cast & crew very nice",
            "review_date": "2022-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant , Got tears in the end",
            "review_date": "2022-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great tribute to capt vikram and army, after so long it was a great experience from a bollywood movie, The emotions and pride were beautifully showcased, The songs were soulful and the story and characters acting were good, The ending was just painfully brilliant the song makes it more emotional, It was a great bipoic and a brilliant Movie!",
            "review_date": "2022-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Looks so fake! Saving your friend in the middle of shootout? 1 v 7 and win by luck? Never get hit? one body shot and died? Unsatisfied",
            "review_date": "2022-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an average biopic fueled by patriotism, a fantastic soundtrack/jukebox and ... not much else. Don't expect a complex character study on Cap. Vikram Batra - the movie is quite shallow in its depiction of heroism. Watch it to have a good time for a couple of hours, because despite its narrative shortcomings, Shershaah is a film that is impossible not to fall in love with.\n\nFinal Rating: 72/100",
            "review_date": "2022-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The good movie but the plot is similar with late Karan Johar's film. Same formula is plain, heroic and little romance",
            "review_date": "2022-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies, superb script, acting and direction.",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional. Amazing movie. Best performance till date by Siddharth Malhotra.",
            "review_date": "2021-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pleasant tribute to the man, but not the best movie. The plot and dialogue were acceptable, but various plot points were extremely predictable, there was a lot of generic romance, I'm not convinced it was completely accurate to the true story, and the ending felt too abrupt. The characters were likeable, but some were a bit silly, most felt unoriginal, and nobody besides the main character really received much development. The main character was also presented in a faultless light. The pacing was reasonable, and the acting was solid considering the script. However, some of the cast looked a bit too attractive and clean to be in the military profession. The action was a mixed bag, with scenes being dragged out because people wanted to run into the firing line with no cover rather than just throwing grenades from behind cover. The main character also would have been killed early on in some of the fight scenes. Finally, the sets/props/costumes looked decent, and most visual effects weren't bad, but there was some shaky, handheld cinematography, and the soundtrack was too repetitive.",
            "review_date": "2021-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a very good movie.It touched heart .made me emotional throughout.Its not just a movie its an feeling .Just loved it.",
            "review_date": "2021-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film! Old fashioned in this regard: there's no irony here. Just love, family, honor, and patriotism.  No wonder critics don't like it ;)",
            "review_date": "2021-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The songs in the movie are too good and the movie is too good all the actors in the movie are given their best and Siddharth and kiara acted very well the story is about a great soldier Vikram Batra who lost his life in the war.\nMy opinion about the movie is must must watch it...",
            "review_date": "2021-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must watch movie. Shows the character of The Indian Army.",
            "review_date": "2021-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most inspiring and bravest story never seen/heard \n#shershaah\n#captianvikrambatra\n#army",
            "review_date": "2021-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One the best movie this movie tells us about the sacrifice of indian army especially Captain Vikram Batra \nWho get sahid in kargil war",
            "review_date": "2021-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must watch film..best hindi film in india  cinema .best biography film..superb writing, directing and stand by acting by sidhart Malhotra and Kiara advani",
            "review_date": "2021-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very nice action and emotional movie \nSalute to PVC CAPTION Vikram Batra Sir\nJai hind Jai Bharat 🙏🇮🇳",
            "review_date": "2021-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched Shershah twice and feel it is One of the best movie I have seen in last few years. I rank it higher than Tanha ji and Kesari even. Film has a strong grip from the very beginning",
            "review_date": "2021-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know why this movie so overrated. This movie is not worth watching. it was so boring . I continuously saw how much time were left while watching this movie.",
            "review_date": "2021-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know IMDB is rigged when an average movie like this is rated 8.9",
            "review_date": "2021-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh my god!!! what a realistic movie , best war movie must must watch.. Superbly acted and directed.",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie which is made once in a lifetime. Absolute must-watch! The war cries send chills down your spine.",
            "review_date": "2021-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome movie depicting the gallantry of captain Vikram Batra.",
            "review_date": "2021-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Shershaah\" does fall into some biopic and Bollywood movie tropes, but for the most part is still a solid entry in the war movie genre. It does a good job respecting what the movie is about and I thought most of the movie was fairly convincing. I thought there was plenty of intense action in the movie, but I would have liked some more exposition and depth to the main character. I think he is likable and easy to root for and empathize with, but some things definitely could have been explored further. I also thought the way the story presents an event near the end of the story at the beginning didn't make a lot of sense here and could have been edited differently. Nonetheless, this is a very competently made war movie that limits the more overdramatic tendencies of Bollywood movies to a minimum and is well worth checking out. It's one of those movies that I actually think could have benefitted from a theatrical experience if the circumstances were different, but as it stands, it is worth watching on the biggest screen at your disposal ideally with a good sound system. I think this because it is very immersive in many of the more intense moments and I felt entertained and even very emotionally invested by the end of the movie.",
            "review_date": "2021-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie ever... From acting to action,emotion,story of captain vikram batra(PVC) everything is top notch 🥰🥰\n#Blockbuster",
            "review_date": "2021-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best performance of siddhart malhotra \nMust watch... Well directed by vishnu and awesome vfx by red chillies",
            "review_date": "2021-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An average war flick. The scenery is shot beautifully.",
            "review_date": "2021-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding! Well done to the cast and crew.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shershaah is one of the best Bollywood films to come out in recent times. Capt. Vikram Batra was a true legend in every sense, the greatest hero of India 🇮🇳 Sidharth Malhotra not only played the role, he lived it. Kiara Advani was absolutely brilliant as well..",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Shershaah' is a wholesome and riveting biopic of a much-celebrated soldier.",
            "review_date": "2021-08-14",
            "source": "rt",
            "lang": "en"
        }
    ]
}