{
    "rating": 1.6,
    "release_date": "Invalid",
    "num_reviews": 150,
    "genres": [
        "Action"
    ],
    "summary": "Annie (Sandra Bullock) is looking forward to a Caribbean cruise with her cop boyfriend, Alex (Jason Patric), who purchased the tickets to make up for lying about working on the SWAT team. Their trip turns dangerous, however, when an explosion disables the ship's communication system and it becomes clear that the vessel is under someone else's control. Alex and Annie must fight for survival as they discover that John Geiger (Willem Dafoe), a crazed passenger, is behind the chaos.",
    "reviews": [
        {
            "content": "\"That Is One Big Pile Of Shiite.\"  \n~ Jeff Goldblum (Jurassic Park)",
            "review_date": "2023-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, hey, \"Speed 2: Cruise Control\" is nowhere near its predecessor.  In summary, the sequel of the movie \"Speed\" is not as good, but it is still passable.  The movie would be better if it were not a sequel to \"Speed\" and just were its own movie.  I mean, the boat ride was definitely thrilling, and Willem Dafoe plays a really good villain, who can crash the boat into an oil tanker.  I also really love the reggae music in the soundtrack.  The acting was not very good, but Sandra Bullock did OK with what she was provided.  The chemistry between Bullock and Jason Patric was just not there.  That's why this movie is out of focus.  However, if you love some great visuals, \"Speed 2: Cruise Control\" could be the movie for you! In conclusion, \"Speed 2: Cruise Control\" is nothing like its predecessor, but is still passable with popcorn.",
            "review_date": "2023-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These idiot passengers couldn't just evacuate like they were told because some cop wanted to be a hero",
            "review_date": "2023-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every mechanic or officer on that ship would know the diesel generator emergency button or some manual valve to cut off the fuel line.",
            "review_date": "2023-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jason Patric instead of Keanu is too unreliable, and the tension that existed in the first film is gone. It might have been better if it were a completely different movie called \"Cruise Control\" instead of a sequel to Speed, but it's still Speed. It is unmistakably a sequel to Speed. 0/5",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story was a third thought for what is an obvious cash grab. This is a shame though, as there are some great action set pieces, but this came out at the height of the style over substance period.",
            "review_date": "2022-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOVED S2. It's over-the-top and ridiculous action.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible Overall. While the opening scene is entertaining it is a slow slog downhill from there until the final 5 minutes. The best part of this film is the ending where you can tell most of the budget an effort went into and it is entertaining to watch. But is it worth the hour and a half investment to get there....absolutely not. The acting is wooden, silted and the actors have no chemistry at all. The dialogue is not good at all. The editing in this at times especially in the middle of the film is not good. The cinematography is very uneven at times. And the pacing absolutely feels terrible especially in the middle of the film where it feels it is going no where. The plot is very farfetched as well. Terrible Action Movie Overall.",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wonder why Jan de bont failed so badly when he directed the first film so well why did he change all of the sudden",
            "review_date": "2022-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its not as bad as most people say it is but it's definitely not close to the first film. Ya, some of the acting was subpar( I've seen worse)  and the dialogue wasnt exactly Oscar worthy but it's still a ok popcorn flick if nothing else is on.",
            "review_date": "2022-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dreadful sequel that is all spectacle, no excitement. Tries to be funny and fails every single time. So bad it felt like the studio refashioned an old, existing script into a \"Speed\" sequel. Instead it's just a terrible script that had to be revised to account for Keanu (smartly) bailing on the project.",
            "review_date": "2022-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No-one is going to fight the fact that Speed 2 is even nearly as good as Speed 1. However, It is a rather silly, fun and down--right crazy little flick you should really check out! It also acts as a summary for most 90s Action Sequels. Fun, unrealistic and not as good as the original!",
            "review_date": "2022-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sonic lord king lord lord king evil lord evil",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without Keanu Reeves, Speed 2 is like a balloon with a hole in it; no matter how much you cram into it, you can't fill it up.",
            "review_date": "2022-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is not as good as previous speed movie. Very predictable and catastrophic situations presented in this film looks obviously fake.",
            "review_date": "2022-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How did Sandra's career survive Speed 2?",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When Willem Defoe is even bad with lines like \"stay with me you're my hostage.\" You know Keanu is secretly a genius for not coming back.\nI remember in an interview Sandra Bullock it was mentioned that Jan de Bont made her a star. She then joked that Speed 2 will end her career. At least that didn't happen.",
            "review_date": "2021-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woof!  This movie is a terrible follow up to the original action classic SPEED.  It has one of the worst villains of all time, played by the great Willem Dafoe.  He is a computer genius that has terminal cancer...who puts leeches on his body to prolong his life.  Who came up with this character?  Jason Patric is dull as usual with his extremely limited acting range.  He makes Keanu Reeves look like Christian Bale. Sandra Bullock is also equally as bad, but hey I'm sure she got a big payday for this piece of garbage.",
            "review_date": "2021-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first one. I wish Keanu Reeves would have been recasted but overall, I very much enjoyed this movie.",
            "review_date": "2021-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Willem Dafoe's villainous role is entertainin' and the climax has some glorious large-scale property damage, but \"Speed 2: Cruise Control\" falls far short of its predecessor, and a tragic step-down at that. The rest of the acting (I'm not countin' Sandra Bullock here) is weak, the characterization is paper-thin, the writin' is laughable, the action sequences fail to generate any excitement, the plot devices are so unsurprisingly familiar, in fact, that they're very tired and poorly executed, and most importantly, placin' your sequel on a slow-moving cruise ship (and not somethin' quicker) is enough to guarantee that \"Speed 2\" is clearly dead on arrival. The comparatively lower stakes, don't help 'cause the hero has no reason to get involved  and most of the passengers are safely evacuated; only a few stay since we need tension. So yeah, in the hilariously one-sided battle in which ship-based film that 20th Century Studios released in 1997 was better, \"Titanic\" wins.",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though Willem Dafoe is entertaining as the bad guy and the climax does have some glorious large-scale property damage, Speed 2 is a sequel that's a tragic step down from its predecessor. The acting from the rest of the cast is weak, the characterisations are flat, the writing is laughable and, most importantly, placing your sequel on a slow-moving cruise ship is enough to guarantee that Cruise Control ended up being dead on arrival. The comparatively lower stakes don't help because the hero has no reason to get involved and most of the passengers are safely evacuated with a few sticking around because we need tension. So yeah, in the hilariously one-sided battle of which ship-based thriller from 20th Century Fox released in 1997 was better, Titanic wins.",
            "review_date": "2020-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sandy, see what happens when you leave Keanu for Jason Patric in a Hawaiian shirt (and head for a PG-13 rating in the process)? You get \"Speed 2: Cruise Control,\" and Keanu makes \"The Last Time I Committed Suicide.\" It's not a good look for anyone. But it IS a good look for me to give \"Die Hard on a slow-movin' cruise ship\" The Burnin' Medallion Of Badness. Characters: 0.5/5 Story: 0/5 Acting: 0/5 Special Effects: 1/5 Direction: 0/5 Cinematography: 0.5/5 Soundtrack: 1/5 Overall: 1/5",
            "review_date": "2020-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's one of the worst action movies",
            "review_date": "2020-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so ridiculously stupid it's worth watching once just for a laugh",
            "review_date": "2020-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The same people that hated this movie probably loved Star Wars The Last Jedi.. I love the sequel and its predecessor.",
            "review_date": "2020-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why did they make a sequel. Terrible movie.",
            "review_date": "2020-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Taken on its own it is an ok thriller just don't think of it as Speed.",
            "review_date": "2020-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst sequels I've ever seen. Has terrible acting, a very stupid story, little to no action, and was an insult to first film overall. Thank God Mr. Reeves chose not to do this film.",
            "review_date": "2020-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really had higher hopes for this movie. Speed 1 is a silly fun action movie, but this is just ridiculous.",
            "review_date": "2020-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Please let this end.  please.  'Nough said.",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What were the people behind this movie thinking? This film makes little sense and they stretched the running time to 2 FREAKING HOURS! The original movie with Keanu Reeves was so much better than this. The original was a film that can only be done once. No sequels or remakes after that. Speed 2 Cruise control is a prime example of that. You got pretty bad acting, the plot is weak, the directing wasn't very good at all. To be honest, I would probably listen to the score by mark mancina because I think the music is pretty good but not as good as The music for speed and twister. If you want to watch this film for yourself, then go right ahead.",
            "review_date": "2020-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Swaying coconut trees, sunshine, blue skis but having LOVED the original \"Speed\" w Keanu we went to the opening of Speed: Cruise control.\n\nSPOILER ALERT!  We laughed so hard that the tourists must have thought all islanders were loco.  Middle of DEM!                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               we went into so far as to get out of sun.\n\nTerrible plot, horrendous   E                                                            K                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          X  X",
            "review_date": "2020-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From a bus now to a cruise liner!",
            "review_date": "2020-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The last five minutes consist of the largest and most expensive stunt (still to this day) ever filmed, costing about a quarter of the entire $100 million budget. Had only they spent a fraction of that on hiring an actual screenwriter and enticing Keanu back, perhaps this titanic mistake might not have sunk so quickly—it's failure being the only speedy thing about the sequel.\n\nCannonical scale: 5/5 — \"Annie, come back! You're my hostage!\" (spoken by Dafoe as an even more evil, leech-instead-of-fruit Steve Jobs)",
            "review_date": "2019-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this with my homegirl ana de armas. Movie sucked but after that we ran into josh and he was being rude and called her Katherine Langford. I was embarassed and left with Ana to get food and I dropped her off at home. I didn’t speak to josh for 2 months ",
            "review_date": "2019-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this movie with my best friend Josh at the drive in. When I was taking him home he started to press the cruise control option and we almost crashed. I then yelled at him and kicked him out of the car for not keeping his hands to himself. Didn’t speak to him for 2 months ",
            "review_date": "2019-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While i know how hated this movie is, i failed to see it as one of the worst sequels ever made. It had a somewhat good plot, decent acting, a massive stunt near the end and a great hammy performance by Willem Dafoe. It has a few good things in it and while i can argue it is a bad really movie, its most defiently not one of the worst ones I've seen. I've seen much worse sequels out there~",
            "review_date": "2019-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's better than SpiceWorld ",
            "review_date": "2019-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Compelling and gripping, Speed 2 Cruise Control improves upon the original and remains one of the best action movies to date. Brilliant performances and spotless direction as well as amazing visuals help turn this film into a truly entertaining masterwork.",
            "review_date": "2019-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure why such a poor score, i thought it was ok. Not amazing, but worth a watch. Open disclosure, i'm a big Sandra Bullock fan!",
            "review_date": "2019-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true 90s sequel fail with 1 impressive \"money shot\": the near-collision of a cruise ship and an oil tanker that eventually crashes into a Caribbean coastal town.",
            "review_date": "2018-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sandra Bullock at her finest! Jason Patric is amazing.  This movie gets a bad rep, but honestly I liked it and even bought it on DVD.",
            "review_date": "2018-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "of course movie is not as good as the first but entertaining as its own movie but a speed sequel it is not.",
            "review_date": "2018-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is no speed. This movie is one of the worst I have ever seen",
            "review_date": "2018-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After 5 minutes I got more enjoyment in finding the numerous (deliberate?) mistakes!",
            "review_date": "2018-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Keanu is a genius for turning this crap down.",
            "review_date": "2018-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1928 Was 69 Years Old In 1997.",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't remember the first one being a comedy, so why did they try with this one. Sandra bullock is the worst in this on top of some of the worst dialogue since farts announced their arrival. Oh the sign language scene with the robot neck girl, That's all I can say about that. Obviously sandra bullocks character is bad luck, all men run. Why did they really think we would care about the extras, Just let them die.\n\nMy Caaaar.",
            "review_date": "2017-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Speed 2: Cruise Control begins with a humorous reference to its prequel, as Annie (Sandra Bullock) recklessly speeds through busy streets while filling in the audience as to what happened to her former love interest, Jack. This comedic entrance by Sandra Bullock leaves views laughing at the frightened expression on her passenger's face. We see a man on a motorcycle struggle to catch up to a truck, and it's not hard to guess that the male protagonist is on the daredevil motorcyclist. \nLater, in the movie, as the couple boards a crew, we see a realistic boat scene, with beautiful details all around. It makes the entire movie come alive, until one of the actors says their line. The sub-par acting left the audience unable to focus on the fantastic special effects and the  amazing details of each scene. The plot dragged along, leaving viewers dozing off during the multiple irrelevant scenes we've seen several times before. \nIn the end, Speed 2: Cruise Control has deceived us into believing it was a thriller, while in reality it was nothing more than a travesty.",
            "review_date": "2017-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aesthetically benign and largely dull and uninteresting, not even Sandra Bullock can save this flick from being one giant sleeping pill. The final action sequence of the boat crashing through countless objects, jettys, vehicles, buildings etc is great fun and very well done but it really is the only decent thing about the movie.",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie starts off dumb and only goes down hill from there.",
            "review_date": "2017-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man, this was AWFUL!",
            "review_date": "2017-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true guilty pleasure. The concept is atrocious. The story is atrocious. Sandra Bullock is atrocious. Jason Patric is atrocious. The ending is abysmal. The only ship that makes it way through this storm is Willem Dafoe who as always, knows how to steal the show.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first movie was better than this",
            "review_date": "2017-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was NO damn reason to make a sequel to a good movie.",
            "review_date": "2016-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After finding nothing to watch yesterday, and immediately following the original Speed on IFC, I decided to watch Speed 2.  HUGE mistake.  From the beginning, Jason Patric seemed out of place...definitely not an action hero.  Boring and lifeless.  But it's the ridiculousness of this movie that made me shake my head.  A rogue cruise ship heading straight toward a port and no one on land knows it?  A huge ship is barreling through the port, and the other small boats and skiers don't notice until it hits them?  And then running into the port itself...shouldn't that massive ship have run onto land long before it went a few blocks into the town?  Come on...at least make it believable.  It was such a joke, and I'm sorry I wasted my time on this piece of junk.",
            "review_date": "2016-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On the basis that this was supposed to be a B movie taken with some seriousness, it is absolutely horrendous.",
            "review_date": "2016-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It made me hate the water. And when does rush hour hit the water? During a rainstorm! Worst tag line EVER!!",
            "review_date": "2016-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "honestly I think it was a great movie not the best and certainly not better than the original however in its own right as a sequel speed film it did good. I also love the relationship between Alex and Annie.",
            "review_date": "2016-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fuck me this is so bad the original is all you need to see avoid this",
            "review_date": "2016-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely not as good as the first one. They should have had Keanu Reeves in stead of Sandra Bullock as lead actor.",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not even close to it's prequel, but still a fun flick to watch",
            "review_date": "2015-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know what this movie has tried but It does'nt had worked!!!",
            "review_date": "2015-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What the hell where they thinking with this movie....serves little other than as a disgrace  to all involved.",
            "review_date": "2015-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While its concept has some potential and might have worked better outside of the franchise, as a sequel to Speed it is a far cry in quality due to Willem Dafoe\u0092s cartoonish presence, lack of continual suspense, and action that is surprisingly underwhelming aside from the finale\u0092s over-the-top stunts.",
            "review_date": "2015-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good for a laugh.",
            "review_date": "2015-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A major fall off from the original that failed to keep my interest and couldn't deliver on any of its promises.",
            "review_date": "2015-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's probably one of the worst sequels ever I love first speed but this one is not even what the first one was and it does not have the same cast so there is one of ur main problem also just not a good plot and just boring",
            "review_date": "2015-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why did they make a sequel. Terrible movie.",
            "review_date": "2015-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cruise ship taken over is more dangerous than a bomb on a bus.",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absurd, Acting, Script, Action....",
            "review_date": "2014-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really unnecessary sequel that did not need to be made. This film fails in every way to live up to its very entertaining predecessor and I was not surprised to see why this movie sucked. Jason Patric takes Keanu Reeves place and he is one of the most forgettable action stars I have seen in recent memory. The first 30 minutes are an absolute borefest and the characters were just really uninteresting and you don't end up caring about anybody you see on screen. When the action did start on the boat, it was surprisingly tensionless and I didn't feel any tension or suspense happening. All the moments of humor did not work and there was a lot of stupid moments that just had my eyes rolling. What happened this time Jan de Bont? You did an excellent job directing the first one and here you just really dropped the ball because the pace is as slow as a boat and every character is cardboard cutout. The original Speed succeed at being an non-stop fast paced thrill ride with well done action sequences and it is one of the best action films of the 90s.    The only real time when the movie got a little bit interesting was during the final half hour when the boat crashed on the town and there was a mildly suspenseful chase, and the special effects were pretty solid in those sequences. Overall, this is a completely forgettable sequel that you should just avoid and you are better off watching the original Speed that is 100% better.",
            "review_date": "2014-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really think Speed should've been a stand alone film because the fact that the sequel takes place in a cruise ship is not exciting at all. Now I understand why it's known as one of the worst sequels to a great film ever, if not, the worst. It's boring, the writing is so bad, and it's annoying. I never felt so annoyed in a film in a long time, and I don't remember Sandra Bullock being so annoying in the first one, or the character being so stupid in it either. I really like Sandra Bullock, but why did she think it was a good idea? Keanu Reeves did a great choice of not being in the film, but for his character, they seem to not care about it and gave a reason of his character's exit so fast and so sudden that we didn't know what just happen. The character is replaced by a bland character and Jason Patric was bland too. Everybody seem to be either sleepwalking, or just act annoying. The only one that's having fun in it is Willem Dafoe. But even his crazy, in an enjoyable way, acting is not enough to save this atrocious of a sequel. Even if it's a stand alone film, it still would've been terrible and be so stupid. The movie should've been short, or just not be made, it really shouldn't be this long and just felt like 4 hours went by, and it looks like they are just making up more plot devices to make it even longer. I honestly thought Speed 2 - Cruise Control was going to be so bad in a funny and enjoyable way, but it just end up making it so infuriatingly bad that I feel bad for people that watched this irritating pointless sequel to an amazing film. Makes me glad that there's no Speed 3 and it shows that the movie was just made to make money.",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What kind of a sequel is this? What a complete joke and disappointment. Speed is amazing and action packed and it is a great action film with a great cast. I think it was a good idea to makdwe a sequel and it could have been a good one. Speed 2 is far from good. I gave Speed 4 and a half stars and Speed 2 drops all the way to half a star. It is a shame that Keanu Reeves didn't return from the first film but at least Sandra Bullock returned. Keanu Reeves was meant to reprise his role as Jack Traven but he declined it as he didn't like the script. Instead Jason Patric takes his place. Keanu Reeves was praised for not returning as Speed 2 was awful and a total box office bomb. Both Sandra Bullock and Jason Patric regret starring in Speed 2 and I don't blame them. They must be embarrassed starring in Speed 2. I think director Jan De Bont found it hard to do a good job second time round because Speed is so good and his other films are not very good at all. Speed 2 could and should have been so much better. What a joke!!! This film might as well be called slow because it is just a slow moving cruise ship not a speeding bus.",
            "review_date": "2014-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is quite possibly the worst action sequel ever created by man. Speed was a fantastic movie but this abomination is cheesy, boring, and humiliating to watch.",
            "review_date": "2014-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rousing summer adventure movie at sea.",
            "review_date": "2014-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The critics may rubbish it,but there have been many many worse action flicks.\nUnbelievable with terrible storyline yes but it passes a couple of hours.",
            "review_date": "2014-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At least it can be said, surprisingly, that Jan de Bont actually has some artistic integrity. He didn't want to make this and didn't see Speed having any sequel potential, unfortunately though, he was contractually obligated to make this because Hollywood gotta have that money! \n\nThe first thing that jumps out at any audience member is with them thinking, 'How is this going to work on a boat?' Speed was Speed because it was on a bus that had to go over 50, dodging pretty much every obstacle imaginable. The cruise is on water with pretty much nothing in the way for most of the duration of the movie. Right there someone should have realised that this wasn't going to work and the fact that it is 2 hours makes it all the worse. This was originally thought of as a Die Hard story and while that would work this really doesn't. I can't believe 5 people wrote this. \n\nThat being said it isn't all awful, while the characters might be a tad more goofy this time around I don't think it was entirely out of place. Bullock still remains a likeable screen presence with humor and Dafoe is always great as the bad guy with Patric doing the best he can with what is given and it was great to see Glenn Plummer again. It also has some good build up but does get into the boat maybe a tad too quick. The movie also has some spectacular set pieces, namely the one right at the end that cost a quarter of the movie's budget. Ultimately that isn't enough and the movie is just kind of, 'eh'.\n\nThe story was written by 5 people and it's near identical to the original and even has some of the same plot twists, including the villains story, was anybody even paying attention? Still though, I gave it a chance and for about 45 minutes I didn't really understand the hate, but the rest of the movie happened and the cheesy dialogue started to settle in. That 2 hour running time really works against it so much, I couldn't really choose any scenes that should have been taken out but it was still too long for its own good. Again, I gave it a chance and I can't say I hated every second of my time watching it, the movie went by at a fine pace and I can't say I was ever bored but I really wasn't involved as much as I was with the first one. With the original, I was glued to the screen and couldn't look away, with this I checked my phone every now and then to see if I had an email or something, the movie just didn't grab me. It isn't as exciting visually and I think that's where it failed for a lot of people, besides a few set pieces at the start and the massive one at the end, there isn't that much to look at besides people hurriedly running around a boat and while that would work for any given action movie, for a 'Speed' movie, it really works against it. \n\nSpeed 2 might come up short in almost every way to the original, it's still a decent action movie by itself, take out Speed from the title, call it something else and I'm sure the reviews wouldn't have been so bad. The movie badly needed a rewrite to make the story feel more like a Speed movie, one idea they had was a plane that couldn't go above a certain height and in concept alone that sounds a lot better and more like a Speed movie than this movie actually is. It isn't great but I didn't hate it. They're also trying way too hard to make a catchphrase out of the 'relationships based on intense...' line, even though they change it everytime they say it, Joss Whedon is sorely missed. At least Keanu Reeves was smart and 'jumped ship' on this project to tour with his band.",
            "review_date": "2014-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "But it got TWO THUMBS UP!",
            "review_date": "2014-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So dang fun but is really a crappy poorly written mess #willem",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst sequels I have ever seen ... It should have been left with 1 film",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only good thing about this film is Willian Defoe as the gisgrunted bomer, the rest is boring. The first film was what the title said, simply called \"Speed\" as it was exactly what the title meant, this horrible sequel is very slow, boring and tedious. It was a crime to class this as a sequel to the amazing first film, it might've got a little bit of respect it it was just called Cruise Control because there is no speed, just a boat going slightly first...and that's it. The action is poor and even the good bits are so-so. It's amazing that that this is directed by the same person who made the first film. The characters are annoying and have no heart to them and the film dumbed down to a wider audience that I suspect didn't really care about. It's a poor action thriller and to long for what it is. In fact if you watched the trailer, you've basically seen the film. It's a complete lack of story that explains why this expensive production from the proficient creator of Speed and Twister sputters out on the high seas. The thing is De Bont remains an expert director of action, but putting the reference to CRUISE control in the title serves as fair warning of an unengaged filmmaker on automatic pilot. Avoid at all costs. If they had to do a sequel, why not set it on a train...it'd be a lot faster",
            "review_date": "2014-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sequels to original ideas are not the best ideas. Decent enough though to sit through.",
            "review_date": "2014-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great example of what not to do with a sequel to a classic action flick.",
            "review_date": "2014-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They really should take \"Speed 2\" out of it and call it just Cruise Control, that's pretty much why everyone hates Die Hard 5 and Halloween 3",
            "review_date": "2014-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie drags on- and never stops.",
            "review_date": "2014-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Speed ??2 features a completely stupid script with pesima dirrecion and defraundo seculea long as this does not generate as much action as the first generated.",
            "review_date": "2014-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie so ridiculously \"big, dumb action movie\" it's hard not to love.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely not better than the first one.  In fact very far from it.",
            "review_date": "2014-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Antithetical to its predecessor in every way, this is one of the worst films ever made which is astounding when you consider how great speed was and the otherwise talented cast.",
            "review_date": "2014-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Speed 2 sees Jason Patric who was the main character in lost boys which I only found out 10 years later as the main police officer who is seeing Sandra Bullock although she doesn't know he's a cop. This time the adventure takes place on a cruise liner what's on it's way to the caribbean. Soon the developer of the boats system hacks into it which causes major problems for everyone on board",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very disappointing sequel. This film looks like a cheap straight to DVD type of film. Bullock is horrible in it so is the rest of the cast & the storyline. They could have done much much better and obviously have the greatest idea of them all....which would have been to never actually make a sequel. how about that Hollywood!",
            "review_date": "2014-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "32%\n\nWhen a villainous laugh goes on to long. The chainsaw bit was good though.\n\n\"This will do.\"-Annie Porter (Sandra Bullock)\n\nNo, it won't.",
            "review_date": "2014-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a film with \"speed\" in the title, this is some pretty boring stuff.",
            "review_date": "2014-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the worst movies I've ever seen. The only good part was at the end when Sandra Bullock is taking driving lessons and a bus goes flying by. She makes a remark that the bus was way out of control. That's it. The cast should give back their salaries for this movie.",
            "review_date": "2013-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sandra is a fine a actress and plays a dumb ass American really well. The rest of the cast put in fine performances giving lots of panic and the usual false types of emotions associated with American made movies. The script is as weak as the story line making this at best a reasonable TV movie that will entertain moderately. Nibbles: Peanut and Onion Quiche.",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Oh my god we are gonna die because this cruise ship is going way way to fast.\"\n-No One\n\nHorrible, Horrible Sequel",
            "review_date": "2013-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first one was so good, and then...",
            "review_date": "2013-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its one of those sequels that has the same director as the first yet nothing feels as fresh or fun as its predecessor. This movie is slightly better than most would say but that really isn't saying much. Its still not a good movie. It has goofy thrills but I never once cared about what the outcome would be. I also thought almost every character was incredibly cartoonish and the situation was bland and over the top. I mean for a movie that is entitled \"Speed 2\", a cruise ship is rather slow. The lack of care towards the semi thrilling moments make the film feel so uninteresting and it must have been so disappointing to those who saw this film all those years ago. Its a below average movie full of cliches and dumb moments. Can't say I can recommend it to anyone, let alone fans of the original 1994 \"Speed\".",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even close to the 1st one!",
            "review_date": "2013-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok, and I thought that Speed was bad because of Reeves. Now I know better. If you see this movie, don't walk away, sprint away from it.",
            "review_date": "2013-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I felt that this film was better than every other person says. I was able to watch the first movie, then this, and still respect both. I was interested most of the time, but it is only worth watching once.",
            "review_date": "2013-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "on a boat really?. This movie is a f''king waste of my time and others too, Just a big ball of dog crap from the makes of the movie. horrible acting, unspeakable visual effect's and laughable sense which they were met to be serious but this movie is so Bad that It is hard to talk about really.",
            "review_date": "2013-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Die Hard on a bus' and now...yep you guessed it 'Die Hard on a boat', well cruise liner. I guess the first thing that instantly jumps out at you here is the fact the film is called Speed 2 but its on a slow moving cruiser liner!. Hardly speed is it, more like err...cruising, I get the feeling they just wanted to use a cruise ship so they could use their highly imaginative tag of 'cruise control'.\n\nSeriously I've read into this and there were some really decent ideas for a follow up. Nothing original of course, they all copied the exact same premise as the original but at least they could offer up some more thrills than a cruise liner. One plot involved a plane that couldn't ascend above 10,000 feet whilst flying through some mountains, kinda daft but sounds better right?\n\nSo this basically really absolutely is a complete 'Die Hard' rip off, it really is. Recently fired crazy ass Dafoe wants revenge on the company (ships computer systems) that wrongfully terminated him because he was ill. So he decides to sabotage one of his own computer systems on board a large expensive cruise liner and steer it into a disaster whilst pinching all the valuables on board. Again at the end of the day he's just after some jewellery, weak. Its pretty much 'Die Hard/Under Siege' with more comedy and way way less blood and violence, actually check that, there is hardly any blood and violence in this, its bordering on PG territory.\n\nBullock's character has dumped Jack Traven from the first much better film and now she's with the receding hair line of Jason Patric. I guess what's so dumb about this film is firstly Patric just doesn't come across as the hero type, oh sure he's leaping around and trying to be action man every five minutes but the guy just looks anything but. I know heroes don't have to be muscle bound macho men with good hair but Patric? really?? this guy is the wrong kind of actor for a role like this. The other thing that bugs you is the fact his character is such a fudging goodie goodie and always trying to save everyone. Even on board this cruise liner which he knows nothing about, doesn't have a clue where to go and basically shouldn't be poking his nose into anything, he still goes around barking orders at the crew! and they obey him!!! as if!!! in reality they'd tell him to flip off.\n\nBullock is completely sidelined to virtually a cameo really, she does nothing at all other than offer up terrible dialog attempting to be comic relief. She's even more annoying than in the first film and even more wet (situation aside), in fact the badly portrayed passengers are not as annoying as Bullock. Then you have Dafoe as the villain, well I say villain but he isn't really that evil, he merely switches off all the electrics and gets everybody to evacuate. Would stuff on a ship tend to blow up and cause so much destruction when the electrics go down? seems odd.\n\nFunny thing is if everybody had just gotten off as he demanded in the first place, none of the ensuing mess would of occured!...well almost.\n\nI realise Dafoe's baddie character knows the ship inside out and can control whatever he likes but you always get the feeling he's not much of a challenge. Time and again it seems like he could of been caught plus he also comes across as someone Bullock could beat in a fight. His plan also seems very over indulgent simply for stealing some jewels, takes him half the film to get it set up yet takes him fives minutes to do the deed. He then messes around for no real reason when he could of just gotten away no problem, all this kinda makes the action sequences seem unnecessary and forced.\n\nThe film is way more goofy than the first and hardly feels like a real action film at all. There is way too much stupid comedy and idiotic dialog...oh and some awful reoccurring character cameos from the first film which almost make the film into a parody. Even Dafoe's baddie isn't immune to the ridiculous daftness, he contributes with various silly faces to exaggerate the heat of the moment.\n\nThe film does look pretty good I can't deny, the ship interiors, exteriors and various CGI shots are nicely done. This all comes to a head in the finale where De Bont takes the opportunity to destroy half a port town by ramming the cruise liner into it purely to show off lots of destruction and fancy effects/models. Even that doesn't really work though because of the awful comic relief which ruins any real tension. This is the films fault all the way through, you never at any point feel nervous or tense despite the fact you're watching an action film about a hijacking. The whole thing is totally juvenile and not in the least bit exciting, and no sticking Patric on a cool motorbike chase sequence at the start doesn't make him look any cooler, just more out of place.",
            "review_date": "2013-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An insipid piece of garbage, Speed 2: Cruise Control is over the top and incredibly stupid.  When Annie Porter goes on a Caribbean cruise with her new boyfriend the ship is taken over by a terrorist.  The film stars Sandra Bullock, Jason Patric, and Willem Dafoe, but not one of them gives a decent performance.  And the writing is just terrible, especially the dialog.  Still, some of the action is entertaining for a while.  Speed 2: Cruise Control is formulaic tripe that tries to be as big and as loud as it can, without any regard for the story or the characters.",
            "review_date": "2013-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At least Willem Dafoe is certifiably insane as the villain.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely entertaining..!",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably one of the worst movies ever made. Laughably bad.",
            "review_date": "2013-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another good example of sequell sucks",
            "review_date": "2013-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Willem is just great, he plays the bad men very well! The movie on the other hand is just fine, passable.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Annie\" (Sandra Bullock) has apparently recovered the trauma of the hijacked bus she was a part of a few years ago. She moved on from \"Jack\", the hero of the bus incident whom she hooked up with, and is now dating a new beau, who is also a cop, \"Alex\" (Jason Patric). The two go on a romantic cruise, with the crew mistaking them as a couple on their honeymoon not knowing that \"Alex\" is carrying a ring in his pocket. \r\n\r\nThen it happens. A crazed man (Willem Dafoe), who created the ship's software, hijacks the boat with plans to steal the multi-million dollar jewel collection that is being stored on board. \r\n\r\nNow, \"Alex\" goes in full cop mode, despite being well into international waters and out of his jurisdiction, and tries to stop the maniac's plans, while saving the ship and all those still on board. \r\n\r\nFirst off, the movie lacks the drama that the first film had. In my opinion, the first movie had an equal amount of drama and action. I just didn't feel the drama the first movie had. Also, the action really did not kick in until the last quarter of the movie. Yes, the movie had action through out, but there was just too much breathing room between action sequences in this film. \r\n\r\nThere are some good special effects in this film. Some good explosions, and the water pouring onto the ship. However, the water coming onto the ship has been seen way too many times in other movies with a cruise ship, and is not spectacular. \r\n\r\nAs for the performances in the film, it's not bad. I felt that there was some pretty bad character development with the majority of the supporting cast. Also, there was little chemistry between Bullock and Patric -- there was some, but not enough to make them a really believable couple. Dafoe is a very good madman, but I felt as if he was holding back a bit. \r\n\r\nI would say that this might be a good rental if your first four choices are not available. It's a fine sequel, but not a perfect sequel.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This made me extremely grumpy, I mean who thinks pepper spray is perfume!? The whole movie I'm rooting for them to break up!! I played my favorite game \"guess what comes next\" and guess what, I got a perfect score 10/10!  If you want intestinal distress then I recommend watching this film",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Relationships based on extreme circumstances they rarely work out.\" Neither does this movie.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not as good as the first but it does have sandra bullock and you know my rule....",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being the sequel to Speed, it is actually quite a snail. Wait, that's not fair, snails are faster and more interesting.",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, but utter crap!\nHow can they call it a happy ending when they blew up an oil tanker in the Caribbean?!!!  Surely this is an environmental disaster!?!",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best part of this movie is the lame-ass pun title.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crap crap crap.  How can a movie be called \"Speed\" if the subject of the movie (i.e. the cruise liner) is not capable of more than 5km/h???",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just as good as the first speed this doesn't fail to bring the action. Defoe is menacing as the bad guy.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I still think this is the worst movie ever made.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not very good.....at all",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Remember that bus that couldn't slow down?...how about a boat?\"\n\"Great! Here's money!\"",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This sequel is so awful that not only does it not understand anything that made the first film so awesome, but it also sucks so bad that it even fails to understand its title which features the word \"speed\" in it, which this film doesn't have. The cruise ship premise is terrible since cruise ships aren't particularly fast, making each action scene extremely dull. Also, apparently the character Annie seems to gotten quite stupid since the last film, as well as annoying, which left me wishing that she would be thrown overboard. Jason Patric also doesn't do much for the film either since he possesses no charisma whatsoever as an action hero, and whose stupid actions in the film end up killing many innocent people. In fact, the only actor whose performance I liked was Willem Dafoe, who was the only redeeming quality in this shitty action film due to his wonderfully loony performance. Other than him, this film has no redeeming qualities since the plot is retarded, the acting is generally shitty along with the dialogue, the action scenes are spectacularly awful, there is no suspense or character development, and it's also extremely boring and stupid. Speed 2 is one of the worst sequels I've ever seen, and considering the sheer number of hated sequels I've enjoyed, it takes a special kind of shitty sequel to get on my bad side. Why anyone thought this was a good idea I'll never know.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a horrible copy of the first film.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why did they make this? seriously though",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sorry. Nowhere near as good as the first.",
            "review_date": "2012-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why would you do a second?",
            "review_date": "2012-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was okay. There was no need for a sequel really, though.",
            "review_date": "2012-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crappy sequel. Really applaud the first one too..",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Has a few good references and some same elements of the original, but it's not as good since they overdone some parts in this sequel. (C+)",
            "review_date": "2012-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sad sequel to the early 90's hit with Bullock and Patrick playing a vacationing couple who save the day when a madman (overbearing and overacting Willem Dafoe) commandeers their cruise ship.Director Jan DeBont still pours energy into the effects, but the story and performances lack that polish and care. ",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Speed 2 plays out as one of THOSE kinda 90's action/adventure films while being completely utterly and unintentionally satire. It's not terrible but it isn't too fun either... And Willem Dafoe plays a horrible villain!",
            "review_date": "2012-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What the fuck? That's all I have to say. That and, this movie shoudn't have happened without Keanu.",
            "review_date": "2012-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only does it not compare to the first, it's an awful action flick alltogether.",
            "review_date": "2012-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not as good as the 1st",
            "review_date": "2012-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie series, Must See On Blu-Ray to appreciate....",
            "review_date": "2012-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Believe the hype, it really is that bad. Not even that fun to mock, which is a shame.",
            "review_date": "2012-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too drunk to pay attention but Willem Dafoe's face is beyond words.",
            "review_date": "2012-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like Titanic, but way more fuckin' awesome with more shit blowin' up and less bullshit.",
            "review_date": "2012-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow what a horribly lame executed piece of crap crap crap crap crap! You may remember that fast-paced movie named Speed back in 1994. it was so successful that they naturally talked about making a sequel. Let's see the first problem: The story starts off with some new guy being the main hero instead of Keanu Reeves; not even one minute in and the already a problem has arose but that's all Reeves' fault as he declined the role saying he's not ready to do another action film again and went onto The Devil's Advocate which was actually good! So yeah, Annie porter has a new boyfriend named Alex as she dumped the previous Jack Traven worrying about his dangerous lifestyle. (well trust me, this gets a lot stupider than you think!) They both book a vacation on a cruise ship when their holiday is disrupted by the computer system's designer, John Geiger threatens to take over the vessel so that he can include a diamond hijacking plot to the scheme. Speed 2 was a fucking disaster and I can see why; The writing is bullshit, Keanu Reeves is gone, the new lead actor is rubbish, the direction is painfully poor and I don't even know why the other actors like Sandra Bullock and Willem Dafoe took part in this, even if they had a special reason of their own I mean come on, speeding up on a friggin' cruise ship- are you really that serious? Speed 2: Cruise Control gets a 1/10.",
            "review_date": "2012-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the bottom 3 worst movies I have ever seen in my life.",
            "review_date": "2012-09-23",
            "source": "rt",
            "lang": "en"
        }
    ]
}