{
    "rating": 5.4,
    "release_date": "Invalid",
    "num_reviews": 86,
    "genres": [
        "Kids&family",
        "Adventure",
        "Animation"
    ],
    "summary": "In this animated adaptation of the Bible story, Moses (Christian Slater) hears the voice of God (Elliott Gould) from a burning bush, which inspires him to confront Egypt's pharaoh (Alfred Molina) and demand freedom for the Israelite slaves. The pharaoh agrees after a series of horrific plagues, and Moses leads the Israelites through the parted Red Sea into the harsh freedom of the desert. There he ascends Mount Sinai and returns with the Ten Commandments. The narration is by Ben Kingsley.",
    "reviews": [
        {
            "content": "What a terrible movie about Moses that my Mother forced us to watch.  We could have watched Prince of Egypt. BUT NO... we had to watch this steaming pile of crap with some of the worst character models and animation I've seen.",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this more than once as a kid and quite enjoyed it.  It's definitely more accurate than the original.  And I never found anything wrong with the animation, either.  It didn't bother me, at least.  Definitely worth a watch.",
            "review_date": "2018-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Animation is beyond awful and the voice acting is pretty average at best. But other than that not bad. Though definitely not in Ten Commandments or Prince Of Egypts league.",
            "review_date": "2017-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Ten Commandments (2007) ??\nHorrendously bad animated movie detailing Moses, Hebrews, destination at Mount Sinai, etc. Where's Cecil B. DeMille when you really need him!?",
            "review_date": "2016-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring and slow! Can't compare to the Classic Ten Commandments! $ave your money and skip this film.",
            "review_date": "2014-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is amazingly accurate in the Moses Story. It follows the bible's account to the T.  The animation was brilliant. I am astonished at the poor reviews this film has been given. I think that the animation was as best The Prince of Egypt film from Dreamworks. It did bother me a little to see no sign of Moses' family after his marriage but I don't think that was intricacy part of the film. The movie was telling the story of Moses and that it succeed.\n\nwww.what-to-watch.com",
            "review_date": "2013-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "be scared of the lord",
            "review_date": "2012-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike previous versions, this take on the classic Exodus tale is dumbed down for little children. Combine that with unimpressive animation and cheesy dialougue, and you have one film that won't be seeing the promised land anytime soon.",
            "review_date": "2012-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considering the obvious low budget, they did a good job.  However, the script and characters could have gone under better development.  I wouldn't pay to see this, but I would watch it for free.",
            "review_date": "2012-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only difference between this and \"The Prince of Egypt\" is the different, okay animation with being the CGI animated version of the whole, original story with some additional bits. (C+)\n\n(Full review TBA)",
            "review_date": "2012-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty boring take on the story, but it is still a good movie.  Tells the same story as other movies, but the animation makes it more watchable as it cuts down on the length and focuses more on the story than other aspects.  It is recommended for all ages, and it will keep you engrossed from start to finish.  There is a better version of this called Prince of Egypt, but if that is not available, this is a fine substitute.",
            "review_date": "2012-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this with some school kids, its actually very good, and good for adults too the familiar story of Moses and the Exodus. Good animation.",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even Alfred Molina can save this mess. Gotta give him credit for trying, though.",
            "review_date": "2011-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This story has been told a time or two before, and the latest incarnation is a lackluster and shoddy animated film that will turn off almost any viewer. This film has enough good intentions to fill an ark, and it was obviously intended to be easily digested by kids but the movie's sub par animation and lousy voice work leaves a lot to be desired. I think the filmmakers sorely misjudged just how sophisticated today's kids have become. \r\nThis clunky relic is a throwback to the old \"Davey and Goliath\" Sunday morning show, but it's way too serious to even be any fun like that program was. I did somewhat admire this for taking itself seriously and not throwing in a lot of Disney-like talking animals or catchy songs to punch things up, but there has to be some kind of compromise if you want to get your point across to your intended target audience.\r\nI have a high tolerance for boredom, but even I had all but given up on this at the halfway point. All those good intentions helped the directors assemble an impressive list of actors to provide the voices, but like the animation, the dubbing is embarrassingly primitive. The makers would have had more luck getting Stan and Cartman to teach kids bible lessons. At least they would have paid attention.\r\nThis feels more like Sunday school than an entertaining night at the movies. It is misguided in almost every way possible.",
            "review_date": "2010-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the animation isn't the best, this is a great retelling of an already fascinating Bible story.",
            "review_date": "2010-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation was beyond stupid and ugly! Even God would be disappointed in this poor animated bible adaptation! Don't spend your money on this movie, spend it on a real bible.",
            "review_date": "2010-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i like animated movies. nice and qt one. something for the kids to enjoy and for those who are kids in their hearts. (lol)",
            "review_date": "2010-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting take on the story.",
            "review_date": "2010-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Christian propaganda aside, telemovie snooze fest.",
            "review_date": "2010-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the original",
            "review_date": "2009-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": ":fresh: [CENTER]One of the greatest Bible films of all time.[/CENTER]",
            "review_date": "2009-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little too long but a great movie nonetheless",
            "review_date": "2009-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is obvious so let's look to other concerns about this movie:\r\n\r\nThe voice over is great concerning Moses, but some of the other's are unconvincing. The animation is a little sketchy as sometimes it seems as if people are moving way to fast and sometimes do not move as clean cut as some animation films I have seen. This is 2008 and that is unexcuseable for any film. \r\n\r\nHowever, the story was told well and down to the tee-in which that made it slightly enjoyable. I think it could of been more children related, as it is animated, however my little nephew that I sit down to watch it with was hardly engaged. The dialogue at time seemed a bit stale.\r\n\r\nDont let this review stop you from watching this one though. It's not by all means a BAD movie, but for an animation film in todays age, it's lacking.",
            "review_date": "2008-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "... barely belongs in the $5 DVD bargain-bin (or as a free gift when you sign up with your local evangelicals).",
            "review_date": "2008-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All in all, not a very good re-telling of the famous Exodus account.  This movie sails through the entire history in 1hr 28min...needless to say, leaving little time to develop anything.  Some cheesy lines and not the best animation.  Watch \"The Prince of Egypt\" instead.",
            "review_date": "2008-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a good family film. great for kids.",
            "review_date": "2008-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "come on! its the ten dommandments!",
            "review_date": "2008-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie, especially if you know about the story of the 10 commandments",
            "review_date": "2008-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has the worst animation I have ever seen. the All-Star cast really doesn't make up for it at all.",
            "review_date": "2008-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally saw it.  Great stuff.",
            "review_date": "2008-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pretty nice animation .. even the story was not like what i expected .. perhaps since it is for kids audience .. so too many storyline that being pushed too hard ..",
            "review_date": "2008-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First off the animation was just terrible.  Secondly the voice acting was just as bad.  Christian Slater as Moses are you kidding?  Elliot Gould is God.  Was Martin Short busy?  If you want to see a good adaptation, watch the Prince of Egypt.",
            "review_date": "2008-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The latest CG animation, The Ten Commandments, retells the epic story of Moses and is the first of a planned trilogy of biblical tales.\n\nSpanning his birth to death in just under 90 mins, The Ten Commandments covers a lot of ground indeed.  And as an educational exercise for kids it is a valid effort but as a cinematic piece of entertainment it falls sadly short off the mark.\n\nEven narrated by the great Ben Kingsley, the film doesnâ\u0080\u0099t come close to capturing the magic of animations such as Shrek or Toy Story.\n\nElliot Gould voices God to great effect.  Christian Slater as Moses is a bit of a misfire. He simply doesnâ\u0080\u0099t have the range or depth in his voice to give the character the necessary gravitas.\n\nThese days, animated features are not only brilliant in their execution but they are big business.  Competition is tight for that all-important kidsâ\u0080\u0099 market, so I was really surprised at the clumsiness of The Ten Commandments.\n\nThe characters appeared wooden and the American voices and humour didnâ\u0080\u0099t sit well with the subject matter.\n\nI do find the story of Moses fascinating and as a straight retelling, it is clear and coherent. But I just hope the animation in the remaining two stories improve, because the poor quality CGI in this film greatly hinders the final effect.\n\nAs a way to introduce your children to bible stories this film could be for you, 2 stars.",
            "review_date": "2008-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 10 commandments shows the human beens they are.No one is good all have sinned.there is nothing called good people cause simply no one is good, but thier is something called forgiven people.Are u one of theme",
            "review_date": "2008-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost unmitigated crap. Being a children's film does not constitute an excuse for mediocrity of this sort.",
            "review_date": "2008-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good movie, it kept me on edge. I wanted to keep wtching even after the movie was done.",
            "review_date": "2008-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed it.  I only wish it would have tied in more to Cecil B. DeMille's 1956 version. But it's a great interpretation of a great story.",
            "review_date": "2008-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an OK re-telling of an ancient story.",
            "review_date": "2008-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good kid version-great movie to open up conversation about God's faithfulness and mercy.  Yes, it's cheesy and poorly animated, but it's a good movie without sexual inuendos or language and has a biblical message-that's hard to find!",
            "review_date": "2008-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok. Very beautiful cartoon like look. Some minor parts are not biblical though. I particularly hated this fat guy figure in it. I also personally don't think Hebrews had light skin and blue eyes at that time.",
            "review_date": "2008-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible animation. Horrible re-telling.....TERRIBLE ! Everything pales to the Prince of Egypt",
            "review_date": "2008-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This animated feature relates the historic story of the Hebrews' Exodus out of egyptian bondage. We follow Moses from his childhood as the adopted son of Pharaoh to his adulthood as the chosen one of God and liberator of His children. i have seen old one that is really still nice two more movies were released in 2006 if you have seen those two  movie the then commandmensts please let me know.",
            "review_date": "2008-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought I would love this, but just watching the trailer alone is enough to give anyone a migraine....",
            "review_date": "2008-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First of all, this movie has been adapted for the screen enough already! And this was a bad version. That's all that I have to say about that.",
            "review_date": "2008-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie got rid of everything you didn't like about The Prince Of Egypt (the terrible songs) and then got rid of everything you did  like about The Prince Of Egypt (cel animation, casting choices that made sense).",
            "review_date": "2008-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this because it's a 3D Animation movie.",
            "review_date": "2008-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "~*To be honest, I got bored by it.  I liked how it was more accurate than \"The Prince of Egypt\" in some areas, but it was like watching \"The Prince of Egypt\" only computerized.*~",
            "review_date": "2008-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a few issues with accuracy and also the characters tended to appear wooden - some fo the special effects pretty nice though",
            "review_date": "2008-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to see this show because this is the thing that I wanted to see for this i give a 5 star on this show. People need to listen to this Show.",
            "review_date": "2008-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect direction. nice movie",
            "review_date": "2008-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 1960's version was soo much better.  But the effect's where better inthis one... but not much",
            "review_date": "2007-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw the ten commandment it was very good",
            "review_date": "2007-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story-wise still ok. Animation still got loads to catch up with",
            "review_date": "2007-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this animation can't work.\n\nit's really horrible.\ncollege-like work.\n\nbut the story, is well,\nMoses story.\n\ni guess once in awhile we'll\nneed a Christian movie to\nbe in the market to straighten\nup people.\n\nwell, this is just that.",
            "review_date": "2007-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moses lead the Israelian out from Israel revenge and slaves.",
            "review_date": "2007-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good for kids. Biblically sound story-not \"Shrek\" quality animation, but OK",
            "review_date": "2007-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you have kids and want to teach them about the story of Moses, then this would be a good one.  Otherwise, the dialog is a bit hokey and it doesn't even feel like it should be in theaters.  It's more like one of those home videos you rent to show a Sunday School class.  It was ok, but nothing great.  The Prince of Egypt was better.",
            "review_date": "2007-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this! Its a classic!",
            "review_date": "2007-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "cool i will watch it",
            "review_date": "2007-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "yes!I LOVE this movie!",
            "review_date": "2007-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Character animation sucked; story told however must brush up on my bible reading to see if they stayed true to the story and events.  Each time its been told it has been different. There was also no comedy!",
            "review_date": "2007-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was GREAT!!  Very biblical... We took Caton to see it and we were very pleased.  There are not many movies made anymore about God, and I would hope everyone takes advantage of this one, it is well worth it.",
            "review_date": "2007-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[b][font=Arial][color=#000000]The Ten Commandments [/color][/font][/b]\n\n[size=3][color=#000000][font=Times New Roman][u]Initial Reaction:[/u]  The most often made Biblical story[/font][/color][/size]\n\n[font=Times New Roman][size=3][color=#000000] [/color][/size][/font]\n\n[u][font=Times New Roman][size=3][color=#000000]Main Characters[/color][/size][/font][/u]\n\n[size=3][color=#000000][font=Times New Roman]            Moses: He\u0092s the messenger of God.  He\u0092s voiced by Christian Slater.[/font][/color][/size]\n\n[size=3][color=#000000][font=Times New Roman]            Pharoah: He\u0092s Moeses\u0092 step brother and leader of the land.  He\u0092s voiced by Alfred Molina[/font][/color][/size]\n\n[font=Times New Roman][size=3][color=#000000]            [/color][/size][/font]\n\n[u][font=Times New Roman][size=3][color=#000000]Plot Summary (as of you needed it)[/color][/size][/font][/u]\n\n[size=3][color=#000000][font=Times New Roman]            The story starts off with Pharoah\u0092s father fearing the people.  He\u0092s worried that they will revolt and overthrow him.  His solution?  Make them work harder.[/font][/color][/size]\n\n[size=3][color=#000000][font=Times New Roman]            When that doesn\u0092t work, he decides to go even more extreme; he\u0092ll kill the first born sons of every family under his care.[/font][/color][/size]\n\n[size=3][color=#000000][font=Times New Roman]            But one family doesn\u0092t want to lose their son; they put him into a basket and put the basket in a river.  They hope that God will guide the boy, Moses, to a loving family.[/font][/color][/size]\n\n[size=3][color=#000000][font=Times New Roman]            Guess what?  The river does exactly that, and the new family is the one that\u0092s ruling the land.  Moses\u0092 new family shelters him from the cruel outside world of slavery and beatings.[/font][/color][/size]\n\n[size=3][color=#000000][font=Times New Roman]            However, when Moses becomes an adult, he finds out about the abuse, and steps in to stop it.  In doing so, he accidentally kills a guard.  He has to run away or be killed for being a murderer.[/font][/color][/size]\n\n[size=3][color=#000000][font=Times New Roman]            Once on the outside, he saves a group of women from being beaten by thugs.  He and one of the women fall in love and they have two sons.[/font][/color][/size]\n\n[size=3][color=#000000][font=Times New Roman]            But his freedom from his homeland doesn\u0092t last very long; God steps in and commands him to return and free his people from the new leader of the land, Moses\u0092 step brother.[/font][/color][/size]\n\n[font=Times New Roman][size=3][color=#000000] [/color][/size][/font]\n\n[font=Times New Roman][size=3][color=#000000]SCORING[/color][/size][/font]\n\n[u][font=Times New Roman][size=3][color=#000000]Main Characters[/color][/size][/font][/u]\n\n[size=3][color=#000000][font=Times New Roman]            They are flat.  Each character shows one dimension; Moses is wise and Pharoah is angry.  I would\u0092ve like to seen more depth in the emotion shown by these two.  SCORE: [b]3[/b][/font][/color][/size]\n\n[font=Times New Roman][size=3][color=#000000] [/color][/size][/font]\n\n[u][font=Times New Roman][size=3][color=#000000]Supporting Cast[/color][/size][/font][/u]\n\n[size=3][color=#000000][font=Times New Roman]            Just as flat at the main characters.  We\u0092ve got a loving wife, a loving sister and brother, and a guy who does nothing but complain.  SCORE: [b]3[/b][/font][/color][/size]\n\n[font=Times New Roman][size=3][color=#000000] [/color][/size][/font]\n\n[u][font=Times New Roman][size=3][color=#000000]Plot[/color][/size][/font][/u]\n\n[size=3][color=#000000][font=Times New Roman]            The story\u0092s familiar, but this film rushes it.  Before I knew it, Moses has grown from a baby to an old man, and I found it not satisfying.  SCORE: [b]2[/b][/font][/color][/size]\n\n[font=Times New Roman][size=3][color=#000000] [/color][/size][/font]\n\n[u][font=Times New Roman][size=3][color=#000000]Originality[/color][/size][/font][/u]\n\n[size=3][color=#000000][font=Times New Roman]            I think this story has been made into a movie one time too many.  Go rent the classic version with Mr. Heston in it.  SCORE: [b]3[/b][/font][/color][/size]\n\n[font=Times New Roman][size=3][color=#000000] [/color][/size][/font]\n\n[u][font=Times New Roman][size=3][color=#000000]Violence Factor[/color][/size][/font][/u]\n\n[size=3][color=#000000][font=Times New Roman]            In the first written version of \u0093saving a village by blowing it up\u0094, Moeses wants to save his people by letting God kill innocent civilians.  Whatever happened to \u0093Thou shalt not murder?\u0094  SCORE: [b]2[/b][/font][/color][/size]\n\n[font=Times New Roman][size=3][color=#000000] [/color][/size][/font]\n\n[u][font=Times New Roman][size=3][color=#000000]Other Moral Issues[/color][/size][/font][/u]\n\n[size=3][color=#000000][font=Times New Roman]            There\u0092s a lot about faith and love, but those message are preached far too often by the characters and by the narrator.  SCORE: [b]3[/b][/font][/color][/size]\n\n[font=Times New Roman][size=3][color=#000000] [/color][/size][/font]\n\n[size=3][color=#000000][font=Times New Roman][u]Final Score (out of 60): [b]16[/b][/u][b]                    [/b][u]% Score: [b]26.67%[/b][/u][/font][/color][/size]\n\n[size=3][color=#000000][font=Times New Roman]New commandment: Thou shalt not make another version of the [i]Ten Commandments[/i]. [/font][/color][/size]",
            "review_date": "2007-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Read the MoviePulse Winter Movie Preview by clicking below:\n\n[url=\"http://www.moviepulse.net/mp_pages/features/feature_wintermoviepreview.php\"][img]http://www.moviepulse.net/mp_pages/features/fallmoviepreview/wintermoviepreview.JPG[/img][/url]\n\nRead Pandolfi's Review of Lar's and the Real girl by clicking below:\n\n[url=\"http://www.moviepulse.net/mp_pages/2007/page_larsandtherealgirl.php\"][img]http://www.moviepulse.net/mp_pages/2007/screenshots/larsandtherealgirl/larsandtherealgirl.jpg[/img][/url]\n\nRead Joe's Review of Dog Bite Dog by clicking below:\n\n[url=\"http://www.moviepulse.net/mp_pages/dvd/page_dogbitedog.php\"][img]http://www.moviepulse.net/mp_pages/dvd/screenshots/dogbitedog/dogbitedog.jpg[/img][/url]\n\nRead Brandon's Review of The Ten Commandments in 3D by clicking below:\n\n[url=\"http://moviepulse.net/mp_pages/2007/page_tencommandments.php\"][img]http://moviepulse.net/mp_pages/2007/screenshots/tencommandments/tencommandments.jpg[/img][/url]\n\nRead Joel's Review of Lust, Caution by clicking below:\n\n[url=\"http://moviepulse.net/mp_pages/2007/page_lustcaution.php\"][img]http://moviepulse.net/mp_pages/2007/screenshots/lustcaution/lustcaution.jpg[/img][/url]\n\nRead The Twin's latest Movie News @\n\n[url=\"http://moviepulse.net/mp_pages/news/news_wolfman.php\"][b][color=#003399]http://moviepulse.net/mp_pages/news/news_wolfman.php[/color][/b][/url]",
            "review_date": "2007-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was awesome! Somewhat accurate, and could have had better animations.  But it was great!  Go See it and support the making of Christian Films",
            "review_date": "2007-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I fell in love with Moses!!",
            "review_date": "2007-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've enjoyed this movie twice already; true, the animation is not the greatest, but if you have read the actual accounts in Exodus and Deuteronomy, you will find that this is probably the closest film retelling of the story thus far (other than maybe the '06 miniseries).  I agree that it was especially suitable for children, with the accompaniment of an adult to explain certain things.  The movie does require a certain amount of knowledge of the Bible accounts though, so you may see things that seem strange (the manna from heaven, the quail falling from the sky, the rock flowing out water) because they are left out of other versions. All in all, covers much more biblical detail than both the original Heston film and the Prince of Egypt.",
            "review_date": "2007-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing beats the original. Can never be replaced.",
            "review_date": "2007-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was much more modern than the older one, but it still was pretty much the same story.",
            "review_date": "2007-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "again a must see movie",
            "review_date": "2007-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest classic movies to ever come out of Hollywood.",
            "review_date": "2007-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie ever!!",
            "review_date": "2007-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a must see movie, it never gets old.",
            "review_date": "2007-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "be scared of the lord",
            "review_date": "2007-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "thy shal not forget this movie.lol",
            "review_date": "2007-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sadly, I liked the Cecil B. DeMille version better. A great cast, though really not all that engaging, which is saying something considering this is one of the greatest stories ever told.",
            "review_date": "2007-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an epic that does not get old",
            "review_date": "2007-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jesus is the fulfillment of the commandments, us we live by God's grace. Simply we have to recieve Jesus Christ as our King and Savior and imitate Him in the power of the Holy Spirit.",
            "review_date": "2007-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent  more than a 10",
            "review_date": "2007-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very interesting with music I enjoyed listening to.",
            "review_date": "2007-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "He (Ben Kingsley) did a great job in this movie.",
            "review_date": "2007-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You're kidding! Another version of this story?",
            "review_date": "2007-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite Bible Stories and so well acted and put together that even a child can understand. I reccommend this one for everyone to see.",
            "review_date": "2007-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is good. Definitely worth a watch.",
            "review_date": "2007-04-06",
            "source": "rt",
            "lang": "en"
        }
    ]
}