{
    "rating": 5.9,
    "release_date": "Invalid",
    "num_reviews": 43,
    "genres": [
        "English(UnitedKingdom)"
    ],
    "summary": "A lone sailor is locked inside the head of a sailboat that is underway -- and on autopilot.",
    "reviews": [
        {
            "content": "This kept me interested and alert the entire movie. I thought it was very well done. I came across this movie by accident, I liked it a lot.",
            "review_date": "2023-03-26",
            "source": "rt"
        },
        {
            "content": "A wasted two hours of my life.  Completely useless film with no plot.",
            "review_date": "2023-02-27",
            "source": "rt"
        },
        {
            "content": "Stressful!! Not many movies can get away with this theme anymore. Definitely worth a watch",
            "review_date": "2023-01-25",
            "source": "rt"
        },
        {
            "content": "What was the point...what was the plot?  Although the film techniques were good, there was absolutely no story, character development, nor anything that would make one ponder.",
            "review_date": "2023-01-20",
            "source": "rt"
        },
        {
            "content": "I really enjoyed this movie. It is not for everyone but if you want to watch a boat taunt and try to kill one man than this is your movie. I found some parts to be pretty suspenseful but also hilarious :)",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "Great movie. I enjoyed every second. It did kind of remind me a tiny tiny bit of Christine, with a boat though, and really quite a bit more thrilling from what I remember of Christine (which I watched years ago).  I was creeped out quite a bit myself.  The acting was great and I felt the actor's emotions.  The filming was great and I often felt I was right there with the actor.  What was there in the story was all that was necessary. It didn't need to be clutter up with anything else. I absolutely enjoyed it and would recommend it.",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "This film has to be one of the most boring films I have seen this year, lacks an actual story, why, what and who cares. Continuity is all aver the place and what was the story? Ghost boat but why, to what end? Terrible.",
            "review_date": "2022-05-28",
            "source": "rt"
        },
        {
            "content": "\"Lone man lost at sea\" movies are nothing new; \"Life of Pi\" and \"All is Lost\" come to mind, among others. But \"The Boat\" holds its own and adds a seemingly supernatural twist to the proceedings.\n\nThis film is virtually plotless. It has no back story or character development, and it doesn't need them. All we see at the beginning is British/Maltese actor Joe Azzopardi, the unnamed protagonist, leaving his apartment in Malta in the morning for a spin in his small motorboat. As he gets out into the Mediterranean sea, a thick fog surrounds him, and he encounters a sailing vessel that is apparently abandoned. The boat is named Aeolus, in reference to the keeper of the winds in Greek mythology.\n\nSecurely lashing his motorboat to a couple of cleats, he boards the vessel and finds it abandoned. His attempts to report the vessel on the ship's radio fails to raise any response.\n\nThen the weirdness starts. His motorboat vanishes. He gets locked in the bathroom for half an hour (No, you won't lose interest, guaranteed) while the boat collides with a huge ship and starts taking on water. Then, the boat, on auto-pilot which can't be turned off, starts heading into a massive storm.\n\nAs he deals with one obstacle after another, it becomes apparent that someone or something is out to get him. Is the boat haunted? Far be it from me to report any further.\n\nA film with only one actor presents challenges. There is a lot of pressure on the director, the screenwriter, and of course, the actor to hold our interest. I'm happy to report that in its 100 minute running time, \"The Boat\" will keep you transfixed. It's that good. The direction is skillful and the cinematography is crisp and vivid. Azzopardi is believable and sympathetic, even though we know nothing about him. He's frustrated and scared, but he pragmatically solves the issues that confront him. His dilemma is Sisyphean: As soon as one disaster is taken care of, another one pops up immediately. \n\nMovies like this can only end one of two ways: The protagonist either dies or he survives. I'm not spoiling anything by telling you that he survives, but the ending, rather than being overwrought and dramatic, is flat out spooky. I found it perfect. When this film is over, we've learned nothing about Azzopardi's character, and we've learned nothing about the sailboat, other than it's definitely not your normal vessel.\n\nAs a bonus, you'll learn a lot about the technical aspects of sailboats. On the other hand, you may never want to get on a boat again. And watching this film may cause you to develop a phobia of doorknobs.",
            "review_date": "2022-03-02",
            "source": "rt"
        },
        {
            "content": " Very suspenseful. The actor commands the screen. A riveting performance and haunting film. ",
            "review_date": "2021-12-04",
            "source": "rt"
        },
        {
            "content": "At first when i realised it was just the guy on his own in the film i was about to give it a miss. But i stuck it out and I'm so glad i did. I was hooked from beginning to end. For one man to keep me on the edge of my seat for 90 minutes is a plus in my opinion.  It had a creepy atmosphere. I don't get the rubbish reviews. I just suggest you give it a try for yourself . Top film. Glad i stumbled on it.",
            "review_date": "2021-11-27",
            "source": "rt"
        },
        {
            "content": "I thought this was an exceptional movie especially given the fact it has few spoken words. It kept me on the edge of my seat. The location it was filmed was stunning. The score and music added to the suspense and for me made the whole experience very exciting. I loved it!!",
            "review_date": "2021-10-28",
            "source": "rt"
        },
        {
            "content": "‘Christine' Takes to the High Seas in Claustrophobic ‘The Boat'",
            "review_date": "2021-02-06",
            "source": "rt"
        },
        {
            "content": "An unknown (to me at least) actor has pulled off what All is Lost required Robert Redford to achieve. With a small budget too! Great film, riveting, full of drama and suspense. Sadly I fear Indie's like this don't get the distribution they deserve. The credits are fab too!",
            "review_date": "2021-01-28",
            "source": "rt"
        },
        {
            "content": "This was the biggest waste of 1.5 hours of my life. If someone asked me to draw a plot diagram for this I literally could not. Do not watch.",
            "review_date": "2021-01-28",
            "source": "rt"
        },
        {
            "content": "Very well done for.a 1 person movie",
            "review_date": "2021-01-05",
            "source": "rt"
        },
        {
            "content": "Would have been much better as a short.",
            "review_date": "2021-01-03",
            "source": "rt"
        },
        {
            "content": "This movie is awful.\nOveracted, cheap and I did not even care about the character.\nA waste of time",
            "review_date": "2020-09-23",
            "source": "rt"
        },
        {
            "content": "Absolute garbage. No reason is ever given for why anything happens, why he's trapped, why he's let go, why the boat is sentient, why it time travels at the end for the most predictable boring time loop ending I've ever seen tacked on to a movie. Nothing has any meaning whatsoever. Gerry on water, but even that had dialogue. You have to have an idea of how things work, even if it's not explicit in the film, or you have nothing. You have things that happen for no reason, and no story. Complete waste of time, writer forgot to write a movie.",
            "review_date": "2020-06-30",
            "source": "rt"
        },
        {
            "content": "one of the worst movies ever\nguy finds a random stranded boat but then he gets locked in the bathroom for 2 days and struggles to sail his boat from the bathroom\nits supposed to be spooky but in reality the mysterious thing is just and absoulute troll\nhe unlocks the bathroom and he gets out, so then he goes to the bedroom and he locks the guy inside the bedroom next\nthen he goes inside the closet in the bedroom and he locks him inside the closet\nhe tries to escape from the closet by going through an air duct connecting the closet to the outside but then the guy does the unthinkable\nhe locks him inside the air duct\nthe entire movie is in enclosed spaces the shots are horrible\nhalf of the movie is him inside a bathroom\nand he gets hyperhermia cause while hes in the bathroom water leaks inside and he gets cold\nbut you know he finally escapes the air duct and leaves the boat, and then the boat just leaves him in a random island\nwhat an absolute troll\nthere was no meaning to why he did it\nbut he just messed with that guy so hard",
            "review_date": "2020-06-21",
            "source": "rt"
        },
        {
            "content": "Entertained. Enjoyed it.",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "This movie is a real treat!  Original movie making at it's very best.\nA subtle, different, thought provoking assault on the senses.  \nThis movie stayed with me for DAYS. I watched it with my whole family (me, my husband and four grown up sons) and we all loved it (no mean feat right there) and thought it was so cleverly filmed and acted. So many movies these days are just noisy, loads of CGI, loads of people and action. And they are boring. I really wish there was more real story telling and movie making like this. \nA mystical, haunting and imaginative time away from the madness going on in the world at the moment! WATCH IT!",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "I enjoyed this movie which is very suspenseful.",
            "review_date": "2020-04-25",
            "source": "rt"
        },
        {
            "content": "This film gets its hooks in you. You *want* to see it through while you're in it.  Sort of a nautical-Christine indie thriller...surprisingly creepy moments.  The ending? Well, it's up for debate....but this film is worth your time.",
            "review_date": "2020-04-24",
            "source": "rt"
        },
        {
            "content": "This movie had potential, but it fell short. The ending is complete crap and makes the whole film pointless. There should’ve been some big reveal or satisfying ending to this, but there wasn’t. The acting is pretty good and the concept is great, but it could’ve been much better. The pacing is decent, but feels slow at times. Overall, I think it’s an “ok” movie but was hoping for something better. I don’t really recommend it, unless it’s free!",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "Enjoyable but unconventional movie without any clear answers to the mysteries. Well acted ,solo sailor trapped on a mysterious ship facing a succession of challenges. Beautiful scenery adds to the other-worldly feel of the movie.",
            "review_date": "2020-04-11",
            "source": "rt"
        },
        {
            "content": "Completely disappointed and what a waste of my time and other people's time.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "Must have been done by an autistic...total waste of time...nothing happens.  Writer, director, and all producers should self quarantine till the need to produce something new is out of their heads for good.\n\nThe actor in it was good though.",
            "review_date": "2020-04-02",
            "source": "rt"
        },
        {
            "content": "If you know sailing, you'll appreciate this movie because of the worst-case-scenario for sailing alone. I found the storyline engrossing and compelling from the very beginning. A man takes his small boat out and bumps into a seemingly abandoned sailboat. A very believable and likable character, the man is gradually sucked into an increasingly disastrous situation and I really felt for him.\n\nI loved the lack of dialogue as it follows just one character, it's all about the action and the music was perfect for the suspense. It was the perfect length of movie, although I would be interested to see more about this supernatural boat.",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "A hapless sailor falls victim to the AEOLUS - a 45-foot sloop which is possessed.  \n\nAt times a tense thriller.",
            "review_date": "2020-03-27",
            "source": "rt"
        },
        {
            "content": "As a viewer you begin to believe something will eventually happen. But it never does. This \"movie\" is utterly pointless and boring.",
            "review_date": "2020-03-26",
            "source": "rt"
        },
        {
            "content": "This guy went about this the Wrong way. I get that this is a real boat, and it is expensive, and they didn't want to hurt it, but really if he was in this situation he would attack The Door. It is a Wooden Door, slice through the grooves with the scissors, or smash the door with the cans, or Something! The Door Idiot! That is what you will be thinking this entire movie. I liked the idea a Lot, but it is just not executed well.",
            "review_date": "2020-03-25",
            "source": "rt"
        },
        {
            "content": "I liked this movie. It's not for everyone because it's not that reach out and grab you kind of horror. I believe that the boat represents a capitalistic society (hence the yact) that's driven by greed. Unnecessary luxuries aren't needed to enjoy life. You have to work extra hard to get those things, then struggle to keep them. The boat taking over may have been a metaphor for bill collectors. It's hard getting out of their grasp. He was the only person who left the city, got blinded by the fog, and was lost at sea for a time. Everyone else fished from the shore. The simple life was all that he needed to be happy. In the end, he was relieved to be back where he started. It can be scary being out on your own with no one else to help you. Usually, there's safety in numbers. The boat ominously waiting at the end served as a reminder to be happy with what you have...Oh, and to mind your own business because had he not been nosey in the first place, the boat just may have left him alone.😂😂",
            "review_date": "2020-03-21",
            "source": "rt"
        },
        {
            "content": "Garbage. Don't waste your time watching this.",
            "review_date": "2020-03-17",
            "source": "rt"
        },
        {
            "content": "What in the hell was that movie about? I'm still confused.",
            "review_date": "2020-03-10",
            "source": "rt"
        },
        {
            "content": "Impressive. Couldn't stop watching till the end.",
            "review_date": "2020-02-26",
            "source": "rt"
        },
        {
            "content": "There's a limit to how slow a slow burn can be and The Boat takes it too far to a point of becoming unbearable. There's an interesting plot buried underneath the painstaking lack of action so if you've got the patience for it, give the movie a shot.",
            "review_date": "2020-02-23",
            "source": "rt"
        },
        {
            "content": "Love it ! Mysterious, gripping and much more...",
            "review_date": "2020-02-04",
            "source": "rt"
        },
        {
            "content": "Lost 2 hours of my life! What a sh@t movie. Who paid for this garbage to be made? One stupid guy on a ghost sailboat and this idiot cant even think to kick the locked door down. How frustrating this movie was! The writers and directors should never make another movie again! This movie isnt a thriller or scary it was So Boring!\n\nI gave it half a star cause you cant give No Stars!\n\nSH@T",
            "review_date": "2019-11-15",
            "source": "rt"
        },
        {
            "content": "If i could rate this movie with no star i would.the sailor showed no survival skills or even thought of trying hard to escape.this was a snooze fest movie.i would have more fun watching the green grass grow in my yard.",
            "review_date": "2019-09-19",
            "source": "rt"
        },
        {
            "content": "An interesting film, a fisherman who gets lost in the fog finds an abandoned boat which he climbs aboard to look around, he ties up his small boat securely to look around. but when he gets back on deck his boat has gone.\nFrom there a series of terrifying events happen, and the boat seems to be in control of all of them.A very good film.",
            "review_date": "2019-09-18",
            "source": "rt"
        },
        {
            "content": "Captivating and suspenseful, as someone else said; it's quite masterful to spend 30 minutes of a film locked in a bathroom with the protagonist.. The mystery at the end is just what was the boat? Haunted? A intelligent entity, coincidental happenings on a normal boat... U decide and after the film u will decide subjectively.. Great film.its never boring. Never too much to think about but with just the right amount of reveal if u want to.... The boat",
            "review_date": "2019-09-12",
            "source": "rt"
        },
        {
            "content": "Weird, bizarre, stupid, and pointless. That pretty much sums up this film. Plus the protagonist is an idiot, so that just adds to the frustration. If Ur in the mood to waste an hour and half of Ur life, go ahead and watch this film. If Ur looking for nail biting thriller involving a boat and the ocean, try \"Dead Calm\" (it's a million times better than this load of tripe)",
            "review_date": "2019-09-07",
            "source": "rt"
        },
        {
            "content": "Brilliant directing. Surprisingly captivating. ",
            "review_date": "2019-09-06",
            "source": "rt"
        }
    ]
}