{
    "rating": 4.3,
    "release_date": "Invalid",
    "num_reviews": 32,
    "genres": [
        "Mystery&thriller",
        "Comedy"
    ],
    "summary": "In the years before World War II, zany heiress Amanda Kelly (Cybill Shepherd) travels by train to Switzerland. While passing through Germany, she meets a sweet elderly lady, Miss Froy (Angela Lansbury), who suddenly vanishes. Distraught, Amanda questions her fellow passengers who claim that the woman was never there. Unsure if it's all in her mind or if there's a more sinister plot afoot, Amanda teams up with photographer Robert Condon (Elliott Gould) to discover the truth.",
    "reviews": [
        {
            "content": "One of Alfred Hitchcock's not-so-great remakes, this 1979 film provides a good cast and story. But this film takes all of Alfred Hitchcock's classic elements of the original and turns it into more of a comedy, rather than a comedy-thriller classic.",
            "review_date": "2020-08-19",
            "source": "rt"
        },
        {
            "content": "Cybil is a wonderful beautiful amazing actress but she seems to be miscast quite a lot. ",
            "review_date": "2019-09-11",
            "source": "rt"
        },
        {
            "content": "Cybill is very beautiful but completely miscast in this unnecessary remake of the Hitchcock classic. Gould joins her in being remarkably wrong for his role. Thank goodness Angela Lansbury is aboard to lend at least a few minutes of class to this plodding affair.",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "My Favorite Comedy Film Is 1933's Duck Soup.",
            "review_date": "2014-05-06",
            "source": "rt"
        },
        {
            "content": "Someone should have stolen away with Cybill instead--The Charm Vanishes!!",
            "review_date": "2014-02-28",
            "source": "rt"
        },
        {
            "content": "(32%)\nThe very last Hammer flick before its recent rebirth is a mildly entertaining Hitchcock remake that is as unremarkable as they come. The cast is good and nothing is terrible, but it is easy to see why this slipped through the net and nobody saw it back in the day.",
            "review_date": "2014-02-14",
            "source": "rt"
        },
        {
            "content": "I'm one of the few people you'll meet who enjoyed this.Having never seen the original my opinion was not jaded, it has its problems, not least some overbearing exchanges from the leads  but on the whole, good fun.",
            "review_date": "2011-08-27",
            "source": "rt"
        },
        {
            "content": "Cybill Shepherd is perfect as the obnoxious American, but don't like that change to the original 1938-storyline",
            "review_date": "2011-07-14",
            "source": "rt"
        },
        {
            "content": "Quite possibly the most inexplicable Hitchcock remake outside of Gus Van Sant's 'Psycho' (and, I will assume, the remake of The Birds that might someday see the light of day).  The film returns more to the original novel than Hitchcock's film, and that's not exactly a good thing.  Iris becomes a spoiled American heiress going back to London to marry her fourth husband, and is played with shrieking abrasiveness by Cybill Shepard.  Gilbert Redman, the musician of the original film, becomes Robert Condon, a newspaper photographer, played by Elliott Gould.  He is probably the only interesting piece of casting in the whole work and carries off the role with suitable insouciance and charm.  It is a thankless role, however, as he must wrestle with Shepard, fight the Nazis, and deal with collaborators (including a horrifically underused Herbert Lom).  The film doesn't really hang together, even without knowing that it's a remake, and eliminates most of the light-hearted tone mixed with distressing awareness of the world situation that the original, made just before WWII, utilizes so well.  A heavy-handed Hammer production that proves what a great director Hitch truly was.",
            "review_date": "2010-11-11",
            "source": "rt"
        },
        {
            "content": "Not as good as the original!",
            "review_date": "2010-07-30",
            "source": "rt"
        },
        {
            "content": "Entertaining enough - 'The Lady Vanishes' is one of my absolute favourite movies - I was dying to see this because I love the story and this stars another favourite of mine - Angela Lansbury. This is almost a word for word, scene for scene remake and it all works well except for Cybil Shepherd - yikes! She was awful! She detracts from the film so much! But its all in good fun and this is a light film so you can ignore her faults as an actress to a degree, particularly considering the rest of the cast do a great job. Not a touch on the original but thoroughly enjoyable. Worth a look for fans.",
            "review_date": "2010-07-04",
            "source": "rt"
        },
        {
            "content": "Awful and inept remake of Alfred Hitchcock's classic original which seemed to have been played for laughs. It doesn't work.\nCybill Shepherd & Elliott Gould are woefully miscast and the direction lacks atmosphere, making it look like a TV movie. \nDefinitely a remake for people who refuse to watch B&W movies because they are too ignorant.",
            "review_date": "2010-04-28",
            "source": "rt"
        },
        {
            "content": "Cybill Shepherd and Angela Lansbury",
            "review_date": "2010-02-20",
            "source": "rt"
        },
        {
            "content": "Hitchcock remake spoiled by the leads - Shepherd is far too knowing and sassy and Gould too cocksure. The supporing cast are pretty good though -Herbert Lom and Arthur Lowe particularly, but even they can save this from mediocrity.",
            "review_date": "2009-09-08",
            "source": "rt"
        },
        {
            "content": "Stupid movie. Wouldn't watch it again..",
            "review_date": "2009-01-21",
            "source": "rt"
        },
        {
            "content": "So, I had this on TiVo because I had tried to watch the B&W version of it a while back, but it was just too old for me (even though I really love B&Ws).  Cybil Shepard, Angela Landsbury - with them, it couldn't be that bad, right?  Plus I thought it was originally a Hitchcock film, so another great, right??  WRONG.  It was over acted - almost like a stage production.  Then the ending was... wait, there was no ending.  No REAL resolution.  It JUST ended... and pissed me off!  What did the nanny know that put her in jeopardy?  Why was she sent to sing that tune?  What did the tune mean?  What happened to the nun?  Why did the two old guys (one of whom had been shot) simply depart at the end?  Wait, what's with the flood?  The movie left me with more questions than answers.  I was VERY disappointed!",
            "review_date": "2008-10-12",
            "source": "rt"
        },
        {
            "content": "didn't realise this wasn't the original, and judging by the comments I now want to see that!",
            "review_date": "2008-08-29",
            "source": "rt"
        },
        {
            "content": "Good cast but the story falls flat. Too little action and suspense.",
            "review_date": "2008-03-31",
            "source": "rt"
        },
        {
            "content": "This movie is never on enough. Hitchcock's Finest",
            "review_date": "2008-03-09",
            "source": "rt"
        },
        {
            "content": "gammel klassiker .alltid likt angela lansbury .. hun får de til ..kozy",
            "review_date": "2007-11-30",
            "source": "rt"
        },
        {
            "content": "LOVE this film!!!!!! Thrilling, funny, dramatic, artistic ---- pure Hitchock!",
            "review_date": "2007-09-27",
            "source": "rt"
        },
        {
            "content": "sweet. hitchcock.\nit's all about musical passwords",
            "review_date": "2007-09-11",
            "source": "rt"
        },
        {
            "content": "Just don't re-make Hitchcock. Ever.",
            "review_date": "2007-08-30",
            "source": "rt"
        },
        {
            "content": "Stilted remake of Hitchcock's 1938 classic, which was in essence a rather far-fetched story given first class treatment. In this form the locations and the actors make it adequate enough as a simple 70s repackaging, but next to the original it pales into insignificance.",
            "review_date": "2007-08-29",
            "source": "rt"
        },
        {
            "content": "A 'not bad' but unfortunately soulless remake, with none of the subtlety of the former, spelling out the original's hidden anti-Nazi messages. The cast perform well, but there are hardly any stand-out performances here, despite the great selection of actors.",
            "review_date": "2007-08-20",
            "source": "rt"
        },
        {
            "content": "A sturdy but pointless remake.  Any director would struggle to better Hitchcock's original, but if you don't like black and white films this one at least have some scenics in colour.",
            "review_date": "2007-07-21",
            "source": "rt"
        },
        {
            "content": "No, I like the Alfred Hitchcock version, with the wacky Eastern European folk music, the cute gypsy/traveling musician, and the vintage clothes.  Throw in some magic tricks and a goat, and I'm sold.",
            "review_date": "2007-07-16",
            "source": "rt"
        },
        {
            "content": "not this version.  this version is shit.  i meant the original hitchcock one.  this one, to repeat, is shit.",
            "review_date": "2007-07-12",
            "source": "rt"
        },
        {
            "content": "Only thing that spoils the film is Elliot Gould! lol",
            "review_date": "2007-07-06",
            "source": "rt"
        },
        {
            "content": "great film - haven't seen the original hitchcock but love this. Angela Lansbury is a treat",
            "review_date": "2007-06-29",
            "source": "rt"
        },
        {
            "content": "Delightful remake.  Cycill Shepherd looks stunning throughout, and Elliott Gould is at his wry best.",
            "review_date": "2007-06-14",
            "source": "rt"
        },
        {
            "content": "I adore this remake. Does that make me a bad person?",
            "review_date": "2007-06-06",
            "source": "rt"
        }
    ]
}