{
    "rating": 8.5,
    "release_date": "Invalid",
    "num_reviews": 55,
    "genres": [
        "Holiday",
        "Romance",
        "Comedy",
        "Lgbtq+"
    ],
    "summary": "Sam is a young gay man who's forced to share a car ride with Harry -- a popular jock who was his enemy in high school. But things take an unexpected turn when Sam learns that Harry has come out, opening the door for a potential romance.",
    "reviews": [
        {
            "content": "The only reason the main character gets away with being such a mean, self-centered \"friend\" is that he's played by the writer and director of this movie. Who in their right mind would fall in love with someone so emotionally clueless and casually cruel? The ending is unearned; the wrong person apologized. :(",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As one of the first LGBT rom com representations, I can safely say it's set the bar so high for any following movies. Everything about it is amazing! The character growth was absolutely astonishing, and watching through the eyes of Sam as his relationship with Harry unfolds throughout the years is just perfect. And the ending is just the cherry on the cake. To see them both married with a baby is just such an awww moment. By far my favourite LGBT movie ever!!!!",
            "review_date": "2022-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheesy, but good. Not top-notch filmmaking by any means, but enjoyable nonetheless. It felt sort of like a queer Hallmark movie - and who could be upset about that?",
            "review_date": "2022-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disgustingly primitive scenario! Everything is too straightforward and unnatural.",
            "review_date": "2022-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a rediculous and unrealistic was this movie.  It was like a bad Soap Opera with everything that could and couldn't go wrong.  The cute guy asked at the wrong time \"Harry, How about Me!\" when the other guy was obviously drunk. If you want to see better movies may I suggest \"Maurice\" or \"Love, Simon\" or \"Latter Days\"  or Beautiful Boy.  P.S. I could not stand the effiminate Harry but loved the butch one.",
            "review_date": "2021-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is definitely a must see movie. I think Peter Paige has surpassed himself as a director. Good acting, beautiful story, a simple romantic comedy that you can watch over and over again and not be bored. The two main actors Jake Borelli and Niko Terho simply have the chemistry in them in this film, good acting, good script, good dialogues and you will not remain indifferent. What really attracted me to this movie is that the story itself just makes you watch the movie till the end and see what happens are they gonna stay together or not. The end of the movie was great. And Niko Terho great job.",
            "review_date": "2021-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally, a personal and uplifting LGBTQ rom-com without recycling the depressing \"coming out as LGBT\" becoming the plot device and climax of the film",
            "review_date": "2021-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Soppy gay unrealistic love story I am ashamed to say I liked... Probably mostly because Niko (Harry) is fit as",
            "review_date": "2021-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an exceptional movie. Definitely worth a watch. I have literally watched it multiple times now and I love how it feels.",
            "review_date": "2021-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's the kind of romance movie that's hard to get mad at and a bit of a Something Like Summer rip-off but all the better for it?\nalso, the Soundtrack is amazing!",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is not good. I watched it because it was recommended somewhere to me but I will not suggest it to others. It's your typical romantic comedy on steroids, very hard to watch, very cringe; bare in mind I do not like romantic comedies in general, but this one really had me struggling. \n\nI always watch a movie until the end to give an honest review and I am very sorry to say this but the ending here is kind of the worst part.\n\nVery cheap, very cliche, very cringe.",
            "review_date": "2021-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Besides the ending (which was probably the best part of the movie), everything else was extremely frustrating to watch. It made me want to reach for the characters and slap some sense into them. The bestfriend was the worst character. For a bestfriend, she sure was oblivious with what's going on between Sam and Harry that she unintentionally almost ruined his friendship with Sam. Soundtrack was bland.",
            "review_date": "2021-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had been looking forward to this movie, but it unfortunately failed.  The main character, Sam, is not at all sympathetic, and he appears to be an immature, entitled, spoiled person who hurts his friends and gets what he wants without ever having to give back in his relationships.  Given this, it was difficult to see the attraction Harry (and even his best friend, Stasia) had for Sam.  Sam's character thus should have been a bit better developed, to offer the audience a sense of why Harry would be so committed to him (and another motif that is never fully supported is the one of Harry being noncommital/flaky in relationships - that is never shown, but Sam keeps bringing it up).",
            "review_date": "2021-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trust me? A love story can be utter boredom; that's why we are always clinging to the idea of life full of unnecessary dramas.",
            "review_date": "2020-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The kind of LGBTQ film I would have loved to have had when I was growing up. Well acted, fun characters, and a strong connection to what it's actually like to be a gay man in the dating scene. Would highly recommend.",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything about this movie - the music, the casting, the writing, the directing, the ending - are pure perfection.",
            "review_date": "2020-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "PERFECT! PERFECT! PERFECT! I'm so in love with this movie! Every LGBTQ+ have to watch this. It's so comfortable and beautiful and... WOW!",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I give it 5-stars just for the sole fact that it was a gay movie that wasn't about tragic love and inequality.\n\nCute movie, worth your time.",
            "review_date": "2020-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Old-fashioned modern love story!",
            "review_date": "2020-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Romance movie of the year. It brought me to tears.",
            "review_date": "2020-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish movies like this were around when I was a teen!",
            "review_date": "2020-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's amazing, I've already watched 30 times",
            "review_date": "2020-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "New favorite rom-com? Absolutely!",
            "review_date": "2020-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's pretty obvious that Sam and Harry will end up together.  We just don't know when, where, and how,\n\nWhat I liked about this movie is that it clearly defined what pan sexuality is.  Harry is still the typical male who's a hot mess, doesn't really care what he looks, addicted to video games, smart at times, and bails out in a relationship when things get serious.  The beauty of it is that he's like that whether he's in a relationship with a girl or with a boy.  Because pan sexual is loving the person and not the gender.",
            "review_date": "2020-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that reflects an authentic development of relationships and people themselves. One of the best LGTBQ+ films that I have ever seen. The actors are super hot, and how their characters interact is the best. It talks about important issues that people can face and how love always wins (for romantic lovers)",
            "review_date": "2020-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The kind of rom-com the world really need. I hope it will be sold to and shown on a lot of television stations all over the globe.",
            "review_date": "2020-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie. Love the dynamic. Love Sam.",
            "review_date": "2020-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thisis the best Lgbtq+ movie i have ever seen. \nThe plot got me so emotional",
            "review_date": "2020-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really wanted to love this movie. As a gay man I cling to any quality lgbtq films especially when they are mainstream. I was blessed with Love, Simon and since that was a minor hit I was expecting a lot more movies to come out. So this option from freeform is appreciated and it's cute but it's very by the numbers and the leads don't have the best chemistry. That being said it's about a guy named Sam who runs into Harry sporadically over the years. They have a little bit of a love connection and eventually, well you know. It's all fairly formulaic but I hope it's successful and opens the door to better films.\n\n3/5",
            "review_date": "2020-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love it. It is a normal, cheesy, romance movie but between two men. It does not focus on coming out and it is not sex crazy. It focuses on adults, which good movies usually don't. I just think it is such a good movie.",
            "review_date": "2020-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must-see movie, especially for anyone in the LGBTQ community that has felt under-represented in films. This movie gives you everything you want out of a rom-com, the story is fun and easy to follow, and the cast has near-perfect chemistry. Highly recommend!!!",
            "review_date": "2020-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is so sensational about this film is that it isn't sensational at all; it's a classic rom-com that happens to have two queer leads. Sure, it doesn't shy from LGBTQ+ themes and the unique perspective and culture therein, but it's ultimately a sweet, warm movie with two great leads who have excellent on-screen chemistry.",
            "review_date": "2020-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I freaking love this movie oh my goodness it's so amazing so beautiful and it makes my heart warm and happy and I love this sooo much and I just want my love life like this I really love this movie so much. It represents the representation of the LGBTQ+ and I am so happy that there is a movie out there like this one and it makes me so really happy and I keep re-watching it over and over this is my 9th time now lol love this movie so much",
            "review_date": "2020-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fresh, funny & sweet. Good story, even better actors and wonderful chemistry all around. For who is or not into gay movies (I'm not), here tastefulness is a prime, done to a perfection. Got me smiling though out and glad that I have given it a shot. It is a great addition to my romantic movie library. High recommend!!!",
            "review_date": "2020-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific story - great acting.",
            "review_date": "2020-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved everything about this movie. The characters are likable and believable and there is a very polished quality to it, and a great and touching story that I wish was around more in my formative years. #weneedmoregaylovestories",
            "review_date": "2020-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the most fun movie I've seen in such a long time. It's so simple and relatable. I've never watched a movie where the next day I'm still thinking about it. Awesome directing, story and acting!",
            "review_date": "2020-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice! The movie gave me a very good feeling! Amazing movie !",
            "review_date": "2020-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie fulfils it's purpose of being a gay rom com perfectly, and the chemistry between the 2 leads is amazing, will definitely watch again.",
            "review_date": "2020-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a very heartwarming love story & surprisingly, it doesn't feel weird at all. Cuz some other LGBTQ movies or series just makes me feel like they fake that up and it turns out to be so weird. The love between Sam & Harry felt so real...and I can't move on how sweet they are together",
            "review_date": "2020-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this movie was going to be stupid run of the mil RomCom but I was pleasantly surprised. The story was well written and acting was pretty good. I could tell there was some inexperience by some cheesy acting scenes but overall, it was barely noticeable. You felt a connection to all the characters by the end and felt yourself getting more and more emotionally invested till the end which was the perfect cherry on top for the movie.",
            "review_date": "2020-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So horrible and unrealistic. They would have messed around in the motel room during the first 15 minutes. Sam might be the least likeable character ever. Neurotic, self-important, pissy, etc.",
            "review_date": "2020-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall I really enjoyed the film. There were some standard cliche' moments but otherwise it was really good. Paige did a good job. The one thing that stood out as a misfire is the leading men's kissing didn't look nearly as good as if they were kissing a women in a scene like that, (that being kissing or making love). I guess that will come in time when heterosexuals aren't threatened by something like this. (Of course they have no problem with two women kissing.) So give it a watch, you'll really like it.",
            "review_date": "2020-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie EVER.",
            "review_date": "2020-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Thing About Harry is my favorite romcom of all time, one of my favorite romance movies of all time, my favorite romcom and romance movie of 2020, my 2nd favorite movie of 2020, and one of my favorite movies of all time. The writing and story were phenomenal, they were funny, beautiful, heartbreaking, and heartwarming, I am so happy to see a romcom be about a gay love story for once. Jake Borelli and Niko Terho gave outstanding lead performances and the had exceptional chemistry, they made me believe they were enemies turned friends who were actually in love with each other. The supporting performances from Britt Baron, Peter Paige, and Japhet Balaban were superb. The costumes were stupendous especially the ones wore by Jake Borelli, Britt Baron, Niko Terho, and Karamo Brown, the suits that Jake Borelli and Niko Terho wore at the wedding were my favorite. The makeup and hairstyling was excellent especially on Britt Baron, Niko Terho, and Jake Borelli. Peter Paige's direction was terrific. I loved the music that was featured in the movie, it was fantastic. This movie was beautiful and a definite A+ movie, can't wait to see more movies with gay love stories and LGBTQ+ love stories.",
            "review_date": "2020-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just what the community needed to see on television!!!!! It was beautiful!!!!",
            "review_date": "2020-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie I have ever see! Great message and great characters!",
            "review_date": "2020-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So cute and down to earth",
            "review_date": "2020-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While there are some under-developed moments, and some silly scenes that are a little out there (Really?  At the candidates rally, y'all?), it's a movie in the format of standard Hallmark \"Rom-Com.\"  This matters.  It is finding love between two male interests.  The characters are a great mix.  It's not full of cliches, and it has a couple you want to root for.  Director Peter Page did a very good job of presenting the story.  It's about time it happened, and it was done well enough that I hope it encourages more (and, albeit, slightly better movies) to come.",
            "review_date": "2020-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I ABSOLUTELY LOVED THIS MOVE ITS ENEMIES-FRIENDS-LOVERS AND ITS AMAZING",
            "review_date": "2020-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie it was so adorable and the chemistry between the two leads was absolutely incredible.",
            "review_date": "2020-02-16",
            "source": "rt",
            "lang": "en"
        }
    ]
}