{
    "rating": 9.1,
    "release_date": "Invalid",
    "num_reviews": 30,
    "genres": [
        "Drama"
    ],
    "summary": "On New Year's Day 1900, Danny (Bill Nunn), a crew member on an ocean liner, finds a deserted infant and decides to adopt him, nicknaming him \"1900.\" As an adult, the eccentric 1900 (Tim Roth) grows into a remarkable musician aboard the boat. Rumors of his brilliant piano playing eventually reach the shore, and his pal Max (Pruitt Taylor Vince) believes that success surely awaits 1900 on land. The only problem, however, is that the enigmatic pianist is loath to embrace life away from the ship.",
    "reviews": [
        {
            "content": "I don't know why, but I know his feeling...",
            "review_date": "2022-11-04",
            "source": "rt"
        },
        {
            "content": "Outstanding performance,great cinematography,a true legend  woth watching and deserves higher rotten Tomoatoes rating for me it is 99%",
            "review_date": "2022-07-14",
            "source": "rt"
        },
        {
            "content": "One of the best movies and soundtracks that Hollywood tried to hide and destroy.. Just like 1900 the Academy wants to pretend this masterpiece never existed.",
            "review_date": "2022-05-20",
            "source": "rt"
        },
        {
            "content": "Giuseppe Tornatore dà vita ad uno dei film più malinconici mai visti; grazie al romanzo di Baricco che offre un'ondata di spunti interessanti.\nLa lunga durata aumenta il valore e l'estremo alone di tristezza che aleggia intorno al giovane Tim Roth, personaggio complesso quanto incredibilmente incomprensibile; impossibile non amarlo e altrettanto impossibile non struggersi per le sue vicende, soprattutto nell'amaro ma poetico finale.\nI personaggi comprimari sono più goliardici e meno interessanti; ma il duo di protagonisti crea un'atmosfera e una complicità molto intime ed intense.\nUnica nota di demerito per gli effetti grafici, veramente scarsi e che per giunta danno un pessimo impatto sul film, essendo protagonisti nella prima scena.",
            "review_date": "2022-03-11",
            "source": "rt"
        },
        {
            "content": "underrated film that needed to be more publicized",
            "review_date": "2022-01-20",
            "source": "rt"
        },
        {
            "content": "Oh my what was this a wonderful movie. I came to know about this movie by coincidence because I heard someone mentioned it by reference, didn't think much of it and wrote it down to search it up afterwards. How I was blown away by the story and how magical it was told. It's basically a metaphor of life and how one stays true to themselves even with all the ups and downs and doubts. The tone and the message of the movie hits home, down deep, and I loved it!",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "This is my all-time favorite movie. The music is beautiful, the piano scene where they take off the brakes is perfection, the entire movie is amazing.",
            "review_date": "2020-07-21",
            "source": "rt"
        },
        {
            "content": "People on land like to find the roots and spend a lot of time.\n Winter worries about the late arrival of summer, and summer worries that winter is coming.\n So you guys go everywhere to pursue a place that is out of reach and like four seasons like summer, I do n't envy you.",
            "review_date": "2020-05-20",
            "source": "rt"
        },
        {
            "content": "What a comfortable, beautiful movie. While somewhat disjointed, it's a great movie. Strangely, it was first released in 1998, it was re-released in 2019. But the incredible cinematography and production quality are better than many 2020 releases. Great acting, international appeal and award winning music scores. Bravo.",
            "review_date": "2020-04-11",
            "source": "rt"
        },
        {
            "content": "Embarrassing to watch. Poor Tim Roth is trapped in a try-hard universe presenting as an ocean liner & lusting after a girl who looks like she is about 10 (she was 16 or 17 I believe). From the very first scene one cringe-inducing & derivative set piece after another is inflicted upon an audience as trapped in this BS as Tim is. Pruitt Taylor Vince spends the entire movie bursting into tears & to be frank I wanted to join him but not for the same reasons. The whole movie essentially consists of the director turning to the audience every five minutes or so to say 'How impressive was that?' Not very. The director should be cleaning my toilet, or sweeping streets, not adding to the world's effluent.",
            "review_date": "2020-03-21",
            "source": "rt"
        },
        {
            "content": "All time Top 5 movies. Best music by Ennio Morricone. Tim Roth playing 1900 is amazing. Critics giving avg of 50% on Rotten Tomatoes makes me question about their taste in Cinema.",
            "review_date": "2020-03-20",
            "source": "rt"
        },
        {
            "content": "One of the worst movies I have watched",
            "review_date": "2019-12-08",
            "source": "rt"
        },
        {
            "content": "Great story and symbolism, put together in a thoughtful way, supported by phenomenal acting. Must-see.",
            "review_date": "2019-11-26",
            "source": "rt"
        },
        {
            "content": "ภาพยนตร์ ที่แสดงถึง พรสวรรค์ ทางด้านดนตรี กับ ความเป็นจริง ของสังคม ว่า ในบางครั้ง การพลั้งเผลอ ทางอารมณ์ ทำให้ สังคม บกพร่อง ทางด้าน คุณธรรม",
            "review_date": "2019-11-15",
            "source": "rt"
        },
        {
            "content": "An utterly beautiful & surprisingly enchanting movie.",
            "review_date": "2019-08-31",
            "source": "rt"
        },
        {
            "content": "Drammatico, emozionante, leggendario. Un film di questo calibro non è per tutti; è qualcosa di unico. Forse è eccessiva la durata. Ennio Morricone leggendario, voto: 9",
            "review_date": "2019-08-01",
            "source": "rt"
        },
        {
            "content": "Legend was Ridley Scott's follow up to his most personal film Blade Runner. And it was the start of his \"average\" phase. Legend is a decent film- it looks astonishing Ill give it that. But the story is basic and Tom Cruise is simply adequate. Tim Curry as the bad guy actually completely steals the show but overall this is just an okay film filled with pretty visuals. If you want to watch a fantasy there are other better films. Unless you're a fan of Ridley Scott or Tom Cruise I think you can safely avoid this.",
            "review_date": "2018-07-24",
            "source": "rt"
        },
        {
            "content": "Great movie! The score sways with the story much like the ship he was born on. The music represents all the emotions normally found expressed by the characters. 1900's character development can be witnessed in the ever changing musical styles, all the while still remaining true to himself. This is a story of a man who's whole life is his music. The world comes to him time and time again yet 1900 remains mostly ambivalent and solely invested in his own music.  When the world threatens to pass him by, he reluctantly accepts.  This is a beautiful and tragic story and Tim Roth captures the heart of it perfectly.",
            "review_date": "2018-05-10",
            "source": "rt"
        },
        {
            "content": "Without any structure, focus or even narrative purpose, still the biggest problem with this disastrous (and overlong) mess of a film is how the personality of its title character (who remains an irritating sketch) and his forced friendship with the protagonist are so poorly developed.",
            "review_date": "2018-05-09",
            "source": "rt"
        },
        {
            "content": "With 'The Legend of 1900', director, Giuseppe Tornatore, crafts an entertaining fable which pays major respect and homage to the world of early, New Orleans Jazz. \nBeing that it is a legend, as well as being told by the musician who worked with the titular 1900 (yes, that is the character's name and the reason why he was born with that name is kickass), we, as an audience, are free to interpret it however we may choose. Was it all true or was it all exaggerated? You decide. I really like films that can pull off open interpretation without sacrificing focus. I personally found it to be quite a lovely and musically respectful work of both joy and sadness despite its occasional ridiculous/hokey moments.\nI'd like to also give a shout out to all the exceptional actors and cinematography.",
            "review_date": "2018-04-26",
            "source": "rt"
        },
        {
            "content": "I can't understand why Tornatore has highly rated in China. It's like a Bollywood film. A interesting mess. Actually the script of this film is good, but it was destroyed by this poor director.",
            "review_date": "2018-04-11",
            "source": "rt"
        },
        {
            "content": "LOVE this movie!! Tim Roth is outstanding as 1900",
            "review_date": "2018-01-02",
            "source": "rt"
        },
        {
            "content": "One of the worst films i've ever seen, i'm shocked that so many people like it!",
            "review_date": "2017-11-06",
            "source": "rt"
        },
        {
            "content": "Beautiful film from a master of the medium.",
            "review_date": "2017-08-12",
            "source": "rt"
        },
        {
            "content": "This movie is a pleasant piece of cinematography. It's nice to see and moreover to listen to. Morricone's compositions are magnificent, and so is the directing of Tornatore. Very well done film, capable to make emotion.",
            "review_date": "2017-06-21",
            "source": "rt"
        },
        {
            "content": "Such a interesting and sad movie. There is so much amazing music involved",
            "review_date": "2017-05-11",
            "source": "rt"
        },
        {
            "content": "Bien intencionado intento de Tornatore de emular el glamour de Titanic, pero no esta a la altura de sus obras mayores. La secuencia climatica se siente larga y sobrada. Si vale el esfuerzo, es por Tim Roth y la musica.",
            "review_date": "2016-08-28",
            "source": "rt"
        },
        {
            "content": "This movie was beutiful with many whimsical scenes of just pure beauty!",
            "review_date": "2016-07-05",
            "source": "rt"
        },
        {
            "content": "'I can't help it. Music makes me cry.'",
            "review_date": "2016-06-23",
            "source": "rt"
        },
        {
            "content": "Slow movie that, although heart felt, was a bit to heavy handed with its message. There were certain scenes of the film that did have me invested in 1900 as a character but overall I would say this is a one-time viewing film. No need to see it a second time. Another film of the late 90's that had potential and fell with a flop.",
            "review_date": "2016-02-29",
            "source": "rt"
        }
    ]
}