{
    "rating": 8.7,
    "release_date": "Invalid",
    "num_reviews": 50,
    "genres": [
        "Spanish(Spain)"
    ],
    "summary": "A young businessman wakes up in a locked hotel room next to the body of his dead lover. He hires a prestigious lawyer to defend him, and over the course of one night, they work together to find out what happened.",
    "reviews": [
        {
            "content": "Amazing movie. Definitely recommend",
            "review_date": "2022-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a gripping, somewhat dark Spanish crime drama. The plot pace is a bit slow but as the plot continues, I found myself feeling more engrossed in it. There are numerous layers present in the plot and I found myself feeling like an armchair detective, as the saying goes, trying to second guess what may happen next, what may have led to the outcome being investigated. Its quite a good slow burner that I enjoyed, so I would recommend it.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "86% favorable by the audience, 70% by critics.  The critics got this one wrong.  And I'm surprised the audience review isn't higher.  This was a masterpiece: well written, perfect editing, superb casting and acting.  Perhaps because of subtitles it was only 86%?  I was totally engaged throughout.",
            "review_date": "2022-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The final twist strains credulity, but this is otherwise a wonderfully diverting film for fans of cerebral, twisty mysteries. Be prepared to think hard to follow what's happening. The film visually portrays various possible versions of the same events, which takes some getting used to but is ultimately quite effective.",
            "review_date": "2022-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was fantastic. to be honest, i was just enjoying the story & trying to figure out what actually went down & then that ZINGER of an ending happened! for some reason i was expecting more to the story so the fact that the final twist was upon me, i was unprepared. it was great - the movie would've been fine if it had continued, but the fact that it ended where it did (& how it did) made it better. would definitely recommend this one.",
            "review_date": "2022-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a wild ride!!! Psychological thriller is my game and this is one of the best, esp in foreign language. And how I love the big reveal.",
            "review_date": "2022-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Special Effects: 1,0/Sound Effects: 1,0/Acting: 1,0/Story: 2,0",
            "review_date": "2022-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too dramatic to be real.",
            "review_date": "2021-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie! Although you do need some serious suspension of disbelief, the twists are good and the way everything is presented is just very enjoyable. Had a great time watching it.",
            "review_date": "2021-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is really a positive surprise. Great compelling story paired with amazing acting and directing. A must see.",
            "review_date": "2021-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Checkmate.\n\nA Spanish thriller on Netflix that is not talked about enough. A successful business, being accused of murder, hired a defense attorney as both tried to figure out how to win the case. \n\nThe storytelling was mixed between the conversation and the flashbacks. The majority of the movie was just talking, and still it was an intense thriller because the attorney was trying to figuring out the whole story behind the businessman. \n\nAfter the first half, I was still curious because I wanted to see how this would end. I thought that I was picking up the clues, and had some ideas of how the story would end. Indeed, for most of the second half, there was a lot of twist and turn, and although some were expected, I felt intense and my ears were glued to their words. And when the final twist hit, I probably had the longest gape since the Red Wedding. I was completely fooled. It hit me so hard that I got emotional. \n\nOverall, this thriller mystery needed to be talked about more. I was still recovering from that ending when I was writing this review. 9/10",
            "review_date": "2021-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great twisty mystery that's difficult to predict. Not a scene wasted.",
            "review_date": "2021-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well-acted, nicely shot and with fervent performances from the star-studded cast, ‘The Invisible Guest' starts out strong with a murder mystery that makes it obvious that you can look forward to some sort of twist. But once the twist happens and is swiftly followed by another and then another, it reaches absurd levels that make it almost impossible to believe or take too seriously. Nevertheless, Oriol Paulo presents the proceedings with such aplomb and in such a dramatic manner that, despite them being somewhat ridiculous, they're still quite fun and satisfying to behold.",
            "review_date": "2021-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thriller that kept me on my toes but without really delving into any of the characters. A good watch nevertheless",
            "review_date": "2021-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the plot. Movie had that intense feeling when you just can't move your eyes away from the screen for one second or you will miss some important detail.",
            "review_date": "2021-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a master piece from the behinning to end.  Unpredictable story made my butt rose up literally.",
            "review_date": "2021-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! Twists and turns abound in this gripping, edge-of-your-seat thriller. There is something wonderfully classical here in the setup - a dead body found in a locked room, where no one can enter or leave - and yet, the movie feels fresh and innovative. Some parts of the movie feel a little contrived, but it's hard for thrillers not to feel a touch forced. Still, this movie had me on the edge of my seat.",
            "review_date": "2021-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie burnt down my braincells so much. Its honestly one of the best mind blowning movie i have ever seen",
            "review_date": "2021-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderfully crafted mystery/who-done-it complete with a murder in a locked room, confidence scams and revenge.  Lots of twists and turns that do not go off the rails as can so easily happen, and the ending pleasantly sneaks up on you and gives you a good smack in the face.  The story does jump back and forth from the present to the past a bit too much, but the pacing is well maintained so as to keep the flow and not draw the audience out of the movie.  A very satisfying movie.",
            "review_date": "2021-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An affair goes horribly between a tech boss and photographer. On their way back to their spouses after a rendezvous far from home, they end up having a collision. To protect themselves from being found out of their dirty secret, their plan to suddenly make the other driver vanish is where this story starts. Mind bending, twists, suspense, enthralling and nail biting to say the least. The plight of the parents who's innocent son was involved carry out their own investigations after giving up on the law. They know what they know and won't  give up until they get the truth. A fantastically executed production. Don't be put off by the subtitles of this Spanish movie. I've just seen it twice it's that good! 👌🏼👌🏼👌🏼👌🏼👌🏼",
            "review_date": "2021-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was absolutely amazing! It plays games with your mind, and shivers down your spine! Must watch movie!",
            "review_date": "2021-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, excellent twists.",
            "review_date": "2021-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intriguing and well-made, The Invisible Guest is certainly an enjoyable thriller.",
            "review_date": "2021-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great a compelling story, amazing narrative, and acting and great plot twist that makes narrative sense incredible movie overall.",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very strongly constructed movie, with a good premise. Only complaints are that I manage to guess the plot twist since very early on, also the first part of the movie since everything is explain trough the view of the ones that did wrong you don't feel much empathy for them or want them to be free which makes difficult to care for them or the plot. \n\nApplauses to the cinematography it is almost \"David Fincher\" level of beautiful.\n\n\nThose who don't guess the plot twist will have even a better time watching this.",
            "review_date": "2020-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I must start off my review of The Invisible Guest by mentioning that this is a movie where I had to pause and rewind frequently. While I have become more adept at reading subtitles and have found many foregin language films enjoyable, this one had dialogue that was coming rapid-fire at times. I kept missing lines, and because it is a mystery, I was afraid of missing anything that might be a vital piece of information. This isn’t a detriment to the film, but perhaps a warning for those who also have difficulty with reading subtitles that are only on the screen for a few seconds. Aside from that I was utterly enthralled by The Invisible Guest. The plot is written so well, and is constantly revealing new layers of the story as you go. Perhaps the smartest move they make is having every single flashback scene reflect what is being said, even if there is some falsehood in it. This allows us to revisit key moments from a new perspective when the main character revises his story. It’s hard to say much about The Invisible Guest without spoiling things, but I can say that I thought the cast was amazing. There was a lot of emotion that came out in the performances we see here, and Mario Casas was particularly brilliant. He plays a heavily-layered character that is reluctant to put his guard down, so it’s intriguing to see the stages he goes through in this film as he is forced to tell the truth. Ana Wagener is the other notable actor in the film. Her determination is perfect for the role, and it was great watching how she was always a step ahead of Casas in every scene. I will say that I started to suspect what is revealed at the very end somewhat early on, but as with all the best mysteries, even when you figure out one piece there is still more to discover. I can’t say much more about The Invisible Guest for fear of spoiling things. I would highly recommend that all fans of mystery/thrillers give this movie a try. It was completely satisfying for me.",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting isn't bad, but its not great. Its predictable, especially if you've seen any other film in this genre.  It feels like the ending was stretched out and filled with twists for no reason.",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's dramatism towards the end reveal is just meh...",
            "review_date": "2020-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "film with a great performance with a somewhat confusing script because you can't understand it all the time, a great Thriller / Mystery movie that you won't regret.",
            "review_date": "2020-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic direction, great acting - and a good script!",
            "review_date": "2020-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "indeed, every story has 2 sides -- and la verdad is all so satisfying here because it reels you in, makes you feel for the victims and the finale is a tasty revenge story. Well done.",
            "review_date": "2020-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A clever, inventive and thrilling crime mystery clearly inspired by Alfred Hitchcock's works, with unexpected plot twists, compelling performances and a gripping and engaging narrative.",
            "review_date": "2020-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Complicated and intricate - this murder mystery rabbit hole gets deeper and deeper.  The wealthy businessman has only a few hours to form his defense for murder with his stealthy defense lawyer.",
            "review_date": "2020-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As yet another entry into the who-done-it/chessmatch thriller genre - I guess it's pretty good (barring maybe a hole or two*).  Not much else here at all however.\n\n*SPOILER:\nE.g. Perhaps i missed something and, honestly, I don't care enough to double check this, but it seems implausible to me after watching it that the lawyer wouldn't have recognized the wrong voice during their phone call.",
            "review_date": "2020-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are a person who likes movies that make your head explode with confusion. you have to see this film. The performances convey the feelings and despair of the main characters.The music match with the plot and the actions that are happening.  I like this movie because you can not  know if there is actually truth in what is happening. In all the movie you will have doubts and this is one of the reason of why you are going to be really interested. Also the movie has an interesting way to start so you will have the end at the start of the movie and then you will try to conect the explain of the history with the testimony of the characters. But the best is if you think that you know what really happend let me tell you that is not truth. If you want to know what i mean go to netflix an see this film.",
            "review_date": "2020-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty decent. Nothing mind-blowing here, but it was just fine entertainment for the evening.",
            "review_date": "2020-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit like crocodile from black mirror but it has its own twists and turns. Great movie.",
            "review_date": "2020-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Great plot twists. Spanish cinema has one of the best movies out there",
            "review_date": "2020-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great!!! marvellous!!",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really mind twisting!!",
            "review_date": "2020-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unless u asking some logical questions on this movie then it will give you some Worthy entertainment. Some facts were unbelievable and left with lot of questions.  We have question like whether he arrested or he blend the law again?",
            "review_date": "2020-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good for those who have face blindness. No matter how many twists it has, there's only one biggest \"gag\". Unfortunately, the director and the makeup team didn't do a great job. Once you recognized the lady in the beginning, all suspense just went away...",
            "review_date": "2020-04-03",
            "source": "rt",
            "lang": "en"
        }
    ]
}