{
    "rating": 8.3,
    "release_date": "Invalid",
    "num_reviews": 28,
    "genres": [],
    "summary": "",
    "reviews": [
        {
            "content": "it was very slow, in places it was boring.  over all a waste of celluloid",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "Slow burning until its shocking end, The Wicker Man provides subtle (and some not so subtle) illuminations on religion, religious intolerance, and man's relationship with faith. Edward Woodward gives a fine performance as a devout, strict Christian copper investigating a disappearance in a community of pagans. Woodward disapproves and even looks down upon, somewhat undeservedly at first, of practices outside his own faith. His own personal faith is tested by the trials that beset him, pitting him against a community he does not wish to know, but seeks to understand. He uncovers a power structure that allows his foe, a lyrical, suave Christopher Lee, to sway a community to its knees with beliefs in iconoclastic and natural forces, the very same forces that gave rise to Woodward's own religious faith. This conflict is not just personal, but spiritual, and philosophical in its examination of the power of different beliefs over the lives of very different people.",
            "review_date": "2021-04-01",
            "source": "rt"
        },
        {
            "content": "Really not sure what to make is this cult horror classic. Definitely wierd.",
            "review_date": "2017-08-11",
            "source": "rt"
        },
        {
            "content": "An absurd and oddly charming thriller that's very easily predicted and will be lost for many, but what Hardy ahcieves with his film is conveying the utter lust and greed of man for/against nature, with props to both Woodward and Lee who both give frighteningly stark and polar emotional performances. The cinematography still looks fantastic and the edge of the climax is still as strong as it was presumably in 1973, hitting hard with a shocking finale.",
            "review_date": "2017-07-24",
            "source": "rt"
        },
        {
            "content": "Quite audacious for the time it came out, this creepy cult classic should be remembered for the intelligent questions that it raises about religious intolerance and blind faith, with an also memorable performance by Christopher Lee and a terrifying, unforgettable ending.",
            "review_date": "2016-07-19",
            "source": "rt"
        },
        {
            "content": "The Wicker Man contains a certain unique brand of British horror and it was good to finally see this final cut. One thing I had forgotten was how good the folk soundtrack is.",
            "review_date": "2015-10-29",
            "source": "rt"
        },
        {
            "content": "All Sir Christopher Lee's and Peter Cushings films are awesome, i love them all and nearly got them all on DVD.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "One of my absolute favorite films of all time, finally in its entirety. Chilling and unforgettable. One of those endings that you just don't forget.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "I love hate this movie. It's so bad, but when it's on I just can't stop watching it. haha.",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "The Wicker Man (1973) - 6\n\nHorror film directed by the British Robin Hardy. Interesting screenplay, but unrealized by a direction that left much to be desired, in my opinion. Not wanting to sound rude, this seemed like an amateur directorial work, this an insipid film, not capable of inspiring any reaction, feeling or mood in me, except when, inadvertently, it seems to mock itself, i.e., indulging in its own cinematic limitations and banality, in these cases it either amuses or unnerves me. The only positive things I could extract from here (besides the promising screenplay) were the female beauties, one or two wonderful folk songs and some comical moments (I'm not sure they were supposed to be so). The typical mediocre movie that never takes itself seriously and I usually try to avoid, but I understand why it has acquired the cult status. Major disappointment, to oblivion.",
            "review_date": "2014-04-25",
            "source": "rt"
        },
        {
            "content": "What starts off slow and subdued, builds exponentially to an incredible whirlwind of gripping story telling.   Eerie and haunting.     Do yourself a favor and avoid the 2006 version.   The original is a gritty, emotional, terrifying journey, from a cat and mouse whodunit that thrusts us into the unknown macarbre.",
            "review_date": "2014-03-17",
            "source": "rt"
        },
        {
            "content": "Never go on holiday to the Scottish Isles",
            "review_date": "2014-01-17",
            "source": "rt"
        },
        {
            "content": "Full of randy pagan eccentricity! Xenophobia takes on it's oddest incarnation in Britain during the 70's with Christians fearing the return of the old gods. This film is lush, colourful and brimming with eccentric characters that offset the heavy religious overtones nicely to create a truly unique film experience.",
            "review_date": "2014-01-07",
            "source": "rt"
        },
        {
            "content": "Fruity as. Best watched when in the mood for some genuine 70s British kink.",
            "review_date": "2013-11-25",
            "source": "rt"
        },
        {
            "content": "Brilliantly disturbing, with perfect performances from Edward Woodward and Christopher Lee and a delightful soundtrack.",
            "review_date": "2013-11-05",
            "source": "rt"
        },
        {
            "content": "This is the worst representation of Pagan worship that I have ever seen. True it's from the '70's but even then sacrificing any living thing was considered absolute wrong.  One of the worst movies I've ever seen.  I hope the ASPCA laws were in tact during the filming of this movie.",
            "review_date": "2013-10-17",
            "source": "rt"
        },
        {
            "content": "classic and old school. one f the finest horror films I've ever seen. Great Music, acting and photography.",
            "review_date": "2013-10-17",
            "source": "rt"
        },
        {
            "content": "I enjoyed the subtleness of the earlier version more. This one was more entertainment than symbolism.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "Great. Oldie and def a goodie, I'll want to see this again..",
            "review_date": "2013-10-10",
            "source": "rt"
        },
        {
            "content": "Seriously, I'm never going to visit a small, isolated community in an island...",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "Despite a few bad shots, a couple of dodgy overdubs, and THAT bottom, this is still a masterpiece of a movie. It's lost none of its creepiness. The 'final' edit is closer to Robert Hardy's original cut than the last DVD release which featured scenes in the Police Station which Hardy is now embarrassed about. This version introduces Christopher Lee much earlier and there's the song 'Gently Johnny', but nothing taking us too far from the beaten path. It's good to be reminded of how wonderful Edward Woodward's performance really is; those final scenes - with the equally wonderful Christopher Lee -  are just pure cinema.",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "Final cut finally nails it! A perfect horror that just got even more perfect!",
            "review_date": "2013-10-04",
            "source": "rt"
        },
        {
            "content": "Shortest Version, But still a great movie.",
            "review_date": "2013-10-03",
            "source": "rt"
        },
        {
            "content": "Offically now my worst film of all time. An outdated sequel (no way is it a remake). A farcical plot so totally dull and impossible to accept from beginning to end.",
            "review_date": "2013-10-03",
            "source": "rt"
        },
        {
            "content": "Nutty stuff. \n\nThe Nick Cage version is also worth a look. It's Nicolas Cage at his Nicolas Cagiest......chewing scenery, punching women in the face and people in bear suits & screaming those unforgettable five words that are destined to become part of cinema lore, up there with...\"You know how to whistle don't 'cha?\",...........\"Ahhhh Nooooo!! Not the Bees!!!!!\"",
            "review_date": "2013-09-30",
            "source": "rt"
        },
        {
            "content": "A unique masterpiece of subtle horror cinema.\nJust reviewed the 40th anniversary DVD edition for Filmwerk:\n\nwww.filmwerk.co.uk",
            "review_date": "2013-09-27",
            "source": "rt"
        },
        {
            "content": "Still as powerful as ever - just as strange, unnerving and horrific as you remember, this cements its place as quite possibly the best British horror movie of all time",
            "review_date": "2013-09-24",
            "source": "rt"
        },
        {
            "content": "Doesn't really stand the test of time, but there's loads of naked women and awesome Christopher Lee.",
            "review_date": "2013-08-29",
            "source": "rt"
        }
    ]
}