{
    "rating": 8.5,
    "release_date": "Invalid",
    "num_reviews": 250,
    "genres": [
        "Mystery&thriller"
    ],
    "summary": "In the 14th century, William of Baskerville (Sean Connery), a renowned Franciscan monk, and his apprentice, Adso of Melk (Christian Slater), travel to an abbey where a suspicious death has occurred. Using his deductive powers, William begins investigating what he believes to be murder. During the course of his investigation, several more monks wind up dead. With fear running through the abbey, the church leaders call forth Bernardo Gui (F. Murray Abraham), William's nemesis, to find the truth.",
    "reviews": [
        {
            "content": "A masterpiece every actors situations, lands, script directing, everything is in is place for this glorious masterpiece.\nI dream that one day another director make another beautiful and blowing mind like this💞💞💞💞😍😍😍😍😍💪💪💪💪\nThank you Mr Eco, Mr Annaud, and all cast you make me happy a d I love you\nThat movie is a miracle",
            "review_date": "2023-04-01",
            "source": "rt"
        },
        {
            "content": "Great script, great movie.",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "The Name of the Rose is a fantastic movie, full of mystery, intrigue and an interesting development that provides a pleasant experience.\nAlthough the beginning is slow and the end could be executed, all this is solved with the magnificent performance of Sean Connery as the protagonist.\nUndoubtedly a classic movie, which is unmissable and worth giving it a try.",
            "review_date": "2022-07-06",
            "source": "rt"
        },
        {
            "content": "The Name of the Rose is a very good movie. The performances are very good. It lacks the main plot idea from the book, but instead is focused on crime and mystery, so it's a good detective movie. Also the medieval era depiction is great",
            "review_date": "2021-11-25",
            "source": "rt"
        },
        {
            "content": "It only keeps the medieval setting and the essential plot elements, missing out on anything that made the book the masterpiece of the century; the sad thing is that they did it willingly and thought they could get away with it.",
            "review_date": "2021-10-03",
            "source": "rt"
        },
        {
            "content": "Based on the novel of the same name by Umberto Eco, this 1986 mystery drama follows an intellectually nonconformist Franciscan friar who is called upon to investigate a deadly mystery in an isolated medieval abbey in northern Italy. It successfully transports the viewer to the historical period depicted in the story and the performances are great, above all Sir Sean Connery's, which earned him a BAFTA. The story is deeply entertaining and intriguing and it reflects on the controversial issues of the time, when the Inquisition decided on the validity of historical texts. As expected, the movie evidently shows just a bit of the grand masterpiece written by Eco, which I'd very much like to read.",
            "review_date": "2021-09-26",
            "source": "rt"
        },
        {
            "content": "Based on the novel by Umberto Eco \nMysterious murders have been taking place in 1327 at a abbey of monks \nWhen a friar, William of Bakersville arrives with Adso of Melk he begins to question what's really going on \nThe victims die under mysterious circumstances and William is desperate to find out the truth \nThis is a place of blind faith so William faces plenty of doubt from everyone else \nThis is long and gets confusing with its own murder mystery at times \nPlenty of good stuff such as the performances, the reconstruction of the period, the over-all feeling of medieval times \nThe plot itself can be very uninvolving though \nNot one of the late Sean Connery's best but just passable",
            "review_date": "2021-09-24",
            "source": "rt"
        },
        {
            "content": "What can I say, I love historical drama films and murder mysteries.",
            "review_date": "2021-09-21",
            "source": "rt"
        },
        {
            "content": "Nobody does it better than Sean Connery!!!!",
            "review_date": "2021-08-26",
            "source": "rt"
        },
        {
            "content": "An old-time favourite.",
            "review_date": "2021-06-27",
            "source": "rt"
        },
        {
            "content": "I had wanted to watch this for a couple years and never got around to it. I thought a mystery-thriller set in medieval times starring Sean Connery sounded interesting and its positive reception intrigued me more. After finally watching it, it didn't really live up to what I hoped it would, though I still mostly liked it. While the movie is impressively directed and photographed, the set design and atmosphere captures the feel of medieval times very well, and its led by a charismatic performance by Sean Connery, though I can't say I wasn't a little bored at times during the movie. A decent movie, though I can't say I'll come back to it soon.",
            "review_date": "2021-06-23",
            "source": "rt"
        },
        {
            "content": "Not many movies take place in the year 1327.  That is just one of its attributes that makes it such an original and interesting film.  It also touches on theology, philosophy, Armageddon and the Inquisition and does so brilliantly.  Ron Perlman and F. Murray Abraham give exceptional performances.",
            "review_date": "2021-03-19",
            "source": "rt"
        },
        {
            "content": "There's a satisfying atmosphere that does justice to a medieval \"detective\" story.",
            "review_date": "2021-03-08",
            "source": "rt"
        },
        {
            "content": "An all-star squad (Perlman, Abraham, Connery and Slater) headlines this atmospheric murder-mystery with a medieval and religious spin and moody original score.",
            "review_date": "2021-01-21",
            "source": "rt"
        },
        {
            "content": "A faithful and compelling adaptation of the book by Umberto Eco, a medieval murder mystery set in the midst of the papal wars. Superb film making with Connery, Abraham and a young Christian Slater all in top form. Watch it, then read the awe inspiring book and then read everything else by the late, great master of the literary novel.",
            "review_date": "2020-12-26",
            "source": "rt"
        },
        {
            "content": "Absolutely one of the best movies to watch.",
            "review_date": "2020-12-18",
            "source": "rt"
        },
        {
            "content": "I have never given to much thought at what has influence the person that I am today, but now that I look back I have realize that watching Luther and In the Name of the Rose as a young man did end up having an impact in me. Maybe consciously or unconsciously watching movies like this make me realize that we shouldn't blindly follow instructions based on blind faith. In the name of the rose is a bromance in the form of an Master/Apprentice relationship, a detective movie, a great performance by Sean Connery, that always manage to look decisive and fair, and last but not least a poignant  critique on religion. I wish this movie keeps reaching young minds so they can develop a much needed sense of \"questioning\".\n\nThe camaderie of Sean Connery and Christian Slater on screen is great.\n\nRon Perlman always adds so much to films he is in.",
            "review_date": "2020-11-23",
            "source": "rt"
        },
        {
            "content": "A rose by any other name would be just as dreary.",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "One of the best example in the history of cinema of the gathering of two things rarely together:\nGood script and good ambiance, rythm and magic.\nThe film is a journey both because it's an intense thriller, and because the image, music, editing, acting, sound, set are mesmerizing.\nIt seems like your present disappear when you see that film. You are a monk from the middle ages...",
            "review_date": "2020-11-14",
            "source": "rt"
        },
        {
            "content": "An interesting little detective murder mystery that also covertly has a go at catholicism",
            "review_date": "2020-11-02",
            "source": "rt"
        },
        {
            "content": "Good mystery set in an abbey where everyone is not quite as they seem. Sean Connery and Christian Slater are a good match. Quite intriguing, little bit sad at times, but mostly it delivers. A good watch, and probably one that you should definitely watch, if you can find it. Good film.",
            "review_date": "2020-10-09",
            "source": "rt"
        },
        {
            "content": "An engrossing tale of mystery, philosophical thoughts and epic imagery and philosophy. Great thriller!",
            "review_date": "2020-08-28",
            "source": "rt"
        },
        {
            "content": "The solitude and perversion of men of faith.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "Not remotely interesting and boy does it drag.",
            "review_date": "2020-07-13",
            "source": "rt"
        },
        {
            "content": "One of greatest movies of my life. I saw this movie about 12 times I think.",
            "review_date": "2020-02-29",
            "source": "rt"
        },
        {
            "content": "A great adaptation of the book.",
            "review_date": "2020-01-20",
            "source": "rt"
        },
        {
            "content": "Connery masters the film with a plot of exciting mystery that exposes well the period of the time portrayed.",
            "review_date": "2019-12-17",
            "source": "rt"
        },
        {
            "content": "One of the most meticulous productions on film. But no gunfire, so a low rating in the USA",
            "review_date": "2019-07-11",
            "source": "rt"
        },
        {
            "content": "Beautiful, very detailed and realistic.",
            "review_date": "2019-07-09",
            "source": "rt"
        },
        {
            "content": "It's, in my opinion, a great adaptation of the novel, at least almost the whole movie. It also has a self-personality and introduces you in a wonderful way into that great atmosphere of the book has. And you can watch one of the best Connery's performance ever.",
            "review_date": "2019-06-05",
            "source": "rt"
        },
        {
            "content": "This Italian, French, German co-production is a strange mix of Sherlock Holmes in the Dark Ages (13th Cent) and can be alternately as drab as it is intriguing Connery, at times seems a little out of place as the bright investigative Franciscan monk ï¿ 1/2\" seeking clues to uncover a serial killer (or killers) amongst the brethren of a Franciscan monastery. The international cast, mainly do justice to the bizarre occurrences within this somewhat messy Abby - that supposedly, performs the demanding task of translating the scriptures for its sumptuous Library! Itï¿ 1/2(TM)s interesting to note that a somewhat graphic sex scene was removed in some countries and edited for others but, the original was a little overindulged for its purpose and perhaps obviously placed for the sake of an ï¿ 1/2~adultï¿ 1/2(TM) certificate.  \n\nMuch of the movie features several scenes of grotesque violence leading up to the burning-at-the-stake finale. Certainly not a movie for everyone but an interesting curio that cost more than it retrieved in some countries.  James Hornerï¿ 1/2(TM)s haunting score came across as borrowing from an equally haunting epic of the 60s ï¿ 1/2Barabbasï¿ 1/2Â?.  For those who like ï¿ 1/2~em strange & heavy.",
            "review_date": "2019-01-28",
            "source": "rt"
        },
        {
            "content": "At first I was like \"Hah, this is some kind of Sherlock Holmes but a priest thing!\", and then I was like \"Oh, this is some kind of Sherlock Holmes but a priest thing!\"",
            "review_date": "2019-01-19",
            "source": "rt"
        },
        {
            "content": "I first heard about The Name of the Rose when I played a board game called Mystery of the Abbey that bears some similarities to Clue, but was all about finding out which monk committed murder in their abbey. That’s when someone mentioned to me that there was a book and subsequent film about the exact same topic. I was instantly fascinated, and that interest only increased when I found out Sean Connery was the star. The idea of a murder being perpetrated in a holy place is an interesting concept, and having it investigated by a monk as well makes it even more intriguing. I always like murder mysteries, but when they are set in this kind of environment it ratchets up the tension because of how close-knit and insular their little society becomes. The Name of the Rose is at its best when it allows Sean Connery and Christian Slater to be detectives. Their relationship is a good one, because that master-apprentice connection makes it so Connery has to vocalize to Slater what he’s thinking, and at the same time that tells us. There was plenty of suspicion thrown around in the film, and I never felt like the identity of the culprit was obvious. It helped that so many of the monks seemed insane, disgusting, or at least unpleasant. That made it so you could never get comfortable in this location, and it was easy to suspect everyone. The final reveal of why the crimes were committed was crazy, and didn’t quite live up to the severity of the murders, but at least I didn’t see it coming. I had some big problems with certain subplots that were clumsily tacked on to the film. In particular the romance/lust story between a peasant woman and some of the characters was an awkward distraction that I found annoying. Knowing how little it played into the plot makes me wish I had just skipped the whole thing. I think it was supposed to add some extra tension in the conclusion, but because I was not at all invested in that character it was pointless to me. There were a few other details that felt like they either needed to be fleshed out more or jettisoned from the script. I think all this extra nonsense was added to deflect suspicion from the real murderer, but I’m not sure it was needed. I still think there’s a kernel of a good idea in The Name of the Rose, but it didn’t come together into a film that lived up to that potential for me.",
            "review_date": "2018-08-10",
            "source": "rt"
        },
        {
            "content": "Excellent. The story, plot, and (in my opinion) production is awesome. The direction great. I always felt I was watching people from those times, more or less... The less is because of Connery and Slater, which I think they both sucked not at acting, but talking. They just didn't nail the tones and ways of speaking. The clear Sherlock Holmes tones and references weren't good.\nBut anyways... Great movie",
            "review_date": "2018-08-04",
            "source": "rt"
        },
        {
            "content": "The film looks very nice and succeeds in creating an eerie atmosphere. Sean Connery delivers a good performance. However, it's impossible to translate Umberto Eco's amazing novel into a 2 hour movie, so it might be unfair to critizise the film for falling flat when it comes to its story.",
            "review_date": "2018-01-01",
            "source": "rt"
        },
        {
            "content": "4.2/5\n\nIm not sure of the way the film was received around 30 years ago, but now, the film stands strong as a profound and intriguing tale that makes even the most bizarre and unexpected of places, a monestery, the perfect location for a murder mystery filled with themes that are surely hard to replicate in a modern film with such class.",
            "review_date": "2017-11-30",
            "source": "rt"
        },
        {
            "content": "The Name of the Rose has a weaker structure and slow pace, but memorable characters and a well told, intriguing story. It is a historical mystery that works mostly thanks to very strong acting across the board, great cinematography and particularly phenomenal sets that recreate the atmosphere and the mood of the medieval period remarkably well.",
            "review_date": "2017-11-16",
            "source": "rt"
        },
        {
            "content": "good medevil thriller done in an unusal setting",
            "review_date": "2017-09-29",
            "source": "rt"
        },
        {
            "content": "While Connery and Slater provide our eyes (and brains) to look into a world where power corrupts and mankind is in a state of physical and mental reduction, the film drags at a snail's pace with a climax that doesn't quite reach a satisfying payoff.\nOtherwise, the film is well shot and it does create an atmosphere that is discomforting while emphasizing the harshest realities of the Middle Ages.\nWorthy enough to see once.",
            "review_date": "2016-11-27",
            "source": "rt"
        },
        {
            "content": "Really awesome, literary and thought provoking movie with good acting and cinematography.",
            "review_date": "2016-11-21",
            "source": "rt"
        },
        {
            "content": "Another film were Sean Connery delivers a solid performance",
            "review_date": "2016-09-16",
            "source": "rt"
        },
        {
            "content": "Impeccable feature based on the novel with the same name, written by the Italian mastermind Umberto Eco. Set in the 12th century northern Italy, it's convertion to movie, is overall a giant challange. Though the surroundings and custumes/looks are truthfully geniune. The storyline do not either move, takenly  apart from the original novel, and yet manages to keep the vision fully alive.",
            "review_date": "2016-08-17",
            "source": "rt"
        },
        {
            "content": "87%\nWatched this on 11/7/16\nA film that remains sharp as an effective commentry on the religious madness of the medieval ages and it is equally intelligent, thrilling plus you also get Sean Connery in the middle of it all. Christian Slater chews the scenary for most of the time. It is tense, but not in the way most thrillers are, it is tense because of the society in which it occurs and the film leaves nothing unturned while trying to portray it on screen.  Annaud directs effectively and the cinematography is an advantage.",
            "review_date": "2016-07-11",
            "source": "rt"
        },
        {
            "content": "This was a good movie, but not one to be watched more than once. Think of it as Sherlock Holmes as a monk in medieval Europe. I learned a lot about the historical period from the movie, and the various monastic orders from my friend who had read the book the movie is based on. Sean Connery and Ron Perlman did a great job in their acting roles.",
            "review_date": "2016-05-24",
            "source": "rt"
        },
        {
            "content": "A fantastic religious murder mystery, that follows intelligent reasoning to solve gruesome crimes in an age without reason.",
            "review_date": "2016-02-17",
            "source": "rt"
        },
        {
            "content": "great classic movie,\nand a wonderful  great actor",
            "review_date": "2016-01-04",
            "source": "rt"
        },
        {
            "content": "This has a charming intellect to it that was refreshing to see.  However, this movie did have it's pacing problems.  At least we get a great performance from Sean Connery, who is by far the saving grace of the film.",
            "review_date": "2015-11-02",
            "source": "rt"
        },
        {
            "content": "An interesting Murder-Mystery film taking place in the 14th Century where Sean Connery and Christian Slater attempt to solve the sudden deaths of each monk as the days go by. And an unlikable antagonist played well by F. Murray Abraham gives the potential to steal the show.",
            "review_date": "2015-07-24",
            "source": "rt"
        },
        {
            "content": "Tan Fascinante como la novela, todo un clasico que no cansa revisar y disfrutar una y otra vez.",
            "review_date": "2015-06-12",
            "source": "rt"
        },
        {
            "content": "\"How peaceful life would be without love, Adso, how safe, how tranquil, and how dull.\"",
            "review_date": "2015-04-23",
            "source": "rt"
        },
        {
            "content": "In all aspects a classic among classic thriller. Film making at it's best in all departments. A masterpiece. Portraits of leading characters will resonate whenever we see another movie with contrasts.",
            "review_date": "2015-04-10",
            "source": "rt"
        },
        {
            "content": "pretty old movie, still very relavant in the current state of affairs...\nwhy they fear laughter? -whether it is pk or cartoons ?\n\"coz...laughter kills fear.And without fear, there can be no faith.\nand without fear of the devil,there is no more need of God !\"\n - that is what the crazy so called \"apostles of god\" belives !",
            "review_date": "2015-01-15",
            "source": "rt"
        },
        {
            "content": "A series of dark and mysterious deaths , set in an ecclesiastical castle achieves a medieval atmosphere .",
            "review_date": "2014-12-08",
            "source": "rt"
        },
        {
            "content": "(58%)\nA strong, quality entry into the medieval period set movies, with more than a touch of exploitation fun added into the mix to spice things up a little. Sean Connery is on decent form as one of the very few likeable characters, while a very young looking Christian Slater is fine as the apprentice monk. The best aspect by far though is the bleak, cold, and impressive looking setting which incorporates an actual Italian fortress, and some of the location work and cinematography is very good. Above all else this is a murder mystery, and because of the setting it makes for a quite unique and interesting watch. And despite the pace overall being a touch too slack, this is still a fine, slightly obscure watch.",
            "review_date": "2014-12-08",
            "source": "rt"
        },
        {
            "content": "An interesting enough murder mystery that doesn't quite take off in terms of an edge of your seat plot. Where this movie pleases is in its almost art house like feeling.",
            "review_date": "2014-09-09",
            "source": "rt"
        },
        {
            "content": "A brilliant, poignant tale of the import of knowledge and the power of repression. As a medieval thriller, The Name of the Rose is absolutely first rate, and should appeal to all mystery film buffs, whether they've read Eco's book or not. Connery convinces in his cassock and, though the themes will not capture everyone's interest, this is a refreshing, inventive whodunit. Connery and Slater both do admirable jobs here as detectives in the mold of Sherlock Holmes and Watson, although Slater seems to play his character in an almost constant state of confusion. F. Murray Abraham, meanwhile, is second-billed in what amounts to little more than a cameo as the grand Inquisitor, who's called in as the deaths pile up and the monastery hosts an important theological conference. Ron Pearlman is phenomenal in early career turn as manic hunchback. Annaud is also sly enough to keep the grip of belief front and centre, keenly creating one of the most original whodunits of recent years out of one of those so-called \"unfilmmable\" books. Annaud does not shy away from extreme gore, horror makeup and a vivid sex scene between Slater and Valentina Vargas. The whodunit is also well-constructed, engaging and, better yet, makes complete sense.\n\nVERDICT: \"High-Quality Stuff\" - [Positive Reaction] This is a rating to a movie I view as very entertaining and well made, and definitely worth paying the full price at a theatre to see or own on DVD. It is not perfect, but it is definitely excellent. (Films that are rated 3.5 or 4 stars)",
            "review_date": "2014-08-09",
            "source": "rt"
        },
        {
            "content": "Sean Connery plays a Franciscan monk who favours reason over blind faith, called to investigate mysterious deaths at a secluded abbey. Then 15yr old Christian Slater is his young apprentice, impressionable, but learning at his master's side. This is a dark film, based on Eco's novel, a thriller/murder mystery set sort of like a much darker Cadfael. Look for Ron Perlman in a small role, and F. Murray Abraham as the nemesis of Connery's William. The whole thing was shot at an actual monastery at Eberbach, Germany.\nThis film marked a sort of late career revival for Connery, as he won the Best Actor at the British Academy Awards for his role. Interesting, worth a watch.",
            "review_date": "2014-04-26",
            "source": "rt"
        },
        {
            "content": "When I was little, I watched this movie over and over. Just watched it again and I really like it, but wonder how I could like it so much as a kid. It's pretty dark and horrible. I still love mysteries, period movies and everything about organized religion still makes me completely frustrated. Maybe I was the same back then.",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "\"The rats love parchment even more than scholars do. Let's follow him!\"",
            "review_date": "2014-02-05",
            "source": "rt"
        },
        {
            "content": "When history meets mystery. A perfect marriage.",
            "review_date": "2013-11-21",
            "source": "rt"
        },
        {
            "content": "The actual storyline was hard to understand and a bit too religious for me, but I did enjoy the setting of an Abbey in the 1300s with the wind constantly howling in the background and bells ringing. I found Sean Connery and Christian Slater's characters very engaging, but not so much the others.",
            "review_date": "2013-10-15",
            "source": "rt"
        },
        {
            "content": "Quite spooky and mysterious. A proper murder mystery, set in an unusual time in an unusual place. Cast is performing well.",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "This is one of these timeless, classic you can watch countless times, you will still get sucked into it , entertained, amused, intrigued & fascinated by this unusual story about a priest & his pupil, going to an abbey to uncover the mysterious death of some monks, linked by a mysterious forbidden book.\nShot with talent & passion in an incredible natural set, this film is not only a great thriller, it is also a beautiful documentary about the life and customs of the dark ages of the Middle age era. A pure Masterpiece.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "An impossible task (putting Eco's monumental novel onto the screen) is pulled off masterfully.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "Not a horror movie, but gives me the creeps!!",
            "review_date": "2013-07-03",
            "source": "rt"
        },
        {
            "content": "A crime movie set in a monastery. The plot was intriguing, and the performance of Sean Connery was really charming. But I felt like the rest of the characters were not that interesting. Although they casted the creepiest monks they could find, I´ll give them that. Also I felt that the subplot with the girl and the apprentice was irrelevant to the story. The movie entertains, having that Sherlock Holmes vibe, but it´s a little slow at times and the pay off was a little dissapointing.",
            "review_date": "2013-06-19",
            "source": "rt"
        },
        {
            "content": "I wanted to like this more than I actually did. Several Sherlock Holmes allusions, such as \"Elementary\" and Baskerville.  At one point, I also felt as if in a Harry Potter film.  IMO, \"The Church\"/\"The Holy Inquisition\" was comical and didn't receive its just reward, nor did I believe that the monastery was truly fearful of demonic influence.",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "Who done it with Sean Conery as a Holmes like monk and christian slater as his Watson.",
            "review_date": "2013-05-13",
            "source": "rt"
        },
        {
            "content": "Il film registicamente non e' nulla di che (anzi), ma la storia appassiona molto anche se il colpevole si intuisce precocemente (e non e' il maggiordomo).",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "Exceptional performances from top-notch actors. Frank messages, great atmosphere. Not to be missed.",
            "review_date": "2013-03-29",
            "source": "rt"
        },
        {
            "content": "1986 film adaptation from Umberto Eco's best-selling novel, The Name of the Rose, is a witty murder-mystery film bound to leave a permanent impression.\n\nName of the Rose begins with a Franciscan monk William of Baskerville (Sean Connery) arriving to a religious convention with his apprentice Adso of Melk (Christian Slater). What was supposed to be a peaceful theological gathering at Italian monastery soon takes a turn for the worse as monks start to die under mysterious circumstances. While others seek a more divine explanation for the deaths, William of Baskerville being a man of reason resolves to more earthly investigation techniques to explain the violence.\n\nWilliam of Baskerville as a character is a satisfying combination of legendary investigators like Sherlock Holmes and Hercule Poirot, with a little religious twist which makes him unique, and I could think of no better match to portray the character than Sean Connery with his genlemanish charm. From the directing perspective, French director Jean-Jacques Annaud's realistic directing style and his brutally honest depiction of middle age monastery life and its downright grotesque people and oppressive atmosphere might put off some viewers, but I found it a nice change from modern day Hollywood cleanliness.\n\nThe film does have a rather slow start but thankfully the intensity picks up around half way to the film as the murder mystery plot deepens. Also could not ignore some of the abrupt scene changes with the film which seemed bit out of place and tell of less than perfect transition from novel to film, but these were minor glitches and nothing great enough to hinder the film's overall resolve.\n\nThe Name of the Rose is not an easygoing film but I urge everybody to give it a try as it has a terrific cast, involving story and its out of mainstream directing style provides a realistic peek into one of the darkest time periods of mankind's history.",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "REVISITANDO: Su encanto se fortalece por las locaciones reales seleccionadas para su filmación.",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "Rarely can a film capture, so well the atmosphere and detail of a book...and this is the best film in Sean Connery's career.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "A bit hard going in parts but worth it, Good who done it",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "Not as well known as some of his movies, but those who don't see it, sure miss out.  Wonderful mystery, set in secluded monestery.",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "(Watched Sat 27 Oct 2012)",
            "review_date": "2012-12-23",
            "source": "rt"
        },
        {
            "content": "The best film on medieval religious issues and a murder mystery combined make a rare combination. This film is truly a mind puzzle, and a powerful gripping story. Sean Connery is outstanding and plays a very different role from his usual action hero genre. F. Murray Abraham is excellent as the zealot everybody loves to hate. One of my favorite films.",
            "review_date": "2012-12-17",
            "source": "rt"
        },
        {
            "content": "I cant quite remember i all but the parts i can are awesome.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "even thouh it's old, it was a great movie. The auther that wrote it is still bringing out great books. I hope the movie industry does another of his books to film",
            "review_date": "2012-11-27",
            "source": "rt"
        },
        {
            "content": "de los pocos libros que me gusto su adaptacion",
            "review_date": "2012-11-18",
            "source": "rt"
        },
        {
            "content": "Perfect movie for a night time cup! Classic!!",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "One of my favorite films of all time!  This little-known film features strong performances from Sean Connery, F. Murray Abraham and a strange and unsettling William Hickey.  This is probably Christian Slater's first big role, in which there is some momentary full-frontal nudity.  I read an article 20 years ago where Slater said he truly regretted exposing himself on film.  Well, Mr. Slater -- I don't regret it!",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "Thoroughly enjoyable medieval detective story with a cast full of some of the oddest looking men ever. Even Ron Perlman isn't ugly enough and wears a prosthetic pig nose! Less grim than I usually like my Middle Ages and quite fantastical (is that a word?) but then it is nice to get a happy ending now and then. Christian Slater is about twelve in this.",
            "review_date": "2012-10-26",
            "source": "rt"
        },
        {
            "content": "\"Daytime sleep is like the sin of the flesh; the more you have the more you want, and yet you feel unhappy, sated and unsated at the same time.\"",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "Outstanding movie that combines history, intrigue and mystery.   Connery is outstanding.  Moody and very entertaining, despite its length.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "The surreal ambiance of the Dark Ages makes this murder-mystery very unholy, yet very peculiar and interesting to ponder. Great chemistry between Connery and Slater, by the way!",
            "review_date": "2012-10-13",
            "source": "rt"
        },
        {
            "content": "This felt a lot like sherlock holmes but set at some holy place. There were some characters that looked too much alike and it made it hard to distinguish who they were at times.",
            "review_date": "2012-09-12",
            "source": "rt"
        },
        {
            "content": "One of the few movies about abbeys,Bibles and similar stuff that kept me collecting my jaw from the carpet during entire screening. Plus classical Connery-smirks.",
            "review_date": "2012-09-08",
            "source": "rt"
        },
        {
            "content": "Jean-Jacques Annaud can make some good... awkward sex scenes.",
            "review_date": "2012-07-13",
            "source": "rt"
        },
        {
            "content": "I never saw him again,and know not what became of him but I pray always that God received his soul and forgave the many little vanities to which was driven by his intellectual pride.",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "Best \"Period Piece\" ever filmed -- excellent acting, great story, fantastic mystery, realistic sets and setting, and Sean Connery at his absolute best.",
            "review_date": "2012-06-23",
            "source": "rt"
        },
        {
            "content": "Slow to start, but grows ever engrossing as the mystery unfolds.",
            "review_date": "2012-06-16",
            "source": "rt"
        },
        {
            "content": "While it would be better had it gotten rid of the vestigial organ of the narration from the novel (the title represents another element from the novel that does not make sense in the adaptation), this is a fairly intriguing mystery which explores the ridiculousness and danger arising from the suppression of knowledge and reason.  It also may contain one of Ron Perlman's best performances.\n\nThe editor provides a bit of humor by leaving in a very clear shot of a dead man blinking.",
            "review_date": "2012-06-14",
            "source": "rt"
        },
        {
            "content": "You don't have to pay close attention to find that \"The Name of the Rose\" has a lot of problems. It suffers from having unlikable characters, grotesque situations, narrative hiccups, an inevitable outcome and areas where the director loses focus. It's bathed in gloomy medieval atmosphere and has excellent set and costume design, but this often overpowers the action occurring onscreen. Sometimes the lighting is so dark and murky that it's hard to understand what's happening. Nevertheless, it's an admirable effort at capturing life at a monastery and the moral issues that plagued its monks. Though not executed properly, the concept is brilliant, and there are moments of sheer greatness scattered throughout. Sean Connery is solid in his role and manages to connect with the audience despite a lack of character depth. \"The Name of the Rose\" falls short in a lot of areas, but I actually found myself deeply immersed in it.",
            "review_date": "2012-06-07",
            "source": "rt"
        },
        {
            "content": "An interesting look into the life of a monk at the monastary.  I have read many things on the subject, and so all of this fit well.  I would love to be in that library!",
            "review_date": "2012-05-28",
            "source": "rt"
        },
        {
            "content": "INTERESANTE ,ENIGMATICA,CON TINTES PARAPSICOLOGICOS,EROTICOS Y DE SUSPENSO.SIR SEAN CONNERY,UN MONSTRUO SAGRADO,INDISCUTIBLEMENTE UN SENSACIONAL ACTOR; CHRISTIAN SLATER,MICHAEL LONSDALE,EN SU PAPEL.UNA GRAN PELICULA,CON TINTES EPICOS TAMBIEN.",
            "review_date": "2012-05-28",
            "source": "rt"
        },
        {
            "content": "William of Baskerville: \"My dear Adso, we must not allow ourselves to be influenced by irrational rumors of the Antichrist, hmm? Let us instead exercise our brains and try to solve this tantalizing conundrum.\"",
            "review_date": "2012-05-26",
            "source": "rt"
        },
        {
            "content": "awesome! a mix of my favorite genres.",
            "review_date": "2012-05-18",
            "source": "rt"
        },
        {
            "content": "Truly frightening music...",
            "review_date": "2012-05-18",
            "source": "rt"
        },
        {
            "content": "I chose the movie Â« The name of the Rose Â» by Jean-Jacques Annaud. It's my favourite film because it is beautiful, and logical, so I like. We can resolve the investigation before the end. The actors are natural.\nUnfortunately, the movie isn't like the book. The author Umberto Eco doesn't like the movie because he doesn't have this idea of the character Guillaume of Baskerville.\nThis movie seems gloomy, but It's the intention of the director, so that's a success. But too, one touch of specific humor to the monastery's character is added.\nSean Connery plays the character of Guillaume of Baskerville, and his assistant is played by Christian Slater, in the role of Adson Von Melk.\nIt's a thriller.",
            "review_date": "2012-05-16",
            "source": "rt"
        },
        {
            "content": "Quite dull and unsatisfactory, quite weird as well as disturbing but did enjoy the mystery of the killer which i did not get.",
            "review_date": "2012-05-12",
            "source": "rt"
        },
        {
            "content": "Very dark and unusual murder mystery.",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "A good taste of mystery and crimes in a well-made adaptation of Umberto Eco's novel.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "Sean Connery rebooting his career as a medieval Sherlock Holmes in monk's habit. Umberto Eco's celebrated book revived world wide interest for the middle ages. Thanks to excellent actors the movie captured well the spirit, concentrating the winding novel in a tense plot, but the final metaphor is lost.",
            "review_date": "2012-03-25",
            "source": "rt"
        },
        {
            "content": "The first half of the film is an interesting murder mystery, although there aren't a lot of twists and turns to keep the viewer guessing. The second half turns into your standard psychotic witchfinder film.  Filled with oddball characters, grim deaths and brooding scenery, it's a strange film but quite a good one.",
            "review_date": "2012-03-14",
            "source": "rt"
        },
        {
            "content": "Fray Guillermo de Baskerville (Sean Connery), monje franciscano y antiguo inquisidor, y su inseparable discÃ­pulo, el novicio Adso de Melk (Christian Slater), visitan una abadÃ­a benedictina, situada en el norte de Italia, para esclarecer la muerte del joven miniaturista Adelmo de Otranto. Pero tras los crÃ­menes se esconde algo mÃ¡s oscuro.",
            "review_date": "2012-03-11",
            "source": "rt"
        },
        {
            "content": "GREAT...\nthere are different views to Religion...\nbut not all them are true...!",
            "review_date": "2012-03-04",
            "source": "rt"
        },
        {
            "content": "A very good mystery movie. It's like a detective story that's on church grounds conducted by people of the church. It's very well made and looks great.",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "As wonderful as this film is, it is only better after attempting to slog though Umberto Eco's novel, of which it was adapted.\nBiased in my own appreciation of the era and premise, it still offers the random viewer appreciable performances by a string of well known and to be well known actors. Namely Christian Slater, as the young Adso and who tale this is, but most impressively, Ron Pearlman, of the current Sons of Anarchy fame, delivers an amazing performace as Salvatore, a halfwit, deformied monk and one of two clandestine members of a heretical cult. Sean Connery is also stellar and won the Best Actors award for this role.\nA keeper and the best reason to never read the book again.",
            "review_date": "2012-01-26",
            "source": "rt"
        },
        {
            "content": "I don't know what everybody thinks about this movie... I did not like it. Full stop.",
            "review_date": "2012-01-11",
            "source": "rt"
        },
        {
            "content": "Este filme precisa ser visto por todos. Uma obra prima.",
            "review_date": "2012-01-06",
            "source": "rt"
        },
        {
            "content": "A well-done film with solid characters and performances marred only by the hyper-realistic scenes of animal slaughter and needless gore",
            "review_date": "2011-12-30",
            "source": "rt"
        },
        {
            "content": "The mystery is completely inexplicable in the first place and the way its starts unraveling is not what an average viewer can expect but this movie has enough thrills and scares for its genre..and the ending is good..",
            "review_date": "2011-12-26",
            "source": "rt"
        },
        {
            "content": "I thougt the movie is better but it's acceptable. The story is average and the acting nice.",
            "review_date": "2011-12-18",
            "source": "rt"
        },
        {
            "content": "As wonderful as this film is, it is only better after attempting to slog though Umberto Eco's novel, of which it was adapted.\nBiased in my own appreciation of the era and premise, it still offers the random viewer appreciable performances by a string of well known and to be well known actors. Namely Christian Slater, as the young Adso and who tale this is, but most impressively, Ron Pearlman, of the current Sons of Anarchy fame, delivers an amazing performace as Salvatore, a halfwit, deformied monk and one of two clandestine members of a heretical cult. Sean Connery is also stellar and won the Best Actors award for this role.\nA keeper and the best reason to never read the book again.",
            "review_date": "2011-12-11",
            "source": "rt"
        },
        {
            "content": "I had only one problem with this film it's because it didn't give us a fair chance to solve the murder. You would either have to have an incredible brain or luck or just a great poke in the dark. Never the less 'The Name of the Rose' is clever, dark, atmospheric, tightly-directed movie i would recommend to everyone.",
            "review_date": "2011-12-11",
            "source": "rt"
        },
        {
            "content": "I would have liked a little more exploration into the conflict between the Franciscan order and the Church authority, but its still a fascinating mystery that features a great performance by Sean Connery.",
            "review_date": "2011-12-03",
            "source": "rt"
        },
        {
            "content": "ÐÐ 3/4 ÐºÐ 1/2Ð¸Ð³Ð° Ð 1/2Ð° Umberto Eco, Ð 3/4Ð²Ð° Ðµ ÑÐµÐ 1/4ÐµÐº Ð´ÐµÐ»Ð 3/4 Ð 3/4Ð´ ÑÐ¸Ð»Ð 1/4!",
            "review_date": "2011-12-01",
            "source": "rt"
        },
        {
            "content": "Saw this as a child and it left an impression. Made me understand that there was a past and I was lucky to not live through it. Anyway, this is a solid film, meandering but also intelligent and moving.",
            "review_date": "2011-11-29",
            "source": "rt"
        },
        {
            "content": "1.5: Extremely disappointing picture.  It sounds like it will be great based on the plot description, but it ends up lacking narrative force.  Despite the 14th century timeframe, old hilltop monastery setting, and murder mystery, it couldn't hold my attention.  The main reason to watch it is the scene with Valentina Vargas.  Very nice.",
            "review_date": "2011-11-17",
            "source": "rt"
        },
        {
            "content": "great mystery movie...",
            "review_date": "2011-11-16",
            "source": "rt"
        },
        {
            "content": "Murder mystery set in a 14th century Italian monastery which sees Sean Connery's Sherlock Holmes-like Franciscan monk and his young apprentice (a 15-year-old Christian Slater, who weirdly gets the \"and\" credit) attempt to solve a series of mysterious deaths. The promising story unfortunately peters out towards the end with little in the way of a satisfying conclusion but the film makes up for it with plenty of larger than life characters and bags of atmosphere. The abbey where the film takes place is nothing if not foreboding and director Jean-Jacques Annaud really captures the dark and dangerous era of the Middle Ages, where suspicion and fear was everywhere, the power of the church was absolute and one wrong move would lead to a swift burning at the stake.",
            "review_date": "2011-11-14",
            "source": "rt"
        },
        {
            "content": "Simply a classic ! Visual feast, always enjoyable.",
            "review_date": "2011-11-08",
            "source": "rt"
        },
        {
            "content": "Probably the most original thriller I've ever seen, there's nothing quite like it.",
            "review_date": "2011-11-07",
            "source": "rt"
        },
        {
            "content": "Had to watch to understand my course better.",
            "review_date": "2011-11-07",
            "source": "rt"
        },
        {
            "content": "A fairly faithful adaptation of the book and a film filled with excellent atmosphere and possibly the ugliest batch of people you are ever going to see on film.",
            "review_date": "2011-10-11",
            "source": "rt"
        },
        {
            "content": "The atmosphere is about right, the end was changed for who knows what reasons but the final product is nice.",
            "review_date": "2011-10-02",
            "source": "rt"
        },
        {
            "content": "A labyrinthine mystery with plenty of suspense and atmosphere, but is riddled with uninteresting characters and a surprisingly boring climax.",
            "review_date": "2011-09-25",
            "source": "rt"
        },
        {
            "content": "I'd seen this many years ago but decided to buy the DVD and re-watched it and thoroughly enjoyed it all over again. Connery is immense as William of Baskerville, a monk trying to solve a series of mysterious deaths at an abbey. The film has a number of twists and turns until reaching a satisfying ending. Well worth a watch even if it does feel a little dated now.",
            "review_date": "2011-09-17",
            "source": "rt"
        },
        {
            "content": "Realistic depiction of life in the Inquisition period. Showing the Catholic church's problems with it's holy men ,on their celibacy, homosexuality, and their lack of openness to new ideas  Nice Sherlock style  story with a little love story .. Very good acting on Connery, Slater, Perlman and the rest of the cast.. Certainly will watch again ....",
            "review_date": "2011-08-30",
            "source": "rt"
        },
        {
            "content": "Doesn't stand a chanche if compared to the book (which is a masterpiece), but it's still good.",
            "review_date": "2011-08-23",
            "source": "rt"
        },
        {
            "content": "Eu esperava um pouco mais de contexto histórico e menos Sherlock Holmes, mas até que não é um filme ruim.",
            "review_date": "2011-08-17",
            "source": "rt"
        },
        {
            "content": "Oh gosh, I didn't read the book. But this movie obviously sucks hardly. The performances suck, maybe just Sean Connery's interpretation is better. I like detective movies,but not this one. It didn't surprise me in the end... \n   I didn't recognize a young Christian Slater, he's cute, but that doesn't save him...",
            "review_date": "2011-08-04",
            "source": "rt"
        },
        {
            "content": "Surement mon film prefere de Jean-Jacques Annaud. Tres bon thriller medieval avec l'excellent Sean Connery. Toujours aussi bon a voir.",
            "review_date": "2011-08-01",
            "source": "rt"
        },
        {
            "content": "A bleak movie.  Well acted, well shot, and of a higher quality than I would expect from a medieval period piece, made in the 80s.  \n\nAn unnecessary sex scene that would have been more at home in a corny fantasy movie, made in that era (featuring a prostitute lacking armpit hair), and a third act that is nowhere near as strong as the rest of the movie takes a huge chunk out of my score.  \n\nEvocative imagery plays on the grotesque and the frightening to emphasize the ignorance and squalor of the setting.\n\nThe ending was the most disappointing part of the movie for me.  The theme of humor is introduced without hardly any build up which takes away from the cerebral element that the audience of a movie like this would enjoy.  Again, the sex scene also runs against what the audience for this kind of movie would want, it was very gratuitous and Uwe Bolish and made me wonder if I was watching Blood Rayne, and not a decent medieval mystery tale.\n\nI would recommend this movie for adults who like slightly freaky films that are slow paced and thoughtful or if you are a Sean Connery fan.",
            "review_date": "2011-07-31",
            "source": "rt"
        },
        {
            "content": "The atmosphere of this movie was really cool, but there was just too much that they tried to fit into the movie.",
            "review_date": "2011-07-30",
            "source": "rt"
        },
        {
            "content": "Well acted and menacing, Annaud's murder-mystery set in the moody nooks and crannies of a 14h century Abbey, is atmospheric and gruesome and might boast an excellent cast (Lonsdale, F. Murray Abraham, Slater and Conbery,) but none of this can hide what is essentially an incredibly formulaic and predictable plot. Enjoyable nonsense though.",
            "review_date": "2011-07-30",
            "source": "rt"
        },
        {
            "content": "Hmm, a bit too dark and not really my genre. Despite Connery just two stars.",
            "review_date": "2011-07-26",
            "source": "rt"
        },
        {
            "content": "After years, it was time to revisit Jean-Jacques Annaud's adaptation of Umberto Eco's bestseller.\n\nI kinda like Eco. Not that I love his books or his scientific publications, but I think he'd be a cool guy to have a beer with and discuss literature, art or philosophy.\n\nAnyways, I didn't have the best memories of The Name of the Rose but thought the time was right to give it another try. And while it actually really grew on me, it's still not much more than a decent flick.\nThe premise sounds great: A crime flick set in a medieval monastery and a monk (played by Sean Connery) as investigator. Throw in an awesome cast and some serious gore and you got your film.\n\nThe basic plot and idea of the film is great indeed, I only had one big issue: The film, again and again, becomes gimmicky throughout the movie. The straightforward plot and the well-written characters thus suffer from sensationalism. The film is shot in a pretty naturalistic manner, and most of the time the characters behave quite logical but then, out of nowhere, they added elements no one asked for, that maybe worked well in the novel but feel kinda rushed and unnecessary in the film (e.g. the peasant girl or the other Franciscan friars who arrive).\n\nI appreciated the mysteries of the library or the fancy way the murders were executed but I think Annaud tried to squeeze in too much of the book's content.\n\nMy props to Sean Connery who plays William of Baskerville (an homage to Sherlock Holmes) pitch-perfect, as well as to Eco's script which gives us one of the better crime mysteries and settings that I've seen so far.",
            "review_date": "2011-07-18",
            "source": "rt"
        },
        {
            "content": "Directed by Jean-Jacques Annaud, based on the book of the same name by Umberto Eco. Sean Connery is the Franciscan friar William of Baskerville and Christian Slater is his apprentice Adso of Melk, who are called upon to solve a deadly mystery in a medieval abbey.Very dark and unpleasant movie.Some bizarre characters and waste performance of F.Murray Abraham in a poor adaptation.",
            "review_date": "2011-07-15",
            "source": "rt"
        },
        {
            "content": "Além de ser um épico clássico, é um excelente suspense, de altíssima qualidade.",
            "review_date": "2011-06-29",
            "source": "rt"
        },
        {
            "content": "Se eu tivesse que salvar apenas cinco filmes de um apocalipse cultural, este aqui estaria entre os cinco, com cerveja.",
            "review_date": "2011-06-21",
            "source": "rt"
        },
        {
            "content": "Decent religious thriller following charismatic monk (Connery - brilliant!) and his apprentice (Slater - terrible!) as they happen upon a mysterious abbey where a string of suspicious deaths lead to a dramatic investigation. There's enough intrigue to hold your attention, though it fizzles out slightly toward the end and never fully reaches its absolute potential. Connery, in a BAFTA winning turn, holds the movie together and provides the number one reason to hunt this one down.",
            "review_date": "2011-06-08",
            "source": "rt"
        },
        {
            "content": "Todas las películas que hablan en contra de una religión o sacan a relucir detalles que por la mayoría no son vistos crean mucha controversia, eso paso desde que el libro en el que basaron esta película salio a la venta y claro la película no se quedo atrás, a mi en lo particular me agrado aunque la primera vez que la vi fue para un trabajo escolar.",
            "review_date": "2011-06-06",
            "source": "rt"
        },
        {
            "content": "This is Connery at his best, mysterious and wise. TNOTR is a fairly classic mystery taking place in the unique setting of an abbey, surrounded by monastics and scholastics. The intrachurch disputes of the era (14th century) provide a backdrop rich in intrigue and political drama.",
            "review_date": "2011-05-30",
            "source": "rt"
        },
        {
            "content": "A very good thriller.Haven't gotten around to reading the book yet but will probably read it soon.",
            "review_date": "2011-05-30",
            "source": "rt"
        },
        {
            "content": "They don't make them like the used to. Saw this movie on the flight back from Munich and probably because it was directed by a fellow German (the airline was Lufthansa).",
            "review_date": "2011-05-30",
            "source": "rt"
        },
        {
            "content": "\"A Story of Unholy Murder\" in a Monastery, no less.\nA Murder Mystery in the 14th century to be solved by a Investigator/Franciscan Monk, William of Baskerville, played by Sean Connery at his most intense.A very young Christian Slater plays his impressionable apprentice Monk,Adson von Melk.Amazing & memorable performance by Ron Perlman as Salvatore the Hunchbacked Monk wrongly accused & convicted by means of a torture acquired confession.Some of these Monks are really rather Creepy, & there are Homosexual undertones that I'm sure upset the Catholic Church when this Dark Murder Mystery made it's Debut in 1986.Christian Slater has some Inappropriate Monk sex with \"The Girl\", who comes out of no where, & in his inexperience, thinks he loves her.There is a Cruel Inquisitor(F.Murray Abraham), that seems to enjoy jumping to bizarre conclusions of Witchcraft, & administering Sadistic Methods to acquire confessions. All of which is what makes this Movie so Edge of your Seat!!!! Performances by the entire cast are exceptional, & Academy Award Worthy, &  drive this Story of Murder & Secrets.I don't remember hearing anything about a Catholic Boycot of this Film, but I gotta say, this Catholic School Girl enjoyed it more WITH the Catholic Guilt.",
            "review_date": "2011-05-29",
            "source": "rt"
        },
        {
            "content": "A movie that had a lot going for it as a detective story in an atypical setting gives way to a black-and-white story of good vs. evil and a contemporary urge to right the wrongs of the Inquisition.  Sean Connery has never been more charming nor more amiable as he is here.  He does a nice job as the avuncular monk who dares to think outside the Book.  The monastery and its inhabitants deliberately avoid the pleasantly placid view of diligence and harmony with the earth.  The monks in fact go beyond realism and most of them are grotesque in a Gothic sort of way.  The premise is exciting and novel, as is the twist at the end, but F. Murray Abraham's character exists for...uh, dramatic tension I guess.  He wasn't really needed and his comeuppance was predictable and bland.  He did have a couple of juicy exchanges with Connery's sleuthing ascetic, but he and the whole Inquisition needn't have bothered showing up at all.  This interruption in at the film's halfway point upsets its pacing and it takes awhile to relocate its groove.  It's enjoyable and entertaining, with enough different twists to distinguish it from other mystery films.",
            "review_date": "2011-05-29",
            "source": "rt"
        },
        {
            "content": "\"The Name of the Rose\" is an interesting murder-mystery set in a 14th century monestary.  Although the character William of Baskerville is certainly not Hercule Poirot, Connery plays the role with dialectic expertise.  This story is very interesting but much of the acting left something to be desired.  This very young Christian Slater was pretty stale and didn't offer much emotion, while I couldn't stop thinking \"Salieri\" everytime F Murray Abraham was on screen.  The height of my distaste occured during an unnecessarily pornographic sex scene.  The point could have easily been made without such a graphic sexual portrayal and, though this film may have been staying true to the book, it was just too much to stomach.  I recommend this film for it's story and a twist that you will never see coming (there's a hint in there) but please skip past the sex scene or you'll be left with a sour sensation as well.",
            "review_date": "2011-05-24",
            "source": "rt"
        },
        {
            "content": "The Name of the Rose is an exiting film. It is about an intellectually nonconformist monk who investigates a series of mysterious deaths in an isolated abbey. This film has a mix of a Sherlock Holmes-type crime thriller and religious criticism/commentary. Sean Connery and Christian Slater give amazing performances. The screenplay is well written and suspenseful. Jean-Jacques Annaud did a great job directing this movie. I enjoyed this motion picture because of the drama and mystery. The Name of the Rose is a must see.",
            "review_date": "2011-05-23",
            "source": "rt"
        },
        {
            "content": "A convoluted screenplay detaches the viewer from an otherwise solid story.",
            "review_date": "2011-05-14",
            "source": "rt"
        },
        {
            "content": "i like the mystery and suspense in this movie.  It really keeps you on the edge of your seat.  Its a little bit like Sherlock Holmes meets Jesus.  The whole religious thing, not buying it.",
            "review_date": "2011-05-09",
            "source": "rt"
        },
        {
            "content": "Young Christian Slater sexytime.",
            "review_date": "2011-05-08",
            "source": "rt"
        },
        {
            "content": "I'm not entirely sure how to feel about this movie.  I started the book once, when I was very young (14?), but put it down as being over my head.  Having a little free time, the wife and I caught this on Netflix over the weekend.  Basically, a timeless Connery and a very young looking Slater are 14th century Franciscan \"detectives\" (Connery even says - \"Elementary\" at one point in a clear nod to Sherlock and Watson) investigating a strange state of affairs at a monastery.  Granted, every monk there seems to be straight out of the freakshow, with Ron Pearlman - one of my favorite actors - as a twisted hunchback.  I kind-of lost the story at various points, not being well versed in the ways of ancient monk lore, but it did echo and likely inspired modern pop stories like Angels and Demons and the DaVinci Code.  I suppose worth seeing if you've got the time and a few grains of salt :-)",
            "review_date": "2011-05-02",
            "source": "rt"
        },
        {
            "content": "Perfect movie for a night time cup! Classic!!",
            "review_date": "2011-05-02",
            "source": "rt"
        },
        {
            "content": "Very good acting and a whole lot of monks in this grim and dark murder mystery.",
            "review_date": "2011-04-28",
            "source": "rt"
        },
        {
            "content": "One of my favorites, although nowhere near as good as the book.",
            "review_date": "2011-04-20",
            "source": "rt"
        },
        {
            "content": "Sean Connery stars as a Monk who has a great gift and is able to see and analyze many things and is able to solve crimes much in the same style of another famous literary hero, Sherlock Holmes.\n\nThe film also boasts a young and impressive cast including Christian Slater and Ron Perlman.\n\nThis a great murder-mystery set in a very strange and interesting world. The film is very intense ans very good, one of the better ones from this genre I have seen.",
            "review_date": "2011-04-09",
            "source": "rt"
        },
        {
            "content": "Awesome scenery, i would love to spend some time in a monastery like this. Otherwise a decent story, but not as good as the book.",
            "review_date": "2011-04-08",
            "source": "rt"
        },
        {
            "content": "INTERESANTE ,ENIGMATICA,CON TINTES PARAPSICOLOGICOS,EROTICOS Y DE SUSPENSO.SIR SEAN CONNERY,UN MONSTRUO SAGRADO,INDISCUTIBLEMENTE UN SENSACIONAL ACTOR; CHRISTIAN SLATER,MICHAEL LONSDALE,EN SU PAPEL.UNA GRAN PELICULA,CON TINTES EPICOS TAMBIEN.",
            "review_date": "2011-03-30",
            "source": "rt"
        },
        {
            "content": "the original name of this movie: il nome della rosa",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "A film the people liked more than the critics. In fact this got panned when it was released in the US. Nicely realised, I thought, and true-ish to the book in that it simply dropped 90% of the heavy-going theology lessons, leaving only the core detective story. \n\nThe use of so many odd faces in the cast I found a little distracting and felt it detracted a bit from Ron Perlman's stand-out performance as Salvatore, his being the only character who is meant to appear physically odd. Connery is a cool Franciscan and brings the gravity and charm to a very grim setting while Slater just seems to stick with playing wide-eyed wonder throughtout, but then he was only 15.",
            "review_date": "2011-03-25",
            "source": "rt"
        },
        {
            "content": "It had all the constituents for a compelling medieval murder mystery: a stunning setting in the Italian Alps and an awesome castle (monastry?) to boot, a cast full of unforgetable creepy faces (Ron Perlman, Elya Baskin), a complex story adapted from Umberto Eco and Sean Connery as a pragmatic, upbeat monk! Alas, there was an ineptitude simmering throughout the film, whether it was that the director over-crammed the story with pointless and ridiculous subplots or that he completely misinterpreted Eco's novel. Granted the atmosphere and setting is impressive and you are drawn in by the mystery that lurks beneath the hoods of these bizarre monks but after a while you're just saying: 'For the sake of Saint Francis, wrap it up!!!'. And on top of that, you have that whiny little adolescent prick, Christian Slater popping his head into every scene.",
            "review_date": "2011-03-16",
            "source": "rt"
        },
        {
            "content": "Worth a watch if you like period mysteries, but I felt like it was less than the sum of its parts. One would think a still vibrant Connery, mixed with murderous monks, a gibberish speaking hunchback, secret passages, forbidden sacred texts, and a guy drowning in a vat of pigs blood would make for a hell of a movie...but it just doesn't quite come together. It's worth seeing just for the ugly character actors though...each uglier than the last. And F Murray Abraham's character has one of the great villainous names in all of literature...Bernardo Gui.",
            "review_date": "2011-02-21",
            "source": "rt"
        },
        {
            "content": "Una pelÃ­cula que representa bastante bien los horrores medievales: la religiÃ³n que mandaba tanto dentro como fuera de los templos, las construcciones frÃ­as y oscuras, la lÃ³gica perseguida por las supersticiones...\n\nY por encima de todo, un buen elenco de actores. Algunos representan personajes histÃ³ricos, aunque otros no. En mi opiniÃ³n destaca Christian Slater, muy lejos de lo que serÃ­a un gran actor, pero que consigue transmitir esa delicadeza, esa curiosidad e inocencia de la juventud medieval. Otro con una actuaciÃ³n y un papel sobresaliente es Rol Perlman, que se mete en la piel de un monje italiano jorobado con tendencias raras.\n\nLa pelÃ­cula fascina por estas dos cosas, aunque la historia es demasiado obvia para mi gusto y William of Baskerville acaba descubriendo las cosas mÃ¡s por el puro azar que por la lÃ³gica y observaciÃ³n (Teniente Colombo parte 2).\n\nSangrienta y trÃ (C)mula, una buena pelÃ­cula que visionar en soledad.",
            "review_date": "2011-02-21",
            "source": "rt"
        },
        {
            "content": "Mysterious and intriguing.",
            "review_date": "2011-02-12",
            "source": "rt"
        },
        {
            "content": "Loved it! Fantastic film. Any medieval mystery fans or crime fans will probably find it a good watch! Original, with a great twist.",
            "review_date": "2011-02-09",
            "source": "rt"
        },
        {
            "content": "The opening credits refer to this film as a \"palimpsest\" of Eco's novel. Having never read the novel, I cannot be certain, but I get the distinct feeling that there are deeper themes in the book that are not explored in the film. As a film, though, this is excellent stuff. Filled with metaphor and symbolism, the conflict between superstition and reason becomes an almost tangible thing. Performances are wonderful (Ron Perlman especially) and the fine attention to visual detail give this film the perfect atmosphere.",
            "review_date": "2011-02-08",
            "source": "rt"
        },
        {
            "content": "You will never find a larger grouping of really old, ugly monks. Sean Connery solves a mystery in a monastery while Christian Slater gets laid.",
            "review_date": "2011-02-02",
            "source": "rt"
        },
        {
            "content": "Saw this when I was 17.",
            "review_date": "2011-01-12",
            "source": "rt"
        },
        {
            "content": "Tylko za t? jedn? scen? xD.",
            "review_date": "2011-01-12",
            "source": "rt"
        },
        {
            "content": "Great medieval murder mystery.",
            "review_date": "2011-01-11",
            "source": "rt"
        },
        {
            "content": "Sir Sean Connery lends his gravity to this shockingly disturbing Medieval Age movie.",
            "review_date": "2011-01-10",
            "source": "rt"
        },
        {
            "content": "Great thriller in a wonderful medieval setting and with religous theme. Fantastic.",
            "review_date": "2011-01-08",
            "source": "rt"
        },
        {
            "content": "Not much to say, except that is a great movie. A dark, creepy story that revolves around a remote abbey, his monks and the mistery they're trying to hide..always worth watching",
            "review_date": "2011-01-07",
            "source": "rt"
        },
        {
            "content": "A must see. The book is wonderful!",
            "review_date": "2011-01-05",
            "source": "rt"
        },
        {
            "content": "Solid murder mystery in a medieval abbey. But watch out for those peasant girls.",
            "review_date": "2011-01-03",
            "source": "rt"
        },
        {
            "content": "Iï¿ 1/2(TM)m proud to say I prefer the film over the book. The book shrouds the simple mystery in a nearly inpenetrable cloud of unnecessary sidenotes and religious banter. While Annaud does a wonderful job peeling all that excess weight off, Sean Connery fills Williamï¿ 1/2(TM)s shoes like it was him all along. Unfortunately the lack of distractions reveals the story alone doesnï¿ 1/2(TM)t deserve the excessive hype.",
            "review_date": "2011-01-02",
            "source": "rt"
        },
        {
            "content": "A seriously underrated movie. Mesmerizing atmosphere, great performances by Connery and Slater, and a very interesting story that offers both a good mystery plot and a brooding religious backdrop. There is much darkness in this world, a lot of unanswered questions, both earthly and spiritual, but there is also a quiet meditative beauty about it. The movie is delivered by these transcendent moments where the characters step back to absorb something deeper and greater than themselves and all the happenings, which also creates another level of connection with the audience.\r\n\r\nThis movie is the equivalent of drinking hot calming tea next to a fire as a blizzard rages outside.",
            "review_date": "2010-12-30",
            "source": "rt"
        },
        {
            "content": "Superbly-creepy  and grim whodunnit with horror under-pinnings set in an enormous 14th century Italian haunted-house-esque Abbey poulated by a menagerie of monstrously-maniacal monks, each uglier than the last. Sean Connery is at his most enjoyably- hammy as Franciscan friar/armchair super-sleuth William of Baskerville, called in to solve the various murders by the chunky Abbot (Michael Lonsdale). Along for the ride is Christian Slater in an early performance (And thankfully before he started needlessly channelling Jack Nicholson-) as naive novice monk Adso of Melk--kind of the Dr. Watson to Connery's medieval Sherlock Holmes. Very talky, at times overlong, with meandering plot-twists and red-herrings aplenty, but well worth the experience, as the acting is uniformly marvelous, and the hideous characters will make you feel you're attending an old-fashioned carnival freak-show. The fiendishly-funky friars are essayed by an impressive and offbeat international cast, with Elya Baskin (As the goofy apothecary Severinus-), Feodor Chaliapin, Jr. (Essaying ancient, blind, and wraith-like Jorge de Burgos-), Michael Habeck (As the enormously-rotund and effeminate Brother Berengar-),  raspy William Hickey (As withered mummy-like Ubertino de Casale ), Helmut Qualtinger (As corpulent-and-horny glutton Remigio De Varagine-), and vulture-like Volker Prechtel (As secretive & sociopathic librarian Brother Malachia-) rounding out the gallery of gloriously-grotesque gargoyles. Also of note are Valentina Vargas as an unrealistically beautiful & super-model-like peasant girl who becomes embroiled in the unpleasant-and-unseemly goings-on, F. Murray Abraham as bloodthirsty Inquisitor Bernardo Gui, and Ron Perlman as the brutish and demented hunchback Salvatore. A supremely different and intriguing murder mystery, not easily forgotten.",
            "review_date": "2010-12-18",
            "source": "rt"
        },
        {
            "content": "Boring, boring and not least boring!",
            "review_date": "2010-10-27",
            "source": "rt"
        },
        {
            "content": "Each character well symbolizes his own kind and that's the beauty of the film.",
            "review_date": "2010-10-15",
            "source": "rt"
        },
        {
            "content": "Wonderful movie where the suspense is attached to the end. Sean Connery is stunning, excellent interpretation.",
            "review_date": "2010-10-10",
            "source": "rt"
        },
        {
            "content": "akhirnya ngumpul juga semangat buat nonton ini. adaptasi dari novel Umberto Eco, seorang filosofi, kritikus sastra, dan novelist asal Italy. an older generation of Dan Brown CMIIW. tema-nya sama dengan novel Dan Brown yg Angels & Demons n The Da Vinci Code, garis besar-nya tentang ketakutanÂ² gereja akan buktiÂ² sejarah di masa lalu yang dibungkus dalam misteri pembunuhan di dalam sebuah biara dari ordo Fransiskan. banyak dialog yang menggunakan bahasa Inggris baku dengan kiasanÂ² yg kadang bikin mabok. ending dari film ini agak kurang masuk akal di nalar, tapi kalo dari setting-nya yg di abad ke 14, miungkin masih bisa masuk akal.",
            "review_date": "2010-10-03",
            "source": "rt"
        },
        {
            "content": "Umberto Eco's book is real masterpiece. Movie is 'just' great.",
            "review_date": "2010-10-03",
            "source": "rt"
        },
        {
            "content": "pengeeennn liaat,.. :'(",
            "review_date": "2010-09-17",
            "source": "rt"
        },
        {
            "content": "Un pur moment de bonheur! Un casting de Â«gueulesÂ» :-) Et le voir en HD fait toute la diffÃ©rence!",
            "review_date": "2010-09-12",
            "source": "rt"
        },
        {
            "content": "A great thriller, very unique, and the cast is really good, I highly recommend this movie",
            "review_date": "2010-09-06",
            "source": "rt"
        },
        {
            "content": "A voir et Ã  revoir. Un pied de nez d'Aristote Ã  24 siÃ¨cles d'intervalle !",
            "review_date": "2010-08-26",
            "source": "rt"
        },
        {
            "content": "Meh. Pretty much a boring murder-mystery in the style of Sherlock Holmes, but without as sharply written characters. Somewhat interesting to see familiar actors in really out of place roles, but there's really not much of interest going on and the reason for the murders seems more than a little absurd to me. But, then again, I'm not a 14th century monk.",
            "review_date": "2010-08-18",
            "source": "rt"
        },
        {
            "content": "The book is better but I still love this movie.  It is so realistic, unlike some medieval films that just look far too clean.  The monks are ugly, the conditions are abysmal.  You feel like this is the 14th century.  I also love Sean Connery so much in this film you have no idea.",
            "review_date": "2010-08-18",
            "source": "rt"
        },
        {
            "content": "Pueden encontrar un pequeÃ±o estudio y claves sobre \"El nombre de la Rosa\" en:http://www.lacavernadeplaton.com/actividadesbis/rosa0910.htm",
            "review_date": "2010-08-11",
            "source": "rt"
        },
        {
            "content": "A great movie.  A medieval detective story.  Which was especially fun for me, because that was my favorite era of history.  And the protagonist is just about as much of a bibliophile as I am.  I too would probably stay in a burning library rather than abandon the books.",
            "review_date": "2010-07-22",
            "source": "rt"
        },
        {
            "content": "Ugh. Not even Sean Connery could save it.",
            "review_date": "2010-07-21",
            "source": "rt"
        },
        {
            "content": "Magnifica, una pelÃ­cula que de lleno critica ciertas posturas que tiene la iglesia catÃ³lica.",
            "review_date": "2010-07-14",
            "source": "rt"
        },
        {
            "content": "O filme nÃ£o enreda o espectador da mesma forma que o livro faz com o leitor, definitivamente. Mas a histÃ³ria de mistÃ©rio e crime de teor religioso Ã© de tirar o fÃ´lego de qualquer maneira. \r\nE Sean Connery Ã©, sempre, motivo suficiente para ver um filme.",
            "review_date": "2010-07-14",
            "source": "rt"
        },
        {
            "content": "good story...a bit boring at times...",
            "review_date": "2010-07-13",
            "source": "rt"
        },
        {
            "content": "For someone like me who so took such delight in the intricacy of the novel, no movie could ever really do justice to Ecco's masterpiece. None the less, Annaud's adaptation does an admirable job of conveying the opprobrium of a medieval monastery.  For me the most unfortunate thing is that all of William of Baskerville's masterful deductions from the book were supplanted with rather bland and prosaic ones. Still, the wonderful authenticity of the sets and some amazing acting, especially Ron Perelman as the hunchback Salvatore, make this worth watching. Do read the book though!",
            "review_date": "2010-06-09",
            "source": "rt"
        },
        {
            "content": "From what i'm reading it sounds like this movie is best enjoyed after reading the original book The Name of The Rose. I have not read the book, but the movie was decent. Clearly the best part of the movie is the relationship between Sean Connery and a young Christian Slater. At some points I thought the visuals were good, but for the most part the imaging was dull and very plain. The dialogue was at its best when Connery was speaking, but when he wasn't I just felt a void of plot and emotion. This movie is worth giving a shot because at some points I was totally enthralled it just didn't have that level of intensity throughout the entire film. The last line in the movie made this movie worth watching.",
            "review_date": "2010-05-26",
            "source": "rt"
        },
        {
            "content": "(1986 Director: Jean-Jacques Annaud) Hmm....Medeival, Sherlock Holmes-esque Franciscan monk (Sean Connery) William of Baskerville....Adaptation of Umberto Eco's best-selling novel.which a friends says is far FAR superior to the movie. Great cast.  Although the movie is long, I enjoyed the acting and the setting...",
            "review_date": "2010-05-19",
            "source": "rt"
        },
        {
            "content": "Sean Connery's character, Franciscan friar William of Baskerville, should be alludes to the fictional sleuth Sherlock Holmes. He lends dignity, intelligence as the acute and prudent monk who has knowledge, both of the human spirit and the wiles of the evil one.\nThe film is very realistic in every way - the cold, uncomfortable monastery; the graphic murders; grotesque and disfigured characters; a startlingly explicit sex scene; authentic-sounding dialogue; excellent indoor and outdoor locations; and well-researched costume designs. \n\nBased on the novel by Italian author Umberto Eco in 1980, but it appeared in 1983, in an English translation.",
            "review_date": "2010-05-17",
            "source": "rt"
        },
        {
            "content": "Jean-Jacques Annaud's provocative, fascinating medieval murder mystery which is brilliantly adapted from the late great Umberto Eco's best-selling novel. Sir Sean Connery delivers a masterful performance as the wily Brother William of Baskerville, a Franciscan noncomformist Monk of great intellect and dignity, Connery lends his commanding presence and his great voice to this compelling role which is one of the finest performances of his legendary career, he along with his novice Adso, played by young Christian Slater in a impressive performance, arrive at the secluded mountain top 14th century Benedictine Abbey for a religious conference, but soon after a series of mysterious murders begin, where all the victims have blackened fingers and blackened tongues, many of the monks fear it is the work of the devil or the coming of the apocalypse. Aldo is approaching his sexual and intellectual awakening, he is the narrator of the film who expresses bafflement at the deadly mystery at the ancient Abbey, and is at awe of Brother William's deductive powers. Brother William who has a great penchant for sleuthing is asked to investigate these strange killings, but nothing is what it seems to be. Astute direction by Jecques Annud who does an amazing job of transporting us back to a primitive dark time in the world, where fear and primal emotions rule. This moody epic thriller was actual filmed at a 12th century monastery. There are tremendous supporting performances by F. Murray Abraham, Feodor Chaliapin Jr., the late William Hickey, Michael Lonsdale, Ron Perlman, and the beautiful Valentina Vargas, who has a very memorable sexual seduction scene with Christain Slater that is very hot indeed. Magnificent cinematography by Tonino Delli Colli and a haunting score by the late great James Horner. An atmospheric and engrossing motion picture. Highly Recommended",
            "review_date": "2010-05-16",
            "source": "rt"
        },
        {
            "content": "En DVD.\r\nLa factura de este filme y el dinamismo con que esta realizada es de una calidad y cualidad destacables. Su casting es tremendo con unos perfiles sacados directamente de la Edad Media, lo que logra sumergirnos en la atmosfera de la epoca con tintes contemporaneos y una trama digna de un Sherlock Holmes, que estremece e inquieta, como una pesadilla ambigua y recalcitrante.\r\nPienso que en su momento fue muy original, el argumento, la historia, y que aun hoy goza de buena salud dado que miramos con cierta melancolia como los libros pudieron llegarse a considerar hasta peligrosos, armas poderosas para iluminar o manipular.",
            "review_date": "2010-05-11",
            "source": "rt"
        },
        {
            "content": "Adapted from the novel by the same name by Umberto Eco,this movie is a superb medieval murder mystery. It takes place in a Benedictine abbey in the north of Italy,who is to host a council . The issue of the meeting is the Franciscan order's belief, that the church should rid itself of all wealth. \r\n\r\nA young monk then mysteriously dies under suspicious circumstances. Brother William of Baskerville(Sean Connery),a respected Franciscan monk, is called in to investigate,assisted by Adso(Cristian Slater) a young novice. Some call the death an act of God,but the free-thinking Brother William believes otherwise.As a series of new murders follow,William finds clues which points in an unexpected direction.At this time the inquisition,under the leadership of the arrogant Bernardo Gui (F.Murray Abraham),takes over the investigation.Brother William and Adso must now hurry to find a solution,to stop the string of murders,and to defend the innocent people accused by the Inquisition.\r\n\r\nThe sets are impressive and convincing,courtesy of Dante Feretti.The movie is beautifully shot by Tonino Delli Colli. Together with a tight script,great direction by Jean Jacques Annaud, and some top-notch acting,especially from Connery and Abraham,this makes for a consummate movie experience.",
            "review_date": "2010-04-20",
            "source": "rt"
        },
        {
            "content": "It surely does owe most of its virtues to its great literary predecessor, but that is not a flaw. Jean-Jacques Annaud made one of the greatest films ever.",
            "review_date": "2010-04-17",
            "source": "rt"
        },
        {
            "content": "Dark but powerful. Great story.",
            "review_date": "2010-03-30",
            "source": "rt"
        },
        {
            "content": "Interesante historia enmarcada en el contexto de la época medieval",
            "review_date": "2010-03-25",
            "source": "rt"
        },
        {
            "content": "Long before \"The DaVinci Code\", even long before \"SE7EN\", there's a movie that became my measurement on how a great religious themed investigative thriller should be made. \"The Name of the Rose\" is the movie.\r\n\r\nThe story, based on the book with the same title by Umberto Eco, is about murder mystery in a monastery in Italy. There are so many themes that developed well during the movie, I love especially the theme of power's corruptions. I don't remember if this movie or the book made such a worldwide hype like \"The DaVinci Code\", but one thing I know for sure. This is how I measure how good an adapted screenplay from a book that I had not read. If the movie makes me want to read the book to understand the story deeper, then the adapted screenplay (thus the movie) is GREAT.",
            "review_date": "2010-02-28",
            "source": "rt"
        },
        {
            "content": "I saw this movie once when I was a kid 8 or 10 years old. Me and my classmate go to the cinema instead of school and I still remember this movie as great one",
            "review_date": "2010-02-28",
            "source": "rt"
        },
        {
            "content": "Great movie, seen it I don't know how many years ago and it's still one of my favorite's.",
            "review_date": "2010-02-28",
            "source": "rt"
        },
        {
            "content": "Classic masterpiece!",
            "review_date": "2010-02-21",
            "source": "rt"
        },
        {
            "content": "A good mystery thriller, casting Holmes and Watson as 14th century monks. Along the way it explores adolescent desire, love of literature, religious persecution and questions of integrity. It's not very complex, I suspect the book runs quite a bit deeper. The direction is competent if not especially stunning, Connery is typically charismatic, and Slater hasn't yet become annoying. The big reveal is a little on the unsatisfying side, but the trip getting there is worthwhile.",
            "review_date": "2010-02-19",
            "source": "rt"
        },
        {
            "content": "A good attempt at distilling Eco's dense historical murder mystery into an entertaining film. It captures the squalor of medeival life, and the potential for corruption and sin within the church. Connery makes a good detective, even if his deductions come a bit too quickly and conveniently and a young Slater has a grubby soft-core scene, while the rest of the cast are almost all rather ugly! Anyone familiar with the book might be disappointed in the elements missing - the sense of forbidden fear and mystery of the library, the erotic awakening and confusion of young Adso and the gradual discovery and exploration of the labyrinth, as well as the dense historical and theological detail, but then that is to be expected in a film adaptation.",
            "review_date": "2010-02-17",
            "source": "rt"
        },
        {
            "content": "A classic movie, brillant story about murder in an abbey, great ConneryÂ´s  performance as William of Barskeville. His own investigations reveals a dirty conception of the religion, and why Europe lived in that darkness.",
            "review_date": "2010-02-15",
            "source": "rt"
        },
        {
            "content": "I watched the movie again recently after buying it on DVD.  I never read the book, but read some of Umberto's other writings.  The things that strike out to me about this movie is the balance it tries to strike in the soul of William the Franciscan Monk between the logic and learning he holds dear and the faith and religion he sees as abandoning both logic and learning.  His love of the books and his banter with Burgos the blind Monk, the missing text, and the poison pages.  The jabs at established religion is here, but it is not wholly cynical or hateful.  It questions like William about both faith and practice.  An interesting and captivating movie with great acting that has held up through the years.  Finally, I just cracked up at Williams bibliophile and his desperate chance to save some of the remaining books.  Coming out of the burning building fool of soot and bundles of books in his hands is comical and understandable from another bibliophile.",
            "review_date": "2010-02-11",
            "source": "rt"
        },
        {
            "content": "This a visually very impressive film, if one likes dark scapes and shadows, but sadly none of the themes I would assume the original The Name of the Rose to have had come out in an interesing way. It is too slow and relaxed for a murder mystery, the highlighted topic of love is, after all, of secondary interest and the philosophical level is barely touched.\n\nI am disappointed, but at least it was about the Middle Ages...",
            "review_date": "2010-02-04",
            "source": "rt"
        },
        {
            "content": "The book is magnificent, but incredibly dense on intertextuality.  The film is much more accessible and enjoyable on a different but complementary level.  The casting (and makeup)  is magnificent, with thoroughly ugly chracters emphasising the unrest that lurks within the strange abbey.  Loved it.",
            "review_date": "2010-02-01",
            "source": "rt"
        },
        {
            "content": "A free adaptation of a great book. Despite the deviations from the 600 page book, the movie was just as great.",
            "review_date": "2010-02-01",
            "source": "rt"
        },
        {
            "content": "I had sex with the DEVIL!!!",
            "review_date": "2010-01-22",
            "source": "rt"
        },
        {
            "content": "I have read the book by Umberto Eco and saw the movie with Sean Connery and I think the movie does a very good job in depicting the atmosphere of the book. It sets in medieval times in a monastery where a mystery murder happens.  The movie is interesting on a lot of levels. I really like cinematography, the whole scenery adds to the threatening atmosphere that is constantly present, while at the same time it is at times really beautiful. A lot of story lines are running in parallel. The movie is still interesting after seeing it many times.",
            "review_date": "2010-01-22",
            "source": "rt"
        },
        {
            "content": "Un clásico de misterio, Sean Connery maneja muy bien al personaje, la historia es muy interesante y la ambientación te transporta al monasterio en donde ocurre los asesinatos.",
            "review_date": "2010-01-20",
            "source": "rt"
        },
        {
            "content": "Un bon thriller mÃ©diÃ©val tirÃ© d'un bouquin d'Umberto Ecco avec un Sean Connery au sommet de sa forme. On revoit ce film populaire toujours avec le mÃªme plaisir.",
            "review_date": "2010-01-14",
            "source": "rt"
        },
        {
            "content": "stat rosa pristina nomine, nomina nuda tenemus?",
            "review_date": "2010-01-07",
            "source": "rt"
        },
        {
            "content": "While a little different from the book, it retains the medieval \"feeling\" and the intensity of the plot.\r\nIt created a new world without being about sci-fi or fantasy.",
            "review_date": "2010-01-06",
            "source": "rt"
        },
        {
            "content": "El libro es uno de los mejores que he leido en mi vida, si no es que el mejor. La pelicula no se queda atras.",
            "review_date": "2010-01-03",
            "source": "rt"
        },
        {
            "content": "Does some things well, but it's just too slow and doesn't introduce enough content to justify its full running time.  Connery is great, and it was interesting to see such a young Christian Slater, but there are better films about the middle ages out there.  It might seem that the film is fairly historically accurate, but really it doesn't even have that going for it.",
            "review_date": "2009-12-19",
            "source": "rt"
        },
        {
            "content": "I read the book from Umberto Eco just before I saw the dramatization.\nI think that the movie follows very well the book.\nI was thrilled from the start until the end.The actors are awesome .\nBoth the book and the movie are incredible, full of mystery and very dark (although there are some comical scenes) -so please give it a go.",
            "review_date": "2009-12-17",
            "source": "rt"
        },
        {
            "content": "The Name of the Rose (1986)\n\nThis movie is based on Umberto Eco's novel set in a 1327 Northern Italy Benedictine monastery, and features an international cast.  Two Franciscan delegate monks, Brother William of Baskerville (Sean Connery), and his novitiate side-kick, Novice Adso of Melk (Christian Slater) are here to attend a council debate dealing with the poor and church wealth.\n\nThere are some mysterious deaths of some talented Illuminators in the Abbey.  Many are blaming it on the work of the devil, but Brother William's superior skills of deduction and reason suspects that it might be something else. \n\nThe other monks are very secretive about what is going on at the monastery.  Making everybody suspicious, including the hunchback Salvatore (brilliantly played by a very young Ron Perlman) who speaks many different tongues.  There's also a beautiful peasant girl (Valentina Vargas) who may be a witch and has enchanted young Adso.\n\nBrother William wants to investigate the Scriptorium and the abbey's library to see what they're hiding.  Are there forbidden books that are stored there?  There is also the untimely visit of the grand inquisitor, Bernardo Gui (F. Murray Abraham) who has dealt with Brother William before.",
            "review_date": "2009-12-14",
            "source": "rt"
        },
        {
            "content": "Suspense, hard cenes and a lot of intelligence in the intrigue. And it is the few movies of Holllywood that we learn History.\n\nIt catch your atention!",
            "review_date": "2009-12-12",
            "source": "rt"
        },
        {
            "content": "One of the best movies out there. Well acted, well written, great pace, wonderful story line, and a messege that will leave you thinking for quite a while... You just can't ask for more!",
            "review_date": "2009-12-06",
            "source": "rt"
        },
        {
            "content": "I really liked this movie.",
            "review_date": "2009-11-17",
            "source": "rt"
        },
        {
            "content": "I prefer the book...",
            "review_date": "2009-11-02",
            "source": "rt"
        },
        {
            "content": "Majdnem olyan Ã©lvezetes mint a kÃ¶nyv.",
            "review_date": "2009-10-26",
            "source": "rt"
        },
        {
            "content": "This movie is great, one of the gems of Connery's career.\nIt's like Sherlock Holmes, but in medieval times;\nSean Connery is completely believable as a monk in this movie.\nExtremely entertaining and dark; go see this movie.",
            "review_date": "2009-10-22",
            "source": "rt"
        },
        {
            "content": "The sheer intelligence of this movie. It builds slowly but surely to the climax,and the suspense is felt all the way through. Great stuff, great actors,and a killer story.",
            "review_date": "2009-10-18",
            "source": "rt"
        },
        {
            "content": "Love what they did with the scenery and all, some good acting, a classic, but the ending, despite the 2:10h feels rushed and in the end deviates just a little too much from the book. Oh and they wrote out Benno which is unforgivable in my opinion. 4.25+",
            "review_date": "2009-10-18",
            "source": "rt"
        },
        {
            "content": "Great Film filled with mystery and excitment. Full of twists and turns that keep you on the edge of your seat!",
            "review_date": "2009-10-12",
            "source": "rt"
        },
        {
            "content": "after minority report, this is the second movie adaptation from a book that i really appreciate",
            "review_date": "2009-10-12",
            "source": "rt"
        },
        {
            "content": "As much as I like Sean Connery...I have a hard time watching this one.",
            "review_date": "2009-10-10",
            "source": "rt"
        },
        {
            "content": "A great movie and a phenomenal cast, which includes son of Shalyapin-siger and Sean Connery in all his greatness. F.Murray Abraham is his usual evil, and Christian Slater definitely holds his own even at his tender age, while Ron Perlman is just amazing.\nHaving started reading the book, I can appreciate the difficulty in making this movie, and I think it was extremely well done. It is also a lot more rigorous (whereas I found the book a bit unexciting). \nOne thing I can't figure out, though - why is it that whenever I search for the movie, the English title comes as a translation for the primary German title?",
            "review_date": "2009-10-03",
            "source": "rt"
        },
        {
            "content": "Its major flaw is its lack of excitement, in spite of an interesting story.",
            "review_date": "2009-09-27",
            "source": "rt"
        },
        {
            "content": "Fuck you, Christian Slater.  You fucking blew it in this movie.",
            "review_date": "2009-09-22",
            "source": "rt"
        },
        {
            "content": "Good film about 13th century, very religious and superstitious",
            "review_date": "2009-09-20",
            "source": "rt"
        },
        {
            "content": "Not as good as the book!",
            "review_date": "2009-09-14",
            "source": "rt"
        },
        {
            "content": "Je l'ai vu il y a des annees, mais il m'a beaucoup marque. A revoir, certainement.",
            "review_date": "2009-09-06",
            "source": "rt"
        },
        {
            "content": "We watched it in my philosophy class and I found it pretty interesting and well-made. It makes The DaVinci Code look dumb and it is truly amazing.  :)",
            "review_date": "2009-09-05",
            "source": "rt"
        },
        {
            "content": "Adapted from the book of the same name, by Umberto Eco.",
            "review_date": "2009-09-04",
            "source": "rt"
        },
        {
            "content": "Great scenery, beautiful photography, and excellent casting. You can tell it is an adaptation of a novel though. It plays out at times a bit like a survey of the novel's plot, rather than a story in its own right. Nevertheless, Sean Connery delivers the goods, and the subject matter is very rich.",
            "review_date": "2009-09-04",
            "source": "rt"
        },
        {
            "content": "The Name of the Rose (original title, Der Name der Rose) is a German-French-Italian 1986 film, directed by Jean-Jacques Annaud, based on the book of the same name by Umberto Eco. Sean Connery is the Franciscan friar William of Baskerville and Christian Slater is his apprentice Adso of Melk, who are called upon to solve a deadly mystery in a Medieval abbey.",
            "review_date": "2009-09-04",
            "source": "rt"
        }
    ]
}