{
    "rating": 5.1,
    "release_date": "Invalid",
    "num_reviews": 35,
    "genres": [
        "English"
    ],
    "summary": "A couple discover a strange room in their new house that grants material wishes, but all they want is a child.",
    "reviews": [
        {
            "content": "It is an interesting and watchable movie. The main problem with it is that it was stretched too long and became repetitive and boring after a while. The director could have easily shaved off 20-30 minutes from this 100 minute movie without affecting it. The concept itself was creative, but the acting was just average. The cinematography was good. Although mostly predictable, there were a couple of good plot twists and turns. Overall, it's ok.",
            "review_date": "2023-02-05",
            "source": "rt"
        },
        {
            "content": "Annoying characters. Not a lot of tension, but a few good ideas.",
            "review_date": "2022-12-30",
            "source": "rt"
        },
        {
            "content": "The ideas this creative piece aimed for failed to ever mature.  The plot was definitely interesting.  The acting by the two leads quite good.  The cinematography and set dressings were evocative and interesting.  I wanted to like it more than I did and wish it had held together better as it progressed.  The twists were predictable, sadly, as was the ending.  I cannot say it failed…nor can I say it succeeded.  It was a film that never really became tedious yet it ultimately proved to be a fence sitter.",
            "review_date": "2022-10-23",
            "source": "rt"
        },
        {
            "content": "Pretty cool concept, the accent's were bit inconsistent and distracting but the over all story kept me interested.",
            "review_date": "2022-05-10",
            "source": "rt"
        },
        {
            "content": "An excellent idea, executed pretty well, with some crazy plot twists thrown in for good measure. A definite must watch from me, especially if you're after something non-linear and somewhat thought provoking and you understand the almighty issue of the human condition to 'just keep wanting'...",
            "review_date": "2022-01-10",
            "source": "rt"
        },
        {
            "content": "You need to accept too many bad explained premises to believe it is realistic. This fabulation would fit more in a tale than in a movie, although some expertiments with the visual work are interesting.",
            "review_date": "2021-12-22",
            "source": "rt"
        },
        {
            "content": "I found the rating on Rotten Tomatoes too harsh.  \n\nYes the film is like an extended twilight zone episode and demands the suspension of some reality but the acting is fair (wife's character is strong) and the art direction is amazing.  Worthwhile.  Glad I saw it.  BTW, was that a flux capacitor?  LOL",
            "review_date": "2021-07-12",
            "source": "rt"
        },
        {
            "content": "Interesting concept, questionably executed.",
            "review_date": "2021-02-23",
            "source": "rt"
        },
        {
            "content": "Very very fresh movie I watched,with new plot available at prime Amazon.",
            "review_date": "2021-01-28",
            "source": "rt"
        },
        {
            "content": "This was an interesting premise and the 2 lead actors are good. I'm taking away one star for the child actors who were awful.",
            "review_date": "2021-01-27",
            "source": "rt"
        },
        {
            "content": "La sensualità di Olga Kurylenko non basta a rendere \"The room\" un film degno di nota.\nNella prima parte un susseguirsi di eventi troppo prevedibili e di comportamenti troppo assurdi ma necessari per portare la trama ad un finale più contorto e pericoloso.\nTroppo poco credibili le azioni di tutti i personaggi; nettamente il punto debole del film, che pure offre nella seconda parte qualche colpo di scena interessante.",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "The story is quite unusual and it was written well. I liked the movie.",
            "review_date": "2020-11-28",
            "source": "rt"
        },
        {
            "content": "An interesting idea, spoiled by the characters not behaving in a believable way within the fantasy.",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "Great film very well done",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "It is a very original and ingenious thriller. Olga Kurylenko and Kevin Janssens put on great performances, while director Christian Volckman makes it the best of the genre, and if you want to step into the room, you will not be able to leave, because what you will experience, has no limits.",
            "review_date": "2020-10-28",
            "source": "rt"
        },
        {
            "content": "Very different type of thriller. I liked the message and ideas. ",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "The plot and reaction of the characters leave much to be desired. A problem of the script. Nothing to say about the performance of the actors.",
            "review_date": "2020-10-18",
            "source": "rt"
        },
        {
            "content": "It's absolutely a three and a half star movie but seeing Olga Kurylenko in lingerie bumps it up at least one and a half stars. Joking aside it's a worth while movie to see . A movie built around the foundations of restriction seen through nietzsche's death of god it has the tone of a neo-folktale. Even though I didn't love the ending it doesn't leave the familiar the \"would be good if\" feeling in my mind.",
            "review_date": "2020-10-05",
            "source": "rt"
        },
        {
            "content": "It was weirdly fascinating.  Enjoyed it.",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "Not half bad. Really like the actress.",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "It's another take on the whole Monkey's Paw story, but with a twist that leads it into a family drama, with a cool ending. It's a decent Twilight Zoneish kind of thriller.",
            "review_date": "2020-08-28",
            "source": "rt"
        },
        {
            "content": "This movie breaks the most important rule of the genre it inhabits. The reason why all shows/movies like The Walking Dead, A Quiet Place, Get Out, or The Shining put the audience on the edge of their seats is because they don't want to see the main character, or their favorite character die. I couldn't care less whether any character in The Room dies, and because of that, I couldn't care less if I hadn't even chosen to watch it.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "Starting off with an interesting premise that had the potential to pose some smart philosophical and ethical questions, ‘The Room' instead opts to go for the easiest and least inspired route possible. It squanders its original idea, but it might just have enough creepiness throughout to keep you seated until the end even if, overall, it's a bit of a disappointment.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "This movie sucks, quite frankly. Wouldn't call it a horror, hardly a suspense. Just a stupid story about a family who wants a kid and asks a magic room to give them one. That's about it. Dull. Tried to be good - failed. The acting isn't terrible, but can't say the same for the plot. ",
            "review_date": "2020-08-03",
            "source": "rt"
        },
        {
            "content": "The Room's fascinating premise is intriguing enough to keep you watching past its sloppy third act. What starts out as a creepy psychological horror turns into a family drama before finally reaching its unexpected conclusion, but it remains one of the most interesting movies I've seen this week.",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "Потрясающий и захватывающий сюжет. Фильм заставляет задуматься о многом. Актёрская игра хорошая. Единственный и большой минус, это не естественное и не логическое поведение главных персонажей.",
            "review_date": "2020-06-04",
            "source": "rt"
        },
        {
            "content": "This movie stared off well, but then it just sort of.......melts. The plot becomes sillier and sillier. It starts off as this mystery thriller and then turns into a mello-drama, and flips again and turns into a soap opera, it's like it doesn't know what it wants to be. And then there's the mediocre acting (I suppose that's what gives it that soap opera feeling - especially towards the end), these 2 leads are just NOT great actors at all. My verdict: 1 star. But because it isn't the worst movie out there, and the narrative is very original, (it's just the acting that kills it) I'll give it an extra star. Perhaps this film would do better if they did a remake/reboot. Final verdict: 2 stars",
            "review_date": "2020-05-09",
            "source": "rt"
        },
        {
            "content": "It is completely a different movie with good plot. Final movements were awesome and did not expect the twist. I thought as used to on Hollywood movies either one of them or both will dead on final batting. But the ending was unexpected one. This is not a used to type movie from Hollywood.",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "I was kinda waiting for the answers about the computer and how it works....",
            "review_date": "2020-04-23",
            "source": "rt"
        },
        {
            "content": "Good movie I really enjoyed it. Hope to see a second. It seems they set themselves up for one although who knows cuz these Hollywood people are weird.",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "Really enjoyed this. Ticked along nicely with plenty to keep your interest in an original story idea.",
            "review_date": "2020-04-09",
            "source": "rt"
        },
        {
            "content": "The opening credits, with somewhere like 10 productions houses involved ( none of them recognisable ) should have warned me from the outset. Aladdin in a haunted house. Kurylenko was a barely passable Bond girl, but she's just another \"model\" who has failed to make the transition. Don't know any who have to be frank. It passed some time but instantly deleted from the memory.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "It was a fun film, don't get me wrong. However, it was pretty predictable, especially towards the end. And then there were some parts that weren't explained that just niggled at me!",
            "review_date": "2020-04-03",
            "source": "rt"
        },
        {
            "content": "Quite a good story line but pretty predictable.",
            "review_date": "2020-04-03",
            "source": "rt"
        },
        {
            "content": "Much of the story felt novel and the bit of recursion is always fun to try and wrap your head around.  But why did the child have an English accent?  It's an entertaining romp with some good twists.",
            "review_date": "2020-04-03",
            "source": "rt"
        }
    ]
}