{
    "rating": 8.0,
    "release_date": "Invalid",
    "num_reviews": 110,
    "genres": [
        "English"
    ],
    "summary": "Star-Lord, Drax, Rocket, Mantis, and Groot engage in some spirited shenanigans.",
    "reviews": [
        {
            "content": "Woo! Kid stuff. Jokes, songs, and hugs, just for a quick wink and nudge. Cant hate it but dont love it.",
            "review_date": "2023-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There’s nothing wrong with this movie but you can’t compare it to all the action movies like iron man",
            "review_date": "2023-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heart warming pure Christmas treat. Where characters are so well well developed you will fall in love with this masterpiece",
            "review_date": "2023-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a fun watch. Good for the holidays.",
            "review_date": "2023-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the Galaxy Holiday Special is a lot of fun!",
            "review_date": "2023-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very entertaining, loved seeing Kevin bacon portraying himself. The guardians actors had another great performance, and as usual the soundtrack kicked ass",
            "review_date": "2023-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am mystified by the positive reviews on this one. It was annoying, stupid, and not funny. Reminded me of She Hulk in that regard.",
            "review_date": "2023-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a lot of fun. nothing more nothing less",
            "review_date": "2023-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute, but unnecessary. It feels like they diluted the quality of the actual movies, with a lower quality holiday special.",
            "review_date": "2023-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i like this Christmas special with the guardians",
            "review_date": "2023-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Movie Guardians of the Galaxy: Holiday Special, Great Christmas Fun",
            "review_date": "2023-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In keeping with other holiday classics it was super corny and ridiculous, super fun romp for the fans. If you go in loving guardians of the Galaxy, then you will love it. I wouldn't watch this if you haven't seen any of the films, it would be like just watching special features without seeing the movie first.",
            "review_date": "2023-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so good for Christmas also kevin bacon",
            "review_date": "2023-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Short and sweet.\" That's the best way to describe this special. While a complete throwaway of a film (likely filmed while making GoG: Part III), I'm addicted to most anything James Gunn creates. His near perfect mix of goofy and seriousness, with a slight touch of awkwardness and a dash of nostalgia scratches that part of my brain. He knows what fans want without going too over-the-top. Great appetizer'till we get the real deal this Spring...",
            "review_date": "2023-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This shows the true meaning of Christmas, the spirit of giving, with some Yule tide fun, some good songs, and a good plot to make this definitely worth watching.",
            "review_date": "2023-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic, yet sweet short special about the meaning of Christmas.",
            "review_date": "2023-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome, funny as hell",
            "review_date": "2023-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guardians of the galaxy Christmas special is a great addition to their trilogy! I'm so happy Marvel went out of the way to make a Christmas special with some of my favorite marvel characters! No spoilers… Highly recommend!",
            "review_date": "2023-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was definitely an exciting experience and roller coaster, I thoroughly enjoyed watching this movie, and yes, it's a movie to me. I think this special presentation definitely deserves to continue to happen. And the guardians of the Galaxy team was very well done in this film.",
            "review_date": "2023-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holiday fun for everyone! this is marvel's best special presentation so far!",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a fun Christmas movie and a great time",
            "review_date": "2023-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This holiday special was one of James Gunn's better films he has made. He has done an amazing job with the GOTG movies and has also done an amazing job with this special. It was a fun film and had very meaningful lessons in it too.",
            "review_date": "2023-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No No No No don't show me this again",
            "review_date": "2023-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "continued with the footprint of the film, a good comedy for Christmas bringing the heroes with Peter was taken from the earth as a child and bringing his idol to transform his special Christmas.",
            "review_date": "2023-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Take my review with a grain of salt, I do not care for GotG.",
            "review_date": "2023-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great fun \"Holiday\" Special. Drax and Mantis get to go on an adventure to Earth and learn the spirit of christmas.",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Since this is a Christmas special, why is it called a \"holiday\" special?  Doesn't affect the grade, but anyone who doesn't celebrate Christmas enough to be offended by calling a Christmas special still wouldn't watch it by calling it a holiday special.  Another perfect CHRISTMAS special.   The story, the FX, the CGI and the cast all work perfectly together and it doesn't overstay it's welcome.  The MCU is getting better.",
            "review_date": "2023-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect guardians tale for the holidays, with great laughs.",
            "review_date": "2023-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Guardians of the Galaxy Holiday Special does what it needs to in order to be an effective Christmas tale. It is funny, heartwarming, and filled with fantastic original Christmas songs. It is nothing overly special but does what it needs to.\n\nThe writing for this special was pretty lackluster, there were more than a handful of lines that felt very awkward. I would question the acting, but we've seen and fell in love with these characters on the screen before, so the writing seems to be the culprit. Many of the Kevin Bacon and Kraglin's lines were cheesy and inorganic. I am not sure if that was the intent, but it just did not work for me.\n\nThe comedy is fantastic and hand me audibly laughing at many scenes. It was great to see the gang back together again and has me that much more excited for Guardians of the Galaxy: Vol 3.\n\nOverall, this was a decent entry into the MCU. Short, fun, and lighthearted. It does not attempt to be more than that.\n\nScore: 54%\nVerdict: Average",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (7.5/10) ; Cinematography (8/10) ; Plot (7.5/10) ; Acting (7/10) ; Pacing (7.5/10) = 75%}\"",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of fun, feelgood vibes. Make sure you watch Footloose (1984) first ;)",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really nice, with an old fashioned Christmas warmth to it that I wasn't expecting. I can this becoming a yearly Christmas rewatch tradition!",
            "review_date": "2023-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having been surprised by the success of the first Guardians of the Galaxy, its sequels, and the characters' involvement in the last two Avengers movies, Thor: Love and Thunder and the Disney+ series I Am Groot, I would say I'm a fan of these Marvel characters. After having seen the Disney+ special Werewolf by Night I got to say that my hopes were high concerning this show.\n\nSet during the Christmas season sometime after the events of Thor: Love and Thunder, the Guardians of the Galaxy are taking some much-needed time off from adventures after the Snap. Quill is going through the motions having come back, and has missed out and missed a lot of things gone. So, his two Guardians friends Drax and Mantis are out on their way to fulfill the Christmas spirit by dolling up Knowhere, their base of operations, and turning it into a Christmas surprise that is as chaotic as their typical adventures.\n\nI got to say that James Gunn made this particularly silly and not the most watchable as the movies with its absurd humor and no grand action, but it has its moments. Dave Bautista and Pom Klementieff are the true leads to this story with the other Guardians supporting leads, but it works as Pom has spent less time with the group than the others. I appreciate how much Chris Pratt has matured his depiction of Quill and it's plenty fine seeing the rest of the Guardians. But this made me prefer to watch the movies more than this special. Not as great but still alright.",
            "review_date": "2023-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hard watch as always these days, thanks!",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sweet, fun, lighthearted. I enjoyed it. :)",
            "review_date": "2022-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable and light story telling",
            "review_date": "2022-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really entertaining and funny. Worth the watch for sure.",
            "review_date": "2022-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it. Feels like the kinda light, fun show that used to run on TV at Christmas in the 80s, but with top notch vfx.  Great stuff!",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of the elements of this film felt very contrived. But it also managed to be pretty funny and it was over pretty quickly. It was not as good as Guardians of the Galaxy 1 or Guardians of The Galaxy: Volume 2 but it was decently entertaining.",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overweight Chris Pratt in a terrible excuse of a plot. Cringy songs every 2 minutes and bad acting killed it…. Best thing is Kevin Bacon though ….",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Guardians of the Galaxy are among my favorite Marvel characters. I feel like the 2014 movie is still one of my favorites in the MCU. This special is a fun distraction to get us excited for volume 3, but it doesn't do much to make it stand out. It's funny and sweet and a decent way to kill some time, but I feel like they could have done more with the characters and even made this an hour-long story. Overall, it lacks some substance but still has a warm feeling, and it is a fun way to revisit these characters before the next movie and is a mostly light and fun time.",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable and hilarious",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible stupid film.",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is the best thing that happened in the new phase of the MCU. I am delighted and got a storm of emotions and a festive mood. I miss such cool Marvel projects !",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pass the time movie which is enjoyable and forgettable. It is good for the one off watch but probably won't make it to your repeat Xmas movie list.",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful and funny Christmas show. The guardians are so amazing!",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a fun little Holiday Special, it's pretty damn great. Drax and Mantis are hilarious and I can't wait to see more of them in Vol. 3.",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This had to be one of the most wholesome, enjoyable Christmas movies I've ever seen and it was only 45 minutes. I'm pretty sure I had a perpetual smile on my face throughout the whole special. And I was literally crying at the end, it was so cute. And the mementos from the first and second movies like Yondu's little frog statue and Quill's guns had me bawling. The way Marvel connects the dots like that and explains things we might have looked over years later is one of the things I love most about this franchise. This movie reminded me of why I love Marvel so much.",
            "review_date": "2022-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's insubstantial even for a holiday special; but it's still warm and enjoyable thanks to likeable, familiar characters and the chemistry they have with one another.",
            "review_date": "2022-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was really bad... just not funny at all.   The opening song maybe had some potential, but .... just flat.",
            "review_date": "2022-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a fan of Guardian of the Galaxy, enjoyed their movies but this one was lame. I expected better, left disappointed.",
            "review_date": "2022-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have grown tired of movies after Marvel's End Game. I feel they lost their deep emotional connection to the characters and replaced it with pure silliness. This short film, deepens the characters while remaining a fun Christmas movie. Definitely the best they've put out since End Game, in my opinion.",
            "review_date": "2022-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was so much fun to watch, a new top favorite Christmas special!",
            "review_date": "2022-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a holiday special!! It's fantastic, it's funny, it's pure entertainment and it really gets you in the holiday spirit. Disney marvel has had 2 great projects back to back. Hopefully they keep this up. In the end Drax and mantis are great together and should have their own show. And Kevin bacon is funny. Good holiday special. I might watch this every year now. I don't know yet. We'll see next year.\nNov 25 22",
            "review_date": "2022-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Christmas fun from the GOTG crew. Nicely paced (they could have padded this out to an hour and a half, but 1 hour is just right) and full of quirky moments. I wondered how they would get a Holiday Special out of this universe and they have created an intelligent and witty story.",
            "review_date": "2022-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When one thinks of Guardians of the Galaxy, you expect comedy, action, adventure and a story line that leads you to wanting more from the movie. This one, completely terrible. It starts nicely, and seemingly exciting and then just gets completely dull, obvious and boring. Compete disappointment.",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and absolutely worth watching!",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best things I've seen out of Marvel in a while. Genuinely fun and touching.   Dare I say best Christmas movie since Die Hard?",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not a guy who's enamored with Marvel movies. I like them but they are somewhat formulaic and I have to want to see the formula when I'm in a certain mood. But, this short film very pleasantly surprised me. It's funny and warm and a perfect addition to the Christmas film roster. Give me this over any Hallmark film.",
            "review_date": "2022-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this special was very funny and it was great having Mantis and Drax in the spotlight, the Guardians are always great to see.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely enjoyed this. I have to admit it sort of surprised me, and took me where I hadn't expected. The whole bit with Kevin Bacon was seriously funny in my book, and the usual silliness attendant to these characters hasn't worn thin for me yet, so definitely was worth watching and was enjoyable to boot",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and charming, exactly what you would expect from James Gunn and Guardians of the Galaxy.  This will be the silly holiday special that this generation remembers fondly when they get older, and something the whole family can enjoy.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Guardians of The Galaxy return for a holiday special in which Mantis ( Pom Klementieff)   and Drax ( Dave Bautista )  want to give the gift of kidnap to Peter ( Chris Pratt ) for Christmas. Enter Kevin Bacon as Kevin Bacon who is taken from earth, boxed and gift wrapped as a present for Peter. \n\nJames Gunn has given the Marvel Fans an odd but fun mini movie. \" The Guardians of the Galaxy Holiday Special\" features two great new Christmas songs and a character revelation as a set up for the next instalment of the Guardians in The M.C.U. Pure ironical nonsense but totally enjoyable.\n\nYou have to love Kevin Bacon in this …",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a big fan of the Guardians of the Galaxy comics, movies and video games, this was painful to watch. Disney has been slowly killing Marvel content more with each release.",
            "review_date": "2022-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A short and sweet but also filled with the classic comedy that is the Guardians crew. Loved it! Mantis and Drax's exploration of Hollywood was hilarious to watch.",
            "review_date": "2022-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, creative, funny, and a good time. Same great characters without any real conflicts. Fun for the family and marvel fans that love Christmas. ",
            "review_date": "2022-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why are Drax and Mantis suddenly so stupid they don't understand kidnapping is bad?",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fun watch love how the bring it full circle with the song at the start and at the end.",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "See disney can do something the right way. Merry Christmas",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You get what you might expect. The Holiday special is decently funny as are some of the songs in it. I personally found it a little underwhelming though. I think it gets a little too close to the real world which hurt my sense of immersion, and by James Gunn standards I think it's a little weak. It's still alright entertainment.",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely loved this humorous special from Marvel!",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the only great things of phase 4 besides No Way Home. James Gunn really knows what he's doing with the Guardians.",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 5 star reviews in here is proof that Review Bombing works both ways.\n\nThe only special worse than this was the Star Wars Christmas special.",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty awful I don't know why anyone was raving about this. It made Thor the dark world look like best picture stuff.  Ever since endgame things have been going a bit downhill...",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely loved it. This is the perfect length for a holiday special. It's short but still manages to get a good story in. Great use of Kevin Bacon.",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just another dumb holiday thing. Not as a bad as the Star Wars special but fairly close.",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't go in expecting a spectacular and it wasn't an MCU thriller, but if you like the GOtG characters you'll laugh at this one.  Plus the music is pretty good.",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somehow better than a lot of what marvel has made recently. Short and sweet but hits hard with the emotional punches.",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a nice feel-good presentation. No villian , Absolute enjoyable , emotional, special presentation. Must Watch!",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Any Marvel fan should be happy with it. I think most people know what they are getting with these specials. A reveal of a new sibling is the main take away for the upcoming Guardians film!",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "mostly proud but mildly annoyed that a chunk of the holiday playlist I've painstakingly crafted over many years will now become just the Guardians Christmas Mixtape",
            "review_date": "2022-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting, direction and humour, not to mention fixing Star-Lord's reputation in recent years of that of a lower, make this one-off Christmas adventure a loving homage to, of all things, the Star Wars Holiday Special.  Wholesome fun starring the Guardians of the Galaxy that should be just enough to keep people satisfied before Vol. 3 comes out.",
            "review_date": "2022-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is very very good and a very good time was incredible, funny and heartwarming and kevin bacon was fun too, even mario was good in this.",
            "review_date": "2022-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A loveably cheesy, sweet, and fun little side adventure for the Guardians of the Galaxy. The best part of this is that it finally gives more screentime to Drax and Mantis, who have been somewhat sidelined in the MCU. \n\nThe James Gunn charm is there of course and its just fun to see these heroes who always go on such high stakes adventures do something so low stakes and fun.",
            "review_date": "2022-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kevin Bacon playing Kevin Bacon is all I needed to see to love this. I love the MCU so much.",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining, funny, and a good holdover until Volume 3 comes out.",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While before the Guardians of the Galaxy movies struggled to balance between goofy comedy and serious world-ending events. They are finally allowed to let their freak flag fly and make a less serious special surrounding the Guardians. They manage to bring in some cheesy Christmas moment that make this special very lighthearted along with all the humor. Some of the writing seemed a bit lazy considering compared to how much humor was spread around the rest of the film. Still a very fun PG feature to kick back and enjoy for the holidays.",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining enough.  Just a bit of holiday fun.",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More Marvel Special Presentations PLEASE!!",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was short and fun holiday special only 40 minutes long its perfect plus thos is Kevin Bacon\"s better performance as himself which yeah this does make perfect sense on how celebrity and movie characters are just being creepy remember don't be creepers to celebrities that seems wrong. They did reference some DC universe I'm confused would Marvel and DC be able to do collision between the two universes I'm not 40% sure if there allowed.\nOverall this was a fun Christmas special and very much about Kevin Bacon and the true meaning of Christmas.",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible acting with a stupid After School Special plot.  Certainly does not match MCU caliber.",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James Gunn is the master.",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good but nothing special. Some of the jokes did not land but it was still a great time.",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know who this is for. My 8-year-old got bored of the music, didn't know Kevin \nBacon, and kept waiting for action scenes, so he tuned out. I didn't like the silly behavior, lack of action, and lack of tension. It's dialogue is out of reach for children and the story is too simple for the adult. Maybe I'm too much of a fan of TGOG because this production just left me hungry.",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice Christmas movie with a Marvel background. Some self-ironic jokes are so funny!",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        }
    ]
}