{
    "rating": 2.4,
    "release_date": "Invalid",
    "num_reviews": 190,
    "genres": [
        "Sci-fi"
    ],
    "summary": "Anton Bartok (Lee Richardson), the CEO of a research laboratory, acts as the self-appointed guardian of orphan Martin Brundle, whose father had been a researcher at the lab. Though Martin is scarcely five, he has the appearance of a 20-year-old (Eric Stoltz) because of mutant insectoid genes in his system. Martin grows up confined to the laboratory, unaware of his true nature, with only pretty scientist Beth Logan (Daphne Zuniga) to call a friend. Soon, the fly within begins to emerge.",
    "reviews": [
        {
            "content": "The Fly 2 is a good sequel and worth watching. It's not as good as the first movie.",
            "review_date": "2023-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Bartock using Martin to perfect the teleportation pods. I understand wanting Martin to finish the teleportation experiment.  That will be a gold mine to the one who can make it work.  But what money is in genetic mutations?  What money can fly men monster bring?  The movie never really explains that.  Scientific curiosity wasn't exactly a character trait they gave Bartock.  Also the monster Martin turns into is kinda cool but looks more b-movie than what I'm guessing would be at least a medium to high budget movie.  Lastly I know Martin is a kid in an adult's body but that doesn't mean he has to be a bratty Kenny kid.  But overall, I did enjoy it more than the original.  But only slightly.",
            "review_date": "2023-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What in gods name where they even trying to shoot for.",
            "review_date": "2023-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sequel to David Cronenberg's film, this one sees the son of Seth Brundle, Martin, played by Eric Stoltz, living in a research facility as he begins to start showing signs of the fly genetics he got from Jeff Goldblum.  I liked this as a fun little monster movie, but it's nowhere near the brilliance of Cronenberg's film.  This is more of a fun footnote to that movie.  Fun nonetheless and also features Daphne Zuniga.",
            "review_date": "2023-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good special effects isn't enough to save the boring script.",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie really does not need a review suffice to say it stunk in every way...",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure why so many people don't care for this movie. As sequels go, it ain't bad! Eric Stoltz and Daphne Zuniga turn in credible roles. I love the original Fly. I love the Goldblum remake quite a bit! But this stands on it's own in a fine fashion.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "while it's not the worst sequels ever made but it was incredibly disappointed as a creature feature is okay but as a Sequel to The Fly it's a major let down",
            "review_date": "2022-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't expect I would like this more than the original but really enjoyed it...",
            "review_date": "2022-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing like the original The Fly with the other guy this movie stinks to high heavens!",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A not very clever monster movie. Amusing enough for what it is - a cheap 80s creature feature - but unworthy of consideration as a sequel to the excellent original.",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sure it lacks the sophistication of its predecessor, and it's quite the step down all around, but this is unfairly maligned, as being complete trash. When it's actually a pretty fun monster movie. It features great creature effects, some of the most impressive kills I've seen to this day, and an unexpectedly committed performance from Stoltz. And who wouldn't get emotional over the fate of the dog? It's a fun midnight movie.",
            "review_date": "2020-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its not as good as The Fly but its still pretty good. Trashy fun B movie. I think people would of liked this movie a whole lot more if they cut the awful scene with the dog in it. I don't think anyone likes seeing a dog tortured.",
            "review_date": "2020-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director Chris Walas fails to bring the humor but doubles down on the horror with this reasonable sequel to Cronenberg's hit remake. This was one of the last truly great grotesque use of animatronic special effects before everyone got lazy and rushed into CGI generated images, but there is something visceral, organic and gritty in this 'Son of Fly' that got to me. Eric Stoltz makes the most of his lines while demonstrating vulnerability, pathos and rage at being the unwitting product of his father's work. \n\nWhile not reaching the intense levels of its predecessor, 'The Fly 2' makes for a fine bookend to the saga of 'The Fly'.",
            "review_date": "2020-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a huge disappointment when it was released in 1989.  The 1986 version with Jeff Goldblum was a masterpiece, this was just a cheap B-movie horror film.  Instead of an original script for the sequel, the writers just took the scripts from 2 sequel films from the 1958 Fly movie (Return of the Fly-1959 and Curse of the Fly-1966)...and combined them to make this.  There is also a very upsetting scene with a dog (which Fox Television refused to air) and it has a creepy/depressing ending. This movie is the reason there was never a Fly 3 film!",
            "review_date": "2020-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A barely watchable sequel that has a weak story but nice practical effects. (D+)",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its generic and boring. ",
            "review_date": "2019-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 to 3 and a half, probably more like 3 and a half. I actually like The Fly 2 better then the one with Goldblum as leader in ways. The ending doesn't end too quick, there's more to the ending. There is just more in this. It's still in some ways a good bad movie but worth the watch. Some of the deaths are great too. ",
            "review_date": "2019-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "no where near as bad as people are saying, twists and a great plot with a really good ending, one of the better sequels to a film, very well done",
            "review_date": "2019-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't find it as bad as people made it out to be. Definitely not as mind-blowing and stomach turning as the original, but it does a surprisingly good job on following it up, keeping in mind the aspects that made the first one such a memorable film in the horror genre. And If you're on fence, atleast watch it for the brilliant final 30 minutes.",
            "review_date": "2017-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Fly 2\" is an unnecessary sequel with more monster violence and gory special effects than the first, as we watch Brundlefly's son grow up and wreak havoc on a corrupt corporation. The plot is forced, and the acting is mediocre, but the use of practical special effects and scenes of laughably absurd violence provide at least some entertainment.",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember watching this on VHS when it first came out and not being all that impressed. However, if you look at the writing credits, there are some pretty solid writers, Mick Garris (creator of \"Master of Horror\" , Jim & Ken Wheat (co-writers of \"Pitch Black\" [though I think director/co-writer David Twohy gets most of the credit on that one]), and Frank Darabont (writer/director of \"The Shawshank Redemption\" and creator of \"The Walking Dead\"), so I went into this re-watching film with some new hope. The film starts out well with the offspring of Jeff Goldblum and Geena Davis from the first film being raised by a research facility. The child grows at an accelerated rate and in five years grows into Eric Stoltz, who is a genius and is the only one who seems to understand his father's teleportation research and is continuing his research for the company who is holding him. The film starts out well, with Stoltz thinking the research facility is treating him as a scientist, but he slowly realized he's really just a highly intelligent lab rat. The film sadly then goes down the road of standard horror film gore and body counts when (SPOILER ALERT!) a mutated Stoltz begins to exact his revenge upon his captors. Generally speaking, this film is disappointing in that it's nowhere as intelligent as the David Cronenberg original (well, his remake of the 1958 film). But in this film's favor, Stoltz is quite good in the lead, as is Daphne Zuniga, who are both better of actors than you usually get in most horror films. Also, the gory special effects are well done, which is a good thing if you enjoy that sort of thing, which I do. That was enough to make this sequel watchable, but it's nowhere as intelligent or as compelling as the Cronenberg original.",
            "review_date": "2016-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually watched this before I watched the previous film which the only guess that I have, is so I can get a glimpse of what's it like so that whenever The Fly is free to watch only, I'll definitely give it a shot. After watching The Fly however, it really made this a very underwhelming sequel. Seeing as this wasn't directed and co-written by David Cronenberg and instead is by the make-up artist form the first film was not a good sign at all, but it does give into some new ideas that were perhaps restrained by David Cronenberg. When it goes through the first few minutes that the main girl from the first film goes into labor and finally got the baby out that's half fly and half human, it's a great idea to start with and you can do a lot of things with a character that's half fly/human. The thing is with it is that the filmmakers didn't do a lot with that and just have the character some generic powers. The characters are sticklike and aren't nearly as memorable as the characters in the first one. The villain is your average one that is nothing new. The dog scene was a bit unbearable to watch and consider that the director wanted this so that the viewers can feel sorry for the test subject, makes it even worse as they could've just put a human in, and it would have the same feeling as the dog, but more bearable to watch. The plot is mediocre which the director should've focused on, but it was more focused on the make-up and gore effects, and that was the problem here. The bigger problem however, was that the effects either look cartoony, rushed, or just really bad. The only good parts of the film, are the decent actingC and the cameo scene which is the most interesting and enjoyable part. The Fly 2 is a pointless sequel that could've worked given the ideas that they put in this, but were executed poorly.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At the end of The Fly, the girl is pregnant with Jeff Goldblum's son.  He is born in The Fly II, and like his father, he transforms into a fly-like creature.  He then seeks out revenge on the scientists who were studying him since birth.  Overall it's good but it's not better than the first movie.  If you like the first part, you have to at least watch it for continuation purposes.  3/5 OR 6/10",
            "review_date": "2015-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fly 2 takes awhile to get going as it continues to the story set up by the vastly superior first film. The story is all about buildup.  The opening gets you hooked with plenty of nasty and then proceeds to tell the story.  You might find yourself falling asleep with this setup but stick with it cause the payoff is a grossout fest full of action, goo, and vomitous fun.\nIt's too bad the film takes so long to get to the payoff and could have used a little more excitement along the way but gorehounds should still enjoy this fun sequel all the same.",
            "review_date": "2015-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An uninspired but very decent sequel to Cronenberg's classic, this follow up concerns Seth Brundle's rapidly growing son who is being raised and studied in a government facility with literally the worst fucking security ever, and played by \"nearly Marty McFly\" Eric Stoltz. The first two thirds are a bit of a drag, aside from the incredibly upsetting mutated dog, but then the final half hour or so of the film is an explosion of nastiness. There is a truly mean spirited feel to the movies graphic gore, especially the dudes face being melted off, vicious bastard Frank (The Mist, The Green Mile) Darabont's fingerprints are all over it. So it dose spend much of it's time as a dull retread of sorts but onece it gets going it's a disgusting, violent treat for gore hounds and horror fans, with great creature effects to boot. Well worth checking out.",
            "review_date": "2015-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "REVIEW: #TheFly2 is a forgettable #horror sequel. The movies tones and performances can't be matched to #DavidCronenberg's masterpiece #TheFly. However director #ChrisWalas' #makeup effects are brilliant, and horrifying! 3/5",
            "review_date": "2015-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An average 80's horror sequel in that it was terrible and should have never been made just like 98% of 80's horror sequels.",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring movie with a few interesting ideas. Would have been better as science fiction without the horror, and maybe some narration to get a better understanding of the character. Sadly, the ending is great. I don't mind watching a bad movie, but I find it sad when terrible movies show moments of brilliance. The special effects and the way the ending plays out is the closest thing I've seen to Aliens. That movie was much better, of course, but just watch the ending of The Fly 2 and tell me that doesn't put you in the mood to watch Aliens -- and the movie Freaks. If the movie was three hours long I wouldn't complain, if the extra hour was filled with carnage.",
            "review_date": "2015-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the types of films which would get shoehorned into a PG-13 nowadays, The Fly II builds up its horror with mood and tension, 80's style, until the third act, when the gore lets loose.",
            "review_date": "2015-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A far inferior sequel that should have been entitled \"Son of the Fly.\"  The creature effects a small step down mainly because the monster doesn't look much like a fly and the characters are less interesting.  Most importantly it feels more like a standard horror picture rather than the intelligent science picture its predecessor was",
            "review_date": "2014-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fails to hit the marks of the original remake, or offer anything new, but still watchable.",
            "review_date": "2014-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's got nothing on Cronenberg's original - or the Vincent Price classic, but it is an disgustingly cool continuation of the story. It has some of the most graphic blood effects I've seen, including a head popping like a zit under and elevator and a man whose face is dissolved away in corrosive fly vomit, so yes it's very gory but only towards the end, so it does make the special effects better but the rest is just second best. Eric Stoltz is good as Martin Brundle, the son of Seth Brundle and does well playing as a five year old who suffers from accelerated growth because of his \"Fly\" genes, though the character does miss it's quirkyness from the first film. It really is the last 30 minutes that saves the film and most acting is poor but the supporting cast but at least the lead as heart and is trying so hard over a weak, predictable script. But it does hook you and is a worthy sequel but you won't lose sleep over it, if you don't see it. The film is just noticeable for it's gore and tries to shock you with some disturbing scenes but it's problem is it's not scary, nor shocking but really worth a look.",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DID YOU SEE WHAT HE DID TO THAT GAURD!?? Just a treat for the eyes, the most graphic blood effects I've ever seen! Still better than todays standard.",
            "review_date": "2014-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first one. The bit with the dog was horrible.  The Fly is a classic, the Fly 2 is a forgettable sequel",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as bad as it is made out to be,it's worth a watch to tie off the open ending of the first movie, but it's still not that great, all of the puppetry and gore looks like what was used in gremlins,not \"the fly\"",
            "review_date": "2014-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seth Brundle was a brilliant scientist who died after a teleportation accident caused him to transform, but he left a son behind. Martin lost his mother in childbirth and is raised by the corrupt Anton Bartok who only wants to use Martin to discover the secrets behind the TelePod. But Martin accelerates in age rapidly, is as smart as his father and is about to transform into something much more deadly. Not as good as the first movie but this movie has a lot of things that I liked so yeah.",
            "review_date": "2014-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nowhere near as good as the first.... But honestly wasn't half-bad.",
            "review_date": "2013-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "last half hour is great..minus the last brutal 30 seconds....not even comparable to the first though",
            "review_date": "2013-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "under-rated sequel that may not live up to it's predecessor, but a great revenge exploit by it's final act.  Probably not for everyone",
            "review_date": "2013-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is ALMOST JUST AS GOOD AS THE FIRST ONE . . . it has a HAPPY ENDING. \n\nit has an unfair rap.",
            "review_date": "2013-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No doubt it's flawed and the inconsistent tone changes don't help either, but if you look past it you have a visually unsettling and fairly original take on the classic monster transformation movie formula. Top notch special effects here a must watch for any gore hound or student of the art form. It's imagery and stomach churning moments make it memorable if not a decent midnight movie watch with your friends.",
            "review_date": "2013-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's something about this film that intrigues me. It was never meant to be a masterpiece but I find myself enjoying it after each watch. Filled with great special effects, it's a movie you can kick back and enjoy without having to give it much thought about what's going on. It's pure fun.",
            "review_date": "2013-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the bad reviews, I really enjoyed this movie.",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To create a monster , then to lie... You are what u created .. Crazy film .. Don't mess with science! It will just bite u the ass , your in this case , squash!!! Splat!!!",
            "review_date": "2013-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never thought of The Fly becoming a sequel after that supposed climax at the end. Aside from the special effects, nothing else was impressive with this movie.",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now the mutated dog seen nearly made me switch off but I didn't so its not that bad!?",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much takes a giant shit on everything that made the original such a masterpiece. I give an extra star for retaining John Getz, and for body tossing. There is some seriously awesome body tossing in this movie.",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Losing so much of what made its predecessor a classic, \"The Fly 2\", feels like gore for the sake of gore, with a lazy story and lack of any sort of build up or suspense making the entire film unfortunately not scary as well as pointless.",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When compared to the original (remake), this movie is god-awful. But when taken as its own film... it's still god-awful.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has its moments but the first film was perhaps too hard an act to follow.",
            "review_date": "2012-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think I'm being generous with my rating.....  Some really bad, cheesy acting.",
            "review_date": "2012-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's no cronenberg film but it still good.",
            "review_date": "2012-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "okay , not as good as the Jeff goldbloom version",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shit, but some how half entertaining follow up to the Cronenberg hit. After 19 pints.",
            "review_date": "2012-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty good sequel, holding almost true to the original.  I don't exactly see how the main character could end up how he did, but it did leave for one hell of an ending.",
            "review_date": "2012-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Son of BrundleFly is a great concept, the effects and monster fly are better this time, a cameo by John Getz and the \"tomato head\" effect makes this a great sequel!",
            "review_date": "2012-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Compared to its truly amazing predecessor, this film is not only a disappointment, but a plain old piece of crap.",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I was too vague by saying I didn't like most of this movie by talking about not liking its individual parts, let me be more clear by saying this is not a good movie. It is, however, the sequel to a good movie. This movie spends the majority of the movie being really boring, only getting interesting in the last half hour of the movie, and even then not being that interesting. Most of the special effects looked cheesy, and most of the performances were more cheesy. But none more cheesy than the ending of the movie. That takes the cheese.\nFull review at: http://robertreviewsstuff.wordpress.com/2012/05/26/the-fly-ii-1989/",
            "review_date": "2012-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A forgivable if weak attempt to recapture the power of it's predecessor. They do at least honour the previous movies story and try to move forward in a plausible way but without a high caliber cast or directorial flare it was a doomed prospect that was surely made for the tie-in cash.\n\nThe one saving grace are several high-class effect scenes that many would struggle to better today, including 2 of the most disturbing scenes committed to film, but it's not enough tocarry the okay plot and flat performances.",
            "review_date": "2012-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Taking up immediately where Cronenberg's succinct homage to Frankenstein leaves off, sort of a Son of Frankenstein, the child of the monster seeks to break the curse.  The cast is sorta up to the challenge but w/o the intelligence and love inherent in the first, w/o a script, and with a less experienced director, well, there isn't much of a chance.",
            "review_date": "2012-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a follow-up to one of the greatest horrors of all time, The Fly II is dreadful. Yet, in its own right, it is actually better than you might have thought. Chris Walas' sequel concerns itself merely with gore and a desire, it seems, to appeal to a younger audience. The characters are wafer thin, and the plot really doesn't hold water.\n\nNonetheless, the gory sequences are gleefully grizzly and, like the original, Walas must once again be commended for his creature effects that made the first film so spectacular. All in all, the film is a damn sight better than it really has any right to be. Especially when you compare it to some piddling sequels you get.",
            "review_date": "2012-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first one but had some very good gruesome special effects. Always felt sorry for that dog!",
            "review_date": "2012-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The camp value isn't as fun as the first film, but there are still plenty of fun laughable moments (:",
            "review_date": "2012-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sequel just fell flat on its face.",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just unnecessary in so many ways.",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "there isnt anything special about this movie, but if you watch it right after the 1st fly movie then you cant ignore it... fair few times you need to turn away from the screen... that poor dog.",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even 1 minute into the movie, and I was already disgusted!",
            "review_date": "2012-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great monster filck. The Fly's design is awesome but doesn't look a thing like the one from the 1986 The Fly. Characters were ok, nothing too special, and the story was fine. A few of the scenes were rather emotional and the ending took a good route this time. A few stupid elements but in the end it's an enjoyable monster movie.",
            "review_date": "2012-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sequel to David Cronenberg's, The Fly is a misfire due to the fact that it just fails to capture the intensity of the original and strips away the tension that was featured so prominently in the original. The film started off well, but towards the middle, the film started to come apart and you could clearly see why the film was doomed to become an unnecessary sequel. After seeing this, you realize that David Cronenberg's remake of The Fly never needed a second part, but at the same time, it peaked my curiosity to see what sequel to that film would bring. Disappointingly, it just ended being a bad film with awful performances, decent, but ultimately cheap looking gore effect and poor directing. The cast do what they can =with such a poorly constructed script, and most of the cast just end botching their performances. This is a stupid sequel that should never have been made in the first place, and it will surely disappoint fans of the original. This is a film not worth your time and it fails to capture the chaotic horror of the original. The film had potential, and if Cronenberg would have made it, and wrote the script, this film would surely have been much better. However it is just really boring with an underdeveloped storyline and poor direction and lacking performances. The Fly II isn't worth seeing if you've seen Cronenberg's movie, and it should have been much better. Instead the film fails at being interesting for the viewer and it lacks anything truly worthwhile that would normally make it a good movie.",
            "review_date": "2012-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like it just as much as the first one but the original is just clearly the better movie",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was a bit let down because David Cronenberg's remake was pretty damn spectacular.  The suspense of Martin becoming the Fly was pretty non-existent and that's what made the first movie excellent because it was more than just a horror movie.  It was more about some guy's psychological breakdown which then turned into a horror movie.  The Fly II's first hour or so was just filler until Martin becomes the Fly, which then the movie pretty much was awesome!  I miss the movies of the 80s and early 90s where the reliance of CG was barely non-existent.  Hollywood needs to start going back to creature and special effects like this.  I do think this movie is worth watching.",
            "review_date": "2012-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it differs from the remake, but its not horrible.",
            "review_date": "2011-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The flm was was ok but I don't think I'll watch it again, it wasn't that good it starred  Eric Stoltz, Daphne Zuniga and John Getz, I don't want this film on DVD, I hated it, crap film",
            "review_date": "2011-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fairly standard and mostly underwhelming sequel to a classic. Gone are the memorable characters created by Goldblume and Davis, replaced by the unimaginative and shallow character creations of dime a dozen acting talent.\r\n \r\nThe story is also unimaginative. Completely typical 'corrupt industrialist will stop at nothing' story, which is a long way removed from the original films innovative sci-fi plot line. The script and creature design also takes a downgrade, and the film is actually pretty boring, as it really only gets good in the last 20 minutes or so.\r\n \r\nThe movie does have some good things going for it. Some creepy moments (the cocoon hatching scene comes to mind) keep it from being a total train wreck, but its still nothing more than mediocre.",
            "review_date": "2011-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has the gore, and is fairly entertaining,  but unfortunately no strong characters at all. Stoltz did his best, its a decent film, should be higher than 26% liked it! Decent for a sequel!",
            "review_date": "2011-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite the pleasant surprise for me to discover that 'The Fly II' isn't a disgrace from the rarefied heights of Cronenberg's masterpiece. 'The Fly II' elects a different route with a furiously mean-spirited monster-on-the-loose saga that ramifies from the original while wrenching pathos for the socially maladjusted Martin who casually asks \"Do you have organic matter?\" to the late-night staff of the scientific facility. In an unexpectedly touching scene, Martin euthanizes a canine that is mangled from the telepod experimentation. Darabont and company inject a lot of wily symbolism with a bug zapper and the flapping sound effects of a helicopter at the opening. When Martin metamorphoses into the fly, it's an insanely fun, grotesque creature-feature with mounds of gelatinous makeup (an acid-dissolving face) and poetic justice for the lead villain. Of course, 'The Fly II' is not the equal of Cronenberg's mesmerizing remake, but it is contagiously enjoyable, heart-breaking and unapologetic in its bloodletting.",
            "review_date": "2011-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should not have been made...but since it was:\n\nThe first half hour or so was quite good, seeing the boy grow rapidly.  But after he becomes a fly hybrid, it all falls apart into a monster in the halls type of scarefest.",
            "review_date": "2011-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cronenberg's remake may have been disgusting, but at least there was subtext to it.  There's none here.  It's a monster movie, plain and simple.\n\nThe plot is very stupid.  It is watchable because Eric Stoltz is a good actor.  And even if the practical effects aren't put to good use, they are pretty fun to watch (why would a giant fly have teeth?).\n\nSo yeah, dumb.  Fun if you watch it with a group of friends.",
            "review_date": "2011-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fairly standard and mostly underwhelming sequel to a classic. Gone are the memorable characters created by Goldblume and Davis, replaced by the unimaginative and shallow character creations of dime a dozen acting talent.\r\n\r\nThe story is also unimaginative. Completely typical 'corrupt industrialist will stop at nothing' story, which is a long way removed from the original films innovative sci-fi plot line. The script and creature design also takes a downgrade, and the film is actually pretty boring, as it really only gets good in the last 20 minutes or so.\r\n\r\nThe movie does have some good things going for it. Some creepy moments (the cocoon hatching scene comes to mind) keep it from being a total train wreck, but its still nothing more than mediocre.",
            "review_date": "2011-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gory, rehash of its predecessor with a much lesser cast. However a pleasant surprise given its terrible reviews. It's definitely not great but its not that bad either.",
            "review_date": "2011-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The effects were the only impressive thing in this movie.",
            "review_date": "2011-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much like the first, albeit lacking Cronenburg's excellent directorial skill to make those moments of horror really go off with a BANG! I did like that the Fly/Human hybrid was shown more, as the first film rushed to the ending once Seth's transformation was complete. However the storybook happy ending was LAME and a cop-out, I wanted the pod to open to even MORE HORRIFYING mutations, Cronenburg would've ended it like that . . .",
            "review_date": "2011-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's about as intense as eating jelly with a fork; so bad it's funny for a while, but then becomes tedious and you hunger for something more...",
            "review_date": "2011-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not as good as the 1st",
            "review_date": "2011-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a sequel, it wasn't as bad as I thought it would be.  Special effects, for the time, were well-done.  The main character kind of compelling.  The love interest...interesting.  The villain, a believable jerk.  I thought it was fairly well handled.",
            "review_date": "2011-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not too bad. I hadn't see it yet and finally watched it. It was more interesting than I expected.",
            "review_date": "2011-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has the gore, and is fairly entertaining,  but unfortunately no strong characters at all. Stoltz did his best, its a decent film, should be higher than 26% liked it! Decent for a sequel!",
            "review_date": "2011-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Making a sequel to one of the greatest remakes of all time seems like a pretty bad idea, but the execution is actually a little better than expected. A young Eric Stoltz stars as Seth Brundle's son, Martin, who is carrying the mutated Brundle gene. Growing up in a lab, by the age of 5, Martin is full grown. The mutation is much more complete this time around and there is more puppet action than before. The movie actually has a pretty strong story behind it and Eric Stoltz does a decent job (though his female co-star is awful). There is some quality blood and some good fly vomit scenes that somewhat makes up for the slow middle act. 105 minutes is a tad long - particularly because the ultimate ending of this film is downright insulting and unfair, 5 minutes shorter and this would be worth 3 stars.",
            "review_date": "2011-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even close to cronenbergs film ....The fly ? Looked more like a fucking lizard to me .",
            "review_date": "2011-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a pretty underated film, but it was pretty decent. This film dug depper in the science of the fly.",
            "review_date": "2011-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, at the start I didn't think I was going to like it... But things quickly turned around, although it fails in comparison to the first it still held up and kept a lot of the firsts style, although this film had a happier ending... I still felt really sorry for that dog... More so than I did for Seth in the first or Martin in this one... Great film to continue the series...",
            "review_date": "2011-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the movie had an interesting concept but it just didnt follow up on the big screen",
            "review_date": "2011-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen some very bad sequels and I have to say that this one ranks among the top twenty worst sequels of all time. Not only was there virtually no point to it but the monster was rather cheesy looking. Aside from the actress who was almost naked (did I mention that she's pretty hott?) there's really not much to look for here. A generous one out of five.",
            "review_date": "2011-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big improvement from the first one.",
            "review_date": "2011-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this work, the plot isn´t strong as in the previous movie, but the success in the visual effects is obvious.",
            "review_date": "2010-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Contrary to what I thought of it when first watching it, 'The Fly II' is not better than the first. In fact, it's more of a science-fiction movie than an actual horror film. But the horror does build up later on.",
            "review_date": "2010-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Apart from the improved special effects, this film has little to offer compared to the first. man turns into fly, fly gets angry and kills people. Ive seen this somewhere before.",
            "review_date": "2010-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my alltime favorite monster movies.",
            "review_date": "2010-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fly II is by no means David Cronenberg's brilliant original remake nor is it the original 50s sci-fi classic, but it is an entertaining and emotional film that follows well in the tradition of its predecessors.  The Fly II follows the life of Brundle, Jr. who inherits the fly/human hybrid DNA from his father.  He grows at an exponential rate and of course begins working on the same teleportation machines that his father initially built.  Despite being somewhat cheesy throughout, The Fly II still manages to develop the story in new ways and elicit genuine emotion like its predecessor.",
            "review_date": "2010-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gross out movie with unintentional comedy.  That poor, poor dog.",
            "review_date": "2010-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Comparing it to the sequel it is definitley alot more violent. Lots of gore and blood. Seeing a mans face being corroded by fly vomit is certainley creepy. The story of this one is about the son of Seth Brundel from the last film and he takes on trying to complete his fathers project of transportation.\r\n\r\nThe story is similar to the last film but doesn't give that same effect. Most of the characters I didn't really get attached to and truely care for which made each death worthless. Compared to the last film it it unfaithful and boring but for visual effects it's a winner. It's filled with sme of the bloodiest effects i've ever seen.",
            "review_date": "2010-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "difficult to stomach this gorefest sequel.",
            "review_date": "2010-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i like it more than the first one, but the end isn't really that special.. is a weird scientific scary film",
            "review_date": "2010-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it has an interesting premise, the movie ultimately falls apart. But not before performing some of the best bloody special effects I've ever seen. Not the best sequel by any means, but not the worst either.",
            "review_date": "2010-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If there is one thing I loathe almost more than remakes, it's a hollow and bland sequel film to a remake. \"The Fly II\" is, unfortunately, just such a beast.\r\n\r\nWe pick up where Cronenberg's creepy remake of this classic horror film left off, as we now follow the exploits of the son of Seth Brundle (played by Eric Stoltz). After his mother dies giving birth to him, he becomes the personal experiment of a greedy businessman (played by Lee Richardson), who is determined to use him to unlock the secrets of his father teleportation device. You know nothing good can come of that.\r\n\r\nRight off the bat, almost none of the characters from the original return to this outing, with the exception of John Getz, who reprises his role as the token jerk. Not a very good sign. Then, you have four screenwriters on the script, which doesn't give you much hope of a solid story. The old adage about \"too many cooks spoil the broth\" is in full effect here, as none of the characters ever really come to life (except, perhaps, a little bit from Richardson's).\r\n\r\nReally, I felt like the cast was sleepwalking through their scenes most of the time. There's no passion or spark in any of the performances. To be fair, to follow up on the incredibly frenetic and passionate energy of Jeff Goldblum's character from the first film, would be a very unenviable task for most actors, but Eric Stoltz never even gets close to anything like it. None of the cast do. Maybe they were as bored with the dialog here, as I was, I don't know. But there's really no standout performances here. There's almost no performances of any kind. They are all just cyphers to the need of the plot (such as it is). Just plodding along until the \"Brundle-Fly\" can come out and play. This is only made worse by the fact that there's no really likable characters in the entire film. Even Stoltz and Zuniga's characters, who are supposed to be the \"heroes,\" never evoked any kind of emotion from me, save apathy.\r\n\r\nDirector Chris Walas obviously wasn't interested in creating the eerie tension and drama that Cronenberg did in the first film, as he opts more for cornball performances and putting all his effort into the special effects. But even there the film is just lacking. You can tell he was trying hard to top the \"gross out\" appeal of the first film, but it never comes off that way. Much of the violence is pretty tame, especially compared to the first film. It comes off more like \"Cronenberg-lite\" and never really satisfies. Even the monster Martin becomes does more to invite laugher, rather than fear and revulsion.\r\n\r\nThis film is just a clear cut case of how one movie's success was used as just cause to create a pointless sequel. Everyone involved here could only have been looking to get a paycheck. It's b-grade horror at its most dull and boring. It's not even \"so bad it's good\" b-grade horror. There's no scares to be had here, nor any humor, save the possibility of the unintentional kind. If you've seen the first film, you certainly don't need to see this one. And if you haven't seen it, go watch that instead of this. The only thing this poor production has in common with flies, is the fact that any kind of crap will usually attract them.",
            "review_date": "2010-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as daddy but I still enjoyed it. One of the best horror sequels I've seen.",
            "review_date": "2010-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not nearly as good as the first but I like it. The ending's AWESOME.",
            "review_date": "2010-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "frankly not a patch on the original but a fairly good romp.",
            "review_date": "2010-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this same way that the original Fly movie did not need a sequel, but got one anyway, the remake gets an unneeded sequel as well.  Don't waste time watching this movie, it's not bad, just annoying.",
            "review_date": "2010-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ok but not on par with original",
            "review_date": "2010-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its over why did they bother if they make a remake i might go see it. but really a giant fly in a military base nobdy can stop it?!?! I would get me a giant fly swater or even a bug zapper !!! Im not scared anymore!",
            "review_date": "2010-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hard to top the first one but still a soild movie",
            "review_date": "2010-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even if Goldblum was a better fly the movie is pretty neat for a sequel. Great special effects & the feel of late 1980s.",
            "review_date": "2010-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even remotely as good as Cronenberg's masterpiece, but still... melting faces. I'm just sayin'.",
            "review_date": "2010-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The horrid acting is worth a few chuckles and the gore a few hurrahs, but, on the whole, this turd has flies all over it.",
            "review_date": "2010-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a sequel, it's not that bad. The story/plot works well as a follow up from the first. The special effects and costumes could use a LOT of work: the teleported dog looked cheesy, the CEO-mutant was too fake, and the evolved Brundle was mediocre. And although the ending gives you a sense of vindication against the company, it really doesn't tell us what happens to the hero. For 1989, the movie was acceptable as a scifi-horror.",
            "review_date": "2010-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sequel trying to cash in on the original, but trying to be exact in almost every way possible. The acting was stale, the plot itself wasn't bad, but it was nothing special either, and the 'fly' in this one just looks plain stupid. As a stand-alone monster, it looked okay, but as a fly, it looked like a green alien covered in spikes. Overall, a very pointless sequel.",
            "review_date": "2010-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Martinfly appears more like an alien than a bug.",
            "review_date": "2010-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh why did i watch this.. total waste of nearly 2 hours. this isn't bad this is freaking terrible! not even the effects could save it, don't waste your time, like i did mine :(",
            "review_date": "2010-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another quest for more money.",
            "review_date": "2010-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as brilliant as the first but still a film to be recognised. The effects weren't great in today's standards but I can see that they would have been amazing when this originally came out. The scene with the mutant dog had me in floods of tears. Great acting from Stoltz and brilliant storyline.",
            "review_date": "2010-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In The Fly (1986), the film was great at the end from leaving us off on a good note. This film ruined that note.",
            "review_date": "2010-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Offers a little bit, but ends up becoming a formulaic unneeded sequel",
            "review_date": "2010-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The scene that stands out to me the most is where Martin Brundle puts the deformed dog to sleep. It's heartbreaking.",
            "review_date": "2010-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As sequels go it isnt actually that bad. its basically a rerun of the 1st film but this time with his son slowly transforming into the fly. Although stoltz is good as the son he really isnt in the same league as goldblum unfortunatly. The effects are pretty much on par, again some decent gore near the end of the film which still stands up to 2day. A decent effort but why bothere when the 1st is so good??\n\ndaphne zuniga bless her hot as hell but not much of an actress",
            "review_date": "2010-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first Fly film is a classic, the second film is stretching the plot a bit, and doesn't come close to first film. It may look a lot better than the first film and when Martin transforms into the fly creature it looks amazing for 80's puppetry, but the film does look cheap. I got bored very quickly and I found the two small boys acting to be terrible. There are a few nice touches, but the bad point out weigh the good. It is worth a watch if you have seen the first film, just don't expect to much.",
            "review_date": "2010-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is what it is, a cheaper follow-up to it's predecessor.\n\nI loved it when I was younger, but it hasn't aged as well as the 1986 film.\n\nThe overall story is ok though and the last 30 minutes are particularly good fun, with some quality gore.",
            "review_date": "2010-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just ok sequel skip this see the first.",
            "review_date": "2010-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not anywhere near the quality of the remake or original. But far better than the original sequel.",
            "review_date": "2010-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fairly standard and mostly underwhelming sequel to a classic. Gone are the memorable characters created by Goldblume and Davis, replaced by the unimaginative and shallow character creations of dime a dozen acting talent. The story is also unimaginative. Completely typical 'corrupt industrialist will stop at nothing' story, which is a long way removed from the original films inovative sci-fi plotline. The script and creature design also takes a downgrade, and the film is actually pretty boring, as it really only gets good in the last 20 minutes or so. The movie does have some good things going for it. Some creepy moments (the cocoon hatching scene comes to mind) keep it from being a total trainwreck, but its still nothing more than mediocre.",
            "review_date": "2010-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Schlocky, but as a B-grade horror flick it's kind of fun.  Stoltz is good, and Chris Young's gothic score one of his very best.",
            "review_date": "2010-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, at the start I didn't think I was going to like it... But things quickly turned around, although it fails in comparison to the first it still held up and kept a lot of the firsts style, although this film had a happier ending... I still felt really sorry for that dog... More so than I did for Seth in the first or Martin in this one... Great film to continue the series...",
            "review_date": "2010-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining but not as good as its prequel.",
            "review_date": "2010-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Chris Walas film sure is odd. Good Christopher Young score...",
            "review_date": "2010-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nothing will top Jeff Goldblum's version!!!",
            "review_date": "2010-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whereas the original is one of the greatest modern horror films of all time, this sequel is is a schizophrenic mess. The first 75 mintues is essentially a drama about a guy who ages too fast, and then it suddenly becomes a gory slasher film with a half fly/half human killer. Awful, but its campy fun.",
            "review_date": "2010-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original is far superior, however, this is a great film in many respects. I found it very different and i loved the way it continued from the first movie. Even better gross effects this time round too.",
            "review_date": "2010-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "points for eric and daphne. the rest is crap.",
            "review_date": "2010-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent sequel!  Creepy and it really takes things to the next level in a cool way!",
            "review_date": "2009-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first one, but still interesting to watch, what with the transformation and the creatures (\"Timex,\" Martin as the fly, and the Bartok creature). And it seems like this one is more violent and gory than its parent film.",
            "review_date": "2009-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That was a horrible sequel. You couldn't feel for the dog even when that scene with the fly-dog was meant to be sad. To make matters worse, it's too dumb and gory.",
            "review_date": "2009-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a great movie. The fly 1 & 2 are classics in sci-fi.",
            "review_date": "2009-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The overall tone is a bit disjointed, but as far a sequals go it's not too bad.",
            "review_date": "2009-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "better outing for me from the first film",
            "review_date": "2009-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "now that I have seen 1 and part 2 of the Fly\n        both good",
            "review_date": "2009-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that completely builds on the theories and science dealt with in the first. Instead of becoming a cheesy monster movie, it adopts more of a sci-fi feel. This makes the movie intelligent and furthers the plot rather than destroy its credibility. Eric Stoltz as the son of Seth Brundle is some great casting, he completely takes the reigns of Jeff Goldblum and does something unique as well. While there is fly transformation, it feels believable and not goofy. This may not have the unique style of David Cronenberg, but it has something equally cool behind it.",
            "review_date": "2009-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alright, so any sequel to a commerically successful horror movie with hidden human depths is going to be doomed to inferioty. It's a one trick pony, pulled off brilliantly by Cronenberg's original. What the Fly 2 does it accept essential the movie to be a scructual clone plotwise of the original movie, take the most successfl elements to set a credible begining half to the movie, and the second a condensed B-movie horror. And it works brilliantly. If I watched another movie struggle to emulate Cronenberg's vastly underatted, if critically popular, horror tradegy I'd lose interest. Only Cronenberg could of produced such an effecting drama with horrific overtones. Sure, it ain't the best horror sequel, or the best horror movie as a stand alone. But it features a very strong performance from Eric Stoltz as Brundlefly's offspring, very strong technical effects for the time from director Chris Wallas, the usual horror 80's faux pas with some brilliantly effective gore for a commercial horror movie and solid if simplistic story developments and direction . Of course, many looking for a sequel somewhere on par to The Fly may not be satisfied with this movie. It lifts \nkey points from the original story and continues it through Stoltz effecting performance, and revelling in more standard gore shocks than The Fly, Wallas directing debut makes a success out of the original's key plot elements in this picture without making a solid commitment to either. Neither tragic horror, neither fullblown generic creature feature movie. \nIn fact the only criticisms I have of the movie in a serious vein is that the insect/human hybrid itself never looks convincing, as in the first movie. While it certainly moves better technically, I never felt enough time was spent actually on the space bugs themselves to make them look convincing, although I do prefer this space bug due to a much more forboding size. But the design certainly doesn't spoil the picture for me. A B-movie in monster tone with some solid acting and strong execution for the time, The Fly 2 produces what is in effect a monster movie rather than tragic horror with more positives than negatives.",
            "review_date": "2009-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not all that bad for a sequel surprisingly. The plot is good and it really picks up in the later half with tons of cool gore effects and an interesting ending. I would recommend this to anyone who enjoyed The Fly.",
            "review_date": "2009-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "okay , not as good as the Jeff goldbloom version",
            "review_date": "2009-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lame sequel but not as bad as you'd think.  Thanks in part to seeing Stoltz and Zuniga.  C-",
            "review_date": "2009-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first, but still fun & with a bit of gore.",
            "review_date": "2009-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Price was EXCELLENT, Goldbloom was very good, this was a piece of crap.",
            "review_date": "2009-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not as good as the first but ah man what's with that dog !!!",
            "review_date": "2009-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie tells a fictional story about what happens when you engage in unprotected sex.  The beginning & ending of the movie was extremely gory & squeamish.  If you're a true horror fan, this see this movie.",
            "review_date": "2009-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've never seen the ORIGINAL original, but I'd always been a big fan of the 80's remake of The Fly, so I watched this one first chance I got and wow....can't believe all the bad ratings and reviews. The creature looks awesome and I loved everything about this movie. One of the more underrated sequels of all time.",
            "review_date": "2009-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If not for the mindless gore this movie would have been a bigger piece of shit than it already was.",
            "review_date": "2009-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like a fly buzzingly irritating around your living room this sequel was never welcome from the start.  Cheap, shoddy with a human/fly meld that looks more like an oversized Gremlin, oh hang on wasnt Chris Walas also responsible for creating those mischevious critters?  Indeed he was.  Eric Stoltz does not make for an engaging lead so thank God for the brief appearance from John Getz who delivers more of a performance in his measly couple of minutes than the rest of The Fly II's cast put together.",
            "review_date": "2009-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this awful film, many terrible things are included. The acting is good, but the plot, script, and dramatic sequences are not. Skip this entirely.",
            "review_date": "2009-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seen it all before, really.",
            "review_date": "2009-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as eccentric as the first one, however a good follow up.",
            "review_date": "2009-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not as good as the first one was butcherd by the b.b.f.c. when released at cinema",
            "review_date": "2009-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "they killed a dog so i had to abandon my viewing.",
            "review_date": "2009-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first \"Fly\" with Jeff Goldblum was incredible.  This was close to garbage.  Eric Stoltz was pretty bad.",
            "review_date": "2009-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those sequels, like Men In Black II, that suffers from the original being so excellent.  The Fly II is well worth watching, but it simply cannot measure up to the masterpiece that Cronenberg's The Fly was.  So, audiences hated it more than it should have been hated.  While it does not benefit from two charismatic leads and relies more on shock and gore than disturbing horror, it still retains the spirit of the first.  Check it out.",
            "review_date": "2009-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As sequals go its just as good as the first film, but thats because its pretty much the same film.\r\n\r\nTheres not much new to offer us apart from slightly better special effects.\r\nStill the cast is great, Stoltz puts on a decent performance as Martin Brundle, son of Jeff Goldblums Seth brundle from the first film.\r\n\r\n Its a decent film with a great cast, so not much to complaine about at all.\r\nWell worth your time, if you enjoyed the The Fly.",
            "review_date": "2009-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Again!? Swatter please!",
            "review_date": "2009-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One really disturbing scene from when I was a kid was with a dog that was experimented on, it stuck with me",
            "review_date": "2009-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as sequels go, this is pretty reasonable. Obviously not as gory or as well written as the first one, but it does have a decent pace to it and Eric Stoltz pulls off the character pretty well.",
            "review_date": "2009-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The offspring of deceased scientist Seth Brundle is growing up at an accelerated rate, and after reaching the human age of five but looking much older, starts the inevitable metamorphosis into an upright walking fly creature that seeks revenge on the two-faced, rotten scientists who pretended to be his friends.\n\nThe child, named Martin by the scientists, is played at different ages by Matthew Moore, Harley Cross, and Eric Stoltz. At five Martin also finds his first love interest, a lovely night shift computer file clerk played by Daphne Zuniga.\n\nI thought it was a fairly intense and entertaining creature feature even if debuting director Chris Walas, creator/designer of the special effects, is not in the same league as David Cronenberg. I think it could have been worse. Performances are reasonably good, even if the villains are one-note and unimaginative.\n\nProbably what I got more out of it than anything else was a certain visceral pleasure in seeing a bunch of jerks and otherwise expendable characters get their just desserts.\n\nNot as good as the first movie but not that bad either.",
            "review_date": "2009-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad sequel.See the first one instead.",
            "review_date": "2009-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not incredibly terrible as far as sequels go. At least it has throwbacks to Goldblum's movie, thereby at least attempting to create a sense of chronology.\r\nHuh...I never noticed until now just how many O's are in the word chronology.",
            "review_date": "2009-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was not a big fan of the original and I liked this one even less.",
            "review_date": "2009-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "purchased (scrap it - sex scenes)",
            "review_date": "2009-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was so bad. they really shouldn't do sequels to suspenseful movies",
            "review_date": "2009-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chris Walas, the makeup and animatronics director on David Cronenberg's remake of The Fly, takes a stab at directorial duties in this sequel. Before Seth Brundle morphed into scrap metal in the original The Fly, he managed to leave behind the seed of his legacy, and at the start of The Fly 2 his son, Martin (Eric Stoltz), has suffered an accelerated growth, thanks to his fly genes. Although played by Stoltz, Martin is supposed to be only five human years old, and unaware of his imminent transformation into a fly.",
            "review_date": "2009-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish this was called â\u0080\u009cSon of the Fly.â\u0080\u009d That would make it a lot more cheesy and awesome. I found it to be a good attempt at a sequel to a movie that would not be easy to make a sequel to.  Not as disturbing as The Fly, and not as gory. Also not as realistic. The end of The Fly II is tries to be like the movie Alien, but doesnâ\u0080\u0099t quite have the same effect.  I suggest sticking with the first Fly.",
            "review_date": "2009-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible....Vincent Price would kill these guys for making this piece of shet!",
            "review_date": "2009-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a realy good monster movie",
            "review_date": "2009-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When compared to the original (remake), this movie is god-awful. But when taken as its own film... it's still god-awful.",
            "review_date": "2009-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fly was clearly better but this one was good to watch I am just glad they did not go on making the movies Saw style. Stopping while they were ahead was a good move.",
            "review_date": "2009-03-18",
            "source": "rt",
            "lang": "en"
        }
    ]
}