{
    "rating": 9.0,
    "release_date": "Invalid",
    "num_reviews": 450,
    "genres": [
        "English"
    ],
    "summary": "Shaun (Thomas Turgoose), who lost his father in the Falklands War, earns the respect of skinheads when he stand up to their teasing. He becomes part of the gang and enjoys hanging out with his new friends. Trouble starts with the return of Combo (Stephen Graham), a racist ex-convict. With the gang divided into two factions, Shaun sides with Combo and, unfortunately, finds in him a father figure.",
    "reviews": [
        {
            "content": "Enjoyed this one. Very touching and hard hitting in certain spots. Silly and fun in other spots. Well balanced movie right here. \n\nWhat kind of mother lets her kid hang around with much older skinheads? What kind of mother lets her kid hang out so late at night? What kind of mother doesn't even bat an eye when her 12 year old son starts to date a much older girl? Awful parenting right there. \n\nWasn't aware of this particular war until I saw this film. Looks like England was in really bad shape at the time. It looks like people were really lost and felt hopeless. All this hopelessness coupled in with resentment towards immigrants, made it hard for everyone.\n\nThis anger lead Combo to go down the path that he did in the movie. He felt that so much was being taken from England. He felt like England had lost its way as a country. So much being taken from the Englishman and he wanted revenge. \n\nPoor little Shaun, his father died in the war, his mother is horrible and he has skinheads as best friends. Despite this all, he still manages to be somewhat good. You can clearly see he's a good boy. He just had a lot of bad influences and no real authority figure. He has a good heart, and is very charming with Smell. \n\nThomas Turgoose (Shaun) was so young (at the time) and play his part even better than any adult would/could. \n\nMy favorite scene was the one where they were hanging out and Shaun makes out with Smell. He takes her out and is a perfect little gentleman. It wasn't anything major, just thought it was really sweet. Plus, Smell was funny with last few lines in the scene. \n\nAnother great scene was when Shaun and the boys go \"hunting.\" They find themselves in the auditorium of an abandoned school. They all shoot gadget with a BB gun, and the he clocks Shaun. Everyone gets angry at him and he eventually apply to Shaun. To me, this marked the beginning of Shaun being fully accepted into the group. They all hug at the end of the scene, which was both sweet and funny. \n\n\nThe music in this movie was awesome. My kind of jams. \n\nThis film is perfectly balanced and is a damn good watch. Can't wait to watch the rest of the series. I highly recommend this. \n\nThis gets a LennyReviewz Score of: 8/10",
            "review_date": "2023-02-01",
            "source": "rt"
        },
        {
            "content": "BRILLIANT BRUV CRACKING MOTION PICTURE THAT LITTLE BLOKE SURE KNOWS HOW TA PULL A BIRD",
            "review_date": "2022-05-27",
            "source": "rt"
        },
        {
            "content": "A tough, heartbreaking coming of age story. A tough study on the indoctrination of youth into cult politics based on ignorance and prejudice. The kind of numb minded hatred even more familiar in 2022. A film about a hateful, dumb and lazy white fringe who feel hard done by. A national front who want handouts but resent them going else where. And it still manages to be poignant and heartfelt. Magnificent lead performances.",
            "review_date": "2022-04-23",
            "source": "rt"
        },
        {
            "content": "A slice-of-life study set in the early 1980s. It was okay.",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "A- ~ At times it felt like I wasn't watching a movie but rather real people. This style of story-telling won't be for everyone but I still enjoyed it a lot, especially for someone who grew up in the U.S. and his lived here their whole life.",
            "review_date": "2022-03-03",
            "source": "rt"
        },
        {
            "content": "Great cast, feels real, awesome soundtrack, you must watch the TV show from the same director, cast and continuation of the movie story. Rough, funny, stressful, a real experience.",
            "review_date": "2022-02-15",
            "source": "rt"
        },
        {
            "content": "In This is England, a young Thomas Turgoose makes a remarkable acting debut as Shaun Fields, a morose 13-year-old desperately trying to come to terms with constant bullying at school while also navigating his emotions in dealing with the death of his father.  While the film deals with our innate need for a sense of community and the protection it provides, it also deals with the mindless hate, senseless violence and a vicious subculture that exists in an impoverished area of northern England.  Despite its poignancy, it is a tough and gritty coming of age film with a timeless message that rings true not only in Margaret Thatcher's England, but, to some degree, in all of our lives.",
            "review_date": "2022-01-26",
            "source": "rt"
        },
        {
            "content": "Stephen Graham at his best . Great cast great story . Good music",
            "review_date": "2021-06-28",
            "source": "rt"
        },
        {
            "content": "Such a fascinating movie, I have seen way to many movies about how USA dealt with   defeat in Vietnam and Cold War. It is so refreshing to see a movie that shows that they were other people fighting others wars, literally and internally also. The decision to follow the story trought the eyes of a young boy trying to find its path and fit in makes for an engaging and captivating viewing experience.\n\nI hope in the near future I get to see more of this \"coming of age\" movies outside of USA, they are fascinating to me.",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "This is England - Gritty, raw and exceptionally honest.\n\nMeadows captures the poignant truth of the 1980s skinheads.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "A brilliant piece of filmmaking. Troubling and difficult to watch but superb plot and some sensational acting from everyone to be fair. A rare film without a weak performance. Felt all too disturbingly real.",
            "review_date": "2020-05-20",
            "source": "rt"
        },
        {
            "content": "Great characters. I really loved this movie.",
            "review_date": "2020-05-19",
            "source": "rt"
        },
        {
            "content": "Tout est incroyable dans ce film où Shane Meadows maîtrise sa caméra au millimètre près. Les plans sont toujours bien maîtrisé et nous préservent de sortir  de l'immersion des bas fonds de l'Angleterre punk des années 80. Le jeu d'acteur est brillantissime ; On s'attache aux pire des salauds et le protagoniste attachant nous déçoit. Une réussite à tout points de vue.",
            "review_date": "2020-05-07",
            "source": "rt"
        },
        {
            "content": "This movie was surprisingly good like really good and it was quite a powerful movie aswell.",
            "review_date": "2020-04-10",
            "source": "rt"
        },
        {
            "content": "Crazily realistic, relatable, and emotional. Brilliant acting and an accurate portrayal of the time make for an excellent drama.",
            "review_date": "2019-12-22",
            "source": "rt"
        },
        {
            "content": "This is a kind of underground movie about kids growing up in England. Very good actors/acting set in the 1980's. Kind of punk rock and centers around a young boy named Shaun that finds a group of other kids that take him under their wings. Good soundtrack/music I saw this movie out of the clear blue sky went with it and loved it. I seen it a few times and would def. watch again go give it a watch.",
            "review_date": "2019-12-15",
            "source": "rt"
        },
        {
            "content": "The film has many autobiographical elements drawn from the filmmaker's experience in real life. This Is England is not as graphic as it could be, but there is still a scene that could disturb some viewers. The film's biggest failings come near the end and are easily forgiven in light of how compelling the rest of the picture is. There are also moments of humor (such as Shaun's clinch with Smell) and joy (Shaun's early days with the skinheads, before Combo's arrival). He's also careful to limit the racist rhetoric while providing an understanding of some of the reasons underlying the hatred that bubbles to the surface. In addition to telling an involving story, This Is England is insightful and informative. Despite a somewhat rushed ending, the movie does an excellent job not only illustrating how easily hatred can be fostered in the young but chronicling the transformation of skinheads from a reggae-loving nationalistic cult to the military arm of neo-Nazi groups.",
            "review_date": "2019-12-02",
            "source": "rt"
        },
        {
            "content": "Hilarious, entertaining and unique. Accurate representation of lower-class Britain in the 80's. a must watch. ",
            "review_date": "2019-06-29",
            "source": "rt"
        },
        {
            "content": "A relic of its time.",
            "review_date": "2019-04-02",
            "source": "rt"
        },
        {
            "content": "Northern scouse working class friends. Set during the 80s. Challenges are faced for each character, experiencing a range of events.",
            "review_date": "2019-01-18",
            "source": "rt"
        },
        {
            "content": "This is... really something!",
            "review_date": "2018-11-01",
            "source": "rt"
        },
        {
            "content": "But things don't really change #1983 same shit different heartless tory hag.",
            "review_date": "2018-10-08",
            "source": "rt"
        },
        {
            "content": "A drama story in which boy becomes friends with a gang of skinheads. Friends soon become like family, and relationships are pushed to the limit when a racist ex-convict returns, but Shaun, unfortunately, finds in him a father figure. It is a complicated and tough movie, and although not without its controversies, it is interesting to see the emotional and honest development of a young character discovering racism, nationalist views and violence and then realizing nothing good ever comes from that.",
            "review_date": "2018-08-02",
            "source": "rt"
        },
        {
            "content": "Absolutely incredible",
            "review_date": "2018-01-17",
            "source": "rt"
        },
        {
            "content": "Wow, so realistic, incredibly joyful and then incredibly painful, then a little bit of hope again. An amazing look into the perspective of racist skinheads than can make you actually empathize with them without agreeing with them. Shows how racism and violence come from a place of pain, fear, and \"emasculation.\" Be warned, there is some definite pedophilia in here between the main character and an older girl, it's uncomfortable to watch.",
            "review_date": "2018-01-12",
            "source": "rt"
        },
        {
            "content": "amazing movie to begin with. but some aspects could really be aproved on in my opionin. like the over dramatic music. also is there no clear ending as to what really happend. and also what happend to al the characters.",
            "review_date": "2017-10-20",
            "source": "rt"
        },
        {
            "content": "Shane Meadows best work yet. Can watch this film over and over again.",
            "review_date": "2017-07-11",
            "source": "rt"
        },
        {
            "content": "Splendid cinematography and great music to give you the 80s feeling necessary, characters to fall in love with but a bit of a shallow look on an ideological level.",
            "review_date": "2017-03-16",
            "source": "rt"
        },
        {
            "content": "Amazing movie. Great acting, great story, great direction, great soundtrack, just great overall. I could watch it many times and never get bored.",
            "review_date": "2017-01-05",
            "source": "rt"
        },
        {
            "content": "Simply brilliant in it's own essence-- \"This is England\" is truly one of a kind.  The acting transcends that of the everyday movie and leaves the viewer with the impression that this movie is alive.  The film offers a history lesson as well as a story with a solid plot, leaving one with the feeling that there are very few films that offer such a profound understanding of the world.  Evoking an intense sympathy with the story's protagonists, it makes one wonder about the sociological aspects of his or her own life and what really is childhood.",
            "review_date": "2016-12-26",
            "source": "rt"
        },
        {
            "content": "An all around very well made film, in terms of cinematography, gritty realism mixed with humor, and especially in terms of conviction-filled performances.",
            "review_date": "2016-12-04",
            "source": "rt"
        },
        {
            "content": "As utterly captivating as it is heartbreaking. Thoughtful, confronting, challenging, at times gleefully funny, other times vividly tragic, but above all memorable and rewarding.\nThe musical theme by Ludovico Einaudi is a suitable classic for the ages.\nThis one stays with you, for good or bad.",
            "review_date": "2016-11-23",
            "source": "rt"
        },
        {
            "content": "This Is England paints a gritty working class picture of 1980's England, a picture rarely seen in mainstream cinema and for that alone it has to be credited. It's a very well made low-budget film and it's directed to perfection, with Shane Meadows getting the most out of a very promising cast. \n\nIt's a story that evokes strong empathy towards the characters and it's the performances by the main cast, in particular Thomas Turgoose and Stephen Graham, that enhance this empathy further. \n\nThis Is England has a unique style,  it's set in a unique time and it revolves around a unique set of individuals that have been 'let down' by someone or something, weather that be a loved one or the government. The main reason I enjoyed this film is because there is so much you can take from it as an individual. \n\nAt the time of it's release I truly believed Shane Meadows had created something special and since then he's gone on to make multiple critically acclaimed spin off TV series of the film. All of which are fantastic.\n\nOne of my favourite British films of all time.",
            "review_date": "2016-10-19",
            "source": "rt"
        },
        {
            "content": "Wanna see a great movie? Well come aboard, This is England is a great movie with lots of funnies, touching moments, and racial violence, A good laugh.",
            "review_date": "2016-01-13",
            "source": "rt"
        },
        {
            "content": "The movie takes you back to the 80's, when England was convulsed \nby a social and political revolution. The grey/cold atmosphere and \nthe top acting only add up to the drama. Don't watch this if you're looking \nfor a feel good flick.",
            "review_date": "2016-01-06",
            "source": "rt"
        },
        {
            "content": "How real. How cute. How poignant",
            "review_date": "2015-11-09",
            "source": "rt"
        },
        {
            "content": "A very moving film about the working class youth in the 80's but focuses on one young boy being brainwashed into becoming a skinhead, The acting was great but the script felt sloppy in places and the story even though was gripping didn't really go anywhere and the ending was predictable and abit lackluster, The humour added was just enough to keep it feeling fresh, Overall it's a good film just overhyped mainly down to the plot not going anywhere.",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "A fantastic piece of British drama.",
            "review_date": "2015-09-26",
            "source": "rt"
        },
        {
            "content": "'Anger is an energy' once bellowed the brilliant lungs of a certain anarchist in circa 1983 - the very same year that Shaun (Thomas Turgoose) got his first pre-adolescent rebellion shave.  We forget so casually the importance and positive contribution of anti-establishment groups in our society, even now in times of political disenchantment. Meadows, in my personal opinion, the only kitchen-sink-realist to long linger over unpalatable subject matters; other same-field filmographers likely too cautious of criticism to venture down the unlaundered pit-holes of scream-telling debauchery.   'This is England' all four chapters, the cast maintain a solid unity though they truly are one big family on the whole, despite individual struggles and the dangerous obscure presence of Combo, whose self-admittance to frequent asylum to protect himself and society, (from himself) a poignant twister that Meadows own emotional IQ Oscar-triple worthy!.",
            "review_date": "2015-09-25",
            "source": "rt"
        },
        {
            "content": "This Is England is most definitely one of the very best British films of the twenty-first century, and for me ranks as Shane Meadows most outstanding to date. Meadows draws on his own personal experiences as a skinhead during the early 1980's. This Is England is set during the summer months of 1983 at the time of \"Thatcher's Britain\" and indeed the era of the skinheads, punk, racism and fascism.\n\nShaun (Thomas Turgoose) is a lonely 11 year old kid growing up on a rough council estate in the North Of England. He is grieving the sudden loss of his father after he was killed in the horrific Falklands War. Encountering incessant bullying at school, Shaun meets a gang of friendly, multi-cultural, dope-smoking skinheads, headed by Woody (Joseph Gilgunn) who immediately are drawn to his sadness and confusion and subsequently take the boy under their wing. However when one of the gang's old members Combo, (Stephen Graham) a vicious, racist thug and bully, is released from prison, Shaun is manipulated by Combo's way of thinking and racist attitude and turns into a thug himself, convinced he would be making his late Dad proud. After Combo brutally beats up Shaun's friend Milky (Andrew Shim) and exposes his own deep vulnerability and unbalanced mental state, Shaun comes back down to earth (and his senses), realising the lifestyle he'd been leading was not really for him, nor would it have made his Dad proud.\n\nThough the first half of This Is England is touchingly funny, drawing on the allure and fun of being in a gang, the second half soon makes way for a much darker, raw and gritty nature, with many violent episodes, highlighting the brutally stark racism that existed at the time (and still does unfortunately!. Shane Meadows shrewdly evokes the total working-class despair of \"Thatcher's Britain\", capturing the era impeccably well and is all impressively authentic in detail.\n\nLike every other of Shane Meadows absolutely superb films, the acting and dialogue is astutely naturalistic, drawing you in from the opening scene. Most outstanding of all is the immensely talented youngster Thomas Turgoose who's almost stark performance never once shrinks from being anything but powerful and convincing. Indeed the cast are all thoroughly excellent that includes another notably powerful turn from the ever-brilliant Stephen Graham as Combo; Joseph Gilgunn as the lovable, kindly rogue Woody who is the leader of the gang that Shaun first joins and who also refuses to be brainwashed by Combo's unhinged way of thinking and racial hatred; Jo Hartley as Shaun's mum Cynth who upon meeting the gang headed by Woody becomes charmed by them , after having had serious reservations when first seeing her young son with a shaved head; Andrew Shim as the friendly Milky; Vicky McClure as the more sensible, level-headed Lol and Rosamund Hanson as the eccentric but likable Smell.\n\nTruly an out and out masterpiece, This Is England is an often funny, often shocking and often deeply moving portrait of a moment in British cultural history.",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "because this is england.",
            "review_date": "2015-06-06",
            "source": "rt"
        },
        {
            "content": "Great movie that shows there's a difference between skinheads and naziskins!",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "Preachy and awfully predictable.  The movie is fun to watch, it is a true narrative that resonates with our 21st century concerns well enough, but the over-simplification of the case against mass immigration and character assassination of the \"wrong side\" leaves a lot to be desired.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "Well the pro critics were short stroking themselves over this one, as they invariably do with films of this genre. Phrases like \"Gritty realism\" and  \"Bleak nihilism\" are their stock hackneyed response, a substitute for any real insight or thought.\n\nIts a joke, this is not England, or any other part of the UK for that matter. Its a staple of British film making. We make two films in the UK, Richard Curtis froth i.e the British are a nation of quirky eccentrics or dross like this. The insight into working class Britain in the Thatcher era is a conceit. Written by someone from the middle class who once had a friend at Uni who claimed to have had a working class pal. It reveals more about the bourgeois creatives who made it than it does about its supposed subject. The characters are drawn from the imagination of people who have no experience of the subject matter.\n\nIt would have been lapped up by a middle class audience who simply wanted to be assured that things are tough at the bottom, that racism is the Lingua Franca of the dispossessed underclass despite the fact that the underclass are as diverse as this film isn't. You know the kind, they give a fiver a month to educate some kid in Africa, but would start writing to their MP if the local Council tax - which helps pay for local education - went up by that much.\n\nThis is England, but only in the mind of the writer. The truth is far uglier and the finger points at the perpetrators and receiving audience  of this sanitised  ego massage to middle class hypocrisy.",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "Powerful and often unsettling British drama.",
            "review_date": "2014-12-31",
            "source": "rt"
        },
        {
            "content": "Shane Meadows tells an intimate, yet unrelenting, story about desperately wanting to belong, the racial conflict that still remains in the west, and the pains of growing up.",
            "review_date": "2014-12-17",
            "source": "rt"
        },
        {
            "content": "Original for this genre with the good sense of not only tell stories about the England past, but also with another principal story that make us indirectly reflect about what really is England and English people. However The environment depicted is not the most attractive for the spectator.",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "Original for this genre with the good sense of not only tell stories about the England past, but also with another principal story that make us indirectly reflect about what really is England and English people. However The environment depicted is not the most attractive for the spectator.",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "If \"This Is England \" as the title boldly announces, then England must be a steaming mound of crap.\n\nPredictable story of \"Good kid falls in with bad crowd\" offers nothing new to the genre, other than a backdrop of Thatcherite gloom.\nAvoid.",
            "review_date": "2014-10-15",
            "source": "rt"
        },
        {
            "content": "This is England is the British Version of American History X. A truly remarkable film about a English kid growing up in England during 1983 war. Very touching and compelling at times.",
            "review_date": "2014-08-29",
            "source": "rt"
        },
        {
            "content": "Un film che molti dovrebbero vedere e rifletterci su un poco.",
            "review_date": "2014-08-13",
            "source": "rt"
        },
        {
            "content": "The discontent season of the hoodlums;social critic in the vein of Trainspotting",
            "review_date": "2014-08-13",
            "source": "rt"
        },
        {
            "content": "8,5/10\nextraordinary",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "Instead of paying to go see bloody Boyhood, stay home watch this! (dont forget to watch the miniseries too!)",
            "review_date": "2014-07-21",
            "source": "rt"
        },
        {
            "content": "This is england will have your jaw dropped for an hour",
            "review_date": "2014-06-27",
            "source": "rt"
        },
        {
            "content": "Solid performances and a really good neo-realist story of a common reality in England",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "A vividly painted portrait of the 1980's England youth movement that poignantly and boldly examines cultural and political issues against the backdrop of a coming of age tale that'll tug at your heartstrings for better and worse. The definitive product of Meadows career and much of the cast's too for a set of electrifying performances, the best of which goes without doubt to Thomas Turgoose's extraordinary debut.",
            "review_date": "2014-05-16",
            "source": "rt"
        },
        {
            "content": "so f****king british(possitivly said)",
            "review_date": "2014-05-10",
            "source": "rt"
        },
        {
            "content": "Humane, complex filmmaking by the Midlands maestro Shane Meadows.",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies of the 21st century so far.",
            "review_date": "2014-04-25",
            "source": "rt"
        },
        {
            "content": "Grade:Low 8/10\n\nThis Is England is a strong drama about skinheads and the affect it's\nmembers can have on youth and other such things. The drama is strong\nbut the ride is worth it making you think long and hard and really\nponder what can turn humanity to certain things and what some people\nwere like in the near past and even today. I felt as many others did\nthat the film was very good, I think some will absolutely love this\nfilm, it isn't enjoyable(that is the wrong word), it is a moving drama,\nand here's why I think it was a very good one of that.\n\nThe story is a good pace and doesn't really drag at any points in\ntruth, by the end you think about what you have seen and if you truly\nwatched it then it should make you think about how crazy some people\nwere in this film, and all the way through you can kind of get annoyed\nwith how some people in this are manipulated so easily and forced to\njoin sides. With some fun characters in the lighter moments, the film\nmakes for a sweet main plot with the main character Shaun, but a dark\nand very dark of that vein with Combo, truly worth a watch if only for\nthem two.\n\nThe acting is good and Stephen Graham as the maniac of a skinhead Combo\nis great and although doesn't dominate the rest of the cast, probably\ngives the best performance. I felt the entire main gang are good and do\nthere job really well throughout, with quirky people and angry people\nit makes for good balance that can shock the viewer. To say the cast is\nmainly from TV work they do an excellent job in transition to such a\ngood drama, truly worth a watch as I say.\n\nShane Meadows directs this well with some great well directing and\nmoves the entire cast round really well. Meadows also writes it well\nand basically creates the wide variety of characters we see with\nhauntingly brilliant vision. I loved the location as it is based on a\nworking class estate and they find some brilliant places coupled with\nbrilliant shots too really show off the surroundings and even some\nshots and editing skills make the characters move so well and it all\nflows together nicely.\n\nAny bad things, I felt that although no real criticism comes in, you\ncould always argue it sometimes turns from really light moments to dark\nmoments in a click and that certain characters are just over the top\ncrazy. I can't really prove that but hey, it is up to you the viewer to\ndecide truly what you thought about it so maybe you can find any major\ncriticisms.\n\nI think those who are from these kind of background will enjoy it, and\nespecially those from the 80's who I feel will love the nostalgic joy\nride. I think for those who like good drama will enjoy and people who\nlove darker tone films with a sprinkle of funny moments will also enjoy\nthe parallel genres. If you dislike swearing and a lot of violence or\nracism in a film, then avoid it because it is full of it, it is key to\nthe plot for it to be there but just a heads up to those who dislike\nit.\n\nOverall a low 8/10 meaning it is Safely Very Good, I felt some will think this\nis great, and others will dislike it for it's tones but it should be\nliked by the majority I would guess. Think about the messages this film\nportrays, and if you are from England like myself, you will see that\nyou can feel shocked that this kind of thing was around not long ago.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "I am willing to call it a masterpiece - The 400 Blows of British cinema, this is a film that perfectly captures Britain during the reign of Thatcher, and its crudeness and vulgarity is not style but plain and simple truth.",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "When it works, it works fine, but when it doesn't, it feels emotionally excessive and unrealistic, kind of like a made-for-TV movie. (In what world would a nationalist racist gang let a twelve-year-old join them, and then threaten storeowners and smoke blunts with him, ever?)",
            "review_date": "2014-04-07",
            "source": "rt"
        },
        {
            "content": "Hermosa película de Shane Meadows, ambientada en un grupo skinhead nacionalista inglés de principios de los 80's, coincidiendo con la guerra de las Malvinas y el gobierno de Thatcher. Aborda magistralmente temas como la violencia, discriminación, racismo, nacionalismo, entre muchos otros. Un excelente proyecto independiente que todos deben ver. 100% recomendable.",
            "review_date": "2014-04-01",
            "source": "rt"
        },
        {
            "content": "potent...intimate...unsentimental.. bloody good cinema...",
            "review_date": "2014-03-27",
            "source": "rt"
        },
        {
            "content": "Funny, touching, gritty and downright brutal. Although some of the acting is a bit dodgy here and there, the superb performances of Stephen Graham and Joseph Gilgun more than makes up for it. A truly beautiful film from Meadows.",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "Here is a British film that focuses on the historical period of the Falkland Wars when Lady Thatcher was the prime minister.  That is the macro-political situation.  The film follows a young boy who joins a group of skinheads as he is unable to fit in anywhere else.  Some powerful moments and good filmmaking.",
            "review_date": "2014-03-06",
            "source": "rt"
        },
        {
            "content": "Very powerful film that brings back lots of memories for those born in the 70's\n\nCan't believe we wore clothes like that!",
            "review_date": "2014-02-25",
            "source": "rt"
        },
        {
            "content": "A well-made coming-of-age drama set in 80's England. The acting is excellent throughout, and the story is engaging with some colorful characters, but tends to get preachy and capitalizing too much on \"politically correct\" conclusion.",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "A street wise 12-year-old kid falls in with a group of older boys who hang out at a local coffee shop and commit minor acts of anarchy. But when a skinhead just out of jail takes over the group and leads it to nationalistic grounds, the violence and tension is unleashed. Meadows paints a perfect picture of the conservative Thatcher years in England, as well as the social unhappiness of the times, in this film that is based upon true incidents from his childhood. The result is also a gripping, violent and intense drama that will keep viewers on the edge of their seats.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Blending a coming-of-age story with social commentary, Shane Meadows has directed a film that packs an emotional wallop with thought-provoking themes and dialogue, powered by the performances of Thomas Turgoose and Stephen Graham.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "A great punch in the face this film is filled with anger, raw energy & a cast of unknown actors absolutely brilliant. Ouch!",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "Un pugno nello stomaco ma ottimo film ambientato nell'ambiente degli Skinhead dell'Inghilterra Tatcheriana.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "The separation of both skinheads' subculture\n and how the state will be able to switch the situations\nin favor of itself, using the for-nothing young\nrevolutionaries' imperfect knowledge \nand ignorance, in order for the government to take \nadvantage of their recruitment. Though some may have\n taken the segregating rule of good and evil in, still\nothers are becoming dangerous.",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "Encore une bonne comédie sociale britannique.",
            "review_date": "2013-11-23",
            "source": "rt"
        },
        {
            "content": "winner best film in British Independent FIlm Awards. best british movie in 2006. the story is about 80`s era in England. give us the lifestyle and condition on that era. this movie focus on one child named Shaun (Thomas Turgoose), an 11 year old boy who is the victim of war situation and struggle with sadness after his father died in war. in a state of  sadness and depression the situation more bad because bullying. his life change after he met Woody and the gang, who really care and received him. this movie very deep and brilliant because brought the narrow view point of one boy lived and wide view point for the lives of english on that situation. the director success connected between those two aspects with extraordinary. powerful, stunning and full of meaning movie. all best quality contained in this film.",
            "review_date": "2013-11-14",
            "source": "rt"
        },
        {
            "content": "As an avid fan of the HBO series Boardwalk Empire, I really enjoy Stephen Graham's work.  After seeing this movie, I am an even bigger fan!  This is one of his best roles.  The storyline is very interesting and shows you a glimpse of a subculture many of us in America never even knew existed.",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "Totally predictable but very real.",
            "review_date": "2013-10-15",
            "source": "rt"
        },
        {
            "content": "Weak, clichÃ (C), preachy dialogue, and acting that suspended no disbelief; I   enjoyed this movie the first time I saw it:  1992's \"Romper Stomper\"",
            "review_date": "2013-09-20",
            "source": "rt"
        },
        {
            "content": "Great performances from the whole cast. Though, it can leave you a bit blue knowing that a film is over and that you won't be seeing these folks again. Luckily however, there's a follow up TV series based on these characters to keep you engaged. I'm enjoying  it so far.",
            "review_date": "2013-09-17",
            "source": "rt"
        },
        {
            "content": "great film. great story. gonna watch the season.",
            "review_date": "2013-09-11",
            "source": "rt"
        },
        {
            "content": "Shane meadows just hit it exactly right with his brilliant storytelling keeping the small boy in charge at first and then slowly shifting the weight on another side of the characters....! Fantastic job..!",
            "review_date": "2013-09-05",
            "source": "rt"
        },
        {
            "content": "The unrelenting heart and toughness of the film makes this one terrific British drama.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "1972's The Godfather Is My Fourth Favorite Film Of All Time.",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "A very new, fresh and rewarding coming of age story.",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "Set in the days where Margaret Thatcher ran Britain and shows the havoc that was caused by some of her decisions. The story looks at a boy who catches up with \"cool\" kids who are older and don't appear to have jobs or hardly a house anyway. Very interesting watching and doesn't bore you!",
            "review_date": "2013-06-10",
            "source": "rt"
        },
        {
            "content": "excelente! me encanto!!!",
            "review_date": "2013-06-08",
            "source": "rt"
        },
        {
            "content": "This semi-autobiographical drama tells a coming of age tale of disillusioned and misguided youth, examines the skinhead culture with striking intelligence and provides an authentic and sweetly nostalgic portrait of 1983 for those who endured Thatcher's England. The performances have a simplicity to them that makes them both endearing and realistic, the ending is comprised of memorable and powerful imagery and the social and political overtones of the film are compelling and thought provoking. Probably the best British film of the 2000s.",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "Excellent film although saw the ending coming a mile off. Soundtrack is fabulous, the Smiths cover at the end particularly good.",
            "review_date": "2013-05-18",
            "source": "rt"
        },
        {
            "content": "Muy buena película que te hace volver a los años 80. Hecho de menos tener un poco más de culturilla para ubicarme mejor en el entorno inglés",
            "review_date": "2013-05-18",
            "source": "rt"
        },
        {
            "content": "wondrous mediator how to know real england in that age, feels like drama + documentary, how natural !",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "Watch it for what it is: denunciation. The rest is unnecessary, although well made.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "This movie was great! I feel like the plot change was a great one. The best thing is that there is a TV show called \"This Is England 86\" which is based three years after the end of this movie.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "This is such a clever film! Extremely realistic and quite sad ;( poor kid gets manipulated into hateful beliefs until he realises what a psycho the ring leader of his little gang really is!",
            "review_date": "2013-03-29",
            "source": "rt"
        },
        {
            "content": "Incredible film, brilliant performances from everyone involved (especially Joe Gilgun as Woody) which evokes emotion and feeling very well.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Very raw British filmaking, Thomas Turgoose and Stephen Graham putting in unsettling performances in a film that ultimately defines an age and it's sentiments resonate again in society today.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "This Is England is a brutally honest, spectacularly enjoyable coming-of-age movie about a twelve year old boy falling in with a group of skinheads, and it packs an immense emotional punch as well. Given its plot, this sounds like anything but a coming-of-age story, but it actually is. The boy, Shaun, joins the group of skinheads in order to feel a sense of belonging and acceptance because he generally gets made fun of by kids his age. All but one of the skinheads is apolitical, meaning that it's simply a lifestyle choice for them rather than the racist, neo-nazi connotation that the word 'skinhead' would suggest. The one member of the group who is political, and the one to which the racist connotation is more apt, is Combo, an unstable nationalist just recently released from prison. Combo is played by Stephen Graham, who gives an absolutely incredible performance and makes the character genuinely frightening and believable. Shaun begins to look up to Combo, and events take a downward turn from there. Shaun is also played fantastically by the young Thomas Turgoose, who is also in some of director Shane Meadows' later films. Turgoose and Graham together give the film much of its emotional impact. This Is England is an extraordinarily well-made and engrossing film about alienation and violence among British youth, and it's among the best and most powerful films from the 2000s that I've seen.",
            "review_date": "2013-02-28",
            "source": "rt"
        },
        {
            "content": "Affecting look of the early skinhead movement without judging nor glamorizing the subject.",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "Decent. But extremely over rated. Nothing overwhelmingly special. Too many films like it before and after - so defeats the purpose of it being unioque and new for its time. Ending is powerful(ish). Maybe a slight over exageration of acting and direction.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Started off really well, but the story didn't please me. Well filmed and well acted.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "This movie is brilliant.  It made me feel uncomfortable.  Very uncomfortable.",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "Strong movie. Good history.",
            "review_date": "2013-02-13",
            "source": "rt"
        },
        {
            "content": "It didnt have as powerful an impact on me as Meadows' previous film but I suppose its unfair to compare it, it stands on its own...moving, poignant and worth watching more than once...",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "I love this movie. Every time I watch this film there's one scene in particular that puts a knot in my stomach right from the beginning.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "One of my favorite coming of age films of all time. Great cinematography, great choice of music, and most of all a great story.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "This might be a depressing movie, but i assure you, it is gonna open your eyes",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "It's impossible not to compare this film with American History X, but it's not set in the U.S., the story doesn't take place during the same time period, and the characters are completely different.  That being the case it's nearly every bit as good as A.H.X.",
            "review_date": "2013-01-14",
            "source": "rt"
        },
        {
            "content": "Beautiful, unexpected twist at the end. With one simple event, it exposes xenophobia as a carrier and outlet of personal fears and pain.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "This is how kids grow up in one night. Sad and deep.",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "Excellent film, totally accessible and bought me close to tears at several points.\r\nThe music is pitch perfect right up to the end, and adding a beautiful tint to the most (deliberately) mundane scenery.\r\nThe acting and direction is absolutely faultless, and you even feel sorry for the most dislikeable of the characters â which is not something that can often be said of racists.\r\nThe violence holds a good balance between terrifying, yet without ever getting too âpreachyâ.\r\n\r\nHad a stunning reminder of how real and relatable the subject matter of this film is recently with a group of young boys shouting out âNiggerâ and âPakiâ, simply because they thought it was funny.",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "Just as good the 2nd time....",
            "review_date": "2012-12-21",
            "source": "rt"
        },
        {
            "content": "\"This Is England\" sounds like your typical British film - concrete, plenty of rain, and of course the misery. In actuality, this couldn't be further from the truth. In fact, the film buzzes with energy and humor, while propelled by brilliant, engaging performances.\r\n\r\nIt's 1983 and 12-year-old Shaun Field (Thomas Turgoose) is an isolated lad growing up in a grim coastal town, whose father has died fighting in the Falklands war. After being persistently bullied, he finds role models when those in the local skinhead scene take him in. With his new friends, Shaun discovers a world of parties, his first love, and a sense of belonging. Here he also meets Combo (Stephen Graham), an older, racist skinhead, who was recently released from prison. As Combo's gang harasses the local ethnic minorities, Shaun is a willing passenger. But When Combo ups the ante and his propensity for violence increases, Shaun must make some difficult choices.\r\n\r\nThere are two standout performances. The first is from child actor Thomas Turgoose, whose raw energy and pugnacious attitude are perfect for the character of Shaun. There's never a moment's doubt that he fully inhabits the character. Equally strong is Stephen Graham as the demented, charismatic Combo. Graham conveys both critical aspects of his character: the allure and the contempt. Combo is more than a heartless street thug, and that understanding is what makes Graham's portrayal so powerful.\r\n\r\nMeadows sentimentalism has sometimes gotten the better of his work, with tears and needlessly punishing violence, but not here.The film slows down and thickens as Shaun becomes embroiled in a subculture of hate - in moments, it's a little talky, but never loses its intensity. Shaun may embody hard times and bad breaks, but Mr. Meadows refuses to let him off the hook. His script and direction are virtually flawless. The one exception is the film's ending when it needlessly nails home the point once more, but no worries. The unrelenting heart and toughness of the film makes this one terrific British drama.",
            "review_date": "2012-12-16",
            "source": "rt"
        },
        {
            "content": "There is a very different world in this movie, one which we have not been acquainted with...",
            "review_date": "2012-12-14",
            "source": "rt"
        },
        {
            "content": "An impacting story combined with impeccable performances make this gripping movie one of the best of 2007.",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "This Is VIOLENCE And realistic. Superbly directed the beautiful script.. Alluring performances by the whole cast! Graham was extra ordinary! Shane strikes again!",
            "review_date": "2012-12-08",
            "source": "rt"
        },
        {
            "content": "Che musica, che fotografia, che sceneggiatura, che attori, che bella sorpresa! Finalmente un film inglese tosto, schietto, realistico e surreale nello stesso tempo, alla faccia di Trainspotting! Il disagio e la crisi d'identità di una nazione di grande tradizione storica raccontate attraverso il disagio di un bambino che ad un certo punto si identifica negli emarginati, ai tempi della guerra delle Falkland. La scelta delle canzoni è tra le meno banali, la musica di Ludovico Einaudi dà un tocco assolutamente romantico alla immagini molto molto belle. Questa è l'Inghilterra, questo è cinema.",
            "review_date": "2012-11-16",
            "source": "rt"
        },
        {
            "content": "Brilliant and brutal. Clearly shows the closely related paths available to young people at the time and how different the outcomes could be. A great example of recent British cinema.",
            "review_date": "2012-11-15",
            "source": "rt"
        },
        {
            "content": "This is England, this is the good old Doc Martin days.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "Starring Ben Sherman Doc Marten and Maggie Thatcher",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "This is one of those films that truly gets deep underneath your skin. I remember seeing this film years ago, and still, every time I watch it, it has the same overwhelming effect.  This is to this day one of the many films that I will hold as a standard for myself as an aspiring filmmaker.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "A British Romper Stomper, and actually far superior to it. An exceptional film where every minute is charged with honest emotion. I don't think I've seen a better film that deals with the inherent dangers of flag-waving nationalism. Shane Meadows has made a great movie and I highly recommend it.",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "stunning film that has spawned three tv series each expanding on the characters lives. extremely well acted with great visual impact and hauntingly appropriate soundtracks. i almost feel like part of woodys gang ive come to know them so well.",
            "review_date": "2012-10-11",
            "source": "rt"
        },
        {
            "content": "Shane Meadows at his absolute best.  It's strange to watch this now because you constantly find yourself trying to slot the story back in with the TV Editions of '86 and '88 and to be honest I'm not 100% sure they marry together perfectly.  Setting that aside though Turgoose and Graham are both incredible on-screen in polar opposite roles.  They feel like real people, not just characters and the film delivers warmth and squirming horror in equal doses.  A must see.",
            "review_date": "2012-09-26",
            "source": "rt"
        },
        {
            "content": "Unapologetically honest and bleak, this film cuts deep, as it should.",
            "review_date": "2012-09-25",
            "source": "rt"
        },
        {
            "content": "If you liked American History X... This feels even more real. Shocking.",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "opening  music  good ....  story was good",
            "review_date": "2012-09-06",
            "source": "rt"
        },
        {
            "content": "An absolute beast of a film, gritty, tense, nostalgic but deeply lovable\nFor any English kid who grew up in the 80's  this film brings back sweeping emotions and in a way it is the insight into this period of time that is most interesting.\nSet against a backdrop of civil unrest the acting is superb with Stephen Graham giving the performance of his life as Skinhead leader Combo.\n Another fantastic low rent film great for its authenticity and acting not for the amount of 000s on the end of its budget..",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "\"What should I write?\" - Shaun\n\nDisturbingly beautiful, definitely shocking and fresh.",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "Luglio 1983. Shaun ha 12 dodici anni, vive con sua madre, suo padre è morto nella guerra delle Falkland. A scuola è vittima del bullismo ed è considerato da tutti un perdente, proprio in questo periodo turbolento, Shaun si trova sempre più isolato dal resto dei giovani ragazzi e passa le giornate alla spiaggia praticamente solo. Dopo l'ennesimo litigio a scuola, dovuto al suo abbigliamento ritenuto da sfigato con i pantaloni a zampa di elefante, Shaun incontra un gruppo di skinheads che sembrano non curarsi dei suoi vestiti. Grazie a loro troverà degli amici veri che lo faranno sentire parte di qualcosa e il coraggio che gli è sempre mancato, riuscendo a respingere la timidezza per conoscere Smell, una ragazza più grande di lui.\n\nIl gruppo è molto coeso nonostante sia formato da ragazzi e ragazze appartenenti a diverse sottoculture del periodo. Il gruppo è formato da Woody (skinhead), Lol (skingirl/sort), Smell (new romantic), Gadget (skinhead), Milky (rude boy), Pukey (street skinhead), Kelly (skingirl), Pob (rude girl), Kes (herbert) e Trev (skingirl).\n\nDurante una festa a casa di Gadget, torna in città Combo, che è stato in prigione per 3 anni, per riprendersi il posto di capo banda portandosi dietro Banjo, un suo compagno di galera; purtroppo quando era dentro Combo ha frequentato alcuni skinhead nazisti che lo hanno convinto ad accogliere l'idea razzista e nazionalista del National Front inglese. Combo inizia immediatamente ad istigare i giovani del gruppo al razzismo dando brevi lezioni di vita e pronunciando discorsi sulla supremazia dei bianchi rispetto agli altri popoli, specialmente i neri. Milky, di origine giamaicana, si sente offeso e questo porta alla divisione del gruppo, nonostante i tentativi di Lol e Woody di mantenere uniti gli amici cercando di allontanare alcuni di loro, i più giovani soprattutto, dalle ideologie nazionaliste di Combo.\n\nUna volta diviso il gruppo, Combo inizia l'indottrinamento di Shaun seguito da Gadget, Banjo, Meggy e Pukey. Quest'ultimo, dopo un discorso tenuto da un rappresentante del National Front, ha un violento diverbio con Combo a causa della sua impossibilità a condividere idee razziste. Quindi Pukey abbandona il gruppo di skinheads tornando tra i vecchi amici.\n\nMa Combo non demorde, oltre a riappropriarsi della leadership degli skinhead cittadini vuole riavere il suo vecchio amore, Lol, che dopo la carcerazione di Combo è diventata la fidanzata di Woody. Nel frattempo Combo organizza anche dei raid contro gli immigrati, pakistani in particolare. La vita di Combo crolla dopo l'ennesimo rifiuto di Lol, invita Banjo, Meggy, Gadget, Shaun e Smell e, con lo stratagemma di voler comprare della marijuana da Milky, lo fa entrare in casa sua. Gadget si sente male dopo aver fumato la marijuana, e viene accompagnato fuori da Smell. Durante la festa, Combo capisce che la sua vita è un totale fallimento, soprattutto dopo che Milky gli descrive il suo rapporto coi familiari e le feste passate in famiglia. Combo perde la testa, aggredisce brutalmente Milky e lo riduce in fin di vita. Nella stessa occasione picchia anche il suo compare Banjo e caccia in malo modo Meggy e Shaun. L'unico che rimane nell'appartamento è il piccolo Shaun, che assiste a tutta la scena in lacrime.\n\nIn seguito vediamo la madre che rincuora Shaun sulle condizioni di Milky, fortunatamente non morto. Le immagini alla TV fanno intuire la fine della guerra delle Falkland. Shaun torna sulla spiaggia dove passava i pomeriggi da solo e getta nel mare la bandiera con la Croce di San Giorgio regalatagli da Combo.\n[it.wikipedia.org]",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "Bloody excellent this movie will treasure me for years",
            "review_date": "2012-08-26",
            "source": "rt"
        },
        {
            "content": "Absolutely heartbreaking.",
            "review_date": "2012-08-25",
            "source": "rt"
        },
        {
            "content": "The film has a kind of comic fun side to it that could mislead at time but its realistic depiction of  England in the eighties and coming of age tales is moving and very emotional(even sometimes very hard to watch!).The realization and the acting are very well done and sometime \"this is England\" gives the impression to become a true experience in the life of his characters.It is hard to compare this film to another one but probably than as said below American story X is the closest one .Good stuff!\nRecommanded to everyone.",
            "review_date": "2012-08-22",
            "source": "rt"
        },
        {
            "content": "An amazing drama, gritty and powerful. Turgoose as the 12yo is perfect, without whom the film wouldn't have worked so well. Violent, disturbing and humourous, it makes the title seem like a condemnation than a proud slogan.",
            "review_date": "2012-07-29",
            "source": "rt"
        },
        {
            "content": "A great movie, it brilliantly shows how the skinheads, something that started innocent enough, become a problem in England. The entire cast shines, loved little Thomas Turgoose!",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "When you see \"This is england\", you shouldn't think in \"American History X\", you should think in Fernando Mereilles's \"City of god\". Amazing cast.",
            "review_date": "2012-07-24",
            "source": "rt"
        },
        {
            "content": "Sterling, as Woody would say. A coming of age drama that packs a powerful emotional punch and keeps you thoroughly entertained throughout.",
            "review_date": "2012-07-20",
            "source": "rt"
        },
        {
            "content": "Power, emotion and self-destruction; Britain, we'll show Hollywood yet.",
            "review_date": "2012-07-17",
            "source": "rt"
        },
        {
            "content": "thought provoking, hard hitting, moving & even tender. fantastic performances throughout & utterly convincing. amazing.",
            "review_date": "2012-07-14",
            "source": "rt"
        },
        {
            "content": "Powerful movie with superb performances. Riveting.",
            "review_date": "2012-07-13",
            "source": "rt"
        },
        {
            "content": "A masterpiece of british film-making. An expertly commentry to working class life during one of britains most tuff periods in the past centuary.",
            "review_date": "2012-07-10",
            "source": "rt"
        },
        {
            "content": "Brilliant. It may not be perfect, but it is dang close.",
            "review_date": "2012-07-10",
            "source": "rt"
        },
        {
            "content": "True story about a bunch of people that go around killing Asians, how people join the far right",
            "review_date": "2012-06-27",
            "source": "rt"
        },
        {
            "content": "Since this is set in the past it should be called What is England?",
            "review_date": "2012-06-16",
            "source": "rt"
        },
        {
            "content": "I can't figure out why so many people enjoyed this movie.",
            "review_date": "2012-06-15",
            "source": "rt"
        },
        {
            "content": "Like Elizabeth Weitzman said, 'This is England' is a stunning, staggeringly powerful and an unforgettable work of art. A Must-see!",
            "review_date": "2012-06-15",
            "source": "rt"
        },
        {
            "content": "Incredible Movie , Really shows the way england was in 1983",
            "review_date": "2012-06-14",
            "source": "rt"
        },
        {
            "content": "Okay, not great, movie.  There are better movies on, uh, skinheads.  Romper Stomper is one particularly strong example.",
            "review_date": "2012-06-12",
            "source": "rt"
        },
        {
            "content": "A courageous, affecting film that holds up a mirror to an unsavoury aspect of English society in the early 1980s.  Not a comfortable experience, by any means.  An unflinching look at the fine line between national pride and xenophobia.",
            "review_date": "2012-06-11",
            "source": "rt"
        },
        {
            "content": "Funny and sentimental at the same time, This Is England is a wonderful film with Thomas Turgoose giving a wonderful breakout performance.",
            "review_date": "2012-06-03",
            "source": "rt"
        },
        {
            "content": "A fantastic British drama that nails emotions brilliantly. It really does grip the viewers attention with plausible characterization and likable characters. Half way through (however) the film starts to incorporate controversial topics that I seriously did find rather disturbing - which (in my opinion) is a positive element, as it makes the film even more memorizing.",
            "review_date": "2012-05-30",
            "source": "rt"
        },
        {
            "content": "As good a disappointment as American History X. That's what I had to say about AHX that I couldn't connect or relate to the movie and something similar happened with This is England also. The movie didn't generate any sympathy or connections for the characters. At a few places, when the drama gets too serious, the movie gets a bit boring.\n\nThough there are some brilliantly filmed scenes with good acting and hard hitting music. You gotto give it to Young Thomas Turgoose for some brilliant acting as Shaun! Overall it came off as a bland yet thoughtful movie to me. Just a little bit underwhelming perhaps due to the hype about it! Was good for a one time watch though...",
            "review_date": "2012-05-25",
            "source": "rt"
        },
        {
            "content": "95%\r\n\r\nIt's effective when it fires from each specific cylinder, and fires the simultaneous grit and tenderness of its power through every single frame. It may not be the most original tale, but what it lacks in originality it makes up for in nearly everything else.\r\n\r\nThe true beauty of the film relies in the way it travels between the extremes of emotion and tone. When the film is light, it definitely feels light-hearted, adorable, and just plain fun and enjoyable. When it gets down to the grit of it, it's terrifying, frightening, poignant, and downright shocking. The film has the amazing quirk to move between these moments seamlessly, and manages to practically juggle with your emotions. In addition, there is always an unrelenting tension in the film, even in the lighter moments, that makes you feel uneasy at times and that others might find distracting. However, it's the sheer power behind this tension that allows the film to be much more than your typical run-of-the-mill subculture coming-of-age story. It's engaging, immersing, and pretty damn exhilarating. There still may be those who may not be able to fully grasp it, and will simply find the tension odd, out of place, and distracting, but it's when the tension is embraced that the film soars into your own heart and mind and beyond. This is why, despite the nearly formulaic nature of the plot, the film feels fresh and inviting. \r\n\r\nThe film is surprisingly tender and loving, but never without that strong tension. When it shifts gears, it's awe-inspiring and the performances only helps the film get up off the ground and gain speed. The film's tone can simply be a reflection of one of its main characters, Combo, brilliantly portrayed by Stephen Graham. Combo is a time bomb of hate and anger, a bomb that could go off at any second. He seems nice and right-minded with good intentions (as does the film), but he can get ugly and terrifying in a matter of seconds. Combo and This is England is a truly unique experience that is difficult to grasp at times but easy to enjoy.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "Brilliant film.  Touching, heart moving script that shows a serious depiction of us as people.  Liked the ending - showing how this whole skinhead head gang was pointless, violence was not the answer when people were happy.  Interesting how we start liking the gang leader guy when he first arrived but in the final scene we see how unstable he is, how sorry he was.  Hectic movie. Very hardcore.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "See oli hea,väga hea!",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "Honest and poignant film. Very good performances.",
            "review_date": "2012-05-18",
            "source": "rt"
        },
        {
            "content": "Very good film from Meadows that really captures England at this transitional stage of it's history. Although it lacks the punch of Meadows best work Dead Man's Shoes, it does draw you in and doesn't shy away from the hate and frustration that was in the air in 83. Also Turgoose is a talent and steals the film from all the older actors, although Graham runs him close with possibly his best performance of his career. I felt it could have been a bit longer as more should have been shown about the supporting characters. Overall this is British filmmaking at it's best.",
            "review_date": "2012-05-13",
            "source": "rt"
        },
        {
            "content": "Hey Maggie what have you done?",
            "review_date": "2012-05-10",
            "source": "rt"
        },
        {
            "content": "British filmmaking at its finest right here, I can find very little not to like about this movie.   The only thing is that there's so many interesting characters in this movie whose backstories can't be featured in a 100 minute running time.  That's not even much of a knock on the movie as much as how much work actually went into these characters that couldn't all be featured prominently without the movie becoming a mess.  Thankfully Shane Meadows realized this and has developed two spin off series with all the same characters (This Is England 86 and 88 respectively, which I would REALLY like to see).  This movie really is quite incredible, it clicks on just about every level imaginable.  The cast is near perfect, Stephen Graham's performance really is quite terrifying yet he adds a sympathetic touch to the character at parts and it works.  The thing with his performance is that every word that came out of his mouth, he delivered like he truly and utterly believed everything he was saying.   It was really a fabulous performance.  Thomas Turgoose as Shaun is also great, not as good as Stephen, but considering the kid's age a damn fine performance.  The rest of the cast, as mentioned, is perfectly cast but the brunt of the movie is carried by Thomas and Stephen.  The soundtrack to the movie is fabulous as well, just great music all around.  The story is a damn good one as well seeing this boy, at this very impressionable age in his life, get carried into a lifestyle (with the racist skinheads) that probably would've done him more harm than good and his maturity in realizing that he didn't want to be part of that.  So it's a great coming-of-age story really.  I also love the look of the movie, it looks like it was legitimately filmed in the 80s but it doesn't feel nostalgic and in fact adds a bit more realism (which it had already) to the movie.  Really I can't say enough good about this movie.  Excellent and I would highly recommend it.",
            "review_date": "2012-05-10",
            "source": "rt"
        },
        {
            "content": "Mean Streets sort of story, This Is England features superb performances.",
            "review_date": "2012-05-08",
            "source": "rt"
        },
        {
            "content": "Its a fucking movie!!!",
            "review_date": "2012-05-04",
            "source": "rt"
        },
        {
            "content": "Very good and a very powerful movie a must see one of the greatest films I have seen",
            "review_date": "2012-04-26",
            "source": "rt"
        },
        {
            "content": "excellent movie, the photography is choppy and gritty as the theme, yet totally enjoyable. must see for those that can seem to get out of the general bubble.\n                                 mross///SOA",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "A pretty good film based on the early years of skin heads in the 80's. It's mainly about a Boy who has lost his dad in the Falkland Islands War and his journey. It shows us how easy it is to follow the wrong people, to be told something that you believe in because of exploitation and so on. It's a good film about racism and childhood in England.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "the pace is consistent and the political/social undertone cleverly builds up.",
            "review_date": "2012-04-23",
            "source": "rt"
        },
        {
            "content": "great film one of my all time favs",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "I have been told for years I need to see This Is England, but never got round to it. I now regret that, as the film was brilliant. Before Iâ(TM)d seen it, Iâ(TM)d thought Dead Manâ(TM)s Shoes was one of the best British films ever. Now, This Is England is one of the best British films ever. There was some great nostalgic moments involved, very enjoyable to watch with a smile on my face, then mixed with terrifying moments.\n\nThomas Turgoose is the main actor, and extremely impressive as the young Shaun, desperate for a friend, and maybe more so, a father figure, first being drawn to the loving surrogate brother of Woody, before being drawn to the angry and hateful Combo. Shaun is the center piece of the film, and he carries it very well for a novice. However, whilst he may be the main performer, he is backed up by several solid performers, all regulars it seems of Shane Meadows films.\n\nWoody and Lol made a great couple who I really liked in their almost surrogate parents role, very lovable. As well as their best friend Milky, who is also a great personality. In fact, pretty much every character included is impressive. But, as impressive as they are, the one who steals the film, is Combo, played by Stephen Graham. He is terrifying, a true tour de force, his very presence unnerving the audience and leading to possibly the most uncomfortable scene, when Milky invites him to a meal. A magnificent performance from Graham, in an overall magnificent film.",
            "review_date": "2012-04-12",
            "source": "rt"
        },
        {
            "content": "Taut, intense and moving! This movie gives viewers a look inside the dark world of a Neo-Nazi teen in England!",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "excellent film about a young man who is bullied by classmates and others. One day on the way in from school he falls in with a gang and begins to idolize them and longs to be in the gang. after a former member returns from prison he divides the gang up and the young man goes with the neo nazi ex-con's nationalist gang. shane meadows wrote and directed this wonderful film , its very well worth the watch.",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "kind of like American History X, with smaller budget and based in UK",
            "review_date": "2012-04-06",
            "source": "rt"
        },
        {
            "content": "this was one of the most amazing movie ever it shows the true colors of a true skinhead you don't have to be a Nazi to be a skinhead .........Trojan skinhead till i die none of this racism is necessary",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "Good movie... sad but expected ending...",
            "review_date": "2012-04-02",
            "source": "rt"
        },
        {
            "content": "Decent story about early 80's British skinheads.  I would recommend it, but its nothing really groundbreaking or gamechanging.",
            "review_date": "2012-03-24",
            "source": "rt"
        },
        {
            "content": "Pretty good movie, but my expectations were just too high I guess... The music however is just brilliant, but they really couldn't go since the era is the 80's. :)\nI'll  probably watch both series (This is England '86 & '88) too since it's with the same cast and crew.",
            "review_date": "2012-03-24",
            "source": "rt"
        },
        {
            "content": "Humorous, witty, violent and incredibly directed. Fantastic film.\nGrade - A",
            "review_date": "2012-03-22",
            "source": "rt"
        },
        {
            "content": "Greatest film I've ever watched.",
            "review_date": "2012-03-21",
            "source": "rt"
        },
        {
            "content": "I've Liked it's Idea",
            "review_date": "2012-03-20",
            "source": "rt"
        },
        {
            "content": "an amazing coming of age film for a young boy in 1983 london. they way they portray how vulnerable a young boy is who has lost his father is great! honestly a much watch for everyone, a masterpiece",
            "review_date": "2012-03-12",
            "source": "rt"
        },
        {
            "content": "A very catching attempt to figure out the 80s. While the setting may somehow summon the feeling of greasiness, the characters and the story can only catch your breath till you can gasp some air in the end. Another great piece of the British cinematography.",
            "review_date": "2012-03-12",
            "source": "rt"
        },
        {
            "content": "Gets better with every viewing",
            "review_date": "2012-03-10",
            "source": "rt"
        },
        {
            "content": "Gets better with time.",
            "review_date": "2012-02-28",
            "source": "rt"
        },
        {
            "content": "An extremely down to earth and gritty take on life on England during Thatcher regime and the Faulkan Island war, displaying the political and social climate at the time, and the difficulties that young kids may face when growing up in its wilderness. The theme of the film is nothing new, racial tension all over the world still exists today -yet it is the fresh way that Meadows handles the whole thing that impresses. This is supremely coupled with the strong acting, particularly from first-timer Thomas Turgoose, who inspires sympathy and empathy in equal amounts and gives one of the finest child performances I've ever seen. I would probably compare this film to American History X, in the way that they both share themes in racism and nationalism. But whilst American History X is a rather dramatic film with a lot more involvement in post-production, This Is England is a lot more gritty and realistic. I love both films, but I think this film is a little better because in American History X, I wasn't entirely convinced by Norton's character's redemption. Here however, I think the character's motives are not only clear, but rather conflicted and, on the whole, more realistic.",
            "review_date": "2012-02-28",
            "source": "rt"
        },
        {
            "content": "Ovvero, di come le guerre qualcuno le vince anche, ma chi le combatte, perde sempre. Il cinema Inglese sorprende spesso. Dolceamaro.",
            "review_date": "2012-02-27",
            "source": "rt"
        },
        {
            "content": "great roller-coaster of emotion, with feel good moments followed by dark gritty ones, enforced with believable characters and great acting. cant believe its taken me 6 years to get to watch this!",
            "review_date": "2012-02-25",
            "source": "rt"
        },
        {
            "content": "A hard-hitting look at an outsider's youth, and what comfort comes when there are others around - however it may be a brutal sort of 'others' as here.  I liked Meadows' unflinching camera, his use of close-ups on faces, the ska music (unexpected that, I thought it'd be skin-head punk rock but only UK Subs shows up), and the performance by newcomer Thomas Turgoose, and Stephen Graham, who seems to be in every British film right now.  I wondered why the film just ended the way it did, where it seemed like there was more story to tell, or at least a resolution to go after (and subsequently I learned Meadows did TV spin-off since the film's release with many of the same characters - which is fine, though as a film in and of itself it feels incomplete somehow, even with a predictable ending of a flag thrown in a river).  All the same, it's riveting, raw, personal cinema that can resonate with any youngster that's ever felt they didn't 'fit in' - or that they found a place to fit in, whatever the circumstances.",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "It's a very interesting movie and I can understand why some people would call it a masterpiece. I however thought it was good but at times a bit too gritty for it's own good. Unlike say, Four Lions, it didn't sympathise the characters enough and sometimes when the drama get's too serious, it get's a bit boring. This is England is a skillfully directed film and the source material has been studied in depth but a lot of people I guarantee will loathe it.",
            "review_date": "2012-02-21",
            "source": "rt"
        },
        {
            "content": "a funny knda fucked up film.",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "Classic British film !",
            "review_date": "2012-02-07",
            "source": "rt"
        },
        {
            "content": "This is England is not what it seems or appears to be. Like a meal that sounds fabulous on the menu, then tastes really quite average; this is the story of This is England.\nAfter films such as Romper Stomper and American History X, England has its version of disenchanted youth posing as white supremacist neo nazis, and lacks poorly at what it could've achieved. Not only does it lack the intensity, violence and hatred, it fails to deliver the emotional and social side of such causes. In the end, it tries a little too hard on a story that's been told many times before, and floats along in a blas'e sort of way.",
            "review_date": "2012-02-07",
            "source": "rt"
        },
        {
            "content": "o seriado Ã (C) a contiuaÃ§Ã£o do filme e Ã (C) muito bom.",
            "review_date": "2012-02-04",
            "source": "rt"
        },
        {
            "content": "boring yet powerful.",
            "review_date": "2012-01-30",
            "source": "rt"
        },
        {
            "content": "Violence is not a solution",
            "review_date": "2012-01-29",
            "source": "rt"
        },
        {
            "content": "Finally got around to this 1, it was ok, not much 2 it, makes England look like a SHIT HOLE but then agen its an extremely gritty film so it would, left me feeling like shit",
            "review_date": "2012-01-28",
            "source": "rt"
        },
        {
            "content": "One of the best films of the 2000s. Exploring Thatcher's Britain and the beginning of her social legacy, this film goes deeper than a political statement. It explores the root of hard hitting issues which plague our society today and the face behind them. We see characters who would conventionally be considered antagonists as real people, with real feelings and vulnerability, sprinkled with a generous helping of humour and shock factor. Far more dramatic and deeper than its American counterpart 'American History X', this film has such immense character depth it drowns me. Despite the large amount of central characters, each gets their moment of character development. This isn't a film, or even a social documentary- it's a work of art.",
            "review_date": "2012-01-19",
            "source": "rt"
        },
        {
            "content": "A compelling, gritty drama, full of racism, but enjyable",
            "review_date": "2012-01-18",
            "source": "rt"
        },
        {
            "content": "this movie has nothing to offer\r\n1)the acting was pretty bad\r\n2)for a movie with no sequel,it didn't explain much about the characters and apart from the boy all the others kept the same personality they began with\r\n3)the movie isn't focused correctly\r\nit's a pathetic attempt to present anti-fascist and mostly anti-racist messages \r\nmovies like American History X or Romper Stomper showed the same things this movie did,but far more efficiently \r\nThis Is England finishes by showing that from the whole experience the kid understood that nationalism is wrong \r\nif you want to say that racism is wrong that's fine \r\nmost people think it anyway but you can't say that nationalism is wrong\r\nyou can be a nationalist without being racist or fascist\r\ni mean:what's wrong with having your nation as your major ideal \r\n4)seconds before that huge skinhead attacked that black kid,he complaint about his relationship with his father \r\nthat event is here to show us that racists don't hate minorities for a particular reason apart from their own personal problems without explaining who exactly it is caused",
            "review_date": "2012-01-18",
            "source": "rt"
        },
        {
            "content": "One the the most disgusting and disturbing movies that I've ever seen.  Many congrats to the cast for their amazing commitment and unbelievable performances.",
            "review_date": "2012-01-06",
            "source": "rt"
        },
        {
            "content": "It was a good show of what happens in this society, however some things were very difficult to understand, but overall was pretty good.",
            "review_date": "2012-01-03",
            "source": "rt"
        },
        {
            "content": "It's a film with a message, one you didn't need a whole film to understand. Instead of giving us a real look at its world and its characters, it gets too concerned about delivering its message.",
            "review_date": "2012-01-01",
            "source": "rt"
        },
        {
            "content": "Shane Meadows is one of the most talented contemporary directors. This movie is sadness & fun, deals with policy and english society in the 80s (while english army fights in Falkland War). Through the eyes of a young boy who joins a group of skinheads. Excellent soundtrack and acting.",
            "review_date": "2011-12-30",
            "source": "rt"
        },
        {
            "content": "I don't know a lot about England and the social implications of this movie, so i judged it just for its entertainment ability. Not a lot of that, but a good movie.",
            "review_date": "2011-12-29",
            "source": "rt"
        },
        {
            "content": "This was better than I thought it would be.....but still a bit scary...I don't know...racism scares me...",
            "review_date": "2011-12-25",
            "source": "rt"
        },
        {
            "content": "Great film! For once an accurate and honest portrayal of the REAL Skinheads (which is lacking in the media) and how the National Front manipulated the working class. My only problem with the film is that it takes place a decade or so too late. By 1983 the clashes between WP and non-racist skins were already going on.",
            "review_date": "2011-12-23",
            "source": "rt"
        },
        {
            "content": "A bloody good movie, innit!? Also bloody good soundtrack.",
            "review_date": "2011-12-22",
            "source": "rt"
        },
        {
            "content": "This is an absolutely superb film. Everyone has an increible performance, especially Stephen Graham who boasts an absolutely unbelieveable performance. Your heart is racing everytime he comes on screen. The soundtrack is also amazing, and the plot is compelling. The perfect film",
            "review_date": "2011-12-19",
            "source": "rt"
        },
        {
            "content": "honestly mate, its sterling",
            "review_date": "2011-12-13",
            "source": "rt"
        },
        {
            "content": "This Is England is probably one of the most powerful british films of all time. This movie shows a boy named Shaun who is helped by a couple of British Skinheads and later became one of them. Everything is fine until Combo, wants them to take things seriously, and violent. This movie has to be one of my favorites, the acting from Steven Graham and Thomas Turgoose is perfect, and it I'm probably going to watch some more of Shane's work.",
            "review_date": "2011-12-04",
            "source": "rt"
        },
        {
            "content": "Nostalgia por algo que nunca viví. Sólo otra película me había hecho sentir eso antes, así que, solo por eso,  4 estrellas y media al toque. Un drama sobrio, bien narrado que no cae en el kitsch para provocar empatía (y vaya que era tentador dejarse llevar a causa del tema que trata la película). No le doy todas las  estrellas pq me da la impresión de que la producción podria haber sido mejor.",
            "review_date": "2011-12-04",
            "source": "rt"
        },
        {
            "content": "beatifuly done in every sense. the soundtracks were also amazing.",
            "review_date": "2011-12-01",
            "source": "rt"
        },
        {
            "content": "Angry, rage-filled and problematic characters need to be played with subtlety. Practically devouring the scenery every 5 seconds isn't that, it's just being loud.",
            "review_date": "2011-12-01",
            "source": "rt"
        },
        {
            "content": "this semi autobiographical period piece set in 1983 and look at the \"hard knock life\"-british styleee.",
            "review_date": "2011-11-28",
            "source": "rt"
        },
        {
            "content": "très bon film, parce qu'authentique",
            "review_date": "2011-11-24",
            "source": "rt"
        },
        {
            "content": "Poignant, realistic, and so well-done.  We were really impressed by the quality of the acting, especially since some of the main roles were played by newcomers to the screen.",
            "review_date": "2011-11-18",
            "source": "rt"
        },
        {
            "content": "A well made film about skinhead culture in 1980's England.",
            "review_date": "2011-11-04",
            "source": "rt"
        },
        {
            "content": "wow! this movie is great! i don't know why it took me so long to get around to watching this but i'm glad i finally did. thanks for impressing it upon me, lee!",
            "review_date": "2011-10-22",
            "source": "rt"
        },
        {
            "content": "Well acted, nice soundtrack, but the story itself I found a bit underwhelming.",
            "review_date": "2011-10-19",
            "source": "rt"
        },
        {
            "content": "Skinheads are pathetic. I guess I knew that. Great acting though.",
            "review_date": "2011-10-19",
            "source": "rt"
        },
        {
            "content": "With an impressive list of films already to his name, English writer director Shane Meadows has put in another solid effort with 'This is England'.  \r\n\r\nSet in a coastal town in the north of England in 1983. The story is about 12 year old Sean, whose father was recently killed in the Falklands war. After being picked on all day at school Sean runs into a bunch of local skinheads who turn out to be quite friendly and take Sean under their wing.\r\n\r\nFor awhile it's all fun and games as Sean becomes initiated into the music and the fashion of the skinhead scene. In fact there are no references to racism among the group and there's even a black skinhead in the fold. However, the dynamics change when Combo, a racist skinhead, is released from prison after three years and begins preaching to the group about nationalism, which is really just his veiled attempt to justify racism. \r\n\r\nThis causes an immediate fracturing of the group with half choosing to distance them selves from Combo and the other half deciding to follow him. Sean decides to stay in Combo's group, after Combo manipulates his feelings about his father's death to get him on side. From this point Combo's true motives are revealed and Sean finds himself in an environment of escalating violence. On the surface this film may appear to be revisiting the same tired old themes about the futility of racism, but the way in which Combo is depicted, firstly, as a despicable racist but ultimately as a pathetic figure frustrated by his impotency, is very convincing. \r\n\r\n'This is England' sits comfortably along side the great the kitchen sink dramas the Brits do so well and is definitely worth a rent.",
            "review_date": "2011-10-13",
            "source": "rt"
        },
        {
            "content": "Great movie.  Powerful examination on neo-nazi, bigotted, skinhead culture in the UK in the early 1980s.  The story is a metaphor for disaffected youth everywhere, and the evils of racism disguised as patriotism.\n\nSolid performances all round.  Stephen Graham is great as the skinhead leader.  Thomas Turgoose puts in a particularly good performance for a 13/14-year old.",
            "review_date": "2011-10-02",
            "source": "rt"
        },
        {
            "content": "Ideologies, whether political or religious are, after all, created by man and are unfortunately vulnerable to man's foibles.  This is all too evident in the film This Is England, where manifestos become fodder to the people who act upon them.\r\n\r\nThe film uses the Falkland War as a backdrop - one of the more ridiculous wars in recent memory.  Good and loyal Englishmen died trying to keep a bunch of rocks halfway across the world in British hands - never mind that having those rocks has absolutely no value to the Brit populace.\r\n\r\nWe see an 11 year old boy, Sean (in a wonderful portrayal by Thomas Turgoose) whose father was lost in battle.  Being fatherless and frequently bullied at school, he is looking for a place to belong, and perhaps, in a larger sense, looking for a father figure.  As the film progresses both are provided.  First he is befriended by the leader of a local gang, who appreciate the boy's moxy and quick wit.  The gang members are all in their early to mid twenties and do typical bad boy stuff like smashing up the interiors of abandoned housing projects - hooliganism that really isn't hurting anyone.\r\n\r\nBut the gang and its leader have a past, which is eventually revealed when the leaders \"mate\" comes back into town after a 3 year prison stay.  It then becomes known that the gang are (or were) skinheads, not the Americanized, Nazi loving brand, but more of a nationalist movement (in fact, there is a meeting in the back of a bar with posters urging support of the Nationalist Party).  Combo, the ex con (a very strong performance by Stephen Graham), claims that the skinheads are pro English, and not bigots (he reasons that the problem lies in all the Pakistani immigrants who are either on the dole or are taking jobs for cheap, thus robbing hard working English blokes of a decent wage).\r\n\r\nCombo woos Sean into staying with his more hardcore version of the gang, while his mentor tells Combo that he's not buying the hype.  Sean is duped by Combo who tells him that he's got to stand up and make his father's death have meaning.  \r\n\r\nEventually a father/son bond develops between the two, only to be shattered when it is revealed that Combo isn't who he purports to be, leading to a heartwrenching and powerful closing scene that reveals a certain inner strength and gives gravitas to the title.",
            "review_date": "2011-09-28",
            "source": "rt"
        },
        {
            "content": "Funny, touching, almost like a reality TV show but absolutely wonderful on all accounts.",
            "review_date": "2011-09-27",
            "source": "rt"
        },
        {
            "content": "Very controversial, but good film",
            "review_date": "2011-09-19",
            "source": "rt"
        },
        {
            "content": "Between Lindsay Anderson and the first Martin Scorsese, one of the best coming-of-age movies since Les 400 Coups, through a sharp and heartfelt portrait of 80' U.K. skinhead subculture masterfully written and directed.",
            "review_date": "2011-09-17",
            "source": "rt"
        },
        {
            "content": "If poverty, punks, skinheads or the 80's intrest you, you'll most likely enjoy this coming of age tale. Skinheads! Skinheads looking for a fight!",
            "review_date": "2011-09-15",
            "source": "rt"
        },
        {
            "content": "The British version of American History X? Well, while both films are about young boys coming of age amidst skin head culture, This Is England stands as a more personal film than the former. Shane Meadows semi-autobiographical film has a great soundtrack, a timeless message and fine performances, which surmount the otherwise familiar story. The neo-realist style of film making might not appeal to all, but it is certainly appropriate for this rugged tale.",
            "review_date": "2011-09-10",
            "source": "rt"
        },
        {
            "content": "A very powerful film. I haven't seen any of the cast in anything before but were very good. It touches on a time when attitudes were changing and it deals with some pretty touch subjects.",
            "review_date": "2011-09-09",
            "source": "rt"
        },
        {
            "content": "Finally came around to see this great movie. Highly recommended.",
            "review_date": "2011-09-04",
            "source": "rt"
        },
        {
            "content": "Strong plot and characters plus Ludovico Einaudi's music pieces. What more could a girl ask for?",
            "review_date": "2011-09-03",
            "source": "rt"
        },
        {
            "content": "Not as good as the ratings suggested it should be. While well done cinematographically, the storyline isn't brilliant, half following a 12yo becoming a skin head and half following Combo and how his abandonment by his father led him to be hateful to ethnics.",
            "review_date": "2011-09-03",
            "source": "rt"
        },
        {
            "content": "This is (certainly) England. I had fun watching it, seeing familiar props and being northern it's true to my growing up. Really enjoyable series.",
            "review_date": "2011-08-31",
            "source": "rt"
        },
        {
            "content": "In the movies language 'This is England' is nothing but \"Bloody f... Brilliant\". Maybe it's one of the most realistic gangster movie which portray the ugly face of England in the 80s way before the so called technological evolution and the knowledge age.\n\nThe plot speaks of the controversial social unrest which was in England at that time related to immigrants and the working class Englishmen. And persuasive enough to make you believe the harsh truth of the society's frustration of some social problems. \n\nThe story wraps around 12 year old Shaun who is a favorite of the bullies. While trying to find his life with his mother after losing his father to the war, Shaun doesn't really enjoy his days around where he lives. Eventually he is introduced to a small group of adult teenagers and he finds their routine and bond too strong to let go. Being a kid of that age he gulps in to the life style and it doesn't take long for him to go shoulder to shoulder with more serious people of more organized movement against the immigrants.\n\nThe acting is simply wonderful and very strong. Shaun played by Thomas Turgoose is one hell of a job well done. I practically felt sorry for the kid for what he is getting in to but proves himself stronger than many adults as the story rolls on. And there are other good performances as well. Especially by Stephan Graham who plays the ring leader Combo. \n\nI like the flow of the movie. It's not slow and it's not very fast either. The viewer has enough time to grab what's going around and some of the stuff is disturbing and the language is harsh.",
            "review_date": "2011-08-27",
            "source": "rt"
        },
        {
            "content": "grande apertura che inquadra perfettamente gli anni ottanta inglesi, azzeccata colonna sonora e intensa interpretazione.",
            "review_date": "2011-08-26",
            "source": "rt"
        },
        {
            "content": "... me la he visto 2 veces y meee encanta, creo que va a entrar en mi top de pelis!! la mÃºsica es campeona!",
            "review_date": "2011-08-14",
            "source": "rt"
        },
        {
            "content": "I would level this movie up with American History X. It delivers the same message in many ways. They acting is very good for a bunch of no names, I sometimes forgot I was even watching a movie!",
            "review_date": "2011-08-09",
            "source": "rt"
        },
        {
            "content": "Good film, but tough to watch. Very realistic in the way that it portrays the descent into skinhead culture and the different characters need for acceptance and belonging which leads them down this path. I don't know if I actually enjoyed watching the film, and tbh I doubt I'll ever want to watch it again, but nonetheless it's well directed and acted.",
            "review_date": "2011-08-03",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've seen in a while. Surprisingly touching, insightful, and, at times, funny.",
            "review_date": "2011-08-03",
            "source": "rt"
        },
        {
            "content": "A work of art. Simply stunning.",
            "review_date": "2011-08-02",
            "source": "rt"
        },
        {
            "content": "Demasiado buena!! recomendada!!!",
            "review_date": "2011-07-27",
            "source": "rt"
        },
        {
            "content": "Wow, a really good movie. Just randomly started watching it on some movie channel. Impressive.",
            "review_date": "2011-07-21",
            "source": "rt"
        },
        {
            "content": "Brutal and uncompromising British drama - a must see.",
            "review_date": "2011-07-13",
            "source": "rt"
        },
        {
            "content": "SÃ¥g en dokumentÃ¤r om The Smiths och efter det blev jag sugen pÃ¥ att se denna film som utspelarsig under ungefÃ¤r samma tidsperiod som The Smiths var aktiva. Unge Shaun lever med sin ensamstÃ¥ende mor efter att hans far blivit dÃ¶dad i falklandskriget. Han blir mobbad fÃ¶r sin klÃ¤dsel i skolan men en dag pÃ¥ vÃ¤gen hem sÃ¥ stiftar han bekantskap med ett gÃ¤ng vÃ¤nliga skinheads. Han fÃ¥r bli en av gÃ¤nget och allt verkar frid och frÃ¶jd till en gamal medlem av deras skinngÃ¤ng dyker upp. Han har muckat frÃ¥n kÃ¥ken dÃ¤r han lÃ¤rt sig att bli rasist. SkinngÃ¤nget splittras mellan de som vill vara rasiste och de som inte ll det. Shaun hamnar i rasistgrupperingen utan att sjÃ¤lv ha en aning om vad det betyder. Detta kan naturligtvis inte leda till nÃ¥got bra. Det Ã¤r intressant att hÃ¶ra retoriken frÃ¥n Natioanal Front vid ett mÃ¶te rasistskinsen Ã¤r pÃ¥. En retorik som man kÃ¤nner igen mer Ã¤n vÃ¤l frÃ¥n dagens Sverige. Ã-verlag tycker jag filmen Ã¤r ganska bra, avsevÃ¤rt bÃ¤ttre Ã¤n den banala American History X, men det kÃ¤nns Ã¤ndÃ¥ som nÃ¥got fattas fÃ¶r att den ska bli riktigt bra.",
            "review_date": "2011-07-10",
            "source": "rt"
        },
        {
            "content": "Turns out this is actually a really good movie. It's got the advantage of being drawn from writer/director Shane Meadows' real life experiences. The film's depiction of skinhead gang life, given from the viewpoint(s) of being under two very different gang leaders, I dont know to be accurate but I can say it is very captivating. The characters are totally engaging and in the end you get this feeling of undeniable satisfaction. A-",
            "review_date": "2011-07-09",
            "source": "rt"
        },
        {
            "content": "I think that the plot is a bit weak but the acting is so good!",
            "review_date": "2011-06-27",
            "source": "rt"
        },
        {
            "content": "Outstanding film. There are too many words to describe how good this film is.",
            "review_date": "2011-06-23",
            "source": "rt"
        },
        {
            "content": "a raucous, skankin good time",
            "review_date": "2011-06-23",
            "source": "rt"
        },
        {
            "content": "Excellent fish-out-of-water/coming-of-age story.  The plot involves nationalist/racists in 1980's England, a plot that seems oddly and sadly relevant today.",
            "review_date": "2011-06-21",
            "source": "rt"
        },
        {
            "content": "This is England is set in the early 80's and centers around the difference in skinheads and how easily one can be persuaded to move from one belief to the other. \n\nThe cast is relatively unknown to Americans. They were young and pretty unknown to Brits also when the movie was made. Stephen Graham of Snatch fame (he was Tommy \"Gun\") would be the only really identifiable actor in the movie. That doesn't mean they didn't do a stupendous job. Every actor did their best and it showed. \n\nThe soundtrack was great. I doubt many people have ever heard of bands like Soft Cell, The Specials or UK Subs, but I love all these bands. There are others I was introduced to on the soundtrack.\n\nThis is England was released in '06, so it can be found on DVD. I found it on a movie channel, but however you can, you should watch it.",
            "review_date": "2011-06-16",
            "source": "rt"
        },
        {
            "content": "This is England is set in the early 80's and centers around the difference in skinheads and how easily one can be persuaded to move from one belief to the other. \n\nThe cast is relatively unknown to Americans. They were young and pretty unknown to Brits also when the movie was made. Stephen Graham of Snatch fame (he was Tommy \"Gun\") would be the only really identifiable actor in the movie. That doesn't mean they didn't do a stupendous job. Every actor did their best and it showed. \n\nThe soundtrack was great. I doubt many people have ever heard of bands like Soft Cell, The Specials or UK Subs, but I love all these bands. There are others I was introduced to on the soundtrack.\n\nThis is England was released in '06, so it can be found on DVD. I found it on a movie channel, but however you can, you should watch it.",
            "review_date": "2011-06-16",
            "source": "rt"
        },
        {
            "content": "Stripped down, it almost plays like a documentary of skinhead culture in England in the early 80's. Great soundtrack, another strong appearance by Stephen Graham (playing Al Capone in Boardwalk Empire)and  the most amazing performance by a young boy (Thomas Turgoose) I've seen in a long time. I really liked this one.",
            "review_date": "2011-06-08",
            "source": "rt"
        },
        {
            "content": "Memories of living in Toytown",
            "review_date": "2011-06-08",
            "source": "rt"
        },
        {
            "content": "It started out nice actually with some Skin Heads showing kindness to a Kid who seemed depressed when he walked by them everyday, so they took him under their wings.I like that they showed that there is a human side to a group of peoples we stereotype, but I got bored as it moved at a Turtle Pace, I could finish this Movie",
            "review_date": "2011-05-30",
            "source": "rt"
        },
        {
            "content": "This was an excellent movie, great music and the story was solid. I would say this is a must see!",
            "review_date": "2011-05-29",
            "source": "rt"
        },
        {
            "content": "This is a pitch perfect look at England in the 1980's, at least from what I can remember. The whole film has a theme of innocence lost, as Shaun is seduced by a charasmatic skinhead who makes him believel the anger and frustration he feels toward the world is natural and teaches him to channel it into hate to further his own misguided racist agenda, leading to a horrific event that will leave them both scarred beyond repair.\n Everytime I watch this I forget how it seems like two films, one a feel good almost comedy and the second half a tragic drama about hate. I'm always affected by the the relationship between Combo and Shaun because it feels real and it's easy to understand how both characters have been misled to get to that point.\n  It's funny, smart and thought provoking plus if you want something that might give you a little cry this could be the one.",
            "review_date": "2011-05-17",
            "source": "rt"
        },
        {
            "content": "This is Englnad is set in 1983, 3 years before the tv series was set which was aired on channel 4 in 2010. The film centers around 11 year old Shaun who has lost his dad in the Falklands war and is being bullied at school. This is until he finds a local gang and this soon changes is life. A few graffic scenes through the film with them standing up for England",
            "review_date": "2011-05-16",
            "source": "rt"
        },
        {
            "content": "One of my favourite films of all time.",
            "review_date": "2011-05-15",
            "source": "rt"
        },
        {
            "content": "A well made but creepy and bleak outlook of the lives of a few teenagers growing up in 80's England. Not my sort of film but it was interesting to take a look into the history of my country. I believe that this is how it would be up North as the director came from there and I don't doubt his sincerity.",
            "review_date": "2011-05-11",
            "source": "rt"
        },
        {
            "content": "Raw, intense, sometimes blackly funny but also very humanistic in its concerns. I'm watching you now, Shane Meadows!",
            "review_date": "2011-05-05",
            "source": "rt"
        },
        {
            "content": "loved this movie, I thought this film was great, it was actually better than what I thought, I would love it on DVD, it starred Joe Gilgun (Emmerdale Eli), Thomas Turgoose and Andrew Shim, it was a good film",
            "review_date": "2011-04-30",
            "source": "rt"
        },
        {
            "content": "Interesting portrayal of a group of skinhead youngsters in Britain and their influences on each other.",
            "review_date": "2011-04-28",
            "source": "rt"
        },
        {
            "content": "This Is England is probably one of the most powerful british films of all time. This movie shows a boy named Shaun who is helped by a couple of British Skinheads and later became one of them. Everything is fine until Combo, wants them to take things seriously, and violent. This movie has to be one of my favorites, the acting from Steven Graham and Thomas Turgoose is perfect, and it I'm probably going to watch some more of Shane's work.",
            "review_date": "2011-04-26",
            "source": "rt"
        },
        {
            "content": "Skins in Thatcherland",
            "review_date": "2011-04-25",
            "source": "rt"
        },
        {
            "content": "Hmmm... didn't like the 'I was drawn into it because of a racist nutter' slant.  The problem is the countless people that seem perfectly normal but harbour objectional views and will act upon them (this excludes the 'oldies' that are generationally racist, but just don't know how to speak/call other races the PC way but harbour no bad feelings)",
            "review_date": "2011-04-24",
            "source": "rt"
        },
        {
            "content": "The tendency towards heavy-handedness and obviousness is mostly offset by the raw emotional depth and shockingly good performances (Stephen Graham, holy shit). It seemed like the conflict between Shaun's loyalties to Combo or Woody (who is almost absurdly good-natured and whom I envy for having the razor-sharp Lol for a girlfriend) should have been explored more. The ending we got is a bit of a copout character-wise if I'm reading it right (i.e., \"It's OK, he's not really racist, he's just mentally ill!\") Whatever, it's a good movie.",
            "review_date": "2011-04-23",
            "source": "rt"
        },
        {
            "content": "One of the best coming of age dramas I've seen in recent years.",
            "review_date": "2011-04-17",
            "source": "rt"
        },
        {
            "content": "Complete drivel - crap script and acting.",
            "review_date": "2011-04-17",
            "source": "rt"
        },
        {
            "content": "hm. Also ich fand den Film ganz gut aber irgendwie war er so... kurz?!? Es wird so viel nicht geklรคrt, auf viele Charaktere wird spรคter einfach nicht mehr eingegangen und irgendwie kam mir alles so gehetzt vor. Schade. \r\n3/5",
            "review_date": "2011-04-17",
            "source": "rt"
        },
        {
            "content": "Great movie! Thanks netflix!",
            "review_date": "2011-04-15",
            "source": "rt"
        },
        {
            "content": "Great acting and a wonderful script make one dark film.",
            "review_date": "2011-04-11",
            "source": "rt"
        },
        {
            "content": "FUCK PRICK LAD FAG QUEER GOOF MONG ร ยธยซร ยธ(TM)ร ยธยฑร ยธร ยนร ยธยซร ยธยตร ยนร ยธยขร ยนร ยธยฃร ยธยกร ยธยตร ยนยร ยธร ยนร ยธร ยธยณร ยธยซร ยธยขร ยธยฒร ยธ",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "Gritty and hard-hitting, kinda remind me of American History X. A bit on the heavy side for me, especially when I stayed up to watch it 'til 2am on a Wed night. Great music, too.",
            "review_date": "2011-03-23",
            "source": "rt"
        },
        {
            "content": "Good film showing England in 80s. It's not a film that would encourage you to visut England. Warning: it's full of strong language and racism!!",
            "review_date": "2011-03-19",
            "source": "rt"
        },
        {
            "content": "Great, intense, didn't move once while watching, couldn't take my eyes off it! Brilliant!",
            "review_date": "2011-03-16",
            "source": "rt"
        },
        {
            "content": "Another overrated work, I find this movie very predictable and shallow. The problem may be myself but comparing to \"The American History x\", this film is like Disney's anime. The only good thing in this movie is the little Shuan's performance.",
            "review_date": "2011-03-16",
            "source": "rt"
        },
        {
            "content": "Brilliant film!! Horrible, clever, sad, funny... Everything!! A must see for any english person.",
            "review_date": "2011-03-12",
            "source": "rt"
        },
        {
            "content": "reminds me of socity x",
            "review_date": "2011-03-06",
            "source": "rt"
        },
        {
            "content": "A gritty coming of age drama where the tension is built up by threat of violence that simmers below the surface until a explosive conclusion",
            "review_date": "2011-03-06",
            "source": "rt"
        },
        {
            "content": "great soundtrack   great film about  the life before and during the crossover into  the politics and racism that tore apart a movement",
            "review_date": "2011-03-05",
            "source": "rt"
        },
        {
            "content": "as much as the film was accurate of the time and culture.the simple fact was the film was not entertaining and at times hard to watch",
            "review_date": "2011-03-03",
            "source": "rt"
        },
        {
            "content": "This is England is one of the most evocative films you will ever watch; it is both compelling and harrowing in equal measure. Without giving too much away it centres around a young boy and his ingratiation into a family of skinheads and their ensuing cultural machinations. Utterly magnificent!",
            "review_date": "2011-02-26",
            "source": "rt"
        },
        {
            "content": "A depressing film.  It was very human and even touching in places.  I found the context depressing as well as the way the story turned out and the unpleasant characters in it.  By no means everyone was unpleasant though and I liked that.  What was most depressing was the fact that this captured a particular period in English history and yet, we don't seem to have moved on from then much.",
            "review_date": "2011-02-24",
            "source": "rt"
        },
        {
            "content": "Horrifyingly powerful and truly amazing.  Meadows does it again.",
            "review_date": "2011-02-22",
            "source": "rt"
        },
        {
            "content": "A work of art. Simply stunning.",
            "review_date": "2011-02-18",
            "source": "rt"
        },
        {
            "content": "What a bunch of feral pigs.  This truly sucks big time, don't bother with this nonsense...",
            "review_date": "2011-02-16",
            "source": "rt"
        },
        {
            "content": "A wonderful film.  Highly recommended.",
            "review_date": "2011-02-16",
            "source": "rt"
        },
        {
            "content": "I remember that period well. Sad times",
            "review_date": "2011-02-15",
            "source": "rt"
        },
        {
            "content": "This is a pretty good flick.\nShould be watched in conjunction with reading Bill Bufors'd \"among the Thugs\"",
            "review_date": "2011-02-15",
            "source": "rt"
        },
        {
            "content": "Definitely one of the most honest coming-of-age films ever made that, I suspect, would play even better if one had grown up in England in the '80s.  Young Thomas Turgoose is a revelation as a grieving outcast who looks for a father figure in the wrong place and changes the whole trajectory of his life.",
            "review_date": "2011-02-14",
            "source": "rt"
        },
        {
            "content": "There is no doubt that this film is a truly great piece of film-making. Shane Meadows crafts films in the same style as Martin Scorcese. We are given a glimpse into the lifestyle of a group of characters over a short period of time. It is very much a fly on the wall type of movie. The point of these films is to understand the actions of the characters rather than judging their actions. I have no doubt that there will be some people that tag this film as being racist which is rather missing the point.\n\nThe film follows Shaun a 12 year old being borough up in early 80's England. He has lost his father in the Falklands war and suffers bullying and isolation until he is befriended by a group of skinheads. The happy band are challenged when Combo is released from prison. Thomas Turgoose is magnificent in the lead role and the direction/screenplay are also spot on the mark. For anybody that lived through the period there are lots of reminders about the period. The film is based on Meadow's own childhood and is quite mesmerising at times.\n\nI was gripped throughout the film and it also gave me plenty to think about afterwards. What more can you ask for when going to the movies? I suppose if you go to the movies for escapism then go watch something else, but if you want a gripping thought provoking drama then it doesn't come much better than this. Outstanding!",
            "review_date": "2011-02-10",
            "source": "rt"
        },
        {
            "content": "England on the verge of cultural and political breakthrough... pretty rough stuff. A convincing story of youngsters looking for their way of life.",
            "review_date": "2011-02-09",
            "source": "rt"
        },
        {
            "content": "This is England is a movie written and directed by Shane meadows. The movie is about a troubled lonley 12 year old boy who finds accepteance with a group of older skinheads.\r\nThe boy Shaun played very well by Thomas Turgoose was an wonderful chaecter, very easy to relate to. This a good movie to watch if u have ever felt like an outcast and turned to hate to fit in and cope with life.",
            "review_date": "2011-02-08",
            "source": "rt"
        },
        {
            "content": "Poignant film about a boy who discovered that the bravado of the skinhead he sided with turns ugly.",
            "review_date": "2011-02-04",
            "source": "rt"
        },
        {
            "content": "A solid film in many respects. It's hard to watch this and not continue to be reminded of American History X, but I like the fresh take on what you could possibly call the skinhead sub-genre. The idea of a young kid getting involved in the lifestyle feels even more drastic than seeing Edward Furlong in the aforementioned movie. I think the theme of young impressionable kids with low self esteem always resonates and makes perfect sense. Hate is something that I think everyone feels the desire to embrace at one time or another. That's why it seems completely understandable that someone with a great deal of low confidence and naivete might be swayed by nationalism. To me it's really endearing, honest and heartfelt. While it may not be the best example of this lifestyle or my personal choice as a representation of contemporary British films, I do appreciate it.",
            "review_date": "2011-01-31",
            "source": "rt"
        },
        {
            "content": "I don't know why this came off as so bland, maybe because the skinhead/punk attitude has been depicted in a lot more ambitious ways. When you watch something like Romper Stomper, American History X or even Summer of Sam, they take you deep into the mindset of the lifestyle and mindset of the characters. They also manage to be more visually striking and the plot moves forward a lot more. This has character development and a decent story, it's just nothing new. Even the visual style is borrowed from Larry Clark/Harmony Korine. I think people who haven't been exposed to many movies like this will absolutely love it, but for me it just seemed to be the same old thing.",
            "review_date": "2011-01-31",
            "source": "rt"
        },
        {
            "content": "Damn the English are crazy",
            "review_date": "2011-01-30",
            "source": "rt"
        },
        {
            "content": "A story taking place in the nationalist milieu in england during the 80s.\nA bit disappointing regarding the hype around that movie.",
            "review_date": "2011-01-29",
            "source": "rt"
        },
        {
            "content": "\"This Is England\" is an interesting piece of storytelling but mostly it's an insightful view of a modern, rotting England. It's calm and violent, optimistic and pessimistic, sweet and raw, gentle and spontaneous. In one word, it's realistic. And, although the film is set in the '80s, its society is somehow familiar. It's up to the viewer of course, but indirectly the film gives the solution: it rejects violence after testing it and believes in believing.",
            "review_date": "2011-01-27",
            "source": "rt"
        },
        {
            "content": "1983, England, skinheads what more do you need.  I loved this film.  The  struggles of the main character Shawn struck a chord with me.  His performance was right up there with Norton in American History X.  Feeling totaly lost and like an outsider my entire young life I really identified with Shawn and his band of Misfits.  Everything is going great until one of the gangs older members gets out of prison with a new attitude toward black people.  Needless to say, all hell breaks loose and Shawn embraces his own dark impulses.  Until a near death in a fight between two skinheads does Shawn begin to see the error of his ways.",
            "review_date": "2011-01-26",
            "source": "rt"
        },
        {
            "content": "Maybe I just don't get English film. Maybe I don't get English history. Maybe I just have a distaste for films like this. As you can probably tell, I wasn't too taken with this film, which could have dealt with said subject matter in a more entertain... read more Maybe I just don't get English film. Maybe I don't get English history. Maybe I just have a distaste for films like this. As you can probably tell, I wasn't too taken with this film, which could have dealt with said subject matter in a more entertaining way. I feel like I'm missing out on something, because it's otherwise generally well-reviewed.",
            "review_date": "2011-01-24",
            "source": "rt"
        },
        {
            "content": "Superb movie - it truly captures England during the 80's.",
            "review_date": "2011-01-23",
            "source": "rt"
        },
        {
            "content": "This movie tackles a set and setting I can never experience: Thatcher-era lower-class British skinhead culture.\n\nThat said, this is damn fascinating, and also a great movie.\n\nI've only seen one other Shane Meadows movie (Dead Man's Shoes), but this is by far my favorite of the two I've seen. The storytelling, acting, and mise-en-scene are fucking sweet, and the verisimilitude attempted to bring and early-80s culture to life succeeds largely because of the performances from the actors and actresses.\n\nThomas Turgoose plays Shaun, a 12-year old social pariah who just lost his dad in the Falklands War. He joins a group of ska-loving, innocent skinheads, and eventually crosses paths with their just-released-from-prison racist nationalist leader, played awesomely by Stephen Graham (formerly Jason Statham's sidekick in Snatch among other roles). These two form a bond, and inevitably, the innocent Shaun must make important decisions regarding his social life in the face of racism and violence.\n\n\nThis movie does a great job trying to evoke its set, setting, and characters without being esoteric at all. You don't need to understand skinhead culture, ska, the Falklands War, or British Nationalism (I certainly don't) to get the meaning or sympathize with the characters, and that, I think, is awesome.\n\nThe cinematography is sweet, too. Meadows uses 16mm film to great effect (he used it in Dead Man's Shoes, too)",
            "review_date": "2011-01-19",
            "source": "rt"
        },
        {
            "content": "This Is England.\r\nLacking direction, but full of realism.\r\nThis is for sure one of those movies where not much intense actually happens, but you're cringing the entire time. It's both a strength and a weakness to the movie. When my friend suggested we watch it, I thought \"This is England? How do you fulfill that title?\" Turns out, That Was England. This is one of the grittiest, most honest portrayals of working/lower class England in the 1980s. I mentioned it was lacking direction, but I realized after-the-fact that it was intentional, the movie lacks a specific direction because the youth in that time were equally lacking and misguided.\r\nThe acting was terrific (thanks Britain for including almost entirely no-names), and the montages at the beginning and end gave a nice piece of all that England has been through in the last few centuries. If American History X and Oliver Twist got together, their child would be This Is England.\r\n\r\nWhy 70%?\r\nBecause while this is very solidly an incredible portrayal of lower class England in the 80s, I feel like I've seen it before. Also there was little backstory to even the important characters.\r\n\r\nExtra: The whole time I thought someone was gonna get knifed. They didn't. Sorry to spoil it for you... that's how life is sometimes.",
            "review_date": "2011-01-16",
            "source": "rt"
        },
        {
            "content": "a lot deeper than i thought it'd be",
            "review_date": "2011-01-14",
            "source": "rt"
        },
        {
            "content": "A gritty film that I wasn't really interested in seeing but was persuaded to after a massive hype. The film is indeed interesting and very well written. It tells a culturally relevant story which seems honest. \n\nThere's been a series made out of this, which I wouldn't mind having a look at to see the differences they have made. The ending is a bit shocking, but covers hard going issues well. The music really helps enhance this as well.",
            "review_date": "2011-01-14",
            "source": "rt"
        },
        {
            "content": "This is very slow-moving, but the importance of the subject matter and the realness of the acting make it well worth watching. Things like this are difficult for me to watch because they enrage me, but they also fascinate me. Although it's depressing, this is a well-made film.",
            "review_date": "2011-01-09",
            "source": "rt"
        },
        {
            "content": "Cute movie about a young English boy who joins a gang of Skinheads.  Characters are realistic and multidimensional, story is decent, and film does a good job portraying the varied attitudes of people (in this case Skinheads).",
            "review_date": "2011-01-05",
            "source": "rt"
        },
        {
            "content": "Coming from a Skinhead/Oi/Punk/Scooterboy background I have to say that the best message that this film portrays is the truth about Skinhead culture and that it's not based in racism. It's a shame that racists and nationalists over the water and at home have attached themselves to their culture and given it a bad name with the help of media idiots like Geraldo. This is a fantastic film. Touching and honest. And I am always so proud of Shaun at the end. What a good lad. :o)",
            "review_date": "2011-01-02",
            "source": "rt"
        },
        {
            "content": "3 stars. Great acting but it's just so bleak.",
            "review_date": "2011-01-01",
            "source": "rt"
        },
        {
            "content": "I'll say it again and again - there's something about English movies..",
            "review_date": "2010-12-28",
            "source": "rt"
        },
        {
            "content": "A look at 1980s British skinhead underground culture through a boy's involvement with a local gang. ( http://mediaje.blogspot.com/2010/12/this-is-england-2006.html )",
            "review_date": "2010-12-27",
            "source": "rt"
        },
        {
            "content": "Great movie about English skinhead culture, centering on a lonely 12-year-old boy whose father died in the Falklands War who is taken in by a group of local skinheads.  The film does a great job of showcasing the two different sects of skinheads - one violently racist/nationalistic and the other non-racist and more interested in fashion and music than getting into fights.  It's also interesting from the perspective of a Smiths fan, as it  is set in 1983 and showcases the depressed, Maggie Thatcher-cursed, increasingly irrelevant England that spawned The Smiths.",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "Incredible drama. Great acting from all, especially from the young lead. Heart breakingly good and provoking. I'm pretty sure it got me crying, but it was a while since I last saw it.",
            "review_date": "2010-12-21",
            "source": "rt"
        },
        {
            "content": "Flick was fantastic tale of boy who didn't fit in and found misfits then found himself....",
            "review_date": "2010-12-19",
            "source": "rt"
        },
        {
            "content": "good film but nasty in part,s",
            "review_date": "2010-12-14",
            "source": "rt"
        },
        {
            "content": "An amazing personal piece of filmmaking that really explores the need to belong somewhere and the eventual journey into adulthood.",
            "review_date": "2010-12-14",
            "source": "rt"
        },
        {
            "content": "After watching the tv series and never quite getting round to watching the film I decided now was the time, and I'm glad I did. What great acting, the cast are great, the soundtrack, clothes and hair cuts are brilliant too...proper 80s! The lad who plays Shaun is absolutely brilliant! With some quite out there scenes its not a film for the faint hearted but it's very entertaining!",
            "review_date": "2010-12-13",
            "source": "rt"
        },
        {
            "content": "Brilliant if you ask me! Really great and authentic acting work done by all the actors!",
            "review_date": "2010-12-05",
            "source": "rt"
        },
        {
            "content": "Gritty and holds back nothing. 1980's working class brought to life with such compelling screen-play. It delivered with such furiosity that US films fail to strike the note upon.",
            "review_date": "2010-12-04",
            "source": "rt"
        },
        {
            "content": "Very similar to American History X also a little disturbing.",
            "review_date": "2010-11-24",
            "source": "rt"
        },
        {
            "content": "Green Street Hooligans meets American History X meets Kids. A fantastic film in all areas.",
            "review_date": "2010-11-24",
            "source": "rt"
        },
        {
            "content": "Pretty interesting and insightful but feel it loses the plot towards the end.. pretty good performances",
            "review_date": "2010-11-23",
            "source": "rt"
        },
        {
            "content": "Excelent movie! speacially for those that one day  have danced ska wearing a pair of Dc martens boots!! and excelent soundtrack!",
            "review_date": "2010-11-22",
            "source": "rt"
        },
        {
            "content": "An incredible glimpse into the nationalistic madness that engulfed some social groups in 1980s England. A great history lesson and a shattering story. Its a pity the director didn't have a clear idea of how to round it all up.",
            "review_date": "2010-11-19",
            "source": "rt"
        },
        {
            "content": "Yet another cracker from Shane Meadows, this time set in the skinhead 80s. This film actually nearly made me cry at some points, I just love it.",
            "review_date": "2010-11-17",
            "source": "rt"
        },
        {
            "content": "Heartbreaking and an amazing masterpiece. This is what happening to people\nAll over the world. This is England. We all must make the right choice and change.",
            "review_date": "2010-11-07",
            "source": "rt"
        },
        {
            "content": "American History X English style. The characters are bohemian in their nature but have a certain passion for their beliefs or at least zeal. Unexpected ending that make this film worth watching but not really recommended.",
            "review_date": "2010-11-05",
            "source": "rt"
        },
        {
            "content": "Excellent. Hard watching at times",
            "review_date": "2010-11-01",
            "source": "rt"
        },
        {
            "content": "The best english film I've ever seen, and far better than the later miniseries.",
            "review_date": "2010-10-31",
            "source": "rt"
        },
        {
            "content": "I didnt know how good the movie was, but I felt super comfortable when watching that. With the music, and the history, and some of the unreachable dreams.",
            "review_date": "2010-10-30",
            "source": "rt"
        },
        {
            "content": "I thought it was amazing, although really disturbing in some parts.",
            "review_date": "2010-10-24",
            "source": "rt"
        },
        {
            "content": "Gritty is really a good word to describe this movie. I don't question why Combo attacks his friends in the end, but the big question is, \"Did Milky die?\" I heard that we are to decipher his destiny, whether he was meant to live or die, but in fact, it didn't matter. What mattered was how the kid Shaun was going to be affected after  experiencing so much so early in his life. blah, blah, blah, the reality is, Milky was so stupid to believe he could actually chill with Combo AND not get a beat down because he was black.",
            "review_date": "2010-10-20",
            "source": "rt"
        },
        {
            "content": "versi solo karir n sedikit radikal dari Stand By Me-nya Stephen King. Shaun, 12 thn, yg merasa dikucilkan masyarakat, dibully di sekolah, menemukan komunitas skinhead yg mau nerima dia apa adanya. setting di saat pemerintahan wanita besi Margaret Thatcher, Inggris sedang berperang melawan Argentina memperebutkan Falkland/Malvinas, pengangguran meningkat. baru ngeh ada nih film setalah taon ini keluar tv seri This Is England 86, spin off dari This Is England, juga diperankan oleh Thomas Turgoose.",
            "review_date": "2010-10-20",
            "source": "rt"
        },
        {
            "content": "Great Movie.  Saw it last night.  Been out for awhile, but I never heard of it.",
            "review_date": "2010-10-17",
            "source": "rt"
        },
        {
            "content": "What an ugly time period, the 1980s. What an ugly people, the English.",
            "review_date": "2010-10-17",
            "source": "rt"
        },
        {
            "content": "A very gritty film that didn't let me down, but didn't overly impress.",
            "review_date": "2010-10-17",
            "source": "rt"
        },
        {
            "content": "A very Euro style film (for obvious reasons, see the title for example) that was slow in most parts and tense in the rest. It's hard to choose a protagonist but very easy to find a lot of antagonists fairly early on. Nothing remarkable, but perhaps worth a try.",
            "review_date": "2010-10-14",
            "source": "rt"
        },
        {
            "content": "Very hard and rough picture of certain young and older misfits, experiencing what they can in Brittain. Graphic! Nice kid-view!",
            "review_date": "2010-10-13",
            "source": "rt"
        },
        {
            "content": "Taken me ages to finally see this and I'm so glad that I have. It's brilliant. Funny, scary, shocking and thought-provoking all at the same time. Just a fantastic piece of film.",
            "review_date": "2010-10-12",
            "source": "rt"
        },
        {
            "content": "Amazing. I bawled my eyes out at the end. Just... incredible. So good. You have to watch it.",
            "review_date": "2010-10-09",
            "source": "rt"
        },
        {
            "content": "Very good film, its story will take you through the lives of thugs. However you will feel so unclean and twisted you will want to have a shower afterwards.",
            "review_date": "2010-10-05",
            "source": "rt"
        },
        {
            "content": "A meticulously re-created early 80s, presented with stark and gritty realism, this flick looks fantastic. Combined with hefty subject matter and a powerhouse performance by Stephan Graham, 'This is one of the best British films I've seen recently.",
            "review_date": "2010-10-04",
            "source": "rt"
        },
        {
            "content": "After watchting the excellant tv series i revisited this film and remembered how fantastic it was. Graham is truly menacing as combo and Turgoose was a revelation as shaun. Fantastic!!!!!",
            "review_date": "2010-10-01",
            "source": "rt"
        },
        {
            "content": "A COOL ENGLISH MOVIE\r\nthis film is very good \r\nand fortunately the black guy in there gang dose not talk black or do anything gangstering.",
            "review_date": "2010-09-29",
            "source": "rt"
        },
        {
            "content": "No character is drawn in broad strokes or treated as some concept of a person, which is where the deep wellspring of humanism that lies beneath the film comes from.  The events that lead up to the tragic climax feel almost inevitable, but in between the damn good time you're having watching Shaun get pissed and the electric tension of a few key scenes, it rushes home with the unpreventable force of a train off its rails.  And when the climax occurs, it is a heart-rending one, as innocence is lost and youth seems far off.",
            "review_date": "2010-09-29",
            "source": "rt"
        },
        {
            "content": "Gritty and shocking, but also very funny at times. Well worth a look. Bested, however, by the 4-hour TV sequel This Is England '86 set 3 years later with all the same cast, which is utterly brilliant.",
            "review_date": "2010-09-28",
            "source": "rt"
        },
        {
            "content": "good movie, not so good serie!",
            "review_date": "2010-09-28",
            "source": "rt"
        },
        {
            "content": "Unmissable, gritty and humourous, with actors not acting, but ad lib-ing. a picture of life for the disaffected.",
            "review_date": "2010-09-27",
            "source": "rt"
        },
        {
            "content": "An almost perfect depiction of council estate depression in 1980s England",
            "review_date": "2010-09-26",
            "source": "rt"
        },
        {
            "content": "made me feel very on edge throughout - very effective film-making",
            "review_date": "2010-09-21",
            "source": "rt"
        },
        {
            "content": "Very much Shane Meadows' masterwork, a superb study of the corrupting powers of prejudice.",
            "review_date": "2010-09-17",
            "source": "rt"
        },
        {
            "content": "This movie is so real. People can just turn out to become simply so wrong.",
            "review_date": "2010-09-17",
            "source": "rt"
        },
        {
            "content": "I know, I know. I'm a bit late!I borrowed this on DVD and thoroughly enjoyed it. Harsh, brutal, moving and heart rending. Great performances from all and it really evoked the era well (I was the same age as Shaun in '83 - I can even remember the guy with the Rubick's cube).\r\nGreat stuff......now for the TV series!",
            "review_date": "2010-09-16",
            "source": "rt"
        },
        {
            "content": "Rewatched after starting the new series on Channel 4 (This is England '86) to refresh us on the story and Directing style.. superb.",
            "review_date": "2010-09-16",
            "source": "rt"
        },
        {
            "content": "'This Is England' is a gritty and sometimes intense tale of how a fatherless boy falls into the wrong crowd. Stephen Graham gives the standout performance here as a vicious skinhead who takes the young protagonist under his wing. A fine, fine British film.",
            "review_date": "2010-09-15",
            "source": "rt"
        },
        {
            "content": "Very good movie, recommended.",
            "review_date": "2010-09-15",
            "source": "rt"
        },
        {
            "content": "Hard hitting movie, excellent film.",
            "review_date": "2010-09-14",
            "source": "rt"
        },
        {
            "content": "Great, intense, didn't move once while watching, couldn't take my eyes off it! Brilliant!",
            "review_date": "2010-09-14",
            "source": "rt"
        },
        {
            "content": "gripping and shocking film about racism in England during the 80's. was disappointed with the way it ended. just felt like questions were left unanswered",
            "review_date": "2010-09-13",
            "source": "rt"
        },
        {
            "content": "Good movie not quite the level of Romper Stomped but still good.",
            "review_date": "2010-09-11",
            "source": "rt"
        },
        {
            "content": "I love British people ^:^",
            "review_date": "2010-09-11",
            "source": "rt"
        },
        {
            "content": "Gritty film set in 1980 paying special attention to the skinhead era.",
            "review_date": "2010-09-10",
            "source": "rt"
        },
        {
            "content": "This is a triumphant in every sense of the word. Shane Meadows has crafted a beautifully devestating masterpiece that suceeds in every way. The characters are fantastically written, and portrayed and the screenplay is immaculate. This is a film that despite all the drama involved, it turns into a horror and gets better as the characters and the story progresses. The soundtrack is also incredible, right up until it's heart-breaking conclusion. This is one of the finest British films to ever be released. This Is England.",
            "review_date": "2010-09-10",
            "source": "rt"
        },
        {
            "content": "Excellent drama about a young boy growing up in Eighties Britain and is drawn into a rascist skinhead gang.",
            "review_date": "2010-09-10",
            "source": "rt"
        },
        {
            "content": "Loved it all the way through",
            "review_date": "2010-09-10",
            "source": "rt"
        },
        {
            "content": "love this film.loving the new program aswell",
            "review_date": "2010-09-09",
            "source": "rt"
        },
        {
            "content": "awsum film, even better 2nd time around, cant wait 4 the series",
            "review_date": "2010-09-09",
            "source": "rt"
        },
        {
            "content": "powerful, tense, gripping, disturbing ... had to close my eyes sometimes, when it got violent... excellent acting and really well filmed, in a gritty, realistic way... loved the soundtrack!",
            "review_date": "2010-09-08",
            "source": "rt"
        },
        {
            "content": "Good take on the 80's, ending could have been better.",
            "review_date": "2010-09-07",
            "source": "rt"
        },
        {
            "content": "A genuine, powerful and moving portrayal of life in the eighties. The film (quite rightly) clearly shows the distinction between the skinhead movement as a lifestyle/culture and the image that later got associated with the BNP and Nazi thugs.\r\n\r\nWith a wicked soundtrack to boot and shot brilliantly, This is by far the most genuine representation of the eighties I've ever seen. Certainly Shane Meadow's best film to date in my opinion. I cant wait to see 'This is England '86' for the continuation of the storyline.",
            "review_date": "2010-09-07",
            "source": "rt"
        },
        {
            "content": "Gives you the hard-hitting violence you'd expect, but also a lot of tender, funny moments that you wouldn't. Great film.",
            "review_date": "2010-09-07",
            "source": "rt"
        },
        {
            "content": "This is without a doubt the best social realism film epitomising culture to a âTâ. It's gritty, hard narrative is well executed by cast supplemented by attention to detail, modern cinematograph techniques and is well worth a watch.",
            "review_date": "2010-09-06",
            "source": "rt"
        },
        {
            "content": "Gritty and well acted.",
            "review_date": "2010-09-06",
            "source": "rt"
        },
        {
            "content": "Startling and frank.  This film hit a nerve.",
            "review_date": "2010-09-01",
            "source": "rt"
        },
        {
            "content": "Wikipedia is not a scientific site, so youll have to take the next info with a pinch of salt. From what Ive read skinheads is a more eclectic gathering of people, than I first thought. It seems that Skinheads originated as a more hardcore working class edition of Mods in England in the middle of the 1960s. There was no political agenda other than social protest related to them in the early days. There was both black and white skinheads, and they were inspired musically by reggae/ska and soul music, as well as stylistically(clothes) by the jamaican Rude boy style. It was first in the late 70s that neo-nazi groups consisting only of skinheads began to establish themselves, and from then on the link between racism and skinheads were slowly semented by the media. This despite several Left-wing and anti-racist organizations such as Sharp(Skinheads against racial prejudice)organized by skinheads as a counter-measure.\r\n\r\nThe skinhead subculture constitutes a vital part of the background for the movie This Is England, a film that focuses on working class England in 1983. Its a sad time for England in the aftermath of the Falklands war. Widespread poverty and unemployment makes everyday life a struggle. Hopelessness rules among the nations youth. Shaun(Thomas Turgoose), a 12 year old boy experiences constant bullying at school, all the while grieving the loss of his father, a casualty of the Falklands war. Then one day hes approached by a group of skinheads hanging about under a bridge. They offer him friendship, understanding, and some fun activities(Smashing the interior of vacant buildings). Shaun also gets a crush on Smell(Rosamund Hanson)one of the female members of the group.\r\n\r\nWith the release of Combo(Stephen Graham)from prison however, things take a turn for the worse.As a fervent follower of the racist National Front organization Combo causes a split among the group of friends. One fraction follows the peaceful apolitical line of the old leader Woody(Joseph Gilgun),and the others join Combo in racist violence. Shauns anger and mourning at his fathers death is exploited by Combo, who becomes his rolemodel, and a second father to him. But Combo doesnt only bring deceptive propaganda with him, hes also plagued by the secrets of his past. Soon things start to spiral out of control, and Shaun is caught in the middle of something he doesnt really understand.\r\n\r\nThe people of this film moves through a suburban landscape in obvious decay: We are shown a series of run down brick houses, and empty factories. The skeleton of a small boat, stand as a landmark, along a desolate beach. All the while fields of wild grass and other shrub-growth is reclaiming territory from abandoned apartment projects. \r\n\r\nThe look and feel of the movie is due to Director Shane Meadows vision. His focus has obviously been on making a  nuanced movie, displaying both the physical condition people lived under, as well as people's mentality at the time. The darkness of the material might have been handled differently, with less character development, and more one-dimensional descriptions of the people that succumb to racist ideologies. Instead Meadows decided to breathe life into every character, and we get to understand how the hate and fear that generate racism is not only a result of extremist propaganda, but also in part caused by harsh national policies(Thatcherism), that led to unemployment, poverty and related substance abuse. Causing the disintegration of the societal structure, trough the breakdown of families. \r\n\r\nIf I were to pick out someone who truly excels in This Is England, it would have to be Thomas Turgoose, portraying Shaun. At age 14, acting seem to come as naturally to him as breathing. From his facial expressions to his voice and attitude, its all seemless, contributing to the semi-documentarian feel of the movie. \r\n\r\nThe music of This Is England is a story on its own. Boasting beautiful pieces for piano and violin, as well as a great selection of soul, ska, and punk hits of the time.\r\n\r\nAs far as I am concerned, This Is England stands alongside American History X and Romper Stomper, as the best examples on how to approach such sensitive subject matter in movie format.",
            "review_date": "2010-08-29",
            "source": "rt"
        },
        {
            "content": "Dobre, mocne, prawdziwe. Åwietny dzieciak - Thomas Turgoose.",
            "review_date": "2010-08-22",
            "source": "rt"
        },
        {
            "content": "Next to 'American History X', this film shows why Neo-nazis/skinheads scare the shit out of me. Great performances (especially by Stephen Graham) and well plotted, this is a disturbing tale of nationalism within the British nation and how a group of people are willing to do whatever it takes to save their so-called nation and pride.",
            "review_date": "2010-08-17",
            "source": "rt"
        },
        {
            "content": "A great snapshot of 80's era England with terrific performances all round.",
            "review_date": "2010-08-16",
            "source": "rt"
        },
        {
            "content": "so herz da movie i jst saw n can say wid utmost confidence dat \"this is the best movie iv seen in my life\"\n-------\nits a true meaning of masterpiece !!......m feling cmpletely numb n speechless....der r still few tears left in my eyes while m writing dis review.\n-------\n1. BEST CHILD ACT IV EVER SEEN (Thomas Turgoose 12yrs)\n2. Stephen Graham - best acting performance iv ever seen\n3. this is england - most influential n strongest movie iv ever seen.\n\ndis is the purest movie wid sm spine chilling scenes n some really happy moments which i bet can bring nyone to tears.\nits about unity,its about brotherhood.....its about skinheads n minorities.....this is england !!\nm really dumbstruck by dat boy's acting........cmmon man how can smone giv such a stunner for a performance ?!! ...\nits such a sweet n loving movie bt at da same tym reminds of cultural differences n disputes (racism) which suddenly turns everything tense.\neven the normal conversations can make u believe as if u r  remembering few old memories of urself !!\nemotions n feelings r the base of the movie !!!\n\nthis is british cinema at its very best !!!\n\ndis is like too much stuff for one day !!!.........u can bring an empty day to life wid dis movie..........\nit's hard hitting and gripping, right from the very beginning....\nthere is lots of violence and racism but nothing that isn't expected if your not narrow minded. This is a brilliant British movie\nthis is england touches ur heart den it grips the heart till u feel uncomfortable !!\nbt den again it brings in such scenes which eases out tension (jst lik pressure cooker) !!\nThe acting is very realistic and the locations really ground the film.\n\nlast bt not da least.........one of the best soundtracks n background score ever !!!.......i mean jst litsen to these songs......it arises a feeling of patriotism n sudden sadness !!\n\nrate - 10/10 !! (technically......else its infinity / 10 )",
            "review_date": "2010-08-14",
            "source": "rt"
        },
        {
            "content": "Kruttsterk film med en hovedrolle som funker helt villt. Eneste minus er at man fort skjoenner hvor det baerer hen.",
            "review_date": "2010-08-11",
            "source": "rt"
        },
        {
            "content": "(Watched Wed 11 Jun 2008)",
            "review_date": "2010-08-10",
            "source": "rt"
        },
        {
            "content": "Bloody 'ell.  The kid was funny.",
            "review_date": "2010-08-08",
            "source": "rt"
        },
        {
            "content": "I love and hate this film at the same time. Beautiful, powerful film , almost feel like a documentary yet hate the fact that how powerful  and dangerous brainwashing is. When you first watch this, you know the violent is coming but not the sweet and sadness. The little boy shaun gave a great performance.. almost similar to American history X but this one has more realness to it. Great film!",
            "review_date": "2010-07-30",
            "source": "rt"
        },
        {
            "content": "An excellent mix of 80s UK nostalgia, storytelling and characters - utterly absorbing and heartbreaking.",
            "review_date": "2010-07-30",
            "source": "rt"
        },
        {
            "content": "**** Very Good. \nCaptivating from start to end. This is a raw account of a young man's troubled life. You must withstand some tough scenes, but altogether it is worth it.",
            "review_date": "2010-07-29",
            "source": "rt"
        },
        {
            "content": "I had seen this movie yesterday on television. I had read about it online around a year ago, it seemed interesting (somewhat). The actors portrayed the characters wonderfully and honestly. The subject matter is powerful and hurtful however there are moments where it is sympathetic toward diversity as well as odd and hilarious.",
            "review_date": "2010-07-26",
            "source": "rt"
        },
        {
            "content": "Saw this movie on cable...it was an interesting showcase of English youth and the coming of age of a lad who is unaware the peers who befriend him have negative views of others to the point of lethal results.",
            "review_date": "2010-07-25",
            "source": "rt"
        },
        {
            "content": "An extremely smart and poignant view of on the \"coming of age\" genre. This film transcends the quaint and bubbly British film medley that has become the staple for the past ten years. This is a grand showcase of the choices teenagers make in regards to their futures. Fantastic casting and spectacular casting. Highly recommended,",
            "review_date": "2010-07-25",
            "source": "rt"
        },
        {
            "content": "The film is a strong drama which symbolizes the impact the Battle of the Falklands had on its fellow British and how immigrants in England took racism from all the English. The film does have strong points in it. The actors such as Thomas Turgoose does a good job as Shaun a 12 year old boy whose father died in the Battle, and is bullied and abused at school because of it. Until Shaun makes friends with a skinhead fraternity, he feels accepted and soon becomes a skinhead. But when the leader of the group Combo who just returned from jail decides to join in the fight against the Pahkis in their own hometown, Shaun decides to join despite what his freinds say.It's only that along the way Shaun begins to realize that what him and his friends stand for is not the answer to making his country a better place and justifying what happened to his dad. The decade in which this film is set is iconic, starting off with flashbacks from the battle, then Atari, discos and Margaret Thatcher. The speech in which Combo makes in his flat to the group is iconic as well as Shaun at the end throwing the flag which symbolizes the fight into the ocean. The hair and makeup is also a thing that should be considered a job well done. A really good drama, if only it wasn't for all the strong swearing and the disturbing and violent scene in which a Jamacian is beaten. I would say this is an all great film. Be warned though this is a strong film at some points",
            "review_date": "2010-07-14",
            "source": "rt"
        },
        {
            "content": "Have got to see more of Thomas Turgoose.",
            "review_date": "2010-07-06",
            "source": "rt"
        },
        {
            "content": "I would've thought this was the greatest film ever made if I saw it when I was in high school. The music is awesome.",
            "review_date": "2010-07-06",
            "source": "rt"
        },
        {
            "content": "Very disturbing and well done movie about the complexities of skinheads in England, through the eyes of the 11-year-old protagonist.",
            "review_date": "2010-06-30",
            "source": "rt"
        },
        {
            "content": "Hate can be like cement.  It can take time to set and be far more difficult to overcome after it sets than beforehand.  This is an apt, stirring study of (and appeal to) those whose hate is still in the process of setting.",
            "review_date": "2010-06-27",
            "source": "rt"
        },
        {
            "content": "Not the grittiest story about skinheads but at the same time, not an easy film to watch. Seems like an 80s music video at time, but that is not a bad thing.",
            "review_date": "2010-06-22",
            "source": "rt"
        },
        {
            "content": "I can't help but compare this to film's of similar content. The acting in this movie was quite good, although perhaps not quite as good as say Made In Britain, there is only a marginal difference between this movie & that one in the acting, at best. \n\nThe story was MUCH better, not the least of which is due to the fact that there is a good deal more character development; although, I would like to have seen more of an after-story, detailing what happens to the character's, such as what kind of reception did the punk kid get, the one who got kicked out of the car, once he returned to his friend's... I was surprised that they showed no repercussions from the idiot's robbing the store. After all, the owner knew Shaun & his Mom and Combo did threaten the owner's life... The ending made sense, tho I would like to have seen what happened to the group after the beating received by Milky, at the hand's of Combo.\n\nI was surprised that there was no mention of the 'traitor to the human species' political party the BNP, formed in 1982, after splintering from the 'traitor to the human species' National Front...\n\nThe music, although not perfect overall, was a thousand times better, especially the song at the beginning, during the opening credit's. The choreography, between that song & the video footage is virtually flawless.",
            "review_date": "2010-06-20",
            "source": "rt"
        },
        {
            "content": "The story of a young boy grieving the death of his father during the Falklands war. He befriends a gang of skinheads after getting bullied on his way home. A gritty and realistic portrayal of early 80's gang culture during the Thatcher years. Some great performances from a very scary Stephen Graham and a talented young Thomas Turgoose. \n\nThis is by no means a classic but made interesting viewing. According to Shane Meadows website This Is England '86 will be hitting screens this autumn.",
            "review_date": "2010-06-19",
            "source": "rt"
        },
        {
            "content": "(#18) Now THAT'S more like it! Best movie I've seen so far this summer. The British answer to AMERICAN HISTORY X, but without the Hollywood polish. A touching, tragic, and poignant story. Final grade: A-",
            "review_date": "2010-06-17",
            "source": "rt"
        },
        {
            "content": "This film is absolutely flawless. Apart from showing the truth about the skinhead culture, the acting is so realistic and it really feels like it was filmed in England in the 80's. The story depicts a young boy, Shaun Fields (played by Thomas Turgoose) who lives with his mother after losing his father in the Falklands during the early 1980's. At school he is bullied and ridiculed and then Shaun finds friendship and respect in a skinhead gang, led by the likeable Woody.\r\nTurgoose was outstanding as Shaun, an amazing talent. The movie is funny, gritty and compelling!",
            "review_date": "2010-06-17",
            "source": "rt"
        },
        {
            "content": "An eye-opening, gritty and thought-provoking British film from acclaimed director Shane Meadows, This Is England tells the tale of 80's Britian, and revolves around a young and troubled boy who's life changes when we joins a gang of local non-racist and charismatic skinheads, even adopting the dress code. But the gang soon becomes divided and things turn nasty.\r\n\r\nThomas Turgoose shines in his role as bullied-at-school turned skinhead youngster Shaun, while Stephen Graham excels as the violent Combo amidst a backdrop 80's England, Meadows montaging what made England exciting back then (CDs, punks, the blasted Rubikâs Cube) with what made it fearful (riots, strikes, war). As a nostalgic glimpse of 1983, itâs immaculate.",
            "review_date": "2010-06-15",
            "source": "rt"
        },
        {
            "content": "amazing, truely amazing",
            "review_date": "2010-06-13",
            "source": "rt"
        },
        {
            "content": "Amazing, humane and haunting.  This is not only a bittersweet, nostalgic period piece and an informative look at a pivotal moment in the history of the UK skinhead subculture, but also an engrossing character study that deals seriously with the problem neo-fascist violence in Thatcher's decaying, post-industrial England.  I was surprised by how much I loved it. I strongly recommend it to anyone interested in recent history, or just in good films.",
            "review_date": "2010-06-13",
            "source": "rt"
        },
        {
            "content": "This is really a superb piece of work from one of England's most prolific and effective directors. The storyline is inspired and Meadow's storytelling is intense and at times incredibly taut and suspeneful, with events transpiring in a slow and harshly observed manner. The characters are richly written and superbly acted, with Turgoose and Graham standing out and offering realistic portrayals of a disillusioned and violent progression into aduthood. Setting the film in the throws of 1980's Britain is inspired, the film is very much a history lesson as it is a film, making it even more of an asset to British cinema. This is one not to be be missed.",
            "review_date": "2010-06-12",
            "source": "rt"
        },
        {
            "content": "i thought it was just about skins, but it was not only subculture but also....everything like racism, war, 1980s ...i'm ashamed to say that i don't know what happened and what they thought about those happenings. it was a little hard to hear combo's opinion about immigrants because i live in the uk now.it reminded me of American History X.combo...i can't blame him because i can understand what made him do such things.this is one of the greatest british films like \"BOY A\" and \"QUADROPHENIA.\"it made me want to buy Ben Sherman.",
            "review_date": "2010-06-10",
            "source": "rt"
        },
        {
            "content": "Well acted and moving.",
            "review_date": "2010-06-07",
            "source": "rt"
        },
        {
            "content": "This movie is worth seeing.",
            "review_date": "2010-06-06",
            "source": "rt"
        },
        {
            "content": "Wow.  That's the first thing I can think of when talking about this film.  It's so gritty and emotional, it just hits you at the end.  This is England deals with racism and loss of innocence so poignantly and intelligently.  Not easy to swallow by any means, but it's a very good film.",
            "review_date": "2010-06-02",
            "source": "rt"
        },
        {
            "content": "I really enjoyed this movie. Always fascinated with English culture. Also very sad.",
            "review_date": "2010-05-31",
            "source": "rt"
        },
        {
            "content": "This is England was a good story somewhat let down by the telling. Despite a strong plot and good acting, it felt at times somewhat gimmicky. The overuse of bland piano music in an attempt to provide emotional weight was unnecessary and distracting, and there were some slow motion montages - again set to music - that seem to have been inspired by music videos or high street fashion commercials. It is a shame that the pudding was overegged in this way, as a more straightforward approach would have done better justice to what was otherwise a compelling story.",
            "review_date": "2010-05-30",
            "source": "rt"
        },
        {
            "content": "A great film that really pulls you into the story. I like the way it mixes serious with funny so that it doesn't become too heavy to view.",
            "review_date": "2010-05-30",
            "source": "rt"
        },
        {
            "content": "today i figured that there is somethin' we can call a \"Masterpiece\"",
            "review_date": "2010-05-29",
            "source": "rt"
        },
        {
            "content": "Surprisingly great. I really didn't know about the origins of skinheads or the issues surrounding them at this time, and \"This is England\" is really interesting. Powerful movie. Can't wait for the TV spin-off :)",
            "review_date": "2010-05-25",
            "source": "rt"
        },
        {
            "content": "Excellent film whose story quite deliberately feels very familiar nearly 30 years on from its setting. For all that, it does a wonderful job of recreating England in the early 80's in all its Thatcher-ed glory: skinheads, ska, Falkland War and all.",
            "review_date": "2010-05-24",
            "source": "rt"
        },
        {
            "content": "Loved it justa little bit more!",
            "review_date": "2010-05-23",
            "source": "rt"
        },
        {
            "content": "Powerful look at racism in England",
            "review_date": "2010-05-22",
            "source": "rt"
        },
        {
            "content": "Shockingly realistic ending.",
            "review_date": "2010-05-19",
            "source": "rt"
        },
        {
            "content": "See this movie. No excuses, watch it as soon as you possibly can. Had no idea what I was walking into when I started watching this. An absolutely excellent film.",
            "review_date": "2010-05-17",
            "source": "rt"
        },
        {
            "content": "At first I thought the film's about Skinheads in England. It's beyond that. Set in 1983, it potrays the situation in England with Falkland's War and racism issue filled the air. It was shown to us in the eyes of twelve-year-old Shaun lived in British working-class district and found himself fit in a bunch of Skinheads. Later the gang spilt up, and he's influenced to act like a racist, a chauvinist. All and all, it's worth to watch.",
            "review_date": "2010-05-13",
            "source": "rt"
        },
        {
            "content": "Powerful, moving, bleak...",
            "review_date": "2010-05-09",
            "source": "rt"
        },
        {
            "content": "Another great unmissable British movie. The story was brilliant, and the wonderful script helped it shine ever better. What really blew me away in this was the emotional score amongst all the drama going on, and the mind blowing performance of Stephen Graham as Skinhead Combo, who practically and realistically stole the movie since his introduction halfway through. Shane Meadows proves he's one of the finest directors around, and promises a lot in the future of the film industry. Some lines in the script, especially in the scene when Combo feuds up with Woody and convinces his mates to join him in the fight for England, were just out of this world. I just think an alternate ending could have done a little better, and I hoped that the film will reach a pinnacle but unfortunately didn't, but will stay nonetheless a splendid piece of work.",
            "review_date": "2010-05-06",
            "source": "rt"
        },
        {
            "content": "The story of this boy is emotional, brutal, and incredibly gripping. This movie is Phenomenal!!!",
            "review_date": "2010-05-04",
            "source": "rt"
        },
        {
            "content": "Every Brit should watch",
            "review_date": "2010-05-03",
            "source": "rt"
        },
        {
            "content": "Whatever criticisms I gave of Dead Man's Shoes (which is still amazing) I think this film makes up for them. Brutal and gritty from the off the story is brilliant and doesn't let up until the end. The young lad (Turgoose) is perfect for the role and Graham is also awesome. Can't wait to watch Sumers Town now.",
            "review_date": "2010-05-03",
            "source": "rt"
        },
        {
            "content": "very human. highest recommend.",
            "review_date": "2010-05-02",
            "source": "rt"
        },
        {
            "content": "Shane Meadow's brilliant portrayal of 1980's Britain is largley due to the brilliant cast selection. A young Thomas Turgoose brilliantly steps into the role of lonley 12 year old Shaun, giving him the rough edge and wit which comes across as natural rather than acted. \r\nHis blossoming friendship with a gang of 80's skinheads in the first half of the movie is often hilarious and sweet, but is in the second half of the movie, with the violent introduction of the brilliant Stephen Graham as Combo, which really kicks the movie into life.\r\nFrom the opening scenes of broken Britain to the violent and emotional end scene, Meadows has created his best movie to date.",
            "review_date": "2010-05-02",
            "source": "rt"
        },
        {
            "content": "Brutally honest and competently implemented, an insight into the mindset (and instability) of the great british thug.  But not a work of major importance, somehow less incisive than the definitive Clockwork Orange.  \r\nAnd somewhat apologetic, denying that there is a race problem beyond a few exceptional hard cases.  But entertaining, amusing, watchable.",
            "review_date": "2010-04-30",
            "source": "rt"
        },
        {
            "content": "close description on punk lifestyle, how it develop, the friction in it between the racist line and the straight edge",
            "review_date": "2010-04-30",
            "source": "rt"
        },
        {
            "content": "After seeing this, my opinion is that the British film industry is starting to get better than Hollywood. This movie has it all, near perfect directing by Shane Meadows, perfect writing, perfect acting, and perfect cinematography. Almost all the characters are fleshed out and really give something to the flow of the movie. There are like one or two minor characters that really dont matter but then again this is an autobiography of the director's childhood,so maybe they mattered to him. They really worked hard to make costumes and sets like the 80's. It feels like you are actually watching an 80's movie. I was most impressed with Thomas Turgoose's preformance. Now that kid has true talent. I would love to see more movies with him in it. Overall this is just a great movie that should not be missed even if it has a really sad and mildly disturbing part that involves racism.",
            "review_date": "2010-04-28",
            "source": "rt"
        },
        {
            "content": "It started out by charming my socks off, then quickly became frightening, which is fitting since that is exactly what the film is trying to say about the skinhead subculture that is the focal point of the plot.  According to the film, the skinheads began as a fun-loving gang rebelling against superficiality by committing petty vandalism.  When a former \"member\" is released from prison, though, he brings with him an anti-immigrant philosophy that divides the group and turns the skinheads into the neo-nazis that we know them to be today.  All in all, it makes for a damn compelling movie, going into similar territory as AMERICAN HISTORY X in terms of brain-washing youth etc. but it does so a lot more subtly before arriving at the brutal conclusion.",
            "review_date": "2010-04-26",
            "source": "rt"
        },
        {
            "content": "Great Movie  Skins were cool back then",
            "review_date": "2010-04-24",
            "source": "rt"
        },
        {
            "content": "to class what more can be said just like the 80's spot on and funny as well..",
            "review_date": "2010-04-21",
            "source": "rt"
        },
        {
            "content": "This movie is very true to life. Fantastic movie. This shows that England is not as posh and ritzy as we think of. This is England is a real depiction of 1980s skinhead culture in England as it goes down to the more gritty side of English nationalists and white supremacists. \n\nAnd  Thomas Turgoose's dynamic acting must've made his mummy proud in which this film is dedicated for.",
            "review_date": "2010-04-20",
            "source": "rt"
        },
        {
            "content": "Movies about groups functioning within a subculture are usually harrowed with emotion being that must subcultures revolve around freaks and fuck ups and those outside the boundaries of society. This is England is no different. Taking place in the grim side of  Thatcher era England circa 80?s when Doc Martins and skin heads represented the nationalists, those behind the Faulklands war and those in support of St. George?s Cross. We see this group getting on with their daily and those members involved in the stereotypical life of deceit and dire. A prior leader named Combo returns from the pen to reclaim his territory and although is a rough nationalist intellect internally is heartbroken and rancid because of his childhood. His volatile personality, played brilliantly by Stephen Graham is a man capable of murder, true hate, and ne who embodies rage. The movie is told from the eyes of a child seeking a father figure after losing his own to the war and carries a great tradition of sympathy through film. If you liked SLC Punk, Trainspotting, or Billy Elliot this is for you.",
            "review_date": "2010-04-18",
            "source": "rt"
        },
        {
            "content": "http://chillibean.blogspot.com/2010/09/film-tv-review-this-is-england-this-is.html",
            "review_date": "2010-04-15",
            "source": "rt"
        },
        {
            "content": "Che musica, che fotografia, che sceneggiatura, che attori, che bella sorpresa! Finalmente un film inglese tosto, schietto, realistico e surreale nello stesso tempo, alla faccia di Trainspotting! Il disagio e la crisi d'identità di una nazione di grande tradizione storica raccontate attraverso il disagio di un bambino che ad un certo punto si identifica negli emarginati, ai tempi della guerra delle Falkland. La scelta delle canzoni è tra le meno banali, la musica di Ludovico Einaudi dà un tocco assolutamente romantico alla immagini molto molto belle. Questa è l'Inghilterra, questo è cinema.",
            "review_date": "2010-04-14",
            "source": "rt"
        },
        {
            "content": "Gritty take on 80s skinhead culture in Britain. Terrifying in its realism. Thomas as Shaun is seeking certainty, role models, stability, but so is gang leader Combo, ably played by Stephen Graham (Tommy from Snatch).",
            "review_date": "2010-04-12",
            "source": "rt"
        },
        {
            "content": "This is england apparently. I think I missed this era. Its entertaining but at times difficult to watch. Eli puts in a good performance but the dude from snatch absolutely steals the fuckin show!! His acting was real impressive, he was somewhat slightly intimidating as Compo from Last of the Summer Wine. That was his name wasnt it. Anyway, its slightly racist on the outside but seems to be more about fearing the psycho scouser man more than anything else. So in my opinion its about mental illness..... Yeah I dont know where I'm going with this, I'm just avoiding going for a run.",
            "review_date": "2010-04-09",
            "source": "rt"
        },
        {
            "content": "This Is England showed an 11 year old boy called Shaun facing a rough life in his own way. The movie showed his progression from lonely boy, to member of skinheads, but most importantly how the changes were made and the reason behind it. There was a scene in the movie after Shaun was shaved, dressed up to fit in with his mates, and walked with them in a dirty area that totally captured the British atmosphere.You must watched it and understand the beauty of it. Director Meadows delivered a difficult theme of youth on the ground of racism.Although this movie was violent and brutal, it had some funny parts that made the movie changed from mood but then Meadows kicked it on with a sharp scene. Marvelous.",
            "review_date": "2010-04-08",
            "source": "rt"
        },
        {
            "content": "Maybe it is a good document of how the skin movement evolved to the terrible associated stuff, and also about how people gets involved in a band, but it more disgusting and sad that thrilling.",
            "review_date": "2010-04-06",
            "source": "rt"
        },
        {
            "content": "Shane Meadow's film has a tight script and the characters are honest and believable. The film takes a look at the choices made by some young people who are disillusioned as their lives risk to crumble around them. Gritty, powerful and unforgettable.",
            "review_date": "2010-04-05",
            "source": "rt"
        },
        {
            "content": "Gritty and heart-warming, although they didn't need to hammer the message home. I enjoyed the style",
            "review_date": "2010-04-05",
            "source": "rt"
        },
        {
            "content": "A great little film that doesn't hold much back. I like the raw and gritty feel of the filming. About a boy who comes across a group of skinheads and then the consequences of certain decisions and those he keeps company with shape the way the story unfolds. It's a good insight into northern England in the early 80's.",
            "review_date": "2010-04-04",
            "source": "rt"
        },
        {
            "content": "Really liked it ! Great acting",
            "review_date": "2010-04-04",
            "source": "rt"
        },
        {
            "content": "First this movie makes you feel happy actualy..\r\nIt's so cute for little Shaun..\r\n\r\nBut then Combo ruins everything..",
            "review_date": "2010-04-04",
            "source": "rt"
        },
        {
            "content": "Could appreciate this own serious story and british english accents.",
            "review_date": "2010-04-03",
            "source": "rt"
        },
        {
            "content": "No surprises, but strong performances and a well-told story of an angry, troubled child won over by a charismatic racist makes for a compelling film all the same. Well worth seeing.",
            "review_date": "2010-04-02",
            "source": "rt"
        },
        {
            "content": "So, that is how it happens. Like an ice-cold claw, touching your heart and freezing it up, this movie sinks into your conciousness. \n\nShaun, searching for shelter, a father-figure and acceptance, meets a group of Skinheads. Although much younger than the rest of them, he becomes a part of the group instantly. He was lonely, sad and depressed before. Now, he belongs.  Suddenly there are people who stand up for him. He can follow their rules, adopt their dress code and their brutal humor.\n\nThings change after Combo, a former member of the group, comes back from jail. Infected with extreme inhuman hatred, he takes over the leadership of the group. Shaun soon looks up to him. It seems like he has found a replacement for his dead father. But the spiral of brutality and blind hatred keeps spinning and tears Shaun deeper and deeper into the deadly undertow.",
            "review_date": "2010-04-02",
            "source": "rt"
        },
        {
            "content": "Very well acted and written film about the growth of racism in skinhead culture in the 1980's. The characters are very believable and part of what works so well in this film is the fact that the main racist character is not portrayed as a simple boneheaded idiot, but is made three dimensional by the script and acting.",
            "review_date": "2010-04-02",
            "source": "rt"
        },
        {
            "content": "this film may seem to deal with racism, but the activities of the national front were skimmed over when this should have been a central issue. The group wasnt seen to be too much at fault, their treatment of the foreign shopowner gained laughs from the people i was watching it with, not taken veey seriously.",
            "review_date": "2010-04-01",
            "source": "rt"
        },
        {
            "content": "unforgettable. performed by a relatively inexperienced cast, the acting can sometimes feel rather unconvincing, but that doesn't seem to matter as the story is so rich with emotion. I expect this film will have brought tears to many eyes and will continue to do so for years to come. the issues raised by this film are still present to this very day. this film is ruthless in its honesty and bluntness and is truly eye opening. \n i wish i could have given it five stars but i understand that it was produced on a small budget and im afraid that means that the acting was slightly compromised. do not let that put you off seeing this film though. it will not dissapoint!",
            "review_date": "2010-04-01",
            "source": "rt"
        },
        {
            "content": "Yet another film i blubbered at. Hauntingly stunning.",
            "review_date": "2010-04-01",
            "source": "rt"
        },
        {
            "content": "This film holds a mirror up to the other side of England and the struggles it threw during the Thatcher era.  England was felt to be split in two at the time with an ever-more angered youth and the superb, natural, brilliant acting of This Is England drags you through it by your hair.  An absolue gem.",
            "review_date": "2010-04-01",
            "source": "rt"
        },
        {
            "content": "good film its good old proper england",
            "review_date": "2010-03-31",
            "source": "rt"
        },
        {
            "content": "Not as good as the ridiculous reviews make it out to be.  The best parts are the message about what is, was & will be England (for those people that seem to have a fantasy view of it), and Stephen Graham's great portrayal.  Good performances by Thomas Turgoose and Andrew Shim.  The film was a little slow in many parts.  There was not enough racial violence for reality.  And, there was not enough 80s nostalgia for my liking.",
            "review_date": "2010-03-29",
            "source": "rt"
        }
    ]
}