{
    "rating": 6.3,
    "release_date": "Invalid",
    "num_reviews": 70,
    "genres": [
        "French(Canada)"
    ],
    "summary": "A successful lawyer with a perfect life murders his wife's lover and assumes his identity. He flees to an isolated part of Yugoslavia where he gets another shot at being himself and seeing the big picture.",
    "reviews": [
        {
            "content": "Will surprisingly grab you as you are sucked up in the selfish moves of a seemingly boring lawyer as he ends up on the edge of survival",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "Great suspense, well acted, the images were well constructed......",
            "review_date": "2014-11-03",
            "source": "rt"
        },
        {
            "content": "loved this story of how easily life can change, making the wrong choices etc ..",
            "review_date": "2014-07-19",
            "source": "rt"
        },
        {
            "content": "Movies that you know nothing about but end up in your cue for some reason that are excellent- this is one of those.",
            "review_date": "2014-05-13",
            "source": "rt"
        },
        {
            "content": "A film that makes you wonder about circumstantially leaving riches, career and children behind to be a photographer in war-torn Serbia, living on a 100euro/month rental in the middle of nowhere. For much of the movie, one keeps asking, \"why?\" but by the abrupt end one can only conclude: \"if so, why not sooner?\"",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "Duris gave a brilliant performance in this intense and complex drama of self discovery and narcissism. The cinematography was beautifully dreamy and poetically realistic at the same time.",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "This a pretty damn good psychological thriller/character study of a man who, strangely enough, starts to live the life he always wanted to as a photographer, but didn't in order to provide for his family, after accidentally murdering his wife's lover and escaping the law by pretending to be him and faking his own death.  The film sees the downward spiral his life takes as he's haunted by the guilt of killing this guy and the fact that he will never see his family ever again.  But, at the same time, this torture he puts himself is totally self-imposed.  There is no reason he couldn't have, if he had thought about it logically, admitted that this was all an accident as Greg, his wife's lover, kept pushing, prodding and provoking Paul even after as he was trying to leave after finding out the truth.  It's kinda hard to feel sympathy for Greg, because there's no real reason for him to say the things he did and he only chose to do so to rub in the fact that his wife doesn't love him anymore and how Paul gave up on his real passion.  It's certainly hard to feel sorry for Greg and his eventual downfall, but at the same time Paul really shouldn't have tortured himself the way he did.  Particularly not for Greg being a massive asshole and even less for a woman who didn't love him and felt the need to sneak around his back to have this affair.  But, at the same time, he wasn't thinking logically and not that you can blame him in the situation that he finds himself in.  By doing what he did, I think he makes his life more complicated.  Maybe by pretending to be his wife's lover, that he'd feel closer to her than he has in years.  The reasons are left ambiguous, though Paul composes an email confessing to his wife what he did and that he didn't want his kids to know his dad as a murderer, even if he was loving and caring to them.  He erases the email before sending it, but I still think that his thought process for doing what he did were left purposely ambiguous.  What drives a man to do the things he did and that adds a compelling little twist to the character.  The acting is great, Romain Duris does a great job at capturing this man's fragile emotional state, even though the appearance he gives off is as someone who is confident and calm.  The guy's just great here honestly.  The film might not have the showy or over-the-top dramatic moments, sort of like A Hijacking, but it is an intriguing, and ultimately, a very good movie about a man who destroys his own life over one little accident and how he finds redemption where, and when, he least expects it.",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "Eric Lartigau's stylishly told story of a man who kills his wife's lover--and then impersonates the dead man.  Surprisingly--our protagonist proves quite successful in his new life, more so than the dead man was. Reminiscent of Antonioni's The Passenger,  and of The Talented Mr. Ripley.  Another great job in the lead by France's hottest male actor (Romain Duris).",
            "review_date": "2014-01-15",
            "source": "rt"
        },
        {
            "content": "Interesting but implausible - it jumped all over the place, made litle sense and the end was open ended. Still Duris is a good lead and its always nice to see Catherine Deneuve.",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "How come that such a clichéd plot is striking and smooth simultaneously is the elegance of the rapid exposure of events of the fluctuated selection for both round and flat characters? undergoing the burden of the rough leading path to a rewarding climax. A mix of Volver and Unfaithful, yet a complexity of many lessons is never less than these scrambled words. A new level of an intensity unfelt before rattles the very exquisite taste of a viewer. Still, sounds acquainting a scenic projection add up to the overall beauty of the art work. But again, babbling about this roll is as much important as viewing.",
            "review_date": "2013-11-16",
            "source": "rt"
        },
        {
            "content": "Definitely kept me involved -- and the combination of Romain Duris and Catherine Deneuve was pretty much a guarantee that I was going to see this movie. \"The Talented Mr. Ripley\" did this plot better, but this one is compelling and tense too. The ending is sort of random and there are a few plot gaps, but this is really more about the character than the story.",
            "review_date": "2013-10-06",
            "source": "rt"
        },
        {
            "content": "When I found out the official French title of this film (\"The Man Who Wanted to Live His Life\") everything clicked (no photography pun intended) for me. \"The Big Picture\" is a horrible English title for this film. Venting aside, Romain Duris does a great job of embodying his character, who is caught between old and new realities. Is the life you want really the life you expect? How much control do you have over your life, or is it simply a succession of choices and their consequences?",
            "review_date": "2013-09-25",
            "source": "rt"
        },
        {
            "content": "It's an existential bleak movie starting as upper-middle class domestic melodrama that quickly morphs into something totally different (at first, you wish they had sticked with the former, and only after the movie ends, you realize they were much more ambitious). While the movie is not at the level of \"De battre mon coeur...\", it is another great turn from Romain Duris who also shares 2 or 3 scenes with Deneuve.",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "Mycket bra film som går nu på viasatkanalerna; hög kvalitet som vanligt på fransk film!",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "Great lead up, breathtaking scenery of Adriatic coast, terribly lazy ending.",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "Nice movie but a bit slow!!!",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "Solid performances with great direction.",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "Très bon film servit par une excellente histoire et des acteurs toujours justes notemment Arestrup (comme d'hab j'ai envie de dire). A voir.",
            "review_date": "2013-02-28",
            "source": "rt"
        },
        {
            "content": "I enjoyed watching this, but wonder if the director achieved his goal. Yes the guy ends up in a new life, but its hard to see that he is enjoying living it.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "Marvelous film--endlessly beautiful, surprising, thoughtful. I've been taken aback at the impressions of other reviewers, who seem uniformly not to have taken note of, well, some finer-grained detail of the characters and their situations. Sarah for me is hardly a sympathetic character, for instance--she's a woman who's not content with her life or marriage, fine. But she's also incredibly self-absorbed and refuses to take any responsibility for her own life, instead placing the entire blame for her dissatisfaction on her husband. Who, yes, as HAS been repeatedly pointed out, is not that content with how his life has turned out, either, BUT has assumed adult responsibilities for providing for a family, at the cost of his own creative (and extremely talented) alternatives. He has worked very hard to provide for her and for their children he adores, provide an exceptionally comfortable life, including a nanny, so that Sarah does not have to sacrifice all her dreams, too--and yet she's abandoning her alleged writing career and telling him it's all his fault. Please.\n\nAnd then there's the good friend Greg, who not only has an affair with Paul's Sarah, but taunts Paul--once Paul has found out--with the fact that HE never gave up photography and \"sold out.\" Well, duh: in the first place he didn't have much to sell out (as Bartholomé comments later in the film, and the audience sees for itself the very mediocre work that he does); in the second Paul's parents didn't die and leave him a big comfortable house in a ritzy neighborhood, nor did Greg ever marry and start a family. Too much responsibility, that might mean growing up. His nastiness sounds as if it stems from envy and resentment of Paul--just as the affair, a fling he treats as disrespectfully as he does Paul, probably has.\n\nThrough the unfortunate accident that ensues, we watch Paul dismantle his own life (leaving his family well-provided for, yet again). The poignancy is deep, of his finally, ironically, having the freedom to flourish in what he loves and is so good at--but not the freedom, ultimately, to enjoy it for long because he's TOO good at it, and can't avoid the recognition it brings him. The only things in his life he loves as much are his children, and in the end it appears he's had to forfeit them all.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Romain Duris makes this movie completely magnificent!",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "http://www.clevelandmovieblog.com/2013/01/the-big-picture-january-4th-and-5th-at.html",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "An interesting exploration - the main character is almost a pass to start over, but he isn't able to escape  his past. Catherine Deneuve is lovely in her bit. Romain Duris is very fun to watch as he grows more wild. The film goes some odd places and wraps up a bit suddenly but is overall worthwhile.",
            "review_date": "2012-12-19",
            "source": "rt"
        },
        {
            "content": "A French thriller that is entertaining almost up to the end but then leaves you feeling as frustrated as the lead character who through an ironic twist must find a new identity and continue running. It also leaves you with the nagging question of why someone so smart and talented would dig his own grave. Catherine Deneuve's appearance went completely over my head but this speaks more to the superficiality of her character's part in the story. Sadly it seems more of a gimmick to get a former star on the payroll.",
            "review_date": "2012-12-16",
            "source": "rt"
        },
        {
            "content": "A story of two halves, and very different parts for both of them, it changes from being a story centered around adultery within a family unit to one of personal discovery in a foreign land.",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "Paul Exban has it all - successful career, a beautiful wife, two beautiful kids.  He's about to become boss of the company he works for.  And yet there is an unsatisfied itch: he wants to be a photographer but never has the time.  He's friends with a photographer.  Then he discovers his wife is sleeping with this other photographer: his life enters freefall, and at his lowest ebb decides to confront the man who slept with his wife.  Of course the man dies, but not how you expect - but it's what happens next that makes the picture.  Paul Exban assumes the man's identity, disposes of his body, and flees the country, to assume a new life as a photographer on the Adriatic coast.\n\nBased on an early novel by Douglas Kennedy, The Big Picture contains some big names of French cinema: Romain Duris, Marina Foïs, Niels Arestrup and Catherine Deneuve, the latter wasted in a few short scenes.  Handsomely shot by Eric Lartigau, with some wonderful location work, and great cinematography.  For a film about photography it needed to be visual handsome.  \n\nWhere the film fails is in its implausibility, especially towards the end of the film: details of which I won't go into as they would spoil your enjoyment of it.  These implausibility's do not undermine the movie entirely, but they do corrupt some of the good work done so far.  Also, it is worth noting that the shadow of Alfred Hitchcock hangs over this film - I think because of its subject matter - and when you realise that, it's only a small step to wondering how Hitchcock would have handled it.  I think there is a better film to be made concerning the middle third of the film - as Paul assumes his new identity, it is fraught with risk, and Lartigau throws much of it away with just a few simple visuals that deny the tension. \n\nIn all, this is not a poor picture - it is a solid psychological thriller, mostly well told, with a fantastic central performance from Roman Duris.  It is a frustrating film, though, as one can see the better material hanging at the edges, trying to take centre-frame, but never doing so.",
            "review_date": "2012-12-09",
            "source": "rt"
        },
        {
            "content": "\"You can hide from your past, but you can never erase it.\"\r\n\r\nWith that simple tagline, it becomes clear that The Big Picture is a movie we've seen before: a successful man does something unspeakable, and spends a good deal of time trying to bury his transgression. It is unfortunate that director Eric Lartigau, who also co-wrote the film with Laurent de Bartillat, brings very little originality to this formula. Like The Intouchables, The Big Picture approaches some of the same themes as The Diving Bell and the Butterfly without ever managing to capture that film's pure magic and honest commentary on society. The result is a stylish, well-acted drama that unfortunately has little else going for it.\r\n\r\nLartigau handles his subject matter with a sort of wandering aimlessness, making the film pleasantly unpredictable up until a point. But once Paul Exben makes his life-changing decision toward the end of the first act, the film slips into a stifling by-wrote cause-and-effect paradigm. The success of Paul's escape from his past is constantly in question, giving the story some much-needed background excitement. Unfortunately, Lartigau undermines these thrills at every turn; each twist and turn in the narrative can be seen from a mile away, breaking whatever tension had heretofore been built.\r\n\r\nThese qualms aside, the movie is far from a total loss. This is mostly due to a typically strong showing from Romain Duris (L'Auberge Espagnole), whose subtle vulnerability makes Paul an instantly sympathetic and believable protagonist. Lartigau puts the audience on his side from the film's onset, giving him a credible reason for his recent poor showing as a husband. Combined with Duris's emotionally-driven performance, the viewer is inexorably attached to the fate of this poor man.\r\n\r\nLartigau and his crew also did a wonderful job showing the evolution of Paul's character using clever visual cues. As the film opens, he is a well-dressed, straight-laced lawyer whose propensity for success oozes from his every mannerism. And yet, his humanity does shine through as he speaks with his longtime partner, Anne (Catherine Deneuve) - hinting at his truer altruistic qualities. After the aforementioned central conflict is revealed, Paul closes up in a shell, paranoid and frightened of the outside world. Toward the end of the film, as the movie approaches its conclusion, we see a more hip, bohemian, laid-back Paul Exben has emerged from this fear-laden cocoon; his hair is loose, his demeanor is cool, and his clothes are perfectly disheveled. And all the while, we see with the film's final sequence that Paul's humanity has been preserved.\r\n\r\nBeyond its predictability, the real issue with The Big Picture is that it lacks a compelling message. When a film so fervently assigns parallel meaning to its first and second halves, the audience is goaded into looking for an underlying theme. Yielding nothing  more than some ambiguous moral commentary, The Big Picture leaves the audience with distinct of feeling of incompleteness. Perhaps there is a central thesis to The Big Picture, but if there is, Lartigau mostly subverts his intentions. Is the story about being selfless, or being a good husband, or the perils of success? Who's to tell?\r\n\r\nThere are worse films to spend your time on - the pacing is well-done, the modern look of the film is aesthetically pleasing, and the dialogue is tight - but The Big Picture does little to move the genre forward. Romain Duris is the star of the show here, and fans of his will certainly enjoy seeing him flex his more serious acting muscles. For everyone else, you may find the film lacking thematic depth.\r\n\r\nVerdict: Movie Meh\r\nRT Score: 70% (79%)\r\n\r\nFull Review: http://bit.ly/ZnkAdf \r\n\r\n~ Søren\r\n\r\nA Note on Timing - The Big Picture was released in 2010 in France, but only just made it across the Atlantic to our shores this year. If you're interested in seeing it in theaters, you're likely to find it in your local independent cinema. If you can't find it there, home video may be your best bet.",
            "review_date": "2012-11-13",
            "source": "rt"
        },
        {
            "content": "This is entertaining enough, if ultimately a little disappointing as a thriller. There are too many plot holes for it to completely work - too much disbelief needs to be suspended. That said, the lead performances are all very strong, and there remains the question of whether or not this SHOULD be looked at as a thriller. In a Hollywood director's hands, it might have had more adrenaline, but it would most likely have lacked the metaphysical side that ultimately is the film's greatest appeal.\n\nWhat defines us? What do we want? What happens when we self-abnegate? The film grapples with these questions, and has a conclusion that is all open and no end.",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "VERY ENJOYABLE.DURIS IS GREAT",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "French cinematography is definitely not sleeping!",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "\"The Big Picture\" starts with the sounds of a baby crying that Paul(Romain Duris), a lawyer, answers, leaving his wife Sarah(Marina Fois) to enjoy her restful sleep a little longer.  The following morning she gives him the cold shoulder at breakfast which even their older son takes notice of.  The day does not get any better for Paul when his friend and mentor Anne(Catherine Deneuve) informs him over sushi that she is dying.  Sarah soon after tells him that she is giving up writing which only leads to another argument.  As an amateur photographer, Paul is friends with Greg(Eric Ruf), a professional, later confronting him over fears that he is having an affair with Sarah...\r\n\r\n\"The Big Picture\" is a well-photographed, engaging and ironic movie about the nature of identity, even with one sizable contrivance.  Along these same lines, it took me a while to realize how much a double entendre the title is.  From clues scattered throughout the movie, it becomes clear that while Paul and Sarah may have started out at the same place of idealism in their young lives, somewhere along the way, their paths diverged widely, even as Paul tries to maintain his scruffy appearance.  Part of that may involve an intervention for Paul, like the one he gives to a teenage client, by people who in feeling they had his best interests at heart, took away some critical part of his personality.  So, years later, Sarah has an affair with somebody who reminds her of a younger Paul who Paul in return pretends to be, while also getting a glimpse of a possible future.  While doing this in the most selfish way possible, he also learns quite a lot about himself in the process, thus explaining why the movie ends where it does.",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "Remarkable depiction of a successful young lawyer's struggle with the definition of what it is to be ÃÂ¢a man.ÃÂ¢?  The moment life's linchpin unleashes it's worst, Paul Exben finds himself at a cross-roads.  Forcing his inner good boy aside he charts a daring new course for himself, at the expense of those who love him deeply, and those who have hurt him deeply.  Wheels are set in motion - crunchy, steely, seemingly incompatible wheels begin to churn, very slowly at first, until they grind out a powerful new rhythm and energy, propelling our protagonist from the constraints of a former life to the peculiar position of looking back on himself as though he were watching an acquaintance through a shop window. The tension this movie doles out so very prudently mounts and mounts to an almost unbearable degree. And although creative license supplants the realm of possibility from time to time, we let it slide.  Because in spite of his carrying out the unthinkable, we can't help but yearn, with undeniable empathy and thrilling vicariousness, for passion and courage to prevail. Personified by our anti-hero, Paul Exben.",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "An enjoyable picture that starts unpromisingly due to the unlikeability of Romain Duris's character. Mentioned as 'Ripleyesque' in many of the reviews and the outlandish ending certainly leaves the door open for more of the same from where this came from.\n\nNiels Arestrup has turned in some of French cinema's best performances in recent years and so it is here - once again, he is an irascible bear of a man. Duris is good too and the decision to let the action hit the road, ending up in the fascinating landscapes of Montenegro was a very good one on Lartigau's part. Still, the sheer ridiculousness of some of the plot turns prevent this being a real classic.",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "\"The Big Picture\" is perfectly French; sleek, stylish, chic, and a little bit cold.  And though it is intelligent, there is a feeling of utter genericness that can't be ignored.  We've seen the plot before; man kills man, steals identity, and trades lives.  As entertaining as it can be, \"The Big Picture\" doesn't add anything new to the table, albeit anything enjoyable enough to really stand out.  At least Catherine Deneuve's in it.\n\tPaul Exben (Romain Duris) is a man that every other man envies: he has a pretty wife (Marina Foïs), a dependable job, and loving kids.  He achieves the American dream, even though he's French.  Things take a downhill turn when his wife begins to adopt an icy demeanor; before long, Paul discovers that she is having an affair with his friend, Grégoire (Eric Ruf), a successful photographer.\n\tPaul confronts him at home, but in a jealous rage he accidentally kills him.  Rather than face the consequences, he disposes of the body, and goes step by step in order to achieve a clean getaway.  A short time later, Paul takes a job opportunity Grégoire had, and steals his identity.\n\tOne of the biggest problems with \"The Big Picture\" is the lead character.  Though Duris is, as usual, excellent, Paul is a loathsome character.  It's easy to see that he mopes around day to day, and quickly we side with his wife, who, understandably, prefers someone with a little more joy in their heart.  When he commits murder, we know that he is scared, but because we get acquainted with him in such a depressing manner, our sympathy isn't there when it should.\n\tThe entire plot, though filled with well-written dialogue and quite a deal of grittiness is basic, and it has been done many times before, often times better.  Through the film, Paul's hair grows, and his face becomes more sour - it's a look towards downward-spiraling that is fascinating.  But there isn't much else that sets it apart.\n\tLartigau's direction is stylish and cold, which is fitting to the atmosphere, but it is lacking the human touch that would benefit towards connecting with Paul.  Because that aspect fails to really grab us, the film feels like almost a task to finish.  Badly enough, there isn't much of a payoff either, and it sure would be nice if there was one.\n\t\"The Big Picture\" has a lot going for it, but in the end, it's forgettable.  For a film so professional and beautifully shot, it just doesn't grab out attention the way it should.  It's a shame.  As as a bonus criticism, it underuses Catherine Deneuve.",
            "review_date": "2012-10-04",
            "source": "rt"
        },
        {
            "content": "Pacing and credibility are sadly defective as the film fails to be compelling regardless of the interesting psychological inclinations that are hinted in the first part of the film.",
            "review_date": "2012-09-26",
            "source": "rt"
        },
        {
            "content": "Man in a perpetually stuck situation, sense of despair strongly depicted. Though he wasn't blameless, one feels sympathy.",
            "review_date": "2012-09-08",
            "source": "rt"
        },
        {
            "content": "When an accident puts the lead character on a path, he always wanted to take but never dared to take, it comes with a baggage of things he didn't really ask for. A stunning tale of man whose only chance to keep his freedom is to dissolve into anonymity.",
            "review_date": "2012-08-24",
            "source": "rt"
        },
        {
            "content": "Such a good idea for a movie, big potential, but a poorly executed, pretensious movie. Sadly, I believe this is very European, in the sense that they believe genius doesn't require any effort.",
            "review_date": "2012-05-29",
            "source": "rt"
        },
        {
            "content": "This wasn't bad, don't watch it expecting a fast paced thriller in the same vain as Point Blank and Anything For Her, it's more of a slow burner, probably a bit too slow in places.  That's not to say it's not worth watching because it's still a compelling watch, the characters are well written and you never know where the story is actually going to end up.  The ending isn't great, it's not what you'd call a satisfying ending which does let it down a little but saying that I'm not sure where else they could have taken it",
            "review_date": "2012-05-11",
            "source": "rt"
        },
        {
            "content": "What do you do when you're caught in the throes of success and the door is slowly closing on what you really want to do? The film suggests you grasp the first best moment and make a run for it, but you have to be clever about it. Interesting story about somebody who tries and begins to experience all the up and down sides of his decision. Not bad overall, but the editing is a bit heavy-handed, and the film therefore has an air of a low budget indie project. Gave the film half a star more, because I love photography. Need to have some knowledge of French to watch this in order to get the feel for it even if you're reading the subtitles.",
            "review_date": "2012-03-16",
            "source": "rt"
        },
        {
            "content": "The core of the film contemplates the terror&exhilaration of shedding a skin,asking whethe by suddenly losing everything one values,one might be liberated to express one's truer self. A typical French sophisticated & satisfying thriller !",
            "review_date": "2012-02-11",
            "source": "rt"
        },
        {
            "content": "Unique and slow burning French hide and seek thriller, wonderfully acted. A modern update on Hitchcock with a few surprises.",
            "review_date": "2012-02-07",
            "source": "rt"
        },
        {
            "content": "Excellent storyline, fake death story's are hard to pull off but this worked. I'd like to see more french films and more world cinema as it seems like the best ones aren't advertised on tv.",
            "review_date": "2012-01-25",
            "source": "rt"
        },
        {
            "content": "ExtraÃ±a pelÃ­cula francesa en la cual la vida de un hombre cambia radicalmente solo por el descubrimiento de la infidelidad de su mujer, un poco compleja y extraÃ±o final sin embargo es un tema diferente, se puede ver",
            "review_date": "2012-01-12",
            "source": "rt"
        },
        {
            "content": "Un film à suspense, qui tient son rôle de tenir en haleine malgré la passivité du personnage principal.\nLa fin est un peu trop floue et manque de crédibilité...",
            "review_date": "2011-12-08",
            "source": "rt"
        },
        {
            "content": "Le livre est vraiment mieux! Romain Duris est vraiment nul, je peux pas le voir!",
            "review_date": "2011-11-12",
            "source": "rt"
        },
        {
            "content": "Romain Duris is exceptional as usual in this unpredictable compelling thriller.  9/10!",
            "review_date": "2011-11-11",
            "source": "rt"
        },
        {
            "content": "Romain Duris holds this occasionally erratic piece together wonderfully. Beautifully produced and directed though the script could have been crafted with more concision.",
            "review_date": "2011-11-01",
            "source": "rt"
        },
        {
            "content": "very good French film - well worth seeing - tense first half hour especially",
            "review_date": "2011-09-10",
            "source": "rt"
        },
        {
            "content": "OK but slightly predictable",
            "review_date": "2011-09-04",
            "source": "rt"
        },
        {
            "content": "I've had Douglas Kennedy's book on my shelf for a few years, and never got round to it. Probably won't read it now. But, hey, this is a reasonable attempt at an arty thriller. Romain Duris is as watchable as ever - he does do angst very well. A little too self conscious in places, and a little too glib in how the choices the main protagonist makes effect those around him.",
            "review_date": "2011-08-26",
            "source": "rt"
        },
        {
            "content": "I kind of liked the way the plot didn't really make sense and the way Romain Duris vacillated between being a man who knew exactly what he was doing and a man who hadn't got a blimmin' clue what he was doing. Mostly I just liked the swerve into throwing away a life. Like Reggie Perrin, but, you know, sexier.",
            "review_date": "2011-08-24",
            "source": "rt"
        },
        {
            "content": "great performance by duris as always",
            "review_date": "2011-08-21",
            "source": "rt"
        },
        {
            "content": "Unexpectedly enjoyable and a refreshing plot course both surprised and fascinated me - this is a film of 2 halves: a fast pace family/crime drama and then suddenly we have the slower traveling section with tension still remain tightly held 'til the abrupt end. Duris is watchable as ever - and Deneuve and Arestrup as always makes you want to see more.",
            "review_date": "2011-08-12",
            "source": "rt"
        },
        {
            "content": "Good French thriller.",
            "review_date": "2011-08-04",
            "source": "rt"
        },
        {
            "content": "'s alright..... Duris is brilliant. ending is not.",
            "review_date": "2011-08-02",
            "source": "rt"
        },
        {
            "content": "Beautifully shot, unhurried film. Unfulfilled potential, a serious mistake, rounded of with a redemption of sorts. Not sure you are ever supposed to like Paul Exben but the film keeps you with him almost hoping that he will succeed.\n\nRoman Duris was moody as Paul Exben, Catherine Deneuve was excellent, Niels Arestrup was fun as a drink French man.",
            "review_date": "2011-08-01",
            "source": "rt"
        },
        {
            "content": "Fascinating. A chance to start a completely different life.",
            "review_date": "2011-07-31",
            "source": "rt"
        },
        {
            "content": "It starts off as a typical couple going through a tough time affair, and eventually develops into a gripping, if not very believable thriller.",
            "review_date": "2011-07-30",
            "source": "rt"
        },
        {
            "content": "Just been to see this - really enjoyed it.",
            "review_date": "2011-07-29",
            "source": "rt"
        },
        {
            "content": "Starts off well then loses pace.",
            "review_date": "2011-07-29",
            "source": "rt"
        },
        {
            "content": "This disappointed me :-0  Expected an inspirational movie about liing your dream and got a French film noir instead...\n\nRomain Duris needs a haircut!",
            "review_date": "2011-07-29",
            "source": "rt"
        },
        {
            "content": "Competent enough thriller/drama which will keep you guessing from where its going to go.  Duris is suitably brooding and tortured in the lead role.  Enjoyed it but felt it was ultimately a bit flat, i especially found it a bit difficult to buy some of the situations Paul Exben found him in towards the end of the film.",
            "review_date": "2011-07-28",
            "source": "rt"
        },
        {
            "content": "Oh dear. This started off well but became rather farcical. Way too long - could have been 30 minutes shorter. Beatifully shot though.",
            "review_date": "2011-07-27",
            "source": "rt"
        },
        {
            "content": "A slow burning thriller about a man's quest for his true identity, this French adaptation of an American novel starts off as a bourgeois domestic drama, but, as his life begins to unravel, he makes some unexpectedly desperate decisions to try to reinvent himself and it soon becomes rather engrossing.",
            "review_date": "2011-07-27",
            "source": "rt"
        },
        {
            "content": "A good, solid film although the pacing meant that it started to drag a bit in the middle of the film.  I should have guessed Catherine Deneuve would be in it!  She is great though, as is Romain Duris.  I really felt I rooted for him.  The little boy who plays his son is really good as well.  I really felt som emotion for these people whether you liked the characters or not and the movie is beautifully shot.  Unfortunately I personally felt that the ending fell a little flat to me.",
            "review_date": "2011-07-26",
            "source": "rt"
        },
        {
            "content": "The Big Picture is an exciting, original and fiercely acted drama/thriller from France. Without giving away the plot, the film is about a man who makes the most extreme personal sacrifices in order to protect his children and their memory of him, after an irreversible (and accidental) tragedy risks destroying him and his family, if they were to find out.\r\n\r\nThis film scores highly because of the quality of the acting and direction, but it loses marks due to some moments of almost laughable implausibility. There is an element of this in a lot films, granted, but it annoyed me more in this one because the rest of The Big Picture was so deliriously good and ultimately makes the film feel a little disjointed in parts.\r\n\r\nDaft story shifts and plot lines aside, The Big Picture is absolutely a thoroughly entertaining film.",
            "review_date": "2011-07-26",
            "source": "rt"
        },
        {
            "content": "disappointed by the ending but Romain Duris is great once again",
            "review_date": "2011-07-24",
            "source": "rt"
        },
        {
            "content": "French adaptation of Douglas Kennedy's (no, I hadnt heard of him either) thriller. High flying lawyer's life is thrown into turmoil when he accidentally kills his wife's lover, but this gives him the opportunity to flee and be the successful photographer that he always wanted to be. To enjoy this film, you have to forgive the flimsy plot and concentrate instead on the acting, which is top drawer. Lovely cameo turn from Catherine Deneuve but the star of the show is Romain Durris, who gives a captivating performance as the frustrated/liberated lawyer. I cant remember the last time I saw someone portray panic and despair so convincingly. Very sudden and abrupt ending, however, disappoints.",
            "review_date": "2011-07-22",
            "source": "rt"
        },
        {
            "content": "A good plot is spoiled by the broken paces. Slow but still I think it is good.",
            "review_date": "2011-07-17",
            "source": "rt"
        }
    ]
}