{
    "rating": 0.0,
    "release_date": "Invalid",
    "num_reviews": 130,
    "genres": [
        "Kids&family",
        "Romance",
        "Anime"
    ],
    "summary": "Based on the manga with the same title, this animated film follows Shizuku, an inquisitive young girl and a voracious reader, who longs to be a writer when she grows up. One day she notices that all of her library books have previously been taken out by one Seiji Amasawa. Amid chasing after a large cat, befriending an eccentric antiques dealer and writing her first novel, Shizuku aims to find this mysterious boy who may well be her soul mate.",
    "reviews": [
        {
            "content": "The plot is too good, it's the type of movie that I could watch over and over again, I loved the characters. In the end, it's an amazing movie.",
            "review_date": "2023-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is such a cozy movie. Ramen noodle soup for the soul.",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another beautifully made movie by Studio Ghibili. Whisper of the Heart is a coming of age romance that feels very natural. The dialogue and writing of the characters is very well done and it elevates the story. Just like other Studio Ghibili movies, the animation is jaw-dropping. The scenery is beautiful in every shot. I couldn't keep my eyes off the screen. There isn't really any negatives other than that I feel like the pacing can be a bit off but that's just a nitpick on my part. Overall, a fantastic love story that doesn't fall into the typical cliches of modern day movies.",
            "review_date": "2023-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah!~ Whisper of the Heart live action was truly a dream come true if I’ve ever lived long enough to see one!🫶🏽\nThe story stayed true to the original movie w/ uttermost flattery to the all characters as you remembered them \nThe cast chosen both young & adult versions were breathtaking to watch :)\nOut of all the Studio Ghibli films to get a live action I’m so happy it was whisper of the heart b/c it isn’t a westernized Lovie Dovie romance but a satisfying episodic tale of individual self growth w/ innocence of finding love in the process of living a dream driven life (//_^)\nNow for my unbiased opinion of the film it's a very captivating story, cute characters, rich imaginative scenes, delightful performances and a heartfelt message!!\nGiving it a solid 10/10..!!🙌🏾😁\nP.s\nFingers crossed that they'll make more live action adaptation films from the other iconic Studio Ghibli masterpieces! :)",
            "review_date": "2023-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful coming off age story and one of Ghibli's top tier works. The last act is perfect and inspiring and the characters, details and colours are incredibly magical and feel real. This is one of Ghibli's works where you want to live in their world and participate in their lives and I don't think there's a greater achievement for an artist.",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have not watched many movies that touched and inspired me the same way that \"Whisper of the Heart\" did. The main character's determination is infectious.",
            "review_date": "2022-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has to be one of the best movies I have seen. It is very rare for a movie to really make me feel this much emotion and tell a relatable story that really makes me feel something. If you haven't seen this movie, go check it out, it will definitely be worth your time.",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie has a lot of stories mixed within one another. While all the stories are fine, it seems like one gets in the way of the other two. What seems to be the main conflict is the main character's struggle to figure out what they want to do with their life: stop school and become a writer or prepare for high school entrance exams and give herself more time to decide. One of the stories seems to help supplement the main one while the other doesn't give much drive to it and could have been honestly scrapped altogether. The film's main focus is of a child and her dreams. It is lovely to see her drive to do something great and the character's she imagines on the way. The message is clear and a good one so it hurts to see a love story seemingly shoved in the middle of it that somewhat distracts from that. Overall a great film that tries to teach children a great lesson about following your dreams.",
            "review_date": "2022-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it is a must to watch movie!",
            "review_date": "2022-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of my all time favourites. Shizuku is so relatable. Seiji is just the best love interest ever. The animation is gorgeous. There is so much beauty in every shot, and the music is so lovable. It's a coming of age story, a love story, and an inspiration to the artist in anyone. Whenever I watch this movie I feel like I can do so much with my life, and like the world is a beautiful place again. I will warn you, only true intellectuals can grasp the true meaning and beauty of this movie.",
            "review_date": "2022-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a truly fantastic 85-minute movie. Tacking an additional 35 minutes onto that greatness was such a tremendous mistake. Nothing the couple did after getting together was compelling. The only movie I can remember providing the true climax in the second act and then taking on an entirely unnecessary third is 2000's Dungeons & Dragons!",
            "review_date": "2022-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was blown away by Whisper of the Heart. It is perhaps slow and simple, but it is also charming and poignant with great characters especially. The animation as always is wonderful, the stunning backgrounds and colours especially look absolutely amazing. And the visual effects are great too and do a great job of enhancing the story. The music is gorgeous and never feels obtrusive, and the song is absolutely lovely. The script is memorable too, while the simple yet very rich story still manages to touch me, as do the beautiful, subtle messaging and great characters here. Shizuku and Seiji are both likable characters with real warmth to them. The voice acting is excellent from all involved, especially Cary Elwes who is perfect as the charming handsome Baron. All in all, stunning and one of my favourites. 10/10 Bethany Cox",
            "review_date": "2022-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Muta/Moon! =^.^= Country/Concrete roads. :D\nAnd the serious parts are great too. :)",
            "review_date": "2022-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Whisper of the Heart\" is a sweet little coming-of-age tale from Studio Ghibli. This movie has a good message and explores growing up wanting to achieve something in the creative space. I always find a lot of value in my life from working on my creative projects, so I found that aspect of the movie very relatable. I think the story is solid and more grounded than other Ghibli films even though it does have some imaginative elements. Overall, it is a solid film that has a decent enough story but many relatable themes that boost its quality.",
            "review_date": "2022-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With God as my witness, I swear that the opening of this movie absolutely blew me away, so good it was. It may be because I already had a sentiment for that classic John Denver song, but still, it was wonderful, and the movie that followed really kept pace! Lately I'm becoming more and more bitter as a person and this certainly influenced my viewing experience, but even I couldn't but admire how beautiful and beautifully told this story is. Out of all Ghibli non-fantastical stories this will certainly be from now on my favorite. And while the main love story of the movie is an unrealistic fantasy so common to girls the age of the protagonist, feelings of Shizuku in all other regards are so, so real. Amazing, how this works despite the fact that no magic other than that of human imagination was involved. To all I wish that they could experience this story – Shizuku's first visit in that antique shop, the moment when she sang for the first time with Seiji or when she learned the history of the \"Baron\" figurine... And the opening, of course, but most of all – the transition from fantasy to reality when she runs down her stairs on the slope of Tama Hills. I can't say how many times I replayed it, and I was amazed each and every time. The definition of imagination and probably my favorite Ghibli moment from now on. I am home. Country roads brought me here.",
            "review_date": "2022-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whisper of the Heart comes close to being a cliché teen love story at initially, and the country road track may turn off some viewers. However, as the story progresses, it transforms into a film in an effort to touch and encourage both old and young audiences with its theme of \"following your dreams\" while being insecure about everything you're making and thus hating everything about you or your artwork, and at the same time, you shouldn't bury yourself in your passion and restrict yourself from experiencing life once in a while. Whisper of a Heart is a fascinating and entertaining film for everyone, with a powerful message and a riveting teenage love story.",
            "review_date": "2022-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing movie that teaches you to grow alongside your partner as well as individually, and portraits the power of young love.\nOne of Ghiblis best movies, and one of my favorite comfort movies.\nA must see",
            "review_date": "2021-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another solid Ghibli entry, even if it gets a little slow at times. The animation is gorgeous, of course, but I particularly appreciated the attention to detail in this movie. Whether it's a character clicking a mechanical pencil a few extra times before writing or briefly blowing on their food before taking a bite, this world feels very real and lived in.\n\nThe story is cute and invites some discussion on worthiness and Imposter Syndrome. Some of the character conflicts get skimmed over a bit, but that's pretty standard for Studio Ghibli. I loved the use of music throughout, even if Country Roads felt like a weird anthem for this film.\n\nIt's not on the top of my Ghibli list, but I enjoyed most of it and really enjoyed some of it.",
            "review_date": "2021-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My personal favorite ghibli film. It has so much imagination without having to be super magical. Makes a wonderful comfort film with very lovable and relatable characters.",
            "review_date": "2021-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an amazing story of a young INFP's experience of growing up, finding love, and exploring her calling in life. Such a beautiful work of art!",
            "review_date": "2021-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story about self discovery and the struggles of adolescence. Uniquely inspiring and a work of genius, it should be mandatory in schools. One of the most meaningful movies out there",
            "review_date": "2021-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "less technically masterful than other ghibli movies (the scenes where characters are singing country roads and repetitively bobbing their heads like dipping birds are a bit awkward), but deeply personal and touching. probably my favorite ghibli romance",
            "review_date": "2021-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS SH*T IS MAKING MY HEART WARM LOVE IT",
            "review_date": "2021-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Country road... Take me home... to the place.... I belong.... West Virginia... mountain mama.... Take me home... country road...\n\nQuite an inspiring coming-of-age story. The main character was a middle school student who didn't know what she wanted to do in life. She loved book and wanted to take this passion further. Also from this passion that she met a boy. The relationship, not only was it very sweet, motivated the main character to face her doubt and try out her passion. \n\nThe central theme was that everyone had some form of passion or talent within them: at the beginning the talent is unfinished and rough, but one must know that it takes time to polish the talent or passion. When one can overcome their self-doubts, they will be able to find their own identity. I love the positive and hopeful theme of the story.\n\nMy problem with the movie was that it was very subdued and seemed like nothing much happened for a while. It definitely took its time, but still there were beautiful and happy moments.\n\nOverall, an inspiring piece of art. 8/10",
            "review_date": "2021-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly mature romance anime for teenagers.\n\nYoshifumi Kondo's romance drama anime Whisper of the Heart (1995) is sincere to its heartfelt core. I found writers Hayao Miyazaki and Aoi Hiiragi's coming of age narrative really relatable as Shizuku just wants to find love and accept her passion for writing as a viable career path. Miyazaki and Hiiragi's story is very grounded and realistic as teenagers act like youthful fools in love, while taking their future increasingly seriously. I think their writing is what separates Whisper of the Heart from more shallow romance anime as he writes from a teenage girl's lens. It's nice to hear the feminine perspective on how dense boys can be, supportive girlfriends are to one another, and oppressive parents can be to their daughters. Hayao Miyazaki and Aoi Hiiragi's words will echo across time as more teens see Whisper of the Heart. \n\nI find Yoshifumi Kondo's direction will help viewers empathize with his leading lady Shizuku's relatable struggle for years to come. Whisper of the Heart creatively removes much of the fantasy elements with a few dream sequences as Shizuku writes her novel, we see a visual representation of the romance fairytale on screen with breathtaking style from Kondo. His down to Earth direction keeps you with Shizuku the entire time, so you are wholly invested in her arc. It's a shame that Yoshifumi Kondo tragically died after only getting to direct one picture. However, Whisper of the Heart is so stunning and moving that I'm grateful we received such a profoundly soulful and touching anime film from an inspired master before his untimely death.\n\nI adore the English Dub's voice cast for Whisper of the Heart. Brittany Snow is adorable and likable as Shizuku Tsukishima. She's got this soft voice and a fierce personality that fits Shizuku's opinionated character, but lets her be a teenage girl with high expectations. David Gallagher is great as Seiji Amasawa with his confident attitude and personable manner around Snow's Shizuku. Ashley Tisdale is wonderful as Shizuku's shy best friend Yuko Harada. Harold Gould is very gentle and touching as Seiji's grandfather Shiro Nishi, who is the elderly man running the antique shop.\n\nSimilarly, James Sikking is very kind and patient as Shizuku's librarian father Seiya Tsukishima. Jean Smart is funny as Shizuku's stern mother earning a Master's Degree named Asako Tsukishima. Courtney Thorne-Smith is excellent as Shizuku's concerned and mature sister Shiho Tsukishima. Cary Elwes has a small, but poignant role as The Baron, who is the talking cat from Shizuku's fairytale romance novel.\n\nTakeshi Seyama's sharp editing for Whisper of the Heart sends you soaring on a romantic adventure from brief encounter to encounter in quick time for a briskly paced 111 minutes. Atsushi Okui alongside Kitarou Kousaka's cinematography has beautiful wide shots of animated Tokyo circa 1995, but it is Okui and Kousaka's close-up shots of faces that hit you hardest. Seeing someone's eyes after getting rejected by a crush or appreciated by someone they love is very tender in Whisper of the Heart. \n\nFurthermore, I appreciate their gentle fondness for these characters and Kondo's direction is focusing on the characters, not just a story about love. Satoshi Kuroda's art direction is lovely with realistic backdrops of Tokyo, schools, libraries, antique shops, domestic homes, and even a fantasy world. Yuji Nomi's musical composition for Whisper of the Heart adds a layer of warmth and romantic atmosphere I love. His score is very amorous for Whisper of the Heart, especially as he uses not only symphonic orchestration, but heavy use of country songs like \"Country Road.\"\n\nIn all, Whisper of the Heart is a classic coming of age story, affectionate romance drama, and anime masterpiece from the late director Yoshifumi Kondo.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whisper of the heart is a really amazing classic from Ghibli. It holds a special place in my heart since it's one of the first anime movies I ever saw. The story is strongly down-to-earth, yet it still has a very magical feel to it. Characters are easily relatable, especially Shizuku. This movie is not for everyone, but if you're into slice of life movies, you might like it.",
            "review_date": "2020-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A coming of age story with many fantastic elements, a charming and emotive narrative, a whimsical tone, and beautiful animation, undeniably one of the best works form Studio Ghibli.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whisper of the heart's story is fine -- animation is fine -- and has a sweet start and executes some emotion just fine. It's just -- the story's writing and environment, as well as runtime, seemed to drift. 5.6/10, C",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Coming of age movie directed by Yoshifumi Kondō who was a protege of Hayao Miyazaki, co-founder of Studio Ghibli. This was the 1st and last movie directed by Kondō. He died from aneurysm at age 47 due to overwork. Reflecting on the death of his protege and his own obsession with Studio Ghibli, Hayao Miyazaki made the decision to retire in 1998 but subsequently returned to work at Studio Ghibli.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whisper of the Heart eschews most of the fantastical elements inherent to earlier works in the Ghibli catalogue in favor of a more grounded and relatable coming-of-age story, and does lose some of of the raw, infectious whimsy that the studio is known for as a result, but presents a charming, sweet, and highly appealing story regardless. If there is a major criticism from my perspective, it is the ending, which almost seems too unrealistically hopeful, but that can be construed as the blind glee associated with first love. Additionally, the lack of real conflict is notable, which seems to let the film slip into superficiality at points, but ultimately the level of antagonism seems like a fit for the protagonist and the setting. As the sole film from the studio directed by Kondō rather than the more commonly encountered Miyazaki or Takahata, Whisper of the Heart brings up questions of what might have been had the young director not been lost before his time: would we have seen more films of this style from Ghibli? We can only speculate. (4/5)",
            "review_date": "2020-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sweet, small-scale anime, which explores all the awkwardness and inner conflict of young love, teen social anxiety and an emergent personal identity. As late summer winds gently blow, we contentedly explore a sleepy Tokyo suburb alongside an aspiring, if apprehensive, young writer. Stumbling upon old thrift shops and secret city perspectives, we delight alongside her, mutually appreciating the sense of freedom and discovery. Little adventures can be the most satisfying, like these fleeting chances to probe and examine the private character of her home town.\n\nThat aspect of the film makes for some great, charming, slice-of-life material. And the relationship drama, after school is back in session, doesn't feel overwrought or exaggerated, either. It just... lingers and lingers, way beyond the point of watch-checking and brow-raising. Slow pacing is essential to those earlier scenes, allowing us to really understand and appreciate both character and setting, but it's not as powerful or purposeful in these later bits. Peppered with the usual Studio Ghibli joys and pleasures, it's beautifully realized and sincere, just a bit staid and long in the tooth. The playful flights of imagination so lavishly promoted on the movie poster don't last even five minutes.",
            "review_date": "2020-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As I share the hobbies of books and studying with the central protagonist this film clicked into place and felt refreshing. The sweet and sincere love story driving the narrative worked nicely. Plus it boasts a memorable scene where a group of characters have a folk jamming session in high spirits, playing out a Japanese language version of John Denver's 'Take Me Home, Country Roads' - a song which is referenced nicely throughout the plot and prompted me to add it on my Spotify playlist straight after viewing",
            "review_date": "2020-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit long, but definitely well-animated, and with a deep development of the main character.",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Real Rating: 78/100\nDE: This film has a sad asterisk next to it. It is the only feature-length film directed by Kondô Yoshifumi, who was said to be Miyazaki's successor in regards to directing Ghilbi films. Kondô sadly never got the chance to take up that mantle as he died three years later in 1998 and from what we see on-screen we may have never gotten \"Spirited Away\", but we would have still had a studio left in competent hands, and it is a shame that we will never get to see the films that could have been. On a quick note in editing, they could have easily shaved 5 minutes off of this film and still had it keep the slow pacing they were going for.\n\nW: There is no writer in film that has a more successful batting average than Miyazaki Hayao. Paul Thomas Anderson is the only other figure as consistent as Miyazaki. However, the head of Ghilibi has written almost double the number of films as Anderson, and we can praise Hiiragi Aoi's source material if we wish, but I do not. Source material can be tremendous, but Shawshank Redemption and Oldboy are two films with weak source material and look at how they turned out. It is the writing and the dialogue that hold this movie together, however, the ending hurts the overall film. It feels rushed, and while I can see the merit in a Kawabatta-esque wabi-sabi ending. It feels unearned as if the writer had no idea how to continue rather than chose not to continue.\n\nC: I bet you have no idea who Okui Atsushi is and that is fine. I understand. However, you should as Okui might very well be one of the greatest cinematographers to ever exist, and that is no hyperbole either. Please look up their works and be amazed. Their use of the camera is excellent, and in this film, we see a consistent side-on approach to the characters that gives depth to what should ultimately be a flat shot. We then couple that with the angles that we get during exterior shots and we can feel that juxtaposition more so, thus allowing us to see these characters in a different light.\n​\nA: The four principal actors are Honna Yoko as Tsukishima Shizuku, Takahashi Issey as Amasawa Seiji, Tachibana Takashi as Tsukishima Seiya, and Muroi Shigeru as Tsukishima Asako. Their performances are average, which in a way gives the characters more authenticity in terms of presenting them as ordinary humans, but it feels like you could have gotten this effect without weakening the overall performance of the piece. \n\nS: Nomi Yûji was in charge of the music for Whisper of the Heart and while their efforts were decent. It is actually the absence of sound that often drives this work. From that awkward silence of two characters who have blurted out unreciprocated emotions punctuated by the chirping of the cicadas to the dull hum of the headphones that suggest our main character is lost in her own literary world. It is the banality that allows the story to feel more natural and give further depth to the main characters..\n\nPD: The storyboard artist for this film was Miyazaki Hayao that alone says everything that you need to hear. The sets as they were and the buildings have a life of their own. They are lived in, to the point that you can smell the must wafting off of the books within the Tsukishima's apartment.\n\nBA: The costume design throughout the film is uninspired and at times, feels off. Like in the section where the old man is remembering his time in Germany, and he and seemingly, everyone else appears to be wearing Zoot Suits. The SFX are weak given that this a Studio Ghlibi who is on the verge of producing Princess Mononoke and that the SFX artist is Tanifuji Kaoru who two years prior was running the SFX on the incredibly violent Ninja Scrolls.\n\nEVO: In terms of entertainment Whisper of the Heart is a touching tale that does not rely on the fantastical whimsy that most of Studio Ghibli's films use with astute aplomb. Though this works in the movie's favour. It can give you that sense of a fairy tale within the uncompromising brick walls of reality. That said if you are looking for that other world/Alice in Wonderland feel. I have bad news for you, you may find yourself being forcibly dragged through the intentionally slow pacing.\n\nNotes: I would like to say that I hate some of the promotional posters for this film, they feels exploitative as if the marketing team went \"Hey this is a Miyazaki film, and people are going to anticipate wonder and magic.\" The reality is, you should not. This is not that film, this is a measured and slow-paced work that relies on us the viewer building a relationship with the main character. Please do not think this is the perfect film to plop a small child down in front of, it is more for the artsy types who wish to be inspired. Or for a more thoughtful approach to the old follow your dreams cliche. Also, I can see why many people did not watch this film as that trailer was awful and in no way gives you a sense of the world they are building.",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whisper of the Heart presents a sweet teen love story mixed with fantastical elements and compelling characters defined by Studio Ghibli's aesthetics.",
            "review_date": "2020-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.75 a fairy tale within a tween rom com, this SG classic will bring joy and sadness to those who expect it from the talented geniuses behind it.",
            "review_date": "2020-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A shining and quiet gem, \"Whisper of the Heart\" strikes the right notes in teenage ambition and inspiration; taking us back to those life moments when we first believed in ourselves and were willing to take risks to follow our dreams. Here's hoping we continue to do so in our adulthood.",
            "review_date": "2020-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another knockout by studio Ghibli, the Japanese equivalent of Pixar. The main character is incredibly relatable and the young love story so cute. Altho the Japanese school system is different, it's still relatable studying for our own standardized tests-SATs and also the decision of doing trades vs college. The age old coming of age story brings back fond memories and the bittersweet lose of childhood and make believe. I found Tokyo to be another lovable character in this film as well. The film was interesting from start to finish and one you wish would keep going at the end.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it's very different from most of Ghibli's other movies this is still one of my favourites and I can't recommend it enough!",
            "review_date": "2019-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gentle film that That will inspire you to find yourself even if you're not 15 years old anymore.",
            "review_date": "2019-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this film and it's references to John Denver! It's my go to anime film! ",
            "review_date": "2019-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whisper of the Heart is an anime film that has some plot elements that reminded me a lot of a live-action film I watched recently called Love Letter. Both had a major plot point that revolved around a girl discovering that a boy had checked out the same books before her from the library. I was lukewarm on that movie, but it had some endearing qualities. That being said, this is a very different film in style. It is focused on young love and what it takes for a person to follow their dreams. I liked that aspect of the story, even if the relationship they form seemed to come out of nowhere, and escalated much too quickly to feel authentic. Following Shizuku on her journey to become a writer was rewarding, and while her flowery prose isn’t exactly my cup of tea, I did still appreciate that it had an enchanting quality to the words. I thought it was odd that Whisper of the Heart dipped its toes into the fantastical for one scene but never got back there. I had anticipated that the entire movie would be magical when we first meet the cat and the statue, but most of the movie is a traditional coming-of-age romantic drama. While sometimes I balk at the mystical elements shown in anime films, this one felt like it needed that something extra. The entire movie was a tad bland and uninteresting to me. I liked the characters, and I wanted to see what would happen to them, but at times I was watching the clock more than the movie waiting for the next significant thing to happen. I can see the charming aspects in Whisper of the Heart, but those charms simply didn’t work all that well on me. But I have had “Country Roads” stuck in my head for days now.",
            "review_date": "2019-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a slower, more tranquil movie than most Studio Ghibli films, but that pairs well with the hyper accurate day-to-day nuance captured in the animation. It's directed by Yoshifumi Kondo, not Hayao Miyazaki, so it's less fantastical than My Neighbor Totoro and more of a realistic coming-of-age tale like From Up On Poppy Hill. It's just a lot of fun to see a few slices of everyday life in ‘90s Japan with enough of a trickle of a plot to keep everything moving. \n\nClosest comparison: It's more From Up On Poppy Hill than The Cat Returns\n\nSetting: Coming of Age\nPlot: Coming of Age\nTone: Tranquil",
            "review_date": "2019-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Reminds me of my childhood. Seen it at least 100 times.",
            "review_date": "2019-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s a sweet movie,love the storyline! ❤️ ",
            "review_date": "2019-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, I'm not sure why this has not yet been adapted as a live action teen flick. Honest and sweet.",
            "review_date": "2019-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even if it were 20 minutes shorter, which it should have been, Whisper of the Heart is still stretched pretty thin. It's the simple story of a childhood crush, and it doesn't really have anything that makes it stand out. The fantasy sequences feel out of place and the protagonist isn't that likeable. The spin-off, The Cat Returns, is a better film.",
            "review_date": "2019-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Living in a world full of political chaos, it's nice to break away to a more simple time.  Young love, dreams, family, a future full of possibilities...  Sometimes you have to rest your cinematic mind from the non-stop sex and violence promoted on TV and the movies 24/7, 365.  Although I saw this with  English voice overs, I bet the Japanese language adds much more of a rich dialog that is hard to translate.",
            "review_date": "2019-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This inspiring story of creativity and true love is powered by its realistic slice-of-life moments, brief but memorable dream sequences, and of course John Denver's \"Country Roads\"",
            "review_date": "2019-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so good!",
            "review_date": "2019-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is not the best of the Ghibli films that I have seen, but it definitely has its merits. It's hard knowing exactly what to do when deciding a career and finding love, and this movie tries its best to showcase that. Blue collar work can often be a better choice than white collar, which is not always guaranteed to make you money either, and I liked that they addressed that in the film. Where it really shined was in how each scene felt real, like you were in a real city and experiencing living there. It was a little long for the kind of story that it was, but its definitely a decent pick for a family movie night.",
            "review_date": "2018-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WORSt MOVIE EVER WHY DID THE CAT MOT COME ALAIVE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2018-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sweet and well-observed, Whisper is about self-discovery and little else\n\nSweet and well-observed, Whisper is about self-discovery and little else. A TAD BIT BORING AT TIMES.",
            "review_date": "2018-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, quite the opening song. Really sets the tone while making an emotional impact. Miyazaki's films are always so charming and lovely to watch. They always create this sense of majestic wonder and adventure. The musical score helps elevate that feeling for sure. And the animations and art are always beautiful to look at. The animation of the chunky cat crossing the street was very cute and funny. The grandfather clock scene was beautiful. All the intricate little details within the art. \n\nOh wow. Sugimura actually liked Shizuku the whole time! This creates a problem since Yuko, her best friend, is the one who likes Sugimura. Aww that's sad that Seiji is moving to Italy, and right as him and Shizuku were starting to really like each other. That must be really hard as a kid. The fictional world she created for her story almost looks Beksinski inspired with all the meticulous details in the buildings. The watercolor painted backgrounds and landscapes are gorgeous. \n\nA really nice and charming coming of age movie with some genuinely funny moments sprinkled in. Really wholesome and sweet. This movie has a beautifully nostalgic feel to it, it's definitely cozy. Miyazaki's films always have this enchanting quality to them. I find it very interesting how even though the movie is very light and kid-friendly with it's characters and tone, the movie doesn't stray from venturing into more mature issues like loneliness, depression and loss. It's also a story about first love and destiny, and how imagination can lift us up and take us to incredibly beautiful places, but how it can also tear us apart from the inside as well if we're not careful. Overall it was a very sweet, simple and charming cozy movie that was super easy to watch. Definitely worth the watch, and definitely deserves to be rewatched.",
            "review_date": "2018-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully drawn and equally strong as its script; \"Whisper of the Heart\" is one of Studio Ghibli's finest works. It's an coming of age story that will not only teach children the importance of love but also reminds us that it is not too late to pursue our dreams and passion. This is one of those cartoons that feels more human than its live action counterparts. Life can be hard to mimic, but this film does it flawlessly. Well done indeed.",
            "review_date": "2018-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really enjoyed this one from Studio Ghibli, fun story",
            "review_date": "2018-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know I'm a male speaking in the face of the warnings I got that this is largely a for-girls movie, but as much as Whisper of the heart has plenty of eye for detail, realistic themes of adolescence and inspiration from aspiring artists, its promised magic turns out to be more imaginary than anything, offering instead another Japanese high-school romance to the crowded plate of them, plus it's overly long and has quite an awkward ending.",
            "review_date": "2017-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a fairly simple film, but somehow I loved it! Studio Ghibli delivers another great animated film that will definitely satisfy!",
            "review_date": "2017-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whisper of the heart is perhaps the most amazing lesson about life. \n\n\"Just follow your dreams, no matter how hard it is, you'll make it if you try hard enough\" - That's the main message of the movie, as always the animation is unique in his kind, i know i've said this many times but Ghibli is pure love and art with characters that without a doubt will make your soul experience amazing things.",
            "review_date": "2017-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie changed my life the moment I finished watching.",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful film about the transition of a person between childhood and maturity, beautifully treats a phase of choices that we are all destined to pass or have passed.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A simple story with great characters, a great setting, and surprisingly complex themes. This is a movie people instantly fall in love with. This is really one of those simple, yet sweet, perfections.",
            "review_date": "2016-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is in my Top 10 best ghibli movies. I loved the characters, the animation, the story, all of it!",
            "review_date": "2016-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Unadulterated Illustration Of Teenage Love, Dreams & Aspirations",
            "review_date": "2016-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not the best ghibli film I've seen probably the worst",
            "review_date": "2016-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of few films I'm always ready to re-watch",
            "review_date": "2016-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, just so cute and adorable and sweet",
            "review_date": "2016-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the attention to detail is simply outstanding",
            "review_date": "2016-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a perfect and enchanting tale. A+ story telling.",
            "review_date": "2015-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Ghibli series and have almost all DVD. Especially, \"Whisper of the Heart\" is my most favorite movie. This movie is originally a comic of the same title written by Aoi Hiiragi and it is the first and the end feature film supervised by Yoshifumi Kondo who is movie director. I watched it many times but I am not tired of it. \n  Shizuku Tsukishima is a girl who is the third grade at a junior high school and is the bookworm. She often go to the library which her father works , but notice the boy's name of \"Seiji Amasawa\" who borrows all the book which herself reads earlier, and reads it. Shizuku did not take time to know that Amasawa Seiji is a classmate, but is intrerested about Amasawa Seiji all the time.\n One day she find a mysterious cat on the way to the library and run after the cat. The cat goes into the small antique shop \"earth shop\", and she meets old man, Shiro Nishi, in a shop. Mr. Nishi is a grandfather of Seiji, and he made a violin in an underground studio. Seiji have a dream to want to study in Italy to become a violin craftsman.\n Shizuku is not understand what should she do in comparison with Seiji having a firm aim. She demands her's dream and begins to write a story. \n It is certain that this movie is love story between Shizuku Tukishima and Seiji Amasawa but another theme of this story is \"growth of Shizuku\". She is troubled about the future and gets over it, and chase the dream is expressed finely.\n What I was drawn into is because I can reflect oneself  through the main characters and the story. The figure of Shizuku who pushes on without escaping from being troubled about the future gives courage to decide at the same time I move very much. And also this music played in this movie is splendid.  The music expresses the complicated feeling of the main characters and sense of the seasons wonderfully. Especially, Because \"country road\" which is the theme song of the movie is music to become the key of the movie, I want you to pay attention by all means.  It is tended to think that this movie is for teenager but even adults enjoy watching it. If you troubled with something and are depressed, I want you to watch this movie. Surely you will positive!",
            "review_date": "2015-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much, a horribly executed nothing movie that drops half its cast in favor of extending its lack of story. Amateur writing paired with an immature approach to romance.",
            "review_date": "2015-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So cheesy though :3 haha",
            "review_date": "2015-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "captured my imagination",
            "review_date": "2015-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched it in Japanese with English Subtitles.\nLovely little film! As per most Studio Ghibli films, the tale is simple, limited characters, and the story just rolls out. This film could just as easily been done live action, but then it wouldn't be a Studio Ghibli movie.",
            "review_date": "2015-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I pretty much am the main character in this.  It has young romance the way it was meant to be, without as much drama as Twilight, but enough to know that it's there.",
            "review_date": "2015-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another happy-ending-Ghibli's-film that I love the most---after the Howl's. Though it's not so full of fantasies like Ghibli usual works but I really love the story and the flow how it goes...",
            "review_date": "2015-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Would really  love to watch this on Japanese",
            "review_date": "2015-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before leaving us, Kondo gave us this treasure of a film. Arigato.",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film makes me want to try a little harder at life.",
            "review_date": "2015-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Miyazaki film. What an emotional ride! I've never seen a film that so captured the experience of being a teenager; the innocence, the drama, the dreams, the puppy love, and the frustration of trying to decide what to do with life. It's very relaxed and slow, giving time for Suzuku to develop and for the audience to sympathize with her. It's focus on her desire to become a great writer feels like a love letter to all artists. Many artists feel so torn between the pressures of life, but still strive to keep their dream alive even when those closest to them tell them to stop wasting their time and be like everyone else. I saw a lot of myself in Suzuku. And her discovery that failure likely awaits those that are determined to do what is risky is just melting. If you're not into slow, calm movies, this isn't for you. There aren't any peaks where you say to yourself, \"this is one of the greats\". But for those of you that have the patience, there are plenty of gems to discover.",
            "review_date": "2015-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Evocatively sweet Japanese classic anime.",
            "review_date": "2015-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really cute story, but no one needs to hear 14 year olds proposing to each other after knowing each other for 3 months max.",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its a meandering story that doesn't seem to go anywhere, but in a way, you really don't mind at all.",
            "review_date": "2015-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is the best film of a writer, the best I've seen.",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I could definitely see this appealing to younger teenagers and parents of younger teenagers. Whisper of the Heart is a good honest tale of a teenager trying to find a sense of identity while trying to figure out her future, and that's the main plot. It's a very relate-able story that most could imagine themselves in.",
            "review_date": "2014-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not my type of movie-teenage romance-but I'm giving it five stars all the same, because it's about as perfect a story in this genre as you can have. It's soft, quiet, peaceful, and yet filled with an emotional storyline and a protagonist with whom we emote.\nThe only critique I have is that it just a little bit predictable, with the main male romance attraction. But that's okay; from what little I know, I think the kind of girls who would watch this would love it all the same.",
            "review_date": "2014-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whisper of the Heart strips away the Ghibli regular features of fantasy and magic and makes them look like clutter, astounding with its highly detailed and organic cinematography and delivering a deeply moving narrative that will make you re-evaluate your own childhood dreams.",
            "review_date": "2014-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this. It's a really sweet story and as ever wonderfully animated. I've seen lots of Studio Ghibli features now, and they never disappoint me!",
            "review_date": "2014-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nAt one point in our lives, we have all been lost. We stand on a crossroad, contemplating which one would lead us to our destination. During this point in our lives, we can't help but feel incompetent with ourselves as others we see that pass by us seem to be so sure on why they have chosen that particular path. It is the fear of disappointment and pain that prevents us from committing; therefore we stay on that one spot and procrastinate. To those that have made it, please don't be so hard on these lost individuals, as you yourself have gone through the same thing; be fortunate that you aren't in their position anymore.\n\nWhisper of the Heart is a film that genuinely reflects the hardships of a child's transition, the idea of having to be independent and carry responsibilities. It has spoken to me in such an effective way due to myself being in the protagonist's position a couple of years ago, spending more of my time studying and focusing on my musical interest, understanding and being inspired by the art form and letting it shape myself and my perception of the world.\n\nEventually, I took a chance on a profession and soon I would be nearly finished in gaining my degree, if things go well from now until the end of the year, but I still sometimes sit back and reflect on my past and deciding whether or not the choices I made were poor or great; watching this film makes all of my critical reflection come off as irrelevant. It doesn't matter anymore whether the decision I made was generally the best decision, without everything that I have done in the past, I may not have become the person that I am today; I may not even be interested in cinema, which is one of the most important aspects of my life at the moment.\n\nEach day I take in experiences and memories that would continuously grow me as a person. I am so glad that I spent most of my days in high school focusing on other things because at the time, they made me happy and that pursuing them was right for me. My sister, who is currently a year away from doing her final exams for high school, is currently on the same position as Whisper of the Heart's protagonist, and as her older sibling, I believe it is important for me to encourage her to do on what she feels is best for her. I don't want her standing in that crossroads for too long all by herself, as there is nothing worse in life than being lost and unhappy.\n\nOh, I forgot to mention. Whisper of the Heart was fantastic, arguably the best from the studio.",
            "review_date": "2014-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nAt one point in our lives, we have all been lost. We stand on a crossroad, contemplating which one would lead us to our destination. During this point in our lives, we can't help but feel incompetent with ourselves as others we see that pass by us seem to be so sure on why they have chosen that particular path. It is the fear of disappointment and pain that prevents us from committing; therefore we stay on that one spot and procrastinate. To those that have made it, please don't be so hard on these lost individuals, as you yourself have gone through the same thing; be fortunate that you aren't in their position anymore.\n\nWhisper of the Heart is a film that genuinely reflects the hardships of a child's transition, the idea of having to be independent and carry responsibilities. It has spoken to me in such an effective way due to myself being in her position a couple of years ago, spending more on my time studying and focusing on my musical interest, understanding and being inspired by the art form and letting it shape myself and my perception of the world.\n\nEventually, I took a chance on a profession and soon I would be nearly finished in gaining my degree, if things go well from now until the end of the year, but I still sometimes sit back and reflect on my past and deciding whether or not the choices I made were poor or great; watching this film makes all of my critical reflection come off as irrelevant. It doesn't matter anymore whether the decision I made was generally the best decision, without everything that I have done in the past, I may not have become the person that I am today; I may not even be interested in cinema, which is one of the most important aspects of my life at the moment.\n\nEach day I take in experiences and memories that would continuously grow me as a person. I am so glad that I spent most of my days in high school focusing on other things because at the time, they made me happy and at that time, I felt that was right for me. My sister, who is currently a year away from doing her final exams for high school, is currently on the same position as Whisper of the Heart's protagonist, and as her older sibling, I believe it is important for me to encourage her to do on what she feels is best for her. I don't want her standing in that crossroads for too long all by herself, as there is nothing worse in life than being lost and unhappy.\n\nOh, I forgot to mention. The film was fantastic, arguably the best from the studio.",
            "review_date": "2014-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Whisper Of The Heart' is perhaps Miyazaki's most tender tale of growing up and making hard life-changing decisions.",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply fantastic :-)",
            "review_date": "2014-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first Ghibli directed by someone other than Miyazaki or Takahata. It's a warm and likable tale of young love as well as commentary on the relationship between talent and drive in creative endeavors. It's very sweet and just all around good natured fun.",
            "review_date": "2014-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A highly overlooked Studio Ghibli anime that just left me astonished for what it already has to offer.",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my Studio Ghibli's favourite. This movie is all about dedication to arts and crafts and the fullfÃ®ment that comes with it.",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "20. Whisper Of The Heart\n\nWhen examining how everyone in the whole world adores this sentimental piece surrounding a 14 year old bookworm struggling to balance her writing passion with maintaining her grades (whilst reluctantly falling in love at the same time), it's difficult to defend this definitive \"worst\" position. For despite reports that this realistic portrayal of young bittersweet romance was exclusively aimed at a female audience, Whisper of the Heart went on to effortlessly seduce all genders regardless of intent, an impressive feat for the first Ghibli to be directed by someone other than Miyazaki or Takahata (note: this was also Kond?'s only Ghibli, as he died of an aneurysm shortly afterwards). But personally ... it underwhelmed me. The plot never seemed to go anywhere, I felt no incentive to invest in the characters (except, of course, for the Baron, but that's a different story...), and it lacked the fantasy elements which I have come to depend on the studio for (which should become even more evident as we go on). That said, perhaps its cute storytelling and safe execution will be your taste exactly (many claim this film as their favourite) but unfortunately it left me with nothing but boredom, resulting in my least favourite Ghibli ever. Sorry.\n\nTo read the rest of my 'Worst to Best: Studio Ghibli' list, click here: http://juicenothing.blogspot.co.uk/2014/06/worst-to-best-studio-ghibli.html",
            "review_date": "2014-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very sweet, charming, and overall just happy film that has nice themes and great animation.",
            "review_date": "2014-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good coming-of-age drama, written by Hayao Miyazaki, in which  high school girl Shizuku who aspires to be a writer experiences love for the first time, and gets in touch with her creative spirit. There is not a huge narrative thrust to this, but when the animation is so gorgeous and vivid (hand painted Tokyo backgrounds impress with their accuracy and level of detail), one shouldn't mind.",
            "review_date": "2014-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting smaller picture from the Masters at Studio Ghibli but quite interesting in its own right. Written by master Hayao Miyazaki but directed by another.\n\nIt's a nice story but rather slow to start & takes quite a while to get going. It's a story of young love & fears of the unknown.\n\nAs the story progresses there is an interesting side story that takes a fantasy turn but it is a nice film. It's not the best Ghibli film but it's worth a watch.",
            "review_date": "2014-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very lovely movie about dreams and love, really enjoyed it",
            "review_date": "2014-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The teenage drama has been done before, but Whisper of the Heart has a great amount of heart and interesting, yet quite complex conflicts about finding your talents.",
            "review_date": "2014-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another wonderful film by Hayao Miyazaki. A harmless story about following your dreams and the small hardships of being a 14 year old in high school.\nBoth characters, Shizuku and Seiji, are easy to get along with and the ending is touching. The story of Seiji's Grandfather and The Baron is both sweet and heart-wrenching. And, of course, the music is beautiful aswell, but that may be biased as I am slightly obsessed with violins :P Definitely worth 5 stars!",
            "review_date": "2014-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Taking note from the minimal, every-day style of Ozu, Miyazaki and Kondo craft a lovely tale of artists learning to come into their own, a fitting theme given their master and protege's relationship.",
            "review_date": "2014-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that served like a tranquilizer. And it's cute.",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Does this sound corny to you?\"\n\"It's a little corny, but you're a violin maker, not a writer.\"\n\nI can't argue it reaches \"Spirited Away\" levels of narrative and visual mastery, but just the same I didn't expect \"Whisper of the Heart\" to hit such an emotional chord in me, given especially how bummed I always am how difficult it is to find a Studio Ghibli production in America which isn't dubbed with the voices of famous English people. No matter; that annoyance drops pretty quickly when your movie is as ingeniously written and executed as \"Whisper\" is. Ghibli films just have this amazing sense of awe in every frame, this fantastic sense of optical voyeurism and splendid life. I haven't seen \"The Wind Rises\" yet (hands down one of my most anticipated of the new year), but one of the promotional stills has maybe the most representative image so far of the sweeping feeling incited by their 2D artwork: a character holding onto his hat against the wind and looking to the sky in admiration, at the idea that anything is possible -- if you dream it, it can come.\n\nWhich segues nicely into talking about \"Whisper of the Heart\", the first Ghibli film to be helmed by someone other than original co-founders Hayao Miyazaki and Isao Takahata (though Miyazaki is responsible for the deeply-felt intimacies of the adapted screenplay.) Expected to be the successor to Miyazaki and Takahata, \"Whisper\" was instead Yoshifumi Kond?'s sole outing as director before his untimely death in 1998 at age 47 of a rare aortic dissection caused reportedly by overwork.\n\nWhich, no less tragic, but what a fittingly bittersweet way to go given \"Whisper's\" central subject matter of artistic struggle and individual passion. Weighty themes for a kids' flick, and even more daunting for one which features a spunky girlhood protagonist. 14-year-old Shizuku (voiced by Brittany Snow in the translation) loves to read and realizes her vice for writing after she meets Seiji (David Gallagher), an older boy who handcrafts violins in the basement of a local antiques shop.\n\nPartially a tale of first love, or at least one's first brushing with the notion of it, \"Whisper of the Heart\" is more so a film about possession, not unlike \"Blue Is the Warmest Color\" or \"Beyond the Hills\" in that regard. Shizuku uses her inspiration to pen a novel based on the fictional history of the shop owner's cat statuette The Baron (Cary Elwes), rushing to finish in time for Seiji's return from an overseas apprenticeship in Italy. During his two month leave, we see Shizuku and her thoughts bloom effervescently, from twee moments of fantasy to recognizing her own merit as a writer comes from the rough edges within. That's what I related to most about \"Whisper of the Heart\", the fear of trying your hardest and best and it still not being good enough. That it blankets a happy hurt with positive soul and venerate lyricism, and sends you out believing the impossible, is all the more amazing. For the honchos at Ghibli, I can't think of a better sentiment. (83/100)",
            "review_date": "2014-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some sub-plots go nowhere and feel like they could be expanded upon or given more closure and the more realistic setting might turn off some Studio Ghibli fans but Whisper of the Heart is still a great story with a lot of genuine heart and two relatable main characters that share a believable chemistry and numerous adorable interactions. While some sub-plots feel like they could have been expanded upon many of them were enjoyable to follow regardless, several scenes are played out very well and the ending, while not a perfect fairy-tale ending is still very satisfactory and real. This wonderful coming-of-age story also boasts the usual quality of animation and sound design you would expect from a Studio Ghibli production.",
            "review_date": "2014-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Satisfying tale of inspiration, self-worth, and young love. Also, adorable. I relate a lot to Suzuku which concerns me as somebody almost 20 years older than her, but ... eh.",
            "review_date": "2014-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely teen love story, but it doesn't really go anywhere. Just sit back and relax and enjoy.",
            "review_date": "2014-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "classic animation movie with everything that needed.",
            "review_date": "2014-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant and Captivating.",
            "review_date": "2013-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending is a little too perfect, but the story is extremely charming. Be sure to watch the continuation of the story during the end credits that plays out visually at the top of the frame.",
            "review_date": "2013-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "cute but not that special.",
            "review_date": "2013-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1940's Fantasia Is My Tenth Favorite Film.",
            "review_date": "2013-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another incredible offering from Studio Ghibli, not directed by MIyazaki (though his script), but still exquisitely drawn urban tale of a school girl and her development as a writer. Finely etched characters give it a heart and soul that is frequently lacking from the much flashier Hollywood offerings.",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sweet and adorable, but also well thought out and articulate.",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the more realism based Studio Ghibli films, with a very good story, but a shotty ending.",
            "review_date": "2013-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the regular teenage love story.",
            "review_date": "2013-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice film. Enjoyed seeing the characters relationship develop along the film, but didn't quite like some parts because it wasn't logic.",
            "review_date": "2013-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*sigh* to be young and in love again...",
            "review_date": "2013-10-10",
            "source": "rt",
            "lang": "en"
        }
    ]
}