{
    "rating": 9.2,
    "release_date": "Invalid",
    "num_reviews": 130,
    "genres": [
        "Fantasy",
        "Animation"
    ],
    "summary": "Hana marries a wolf man and raises their two children alone after he dies. They move to the countryside and the children have adventures in the woods and at school.",
    "reviews": [
        {
            "content": "Beautiful Anime, emotion heavy",
            "review_date": "2022-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was so good. Yes its long, but worth it. The plot was fantastic and the film holds your interest despite long running time. You never know exactly where the film is headed plot wise, but it always seems to wrap up very nicely. The illustrations were  beautiful and loved the characters. Only some parts were a bit too fantastical or felt a little unnecessary, but overall amazing and highly recommend. It hits you in all the feels as a parent, like a good anime film should. If you like studio ghibli you will for sure like this one, that is a bit more mature in some sense.",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is beautiful.",
            "review_date": "2022-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wolf Children is a gorgeous film to watch, and there are some brilliant moments of filmmaking and cinematography. For me personally, I found Wolf Children to be too sentimental for my tastes, with the main character, Hana, the mother to Yuki and Ame, impeccably perfect and (as the film describes her) \"always smiling\". I would have liked some deeper themes to be explored in the story.",
            "review_date": "2022-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It got great reviews but I don't necessarily agree with that. Was it good, yes, but I don't think it was anything special.",
            "review_date": "2021-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully created backdrop scenery, but the story doesn't have much in it for adults. It would be wholesome enough for kids to watch, with its bucketloads of cutesiness, but the complete lack of humour means it doesn't compare well to other animated kids' movies in terms of entertainment.",
            "review_date": "2021-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Wolf Children tenderly invests us in the beautifully animated journey of a mother who's infallible love makes us truly reflect on those seeds planted and cared for with patience and determination, on the role of maternity in the big scheme of nature.",
            "review_date": "2021-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite animated film of all time. It's a beautiful yet heart wrenching movie about a single human mother raising her werewolf children after her partner got killed from an accident. She tries to hide her kids' wolf forms throughout the feature. The kids, Yuki and Ame are both very different from each other where Yuki is energetic while Ame is timid.",
            "review_date": "2021-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very wholesome furries",
            "review_date": "2021-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mamoru Hosoda, one of the contemporary Japanese anime directors, frequently follows certain patterns in his feature-length anime films. Certain elements are usually linked to each other by bearing symbolic meanings. Different creatures become family members. An object, usually an image, takes us back and forth in time. Tradition plays an important role in shaping modern life. In this review, I will explain these recurring elements in five different anime films that Hosoda produced after the 2000s: The Girl Who Leapt Through Time (2006), Summer Wars (2009), Wolf Children Ame and Yuki (2012), The Boy and the Beast (2015), Mirai (2018). We will look at how Mamoru Hosoda reproduces the issues of family ties and childhood, creatures and strangers, traditions and roots, classical master-apprentice relations, country and city, time and space in his unique narrative style. \n\nFull review: https://guncesinema.com/en/from-aliens-to-family-from-family-to-roots/",
            "review_date": "2021-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing film from beginning to end! One of the best anime films ever!",
            "review_date": "2021-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This shit hits hard, bro. From the small struggles of being a single mother to the growth of the children being displayed, it's honestly beautiful.",
            "review_date": "2020-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A blend of fantasy, romance and coming of age, with stunning animation, charming characters, and an emotionally rewarding narrative.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've ever watched.",
            "review_date": "2020-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "New kind of fairy tail.",
            "review_date": "2020-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While occasionally schmaltzy and somewhat predictable, it is hard not to admire the many bold choices at play from the visuals to the narrative conceit, which are sometimes exhilarating, distractingly ridiculous at others, but always thoughtfully enigmatic.",
            "review_date": "2020-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite anime movies.\nPoetic, heartfelt, effective and even better, consistently focusing in the themes as very few anime movies manage to do.\n\nBoth a coming of age and a parenting allegory that hits closer to home than one could think.",
            "review_date": "2020-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The experiences of Ame, Yuki, and their mother are set in a modern fairy tale. Somehow this medium makes it easier to relate for those who have experience similar joys and hardships.  Hosoda applies his skills very well in this stunning, genre crossing anime.",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Movie Okami Kodomo no Ame to Yuki, is a beautiful movie that pulls at heartstrings and lets a viewer look into the life of a single parent. For a class, I am taking we looked at a handful of movies and analyzed the aspects of family within them. This movie showed many topics discussed in our class. Such as cohabitation instead of marriage, children in a cohabitation, then single parenthood.",
            "review_date": "2019-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fuck i can't watch the movie",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An inspirational and heart-melting modern fable about single-motherhood and acceptance, director Mamoru Hosoda helms \"Wolf Children\" with dignity, frankness, and little restraint in being weird on occasion.",
            "review_date": "2019-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FANTASTIC!! LOVE IT!",
            "review_date": "2019-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I usually donï¿ 1/2 1/2 1/2 1/2 1/2(TM)t like too many of ghibli movies. But I thoroughly enjoyed this one",
            "review_date": "2019-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A better love story than Twilight.",
            "review_date": "2019-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So emotional, the script is so solid and very good contructed... wow",
            "review_date": "2019-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A modern masterpiece, absolutely soul-crushing to watch when you're a parent. It really knows how to take all the pains and fears of raising a family and thrusts them on you in such a gritty in a real way that you can't help but fall in love with it.",
            "review_date": "2019-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Freaking love this movie absolutely recommend it",
            "review_date": "2018-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tale about motherhood and the hardships of letting your children go to become their own persons, impressively told through the magical and surreal lives of a family of werewolves and their human mother.",
            "review_date": "2018-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was great.",
            "review_date": "2018-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful and heartwarming coming of age story with an interesting twist.",
            "review_date": "2018-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorite films.\nIt made me laugh \nIt made me angry and of course it made me cry like an infant.\nThis movie has a child like energy to it yet it is a mature film about a mother raising her children(or wolf children).If you love animation or film in general I highly recommend this to all of you.",
            "review_date": "2018-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "shit movie to be honest dont watch it",
            "review_date": "2018-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very long and epic story about raising children with animal super powers of wolves. Lyrical tone. Long. About right. Some straying moments. A crazy story that comes out quite good for the family, I think.",
            "review_date": "2018-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would say it is really and emotional and enjoyable movie due to the fact that it gives the viewers the feeling of comfortable and realize how strong the relationship between a mother and her children can become through hardships of life.",
            "review_date": "2018-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My tears won't stop even after the movie.",
            "review_date": "2018-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While still not being as good as The boy and the beast, Wolf Children has enough of what made most of Hosada's movies good to make it a blast to watch.",
            "review_date": "2018-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You're gonna want to hug your mother and never let her go after this movie.",
            "review_date": "2018-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation is on a great level. The story, while it is cute it does not feel fully elegant and does not digs on deep layer. However it is well crafted and worth watching.",
            "review_date": "2018-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm 28, i'm still crying at this and that's the third time I see it.",
            "review_date": "2018-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "thought this one was ok",
            "review_date": "2018-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fairly satisfying, 4 stars and no more.",
            "review_date": "2017-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very beautiful, brought tears to my eyes.",
            "review_date": "2017-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very heartwarming, and a little strange, movie met with good direction and very well done animation. Points off for the very strange feeling that the beginning of the film that makes the story feel a little bit more like the start to a furry fanfic.",
            "review_date": "2017-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not quite what I expected, but a beautiful and moving film experience.",
            "review_date": "2017-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolutely fantastic journey! Beautiful storytelling",
            "review_date": "2017-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So disappointed. Not even a real furry-movie.",
            "review_date": "2017-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great animation and such a wonderful story overall.",
            "review_date": "2017-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was phenomenal \nLows were pretty low but the highs were really high\nBeautiful depiction of the relationship between mother and child",
            "review_date": "2017-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though some of the animation designs imitate some of the works from Studio Ghibli, that shouldn't contradict \"Wolf Children's\" beautiful, fable tale about a single mother trying to raise two of her children who are also half-wolves from their father's side. From the perspective of a child who was raised by his single mother, this film hits me right in the heart because it celebrates the power and hardship that our mothers go through in order to make our lives easier and better than theirs. I believe this movie was a personal one made by the director and his crew, because you can see the hard work and the heart they deliver on the beautiful, painted screen. A job well done.",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I keep coming back to this, and I don't know why! Respect that it tells the longer tale, one that doesn't end with 'one big obstacle to overcome'. It moves back and forth. Saddest during its uplifting moments.",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was incredible. I laughed, I cried (especially at the end). Definitely a must see! I didn't think I'd enjoy it this much. I quite happily let the waterworks run!",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story, characters, emotion and animation. 10/10 from me",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen this already but I have not written my thoughts about it. Here we go...\n\nMamoru Hosoda who is famous for Girl Who Leapt Through Time and Summer Wars made this very heartwarming animation that may tear you up. \n\nThe story starts with Hana as a college student who falls in love with a man who is part wolf and things goes on later that leaves her with 2 children with the partial wolf genes. \n\nThe children is focused later more than the mother because the daughter would choose her human path and the son wants to represent the wolf. This movie creates very beautiful thoughts in the story. Hosoda did very well for this animation feature making life a meaning for the mother, son and daughter. The father had an unfortunate event but this is the movie that teaches a lot about choosing ways of life and distinguishing who you really are.  Hosoda's art style of animation is recognizable with the hair styles and colors he draws. This is a film you can take a good time to sit through and watch.",
            "review_date": "2017-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would definitely recommend this.\nIt's relatable, heartwarming, and extremely emotional at points.\nThe animations are amazing and realistic, the voice acting is superb, etc.\nIt sits at the top of my list of favorite movies.",
            "review_date": "2017-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best heart warming short anime movies i ever seen I cried at the end ????????",
            "review_date": "2017-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation was absolutely beautiful but I feel it didn't make up for the weird story and general awkwardness that seemed to fill this entire film. I also feel it should have ended about 40 minutes sooner.",
            "review_date": "2017-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed how this anime fairy tale has mature themes but at the same time it's inspiring, this is a delightful family drama",
            "review_date": "2016-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a beautifull history and extraordinary characters. This is my favourite anime film.",
            "review_date": "2016-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw the dubbed version of this film, and I loved it. I thought the (English version) narrators had a soothing and pleasant voice that matched each of the characters. Though the trailer made the film seem more childish than it is, my eyes actually watered several times during the film.\n\nThe plot is a very simple one, but the touch of fantasy gives the film a dramatic twist. In a small town of, presumably, Japan, a young female narrator retells the story of her mother, Hana. As a young college student, Hana falls in love with a man who later reveals himself to be a wolf man. Their relationship develops, and during the course of the next 10+ years, we are flashed forward to when Hana gives birth to her two children, Yuki (\"Snow\") and later Ame (\"Rain\"). Despite the changes that the family has to make to get around, e.g. giving birth at home instead of at the hospital to avoid her children been denoted as \"wolf children\", and hence be subjected to further investigation that would prevent them having a normal lifestyle, Hana and the wolf man's compassion enable them to make do with what they are most comfortable with.\n\nHowever, when tragedy strikes this family and the wolf man suddenly dies, Hana has a hard time taking care of her wolf children. Between working, tending to their needs, and hiding them from the public eye, their lives in the city eventually leads Hana and her children to move to the countryside. There, the children are able to grow more comfortably and freely. It is here where we see Yuki and Ame's personalities blossom as two opposing individuals. The identities they had as children evolve dramatically as they get older.\n\nOn the one hand, Yuki has always been the boisterous and energetic big sister. She's dauntless and witty. When she starts attending school, however, she realizes that she does not fit in with the crowd. Her idiosyncratic tastes in comparison to the girls at her school leads her to believe that she should do more to fit in.\n\nOn the other hand, Ame grew up as the shy and clumsy one. He was by his mom's side most of the times, and was fearful both as human and wolf. When it is time for him to attend school, like Yuki, he goes through a dramatic change. Unlike Yuki, however, the social pressure makes him recoil towards his wolf self, rather than blend in with the human crowd.\n\nWhat I loved most about this film was definitely seeing the characters' develop through the struggles of a clearly atypical lifestyle. Hana's strength as a wife and mother is admirable, and her difficulties understanding and raising her wolf children never take away her cheerful and optimistic personality. As for the children, the people they grew up to be (as teenagers) was definitely different to what I had initially thought. I had believed that they would both embrace their wolf-human personality; however, it is clear by the end of the film that they cannot live as 'both', and both have chosen to embrace one identity over the other. The fact that they chose to left the other identity behind does not mean it stops being part of them, which makes their transition into teenage-hood even harder. Nonetheless, I believe the film showed beautifully how social pressures, parental guidance and external influences can create two people with completely opposed identities (Yuki and Ame), despite having the same upbringing.\n\nOn the surface, the film seems quite childish. But if you have watched, or choose to watch, the film, you'll see that it definitely deals with issues that go beyond that of a simple film. Though there's a conclusive and somewhat-happy ending, it's clearly not the \"happily ever after\" of a children's film. This film really resonated with other Studio Ghibli films that I have watched (despite it not being one), precisely because of the depth that it goes to portray the characters.\n\nRecurring theme that you may have noticed from these anime films is identity and social isolation. All the characters struggle with their identity not necessarily because they are different from those surrounding them, but because they deal with bountiful amounts of inner conflicts that leads them to feel isolated from their surroundings. It's definitely a theme that many individuals can relate to, and the fact that these films portray their complexity to its finest is just beautiful.",
            "review_date": "2016-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lonely young woman meets and eventually marries a guy who turns out to be the Wolfman. After his accidental death she struggles with the problem of raising their two children. And that's about it storywise, and not much else. What's lacking here in dramatics though is made up for in lush visuals. If that's your thing, then this is your ride.",
            "review_date": "2016-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most beautiful anime movies I've seen. Makes it to my top 5 easy.",
            "review_date": "2016-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of the most heartfelt movies I have seen.",
            "review_date": "2016-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super movie! Best from director.. So humane that makes you wanna have children and show them the film.. I recommend it to everyone.",
            "review_date": "2016-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a beautiful film. It left me feeling sad in the end, but happy I had watched it. It was bittersweet at it's finest. So realistic were the characters, and the animation and detail in the scenery was just incredible. This director could rival some of the directors at Studio Ghibli. Just pure beauty, all around :)",
            "review_date": "2016-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "furry propaganda aside. this was a great film about family, growing up and the trials that come with life",
            "review_date": "2016-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful and solemn film. It was much more serious and melancholy than I expected but that is not a drawback. Even though it might be a bit slow for kids expecting a Hollywood style animated film, my five year old son was fascinated by it and asked to see it again the day after. The only downside is the English dubbing which is really off and doesn't match the style or the subject of the film.",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is absolutely marvelous! I am a huge anime fan and this is one of my favorites. It has creative storytelling, interesting characters and ideas, and is so beautiful to look at. Even my family, who aren't big anime fans, adores this film. So whether you're just a casual moviegoer or a hardcore Japanese film fan, I highly recommend this. It is quite possibly the most beautiful movie I have ever witnessed.",
            "review_date": "2016-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I first heard of \"Wolf Children\" I never knew what to expect, other than thinking about other movies that came before it that were of a similar caliber.  The aspects of parenting, kept secrets, finding one's place in life, magical elements, an odd romance, etc. have been tackled by Walt Disney, Miyazaki, Takahata, and the like.  Wolf Children takes these familiar themes and expands on them without treading on executions that the average viewer has seen before.\n\nA shy, yet kind university student Hana falls for a mysterious man that attends the same university.  While they hang out and build their relationship, he reveals to Hana his family secret: he transforms into a werewolf at nightfall during a full moon.  The two begin a married life and have two children: a daughter named Yumi and son Ami.  Both of who have adopted their father's shapeshifting genes.  The father mysteriously dies during a hunt for food, thus leaving Hana to raise the children as a single mother.  Hana's life as a single mother comes with many hardships, but as she continues she begins to realize that motherhood was what she was destined for.\n\nThe description may seem like something pessimistic, but Wolf Children's premise is anything but.  I must admit that upon my initial viewing, I thought that I had the whole movie figured out.  My impressions were that it was going to be a odd romance, the mother is going to make feeble, luck-based attempts at keeping secrets from the general populace, a possible misunderstanding is about to brew, then there's going to be a message about tolerance as well as environmentalism, etc. while in the back of my mind I was wondering how well the character drama was going to play out.  \n\nWhat I got was quite the contrary.  It turned out that there is no message about tolerance or the environment.  Not to mention that the main conflict does not revolve around Hana keeping her children's secret away from everyone.  The main conflict is more about her being a parent and her children trying to discover their purpose and meaning in life.  While it may seem too simplistic to most, it really works in this movie.  I found myself really getting immersed into the lives of the characters as well as every display of genuine feeling, interaction, and circumstance that took place.  The relationship between Hana and her two kids never ceased to put a smile on my face.  On top of that, I never knew where the story was going and was left guessing what might happen next. \n\nThe artwork and animation are very well done, though in comparison to Hosoda's earlier entries like \"Summer Wars\" and \"The Girl Who Leapt Through Time\" the animation does feel a bit more straightforward.  While the fluidity and artistic quality still stand, \"Wolf Children\" does take a more different approach to its scale.  It would stand to reason that, since the majority of \"Wolf Children\" takes place in the countryside and that animation is fiscally limited in and of itself, but unlike the aforementioned films, which had quality in not just the movement of the characters, but also in how the backgrounds were set up to make everything convincing to the viewer that was being presented is an actual world.  \"Wolf Children\" hinges more on scenic displays.  Thus, leaving little room for background interactions and making it feel more linear than the previous films.  Much of the landscapes are very well done and when one actually sees how grand the movie can get in this realm, it truly delivers.  The music is also very well done and really helps in adding to the feeling of each display.\n\nThere is never anything wrong with an artist to tinker with his/her style and while much of \"Wolf Children\" holds up to Hosoda's standards on a technical level, the fact that there isn't as much environmental interaction and a more narrow focus on what is presented combined with a more scenic approach does make it more linear in comparison.  What makes Mamoru Hosoda great is how he can take just a basic story layout and make it interesting without resorting to approaches that one would come to expect.  There are variations and improvements done here and there and there are elements of fantasy intermingled within an otherwise realistic setting, but nothing makes \"Wolf Children\" lose any iota of its identity.  The English dubbing is also expertly handled, but how can one expect any less when Funimation Productions handles the localization? \n\nWolf Children is perhaps one of the most honest movies that aficionado Mamoru Hosoda has done.  Wolf Children is not a preachy film that pulls its story through with cliché-ridden circumstances to try to add more \"depth\" to its sense of conflict, but relies more on characterizations that appeal to realistic situations with a touch of fantasy to tell a basic story about parenting and finding one's place.  There have been several attempts by Western animators to try and bring adults into the audience, especially with stories that are geared more towards adults.  Though, the general audience has most likely looked at each effort as a niche practice.  Anime may not make up nearly the amount of ticket sales here as it does in Japan, but just because it may come from a culture that differs significantly doesn't mean that it has no right to be seen.  A movie like \"Wolf Children\" absolutely deserves that chance.",
            "review_date": "2016-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply beautiful. The best thing I've seen lately. Also one of the strongest female characters I've ever seen on a movie. Very recommended.",
            "review_date": "2016-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure what to think of the movie. Basically there wasn't that many surprises. One child went toward their human side, while another went to their wolf side. I suspected Yuki's friend to be part wolf since he had a keen sense of smell but nothing came of it. Also nothing came of the grandfather helping her, it wasn't directly stated why he told the neighbors to watch out for her. I guess a lot was introduced but not concluded.",
            "review_date": "2016-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director Mamoru Hosoda boosted his skills at his best level yet in this sub-textually most realistic while thoughtfully imaginative epic masterpiece as one of the best feel-good films out there - even though sometimes harrowing - and the best coming-of-age film next to \"Boyhood\" but more emotional. (A)",
            "review_date": "2016-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie. Their is a narrator but the story of a mother and her two werewolf children is shown. The animation is beautiful, and the sound track complements the film perfectly.",
            "review_date": "2016-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hauntingly beautiful. It's minimalist dialogue and slow pace only added to its beauty.",
            "review_date": "2016-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the movie, it makes people think about what type of supernatural and mystery are in within this world, overall I loved the plot and the animation.  You also get attached with the main character  and feel somewhat of her emotions . Truly a great movie",
            "review_date": "2016-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hosoda's story of motherhood is heartbreaking and masterfully done. Told with modern sensibilities, the film doesn't shy away in portraying the difficulties of being a single mother, with great animation and storytelling chops to boot. A great mirror to his later Boy and the Beast.",
            "review_date": "2016-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best anime movie i ever see . the memories that this anime give just indescribable .",
            "review_date": "2016-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very heart touching love story that comes to its kids. One word genius!  A very unique fantasy story about kids that could turn into wolves anytime they would like to be. Very heartwarming, very sad. And gives the meeting about how you would you like to be in what you want to be. Breathtaking animation, strong story arc, is just complete unique. Absolute favorite all the way. \n\nGrade\n9.5/10",
            "review_date": "2016-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A modern approach to the myth of the wolverine in the wolf extincted Japan.\n\nThe animation is really fantastic, specially the background staging.\n\nThe story is interesting and is quite touching the struggle of the mother to raise her children but at some point it becomes a bit boring for lack of rythm.",
            "review_date": "2016-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story but the story telling does not help the linear flow of imagery. Good soundtrack, if you are into that.",
            "review_date": "2016-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The beginning of this film feels very Twilight-esque, but I can say it gets much better from there. By the end of the movie I can say that this has got to be Hosada's best film that I've seen so far.\nWolf Children is a masterpiece.",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie made me cried everytime i saw it. I love it,",
            "review_date": "2016-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I was mildly interested in the story of the children, where they ended up is a place I just can't agree with.  Had to drop what probably would have been an 8 movie to a 7 because of this.",
            "review_date": "2016-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An enchanting film about the strength of a mother's love and the courage to choose our own destiny. The emotional intensity of the film creeps up on you despite its subtle and gentle rhythm. 2 paws up.",
            "review_date": "2016-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pleasant & heart warming; resisted watching it for its 1 dimensional storyline. enjoyed it; but so much more could've been depicted. best part was the silent yet too quick development of their romance in beginning that reminded me of Up.",
            "review_date": "2016-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Different type of werewolf film as we follow a little family where the result of a werewolf father and a human mother results in two shape shifting kids. They can be human, they can be wolfes - but it's not easy to control it. Quite weird plot, but as an animated tale it works out smoothly.\n\nTouching story that looks very good on screen. It's never boring and it's never as silly as it might sound.\n\n7 out of 10 rainy days.",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie about a mother raising two wolf children. A simple story and setup hasn't resonated as much as this movie within me as Wolf Children. Emotional and full of life, I am at a loss for words. Beautiful",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly. I found this movie really touching, and I totally loved it.",
            "review_date": "2016-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Each one of them have experience their own growth. Very persuasive story make the audiences nod and burst into tears at the end. This movie is even more touching if you appreciate the theme song after the movie is over.",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit of a strange story but the animation was pretty good.",
            "review_date": "2015-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gives a fantasy treatment to the subject of child raising. Too self-indulgent for my taste.",
            "review_date": "2015-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful story about the love of a mother for her children.",
            "review_date": "2015-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The overall story (animation included) was a bit bland, though towards the ending the story began to pick up, mainly due to the increased characterization and development. I wish they would have given the wolf-father more character, and I would have liked a better explanation for the wolf-blood concept. The animation scenes towards the end were beautiful, though the beginning fails to do anything new or innovative. I do believe a lot of effort was put into this film, but overall it's main fault is in the bland, overused 'secret power' concept it bases it's entire plot on. It takes an interesting and unconventional route in addressing the problem, but overall could never be truly original.",
            "review_date": "2015-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stunningly beautiful and heartfelt anime. Hands down one of the best movies of 2012.",
            "review_date": "2015-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was reluctant to watch it as the poster looked too childish/girlish, was surprised when I finally got to see it. It's not even meant for children with its deep meaning and every day settings. While it does have fantasy elements, the overall movie is as real as it gets to realistic situation. The odd storytelling gets from strange to charming to mature to somber to relief way too often, it's a movie with rushes of emotions. It's a movie about a mother and her love and sacrifices in raising her children's.",
            "review_date": "2015-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If anyone asked me to show them an example of a good anime, then OKAMI KODOMO NO AME TO YUKI is the perfect introductory candidate. The ending kinda reminds me of the short story \"The Call of The Wild\" by Jack London.",
            "review_date": "2015-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful, moving film that showcases what it means to be a single mother in extraordinary circumstances and how children find themselves.",
            "review_date": "2015-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is truly a beautiful film, is quite charming, the plot is amazing, the art is beautiful is the soundtrack is great. It is certainly one of the best animations I've ever seen.",
            "review_date": "2015-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wolf Children holds such a special place in my heart. Not only is it a well animated tale about motherhood and learning to accept your own path in life, but it's one of the very few films that actually made me feel as though I was a part of the film's world. It's an experience I rarely ever have and I love it every time.",
            "review_date": "2015-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I haven't been this sad since the end of Clannad: After Story. The movie's story is weird, but in every good way. It's about a girl who falls in love with a guy who is actually a sort of shapeshifter, he can turn into a wolf whenever he wants (nothing like a werewolf). And so through some questionable acts she becomes pregnant and they have a beautiful little girl Yuki, and next year a beautiful little boy Ame. Yuki meaning snow in Japanese due to her being born during Winter, and Ame meaning rain in Japanese due to him being born in the rain. After the father unexpectedely dies, the mother, Hana is left alone with her children. And what's so great about this anime is how real it is! Even with the children being part wolves, I can't help but think that this must be how lots of mothers felt raising their children. It handles the story really well and surprisingly isn't that cliched. The art is amazing! It's one of the best looking anime I've ever seen. The voice acting is great, especially the kids. The music is beautiful. I loved it. It fits so great with the movie and makes a beautiful scene even more beautiful! The characters are vivid and very well developed. You can relate to them easily and care about them. The ending is very moving and emotional. It's both happy and heart-breaking at the same time. I won't spoil anything. All in all, this is an amazing anime with great, loveable characters, an interesting plot, a beautiful look and amazing soundtrack! I would deffinetely recommend seeing this anime. Do not miss out!",
            "review_date": "2015-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absolutly loved it. i watch this multiple times because of how amazing it is. the story is so good and captivating, and it has suspense moments where you let out your true emotions. parts i cried at and parts i laughed at. highly recommended. slice of life mostly.",
            "review_date": "2015-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie made me laff and cry xD :'(",
            "review_date": "2015-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wolf Children is simply one of the best animated films I've had the pleasure of viewing . Great story, wonderful music, and terrific visuals make this a must see for any anime fan.",
            "review_date": "2015-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Narratively beautiful, sometimes in silence abounds. Wolf Children is about a cheerful and struggling mother rising a \"wild animal\" in the house told in a poetic, mature and unconventional way.",
            "review_date": "2015-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic story telling, and great animation.",
            "review_date": "2015-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "mother's are amazing",
            "review_date": "2015-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've seen. It's about a young woman who falls in love with a man who just so happens to be a wolf. They have a couple of children together, but then her husband dies and she is left to raise the kids alone, not just as a single mother, but mother to two young wolf children she has no idea how to raise. She tries her best to be a good mother to them and protect them, keeping them safe from the world knowing their secret. It's a film about parenthood, but also a coming of age tale as well, as you watch the children grow up. It is interesting to see how the kids change their views of their identity as wolves as they get older. They both go in opposite directions from where they first started. It rings true to life. It's the essence of a family drama, I think anyone could relate to. It's beautiful and tear jerking at times.",
            "review_date": "2015-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my top 5 favourite Anime films, one of the best animated films of all time and Mamoru Hosoda's best work to date. This is simply beautiful story-telling.",
            "review_date": "2015-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute and fun and stuff. Still a better love story than Twilight. No, seriously, I think Stephanie Meyer saw this film because the \"what am I?\" \"Vampire!\" scene is basically ripped from this.",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very unique piece of anime that seems to be just as concerned with the difficulties of being a single parent as much as raising two very differently spirited children who also happen to be able to become wolves.",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely fantastic animation, one of the best, and most heart-felt animations I've ever seen.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't fully articulate why I like this so much, but something about it speaks to my innards. A very special film, to be sure.",
            "review_date": "2015-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"im not crying its raining\" a battle of a young mom trying to raise two kids on her own and putting her life in front of them .so powerful i love u mom!!!",
            "review_date": "2015-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie filled with powerful moments that will make you feel emotional and that your supposed to care about the characters.",
            "review_date": "2014-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kills me every time...",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Wolf Children\" proves to be a heartwarming, yet very touching animated film that tells the story of a mother who raises two young children born from a werewolf she met & fell in love with. Following his untimely death, she continues to raise them despite some setbacks; overtime, all three begin to learn about new things in life while the children choose to decide whether they should be wolves or humans. All in all, \"Wolf Children\" shows the struggles of raising a family & life lessons that impact such a family - both good & bad. A very moving film that will guarantee to leave you in tears & yet also give you some insight of life, whether it is humans or wildlife nature.",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you read the concept, and most will probably think it's a crazy concept. You would be mistaken. The movie's main purpose can relate to many in regards to raising children, and overall the story is amazing with great character development. It adds a magical element to spice up the formula, and it works. It may seem unique and weird at moments, yet it's enticing. This is a must watch for anyone.",
            "review_date": "2014-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you peer through Wolf Children's thick coat, you might find your nostalgic childhood somewhere in the mix. The child characters have to choose to live their lives the way they feel happy in or hide their true selves to the public eye. While the concept of the movie feels overly goofy, Wolf Children is able to live on with it's Studio Ghibli charm.",
            "review_date": "2014-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good dialogue and simple story that was well in depth without prolonging the story to unnecessary points. The maker of Summer Wars has done as amazing job once more.",
            "review_date": "2014-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Wolf Children is unique masterpiece as it blends magical realism of werewolves with themes of parenthood and coming of age. It also deals with life choices and identity. People may think that the animation is inferior compared to the works of Studio Ghibli and Makoto Shinkai, but I reckon that is not the case. The animation is so fluid and natural it may appear simplistic and too subtle.",
            "review_date": "2014-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Roommate: \"This movie just kicked my heart in the balls.\"",
            "review_date": "2014-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my favorite full length anime movie. As a dog lover and as an anime lover with an outsider complex, this movie spoke to me. It's a lot of nothing, but beautiful nothing. \n\nThe gist of the movie is that a woman falls in love with a half wolf half man (since anime), then tragedy strikes and she's now forced to take care of her two half wolf kids struggling to take care of such alien beings pretty much on her own, the story is told from the daughter's perspective. It's a great slice of life anime, done well and realistically. Just replace the wolf aspect with a disorder or something along the lines and you've got a highly relatable movie. The three movies of his, don't necessarily have the happiest ending, or sometimes like in this, any real resolve, they just are. One of the beauty of Anime that western films can't get away with outside of the indie market, and even then they rarely just end on nothing.",
            "review_date": "2014-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There were definitely some scenes that could have been left, one that makes it hard to believe the movie was rated PG, and others that just were not needed for the story at all. This movie was overall good, but because of it's length, it's one I would not watch over and over again, would recommend as a one time watch though.",
            "review_date": "2014-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wolf Children is one of the most mature, emotional, charming, gorgeous, dramatic, cute, stunning, and just downright incredible kids films of all time. The characters are unforgettable, the animation is beautiful, the music is enchanting, and the themes are adultery. I absolutely adored this movie.",
            "review_date": "2014-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie, its my favorite. Wolf Children will break your heart to pieces and mend it back together again.",
            "review_date": "2014-11-01",
            "source": "rt",
            "lang": "en"
        }
    ]
}