{
    "rating": 5.0,
    "release_date": "Invalid",
    "num_reviews": 48,
    "genres": [
        "English"
    ],
    "summary": "When Beth and Kevin's eight-year-old son Joshua develops an imaginary Friend named Z, they think it's cute... But they soon realize just how wrong they are. Z becomes a terrible influence on Josh and their innocent son turns into someone they barely recognize. It's only when Beth starts uncovering her own past, that she learns that Josh's new friend Z, may not be so imaginary, after all.",
    "reviews": [
        {
            "content": "PP PIOR FILME DE TERROR JA FEITO",
            "review_date": "2023-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The imaginary friend \"Z\" delivers some creepy and frightening scenes. And it is  convincing enough to makes us believe it is really there.",
            "review_date": "2022-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's no Babadook or even 'Toby' from Paranormal Activity but it plays alot like The Babadook, perhaps a little bit too much.  For me, I couldn't stop seeing the similarities so focus just wasn't possible.",
            "review_date": "2022-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Z is comfort food horror. It's a not overly scary haunted house / imaginary friend tale that has one mid-story twist and is otherwise as paint by numbers as you can imagine. It's pretty engaging though despite how unoriginal it is. I won't remember much about Z even in as short as a couple months from now, but it's an enjoyable 80 minutes.",
            "review_date": "2022-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a good movie. You don't know what to believe or not. I'd definitely lable this a psychological thriller. It does leave you sad",
            "review_date": "2022-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a good movie good actors very suspenseful",
            "review_date": "2022-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At times everything works and the film can be unsettling and even a bit creepy. Then terribly written characters show up to move the plot along and it falls apart. The \"husband/father\" character may be the worst one ever imagined. All in all it's ok.",
            "review_date": "2022-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent little flick about a creepy imaginary friend. Nothing too deep but pretty cool in some ways.",
            "review_date": "2021-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has no depth, no value, no message, and (more importantly) no scare. What felt like a painful 5 hour experience of just wanting the train wreck to end, this 1h20m run time drags harder than a guilty criminal's cigarette during a police interrogation.",
            "review_date": "2021-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very banal horror movie with its monster, dumb characters with unrealistic reactions, shrilling violins and so on",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not at all bad, but the story lacks content.",
            "review_date": "2021-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent horror. Modern day brilliance because people are gripped. A terrific way of dealing with things for the director and the cast.",
            "review_date": "2021-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The script has creativity, maybe even in the name of the thing or maybe not.",
            "review_date": "2021-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was better than the usual trite that Hollywood tends to pump out but was still disappointing  with several plot holes that made no sense and tacky effects. \nThe fact that the father was found slaughtered with the blood writing on the wall etc but she just gets to go live in a house all alone with no investigation into her involvement was stupid. The way the cops come in with guns with the psychiatrist was also beyond absurd. The way Z was eating food and demanding low fat milk - ludicrous. Where does the food go? Surely it would just plop onto the floor! The very fake looking CGI fire was completely unconvincing. The fact that she survives hanging and is not even in hospital - preposterous.  Overall it was quite effective and creepy but the more I think about it the more stupid it seems. Nowhere near as good as ‘The Babadook' which is an absolute classic and benchmark in horror. This pales in comparison.",
            "review_date": "2021-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice concept that perhaps struggles to nail the point it hovers around for most of the third act, but gets the fundamentals right to create an eery and unsettling film. You might find the closing 20 minutes a little jarring as it clumsily steps over smarter ways to end the film, but that doesn't undo the good atmosphere earned earlier.\n\nThe choice to build slowly serves the film well and there are some nice touches. It doesn't really do anything new but it's definitely worth watching for fans of the genre.",
            "review_date": "2021-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first 3/4 of this movie were the best horror experience I've had in years. Taking a \"less is more\" approach, the film successfully builds an uneasy atmosphere that doesn't require the traditional jump scares to make you jump. While the narrative falls apart towards the end, the creepiness will stick with you.",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Painful to watch.  The storyline starts out ridiculous and just gets worse.  Save your time and watch something else.",
            "review_date": "2021-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie. Jett Klyne and Keegan Connor Tracy are great!",
            "review_date": "2021-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very nice, especially the fact that the creature is seen a few times. the Jumpscare were well calculated, the scene when Z comes out of the wall to attack the protagonist's husband is spectacular. Interesting how Z manages to somehow interact with the outside world. I recommend it to everyone who has seen babadook and similar movies.",
            "review_date": "2021-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Weak CGI, worst script and nonsense. At leat there are good actors.",
            "review_date": "2021-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good starting idea but overall disapointing.",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Help, my imaginary friend is after my mom",
            "review_date": "2021-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only one things Should be Delete Form this film is Stupid jump scare it Not even Matter This Film is Scary Enough Everythings will be better if this film without stupid Jump scare",
            "review_date": "2021-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": " Slowwwwwwww ,not scary and a huge waste of time was not impressed at all. ",
            "review_date": "2021-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A young couple begin to become concerned with the behaviour of their son after he starts to have an imaginary friend named Z. \nThis was pretty good.  Nothing overly new or groundbreaking but the story is told well and believably performed.  A nice little surprise of a horror movie.",
            "review_date": "2021-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extraordinarily unnerving and featuring exceptional, thought-provoking writing and standout performances from Keegan Connor Tracy and Jett Klyne, Z is guaranteed to get inside your head and haunt you for days.",
            "review_date": "2021-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very engrossing and well paced!",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a truly original horror film. This movie creeped me out, surprised me at its narrative shift, and it maintained a sense of dread throughout the film. This movie will not scare you, but it will creep you out. It will leave you feeling off after it is done. But it is an incredibly original twist on several old horror tropes, contains a grain of social commentary if one is looking for it, and using just basic camera angles and sounds the audience feels the dread and anxiety of the characters. A simple movie, with simple direction, but it truly is an underrated master horror film.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The predictable and seemingly thrown together backstory, the unconvincing current story, the bad effects, bad acting, the scary friend that makes no sense on either side of the spectrum of supernatural or mental illness and characters you can't sympathize with or care about even remotely totally ruin the one or two decent jump scares, and the one truly enjoyably shocking moment.\nOnce they topped it off with a ruined ending that started out good, I realized you're not missing much.",
            "review_date": "2020-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent first half but completely fizzled out, one of those horror movies where the \"lore\" of the movie is never really consistent (is it psychological it is actually happening?) felt like a cop out, just skip it.",
            "review_date": "2020-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie! And no, it's not about mental illness because Z is real. She couldn't kill herself so she couldn't kill him. \nWhat could be better about the movie? Better support actors and actresses, better atmosphere. Solid performances by the kid and mom, good plot. Thumbs up! 👍🏻",
            "review_date": "2020-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've always loved a good horror movie. I grew up with Friday the 13th, Nightmare on Elm Street and so many other iconic movies. Over the last 20 years horror movies haven't really been horror movies, until now....  Z grabs ahold of you pretty quick and will make you afraid of the dark once again. Excellent story. Keeps you on edge and when you least expect it deliveries the best jump scare ive experienced in 20 years!!! I literally was trying to craw backwards across my bed to get away from my laptop!!! At times the story plot is a bit predictable. Although over all Z has made my top 5 for the horror genre. Want to feel uneasy after a movie? This will do it!",
            "review_date": "2020-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Z has some very creepy moments that pay off pretty well. It's a shame that the ending doesn't wrap up clean as I'd expect from such a good beginning and middle.",
            "review_date": "2020-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's unlike anything you've never seen before from previous horror films, but Z still proves effective thanks to Brandon Christensen's steady hand and a strong central performance from Keegan Connor Tracy",
            "review_date": "2020-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SPOILERS:\n\nThis film was done really well and I enjoyed the energy of it and acting. As far as scary movies go this is all good family fun.\n\nI think that the plot is not entirely inventive. It follows the same plot as every horror movie put out by the industry in the past decade.\n\nHappy family situation. Child discovers a ghost/demon. Mother becomes concerned, starts seeing things and tries to convince the dad to no avail. Then the ghost/demon hurts the dad. They call the family priest/therapist/psychologist. Then things get crazy and the priest/therapist/ psychologist is able to intervene. At the end the ghost/demon is still there. \n\nI've seen so many movies with this exact plot. But I'm not going to say this is a bad film for this reason. It is still entertaining. And I would still recommend this over many other ones that follow the same plot.",
            "review_date": "2020-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only scary thing about this movie was the husbands complete and utter inability to be a good parent and a good husband. Also, why is the drawing of Z so much scarrier than what Z actually looks like? The drawings looks demonic. Z looks like a grey Loki on meth.",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I’ve been waiting a while for a good horror movie to come out. Im still waiting.... I guess I did not have a special effects budget so all the action is off camera ",
            "review_date": "2020-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A low budget predictable and boring shit stain",
            "review_date": "2020-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a horror film, this feels natural. The tension and, well, nature -- are put right into place.\n7.3/10",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly recommended. Although it's material is the ever-familiar imaginary friend horror trope, it does offer an original interpretation that will keep you hooked until the end.",
            "review_date": "2020-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although a few plot holes were unresolved, Z is the best horror film of 2020 so far. It's got exactly the kind of mood, feel and atmosphere that would send chills down your spine and jump scares that are guaranteed to send you jumping off your seat. The plot is very interesting, the acting is great and it's sure to please genre fans.",
            "review_date": "2020-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie was sponsored by the National Dairy Farmers. Never seen so much milk consumed! Milk with spaghetti??? ",
            "review_date": "2020-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! One of the most scariest movies that I've ever watched. Really creepy and a lot of jump scares. You've been warned !",
            "review_date": "2020-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well done. Darker than expected, but good acting, cinematography, and direction.",
            "review_date": "2020-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was okay - creepy at some bits. Overall not scary.",
            "review_date": "2020-05-09",
            "source": "rt",
            "lang": "en"
        }
    ]
}