{
    "rating": 9.5,
    "release_date": "1943-01-23",
    "num_reviews": 409,
    "genres": [
        "Drama"
    ],
    "summary": "Rick Blaine (Humphrey Bogart), who owns a nightclub in Casablanca, discovers his old flame Ilsa (Ingrid Bergman) is in town with her husband, Victor Laszlo (Paul Henreid). Laszlo is a famed rebel, and with Germans on his tail, Ilsa knows Rick can help them get out of the country.",
    "reviews": [
        {
            "content": "A classic!  Any film buff must see it.",
            "review_date": "2023-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "--And what about us? --We'll always have Paris",
            "review_date": "2023-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of course, the plot line is complete balderdash and the script had been rejected when originally entitled \"Everybody Goes to Rick's,\" but somehow, the cast and director pulled off a masterpiece.  A few years later Michael Curtiz gave it another try with Bogart, Lorre, and Greenstreet but fell far short in \"Passage to Marsailles.\"  Never mind, 'cuz \"...we'll always have Paris.\"",
            "review_date": "2023-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 01 hour: and 42 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is a good movie, is old but with a trama and nice use of the camera",
            "review_date": "2023-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its ironic that the greatest screenplay ever written for the big screen wasnt written until 24 hours before the scene was to be filmed. Brilliantly acted by classic stars like Humphrey Bogart, Ingred Bergman and Claude Raines, this film is as close to movie perfection as you can get.",
            "review_date": "2023-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A superior film there's no denying.",
            "review_date": "2023-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "when Richard Blaine revealed his true self, I was like, damn, new personality unlocked.\n\nWhile the entire world was suffering from war, it was in Casablanca, a tale of three people who suffered from love. I have never seen a more tragic yet such beautifully told love tory in my entire film watchlist.\n\nFirst of all, this film looks stunning. Each and every shot in this film is placed and lit perfectly. You see everything there is you need to see and something more. I have always loved how older movies used to have that 4:3 aspect ratio and directors had to instruct the production designers and cinematographers to make arrangements in a specific manner so as to get everything that is required in the gorgeous standing shot instead of the current trend of a wide shot. Casablanca is no different, everything is in camera and the placement of each and every object (even the doors and windows) is perfect. Production Design along with Direction and Cinematography at its peak.\n\nNow, the story, it is absolutely beautiful. At present, we've seen many love stories that have been told in the backdrop of a war but none of them have quite left an impact on me like this one did. The characters are all compelling and each one of them provide something to move the plot forward. The story essentially follows the tale of Richard Blaine who is an exquisite Saloon-Owner in the territory of Casablanca when he encounters a man called Victor Laszlo and his wife Ilsa Lund who previously had an affair with Richard and is now on the run from the Germans and wants to get to America to help the refugees trapped in a concentration camp in France. The story of Richard evolving into a man he swore never to become due to past incidents is what makes him literally me.\n\nThe music of this film is just so good to hear. Each and every song is instantly a classic for me and trust me, I will be getting this on vinyl one day, that's a promise. The songs Knock on Wood and As Time Goes By were the standouts for me and you should definitely check them out.\n\nI think, this film has now set a new bar for me. A perspective through which I will be judging future romantic dramas from now on and I don't think many will come closer to this.",
            "review_date": "2023-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What's not to like? It's got everything and a fantastic cast.",
            "review_date": "2023-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional script, acting, score. They don't get any better than this. A must see.",
            "review_date": "2023-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant film. The themes of politics, love, war and refugee crisis transcends. Great performance from all actors especially Ingrid Bergman and terrific score by Max Steiner.",
            "review_date": "2023-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How did this only get 99% on critics rating?  There are few films that can legitimately compete for the title of \"the best film of all time,\" with Citizen Kane, The Godfather, Gone with the Wind, and this film, Casablanca, invariably in the top spots.  One could argue, that the cinematography was not up to the standards of the other three, but it undoubtably has the best screenplay in most memorable lines of any of them.  Also, unlike Citizen Kane which most modern audiences watch with more admiration than actual enjoyment, Casablanca holds up amazingly well for pure entertainment despite the decades.  If it has any weaknesses, it is only that its themes became so famous that they might seem like cliché's modern audiences, but it is important to remember that they started here.",
            "review_date": "2023-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"They Don't Make 'Em Like They Used To\"\n\nArguably the quintessential Dramatic romance film to ever come out of Hollywood, Casablanca manages to excel in every way. Its well-written story, it's likeable and realistic characters, and it's overall message of love and sacrifice for the greater good. All of this is led by sublime performances from two all-time greats in Humphrey Bogart and Ingrid Bergman. My goodness, what a movie.",
            "review_date": "2023-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca is one of Hollywoods most iconic movies and for a good reason. The movie is set in WWII in Marrocco, Casablanca, however Casablanca is not yet occupied by the Germans. The movie has some gorgeous black and white sets and cinematography, with most of the movie taking place at this one bar. The performances in Casablanca are solid, but certainly not best of all time material. The story is quite simple, however very effective. The ending of Casablanca is fantastic and with a runtime that goes by, the movie is pretty fantastic!",
            "review_date": "2023-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bogart and Bergman at there best. A true classic that gets better with every watch.",
            "review_date": "2023-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About as perfect a romance as possible. Incredible quick-witted dialogue, great acting of course, and in the middle of it all; an emotional roller-coaster of romantic potential. 'Heart-breaking' doesn't even begin to cover it. One of the best films of all time.",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched the New Cleaned 80th anniversary at my local Odeon and it's still wonderful and a strong reminder why we should cancel Nazis from the public platforms as the scene where the Nazi thugs are drowned out by the tolerant people who want freedom from these bullies. Also some of the best ironic humour with punchy dialogue and some fantastic use of shadow and silhouette and the close to tears acting makes me wish modern movies would use black and white more.",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First time watching in 2022, it was a good movie especially considering when it was released. However, I don’t really see all the greatness, perhaps for it’s time yes. Still a solid watch at least once.",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films ever made. I have seen this movie at least 30 times and could watch it 30 more times. A classic with a great cast, a great plot, and the perfect ending. Must see!",
            "review_date": "2022-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best for a reason. Still enjoy watching this annually after more than 2 decades.",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great movie with great acting!",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boy howdy, what a gem. I finally watched this film after years of being told how good it was - which naturally puts a contrarian spirit such as mine on edge. Within minutes, I was taken in by the clear, engrossing story, the shadowy, evocative images, and the complex, charming characters portrayed so richly by the talented cast. It's remarkable for a movie to squeeze a great romance in with a political melodrama, in a deft and timely way for what would have been its contemporary audiences. They don't make them like this anymore; even for fans of more recently released movies, this one is easy and delightful to love.",
            "review_date": "2022-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the best example of Hollywood's golden age. A group of talented people essentially winging it using only their artistry. Never fails to grip me in the same way when I first saw it",
            "review_date": "2022-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved how fast the movie felt, as well as the ending. Some conversations were a little hard to understand because of how quick the movie was, but the plot line was great. The movie leaves the audience with a small heartbreak at the end, but that only means Humphrey Bogart and Ingrid Bergman did a fantastic job.",
            "review_date": "2022-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Personally, I am not a fan of romantic movie. I always find them to be so cheesy and unrealistic but Casablanca was different. The drama was so relatable and acting was top notch. I was kept on edge the entire time and was always surprised by each plot twist.",
            "review_date": "2022-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think Pauline Kael's review of this is utter nonsense. It's a classic. Thankfully it's still in black and white and not enhanced to fake colour.  It's made without sophisticated digital effects, on a much lower budget than modern films.  And the acting carries it. I did not find it sentimental on my third viewing. It is not full of violence but has suspense. The scenarios in Rick's Cafe are believable and bring me back to another world.",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somehow, I didn't see this film listed on Rotten Tomatoes top 100 films of all time. Every time I watch this movie, I hear or see something I didn't before. It is a classic in the truest sense of the word with some of the most memorable dialogue ever. Brilliantly written screen play, beautifully acted and a message that still resonates with today's audience--loving someone or something takes sacrifice and that we sometimes have to put aside our personal happiness for the greater good. It also has one of the top-notch final lines of any film as Louie and Rick walk off into the fog; \"Louis, this looks like the beginning of a beautiful friendship.\" It still takes my breath away no matter how many times I watch it.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Basically an all-time classic with fantastic actors and performances. Even though for today's generations it might be a one-watch, it is still an essential piece of the previous century's culture.",
            "review_date": "2022-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All time classic.  Still re-watchable in 2022.",
            "review_date": "2022-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "True cinema...Welcome to Rick's Cafe!",
            "review_date": "2022-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is, of course, a real film classic. I thought the music and the somewhat suave script stood out for me. It has quite a wistful feel about it. It features some classic lines of dialogue 'of all the bars in all the towns in the world, she walks into mine' etc. Its quite a laidback, easy watch. A good example of a classic black and white film, I would recommend it, yes.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Innessential movie. The love story between Rick and Ilsa is, of course, good; outside of that, any other things that happen in the film weren't interesting. The worst thing about this movie is listening to Bogart's annoying voice for 1 hour and 40 minutes.",
            "review_date": "2022-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eighty years after its release, Casablanca proves itself to be a timeless classic of romance, deception and loyalty.  Ignore the horrible accents.  Ignore the abundance of unnecessary characters and implausible plot twists.  And ignore the unspoken fact that Humphrey Bogart plays the same character in all of his films.  Casablanca is a remarkable love story set to the backdrop of World War 2, a world where allegiances are constantly tested and loyalties are not always what you expect them to be.  It is a film filled with iconic scenes and highly quotable dialogue, all of which is trumped by one of the most remarkable and memorable final scenes in the history of cinema.  While it isn't perfect, it's pretty darn close.",
            "review_date": "2022-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An all-time classic that I could appreciate for the most part. It holds up from the 1940s fairly well.",
            "review_date": "2022-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this film and you have good taste in film if this is your favourite film.",
            "review_date": "2022-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was interesting, kept you guessing what was going to happen.",
            "review_date": "2022-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Political intrigue combined with romance that occurs during Nazi reign in Europe and Northern Africa. Bogart's Rick Blaine has to make a life and death decision and needs a character change to make the right decision. That's what makes the film work well, his inner struggle. Bergman's Ilsa Lund struggles between her love of Blaine and her presumed dead husband, Victor Laszlo (Henreid) being alive. Laszlo recognizes his wife's divided heart, but puts it aside to save her, and himself, from the Nazis'\nWell acted, for the time, considering ADR. \n\nPeople also knew what was right and wrong in this film, that America is a beacon of freedom those running from the Nazis wanted to escape too.",
            "review_date": "2022-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely one of the best movies ever made!",
            "review_date": "2022-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a libertarian, this film demonstrates very well the victory of a businessman (Rick) against a politician (the nazi guy) in such a horrifying time for freedom and prosperity.",
            "review_date": "2022-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Movie of all time...",
            "review_date": "2022-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome. Plot, actors, photography, music, ending. Everything. Maximum freshness.",
            "review_date": "2022-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies ever made. Quite rare do you find a movie that engulfs you in its emotion , the characters and what they are going through. From the charismatic Captain Loui to the Heartbroken Rick Blaine , the movie is filled with lovable and memorable characters that an audience would easily fall in love with. The script is Great and so are the performances that go along with it. We NEED more of this kind of Hollywood.",
            "review_date": "2022-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching Casablanca in 2022 to see what all the fuss is about is perhaps unfair to the film because of the years of technological advancement in filmmaking and change in society. Yet a good movie lives on regardless and unfortunately, Casablanca might be a classic but it's hardly one of the best films ever made. The story and acting were so melodramatic, but the mystery was still captivating for a first time watcher.",
            "review_date": "2022-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sweeping love story full of romance, intrigue, action, and a swift commentary on the US' role in World War 2, it's a career highlight for everyone involved and an undisputed Hollywood masterpiece.",
            "review_date": "2022-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is not a single mistake I can find in this movie. It is so perfect. Humphrey Bogart's performance is legendary. It is an absolute masterclass in film and filmmaking. 5/5.",
            "review_date": "2022-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ICONIC. A cinematic masterpiece. This movie has aged beautifully since its release and just gets better every time you watch it. It is such a timeless classic. The whole plot of the movie is amazing and the acting is so deserving of those Oscars. The final scene is so iconic as well, there are no words to describe how good that scene is. This movie shows the very best that old Hollywood had to offer and will continue to live on. This movie is viewed as a significant movie in cinematic history and has been an influence on other big Hollywood films. This movie is a must-see in my opinion and all it's praise is well deserved. 5/5 stars.",
            "review_date": "2022-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca is a brilliant movie that lives up to its extraordinary reputation it's gotten over 80 years. From its atmospheric music, to its delicate acting, to its incredibly well-written dialogue, this movie is a prime example of cinematic art. From propaganda standpoint, this movie must've had a profound impact on the American audience who lived through the early 40s as the United States entered the European theater of the 2nd world war.",
            "review_date": "2022-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rick: \"I should remind you this gun is pointed at your heart.\" Capt Louis: \"That is my least vulnerable spot.\"",
            "review_date": "2022-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie.  Never thought I would've liked an old B/W film but this one is a much watch.",
            "review_date": "2022-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie had a decently compelling story and good scenes, and the actress who played Ilsa had definite talent. I liked the ending too, however I found it annoying that Humphrey Bogart said his famous line more times than necessary in my opinion. He should've said it twice instead of like 3-4 times which I started to roll my eyes at. Aside from a couple of pacing issues too, it was not bad! Slightly overrated though.",
            "review_date": "2022-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "JUST A HEADS-UP, THIS RUMINATION IS ENTIRELY IN LIGHT OF THE FINALE. HERE GOES..\n\n\"We'll always have Paris. We didn't have-- We'd lost it until you came to Casablanca. We got it back last night.\"\n\nWhohohoa! This is how you do a plot twist. Well done! So did Renault have a quick change of heart? Change of loyalties? 'Cause the fascist Nazi\nMajor Strasser turned to be insufferable for him?.. Renault couldn't have been part of it.. 'cause he talked to Rick about their ruse prior, but as they were walking at the last scene it did occur to me that Renault was also in it. Hmmm..\n\nNo less interesting as the last pleasantly bemusing scene, I think Rick rediscovered his virtuous, selfless, humane character (contrary to what the rest of the film showed us — his indifferent, callous, misanthropic self) through his reconciled love with Ilsa and their last special yet unintended lovers' rendezvous.\n\nRick was pretty much ready to risk his life for a much noble, largely encompassing cause.\n\nAs Rick spoke, verbatim,\n\"Ilsa, I'm no good at being noble, but it doesn't take much to see that the problems of three little people don't amount to a hill of beans in this crazy world. Someday you'll understand that.\"\n\nWow.. I did call him saving Laszlo his flight with Ilsa, instead, but I did not guess they would do it even much better! Well done. 👏🏻\n\nOn second fucking thought‼️ Oh never mind! 😆 I was going to say Renault conspired with Rick to send Laszlo and Ilsa off but I saw the part when Renault told him (making me remember) he was going to arrest Rick. Whoa.. this movie is thought-provoking.",
            "review_date": "2022-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca is just an extraordinary film, if I had to describe it in one word, it would have to be perfection! I honestly don't care that it's an old film, I personally think that's not a convincing enough excuse for hating a film as wonderful as this , because you are seriously missing out, if you haven't seen it. The cinematography is just fantastic, with clever brooding camera-work. The music by Max Steiner is outstanding, from the sweeping haunting love theme As Time Goes By, to the excerpts of the french national anthem. The scene where everyone starts singing in the café was extraordinary and one of the many highlights of the film. The screenplay is unquestionably one of the finest in the history of cinema, right up there with Shawshank Redemption and All About Eve, containing great memorable lines such as \"seems as though Destiny is at hand\". The performances were superlative, Humphrey Bogart giving one of cinema's greatest lead performances as the \"cynical sentimentalist\" Rick Blain. Also superb are Ingrid Bergman who positively lights up the screen as Ilsa, the young woman who breaks his heart, Paul Henreid as the fugitive husband, and Claude Rains as Captain Renault. The plot is a little complicated, but I couldn't help being impressed with the performances and the screenplay. Not to mention a timeless love story that I don't think has ever been topped. Overall, a masterpiece, that quite rightly received an academy award for best picture. 10/10 Bethany Cox",
            "review_date": "2022-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic in every respect. Stellar performances at every level.",
            "review_date": "2022-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest film of all time.",
            "review_date": "2022-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca: 4/5\n\nI'm seriously impressed with this film for being so old! It's got a relatable yet powerful story, great performances from (most of) the cast, and some incredible music. I'm also impressed at how well the humor works in this movie; it's dry but really funny and it lands well despite the bleak circumstances.\n\nA few technical complaints: the accents are all over the place in this movie, ranging from pretty good to wildly over-the-top, but Ingrid Bergman's accent is particularly terrible and inconsistent to the point of distraction. Also, every time Sam is \"playing\" the piano he's clearly not actually playing 🤷\n\nOnto this movie's biggest flaw, which is how quickly it expects me to forget about all the seriously fucked up shit that Captain Renault did. He was literally raping desperate women in exchange for travel documents!! Nick clearly knows about this and doesn't approve as we see him rig the casino to spare one woman from this fate, yet I'm supposed to believe just a few days later they're walking off together to \"the start of a beautiful friendship\"? Yeah no fuck that and fuck Captain Renault.\n\nBut anyway, it's a good movie for 1942, and most of it has aged pretty well. The character development is valid and earned and makes for a very engaging watch.",
            "review_date": "2022-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great film. The tense environment of the city coupled with the \"eat, drink, and be merry\" vibe of the bar is just right, and all the characters feel like complete people. It captures the tragedy of war on a personal and a societal level, as well as how bad times can bring out the best and worst in people.",
            "review_date": "2022-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my great pleasures of my later life has been introducing this wonderful, marvelous film to young people yet to experience its magic\nI always preface the showing with the adage: you are extremely fortunate, because you are about to watch Casablanca for the first time. It's like first love all over again.",
            "review_date": "2022-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "True cinema...Welcome to Rick's Cafe!",
            "review_date": "2022-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Classic in all seances of the word",
            "review_date": "2022-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie about (no spoilers) the way our selfishness and our selflessness interact with each other.  The plot probably resonated particularly well with those who watched it when it originally came out, for whom this must have been a must-see. But it's still a good plot today. (The fact that the movie is black-and-white did not detract from the experience.) Part of what makes the plot appealing is that there is no arguably no clear protagonist, just a cast of characters, each with an important backstory, each acting in their own self-interest. Rather than try to teach a lesson, this movie commands attention by creating a believable plot, and believable characters, and then shining a mirror at our own human nature. You are forced to ask yourself, \"What would I have felt? What would I have done?\" Because the characters act in believable ways, the movie is able to give its audience a feel-good ending that is satisfying but not trite, and that is why this movie is a classic.  It's an emotional movie, and many people are reacting exclusively to that. Is it over-rated? Yes. But even those who don't love it will appreciate it.",
            "review_date": "2022-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Please... anything less than five stars for this masterpiece is just dumb. There are very few certain things in this world, but Casablanca being one of the greatest movies ever made is one of them.",
            "review_date": "2022-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bogart is excellent in this movie .entertaining . Romantic thriller",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a movie this! In my opinion this is as close as it gets to a flawless movie. Definetely planning to re-watch soon!",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is hard to put into words how spectacular \"Casablanca\" is, but I can say, at the very least, that this film is Hollywood's definitive love story that defined cinema.",
            "review_date": "2022-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "50% rating. Good movie, but I think it's a little overrated. Not really my type of film I suppose. Not something I'm eager to re-watch.",
            "review_date": "2022-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a classic, but i'm shocked at how overrated it is.",
            "review_date": "2022-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My all time favorite movie.  It doesn't get any better than this.  Watch and re-watch.  It gets better with every viewing.  The peak of the golden age, or any age, of movie making",
            "review_date": "2021-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has everything. Everyone should see it. Love, betrayal, sacrifice, putting something before yourself.",
            "review_date": "2021-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is likely the most famous movie of all time and for good reason.  Certainly the most quoted, and frequently cited as an all time favorite, Casablanca won Best Picture, Director, and Writer awards at the Oscars.  the definitive rebuttal to notions of the author in film, the romantic drama put together in pieces by many different sources, with script pages completed just moments before the cameras rolled.  The performances by Bogart and Bergman are so subtle and complex because the actors themselves had no idea how it was going to end.  \n\nAlmost every frame of the movie is an icon, and it has been endlessly copied and parodied.",
            "review_date": "2021-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely the best screenplay ever written. So many snappy, quotable lines, by performers at the top of their game. This includes Conrad Veidt, the great German silent film actor, the leering Sidney Greenstreet, Peter Lorre, Calude Rains, Dooley Wilson, Paul Henreid, and the incomparable Ingrid Bergman and Humphrey Bogart. The one movie I watch every time it is on, and still pick up on subtleties.",
            "review_date": "2021-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love old Movies and at the height of the war this one shows what people were desperate to do to escape. The love and compassion was amazing in this Movie. Humphrey Bogart is at his best in this film.",
            "review_date": "2021-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the best romantic movie ever made, the four lead characters are very well rounded and enjoyable to watch. I highly recommend this movie to anyone with a love of historical or romantic stories.",
            "review_date": "2021-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those movies you watch because you feel like you have to not because you enjoy it, it is technically well made but I'm not planning to ever see it again",
            "review_date": "2021-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this film even though my shoes were dirty ",
            "review_date": "2021-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I rate this as the Greatest movie all time",
            "review_date": "2021-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the 10 best movies ever made.",
            "review_date": "2021-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As time goes by, you appreciate Casablanca more and more.\nAs time goes by, those iconic quotes may be remembered more and more in your brain.\nAs time goes by, you may notice the film is filled with extreme cynical and genuine humor, being hilarious at times.\nAs time goes by, you may realize the love plot line is only 25% of the film and there's more messages given beyond that.\nAs time goes by, you may find yourself revisiting this classic.\nAs time goes by, you may shed a tear during these multiple viewings.\nAs time goes by, Casablanca is a masterpiece who does deserve the title \"masterpiece\" it's already given.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a deeply philosophical movie. Just a damn good piece of cinema. The story keeps moving even though most of the movie occurs in Rick's bar. The music, costumes, and sets in this movie are very well done and make you believe it was filmed in Casablanca.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched it for the third time. Such a good story on true love with a nice political look at the background... Must watch!",
            "review_date": "2021-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has been stolen from a BILLION times over but it’s cool to finally see where this time of plot line originated from. (Which generic plotline you ask? I’ll leave that a mystery) Committed acting with characters that make believable choices. Overall highly recommend, especially to build film knowledge.",
            "review_date": "2021-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Put it this way, if you really need or want an explanation for this one, you probably need to sit down on Monday afternoon and just watch it. I'll leave it at that.",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic in every sense of the word.",
            "review_date": "2021-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Damned good movie. It has stood the test of time, and continues to be well regarded because it is made very very well.",
            "review_date": "2021-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the all time classic movies.  It has been referenced in so many other shows and mediums through out the decades since it has come out.  Truly a great movie.",
            "review_date": "2021-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An essential watch for any and all enjoyers of cinema. The prime piece of romance that does not grow old.",
            "review_date": "2021-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a straight-up classic movie.",
            "review_date": "2021-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When all else fails, we have Casablanca, a movie for the generations.",
            "review_date": "2021-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm gonna be totally honest. This movie is great, but I couldn't tell, with a gun to my head, who she really loved more.",
            "review_date": "2021-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All time great movie. Wonder why nobody has tried to remake it in over seven decades",
            "review_date": "2021-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Affirms so much about the human species that is noble. Terrific visual storytelling combines with a tight-as-a-drum script full of endearing characters and classic presentational film acting to create entertainment that still satisfies.",
            "review_date": "2021-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good editing of scenes and cinematography, but \"Casablanca\" hasn't aged very well because of the tiring script and the acting model that reminds soap operas from the 40s",
            "review_date": "2021-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THE HYPOCRISY OF CASABLANCA\n\nI saw Casablanca in January 2021 … again. I gave it another chance to WOW me. And once again, all it did was piss me off. Here's why:\n\nVictor Laszlo accepted Rick Blaine's bullshit story, that Ilsa Lund no longer loved him, that it was in the past. But it was a worse lie than any told by either Victor or Sam. Which Louis pointed out. Yet, say he swallowed it. There were other lies that Victor had swallowed and was willing to continue to swallow. And he's just as willing to force Ilsa into being his partner in a cacophony of moral crimes.\n\nLook at Ilsa's body language, turning away from Victor's milquetoast kisses. He never kisses Ilsa's mouth, only brushes her cheek or forehead. Ilsa, in turn, saves all her passion for Rick. They embrace intimately and repeatedly declare their love for each other. And while Victor declares his love for Ilsa, what is her response? A sad and tragic smile. She promises to keep his secret. An intimate tease or a required indulgence?\n\nVictor knew or should have known better. But he was willing to keep her as his emotional support animal anyway, despite knowing — sure as shit — that he was separating Ilsa from her true love and separating Rick from his. I wonder if he cared that he was sentencing Ilsa to a life of faked — and minimal — affection, of faked enjoyment in their unholy marriage bed.\n\nMaybe her lack of passion didn't bother him so long as he had her devoted admiration, so long as he had that eye candy on his arm? She was the human version of a Birkin. Hell, she didn't even take his surname: She was Ilsa Lund, not Ilsa Laszlo!\n\nPerhaps Victor wasn't the passionate type. We know that Ilsa and Rick sure were. But VICTOR DIDNT CARE. He was sentencing his young wife to a life of pretense and inner turmoil, but he didn't care. What does that say about HIM?\n\nI'll tell what it says: Victor Laszlo is a narcissist intent on saving the world, and he wants to dress the part. Ilsa is the equivalent of the stuffed animal he showers with baby kisses and unreturned embraces during sex. He might as well be fucking a blow-up doll.\n\nOr maybe Ilsa successfully fakes her orgasms, or maybe being able to excite HIM is all he needs from her. In which case, Ilsa is prostituting herself upon the altar of a noble narcissist on a mission from … who or what? God?\n\nI remember hearing God only twice: once when Rick saves an underage girl from an act of prostitution, and then when he sentences another young woman to a life of prostitution. Both times, it was in the form of \"God bless you, Rick.\"\n\nI REALLY hate Casablanca now, more than ever! I hate how admired it is, how respected in the cinematic pantheon. I'm equally disgusted by the movie and by the people who give it props.\n\nNext on my list — It's a Wonderful Life. Or is it.",
            "review_date": "2021-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "May of 2021, watched this for the first time. It's absolutely fantastic, has aged amazingly well, fantastic movie all around.",
            "review_date": "2021-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a classic that you can never say no to. It's perfect.",
            "review_date": "2021-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's in my all-time top ten, a must-see classic and simply stunning!",
            "review_date": "2021-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most memorable classics of all time, a masterpice for everybody.",
            "review_date": "2021-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After what, 60+ years this a seriously fresh movie. It has it all: screenplay. Great one liners, A fantastic cast. Camera. And the story itself it not too far fetched. Casablanca is basically about two themes. Lost love and refuges struggling to make it to a better world. So to all the kids out there, watch this timeless classic. You sure would enjoy.",
            "review_date": "2021-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest film of all time. Timeless.",
            "review_date": "2021-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The prevailing opinion I had once this movie was over was that I'm very glad to have seen it. It came at the perfect time in my movie viewing journey -- if I'd watched it too soon I wouldn't have appreciated it as much as I wouldn't have dozens of mediocre movies to compare it to, and if I'd waited too much longer it would've felt like a lapse in judgment. A lot of things surprised me about the viewing experience as I didn't read about the movie before diving in, most notably that Bogart wasn't as tremendously handsome as I expected having known he sat at the very top of AFI's 50 Greatest Screen Legends of the Golden Age. It was fun picking out the lines I'd heard before in passing as they'd been a part of the zeitgeist ever since, and the movie was as well-made as I expected it to be with its perfect balance of themes. It seems likely that the movie's permanent place among the all-time greats owes at least a bit to its prescient anti-Nazi stance right in the middle of WWII as I'm sure it really hit the spot for viewers when it was first released, but even today I find nothing to really criticize. I didn't find myself completely swept away by the movie, but it's still extremely good. Kudos!",
            "review_date": "2021-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Humphrey Bogart and Ingrid Bergman at their best. In what may be one of the best films about romance, war and betrayal. As Time Goes By Casablanca only gets better.",
            "review_date": "2021-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few classic romance movies you can with good conscience still watch today.",
            "review_date": "2021-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cheerfully marvelous 1940’s classic gem and treasure to own!!!",
            "review_date": "2021-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "everyone just pretends to like this movie for indie white boy points",
            "review_date": "2021-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s a good movie. I’m surprised that people think so highly of it. It’s nice, but not great.",
            "review_date": "2021-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bogart and Bergman deliver stellar preformaces made possible by a smart script that takes us on a suspenseful ride to one of the best ending scenes ever made. A masterfully crafted film deserving of it's Classic status.",
            "review_date": "2021-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Part romance, part dramatic thriller- Casablanca is a fantastic piece of storytelling. Set in the midst of WWII, this tale of sacrifice, love, resentment and intrigue really stands out. The pace is extremely efficient/tight (especially for a film this old) and the dialogue snaps. You can just watch it as a classic love story, or enjoy it even further with rewatches as the subtext becomes apparent. Rick is a sort of metaphor for the US on the eve of entering the war, made more obvious by the film being set in December of 1941. Should Rick pursue his own selfish, immediate interests? Or should he become part of a greater cause, and sacrifice his own desires to help defeat fascism? He never sticks his neck out for anyone- or at least so he claims. By the end he has a great character arc as we discover the real Rick isn't the heartless cynic he tries to portray himself as. Most people my age find it easy to write off films of this era as dated or boring. But Casablanca really has aged amazingly well and makes for an highly entertaining watch- whether it's in 1943 or 2021.",
            "review_date": "2021-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I definitely see this as an iconic movie that people still quote today. I found the plot slow, but that's pretty normal for the time. The plot is a little difficult to follow, so don't zone out. I found it odd that it's a WW2 period piece where characters seem to talk a lot about concentration camps at a time in the war when nobody outside of Germany would have known about them. Outside that. I think everyone should watch this movie once. It was interesting and worth it just for the ending. :)",
            "review_date": "2021-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated. Slow and boring",
            "review_date": "2021-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice story that tells us that real love can exist even during war times. A classic film that you definitely must see.",
            "review_date": "2021-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film that masterfully weaves multiple storylines into a seamless tapestry. Excellent performances punctuate this fun film. Absolutely worth your time and seems fresh even though it's 80 years old.",
            "review_date": "2021-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How could anyone who has at least a half a romantic Heart...not Love this movie",
            "review_date": "2021-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true masterpiece of Hollywood cinema has perfection in all departments putting together a heartfelt and moving melodrama of its time and yet has become timeless work of cinematic art.",
            "review_date": "2021-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies of all time. Quite possibly the most enjoyable film of all time. Can't be beat.",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Casablanca\" is a wonderful movie.  For reference, I just watched it for the first time ever in 2021.  \"Casablanca\" is a story of convictions, romance, and lost love.  Right from the beginning it throws so much at you that it is hard to keep up, and the story goes in so many unexpected directions.  There are a ton of characters, and yet somehow, every one of them, with the exception of the Nazis, won me over.  This movie is super heavy on dialog, but unlike modern cinema where characters talk just to fill time, the dialog in \"Casablanca\" feels like it is all in support of the plot, which forces you to hang on every word or else you will get lost. Anyone with a tolerance of full framed black and white should be able to take something enjoyable away from this movie.  I give it an A - Make a point to go see this movie.",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is probably the greatest film of all time. It has undoubtedly stood the test of time, and it is still captivating to an audience nearly a century later.",
            "review_date": "2021-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"TAKES MY BREATH AWAY\" LOVE FILMS\nby Timothy J. Verret\n\nI'm as drawn to love films as a beautiful and majestic horse is drawn to water. I create so much about and from the notion of love that it sometimes is hard for me to take a decent, deep breath. Here are 10 (actually 11) films about love (or the lack thereof) that \"take my breath away\" and heal my still-sometimes-very-broken heart (BOTH!):\n\n1. SHAKESPEARE IN LOVE (1998):\nThis would indeed be my all-time favorite love film because it's got Shakespeare and it's got that message: \"Love is the ONLY inspiration.\" This film is inspired by a great and awe-inspiring love for acting, writing, directing, and how passion engages all of these things in one love film. Even if this film was not an ode to why Shakespeare wrote sonnets in the first place, the scene where Viola is onstage in a staged production of Shakespeare's ROMEO AND JULIET and William is lovingly looking at her from the wings is more than enough of a reason why I adore this love film. Viola loves William, William loves Viola, and the music takes us away to just this one moment of two looks and two smiles all looked and smiled in the name of a beautiful, all-encompassing love. That scene alone \"takes my breath way\" every time I see it. Even though this film is #10 on my all-time favorite films' list, it is solidly #1 on my all-time favorite love films' list (I guess you could say, \"so the last shall be first, and the first shall be last\" [Matthew 20:16]). 😉\n\n2. SCENES FROM A MARRIAGE (1973):\nSwedish director Ingmar Bergman is not known for gushy and silly love films, but this film IS a very serious love film because Bergman gives us both the glory and grime of a marriage dissolving. In true and typical Bergman fashion, each scene of this film is a very serious \"take my breath away,\" because the truth and turmoil at the heart of this marriage ending are about as real as my hand in front of my face. Liv Ullmann and Erland Josephson as Marianne and Johan give towering performances. I will never forget the scene where Marianne and Johan go to the lawyer's office to sign the divorce papers and literally get into a fist fight. After the fight (and the marriage) is over, they both with their tattered hair and hearts sign the divorce papers. This film is as stunning as it is sacrificial. Marriage IS sacrifice and when that's not there, stunning is any marriage's dissolvement. I probably could have listed a handful of Ingmar Bergman films that explore the theme of this kind of intense love, but I have to keep this list as brief as possible.😉\n\n3. MARRIAGE STORY (2019):\nVery much like SCENES FROM A MARRIAGE, this film is haunting and often horribly uneasy to sit through. Scarlett Johansson as Nicole and Adam Driver as Charlie give exceptionally riveting performances as a married couple with way too big egos (she is an actress and he is a theatre director and if that's not \"way too big egos,\" I don't know what is). I will never forget the scene where Nicole goes to Charlie's apartment and they are in the throws of so much anger and so much hurt that the walls of Charlie's apartment are about to come down. Johansson's Nicole delivers to Driver's Charlie the line that is THE line where love hoped to save this marriage and love can't save this marriage intersect, \"You're so merged with your own selfishness, you don't even identify it as selfishness anymore!\" That line \"took my breath away\" because I totally identified with it. A marriage on its way to a divorce is all about selfishness unidentified anymore. The proclaimed egos of both partners \"win out\" and when ego \"wins out,\" everything is \"lost in\" a marriage war of two \"way too big egos.\"\n\n4. THE DANISH GIRL (2015):\nIt's so cool that this film is #4 on this list, as #4 is my spiritual number. It's also cool that this film is #4 on my all-time favorite films' list, as well. The story of Gerda and Einar (Lily) Wegener is what love films should always be about: The sacrifice one partner needs to make for a marriage to survive (often times in a marriage, both partners have to make sacrifices). Gerda makes the ultimate sacrifice by accepting that her husband, Einar, believes he is a woman and wants to have an operation to become Lily, the woman he always was on the inside. Anyone else that I can think of in Gerda's position would have said in response to this, \"no way, no how….this marriage is OVER!\" Gerda loves Einar so much that she is willing to do just about anything (and she does) to keep their love alive. Alicia Vikander (Oscar winner for Best Supporting Actress) is an absolute and complete revelation in her performance as Gerda, and Eddie Redmayne completely and totally seals the deal in his performance in this film to make him my all-time favorite actor next to Joaquin Phoenix. I swear I could go on and on about how this film \"takes my breath away\" at every twist and turn where love is concerned but, once again, I'm needing to be brief here.😉\n\n5. YENTL (1983):\nVery similar to THE DANISH GIRL, this film is not your conventional love film. It's about a woman who loves this man who thinks a woman is a man, this man who loves another woman who is also a woman but since he can't have this other woman, the man asks a woman to marry this other woman so he can be close to this other woman, and a woman who this man thinks is a man marries this other woman, and if none of that \"takes your breath away,\" I'm not sure what ever would! This film \"takes my breath away\" because it's simply about the lengths and heights and depths we find ourselves reaching for in the throes (or thrown) of love. And because I am a huge Barbra Streisand fan and this is Barbra's best film EVER, I can't think of any other love film that pleases and excites me more than this one. And never mind that it is mainly because of Barbra Streisand and my love for her that helped me to believe that I could ever be someone someday who could love someone someday. Now, that \"takes my breath away.\"\n\n6. WHO'S AFRAID OF VIRGINIA WOOLF? (1966):\nWhile most in a million years would never call this film a \"love film,\" I do because it's a film about the absence of love in a marriage, the absence that is SO common in a lot of marriages, and an absence so penetrable that the married couple in this film actually make up that they have a child to keep the marriage bearable. Edward Albee's play and Mike Nichols' film adaptation are what I love most about stories where love has flown the coop (if it was ever in the coop in the first place), i.e., the dissection and probing of the insides of people who are losing their identity because love has become nonexistent while brutality and mean-spiritedness are what's left to exist. Elizabeth Taylor, known for her striking beauty, goes from \"riches to rags\" in her physical beauty and gives us an \"ugly\" Martha, a force of nature who is as forceful as she is vulnerable. Taylor, Best Actress Oscar winner) gives what I consider the very best female performance ever captured on film. Richard Burton as George and George Segal as Nick are also excellent, but it's the other female performance of Sandy Dennis as Honey (Best Supporting Actress Oscar winner) that makes this love film truly one that \"takes my breath away\" every time I see it….and I've seen it a lot!😉\n\n7. TESS (1980):\nIf there can be any love film that is truly lovely to look it, it would be this film. Based on Thomas Hardy's classic novel of the same name, Roman Polanski directed this film that makes the novel come breathtakingly and beautifully alive. This film \"takes my breath away\" not just because it's pretty to look at but also because it is rapturous and daring to expose seduction between a man and a woman as actually rape, and how that one act of domination produces shame that stays with the victim. I know that one's shame is to be nailed to The Cross of Jesus but for some, death is the one way, and maybe the only way, to be rid of that shame. Nastassja Kinski as Tess might not be the best actress who ever lived, but Polanksi knew exactly what he was doing by casting her in the title role. Because Kinski was a relative unknown and maybe because Polanski knew she wasn't the greatest actress around, it was precisely these two very things that allowed Kinski to inhabit Tess as bright-eyed innocent, and naïve. A well-known and a great actress would have destroyed these precious traits, so thank God Polanski and Kinski didn't. There's one scene of a closeup of Tess with the brightest yellow sun behind her that to this day, every time I see a sun like that, it \"takes my breath away,\" and I call it, \"the Tess sun.\" LOVE THAT! ❤️\n\n8. THE WAY WE WERE (1973):\nIt certainly makes sense that I would have two Barbra Streisand films on this list but even if I didn't love Streisand, this film would be on it anyway and probably most others' \"love film\" list. It's the ultimate love story of the girl over there and the guy over here and how there and here come together and we are all the better for being present to witness that. The odds are that two beautiful actors like Redford and Streisand couldn't possibly go wrong in a beautiful love film that ends with a closing scene that still \"takes my breath away.\" Streisand's Katie and Redford's Hubbell are looking at each other after having separated when famous Streisand takes that famous hand and famously brushes away that famous hair from Redford's famous face. \"See ya', Katie.\" \"See ya' Hubbell.\" See me balling my eyes out.😥😥\n\n9. CASABLANCA (1942):\nWhile not the film I would have included on my \"take my breath away\" love films' list, I'm including it because it's on the top of the list for two of my favorite people and because any film with an actor or actress with the last name of \"Bergman\" should be on any film list I compile (see #2 for that \"other Bergman\" film). That said, I have seen this film and I remember loving it very much. Many \"love film\" aficionado's are divided into two camps where this film's ending is concerned: One group wants Rick to let Ilsa board that plane to Lisbon with Laszlo for The Resistance, while the other group says, \"C'mon! Rick and Ilsa forever! We're not talking about The Resistance here! We're talking about love!\" This film reminds us that love doesn't always end as victorious as The Resistance, but what we cannot \"resist\" is that we loved in the first place. That is usually enough for any kind of love to take flight.\n\n10. IT HAPPENED ONE NIGHT (1934) and SOMEWHERE IN TIME (1980):\nI admit I was torn between which of these films to include to round out the top 10 \"take my breath away\" love films, until it dawned on me that both films have something very much in common: The element of time when and where love is lost and/or found. IT HAPPENED ONE NIGHT is simple enough to say love can happen one night, whereas SOMEWHERE IN TIME says one night is fine, but true love cannot be contained by the element of time. Love can happen one night, sure, and then more nights can happen after that, but sometimes you have to go \"somewhere in time\" to find that love again. Whether one night or \"somewhere in time,\" love alters us to our very core and we do search time and space to find it, but there are no guarantees that the Jericho Walls (reference to the ending of IT HAPPENED ONE NIGHT) will stay up or come down when love happens in just one night or \"somewhere\" outside of space and time for a lifetime.\n\nNow, I'm not currently in a love relationship (unless you count Jesus) but if I were, my partner would need to have seen AT LEAST one of these films. If not, watching AT LEAST one of these films is essential if any partner who loves me expects to \"take my breath away.\" 😉❤️",
            "review_date": "2021-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible acting and suspense. A beautiful love story.",
            "review_date": "2021-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Believe it or not, just watched Casablanca for the first time.\n\nIconic performances from Bogart & Bergman.\n\nGood romance movie.",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't understand what all the fuss about this movie is. I didn't like it",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful movie amongst a war-period piece. Wonderful acting, nightclub music, plot and story line. I would definitely watch again.",
            "review_date": "2020-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest screenplays of all time - perhaps the most quoted of all time, too. Watching this movie, you breathe the air of a superior realm of cinema. If you have a chance to see this movie and you don't take it, you'll regret it. Maybe not today. Maybe not tomorrow, but soon and for the rest of your life.\nHere's lookin' at you, kid.",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you watch this movie in the context of the time it was made, it would be 5*, especially considering it was the model for so many other romantic movies. However, it does not stand the test of time. Watching it without the lens of history makes it less appealing.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was fortunate to see Casablanca at the Northpoint Theatre in San Francisco as part of the 50th Anniversary presentation.  The movie is a classic in every sense from the cast, direction, soundtrack and screenplay.  I recently re-watched the 70th Anniversary home video over Christmas and it keeps getting better.  While most anyone knows those classic lines, it's a must see to watch the entire movie.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect movie. Beautiful lines to be quoted and the most wonderful love story on screen",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AFI 100 Greatest Films - #2: It is often hard to rate these films with the advantage of hindsight, as it is definitely possible to respect and fully appreciate a film's contribution to culture, even if it would admittedly have less of an effect had it been released today. Casablanca avoids this problem as the rich dialogue with countless memorable lines, dialed in acting, textured scenery, and memorable musical performances all congeal to form what has become the nearly universally agreed upon template used when discussing and comparing the best of American cinema.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This classic never gets old.  A definite must see for any movie buff.",
            "review_date": "2020-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was not really interested in watching Casablanca but forced myself to purely for the film knowledge. For the first hour I felt unconnected to the characters, entertained by the amazing cinematography only. That being said in the last closing scene, the emotions hit me like a ton of bricks and made me care for characters I thought I had no emotions for. One of the best romance movies I have ever seen for sure.",
            "review_date": "2020-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I find myself appreciating Casablanca a lot for its impact on cinema and themes of patriotism. Its story and characters are great as well, but what I feel really makes this movie as beloved as it is are its anti-fascist themes and ideas being released during one of the darkest moments in world history.",
            "review_date": "2020-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest American films. \"You must see before you die\"",
            "review_date": "2020-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring and overrated.",
            "review_date": "2020-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of my favourite films. I didn't expect to like it so much, given the pacing of films now is so different even from when I was a kid, but it's clever and surprisingly funny, as well as having a genuinely interesting plot that you become invested in. The 2 male leads are some of the best jaded cynics in cinema.\n\nThere's a scene about halfway through that is one of my all-time favourites, both in terms of spectacle and of seeing a character making a key plot decision. Also, it's a film made with European talent during World War II — the reason the scene packs some emotional weight is because pretty much everyone in the room is a refugee.\n\nIt's no exaggeration to say that this is one of the best films ever made. You should go watch it, right now.",
            "review_date": "2020-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you love movies and talk to others who share your interest, you have likely heard of \"Casablanca.\" I finally got around to seeing this classic movie and for the most part, I did like it. I don't think I love this movie as much as a lot of people seem to, but I can see why it is an important part of film history. The movie does a great job of creating the setting and the world feels very lived in with minimal sets. My favorite aspect of the movie is the romance and whenever it was focused on that, I really enjoyed the movie. Some of the other storylines didn't fully grab me, but I still think this is a solid movie that has a lot of merits when you look at its influence and iconic nature.",
            "review_date": "2020-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was a very good movie very romantic",
            "review_date": "2020-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very unexpected plot. The actress' performance is so impressive for me.",
            "review_date": "2020-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not much to say here. Classic all around. Classic characters, classic setting, and Most of all classic lines. Once in a lifetime movie. ",
            "review_date": "2020-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have always loved this movie, a great story, great dialogue, and seeing it on the big screen was such a treat.",
            "review_date": "2020-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic movie with a great plot and amazing acting\nSimply a classic",
            "review_date": "2020-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being the newshound, I checked to read what was written from the minority point of view -- the one critic who doesn't give Casablanca a passing grade.\nIt's a review by Martin Scribbs on the Low IQ Canadian website. The snippet from the review only says \"overblown\" and I didn't see it on his list of the 85 movies he has reviewed.\n\nNothing wrong with that, but clicking on the \"full review\" took me to a website written in Arabic(?) that does not appear to have anything about Casablanca listed and the search mechanism turns up \"nothing found.\"\nSo, as an American, all I have to say is \"whose got the low IQ now, eh?\"",
            "review_date": "2020-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To the extent that I review movies here at all, I tend to focus on those that are a bit more obscure. But, in the unlikely event that someone reads one of my reviews and, wondering what other movies I like, clicks on my profile, this should tell you all you need to know about my taste in film. \n\nCasablanca is more than just my favorite movie; it's a crisply directed cinematic depiction of some of the most powerful and interesting themes in life. \n\nCasablanca is about love, betrayal, honor, morality, and friendship, all set in the middle of a quintessential battle between good and evil of which the outcome was quite uncertain at the time the movie was made. There's also classic music, humor and a slew of unforgettable quotes that stand the test of time- as does the greatness of this movie. I've seen it now at least a dozen times.",
            "review_date": "2020-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca is one of America's greatest films. An engaging story, impossible situations, and a love story that tugs at the heart-string of the coldest cynics combine to make a masterpiece. One of America's best movies.",
            "review_date": "2020-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After hearing talk after talk and seeing lists of the most classic romance films ever made, I decided to watch Casablanca. In World War II, Rick (Humphrey Bogart) owns a cafe/casino in Casablanca, Morocco and obtains secret exit visas to escape Nazi persecution. During which, his ex-lover Ilse (Ingrid Bergman) walks in and they reunite. Ilse asks Rick for favors because she and her husband (Paul Henreid) will die in this city if he doesn't give visas to them. To be honest, within the second Rick glued eyes onto Ilse, I was hooked. Furthermore, I saw more of the despair and regret in both characters as the film continued. Part of the chemistry involves their given circumstances and high stakes, which suggest that she seeks guidance from him before she dies. Despite her desperate needs, Rick drowns himself with so much liquor, hoping to wash away their romance in Paris, that he resents her for quietly departing him. Because of this, you almost feel teary-eyed that he finally agrees to the proposal as well as feel the tremendous connection between the two characters. In case my points weren't an indication, I had a wonderful time watching Casablanca, seeing now why it's considered THE great romance film. \n\n(5 Blue Parrots out of 5)",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated and Rains gave the only performance I found impressive.",
            "review_date": "2020-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just one of the most simple, pure, and emotional movies ever made, there's no way I can give it any less than a perfect score.",
            "review_date": "2020-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without a doubt my favorite film.",
            "review_date": "2020-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far the greatest film ever made.",
            "review_date": "2020-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The PERFECT movie!!!  It has everything and done so beautifully!",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10.0. No words can describe the emotion emitted from Casablanca. It evokes something without the use of action, profanity, or sexual images, but rather true beauty on the screen. What Bergman and Bogart emit together with their simple look of love creates a feeling that is unlike no other. In reality, everything is perfected in this movie, from Rick's humane arc, to the political importance of this movie that still stays relevant to this day.",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the best film of all time, Casablanca isn't only a carefully crafted romance but also a deep look into refugee struggles.",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To put it plainly, it’s a bit dull and boring plot-wise.",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You might have to have significant life experience to enjoy this movie. At least I did. You may even have to watch it twice. I watched it once in my 20s and just thought it was ok. I watched it again in my 50s and now I think it might be the best movie ever made. I cried so hard was shaking uncontrollably. It probably won't have that effect on you unless you really believe in their feelings and the sacrifices they are having to make.",
            "review_date": "2020-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceeding all expectations, this Academy Award-winning film for Best Picture is about an expatriate (Humphrey Bogart) who helps the love of his life escape with her wanted husband from Vichy-controlled Casablanca. With a WWII backdrop, this A-list romantic drama is widely considered one of the greatest films of all time and has had a lasting influence on Hollywood since its 1942 premiere.",
            "review_date": "2020-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So sincere and warm.  A timeless classic.",
            "review_date": "2020-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All I can say is Casablanca is a great perfect movie. One of my top 10 movies.",
            "review_date": "2020-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great American classic! It is so gripping and masterfully directed that it will go on for ages.",
            "review_date": "2020-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seeing this film in the modern day knowing only of its massive influence and the high regard in which it is held, I was fully prepared to discount Casablanca as a product of its own mythos. I was instead entirely surprised at the classically rendered but stil poignant interpretation of lost romance, and Bogart's performance as the jaded cynic with a sudden turn for the sentimental still imparts a sense of authenticity and power; a career-defining role. One of the relatively scarce early American classics that lives up to the hype in all regards. (5/5)",
            "review_date": "2020-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WWII used as a background wisely, not irresponsibly. The picture has a beautiful, special screenplay, explointing very well every single aspect of its premise.",
            "review_date": "2020-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly a classic. Everyone involved did some of the best work of their careers.",
            "review_date": "2020-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast pace and witty. Keeps you entertained throughout even though it’s an old timey. Lots of quotable lines. And memorable characters. ",
            "review_date": "2020-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deserving of its status as an all-time great. Hard to fault it, really",
            "review_date": "2020-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if you think this is overrated then you're probably too young to understand its artistry.",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those rare films that gets better every time you screen it. The closing scene is sublime.",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie, I don't just only love the romance of it but the political and ideological symbolism behind every single line. The use of shadow and light works perfectly with the symbolism Micheal Curtiz created.",
            "review_date": "2020-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A staggering brilliant film with suspense and romance. With a cast and script that is tremendous. There are many lines that are considered the best quotes in film history and rightly so. Humphrey Bogart and Ingrid Bergman are excellent as are the supporting cast. The two leads play their characters very well. Bogart the cynical and not caring who changes throughout the movie. Understanding which side to be on and Bergman who is in love and confused but will fight for her husband. My favourite performance was Claude Rains who I was disappointed that he did not receive best supporting actor. He has a wealth of humour and is very commanding. The film is a deserved best picture Oscar winner. The last 10 minutes is one of the best ends to a film in history, from the many great lines, the tension and the acting. Here's looking at you kid and well always have Paris are very emotional. The film has many funny moments and terrific songs throughout. As time goes by is a classic as is the moving scene with the La Marseillaise. No scene is wasted they all play a pivotal role in the film as the many people try to leave Casablanca or help Laszlo. Give much credit to the director and the look of the movie. Ricks looks a terrific place to go and the markets are well designed. The many shadows used through many scenes increase the tension and paranoia. Many of the scenes happen through the evening and night and the film is gorgeous black and white. The end scene with the fog and the plane as they walk away onto the plane is beautiful shot. A script that will go down in history. A very romantic, moving, political and suspenseful film with every actor deserving of special credit.",
            "review_date": "2020-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was fasinating and absolute classic.",
            "review_date": "2020-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful movie.  Great emotional story, captivating scenes, good acting, deep and realistic dialogue.  I suggest turning the captions on because some of the accents are strong.",
            "review_date": "2020-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The overflowing beauty of Ingrid Bergman transcended my laptop's screen --- and it all that matters to make the movie exceptionally beautiful.\n\nOne does not need the vibrance of colors --- Bergman's aura vivified what was supposed to be a gray-and-white film.\n\nAside from her captivating beauty and charm, her effortless acting style and skills gave the film finesse and elegance --- not just perfection for 'perfect' for me would be vapid...\n\nThe overarching story and the succession of twists and turns was almost detachable from Bergman. She was the story itself. And everything else was a blur.\n\nThe movie was like a small but decadent chocolate cake --- a small slice would be enough for a satisfying dessert!\n\nRating: None. Not quantifiable. But truly, one of the best films ever made!",
            "review_date": "2020-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic, no question about that. But timely virtues kick this “one” up to some strong winds. A significant piece with beauty, heart, and meaning. Although, again, the times have changed and some might find it a bit on the cruder side of handling, now more testing topics.",
            "review_date": "2020-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of all times!!!!",
            "review_date": "2020-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, timeless and full of memorable quips. It pulls at your heartstrings all the way but fails to examine its main characters deeply. You're left wondering who they really are why they do what they do. As such is main themes are clear, but",
            "review_date": "2020-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting and adventurous even 80 years after, \"Casablanca\" is, with reason, a classic that must be watched but anyone. A love triangle for the ages.",
            "review_date": "2020-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fricken masterpiece! My favorite film of all time!",
            "review_date": "2020-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional movie with every bit colorful romance and complexity in a very colorless screen. Great One.",
            "review_date": "2020-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An often misquoted classic of black and white cinema, Casablanca is still one of the best movie love stories that has ever been made. The pairing of Humphrey Bogart with Ingrid Bergman as former lovers drawn together again in the wartime Casablanca is such a well known image and rightly so as they deliver flawless performances. I must also mention the wonderful Claude Raines as the police chief and friend of the shady Rick, played by Bogart. I really enjoy the wit and lightness Raines brings to this character. There's nothing really that can be said about this film that hasn't already been said. It is enough to know that everything just works and there are so many classic moments that are just a joy to watch.",
            "review_date": "2020-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rick grates on me, but a great movie nonetheless.",
            "review_date": "2020-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hollywood’s greatest movies just wonderful on the big screen",
            "review_date": "2020-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A love story that has great moments very memorable.",
            "review_date": "2020-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect film in every way.",
            "review_date": "2020-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So wonderful to see a classic like this on the big screen.  If only Hollywood output is as classy as it was back then.",
            "review_date": "2020-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca is a classic for a reason, a great film, especially for those who love film.",
            "review_date": "2020-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without any doubt, one of the best movies ever made, a real classic, with so much drama, love, pain and heart on it. ‘Casablanca' will be forever a must see of the old Hollywood.",
            "review_date": "2020-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can I say about this movie that hasn't already been said, so many times before. It's beautiful, powerful, stunning and at certain times very funny, it's just a great movie that no one should miss seeing. God bless my mother for raising me on classics like these, even though I grew up in the 90's. My connection to Casablanca has always been a close one. From the moment I started watching it when I was 11 years old it became, still is and always will be, one of my all time favorite films, ever. As a matter of fact I had been dating a guy for a couple months when he had come over to watch Casablanca with me, it was the first time ever watching it for him and I was extremely excited. What I wouldn't give to watch Casablanca for the first time, again.  Well, I'm sad to report that after the first 30 minutes he had fallen asleep and even after I woke him, he fell asleep again and for the rest of the movie. I broke up with him 2 days later. I'm not saying that you don't have a soul if you don't like, or love, Casablanca, but I'm not, not saying it, either. If you haven't seen this movie please do yourself a favor and do so. Chances are high you will be very glad that you did!",
            "review_date": "2020-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good actors do some really good acting.\nBoy meets girl. Girl leaves boy. Girl and husband wander into boy's bar.",
            "review_date": "2020-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The classic of the 40's and a timeless masterpiece. Bogart and Bergman take it away in of the most romantic film noirs of the era. This movie is the definition of good acting and a boastful story. Linear, simple, classy, and perfect this movie has it all. Film noir enthusiasts will adore this film and worship it as the template of all noirs.",
            "review_date": "2019-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the lack of special effects (the fog in the ending scene was added to hide how fake the taking off airplane looked), the movie is astonishingly powerful and moving. A masterpiece through and through. ",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While some classics feel dated, Casablanca manages not to in a simply wonderful and charming way.",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Forgive me for screaming into the void. Please ignore this: WHO ARE YOU PEOPLE?! The first act of this movie has so many characters coming and going, speaking different languages, talking about different things, jumping in and out of scenes. I know it's supposed to set a mood, but it's very difficult to figure out who and what we're supposed to be paying attention to. Bogart moves from one conversation to the next and the audience is left to wonder if it will be of any significance later or if it's just world building, heaven help you if you missed something. Rush over here, have a quick conversation, end it abruptly, then rush on over to the next person to do it over again, like a series of dreams crashing in on one another all at once. There's one hilarious moment where two men are walking into the bar, and one gives the Nazi salute, and the other salutes regularly, then they both look at each other. I get that it's probably an accurate occurrence from those days, but then the movie pauses on that like it's some important moment between the two. Um, I can't tell what denomination the non-Nazi guy is, so I don't know what feeling is supposed to be evoked from this: fear, disgust, quiet camaraderie, sympathy? It struck me as one of the actors realizing they were on the wrong movie set and the editor forgot to leave the clip on the cutting room floor. Oh, and god the mumbling. People give today's mumble rappers a bad reputation, but they have nothing on old black and white films. They did nothing but mumble unless they were screaming. I had to have the volume halfway up just to make out what people were saying. That and Bogart's mouth never fully closes; it strangely got on my nerves just looking at his face. Part of this is my fault. I am not, nor will I ever be, that interested in history, and more specifically WW2, so all this intrigue is lost completely on me because I don't know the intricacies of who is dressed as what, or why this official hates that official, or even why this guy over here can't get along with the others over there (except the Nazis of course, I don't need to be a history buff to get why no one likes them). I just couldn't get why someone would give a guy the side eye, the characters would throw a line away about it, but if you don't know the historical context surrounding this time period, it would make no sense, and then the moment would pass by like it never happened. You don't really need to understand all that to follow the movie, but it really feels like you're missing a ton if you don't. Thank goodness for Ingrid Bergman. Any movie she's in is worth it in the end.",
            "review_date": "2019-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic. Micheal Curtiz brings with you a unique cinematic experience of romance and drama.",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Casablanca. It's one of the greatest movies ever made. Nuff said",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really good! and some SWINGY times! yknowwhatimsayn?",
            "review_date": "2019-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely brilliant picture, on all levels. I have seen it literally hundreds (yeah, more than 200) of times since I was a small boy, and it still never fails to pull me in, and hold me in rapt attention, and move me emotionally along with it from beginning to end. \n\nThere is to this day, no better love story ever filmed than Casablanca.",
            "review_date": "2019-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still my favorite movie of all time.",
            "review_date": "2019-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Romantic, intriguing and addictive without \nBeing overdramatic",
            "review_date": "2019-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Has to be my favorite movie of all time, and end up watching it at least once a year.",
            "review_date": "2019-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca is able to exceed any and all expectations with a simple, but still engaging love story, a high tension tone, and all around great performances from everyone in the cast.",
            "review_date": "2019-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie (tied with 12 Angry Men)",
            "review_date": "2019-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still an an all time classic!",
            "review_date": "2019-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest  existentialist  movie ever made.   Never, never forget when this movie was produced.    If it had first appeared in the 1960s, the movie might have seemed unnecessary.  Instead, it belongs to a  year when anything could have happened during the Second World War.     Concentration camps are mentioned  in the movie but most  people in  the American audience were  confused by the term.    What's a \"concentration camp,\"  Dad?     Rick Blaine and his buddies have to make some sacrifices in order to do the right thing.  In 1942,   the  \"right thing\"  wasn't obvious.",
            "review_date": "2019-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's my best movie🦁🦁",
            "review_date": "2019-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you haven´t seen this movie and you´re wondering why it´s always in the discussion of being one of the greats pictures of all time, just watch it asap. Bogart charisma and its straight-forward plot makes this one of the most rewatchable flicks of its time. ",
            "review_date": "2019-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At this point, it's like comfort food.",
            "review_date": "2019-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, every line is a classic.",
            "review_date": "2019-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even in 2019, it continues to be an excellent work about not other than an extraordinary  love story.  ",
            "review_date": "2019-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(Not a full review)\n\nCasablanca is a 1942 film directed by Michael Curtiz. The film stars Humphrey Bogart as Rick Blaine and Ingrid Bergman as Ilsa Lund.\n\nThe acting was extremely strong and so was the story. The characters were also very strong and portrayed well. The film also had a great script with some of the most famous lines from cinema history.\n\nOver all I give it a\n9/10\n\nClassic",
            "review_date": "2019-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Original and unpredictable, with many memorable scenes, this film still stands as a true classic decades afterwards. You can bet the ending would be much different if shot during today's culture but any other ending would water down its impact. ",
            "review_date": "2019-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would say this is definitely a classic by all definitions but I also do not think it is a masterpiece by any means. I feel as if those who would call this movie \"the best\" are more likely older and have respect for writing, lighting, acting, story but that's it. The black and white is limiting but is utilized well to create stark contrast. Sam is such a fun character and Rick is one of the most subtly complex characters in any movie. It is an incredibly well made film but is definitely filled with a lot of dead-space and moves slowly at times.",
            "review_date": "2019-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would not have any real problem with this film if it was acknowledged as an average 1940s melodrama instead of being called one of the greatest films of all time. It simply isn't and I was infuriated at the fact that AFI considers the love between Rick and Ilsa to be better than that Scareltt and Rhett in Gone with the Wind (1939) and Karen and Denys in Out of Africa (1985). I found parts of the film that I liked but I didn't feel involved in the passion in the way that I should have in a big, dramatic love story. I would say that people should watch it because it contains some memorable lines, great cinematography and is mercifully short when compared to other Best Picture winners.\n\nAmerican Rick Blaine, Humphrey Bogart, resides in Casablanca, Morocco where he owns a bar at which illegal gambling takes place and refugees attempt to buy freedom and escape to Lisbon, Portugal. One night his ex-lover Ilsa Lund, Ingrid Bergman, and the husband that he was unaware of when they had an affair while in Paris arrive at Rick's hoping to buy their way to Casablanca. Rick and Ilsa fondly remember the time they spent in Paris while she tries her hardest to get the letters of transit off of him. He eventually relents and allows her to leave with her husband but falls back on his friend, corrupt official Captain Louis Renault, Claude Rains, for lasting friendship.\n\nMy biggest issue with the film is that Ilsa is a big old nothing of a character. What do we know about her personality, she's in love with Rick but trapped with another man and doesn't have the guts to go out and do something on her own. Their connection seems very shallow as we only see a ‘love montage' in which she happily places flowers in a vase and they stare at one another longingly, what is it about the other that makes them attractive, we never know. We don't get any real moments of tension as I could sense that the two of them were not going to get back together and the time we spend with them in which they discuss their ‘impossible' situation is not particularly romantic or devastating. Feeling nothing for one of your main characters and not believing in the connection between the two lovers in your film is a bad sign for a romantic drama and this is what sunk the film from being great to just adequate for me.\n\nSome of the lines were undeniably brilliant however as the dialogue is snappy and exciting in a film where very little actually goes on. \"We'll always have Paris\" would have more power if included in a more romantic story but as it stands it was still a lovely sentimental line to drop in amongst more cynical talk. \"Round up the usual suspects\" and \"Louis, I think this is the beginning of a beautiful friendship\" also deserve their iconic status but they hardly equal \"Frankly me dear, I don't give a damn\" and \"Tomorrow is another day.\" If you watch films looking for quotable lines this is a film packed full of them and they have the intended effect even with age.\n\nThe performances of the two leads are part of why I don't love the film as I feel that Bogart poses more than acts in his position as a romantic lead and Bergman doesn't get enough to work with to be a compelling leading lady. Rains steals the show as Captain Renault as his precise British manner and the touch of melancholy in his voice make his character a worthy ally to our leads and possibly the most interesting character in the film.\n\nThe 1942 Best Picture nominees weren't particularly strong but I would have given the award to Watch on the Rhine (1943) which features one of my favorite Bette Davis performances. No it's not as iconic or well loved as Casablanca but it's a better film that has aged wonderfully despite being made in an era where most films seem like ridiculously overblown soap operas by today's standards. You will most likely see Casablanca at least once during your life but please try to see Watch on the Rhine.",
            "review_date": "2019-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bogart and Bergman are changing history, witness it now or a century later, something so pure as such, doesn't get rusty.\n\nCasablanca\n\nCurtiz is light on his feet and smooth as the Jazz that is continuously and melodiously played in the hotel. And I think it is his supervision that blends in sacrifice in romance, so pure and irreplaceable, that drama is overshadowed by its crowd pleasing concept. The director, Michael Curtiz installs tiny notions in the script that carves a momentum of live hotel and the do's and don'ts of a hotelier especially the magnetic reputation he or she juggles by dipping his or her hands on both the side of the dirt.\n\nThe Robin Hood figure, is their way in, and with Humphrey Bogart playing one of the most iconic character, the first act of the film is building up his figure that is latter to be shattered with such fragility. But the final act is brimmed with charm, so where they actually had to work was the introduction. And choreographed like some exotic dance, the entire hotel that is mapped out in front of us, makes us feel like home something that has aged well over the years. Personally, I prefer the sacrifice of his hotel's fairness regarding the gambling policies.\n\nTo me, that would always be the game changer, not only the actress's performance but the tone that shifts with such calculative baby steps that you are sinking in deliberately in those twinkling eyes. And if Bogart is boasting off with some of his best work then Ingrid Bergman definitely casts the magic powerful enough to rubble him down in a blink. Their equation is like some wine, you are buzzed with the aftermath soberness rather than their poetic romantic vacation. Casablanca defines the Hollywood version of Americana set in a different location, it was ahead of its time then and it is now; all hail the classic dish serving one purpose and one only.",
            "review_date": "2019-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily the greatest film of all-time. ",
            "review_date": "2019-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly one of the greatest films of all time! A film that finds a way to be both immensely entertaining and masterfully artful from beginning to end. This film is a great example of fine filmmaking craftsmanship, all of that being shown in the performances, direction, writing, and everywhere else.",
            "review_date": "2019-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true masterpiece, with a great love story and a great ending.  One of the best ever.",
            "review_date": "2019-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's great, but you knew that. Lovely to see it on the big screen. It had been so many years since I'd seen it; all this time later I found Bogard a little inert. But Bergman really is extraordinary in this, isn't she? Performs in a way which makes me think of Elisabeth Moss today - does much with silence, so when she does speak, the character is well built.",
            "review_date": "2019-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca is undeniably one of Hollywood's greatest films of all time with excellent performances, cinematography, directing, and much more while giving us a tale of love.",
            "review_date": "2019-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know, I know..\"Citizen Kane\" is the greatest film of all time..but I've seen that movie twice.\nI've seen \"Casablanca\" so many times I've lost count..I've never gotten tired of it..ever.\nIt will make you laugh, cry, love, cheer.\nNobody is cooler than Rick.\nNo one.",
            "review_date": "2019-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of all time.",
            "review_date": "2019-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a classic with some amazing, one liners, and moving scenes, whats not to love?",
            "review_date": "2019-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply superb, unforgettable entertainment, with more memorable vignettes than any film I've ever seen.  One moment (among dozens) that always gets to me is the look on Ingrid Bergman's face as she marvels at Paul Henreid dangerously and bravely leading the clientele at Rick's in the singing of the Free French anthem.  In five seconds she simultaneously portrays a depth of caring, admiration, devotion, and respect that very few actresses could possibly muster.",
            "review_date": "2019-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well written, well directed, and well acted, \"Casablanca\" is one of Hollywood's best films.",
            "review_date": "2019-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great screenplay, great actors, great movie.",
            "review_date": "2019-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most important and best movies of all time",
            "review_date": "2019-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "CLASSIC FOR A REASON.  The acting and dialogue are top-notch.  The delivery of the script is tight and amazingly delivered.  So much wit and fun, it's hard to not laugh out loud. \n Filmed and directly very, very well, still holds up over 70 years later.",
            "review_date": "2019-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect movie - timeless classic.",
            "review_date": "2019-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect movie in almost every way and a ultimate classic I love Casablanca.",
            "review_date": "2019-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is pretty good, but its age showed and it doesnâ(TM)t really hold up well. The pacing and acting are mostly what holds this film back from absolute greatness.",
            "review_date": "2019-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even today, this masterpiece still stands as one of the top 5 movies ever made thanks largely to the incredible performances of Bogart, Bergman and the rest of the cast. This is a well told story of love, spying and human nature   during wartime and what people do to survive.",
            "review_date": "2019-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this at Flashback Cinema. The silver screen was friendly to this film. I found it somewhat boring on TV and would have rated it 2 star at best. The story is simple, but perfectly executed.",
            "review_date": "2019-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The hype was an understatement, a perfect movie",
            "review_date": "2019-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We'll always have Paris",
            "review_date": "2019-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It really doesn't get better than this. Nazis, love, murder, letters of transit. Top five movie ever made. Might be top one. Watch it. Study it. Watch it again. And again. You'll love it.",
            "review_date": "2019-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best movie I've ever seen. Every character makes you care in a different way. So many quotable lines - if you haven't seen it you may not know where the lines come from. Watching Rick do the right thing at the end of the movie in spite of himself and seeing how it tears his heart out is an emotionally satisfying payoff to a fantastic movie.",
            "review_date": "2019-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fascinatingly romantic!",
            "review_date": "2019-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece. The cast includes amazing actors such as Humphrey Bogart, Peter Lorre, Ingrid Bergman, Paul Henreid, Sydney Greenstreet, Claude Rains, Conrad Vedit and more. The actors do amazing in it. The  plot is great. Casablanca is as good as The Maltese Falcon and M.",
            "review_date": "2019-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie i have ever seen! en now in 2019 i still get tears in my eyes when Sam play When Time Goes By, and the briljant essembled cast makes this the perfect fil, its my all time favorite!",
            "review_date": "2019-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whenever I watch this movie I remember how good plot and character driven movies are and wish Hollywood would pump the breaks on the flash and bang sleight of hand that is really only used to distract from bad plot and writing. This film though stands still in time and is a tribute to the brave and noble deeds of the greatest generation as well as a testament to the wit and repartee of those who came before us as actors. Not to mention the vast amount of what is said in the unsaid between men that is put on display. It is never lacking in symbolism and hardly has a scene that doesn't fire on all cylinders for one reason or another. Where movies often rely on nostalgia these days you can watch this as a young adult, love it, and return to it only to love it more upon its second viewing as opposed to having a childhood veneer shattered. I gather the few bad reviews this has is due to the impatient instant gratification of our society today and they got \"bored\" because nothing is happening. When in actuality it is flying over their head like a plane en route to Lisbon.",
            "review_date": "2019-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If there is a more 'classic' film from the golden age of Hollywood, I'm not sure I know of it. A timeless tale told with vigor set against the backdrop of a world at war. Humphrey Bogart earns his place as the defining star of this era.",
            "review_date": "2019-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of all time. The writing in this is impeccable. ",
            "review_date": "2018-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie in my Film class in highschool  (Yes Film class is a thing.)\nThis movie was very charming and had alot of emotion and life to it even though this is an old black and white film.",
            "review_date": "2018-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my favorite film of all time. Beautiful plot that naturally weaves together and builds to a truly emotional climax. Could affect even the most nihilistic of people.",
            "review_date": "2018-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolutely beautiful masterpiece. My favourite movie of all time. 100% recommend watching it",
            "review_date": "2018-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was almost good.",
            "review_date": "2018-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic. One of the very best.",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In spite of its uninteresting story, it is hard to deny its universal recognition. But aside from that, it is mainly helmed by strong lead performances and an immaculate cinematography full of sleek camera movement and an abundance of shadows to illustrate the uncertainty of its characters.",
            "review_date": "2018-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just love movies that mainly take place in a single location and this one is certainly one of the best. Rick, masterfully played by Humphrey, is one of the more interesting characters ever put to film.",
            "review_date": "2018-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific acting, perfect script, intriguing storyline. This is a must watch.",
            "review_date": "2018-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie, it had everything from romance and drama to even action. Rick Blaine is a very love to hate character and IIsa being a Femme Fatale is awesome!",
            "review_date": "2018-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic black and white romance.\n\nMichael Curtiz directed Casablanca (1942) with a steady hand for moving panning shots and revealing close-ups. Swift pacing and a short run time makes Casablanca a quick romance that stays with you forever. Clever, witty writing and punchy delivery culminate in fun dialogue and memorable lines. Casablanca really has everything going for it, from a beautiful theme song, moody lighting, stunning black and white stark colors, and stellar casting.\n\nSpeaking of which, Casablanca features a highly unique cast of standout actors. Humphrey Bogart leads Casablanca with a grumpy, moody, disposition. Bogart pulls off sarcastic remarks and dry humor with a manly suave. Ingrid Bergman is as lovely as ever with gorgeous costumes and that distinct Swedish accent. Bergman is Casablanca's real standout performance. She is so expressive and realistic for the era. She portrays charm with ease, while simultaneously playing the mysterious old flame. Bergman is the ultimate femme fatale.\n\nNotably, legend of German cinema from the silent film era, Conrad Veidt plays a German Major in Casablanca. He is quite the villain with his strict German demeanor and heinous manipulation. It's a very nice supporting role from Veidt.\n\nSimilarly, Claude Rains plays a French Captain that is absolutely charming and hilarious. I really liked Rains in Casablanca. He will certainly endear himself to any audience that watches Casablanca.\n\nOverall, this is as iconic and classic as movies get. Casablanca remains a beautiful romance film filled with reveals and twists. It holds up as a well directed movie by Michael Curtiz as well. I think Bogart and Bergman's chemistry is what continues to endear itself to viewers to this day.",
            "review_date": "2018-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching Casablanca is an experience about love and romance",
            "review_date": "2018-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The quintessential romance film, \"Casablance\" is arguably one of the greatest films in cinematic history - let alone the genre. Suspenseful, touching, witty, pensive, this film tops all others, and truly shows Humphrey Bogart and Ingrid Bergman at their finest.",
            "review_date": "2018-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very elegant film everything ties together very nicely beautiful set",
            "review_date": "2018-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is very little to say about this that hasn't been said.  It really is that good.  You really should see it.  If you don't like it you will at least know why so many people love this movie and hold everything up this as a measuring stick",
            "review_date": "2018-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece of cinema, truely one of the greatest movies of all time. A very quotable movie. This film contains one of the greatest movie characters of all time, i don't even need to say who that gentlemen is. It deservered EVERY accolade it got and more. Humphrey Bogart's performance is magnificent, not saying the other cast members performances aren't but his performance as Rick Blaine is just indescribable. The cinematography is gorgeous, the story is compelling, the direction is magnificent. This movie is truely iconic. 10/10",
            "review_date": "2018-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting and writing, but my goodness some parts were just so boring. ",
            "review_date": "2018-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece that is truly one of the greatest films ever made.",
            "review_date": "2018-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It seems ridiculous to review Casablanca since it is the model for a romantic adventure. With perfect writing, acting and directing, they don't get any better.",
            "review_date": "2018-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good.  Loved the dialog. Loved the look of the movie and Ingrid Bergman is just stunning.\n\nOnce I realized Rick's transformation was the main point of the film, I liked it better.   The treatment of Ilsa's character was, for me, just too 1940's Hollywood.   So she tragically loses her husband and falls in love with Rick.  Then, when she finds out her husband is actually alive but Rick is in danger and need to leave Paris, she sacrifices that love to stay with her sick, hero husband and also to protect Rick.   But the film does not see this as heroic.  This is just a plot point to show why Rick is cynical and bitter.   Then they meet again in Casablanca.  Rick can't forgive her, or even let her explain.  He's too deeply wounded because he loved her so much - not enough to hear her out-  but enough to change his whole outlook on life and become cynical. \nHowever, hero husband needs Rick's help which he refuses, (because he is cynical and bitter) even though he agrees that Lazlo is a great and important man.  Ilsa begs Rick for help, calls him out on his punishing Lazlo because he's mad at her and even pulls a gun on him.  Up to this point, this is not a woman who needs Rick to think for her.  She is not weak or morally confused in any way.  She has put aside her love for Rick to support her husband who is fighting the Nazi's while Rick serves them drinks.   However, in this movie, Ilsa's self-sacrifice means nothing - because Rick is to be the hero.  We need to see him transform from selfish and cynical to self-sacrificing and heroic.    So Ilsa conveniently  becomes unable to decide right and wrong: \"Oh Rick, you must think for both of us!\"      Now Rick can be the moral agent, hooray!   He decides FOR her that she must stay with Lazlo (because she is his inspiration - a fitting role for a beautiful woman).  Now her sacrifice has meaning and he can live with it because he got to decide, rather than being dumped.   And now they will \"always have Paris\".    Only now are the Paris memories able to be cherished because Rick gets it now.  I'm thinking  Ilsa probably always \"had Paris\" because she originally made the decision to stay with Lazlo.   But now Rick is the decider - so everything is better.   Rick's the hero.  Ilsa has been guided by him back to where she had already gotten by herself and he hopes that \"someday she'll be able to understand\"  that her husband's work is more important than the \"problems of three little people ( that) don't amount to a hill of beans\".\nGood job, Rick!    Better late than never.\n\nAm I right?",
            "review_date": "2018-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie ever!",
            "review_date": "2018-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched April 10, 2018 The beginning was slow, but as it goes on it gets better. By the end you’re sad it’s over",
            "review_date": "2018-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched Feb 10, 2018\nNeeds no introduction, but what a film!",
            "review_date": "2018-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely superb! One of the best movies ever made.",
            "review_date": "2018-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "feel like a more thriller lalaland version very nice ending",
            "review_date": "2018-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the movie is maybe the number one classiest movie of all time .despite the fact that it is not genius and is not the most entertaining one ,it is full of amazing scenes and leaves us a good impression .the ending is splendid ,and we can't help but love the romance (and the bromance)",
            "review_date": "2018-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies ever made",
            "review_date": "2018-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nearly 80 years later, this film remains a true masterpiece of cinema with a compelling story, amazingly well developed and complex characters, and cinematography that manages to hold up through decades. This film deserves its reputation as one of the classics.",
            "review_date": "2018-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Few things live up to the hype but that isn't true of Casablanca. It really is one of the greatest movies ever made. You will find an excellent cast delivering delivering equally excellent dialogue. The principles (save the Nazis) are well defined and sympathetic. It's a movie that only gets better with age and subsequent viewings. There is violence and thematic elements the smallest kids might not be able to handle but teens and older should be fine.",
            "review_date": "2018-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a cuck movie Adam.",
            "review_date": "2018-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a classic, no doubt about that.  I may not adore it and find it to be a perfect film like so many people do, but it is a great piece of film-making.  The acting, the story, cinematography are just top notch.  This movie still hits you emotionally and is a story that is just timeless.",
            "review_date": "2018-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best screenplay of all time. Every line of dialogue is meaningful. So well written.",
            "review_date": "2018-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorites, and I have nothing to add to the superlatives from other critics.  Other than to say that if Donald Trump wrote about the film, he would probably insist that there were \"good and bad people on both sides.\"",
            "review_date": "2018-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't believe this is only rated #35 of the all-time list! Wonderful, even if you don't romances",
            "review_date": "2018-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute classic!  Every moment legendary.  The very fact that they were practically writing as they were filming makes it even more miraculous,",
            "review_date": "2018-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest drama of all time, perhaps the greatest overall film of all time. It is well deserving of its place at the top of the charts, unlike Citizen Kane.",
            "review_date": "2017-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever filmed.  The dialogue contains so many iconic lines it's almost a parody of great writing.  Don't miss!",
            "review_date": "2017-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grade: A+\nA classic for sure with acting superb at its finest, cinematography, and with memorable dialogue.",
            "review_date": "2017-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great music, great acting, great movie.",
            "review_date": "2017-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's not really much one can add all of the comments about this film, a masterpiece that is truly deserving of being in the list of top movies of all time.  The story is perfectly crafted, intersecting a love triangle with the crushing pressures of wartime, and It's perfectly told by Director Michael Curtiz, with a flashback, a few surprises, and not a single wasted shot.  Most importantly, the film captures the feeling of those huge moments in life that we'll always remember, where everything in one's life pivots, as well as the pain of love lost.  Bogart holding that note in the rain, the ink beginning to run down as he's urged to get on the train, is later mirrored by him watching the plane disappear into the fog, the signal light reducing to a pinprick, and both moments are incredibly poignant.\n\nThe cast is also outstanding - Bogart and Bergman of course, but also almost all of the supporting characters.  Claude Rains as the Vichy French captain whose loyalties sway in the wind is my personal favorite.  In a sweeping story that could have easily been cloying or corny, there is great realism in characters who are morally ambivalent (Rains, Lorre, and Bogart himself) put next to those who are willing to sacrifice themselves for a good cause, and those bent on taking over the world.  There are many wonderful scenes, and not just those between Bogart and Bergman.  Paul Henreid is great with Bergman too, and the scene where he leads the French ex-pats in singing 'La Marseillaise' to drown out the German officers singing their own patriotic is rousing.  And let's not forget Dooley Wilson, who is so smooth, singing among other things the iconic \"As Time Goes By\".  This film is romantic, gritty, stoic, larger than life, and epic - and one that I never get tired of seeing.",
            "review_date": "2017-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow for our times but presenting the atemporal conflict of timing in life, is the textbook reference of every action of loyal love and respect for old decisions.",
            "review_date": "2017-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This American romantic drama, set during WWII, contains solid performances and an engaging script. It is cleverly written and directed, with the plot slowly unfolding as the film progresses. Although I did find the ending come on a little too quickly, this is an enthralling film containing many classic scenes and lines. Considered one of the top three films of all time and containing one of the top songs of all time (As Time Goes By). My favourite film of 1942. AAW 1001",
            "review_date": "2017-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film noir masterpiece, which only gets better with time.",
            "review_date": "2017-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What else can be said that hasn't already been said a million times...? \"Casablanca\" IS one of the  best(if not the best)  love stories ever put onto film.  This film has a lot of endlessly quotable lines in a sparkling screenplay, and a great romance, and characters you can root for at the center. If you havn't seen it already...what are you waiting for??",
            "review_date": "2017-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yup. Film perfection. Gotta love Claude Rains in this.",
            "review_date": "2017-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much a perfect movie. The direction, the performances, the cast, the locations, the lines... All superb.  Love the relationship between Bogie and Raines.",
            "review_date": "2017-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca (1942)  has an art for its' critics, but for its' audience it's Rick (Humphrey Bogart) and Ilsa (Ingrid Bergman). At first is is really hard to tell what makes this movie so great, and after watching it several times I think I know why. To point out much deeper, the wrongness of human life is one of many reasons why the two can never be in love. It's something that few can identify with. The pacing is both quick and slow (for its' moments). The film's director; Michael Curtiz  creates the ultimate art in disguise kind of movie. Definitely a favorite.\nScore: A+ GREAT!!!",
            "review_date": "2017-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca hasn't aged at all, and still is a beautiful movie about love, and quite possibly, one of the greatest movies of all time.",
            "review_date": "2017-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie, and story",
            "review_date": "2017-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We will always have Paris",
            "review_date": "2017-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the emotional impact of the picture that's extraordinary. Curtiz's 'Casablanca' has neither the technical virtuosity nor the grand dimension that its reputation might suggest, but it nevertheless earned every inch of its hype. Yet the magical virtue of 'Casablanca', what makes it work so well lies not in these two aspects but in its incredibly human, incredibly overwhelming pairing (Bogart and Bergman), the finesse of their dialogues, their exceptional characterization and all these imperfect elements that, altogether, form an alchemy which, somehow, makes the film truly great.",
            "review_date": "2017-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever! A must see.",
            "review_date": "2017-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Curtiz's 'Casablanca' has neither the impressive dimension nor the technical virtuosity that its reputation could suggest - but it nevertheless earned every bit of its hype.  Ye the magical virtue of 'Casablanca', what makes it work so well lies not in these two aspects but in its incredibly overwhelming pairing (Bogart and Bergman) - the finesse of their dialogues, their exceptional characterization and in these imperfect elements which, altogether, form an alchemy  which makes the film, somehow, truly great.",
            "review_date": "2017-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true romantic classic, Casablanca has stood the test of time by Humphrey Bogart and Ingrid Bergman",
            "review_date": "2017-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those films you can watch over and over again.",
            "review_date": "2017-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the most quotable movie ever made, it has a fairly straightforward doomed wartime romance plot but the skill of the actors and the quality of the script put it up above many others.",
            "review_date": "2017-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't keep up with the story line??",
            "review_date": "2017-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I believe this is the beginning of a beautiful friendship.\"\n\nA beautiful and memorable film with oustanding elements to the story and the picture itself. An incredible screenplay that is perfect, memorable lines, and cinematic scenes that never leave your head. Awesome to be askes \"Have you seen Casablanca?\" And answer by saying \"YES ITS AMAZING!\"",
            "review_date": "2017-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best contender for best movie of all time.",
            "review_date": "2017-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca is a utopian world, a great metaphor about life that is at once the limbo linking hell to paradise.\n\nIn \"Adaptation\" by Spike Jonze, \"Casablanca\" is referred to as a masterpiece for those who want to study and create a screenplay, the consideration is made by screenwriter Robert McKee (Brian Cox), and without a doubt: it is.\n\nThe 1942 classic directed by Michael Curtiz, goes through the centuries as the reference of the seventh art, mainly for the development of its history, an exquisite script that follows the classic linear structure (beginning, middle and end), and who knows how to take advantage of it To provoke small breaks in linearity, in developing a dramatic history whose past we do not know but which is a fundamental part that interferes with the decisions and characteristics of a character, and an uncertain future, but with clear possibilities. We know the paths available to the protagonists, but which will be the chosen and the reason, this only know at the end of the film. The script is based on the play \"Everybody Comes To Rick's,\" being developed in three hands, by Julius J. Epstein, Philip G. Epstein and Howard Koc. A curiosity is that the text of the piece only got to be mounted (years) later, and the rights to the cinema was one of the highest values ??paid at the time.\n\n\"Casablanca\" begins with an ironic narration, close to the comedies that parody wars, and at different moments we have this jocular air in the dialogues of the personages, such as Richard Blane (Humphrey Bogart ) That satirizes its condition of abandoned man or of the transitory condition and of waiting of the great room of connections that is the \"airport Casablanca\". However, the script makes the slide precisely by wanting to present the external world through flash black, a feature that does not add anything interesting to the film, but is an easy way out to try to clarify important facts of the past, yet something that a script So bright and a precise direction, could have solved with other means.\n\nA thriving feature used to compose the illumination of the film is the idea of ??a lantern of a lighthouse, which reflects its turn throughout that city, although spatially speaking, the light of this lighthouse reveals that Casablanca is as short as the extension between two open arms , But it is clear the proposal of director Michael Curtiz that with the direction of photography of Arthur Edeson, create an atmosphere of occultism, and that as the characters, we only have vestiges of shadows, they are not clear, as the lapses of illumination , Which little by little reveals something. Another point that contributes to the illumination and photography adopted is the total superficiality employed. We are in a city in Morocco, where sunlight is strong and abundant, but as \"Casablanca\" was shot in the studio, and also proposes the features of a Superficial city, its illumination is composed of lamps, chandeliers, lamps, glares and lighthouses and rarely we have reflections of the sun. This artificiality is also felt in the direction of art performed by Carl Jules Weyl, who in what would be internal and external scenarios, works with very definite oppositions, in the internal environments we have the richness of details, as in the bar \"Ricks Café American\" or \" Club Owner Signor Ferrari \"in these environments everything is very luxurious and grandiose and well explored in open plans or the close detail minutiae revealing a beautiful work of composition of images and Mise en scène.\n\nThe soundtrack is marked by the classic \"Like the Time Goes By\" and La Marseillaise, the national anthem of France. Both gain \"status\" in addition to soundtrack, become \"leitmotiv\", and generating some uneasiness, in the third strand of La Marseillaise more than to know that the French are there or that it is a quest to praise France, we know that It is an insecurity on the part of the director to clarify points that are already established as local skin frequented or by the uniforms used by the characters (eg differentiate German soldiers from the French). But the apex of exaltation of the national anthem of France occurs when it is used to provoke the Germans, capable even of uniting the French who are in the Rick café and under German rule.\n\nHumphrey Bogart as Richard Blane, Ingrid Bergman as Ilsa Lund Laszlo and Paul Henreid as Victor Laszlo, stand out individually, and the alien origin of each actor favors the clandestine and migratory game inherent in the film. If separately each actor stands out, the combination in a love triangle works even more, and greatly divides the viewer to the loveable favoritism of Ilsa's character, for both the charming Blane and the heroic Victor are charismatic and with divergent qualities, but Together only complicate yet another position that helps in determining who Ilsa should stay with. None of these characters fall on a Manichean scale to the bad side. Some are cynical, some lie, some kill",
            "review_date": "2017-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considered one of the greatest films of all time and consistently ranking in the top 3 of Best Films lists. The film is essentially described as a romance, but it covers so much more than that. There are comedy elements, usually provided by Claude Rains, the war element, which is the backdrop for the film, and drama, which is probably the main genre challenging the romance.\n\nAll the actors give on-point performances, my particular favourites were Humphrey Bogart and Claude Rains, especially their scenes together. The comedy element provided these two balanced out the romance and drama perfectly. My favourite line; \"I'm shocked, shocked to find that gambling is going on here!\" (Croupier hands him his money)...\"Your winnings sir.\"...\"Oh, thank you very much!\"\n\nThe one drawback I had with the film, was the confusing nature surrounding the letters of transit, but otherwise it is a fantastic film with many memorable lines such as; \"We'll always have Paris\", \"Here's looking at you kid\", \"Of all the gin joints, in all the towns, in all the world, she walks into mine\" and \"I think this is the beginning of a beautiful friendship\". And of course the soundtrack, \"As Time Goes By\".\n\nhttps://rwh92.wordpress.com/",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of all the movie joints in all the towns in all the world, this film walked into mine. Good. Masterpiece.",
            "review_date": "2017-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well lets start of with this, I have not seen a movie better than Casablanca. You the viewer say Why?. Because this movie made cinema the perfect most artistic place it is today, with quotes like~ Heres looking at you, kid, everybody has heard that quote before, it comes from beloved Academy Award Winner Casablanca who won best picture and director starting Humphrey Bogart and the beautiful Ingrid Bergman as Ilsa and Rick.\nThe plot is about a man called Rick that needed to go to Casablanca for refugee because of the 2nd WW, Rick meets the love of her life and gets more secrets from her. This movie of course is brilliant it had excellent choreographed dance sequences, excellent directing, and one of the best plots to have ever put to the big screen. What makes this movie so special is how the romance is handled by the excellent directing of Michael Curtiz, he manages to put suspense, humour, romance in a perfect way. The movie also has incredible performances from Humphrey Bogart and Ingrid Bergman and by the underrated Conrad Veidt. In conclusion this movie is the best movie that hollywood has ever put on its big screen and it gets a\nA+ or (10)",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you were ever asked to name the movie which epitomised the Hollywood Golden Age better than any other, chances are your answer would be Casablanca. Despite being over 70 years old it's still the absolute essence of the most romantic era in film history. It's daunting, really, how much of an achievement it is, just how wonderfully every element works on its own, and how each one improves the others when they're combined. Like the perfect cocktail mix of story, screenplay and character, Casablanca hits all the right notes, utilising the very few sets at its disposable to tell a riveting story of love, loss, sacrifice and loyalty against a war-torn backdrop which you feel in every frame. Humphrey Bogart, never a better choice for a self-loathing cynic, is perfect in the iconic Rick Blaine role: Grumpy, downtrodden and well beyond caring, it takes none other than old flame Ilsa, an equally perfect Ingrid Bergman, forsaking all the world's other gin joints and walking straight into his. The 2 have near-unparalleled chemistry, despite allegedly not getting on behind the scenes, and the raw emotionality of their scenes together is nothing if not heart-breaking, and its impossible not to crack a smile whenever Bogart utters the immortal line 'Here's looking at you kid.' They're bolstered by a terrific supporting cast, a beautifully intimate soundtrack and possibly the greatest script in history. When a single screenplay has not 1, not 2, not 3 but 6 quotations appearing on AFI's 100 years...100 Movies Quotes list, it's quality can be in no doubt. It may be a little too verbose in places, but rarely have character's innermost feelings and desires been expressed with such elegance and humour. It's never boring, keeps us guessing right until the end and climaxes with one of the most genuinely touching and memorable scenes ever committed to film. It's hard to know what else needs to be said. Casablanca is likely as close to a perfect film than has ever, or will ever, be made. Its brilliance is undisputed, it's legacy is assured. For those who dare to doubt the true power of cinema, spend a little time at Rick's Café Américain, and all reservations will be swiftly forgotten.",
            "review_date": "2017-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great premise, but the movie feels too comfortable with that to make any effort to make the viewer care about any of the characters or feel invested in the story.",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Iconic since it's release. Casablanca is a true masterpiece of it's time and continues to be influential today as it is an achievement in filmmaking, cinematography, performances and a true statement on love and romance. Something Hollywood can't ever and shouldn't even try to recreate",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good storyline with many quotable moments it is a classic that everyone needs to see once or twice in their lifetimes.",
            "review_date": "2017-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just as good as I imagined it would be!",
            "review_date": "2017-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bogart & Bergman in a classic",
            "review_date": "2017-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was super into seeing this movie, walked away sort of let down though. \"Here's looking at you kid\" is a great line fyi.",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have probably watched this film 50 times since I first saw it some 30 years ago.  There are a lot of films I've truly loved, but, for me, none hold up to repeated viewings like Casablanca.  I don't know that it's the greatest film ever made, but it is far and away the best film I have ever seen.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, I just thought I'd put my two cents in on the ending. I disagree with most critics. A more satisfying ending would have been for Rick and Ilsa to have remained together at the end. I realize the whatever movie board might not have allowed a married woman to run off with a married man. But that wouldn't be an issue if Lazlo were killed in Casablanca. Also, I think even the Catholic Church would have granted them an annulment, as Ilsa was a young child whose admiration and fascination for Lazlo were mistaken for love, insufficient grounds for a true marriage. Most importantly, Rick and Ilsa had a passionate love that perhaps few are privileged to experience. Just compare the scenes where Rick and Ilsa are together to the Lazlo-Ilsa scenes. R-I scenes are FAR more passionate. I don't even recall a kiss between L and I. Lazlo's passion is defeat of the Axis powers. His love for Ilsa, if he really loves her, is at best secondary to his love of his position with the résistance. So put Lazlo on the plane, let Rick sell the other transit ticket for a fortune, and let Rick and Ilsa live happily ever after. How? Wait for the sequel. And no one will feel sorry for Lazlo. He's embraced his passion. And now Rick and Ilsa  can embrace each other. Forever.\n\nLouis: Bill, I always suspected you were a sentimentalist at heart.",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had to watch it eventually. One of the best classic and iconic romantic films and the 16th Academy Award Best Picture winner in 1944. A film about hard times released in those same hard times. Inspiring and loving and it depicts one of the most famous \"anti-heros\" in film history.",
            "review_date": "2017-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good dialogue and excellent acting from Bogart, an excellent script and great cinematography make this an all-time classic, however, it can become very boring if one does not give it its full attention or does not understand the metaphors each character plays, a good film, but it can wear down on you if it's not your thing",
            "review_date": "2017-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is no doubt one of the greatest movies of all time! A very heartbreaking movie. I don't think romance has ever been done better and this film came out 76 years ago. The acting and directing are perfect. This is seriously a perfect film I can't find anything wrong with it. All the characters are all so great and enjoyable to watch. You could watch this film over and over and never be bored. A must see like I said one of the best if not the best of all time!",
            "review_date": "2017-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best fims of all time. Deep, emotional, heartbreaking; you just can't get enough of this movie.",
            "review_date": "2017-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We'll always have Paris.",
            "review_date": "2017-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who are the five percent who can't appreciate this movie?",
            "review_date": "2016-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The classic of classics.",
            "review_date": "2016-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having just watched Allied reminds me of Casablanca, an old classic I've seen a few times.\n\nCasablanca is a war romance movie featuring a love triangle, competition for a girl, and doing the \"right\" thing, set in World War II Nazi occupied Casablanca.\n\nIt features interesting character development all around, especially from strong leads Humphrey Bogart and Ingrid Bergman.\n\nThis movie is probably the gold standard of romantic movies from its era as well as an all time American classic.",
            "review_date": "2016-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies ever made. Great performances, superb dialogue and a great story. Trailer: https://youtu.be/52WGK1C6rRk",
            "review_date": "2016-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is timeless. For a movie from the era, the screenplay is oddly modern. It could almost have been written just a few years ago, as opposed to a few decades ago. \nClassic Bogart and Bergman performances put the icing on an excellent screen play. Add perfect directing and a great story... \nWhat is there not to love?",
            "review_date": "2016-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a timeless film managing to make nearly everyone who watches shed a tear. Heres looking at you kid.",
            "review_date": "2016-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a fantastic movie! The plot is gripping, the dialogue is a cacophony of wit, the acting of every single person on screen is outstanding, every scene is brilliantly set, lit and shot. My only complaint with this one is how parts of the female lead were written, they're obviously products of a more mysoginist time (Bergman to Bogart: \"I don't know what's right any longer, you have to think for both of us.\"). Other than these few slip ups, this is definitely one of the greatest movies ever made and it stands the test of time. If you haven't seen it, do yourself a favour with this one, it might be the beginning of a beautiful friendship.",
            "review_date": "2016-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless classic, and one of the best movies ever made, Casablanca stands the test of time, complete with great characters, great performances, great musical score, great cinematography, great camera work, and great directing. This is one of the greatest movies ever made, a sure classic and a definite must see.",
            "review_date": "2016-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story can be gripping but Casablanca is somewhat outdated for a modern audience.",
            "review_date": "2016-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes when you start up and old black and white movie, you grit your teeth and prepare to be mildly bored for an hour or two. Casablanca, however, gripped me right from the start, and I was glad to be reminded once again of the innumerable transcendent films I have yet to watch.",
            "review_date": "2016-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca warms the heart with an intense love story, exciting plot twists around every corner, and a touching ending. One of Bogie's many classics that we've all come to love.",
            "review_date": "2016-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great, timeless film.  This is a masterpiece in every way:  story, dialogue, acting, characters, lighting, music, pace.  Bogart and Bergman are brilliant, as is the entire cast.  And the film stays fresh even today with a special mix of devil-may care attitude and serious topics, both personal and political.  A monument.",
            "review_date": "2016-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For more you will miss these days the classic film, no doubt because of his great patriotic impetus rolled and passed in a war, this film worth remembering.",
            "review_date": "2016-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films if not THE greatest film of all time. Everything about this movie is perfect. Rick is probably the most well written character I've ever seen put on screen. Ilsa and Victor are also brilliantly written. The acting is fantastic, the writing is fantastic, the pacing is perfection, and you never know what will happen next. This film is should be seen by everyone.",
            "review_date": "2016-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cinema has an array of classics. One's that stand the test of time. I could go through so many such as The Godfather, Gone with the wind, Citizen Kane, Psycho among others but one that is one every list is Casablanca. This 1942 flick is one of the earliest films to feature superstar leads. Humphrey Bogart and Ingrid Bergman were some of Hollywood's elite, A listers to be exact. Here they star in a film that was incredible relevant to the times back then and proved to be a spectacularly well done feature.\n\tthe legendary actors play Rick Blaine (Bogart) and Ilsa Lund (Bergman) two lovers set in the backdrop of Casablanca, Morocco during World War II. Rick owns a nighclub in the city. Rick remains neutral to all war matters going on but however it's discovered he once was an arms dealer for Ethiopia during their war against Italy. Many Generals and politicians come by his place but the most surprising guest is his former lover Ilsa whom he still has feelings for. The two of them get caught up in major political/military scandal that will leave dire consequences for any involved.\nIt was seemingly ahead of its time in terms of filmmaking and story telling. Everything is on a serious scale. the acting is incredible here and the dialogue is so witty!. a trademark of the time but still really solid stuff. the music was really terrific.\nIngrid bergman was reeeeally gorgeous back then even though she was in black and white. she was fantastic here in this role Humphery bogart is amazing here as rick blaine. he is a real complex man in this role but also a smooth hard boiled one as well. very complex love story here between Ilsa and rick. \nMichael curtiz directing is textbook here. so many great shot angles and directing of the overall story and he does it at such a high level. only thing was I didn't know and still don't know what \"here's looking at you kid\" means. however I did like the \"I think this is the beginning of a beautiful friendship\" line.\nthis is a classic film and my favorite now of the 1940's",
            "review_date": "2016-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With all its famous quotations and the war-related story, Casablanca is a good romantic starter for film enthusiasts greatly led by Humphrey Bogart, aside than that, it is nothing else deeper.",
            "review_date": "2016-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful movie that leads to one eternally famous final scene.",
            "review_date": "2016-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the greatest romantic drama of all time!",
            "review_date": "2016-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is, of course, a masterpiece.",
            "review_date": "2016-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story that actually is kind of boring (probably because I didn't pay attention), old movies tend to drag on, which in some cases is good - but I just wasn't captivated by the characters. While I loved the relationship between Louis Renault and Rick, the other characters almost paled in comparison. I'll rewatch this movie another time.",
            "review_date": "2016-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't usually like romance movies but this movie has more than just romance. Its a classic and is probably the best WW2 era film out there. \"Here's to you kiddo\"",
            "review_date": "2016-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is much better than the place...",
            "review_date": "2016-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With such vivid performances of the leads, that inspired a generation of actors, the film is a true timeless classic!",
            "review_date": "2016-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Memorable movie with a memorable dialogue, overall a must see!",
            "review_date": "2016-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In terms of the greatest films of all time, Casablanca has it in spades.  It is so much stronger than Citizen Kane.  It is an absolute classic of the noir era, due to how strong it is stylistically and has given us some of the most memorable lines and moments in film history.  It can be easily interpreted as a propaganda film made to encourage the Americans to join the war.  Humphrey Bogart as Rick Blaine is brilliant as the reluctant hero.  The film itself has become iconic as a tale of redemption.  Unlike Citizen Kane, it has withstood the test of time.  In fact I would go further and say that Casablanca is timeless.\n\nRead my full review here: http://goo.gl/IQ9T6J",
            "review_date": "2016-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Romantic, funny, tragic, complex, colorful and wonderful. Who doesn't wish they could spend a long night at Rick's Café?",
            "review_date": "2016-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good actors+good director+good plot= a masterpiece",
            "review_date": "2016-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true classic of love and nationality.",
            "review_date": "2016-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply one of the finest films Hollywood has ever made. If you get the chance, also watch the 1998 featurette, You Must Remember This: A Tribute to Casablanca, included as a bonus on the DVD. This film makes you truly believe anything in cinema is possible. One of the grossly underrated Curtiz's masterpieces.",
            "review_date": "2016-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Classic Worth Remembering",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful, moving work, whose natural, character-driven story is made nearly-perfect by its magnificent leads and masterpiece of a screenplay.",
            "review_date": "2016-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Masterpiece. \"Here's looking at you, kid\"",
            "review_date": "2016-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Old School Hollywood",
            "review_date": "2016-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10 out of 10:\n\nWell acted, great story, and solid direction truly makes this a classic.",
            "review_date": "2016-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I sincerely have no clue why people like this film so much and think it's one of the best movies ever made, i just dont get it. There is nothing surprising, original or special to Casablanca, the script is good with certainly a couple of well-known good and bad quotes. (Here's Looking at You Kid, why the F is that even a quote?!...) The performance by Bogart is as always seemingly lazy and careless, which is not a good thing, Casablanca is no exception, and Bergman is fine, but nothing great either.\n\nEveryone has a canonical classic which they just don't get. This one is mine.",
            "review_date": "2016-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched it again the other night...still an amazing movie.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes it was a Oscar winner.",
            "review_date": "2016-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic. Terrific actors without exception (I wish Peter Lorre's role were longer). Great production. Incredible direction (look out for the montage of head profile shots at the end, at the airport - that is still striking after all these years). Unsurpassed screenplay (maybe it glosses over developments too quickly, which is why I subtracted half a star).Bogart holds it all together and was never better. Set in Dec.1941 and released in 1942, just as America entered the war, yet it seems to capture wartime perfectly. It captures that combination of tension, desperation, romance and sacrifice magnificently. \nOnly other criticism is a personal dislike of music being used too obviously to manipulate the audience's response. I noticed it at times.\nSPOILER ALERT why I wrote that it glosses over developments too quickly, is that I felt Rick's change of conviction is rushed, as is Ilsa's acceptance of Rick's decision that he is staying in Casablanca and she has to go with Laszlo. I find it hard to believe she would have been comfortable leaving it up to Rick to tell her husband she was leaving him. And her decision not to meet him at the train station in Paris (after she learns her husband is still alive) because she believed Rick wouldn't leave Paris without her - well, to be kind to her I guess she believed Rick would get over her in time and didn't need to know she was married  (I realise Laszlo wanted to keep their marriage a secret to protect her but I think Rick in the circumstances could have been told).. I criticise how the screenplay provides character motivation at times, but because the movie never loses tension the screenplay masterfully hides any failures.\n It all passes in a whirl and the movie is over before you know it. \nMaybe I should give it a 5!\nP.S. Only reference to Hitler is a portrait in Strasser's office and he is never mentioned in the film at all\nAn interesting approach to the film is to look at it as Rick's ultimate revenge on Ilsa for deserting him in Paris. He really deserts her at the end, she has no choice but to go with Laszlo. Rick could have got a letter of transit from Ferrari at the Blue Parrott - Ferrari had offered one to Laszlo and Ilsa but they had turned it down because they wanted to leave together. It seems incredible looking back that Ilsa was willing to leave her husband behind in Casablanca to fly off to Lisbon with Rick. And it was really only Rick who forced her hand to leave with her husband.",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies in the history of cinema.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "May be it is too old to watch again !!",
            "review_date": "2016-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much has been written of this, simply one of the best movies ever made.  Quite possibly the most perfect ending ever put on film.",
            "review_date": "2016-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bogart and Bergman.  This is arguably the epitome of Bogart flicks.  The story is timeless, as star-crossed lovers bump into each other in Morocco during Nazi occupation, and old feelings cannot be suppressed.  Bogart is the good guy and makes the ultimate sacrifice for the love of his life.\n\nAnd please, its fascinating that \"Play it again, Sam\" has become one of the most misquoted lines in history...it's \"PLAY IT, SAM\"!!!",
            "review_date": "2016-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bogart is cold, but brilliant. The music, plot and acting are all superb = 5* \"here's looking at you kid\"",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is a excellent but a smiege bad. The imagery is on spot. The setting was surprising before it didn't where the set was shot. The whole time I thought it was really in Casablanca. The sound was very off the seat. It felt awkward without the color but it went with the story. The favorite character I liked is Rick. He was a good character, when he did the right thing but did wrong actions against others. The smiege was the color quality. It would have been a better movie if it was in color.",
            "review_date": "2016-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great war romance movie and just one of the best ever.",
            "review_date": "2016-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The real meaning of Humphrey Bogart www.tinyurl.com/z5a5vgg",
            "review_date": "2016-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watched this for the first time and was very impressed. Particularly loved the snappy dialogue.",
            "review_date": "2016-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect movie and romance for the ages.",
            "review_date": "2015-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well I understand the reasons this is listed as a quintessential classical of all time cinema, I found the story shies in comparison to the actual filmmaking itself. It's long tracking shots and intelligent pans make this films photography a unique installation to the world of film as opposed to what could have been a simple old love drama. 4.5 stars out of 5.",
            "review_date": "2015-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far one of the best movies I have seen, it is a true classic.",
            "review_date": "2015-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest movie ever, except perhaps Gone with the Wind. I've watched again and again, The only movie I've ever watch multiple times is Clint Eastwood's Unforgiven.",
            "review_date": "2015-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casablanca. I know, people are crazy about this movie. But for me, it was only an above average movie. The plot, the performances,the cinemantography, the war time backdrop was all average for me. I could be resisting give its deserved due because of the entire hullabaloo around this movie. But I will give it credit for its progressive love plot. I would have loved to dwell profoundness of the choice IIsa had to make. But the movie did not give time for that.\n\nDisclaimer: I am only a novice reviewer. And as they say only a genius can recognize a genius.",
            "review_date": "2015-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "classic movie nice plots not bad if you're in the mood for classic",
            "review_date": "2015-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece of acting and the written word, Casablanca is a testament to what romance - and film - should be.",
            "review_date": "2015-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the greatest all round film of all time.",
            "review_date": "2015-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an unnecessary review, but heck since I got a chance to see it at the Disney Concert Hall with the LA Philharmonic playing Max Steiner's iconic score- live! Watching it 75 years later, it still strikes me as a real, gripping and emotional love story with characters I care about. Also the dialogue is so sharp and witty!",
            "review_date": "2015-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am clearly biased towards this movie, since it is my absolute favourite of all time. Yet it is a masterpiece in every meaning of the word; it is more than a film. Every line drips of pure epic and suaveness, and with my personal hero Bogey at the helm this ship always brings me safely back to land.",
            "review_date": "2015-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic in all ways.",
            "review_date": "2015-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Freud once said: \"Sometimes a cigar is just a cigar\" For Bogart, lighting a cigarette is an opportunity for his face to go through all manner of facial gesticulations whose meanings are a mystery to me. Fortunately, in Casablanca Bogart has turned down a little the frothing at the mouth, rabid dog, acting style that he used to bulldoze his way to the top of the Hollywood heap. I do not think Casablanca is the bench mark movie that most people think it is. My interest in it was purely as it is a historical record of movie making in the '30's and '40's. Bogart isn't alone in the bad acting field here, there's Ingrid Bergman, Lauren Bacall, Sydney Greenstreet, the list goes on and on of horrible film performances. I don't think any serious playwright ever tried to recruit any of these actresses and actors to appear in their plays, not because of their unapproachability but because of their unsuitability.That pretty much says it all.",
            "review_date": "2015-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the beginning of a beautiful friendship",
            "review_date": "2015-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 3rd time watching this and it is still a masterpiece! Overall Grade: A+ (10/10)",
            "review_date": "2015-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't stand this film. Had to watch it in high school, and I had to watch it again college. My opinion hasn't changed. Casablanca sits at second place on my most hated films list.",
            "review_date": "2015-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a perfect balance of contemporary drama, romance, and smart political subtext, this is an age-proven landmark for noir Hollywood classics.",
            "review_date": "2015-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Espoo Cine 2015-side show.\nCasablanca. Seen so many times, now decided to quickly rush to dinner before kitchen closed at 23. Enjoyed casablanca sounds from behind the screen on my hotel room balcony and my bed. We'll always have Paris!",
            "review_date": "2015-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of course, \"Casablanca\" is a classic! It is one of the greatest, most iconic films of all time! The film has a great script, a great story, great actors, and masters so many genres! It is a great comedy, drama, war film, film noir, etc.",
            "review_date": "2015-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterpiece. Lighting, music, acting, fluency everything about this movie is excellent.",
            "review_date": "2015-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the few movies that proves it is possible to make a feature film that is perfect, one that does not have a single flaw. So many career-defining performances in one movie.",
            "review_date": "2015-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that was perhaps more compelling at the time of its release than now, \"Casablanca\" is nevertheless one of the most endearing WWII love stories in film.",
            "review_date": "2015-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unique war-romance film with a great duo and boasting themes. It serves to fine and memorable film.",
            "review_date": "2015-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful black and white classic made over 70 years ago. Like a broken record, the tune of \"As time goes by\" will replay over and over again in your mind after the film has ended. Screen legend Ingrid Bergman was young beautiful and so talented in the film that she would definitely leave an indelible impression on us viewers. Humphrey acts well as the alpha male leading role but he was not handsome enough for Ingrid, in my opinion. Someone like Marlon Brando or Dirk Bogarde or Clark Gable would have been the perfect pairing with Ingrid.",
            "review_date": "2015-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The song of \"As time goes by ( A kiss is just a kiss)\" will replay over and over again in your mind by the time this classic film finishes. Also the gorgeous young beautiful and most of all talented Ingrid Bergman will leave a deep impression. Humphrey Bogart was ok as a alpha male but just not handsome enough to kiss gorgeous Ingrid Bergman. Someone like Marlon Brando or Clark Gable would be ideal.",
            "review_date": "2015-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect movie. Bogart is tremendous and so is the supporting cast. With great sparking dialogue its a film you can watch again and again.",
            "review_date": "2015-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gorgeous cinematography, haunting visuals, masterclass performances and incredible lines makes this an absolute classic.\nAnd for good reason. One of the greatest films of all time. Humphrey Bogart is an absolute revelation. The settings are lush and beautiful and the romance never cheesy but crudely real. A funny movie with no laughs. A sad movie with no tears.",
            "review_date": "2015-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sIMPLY PUT, THE GREATEST aMERICAN MOVIE EVER MADE.  pERIOD.",
            "review_date": "2015-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Of all the gin joints, in all the towns, in all the world, she walks into mine.\"\n\nThis is another personal favorite of mine and perhaps one of the most quotable classic films of all time. Directed by Michael Curtiz, Casablanca takes place during the early days of World War II in French Morocco where many European refugees were searching for a way to escape to the Americas and evade Nazi control. In Casablanca we are quickly introduced to the owner of a nightclub, an American expatriate named Rick Blaine (Humphrey Bogart). Rick is a bitter and cynical man who has decided to look out for himself and offer his clients a good time at his club. But when a man shows up and gives Rick a couple of transit letters that will allow the holder of these papers to travel freely through Europe in order to escape to the United States from Lisbon, they know they can make a lot of money by finding the right buyer. A married couple show up at Rick's bar to buy the letters and this is where we discover why Rick is so bitter. Victor's (Paul Henreid) wife Ilsa (Ingrid Bergman), had met Rick in Paris a while back when she thought her husband, a resistance leader, had been killed during the War. The two had an affair, but when Ilsa discovered that Victor was alive and that he had escaped the Nazi concentration camp where he was held she leaves Rick without giving him any explanation. Rick has never been able to get over the betrayal and seeing her at his joint with her husband makes him even more bitter. And so the adventure begins as Rick must decide if he wants to help Victor and Ilsa escape from the Nazis or if he should simply look the other way. Claude Rains has a supporting role as a corrupt French official while Conrad Veldt plays a Nazi Major.\n\nToday we all praise the screenwriters for this film, but there was much skepticism during filming. Neither Bergman nor Bogart thought it was any good and some claim that they didn't want to work together. I don't think Michael Curtiz ever imagined this film would become such a beloved classic either, but somehow the film clicked in all cylinders and the story has stuck with audiences ever since. The on screen chemistry between Bogart and Bergman is the main reason why the romance works so well and the scenes they ask Sam to play their song on his piano is memorable. It's the best romantic film of all time in my opinion because it has it all: romance, betrayal, and sacrificial love. There are so many beloved quotes in this film and it only gets better over time. The ending is also one of the best in any movie and one of the reasons why so many consider this such a revered classic, but I can point out several other emotional moments such as the scene where Sam is ordered to play a German patriotic song for the Nazi soldiers in the bar, only to have Victor respond by asking the band leader to play La Marseillaise and drown out the song from the Germans. Even the revelation scene where we get flashbacks of Rick and Ilsa's affair and discover how she never meets up with him at the train station and instead he's handed a farewell note from her, is quite emotionally engaging. The film offers plenty of thrilling scenes as well for those that aren't interested in the romance so there is no excuse for anyone not to see this classic. In case you forget how brilliant the screenplay is let me just remind you of some of the best quotes in this movie.\n\n\"Louie, I think this is the beginning of a beautiful friendship.\"\n\"If that plane leaves the ground and you're not with him, you'll regret it. Maybe not today. Maybe not tomorrow, but soon and for the rest of your life.\"\n\"We'll always have Paris.\"\n\"Here's looking at you kid.\"\n\"Play it, Sam. Play \"As Time Goes By.\"\"\n\"I remember every detail. The Germans wore gray, you wore blue.\"\n\"Alright, I'll make it easier for you- Go ahead and shoot. You'll be doing me a favor.\"\n\"Round up the usual suspects.\"\n\"Mostly I remember the last one. The wow finish. A guy standing on a station platform in the rain with a comical look in his face because his insides have been kicked out.\"\n\"It doesn't take much to see that the problems of three little people don't amount to a hill of beans in this crazy world\"\n\nhttp://estebueno10.blogspot.com/",
            "review_date": "2015-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like it, but after that baggage of expectations about it being one of the greatest movies ever, I was underwhelmed.",
            "review_date": "2015-06-17",
            "source": "rt",
            "lang": "en"
        }
    ]
}