{
    "rating": 8.9,
    "release_date": "1943-01-01",
    "num_reviews": 410,
    "genres": [
        "Crime",
        "Drama",
        "Mystery&thriller"
    ],
    "summary": "Uncle Charlie (Joseph Cotten) visits his relatives in Santa Rosa. He is a very charming man, but his niece slowly realizes that he is wanted for murder and he soon recognizes her suspicions. Although one of the suspected murderers is killed and the case is considered closed, she still has her suspicions.",
    "reviews": [
        {
            "content": "If one allows for an interpretation of this tale: This is a story rich in morals.\nOne, is that the truth must out- no matter the feelings or reactions of others: By considering her mothers emotions and close attachment to the character of Charlie senior, Charlie (junior), put her own life at risk. As authentic as she remained to the change in her feelings toward her uncle, she still did not take her authentic intuition to its rightful conclusion, and this may have cost her her life, yet again.\nOne could think of a parallel in real life, as so often happens in the case of childhood abuse. Where the uncle abuses the sweet, innocent and trusting niece, and instead of reporting the incident, the child would keep the news of her abuse to herself for fear of ruining the image of the \"happy, normal family.\" The motif of the \"normal happy family\" was played out most strongly by the mother (sister of Charlie senior)..another case where the mother remains clueless as to what is really going down in her very own household, and blinded by her admiration for her mysterious brother (she does not even know what his real occupation is)- she overrides her own instincts. Or something like that. This interpretation is my own and one does not need any interpretation to simply enjoy this early Hitchcock thriller, filled with tension, dark foreboding and excellent performances by both Charlies.",
            "review_date": "2023-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My English favourite director,  Alfred Hitchcock with good writers, Thornton Wilder, Sally Benson, and Alma Reville of Shadow of a Doubt, 1943 American psychological thriller motion picture...and excellent story by Gordon McDonell...\n\nScripts are out of your expectation with extra ordinary endings by Teresa Wright and Joseph Cotten...",
            "review_date": "2023-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "⭐️⭐️⭐️⭐️\n\n\"Shadow of a doubt\" was directed by The master of suspense Alfred Hitchcock about a down to earth all American family that gets a visit by the mother of the families brother also known by uncle Charlie played by Joseph Cotten. the whole family loves and adores him especially his niece Charlie played by Teresa Wright, but something is rotten about uncle Charlie and soon his niece will find out.   \n\"Shadow of a doubt\" is fantastically acted by Joseph Cotten and Teresa Wright, and the suspense and tension that builds and builds all the way to the third act could not have been directed any better then by the great Alfred Hitchcock. The beautiful sweeping landscapes of Santa Rosa California along with dramatic musical score makes \"Shadow of a doubt\" a true classic.",
            "review_date": "2022-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a slow burner of a film - the plot development gets quite good towards the end. there is a certain plausability about it, which is a little spooky I suppose. Its a typical film noir film, with frustratingly over the top incidental music at times but I liked the character development and as a Hitchcock film, it's not bad, particularly with the plot twists but its not entirely gripping I suppose. It's not a bad film and so I'd recommend it, yes.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely disappointing.",
            "review_date": "2022-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Contains all the hallmarks of a good Hitchcock and some fine performances, especially from Joseph Cotton.",
            "review_date": "2022-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Shadow of a doubt\" was directed by The master of suspense Alfred Hitchcock about a down to earth all American family that gets a visit by the mother of the families brother also known by uncle Charlie played by Joseph Cotten. the whole family loves and adores him especially his niece Charlie played by Teresa Wright, but something is rotten about uncle Charlie and soon his niece will find out.   \n\n\"Shadow of a doubt\" is fantastically acted by Joseph Cotten and Teresa Wright, and the suspense and tension that builds and builds all the way to the third act could not have been directed any better then by the great Alfred Hitchcock. The beautiful sweeping landscapes of Santa Rosa California along with dramatic musical score makes \"Shadow of a doubt\" a true classic.",
            "review_date": "2021-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Note the classic Hitchcock sadism. Gotta love it. In all seriousness the plot of this movie is a bit dry and cookie cutter in the thriller genre. But that is mostly redeemed by the great acting by Cotten and Wright.\nI thought the uncle/niece relationship in this movie was sort of hinting at something a bit romantic, which I think was very creepy and added to the fact that Cotten's character was seriously manipulative.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Alfred Hitchcock's best!",
            "review_date": "2021-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Forget Jimmy Stewart in Vertigo or Cary Grant in North By Northwest, Joseph Cotten as Uncle Charlie is the best lead male performance in any Hitchcock film.\n\nIf like me your introduction to Joseph Cotten was his portrayal of the likeable Jedediah in Citizen Kane, it is a shock to the system to see him not long after as the charming yet psychotic Uncle Charlie.\n\nHitchcock's favourite of his films and it's easy to see why. It's a wonderfully dark tale about murder, how evil lives next door and the naivety and complacency of the human race.\n\nCotten is ably supported by the fabulous Teresa Wright. The duality and curious nature of their characters' relationship never fails to entrance me every time I watch this film. \n\nI cannot recommend this enough. As one film critic says \"if you don't know Shadow of a Doubt you don't know him (Hitchcock) actually\". I would say alongside Rear Window and North By Northwest it is one of his most Hitchcockian films.\n\nIn all of Hitchcock's works I would only rate Vertigo and Rear Window above Shadow of a Doubt and it's one that deserves to be higher on the list of his best ever films.",
            "review_date": "2021-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Got to say, not one of my highest rated Hitchcock films. \"Shadow of a Doubt\" starts off promising with Joseph Cotten playing Charlie Oakley laying on bed in some seedy boarding house on the East Coast. Then, the landlady lets him know two men are looking for him. Next you know, Cotten is out West in Santa Rosa visiting his sister and her family, one being his niece Charlie (Theresa Wright). The movie starts and continues great with a good mix of humor and suspense. But, once the reveal is made, it kind of goes down hill from there, even getting a little preposterous at times. Overall, an ok film that will keep you entertained.",
            "review_date": "2021-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shadow of a Doubt is definitely a must see film from Alfred Hithcock. While there may not be as much suspense and tension as you will see in other Hitcock films, the plot is engaging with a physcological battle bettwen Charlie and Uncle Charlie. The character change in Uncle Charlie as the film progresses, from a loving uncle to a murderous individual, is done swimmingly. Upon seeing the film for the first time, the climax was unexpected.",
            "review_date": "2021-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Cotten is suitably creepy, but unusually for a Hitchcock film there aren't many suspenseful moments.  The ending is a little too convenient as well.  Not one of Hitchcock's best.",
            "review_date": "2021-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty solid psychological thriller that reminds me of, what has macabrely fascinated me since I can remember, the more recent real life occurrences where a family member discover their seemingly \"normal\" relation is living a double life as a monster. No surprise Hitchcock recognized and tapped into the horrific implications of this family member being forced to acknowledge the suspicions that, because of familial love, they are naturally attempting every logistical process to internally dismiss. 7.5/10",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as I'd expected a bit over rated to be honest",
            "review_date": "2020-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do you like your Hitchcock antagonists to be maniacal (Strangers on a Train) or methodical, incrementally malevolent? If it's the latter, Shadow of a Doubt may be the definitive film in the director's portfolio for you. It's a suspenseful crawl as the audience realizes the extent of the adversary's maliciousness (whose insidious nature is hinted at, but not explicitly confirmed until further in the film), and the naïveté of the unsuspecting family as Wright's Charlie recognizes their plight and must contend with it despite the disbelief of those around her. Personally, I think that other films by the master outstrip this one in terms of quality, and thus can't agree that Shadow of a Doubt is his greatest accomplishment, but recognize the quality, style, and complete nature of the film. (4.5/5)",
            "review_date": "2020-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great Hitchcock film with well developed characters and an intriguing plot. An early classic that sets the stage for future masterpieces from the master of suspense.",
            "review_date": "2020-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On the surface, it seems to be only a Hitchcock thriller like many others. But in detail, it is actually a complex melodrama that deals with morality and that conveys a very cynical view about society. Hitchcock begins the story by showing us a pathetic American family in an irrelevant town in California. But as the story develops, we understand better the characters as well as Hitchcock's objective. This movie is about 78 years old, but it is amazing how the tension moments still hold up thanks to Cotten's and Wright's performances, and also to the fantastic camerawork. We can realize that the girl is actually in love with her uncle. And all of a sudden, her dream-like life in a peaceful town becomes a nightmare. Young Charlie's love for her uncle turns into hate. And to keep a \"clean image\" of a murderer, she must also keep the appearences by dealing with a deep love feeling and a moral conflict. This is a very contemporary critic about society, so relevant today as it was then. Arguably one of Hitch's best features despite Macdonald Carey's performance which I find kind of flat.",
            "review_date": "2020-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock's personal favorite, Shadow of a Doubt is a highly enthralling thriller that keeps the tension running until the last minutes in a breathless climax.",
            "review_date": "2020-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful film, fantastic performances, however, I wish the ending had been different and that ist wasn't Charlie who was the killer, but the cat and mouse style works well, And the acting is superb.",
            "review_date": "2020-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3.8, it may not be as thrilling as it might have been perceived then, but it is certainly as watchable, and maybe even more family friendly, as Hitchcock's classics the birds and psycho, the only other two of which I've seen of him.",
            "review_date": "2020-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never-mind the minor inconsistencies, this is Hitchcock at his finest. He demonstrates that making films is about entertaining and stimulating the mind, which he does masterfully here through a deep dive into character psyche, a look into the dark charm of danger and criminality, and a conflict of morality that goes beyond right or wrong. Crazy how he brings out such complexities out of such simple stories.",
            "review_date": "2020-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected more than dramatic music to increase the tension, questionable acting, and weak conclusion.  Perhaps I am just not fond of very old movies.  Old, meaning about my age, ha.",
            "review_date": "2019-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film takes a while to get to the point, but the last thirty minutes is where the fun starts to begin, and boy is it amazing.\n\nGrade: B",
            "review_date": "2019-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shadow of a Doubt is a very underrated Hitchcock classic and deserves much more attention than it gets.",
            "review_date": "2019-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An early shining example of Alfred Hitchcock's directorial genius!\n\nAlfred Hitchcock's suspense thriller Shadow of a Doubt (1943) is a visceral and frightening depiction of a mass murderer on the run. Hitchcock draws out your fear for this small California town family's safety as they attempt to survive Uncle Charlie, who they do not even know is a serial killer. Hitchcock uses his signature long panning shots of stairs, doors, streets, as well as close-ups on faces for maximum effectiveness. Hitchcock simply understands what we are afraid of and exploits it in Shadow of a Doubt for tense encounters between a killer uncle and his astute niece.\n\nThe black and white cinematography is lush with beauty. From waltzers spinning in circles to a dutch angle shot of the unnerved killer fearing his capture and many more clever shots. I adore Joseph A. Valentine's cinematography in the library as young Charlie reads the newspaper clipping that reveals the plot. As young Charlie discovers who her uncle is the camera smoothly zooms out to a high aerial shot indoors with dark moody lighting for a haunting reveal. Shadow of a Doubt is full of neat and expressive shots.\n\nDimitri Tiomkin's score is scary as it swells for the dramatic sequences and carries you away with lovely passages for the sweeter moments. Tiomkin finds serenity in the quiet family moments and builds a crescendo of fear during the climactic sequences. I love Shadow of a Doubt's music.\n\nI adore Teresa Wright as young Charlotte \"Charlie\" Newton. She is so astute, nearing on clairvoyant, which gives her character a maturity and wisdom beyond her years. She is a subtle hero of her tough circumstances. Wright plays Charlie with a fierce determination and willful certainty. Teresa Wright acts pound for pound alongside Joseph Cotton at the heights of his acting prowess in a magnificent display as an actress.\n\nJoseph Cotton demonstrates his range in Shadow of a Doubt as the widow murderer Charles \"Uncle Charlie\" Oakley. Cotton sheds his nice guy persona from all his other classic films like Citizen Kane, The Magnificent Ambersons, or The Third Man. Cotton's warm demeanor and delightful voice are nowhere to be found in Shadow of a Doubt as he opts to play Charlie as a cold deadpan killer with a silent menace and an obvious distaste for humanity. Cotton's hyper focused and highly nuanced villain is one for the ages. His constant pleasant attitude towards his family is so under-handed as he reveals his inner rage to his unsuspecting niece. It's honestly shocking every time I witness Joseph Cotton's transformation from the calm voice of reason to the monotone monster at the center of Shadow of a Doubt. Joseph Cotton is surely one of cinema's greatest antagonists in Shadow of a Doubt.\n\nHenry Travers is splendid as Joseph Newton, the kindly father to young Charlie, with his funny obsession with murder mysteries alongside his quaint friend Hume Cronyn as Herbie. They give a lot of much appreciated comedy relief from the super tense sequences within Shadow of a Doubt.\n\nLikewise, Patricia Collinge is devastating as Charlie's tired and lonely mother Emma Newton. Her desperation for her younger brother Uncle Charlie to stay with her is really saddening and upsetting. On the other hand, Edna May Wonacott is hilarious and endearing as Ann Newton. Her bright remarks are always a fun reprieve to the suspense in Shadow of a Doubt. Similarly, Charles Bates is a charming young son Roger Newton.\n\nOverall, Shadow of a Doubt elevates Hitchcock's masterful direction with all time great performances. I cannot recommend Shadow of a Doubt enough!",
            "review_date": "2019-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific movie that needs to be watched again.",
            "review_date": "2019-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A certain then-famous plot device has since grown out of touch with modern culture (actually, a lot this movie has), but considering what he had, Hitchcock definitely continued his knack for a solid story, chilling drama and eye for suspenseful cinematography going into the Hollywood scene.",
            "review_date": "2018-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story of Shadow of a Doubt kept me on the edge of my seat, but I had a hard time accepting some of the actions (and reactions) of the characters. It also seemed to play its hand a little too early, and the big reveal didn't feel as shocking. Teresa Wright makes a wonderful protagonist, though, and I may never trust Joseph Cotten in any other role now.",
            "review_date": "2018-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Shadow of a Doubt' is a masterpiece.\nIt continues to be well understood and enjoyed in both the present and the future because of its smart characters and script. I'm not exaggerating, this film is home to, quite possibly, the smartest female lead character at the time of its release.\nThis is just one of many parts that make 'Shadow of a Doubt' so brilliant because when all is said and done, this film was a game changer. \nMany Thrillers since have been inspired by its modern writing, pacing, and cinematography. It is such a pleasure to watch these film elements unfold because I had fun comparing some scenes from the film with the future films it inspired.\nWhenever Hitchcock was asked in interviews, 'What is your favorite film from your filmography?' His response was \"Shadow of a Doubt\". It was certainly a damn fine choice.",
            "review_date": "2018-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chilling and tense, 'Shadow of a Doubt' is a simple story that is brilliantly told by Hitchcock who makes wonderful use of the surroundings in a quaint, little part of California. The way the doubt creeps up one of the characters and the world closes in on the family is superbly done and keeps you riveted. Despite the audience being clued in on what's going on too early, it's still a great thriller that is undoubtedly up there with Hitch's better films.",
            "review_date": "2018-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shadow of a doubt has to be one of my favourite Hitchcockian thrillers. A tense psychological thriller about how a family is visited by the uncle and the young girl's lingering suspicion on his past. It moves slow and steady but builds up the pace and will enthrall you by the time it reaches the end.",
            "review_date": "2018-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely more like Hitchcock. I'd say Rebecca and Shadow of a Doubt are the films that really set the pace and style for his later, and most revered, work.",
            "review_date": "2017-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A suspenful character piece from the masterful Hitchcock.",
            "review_date": "2017-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie isn't concerned about being a who done it, but rather how you would react and deal with somebody you once loved. An often overlooked Hitchcock masterpiece.",
            "review_date": "2017-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Cotten was terrific in this. Almost tied with Rear Window as my fav Hitchcock flick",
            "review_date": "2017-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love movies that make me feel the entire spectrum of emotion. One scene I'm laughing out loud; the next, I'm biting my fingernails with anticipation.",
            "review_date": "2017-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my list for 5 Greatest Films of All Time.",
            "review_date": "2017-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a few holes in this hitchcock plot, but entertaining. May have been his favorite, but doesn't stand the test of time",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considered by Alfred Hitchcock himself as his most favorite film & upon revisiting this gem after a good decade it's undeniably terrific.\n\nThe story of a typical teenage girl Charlie who is bored with life & wants to connect with her Uncle Charlie who makes his way to her town.\n\nAt first Charlie is loving his company but slowly but surely his character begins to show & she unravels a horrific past identity. True in Hitchcock fashion visually stunning, a must see Early American Hitch.",
            "review_date": "2017-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A seldom seen classic. Definitely one of Alfred Hitchcock's best and his personal favorite. A must see for any serious film fan. Joseph Cotton gives another great performance.",
            "review_date": "2017-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Newton family of Santa Rosa California receive an unexpected visit from their Uncle Charlie.  He lives in Philadelphia and is a bit of a legend in the family, being a wealthy, self-made man.  His niece, also named Charlie, is particularly fond of him.  However, when he arrives, Uncle Charlie starts to act suspiciously.  Soon two surveyors appear at the house and start to ask questions about Uncle Charlie.  (Niece) Charlie starts to investigate and discovers that the two men are detectives and Uncle Charlie is a suspect in a nationwide manhunt and murder investigation.  However, the closer she gets to the truth, the more her own life is potentially in danger.\n\nA reasonably intriguing Alfred Hitchcock crime drama.  In typical Hitchcock fashion it unfolds slowly and deliberately, incrementally revealing just enough to keep you watching, while building up to a tense climax.\n\nNot among Hitchcock's best though.  The build-up is perhaps too slow here.  In addition, despite the title, there is not really that much doubt about whether Uncle Charlie is involved in the crimes, so the possibilities with regard to the outcome are limited.  The conclusion thus feels a touch inevitable, though there are a few other ways it could have gone (however, none of these would have been as exciting or complete).",
            "review_date": "2017-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock said this was his favorite film, and there is a quiet evil about it that makes it truly horrifying.  Uncle Charlie (Joseph Cotten) is on the run from the law on the East Coast, and he settles in with his sister and her family in Santa Rosa.  Trouble is just behind him though, and it gets worse when his niece (also 'Charlie', named after him, and played by Teresa Wright) begins to suspect him of being the \"Merry Widow Murderer\".  \n\nI considered a slightly higher rating, but thought the pace in the first half of the movie was a little slow.  Some of the tension is also missing because we're pretty darn sure Uncle Charlie is guilty.  On the other hand, there is a real small town feeling to this setting, helped in no doubt by Thornton Wilder being one of the screenwriters, and the characters of Charlie's father (Henry Travers) and his friend (Hume Cronyn) passing the time by talking about the perfect murder are absolutely priceless.  The second half, including the increasing revelation of Uncle Charlie's dark views of humanity and the lengths to which he will go to protect himself, is what make the film so sinister.   As the movie came out during WWII, it seems to have a direct parallel to the evil leaders loose in the world, particularly in the film's final scene.",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9.5 out of 10:\n\nIntense and well acted, Shadow of a Doubt's story proves that even the most peaceful places can become dangerous.",
            "review_date": "2017-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "7.3/10, my review: http://wp.me/p1eXom-2Df",
            "review_date": "2016-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "However preposterous this film may be, Alfred Hitchcock's \"Shadow of a Doubt\" is a tense, competent thriller.",
            "review_date": "2016-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While slightly overrated, Shadow of A Doubt just screams (pun intended) classic! I'll probably give this film five stars upon second viewing.",
            "review_date": "2016-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I give this an A+/97.",
            "review_date": "2016-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Featuring a seriously incestuous vibe from beginning to end, Alfred Hitchcock's classic film Shadow of a Doubt is a fantastic noirish crime thriller. Featuring all of Hitchock's trademarks, namely his phenomenal use of suspense and mystery, as well as his willingness to keep his characters and audience entirely in the dark, Shadow of a Doubt is a true winner. Featuring a very strong female lead in Teresa Wright, Shadow of a Doubt is oddly feminist even if some dialogue is incredibly sexist (though these characters do not leave unscathed). The writing and overall look here can look quite dated by today's standards, but Hitchcock's wit and style will forever be timeless and it is on full display here with this spellbinding tale of murder.",
            "review_date": "2016-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A goodun. Though I have issues with some of the plotting. Starts off so tremendously strong though. And never really gets 'bad' per se. Just gets a little Hitchcock eye roll-y. Some of the ways the characters behave, it's like come on, no. But yeah, it's good. I like Trouble With Harry better though because it's like, Hitchcock having gained a Todd Solondz-esque awareness of his own silly shit like that. I like how tongue-in-cheek that one is. Oh, have I mentioned that I want to marry Teresa Wright?",
            "review_date": "2016-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The title's doubt grows in us much before it is planted inside the character's mind halfway through this superbly-written story, which is a testament to how this tense, suspenseful mystery is slowly and carefully built in what is one of Hitchcock's most steadily-paced thrillers.",
            "review_date": "2016-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was Hitchcock's personal favourite?? Okay then.",
            "review_date": "2016-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock's personal favourite film has none of the showiness of his more popular classics. It is a finely told coming-of-age story of a young woman in a moral dilemma when she discovers immense adoration and unimaginable menace can emanate from the same person.",
            "review_date": "2016-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shot on location, Shadow of a Doubt showcases Hitchcock's mastery of suspense, selective angles and mysterious characters. Added to this is a surprising amount of humour and a charming insight into small-town America. An unmissable classic!",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the script and storyline were thoroughly thought out, uncle Charlie's character wasn't. If uncle Charlie would've been represented as a killer with a deeper meaning behind his murders, and if it would've been explained why he dislikes wealthy women so much (instead of just hating them out of the blue), AND if young Charlie showed more grief after killing him, then I would have given 'Shadow of a doubt' a full on 5 star rating, since the acting and storytelling is beautifully done.",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thrilling movie that don't need a crazy AF villain as movie nowadays.",
            "review_date": "2015-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A noir by Alfred Hitchcock, \"Shadow of a Doubt\" is one of the iconic director's greatest films.",
            "review_date": "2015-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A genuine classic of Hitchcock's when putting suspicious suspense within the family circle that brings little thrills and strengthening power, but the stubborn and weak behavior brought this down below the master of suspense's standards to an average-valued film. (B)\n\n(Full review coming soon - with better wording probably)",
            "review_date": "2015-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated Hitchcock thriller with excellent performances from the entire cast including Joseph Cotten as a psychopath, Teresa Wright as the niece that grows suspicious of her uncle.\n\nThe film fascinates throughout, but critics seems to overlook a number of plot imperfections that give me much more than a shadow of a doubt that this is Hitchcock's most brilliant film as some critics contend. \n\nStill worth the look especially for the staging of certain scenes between Cotten and Wright.",
            "review_date": "2015-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "71%\nSaw this on 28/6/15\nWhat's most disappointing is to know that this dim and predictable film was Hitchcock's personal favourite. Teresa Wright gives a meaningful performance, but like all the other old Hollywood films, this one too is diminished by the fact that they all end with a predictable happy end and good triumphs over evil. This is not a serial killer film like Psycho or Frenzy, it's more like a drama from Hitchcock. It's well acted and marginally enjoyable, but I could never really get into it.",
            "review_date": "2015-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you enjoy suspense and enjoy character development &  bending plot lines,Here is a movie that the first time watcher will thrill to Hitchcock wicked adaptation of a small towns, post war innocence and peaceful  neighborhood  undoing.A must see , w/o a loose end in a film can start to finish.So   well wrapped , It may just leave you breathless .And wanting to watch again in the future if your anything like this Hitchcock devotee.",
            "review_date": "2015-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorite Hitchcocks",
            "review_date": "2015-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Known As Hitchcock's Favorite Film, Shadow Of A Doubt Is A Excellently Made Mystery Drama. Uncle Charlie (Joseph Cotton) Is In Town, For A Seemingly Innocent Visit. His Niece (Teresa Wright), Has Noticed Suspicious Behavior. When 2 Undercover Cops Approach Her However, The Audience Are Left Guessing To The End If Uncle Charlie Is A Murderer. Hitchcock Builds Up Great Atmosphere & Suspense (As Most Of His Films Do). The Film Has Talented Writers, Excellent Cinematography & Excellent Editing, Which Helps Add The Elements Of Suspense Effectively. The Film Was Scored By Dimitri Tiomkin, In His First Collaboration With Hitchcock (The Others Being Strangers On A Train, I Confess & Dial M For Murder). In His Score, Tiomkin Samples The Famous Merry Widow Waltz By Franz Lehar, Often In Distorted Forms As A Leitmotif For Uncle Charlie & His Serial Murders.",
            "review_date": "2015-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moderately interesting screenplay but not well cast.  Joseph Cotton is horrible in the lead.  The blurb given here by RT is laughable--there are no \"flesh-crawling thrills\" in the movie.  Nor are the characters \"finely shaded\"--more like utterly one-dimensional.",
            "review_date": "2015-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first Hitchcock movie!!! Finally.\n\nI tend to be wary when I watch old movies, maybe just because I always expect something like Citizen Kane: apparently extremely well-regarded, but ultimately a little boring. I figured it'd be different with this movie, since it's Hitchcock, who always makes thrilling movies, but I still had my concerns. But I was totally held the whole way through.\n\nThis movie isn't a thriller in the same way that a lot of modern-day thrillers are. There wasn't any explicit violence until the last few scenes, and even then, it was pretty tame. Still, though, it's suspenseful, because you don't know exactly what Uncle Charlie's secret is, and even though you can kind of assume it's murder, it's tense knowing that he has a secret and younger Charlie doesn't know.\n\nIt's a really interesting dynamic between the two. The movie starts with young Charlie's devotion to him almost a little too much - there's some uncomfortable sexual tension between them - but that makes it even sadder when Charlie slowly begins to realize the rumors about her uncle are correct, and her expressions of idolatry slowly turn to confusion, anxiety, and a subtle somberness. Teresa Wright is such a bubbly, sunny presence as Charlie, and Joseph Cotten is good at the kind of charming and charismatic yet secretive and deeply contemptuous character. That scene where he described how rich women deserved to die was pretty tense, and as the movie went on, I couldn't believe how evil he became, especially considering I thought the movie was going to feature him more as an antihero. But when Uncle Charlie started actually making attempts on Charlie's life, I was shocked.\n\nThere were a couple silly things, mostly having to do with Jack Graham, the detective. The timing is kind of awkward in one scene, with Charlie suddenly yelling, \"You're a detective, aren't you?\" or whatever before the transition had even finished, with little to no buildup. Also, when Graham said he loved her, it was a little unbelievable considering they only had one date, basically. Everyone at my screening laughed a little when he said that. To the movie's credit, though, Charlie actually rejected him, which I wasn't expecting as much. There's no real 'happily ever after' for Charlie and Jack, though we don't know what happens after the events of the movie.\n\nBesides, there were a lot of really nice touches that made up for any small grievances I had. There were a lot of really funny moments in the movie, usually due to the younger two siblings. That girl (Anne I think?) is hilarious, isn't she? Almost every line she said made me laugh. She was so cute and funny. I also was surprised to be entertained by all the conversations between the father and Herb. That little subplot was nice comic relief, and I enjoyed how it dovetailed with the main plot when Charlie overheard them and exploded at the family.\n\nOverall, this was a great first Hitchcock experience, and I'm really looking forward to watching more of his stuff.",
            "review_date": "2015-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(94%)\nA bulletproof Hitchcock classic thriller with finely observed and strongly written characters, the know it all little girl being a highlight, and a great concept at its heart that's perfectly brought to the screen in timeless fashion. Unlike a lot of films from the era the pacing still holds up very well with the suspense bubbles up nicely throughout leading to an exciting intense final chapter. The way in which the uncle (Joseph Cotten) smoothly operates means that it never becomes hard to believe in the events that unfold, and in the manner in which they do. This is one of the somewhat few films ever made that is unmissable for all true cinema fans, and an everlasting treat for all time.",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impeccable and classic Hitchcock, there are so many psychological analysis begging to be made in this movie, but I'll just stop and say I love it. As usual, love the dark humour in the conversations about murder and suicide, too.",
            "review_date": "2014-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic Hitchcock I hadn't 't seen before.  Really well written and executed.  It's amazing how many great films he made.  This film features 2 great performances from Wright and Cotten.  Also has a young Hume Cronyn which was fun to see as I had only seen him as an older actor in films like \"Cocoon\".  This is a must watch!",
            "review_date": "2014-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Charlie loves her uncle Charlie & is enamored when he makes an unexpected visit. But behind Uncle Charlie's debonair personality lies a cold-hearted killer only Charlie can see. Now Charlie has to force Uncle Charlie to leave before he gets rid of her permanently in this delightful cat-and-mouse Hitchcock film that he, himself, deemed his favorite. This is another wonderful role by Joseph Cotton.",
            "review_date": "2014-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its about what lurking behind the innocent facade and about (like Dracula) a inner desire that manifests a evil presence. Beautifully realized by Hitchcock.",
            "review_date": "2014-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a fairly taut mystery, but not quite as good as advertised IMO.",
            "review_date": "2014-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With cold-hearted cynicism Cotton is perfectly cast as the cold killer of widows. You also have a touch of black comedy played out by the father and his friend the obsessive devotees of true crime and committing the perfect murder on each other, and the daughter who loves her uncle until she discovers his secrets. Hitchcock builds up the suspense and then all is revealed to masterful last half an hour.",
            "review_date": "2014-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Creepy and suspenseful. Incestuous and depressing. Explores the concept of underlying evil and its effect on familial relations and unconditional love.",
            "review_date": "2014-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my top 10 favorite Hitchcock films.",
            "review_date": "2014-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that is all about themes and symbolism, and delivers its in Hitchcock's signature suspenseful and thrilling style.",
            "review_date": "2014-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most underrated Hitchcock films!! Absolutely incredible.",
            "review_date": "2014-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock's earliest classics is an impressive and well performed film in the suspense genre.",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderfully done movie",
            "review_date": "2014-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd call this Hitchcock's finest.  Teresa Wright and Joseph Cotten were perfect for the roles, as respectively a totally innocent young woman and a psychopath masquerading as a normal and charming uncle.  I also was very entertained by the discourse between Herb and the father about achieving the perfect murder.  They added ironic comedy to the tense nature of the tale.\n\nI am not usually a fan of these \"small-town dramas\" but A.H. captures the atmospheric and dramatic aspects flawlessly, and the result is a perfect movie.",
            "review_date": "2014-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hitchcock's underrated ... great movie",
            "review_date": "2014-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock's very favourite film of his own, and it is in every way imaginable a masterpiece.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was his true masterpiece.",
            "review_date": "2014-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hadn't revisited this Hitchcock classic (in some reports, his personal favorite) for a number of years and it's great.  With the assistance of Thornton Wilder (Our Town), Hitch contrasts a highly insulated (insular?) American small town with a darker uglier world outside.  He does this by showing the effects of the arrival of evil Uncle Charlie (the Merry Widow murderer - Joseph Cotten) on his heretofore innocent niece, Young Charlie (Teresa Wright).  As the Master of Suspense (but not surprise), Hitch is able to prolong the audience's anxiety about Uncle Charlie and his doings, as the detectives descend on Santa Rosa (the town) and Young Charlie cottons on.  He also takes the opportunity to work in his classic themes - the banality of evil (and \"wrong-doing\") and the complicity of guilt -- and to display his transgressive sense of humor (for example, Young Charlie's father Henry Travers and neighbor Hume Cronyn read true crime magazines and plot each other's murders). The movie is full of rhymes, starting with the two Charlies and extending to matching or doubled scenes, two suspects, two detectives, and so on. One of Hitchcock's most subversively wicked and fully realized films.",
            "review_date": "2014-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shadow of a Doubt (1943) - 8\n\nFine movie from Hitchcock and perfect showcase of the charm and enchantment present in Classic Cinema apparently lost today. The pub scene, in particular, with Young Charlie and Uncle Charlie and the waitress in the middle really deserves to be seen and lived in all it's Bluray quality splendor, I wish I was there. Contemporary sensibilities might find the acting very... theatrical, but this was the style of the time and didn't detract from my enjoyment, I was grabbed by the movie from start to finish. First of several movies from the \"Master of Suspense\" I'll be watching in the coming times.",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A young girl idolizes her uncle and just when she is thinking of asking him to come, he arrives to town...but slowly she discovers clues that point to her uncle not being such a great guy after all, but in fact a murderer. It is classic Hitchcock. Well written, sharply directed, with a a fine cast if oddball characters around a suspenseful plot. What more could you ask? It holds up as one of Hitch's best, and often noted as his personal favorite film of his career.",
            "review_date": "2014-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great suspenseful and entertaining movie.",
            "review_date": "2014-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In 1941, Alfred Hitchcock just had \"Suspicion\", but now there isn't... or is a \"Shadow of a Doubt\". Yeah, without the \"Beyond\", it's kind of hard to guess the full level of urgency to this mystery thriller, regarding the possibility of an evil deed being done. Hey, Hitchcock is the Master of Suspense, so either his titles are even supposed to drive you mad with wonderment... or I'm just making up nonsense as I go along because there really is so much ambiguity to this film that it's hard to figure out what to talk about. I mean, it's Hitchcock, and by 1943, alone, he had a pretty firm formula down as a thriller storyteller, and yet, this was one of the first ones that people really remembered. Well, that's probably because, for 1943, it actually was kind of thrilling, at least more so than \"Suspicion\", which was alright and all, but not particularly eventful.  Granted, there's only so much momentum to this thriller, seeing as how there's apparently still a shadow of doubt keeping things from really hitting the fan. Still, the point is that this film is not simply a little more exciting than \"Suspicion\", but actually pretty darn decent, despite the flaws.\n\nWith all my ramblings about rambling thrillers like Alfred Hitchcock's \"Suspicion\", a film held back largely by natural shortcomings, this film itself has its conceptual limitations, of which there aren't enough to prevent compellingness from consistently standing firm, yet nevertheless enough to limit potential that is further shaken by familiarity. On top of being kind of thin, the path followed by this film is too familiar for its own good, or at least seems to, because among its tropes are Hollywood histrionics that are rarely all that carried away, and are ultimately pretty limited in quantity, but still recurring enough, as well as severe enough, to deliver on some questionably dated dialogue and melodramatics. Quite frankly, the big issue behind the histrionics is their betrayal of subtlety, for although this suspense thriller has enough sober intensity to thoroughly intrigue time and again, those lapses in subtlety all but aggravate in their shaking the thriller's genuineness, in addition to the dramatic momentum. Of course, the drama's momentum is not the only loose element to storytelling here, as structural momentum is itself questionable, as the generally solid, though arguably overblown scripting team of Thornton Wilder, Sally Benson and Alma Reville have their moments in which they leave certain segments to feel tight, and leave others to feel draggy, resulting in an inconsistency in pacing that is all but outdone by an inconsistency in tone. Not unlike something like \"Suspicion\", this film gets too lighthearted with its dramatic build-ups, so much so that when tensions begin to rise, they go rather undercut by tonal unevenness, which isn't to say that the dramatic heights are all that soaring, not so much because of storytelling hiccups, but by the natural shortcomings. Hitchcock's direction, at the very least, is actually inspired enough to transcend natural shortcomings and make a mighty compelling and ultimately rewarding dramatic thriller, but it all comes back to the natural shortcomings, which limit dramatic depth, further limited by all of the inconsistencies in tone, pacing and subtlety. Speaking of subtlety, the film runs a risk of subtly, but surely, collapsing into underwhelmingness, yet when it's all said and done, the thriller doesn't simply compel adequately, but proves to be worthy as Hitchcock's first true triumph as a thriller filmmaker, with impact, and even good looks.\n\nLimited by technical limitations of the time, Joseph Valentine's cinematography actually used the shortcomings of the time pretty effectively, carrying a certain fitting black-and-white palette whose bleakness goes reinforced by dapper plays on shadows that draw you into the near-claustrophobically intense environment that this thriller thrives on. Even more essential in the driving of this type of tight thriller is, of course, the characters, who are brought to life about as effectively as the visual style is, in this case by then-solid and still-impressive performances whose subtle dramatic layering is sometimes ahead of the time, and consistently effective. Joseph Cotten proves to be particularly impressive in his slickly charismatic and atmospherically intense portrayal of a seemingly caring man with deep, dark secrets that he can filter out only so much, so much so that Cotten, especially when working with an emotionally roughed Teresa Wright, drives much of this thriller whose bite relies on the minimal, perhaps too much so. Again, in addition to being formulaic, the story concept is kind of thin in scope, having an intentional tightness that threatens compellingness, but also establishes a potential for it through human intensity that screenwriters Sally Benson, Alma Reville and Thornton Wilder sell through well-rounded characterization, and an attention to light bite that was refreshing at the time, and has aged well. Well, maybe the compellingness hasn't aged especially gracefully, but make no mistake, it is ultimately secured, because if there is meat to this idea, its juiced and drawn upon about as much as it can be by highlights in the acting, script and, above all, direction. What can make or break this potentially underwhelming minimalist thriller is, of course, Alfred Hitchcock, who, through this film, surely had to be revelatory as a thriller filmmaker, because where the film's steadiness could have devolved into dullness, Hitchcock's thoughtful storytelling is realized enough in its celebration of bleak style and audacious material to immerse you into the narrative, whose gradual build in intensity is sold every step of the way enough for the film to grow more and more compelling as the plot thickens. I don't suppose the plot ever thickens all that substantially, yet meat never thins all that substantially either, and between thickness and thinness, Hitchcock cuts far enough to the bone to keep you attached, until the shortcomings are, if you will, over\"shadowed\" by thorough intrigue.\n\nOnce the shadows lift, reward value finds itself all but obscured by conventions, subtlety lapses, and pacing and tonal inconsistencies to the telling of an almost thin narrative, yet pronounced enough through fine cinematography, solid performances, - especially by Joseph Cotten - well-characterized writing, and biting direction to make Alfred Hitchcock's \"Shadow of a Doubt\" rewarding as one of the Master of Suspense's first triumphs in suspenseful cinema.\n\n3/5 - Good",
            "review_date": "2014-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is indeed mediocre comparing with other Hitchcock's films. Besides, the implausible happy ending concludes the story with horrendous dissatisfaction.",
            "review_date": "2014-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slow but exciting thriller where the two main characters, united by an almost telepathic bond, are at the center of everything, with their depth and ambiguos psychologies.",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Hitchcock suspense with a fantastically creepy leading performance from Joseph Cotten.  He plays the mysterious \"Uncle Charlie\" who boards a train to stay with his sister and her family in a small Californian town, meanwhile detectives are snooping, trying to get information on him as they try to solve the mystery of the \"Merry Widow Strangler\".\nThe movie mainly concentrates on Uncle Charlie and his adoring niece (a great performance from Teresa Wright) and their deteriorating relationship as she discovers unsavoury truths about him.\nHitchcock once admitted this was his favourite of his films. Personally, I prefer Vertigo, Psycho & North By Northwest, but it's still a great example of the legendary directors work.",
            "review_date": "2014-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow stunning......brilliant....amazing.....i have just seen this movie 4 the 1st time n think that this is a great movie 2 watch......its got a good cast of actors/actressess throughout this movie......i think that joseph cotten (.R.I.P.), teresa wright (.R.I.P.), macdonald carey (.R.I.P.), henry travers (.R.I.P.), hume cronyn (.R.I.P.), play good roles/parts thorughout this movie......i think that the director of this drama/mystery/suspense/classics movie had done a great job of directing this movie because you never know what 2 expect throughout this movie.......i think that this is such a really well written/acted/directed movie 2 watch.......i think that this is such a classics movie 2 watch......Hitchcock's cameo \nAlfred Hitchcock appears about 15 minutes into the film, on the train to Santa Rosa, playing bridge with a man and a woman (Dr. and Mrs. Harry). Charlie Oakley is traveling on the train under the assumed name of Otis. Mrs. Harry is eager to help Otis, who is feigning illness in order to avoid meeting fellow passengers, but Dr. Harry is not interested and keeps playing bridge. Dr Harry replies to Hitchcock that he doesn't look well while Hitchcock is holding a full suit of spades, the best hand for bridge.......i think that this is such a brilliantly acted movie.......its such a really powerful drama movie 2 watch.......i think that the director keeps you on the edges of your seats throughout this movie as you do not know what 2 expect throughout this movie........i think that this is such a brilliant movie 2 watch......i think that this is such a great movie for 1943 its such a really well directed movie 2 watch.....i think that joseph cotten was brilliant throughout this movie.....i think that this is such a great movie 2 watch.,.....i think that this is such a really well directed/written/acted movie 2 watch its such a superb movie 2 watch its so really well directed its such a really suspenseful movie 2 watch its such a really well acted movie 2 watch.....i think that this is such a brilliant movie 2 watch its so really well made its such a really well written/acted/directed movie 2 watch its such a brilliant movie 2 watch with a great cast throughout this movie its such a brilliant movie 2 watch........",
            "review_date": "2014-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shadow of a Doubt is well-acted and warm and it has nicely developed characters, but it also has a very abrupt ending, a story which is never as suspenseful and engaging as you want it to be and it is an overall a pretty ordinary picture by Hitchcock standards.",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally watched this Hitchcock classic for my Movie Shame Monday selection in mind, and it was well worth the wait. Joseph Cotten is deliciously oily and menacing as Uncle Charlie, and Teresa Wright gives a great performance as his namesake who may very well be his undoing.\n\nGreat stuff.\n\nRecommended.",
            "review_date": "2014-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Getting to know Hitchcock, a well crafted story and good acting but nothing to make me think this is a true classic, something worth multiple viewings.  Just a well made film, drama, suspense genre of the mid 40's.  I don't believe it has aged well, 70 years ago I'd have probably given it 100%.",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I could gush for pages and days about Hitchcock. His films made me a fan of Thrillers, and his contribution to the history of cinema is incalculable. \n\n Shadow of a Doubt is a great example of his work because it showcases Hitchcock's unique framing techniques, and it also features one of the best misogynist rants in the history of cinema. Joseph Cotten, as Uncle Charlie, opines extensively and intensely about Merry Widows in a classic Uncomfortable Family Dinner scene.\n\n The film also features many common Hitchcock motifs such as the staircase and the train. Plus, there is a wonderful subplot involving the father and his neighbor in a long running discussion about how to plan the perfect murder.",
            "review_date": "2013-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous, almost forgotten Hitchcock featuring an intoxicating mix of characters, wonderful cinematography and a gripping storyline. Sublime.",
            "review_date": "2013-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oddly enough, I don't really like this movie.  I love late 30's-early 40's era Hitchcock, but this movie just did not do it for me.  There was some good dialogue, but the characters weren't as interesting to me, and that kind of ruins its potential.  So, it was well executed, but it's not the sort of movie that I like to watch.  Children, and families, and a plucky teenage protagonist sort of all bore me.",
            "review_date": "2013-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good Mystery Time by Hitchcock",
            "review_date": "2013-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I do not understand how this was Hitchcock's favorite of his movies.  This movie had a good plot but the movie was slow moving especially in the middle.  Probably my least favorite hitchcock movie.",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great, relatively early film in the Alfred Hitchcock canon. Parts of it have the cheery, all-American small-town feel of a Frank Capra film, but it also goes to darker places than his earlier The 39 Steps ever does, and anticipates films like Rope and Vertigo, as well as David Lynch's Blue Velvet and the recent Stoker. There's a lot of creepy stuff just under the surface of the movie, and it's got brilliant performances.\n\nThe movie opens with a man we come to know as Uncle Charlie (Joseph Cotten) fleeing from detectives in Philadelphia for unspecified reasons. Then we meet his post-high-school-age niece, also known as Charlie (Teresa Wright), who is excited to learn that her beloved Uncle Charlie is coming to visit her and the rest of the family. However, despite Uncle Charlie's superficial charm, the reason why the police are after him eventually gets in the way of the family's seemingly happy visit.\n\nTeresa Wright to a great degree carries this film, and she really is excellent here. Young Charlie's progress from gullible naivete to a troubled awareness of the darkness of the world is handled quite well, and Wright has the earnest charm and expressive face to do justice to the role. Joseph Cotten is terrifically creepy as Uncle Charlie - even before you find out exactly what he may have done, there's something off-putting about this guy. Henry Travers, who played Clarence in It's a Wonderful Life, is wonderful comic relief as young Charlie's father, a milquetoast obsessed with murder mysteries.\n\nHitchcock himself is of course the primary attraction for any of his films, and in this one we see him in full, seemingly easy command of the medium. Everything from the most dramatic camera movements to the most meticulous details of the scenery and lighting is meticulously planned, and it always contributes to the story. If it doesn't quite match his very best films, this is still a very important entry in his body of work, and probably better than just about any of the films he had made before it.",
            "review_date": "2013-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant thriller. The acting, and directing where amazing!",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Hitchcock classic, Shadow of a Doubt is interesting and unique in both its story and in the manner of which it is told.  Great directing, score, cinematography, and acting all around.",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strangers on a Train and Shadow of a Doubt impress the same sort of feeling onto me, in that they both frighten from similar near-psychotic characters. Hitchcock favored Shadow of a Doubt, a story of a family at odds with a killer. Murder, he thought, belongs in the home.\r\n\r\nLike Polanski's 1967 Rosemary's Baby the story rides on anxiety, and thrills less with the action than what comes between the action. What was said or discovered tells us more than murders themselves.\r\n\r\nNothing in this film is particularly groundbreaking, but it's still entertaining, which is what a movie should be. The best way to watch this: cozied up on the couch, in the family room of your home, sitting with your mom.",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hypnotic, multi-layered film filled with rich, nuanced scenes, populated by one terrific performance after another:  Collinge's poignant monologue about her brother.  Cotten's cold-blooded assessment of widows, punctuated by a claustrophobic close-up.  Wright's helplessness & despair at her growing awareness & horror.  A must see requiring multiple viewings.",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorite movies.  Joseph Cotten SO CREEPY!",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After what people have told me about Hitchcock, I have to say I expected a more interesting story. This is not all that good and the ending is a bit silly really. I liked the cast though, Teresa Wright reminded me of Ellen Page, could've been her granny.",
            "review_date": "2013-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We know the central character by the name of \"Uncle Charlie\". He has a niece who goes by the same given name. We do not know from the start what is going on between the two of them. But we are thrived wanderingly by the amount of mysteriousness the former Charlie gives us. In his conversations with his niece, he gives us wisdom through words that are destructive to humanity and spirit. He has this dark enigma of a \"bad guy\", existential, philosophical, smart, but utterly disturbed. Joseph Cotten has given this character a true personification. Hitchcock, who is also known for his film noirs has given this film a signature approach, simple yet very effective - through the use of familiar camera angles, editing, and aesthetics. A great film indeed.",
            "review_date": "2013-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing. Hitchcock's best.",
            "review_date": "2013-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic performances from Joseph Cotten and Theresa Wright are the highlight of this splendid, atmospheric Hitchcock thriller.",
            "review_date": "2013-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I own the Hitchcock collection (14 films in toto), and while this isn't my favourite of the bunch ('Psycho' is one of my favourite movies of all time, and 'Birds' never gets old), I like to watch it every now and again to remind myself what it means to make a \"suspense film\", and why Hitchcock was and always will be the master of this craft.\n\nTo give away even the slightest story detail would ruin it for new viewers, because it is essential that everyone begin with the wrong impressions of the major characters. This allows Hitch to pull off his famous 'twists' throughout the course of the movie, hitting you every now and then with something you simply weren't expecting.\n\nOne of my favourite elements in the movie is the ongoing dialogue between Henry Travers and Hume Cronyn, avid mystery readers who are constantly discussing the best ways to murder each other. Apart from being a bit of comic relief in an otherwise very dark film, it also demonstrates how lightly people think of murder and murderers...until they encounter them face-to-face.\n\nMy advice then, if you want to see this movie, is not to learn anything about it beforehand. Going in with no knowledge will increase the movie's initial impact, and will help you to appreciate why Hitchcock was the 'Master of Suspense'. This is a taut thriller with no gratuitous violence, foul language, or mature situations.\n\n(Hitch considered it 'a family film'.)\n\nEnjoy!",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Out of all the films Alfred Hitchcock made, such as Psycho, Vertigo, and North by Northwest, Hitchcock revealed that his favorite film to make was Shadow of a Doubt, an early Hollywood film that helped define Hitchcock's career, though it's hardly noticed by viewers who have been into Vertigo.\r\n\r\nIn Shadow of a Doubt, we meet a mysterious man named Charlie (Joseph Cotton), who is a notorious criminal known as the \"Merry Widow Murderer\", who heads to the family of her niece Charlie (Teresa Wright), in order to hide. The niece Charlie loves her uncle, claiming that it's a miracle for him to show up. When a pair of detectives, led by Macdonald Carey, disguised as photographers show up for some information about the family, Young Charlie gets suspicious, and when she finds out the truth, Uncle Charlie starts a plot to kill off his \"favorite\" niece.\r\n\r\nHenry Travers plays Joseph Newton, Charlie's father, a banker, Patricia Collinge plays Charlie's mother, and although I missed this, Alfred Hitchcock supposedly cameos as a man who plays bridge on a train. Boy, does Hitchcock love his trains.\r\n\r\nWith Hitchcock claiming this to be his favorite film, I knew I had to see it. And boy, was I wowed. One again, Hitchcock delivers on the suspense, with some moments coming out as disturbing, such as Uncle Charlie's plots and the really crazy climax on, you guessed it, a train.\r\n\r\nAs for the acting, it's incredible. Joseph Cotton is menacing as the uncle, and some moments are downright creepy, such as a scene where he describes widows as swine. I enjoyed the family portrayed in the film, and it provides some good humor for the 1940's, and still does in 2013. But who is the real star of the film? For me, that would be Teresa Wright as Young Charlie, and SHE'S NOT EVEN A BLONDE!!!!!!     It's incredible that a non-blonde actress, that Hitchcock usually picks in his films, would deliver a strong performance as this. In her scenes with Cotton, the chemistry delivers, even if they weren't a romantic couple, a couple that Hitchcock succeeds a lot.\r\n\r\nHitchcock's favorite film is a winner, even if I prefer Vertigo. To put it straight, Shadow of a Doubt is a Hitchcock delight with a suspenseful plot and some phenomenal casting. Highly recommended for every fan of Hitchcock who hasn't seen it already.",
            "review_date": "2013-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was Hitchcock's favorite film that he directed, I'm not sure I agree with him since I have to catch up on his work but this is a masterpiece with an excellent performance by Joseph Cotten.",
            "review_date": "2013-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shadow of a Doubt is a well- made and presented Hitchcock film, but I just didn't like how it took a long time for the story to start.",
            "review_date": "2013-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A moody early Hitchcock in which you can see the seeds for Psycho and Rear Window. Some great moments, beautiful shots, but the overacting of the female leads makes it a bit cringeworthy today.",
            "review_date": "2013-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story was brilliant. I loved the characters and the acting. Uncle Charlie is more sinister than he appears. Charlie the girl is a true badass and it shows when she comes down the stairs wearing that ring.",
            "review_date": "2013-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By now, this is the fourth Hitchcock film that I've seen and it certainly is a better representation of what I understood his work to be than SABOTEUR was. SHADOW OF A DOUBT, which Hitchcock said was his favorite, is a rather simple tale that explores one of his favorite themes: mistaken identity. Joseph Cotten (THE THIRD MAN) plays \"Uncle Charlie\" who visits his family for a visit in Santa Rosa, California. However, he's not quite what his young niece Charlie remembers. One thing I've noticed about Hitchcock's films is the various ways he's able to create tension and suspense in a way that keeps the viewer hooked. Some of the elements he uses includes light and shadow, camera angles, the score, etc. All of them came together in a rather cohesive way that kept me interested in seeing where the story would go. This film also captures an America in transition. The world created here isn't the paranoia-filled one of SABOTEUR, but still one where suspicion is very palpable and there's a sense that trust is becoming less of an innate quality in Everytown, USA. Like in SABOTEUR, there are two characters who serve as thematic counterpoint to each other. Here, they are the two Charlies. Joseph Cotten's character is somewhat of an idealized figure for his young niece (Teresa Wright), but the reality of how cynical and pessimistic he really is gets revealed over the course of the film. I thought it was a brilliant way of showing how expectations measure up when faced with reality. There's also the \"is he/isn't he?\" sense of if he's really even the person he purports to be, which plays into the themes of suspicion and trust. One thing I wasn't entirely expecting was the awkward sexual tension (in a few scenes) between the two Charlies, which added an incest layer that helped to flesh out the tense relationship between them. If there's anything weak about the film, the ending was a bit abrupt and a romance that develops between young Charlie and a detective seemed to be shoehorned in (and provided for an unnecessary coda. Still, I liked this film very much and it bodes well for the successive Hitchcock films I'll be viewing later this month.",
            "review_date": "2013-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an exquisite movie that had me in awe for much of it. The excellent performances and brilliant story are absolutely riveting. I finished the film feeling elated for seeing it. Now that's a sign of a great movie.",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Hitchcock film!",
            "review_date": "2013-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another Hitchcock masterwork.  This time, the villain (or IS he?) is Charlie Oakley, played to perfection by Joseph Cotten. Charlie is on the East Coast, and slips by some detectives on his way to small town California to stay with his sister and her family. His niece (named after him) is at first delighted to see him, but begins to notice strange things he does and how he reacts oddly to others. When 2 reporters show up at the house to do an interview, it is revealed that they are actually detectives tracking Charlie, as he's one of the suspects for the 'Merry Widow' murders back East. Jack, the younger detective, asks Young Charlie to keep an eye on Uncle Charlie and see what if anything happens. She is torn between loyalty to the Uncle she worships, and the common sense that tells her something isn't right. Is Uncle Charlie really a cold-blooded killer? Or is it just a case of mistaken identity? Hitch has you hanging on until the very last moment to find out what happens.\nThis really is the master of suspense at work...the first chunk of the movie just sets things up, but the second part is where it really takes off. The camera work in Hitchcock films is marvelous making everyday things seem off, and combine it with a score from the great Dimitri Tiomkin (who worked on many Hitchcock scores) and you've got a great piece.  This also includes a famous/infamous speech made by Uncle Charlie about the nature of women that would surely set off a firestorm of controversy today, but in the film is perfectly suited to the character and advancing the plot at the same time. The genius of his films are that they take place in the everyday world, which makes them even more genuinely believable and therefore, potentially able to happen for real, even to people like you and me.  I mean, when a director can make a trip to the library seem like a matter of life and death, you know he's got you in the palm of his hand.\nThe only thing that kept this from 5-stars is the first half, which is a bit slow, and the performance of Teresa Wright as Young Charlie, who really grates on my nerves early on. Keep your eyes open for Henry Travers (Clarence in 'It's a Wonderful Life') and Hume Cronyn.\nRight up there with the Hitchcock classics, but not my absolute favourite. Definitely a must-see though.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now that is a classic with a generally masterful characters written and played with a dark tone. I could say the two kid from ROPE might've watch this if this movie existed in that world",
            "review_date": "2013-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i give it 3 for it's strong female protagonist, but it was a bit too ... i don't really know what for me.",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As the trailer states, it really is a \"masterpiece of suspense and mystery\". With the magnificent Joseph Cotton in a performance only matched  (But not surpassed) by Robert Walker in 1951's \"Strangers on a Train\" and the vastly underrated quietly professional and highly intelligent Teresa Wright who stands out in the Hitchcockian universe as a warm, idealistic character with a sharp mind rather than an icy blonde love interest, it really is one of my favorites of all of Hitchcock's films and the tension is so high it feels like it's been wrought with piano wires. A must for anyone who wants a good introduction to Hitchcock.",
            "review_date": "2013-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shadow of a doubt is a greatly exciting and finely crafted game of cat and mouse that's a must see and a must own.",
            "review_date": "2013-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Cotten was brilliant in this. He is never overly scary or creepy, but there is just something unsettling in every line he has.",
            "review_date": "2013-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Hitchcock film! That brings murder in the family where it rightfully belongs. What would you do if you found out your favorite uncle was a murderer?",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie may be a minor classic in its own sense but for me it is the weakest Hitchcock movie I have seen yet. The characters are written well, but it is the storyline where it falters.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Undoubtedly the best Alfred Hicthcock picture. The development of the characters is very interesting and the thrill never goes away",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In one of Hitchcock's earlier American films starring Joseph Cotten and Teresa Wright, Uncle Charlie comes to visit his niece namesake \"Charlie\" and the rest of the family. Initially the whole family seems to be in a funk until they find Charlie (Cotten) is coming to visit them in Santa Rosa. However, what they do not know is that he is a wanted murderer. Over time \"Charlie\" (Wright) becomes suspicious of her uncle and finally comes across the truth. Her uncle figures out what she knows and decides he must get rid of her. Living in constant peril, \"Charlie\" finally is forced to face him. In the ensuing struggle she fights madly for her life. With the constant discomfort and suspense, Hitchcock proves how powerful thrillers can be even in the home. Cotten and Wright both do a very good job in this film. Supposedly this was Hitchcock's favorite among his own films. I think it certainly one of the best of his lesser known movies.",
            "review_date": "2013-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was decent not Hitchcocks best. I felt that there were certain parts of the film that lagged. But the cinematagrophy was pretty impressive.",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disappointing plot. Teresa Wright's vintage cap toe shoes had me craving.",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable but I preferred Saboteur.",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the all time greats. It was Hitchcock's personal favourite out of his own films, and I would probably agree it's his best work. The domesticity of evil.",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's easy to see Hitchcock's early genius, but the first and second act drag a bit. I understand tension building, but its a bit much. Once that third act hits though, wow. It really is amazing. Cotten plays easily the most sinister characters of all time. Definitely up there with The Night of the Hunter. The disturbing part is is the way he uses reason to explain his immorality. When he asks \"Are they?\" it brings the movie to a whole other level.",
            "review_date": "2013-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hitchcock's earliest classics that still delivers the same impact as it did in its time, Shadow of a Doubt is a deftly crafted thriller that hasn't aged a day. With its homely characters, nicely developed antagonist, complex moral situations, & tightly crafted story from the beginning till the very end, made highly gripping by its firm editing, Shadow of a Doubt isn't Alfred Hitchcock's personal favourite for nothing & is certainly one among his all time greats.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a fun little thriller this is! The relationship between Teresa Wright and Joseph Cotten as niece and uncle starts out borderline creepy and incestuous but grows into something extremely compelling as she learns the truth about his life as a murderer. \nHitchcock has a very glossy and well-polished flick here. I'm not sure it needed Wright to fall in love with the detective but overall this is intrigue firing on all cylinders!",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Suspense built up even though you know right away that Uncle Charlie isn't what he seems. Though as the movie moves along the drama and purpose are exposed as Charlie finds out. A gem of a movie that only Hitchcock could make work with macabre humor and nail biting suspense.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the early works of Hitchcock and one of the most memorable and finest ones. Charlie (Charlotte) is the niece of Charlie (Charles) who recently received a large fortune from his previous marriage. Now, more and more clues were revealed to Charlie that her uncle may be a widow killer. A deadly cat and mouse game was ensured. It's somewhat part noir, part mystery, part family drama. It's a really great film with fantastic actors and a inventive storyline.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Er. It was fine. No clue how it got such high ratings honestly. Pretty corny and typically 40s with the typical Hitchcock menace.",
            "review_date": "2012-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hitchcocks best!",
            "review_date": "2012-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it, the funny thing about these old films, is that a guy and a girl can fall in love with each other and actually love each other after only knowing each other, for an afternoon :-) Joseph Cotten was great.",
            "review_date": "2012-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In his favorite of his films, Hitchcock doesn't just put lives on the line, his characters' dreams are equally at stake and they're as frail and easily breakable as fine china. Hitch has assembled a truly quality cast, each representing their own American ideal. Central to the story is restless young Charlie (an exceptional Teresa Wright) who takes us on an internal, nail biting journey of right, wrong and the sometimes deadly pangs of growing into adulthood.",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good suspense film.",
            "review_date": "2012-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Herb's talking about killing me, and I'm talking about killing him.' :P\nJust another Hitchcockian masterclass.",
            "review_date": "2012-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Masterpiece!!! One of Hitchcock's best films!!!",
            "review_date": "2012-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Shadow of a Doubt\" is a dark, eerie, ambiguous film that stands as the first to show some of Hitchcock's legendary directorial trademarks. Teresa Wright does an outstanding job as the lead; so well, in fact, that she often overpowers Joseph Cotten, who plays the part of a villain to a tee. In the long run, the whole affair may be just a bit predictable and the ending is too neatly wrapped up, but that doesn't make \"Shadow of a Doubt\" any less of the classic that it is.",
            "review_date": "2012-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting film, good noir film that shows how a man who appears great on the outside is not always great on the inside.",
            "review_date": "2012-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite all the characters over-acting and being slightly irritating, Shadow of a Doubt efficiently builds its suspense with great writing and direction",
            "review_date": "2012-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I good film but wouldn't say superb film. Nice to see another Hitchcock film though. This one follows a murder who tries to charm his way through his relations, only to be seen through. Not a film that really captures you, but enough to keep you watching.",
            "review_date": "2012-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gotta love Hitchcock.",
            "review_date": "2012-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chilling and increasingly intense as the movie proceeds. The beautiful shots that Hitchcock's later films are entirely constructed from have begun to appear at this point and the effect is nothing less than gripping.",
            "review_date": "2012-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A superb mystery drama..one of Hitchcock's best. Joseph Cotton gives a great performance. You always wonder what going to happen next, what else do you need in a mystery",
            "review_date": "2012-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cotton is so creepy in this! Hitchcock builds suspense so seamlessly, it keeps one's eyes glued to the screen!",
            "review_date": "2012-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is an absolutely absurd plot, masterfully directed. Hitchcock had really come into his own and was reaching the peak of his career.",
            "review_date": "2012-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What great suspense this story builds, Alfred Hitchcock at his best.",
            "review_date": "2012-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion, Hitchcock's first masterpiece. Shadow of a Doubt is a classic movie that I have seen many times. The movie really succeeds at creating characters and tension.\r\n\r\nThe story starts out with a charming young woman. Charlie is a teenage girl who is named after her uncle Charlie. Uncle Charlie comes to visit Charlie and her family. Everything is idyllic except for one thing, Uncle Charlie is a mass murder, known as The Merry Widow Murderer. He kills old ladies, who he thinks have no reason to live, and takes their money. The family doesn't know about it, but young Charlie slowly comes to find out the truth about her uncle, who begins to act strangely. The question is, who will Uncle Charlie kill next.\r\n\r\nJoseph Cotten gives one of his best, if not his very best performance ever. And of course, psychopaths are always scarier when they seem somewhat normal and rational. Cotten isn't known for playing villains, but after seeing this movie, you'll wonder why. Teresa Wright plays young Charlie. Given the character, she really couldn't be much better. Also look for some nice supporting roles for Henry Travers and Hume Cronyn.\r\n\r\nThis really is a great movie. Of all of Hitchcock's films, this was his favorite. I can't really blame him.\r\n\r\n\"You live in a dream. You're a sleepwalker, blind. How do you know what the world is like? Do you know the world is a foul sty? Do you know, if you rip off the fronts of houses, you'd find swine? The world's a hell. What does it matter what happens in it?\" 10/10",
            "review_date": "2012-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wanted it to be over so badly.",
            "review_date": "2012-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Early Hitchcock at his best. I like how there is a killer living in a small, quiet town where everyone seems to be nice to each other. And the fact that he is living with his family who have absolutely no idea what he really is just gives the film more tension. I really liked the psychological battle between Teresa Wright and Joseph Cotton. They really give \"family first\" a whole new meaning. This is one of Hitchcock's best indeed.\n\nGrade: A-",
            "review_date": "2012-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too slow and linear considering it is a 1943 make. Good for one watch if you are chasing the IMDb 250.",
            "review_date": "2012-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike Hitchcock's typical films about espionage and voyeurism, Shadow of a Doubt presents a different type of drama. The film feels like a mystery story with a hint of symbolic noir. Teresa Wright (Niece Charlie) is an exclusive actor who does not particularly belong in the Hitchcock universe since she isnt a blonde love interest but she does portray the innocent female that many Hitchcockian fans have come to appreciate.",
            "review_date": "2012-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As usual with Hitchcock films the background work is genius. The camera work and the humor littered through the for the most part serious film is incredible. However some of the acting wasn't spectacular and I didn't find Teresa Wright very believable at times. Still an excellent movie, in particular Joseph Cotten who was outstanding in the antagonistic role of Uncle Charlie.",
            "review_date": "2012-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THis is no doubt in my mind an excellent film!",
            "review_date": "2012-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shadow of a Doubt is a wonderful film which shows clearly Hitchcock's skill at building and maintaining suspense throughout a film's run. But it is not just the suspense that makes this movie work. The whole presentation of Santa Rosa-the feel of a sleepy, pleasant little town-is charming, the dialog is witty and entertaining and the characters are well developed, interesting and well acted. No one does a bad job in this film and they all fit together perfectly within the framework of the story.Definitely recommended.",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps Hitchcock's most \"European\" film, with the depth & layers of  \"Vertigo\".  Wright makes a wonderful counterpoint to Cotten's warped serial killer.  Sublime as it peel's away the thin skin of American ideals, & the veneer of safety & innocence.  Some scenes are subtle & eloquent -- and chillingly creepy: Wright in the library discovering the truth, ending with a soaring crane shot.  Cotten giving a piggyback ride to his young niece.  Cotten speaking derisively at the dinner table as Hitchcock zooms in for a microscopic look at the evil character.  \nHitchcock cranks up the suspense creating mega tension until the ironic, cosmically unsatisfying ending.  A MUST SEE.",
            "review_date": "2012-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hitchcock's earliest masterworks (and his favorite film), Shadow of  a Doubt attains that perfectly Hitchcockian blend of suspense, drama, and comedy as it explores the depths of the ambiguous.  In essence, the film concerns the epitome of the slippery signifier: one that is both considered impeccably good and completely evil.  Hitchcock plays with this dichotomy until the film's final moments that ultimately depict the need for repression and denial as psychological defense mechanisms.  A psychological drama par excellence, Shadow of a Doubt is Hitchcock at his finest.",
            "review_date": "2012-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatly acted and suspenseful.",
            "review_date": "2012-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The indisputable masterpiece maker Alfred Hitchcock made his first indisputable masterpiece in 1943 with the incredibly suspenseful Shadow of a Doubt.  This is a slow burner, but every single second gets better than the last.  An incredible film.\n\nOh by the way, it was Hitchcock's personal favorite of his...so that's saying something.",
            "review_date": "2012-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first of many of Hitchcock's well-known masterpieces. While most of his earlier works were stupendous and truly suspenseful, Shadow of a Doubt brought thriller genre to whole another level. It's a story so dramatic and nightmarish in its subject matter, and so rich and captivating in its performances. The narrative doesn't stop to build-up the suspense, and while the viewer knows for most of the time what's really going on, the true quality of the movie comes from the fact that the players don't know, and we're anxious all the time, being unable to help them in any way. That's true realism of this tale. And it's also disturbing. A story about a girl, who becomes convinced that her mysterious uncle is a deadly killer on-the-loose, but isn't able to convince other family members, as there are too little clues and evidence. Great juxtaposition of two marvelous actors, Joseph Cotten as an uncle-from-hell and Theresa Wright as the overly suspicious, yet astute girl with a bold attitude. A Genuine psychological thriller.",
            "review_date": "2012-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An early Hitchcock film that shows his early filmmaking styles at his best.",
            "review_date": "2012-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best from Hitchcock , but still a good thriller .",
            "review_date": "2012-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Norton Wilder and Hitchcock, a small town family gothic.",
            "review_date": "2012-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very entertaining classic thriller.  Cotten is excellent as the whacked out uncle.  Kept me interested the whole time. Would definitely watch again",
            "review_date": "2012-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fine Hitchcock thriller where a niece finds out her favourite uncle is a serial killer.  The final 20 minutes is laced with tension, typical Hitchcock.",
            "review_date": "2012-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike many Hitchcock films I've watched, the plotline is very straightforward: young girl adores her uncle, but her idyllic image of him is shattered when she learns he is wanted for murder. As it was so easy to understand, it made it very enjoyable. My favourite characters were Charlie and her nerdy little bespectacled sister, Ann!",
            "review_date": "2012-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The world's a hell, what does it matter what happens in it?",
            "review_date": "2012-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really annoying characters, the scenes with Herb and the father were the best",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense relationship of admiration, deification and platonic love between a young naive girl and her uncle that other than crossing the line of attraction takes a dangerous turn into the territory of crime and terror.",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A splendidly dark movie, pitting small-town American goodness and family against evil, predatory horror. Uncle Charlie comes to visit his loving family from New York City, but Uncle Charlie may be a serial killer. He's certainly acting suspiciously, ripping up newspapers and snatching film containing photographs of him, but surely he wouldn't threaten his adoring niece, even if he were a killer? SHADOW OF A DOUBT ratchets up the tension with skill, and it's never entirely clear where Hitchcock's sympathies lie - with the urbane, possibly psychotic charmer or with the faintly simpering \"average\" family, which adds a pleasing level of ambiguity to what, essentially, is rather a silly tale. With some great lines and memorably tense moments, it's a fantastic thriller and Joseph Cotton deliciously creepy.",
            "review_date": "2012-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a decent movie, but I've come to expect a little more from Alfred Hitchcock",
            "review_date": "2012-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cotten gives one of his best performances here and he's perfectly matched by Wright. The movie toys with cynicism but ultimately comes to the opposite conclusion about people which makes it sort of a perfect fit for the WWII era.",
            "review_date": "2012-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Flawless. A must see indeed. After seeing this one, I am for sure turning into a Hitchcock fan.",
            "review_date": "2012-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film, very suspenseful, Joe Cotten turns in a great performance",
            "review_date": "2012-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense slow-paced film by Hitchcock. Keeps things interesting until the very end. Recommended.",
            "review_date": "2012-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my top 5 of all time",
            "review_date": "2012-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Proof that Hitch could add suspense to anything.....even to getting to a library before it closes.......",
            "review_date": "2012-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie gives you a strange homey feel. Excellent Film! I can see why Hitchcock liked this the best out of all of his films. It's an excellent character-motivated film, with Joseph Cotten's excellent performance. Very Entertaining.",
            "review_date": "2012-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "whoa whoa whoa! CRAAAAAAAAAAAAAAAZAY! :D",
            "review_date": "2012-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i always find Alfred Hitchcock`s films flat and slow paced and can just be described in few words  but he is really super in creating all these amazing details of each character ..the way they eat , speak , dress and walk  in addition to marvelous script and great acting ...\nthe film is about \"Charlie\" the young girl  and her fascination with her uncle \"Charlie\" who planned to visit their house in this small calm town ...she sees her uncle as her soul mate , her other half , she`s even been named after him ..she thought she knew him , she thought the world outside her town is no different but  her uncle decided to tell her the truth\n\"You think you know something, don't you? You think you're the clever little girl who knows something. There's so much you don't know, so much. What do you know, really? You're just an ordinary little girl, living in an ordinary little town. You wake up every morning of your life and you know perfectly well that there's nothing in the world to trouble you. You go through your ordinary little day, and at night you sleep your untroubled ordinary little sleep, filled with peaceful stupid dreams. And I brought you night mares\"",
            "review_date": "2012-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great Hitchcock film. It is suspenseful but in a way that you may not necessarily expect. You can definitely see how Hitchcock is testing the waters of just how he can raise tension. Although he hadn't mastered it at this point this is no shab. One heck of a great film alright! If you haven't seen it you ought!",
            "review_date": "2012-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock and I wouldn't have gotten along. He claimed that \"Shadow of a Doubt\" was his favorite film and it's my least favorite of his. He claimed that Jimmy Stewart ruined \"Vertigo\" and he ended up hating the film and never speaking to the actor again, I on the other hand think it's his crowing achievement and a fantastic Stewart performance. For me, \"Shadow of a Doubt\" is just to disparate for me to embrace. While each of the elements seem interesting on their own, none of it congeals. The film has no back story, you are supposed to be caring for Charlie (or at least that's what the overwrought score seems to convey). How can we care for this main character (and Young Charlie) if we don't know anything about them. We know she is good and he is bad, but WHY? How can we possibly love a character when we know so little about their decision making process? To me, this is lazy filmmaking. The film tries to be thrilling, funny, dark, romantic and fails every step of the way due to the lack of characterization. All we end up with is a film that will only scare the naive morons of Middle America... (which is what the film is about, so maybe it works?... nahhh)",
            "review_date": "2012-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Hitchcock classic. A man comes to town to see his sister and favorite niece, but the niece finds out that her uncle is not as cracked up as he is supposed to be. A real nice slice of everyday America is shown here.",
            "review_date": "2012-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Splendid and creepy Hitchcock noirish ensemble piece. Feels a bit like a stage play at times but it is perfectly paced, has perverse and incestuous undertones and looks great. Love the Merry Widow Waltz motif (borrowed by David Lynch for Mulholland Drive I think).",
            "review_date": "2012-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is of my favortie alfred hitchcock movies. just the thought of someone you trust is a murderer is terrifying.",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What lurks in the shadows of your own home?\r\n\r\nThis was one of the first Hitchcock films I've ever seen. I saw it once when I was sick and at home in the fourth grade (in case your wondering that was a long long time ago). So understandably, I didn't remember much of it, so when I watched it the other night, it was almost like watching a new movie for me...And I have to say, I loved it the first time I saw it, and I loved the second time I saw it. \r\n\r\nThe Story: A young woman, finds out that her favorite uncle is a ruthless killer. At first she doesn't want to believe it, but it becomes clear to her, that her beloved Uncle Charlie isn't the man she and her family thought he was. It's one of my personal favorite Hitchcock films, partly due to the fact that it was one of the first I'd seen, but also because I love the story. What's more terrifying than a killer in the one place you can truly feel safe? The cinematography is great, and the lighting really makes uncle Charlie look evil. It gets from point A to point B in no time, you won't find any time to be bored with it. An all around great film. \r\n\r\nThe Cast: Teresa Wright, Joseph Cotten...There's more people in the cast but these are the only two that you're really going care about. Joseph Cotten is Uncle Charlie, the charismatic killer. He's so undeniably good at this role that, you'll have no choice but to fear him. Teresa Wright is young Charlie, Uncle Charlies favorite niece. You'll feel such a great connection with her, that you'll actually fear for her life as she's becomes aware of the danger she's in once she solves the mystery of her favorite uncle. These two have great chemistry on screen, Hitchcock knew how to cast people back in the day. \r\n\r\nOne to Five Scale: 5 \r\n\r\nOne of the best Hitchcock films ever made. If you've never seen a movie of his, this one is a great place to start. Every so often at movie stores, you'll find these old movies as re-releases on DVD or even VHS, and if you ever stumble across this one, don't hesitate to pick it up. \r\n\r\nTyler",
            "review_date": "2012-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely superb entry from Hitchcock.",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although watched for a project where I had to forcedly devour numerable Hitchcock films, this one was the most pleasant. I loved the storyline, the characters, the chiaroscuro. Definitely Hitchcock's best.",
            "review_date": "2012-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock's \"Shadow of a Doubt\" is exactly what I thought it would be; a film that shows (several) moments of brilliance, but ultimately is one of Hitchcock's lesser works. Of course, a less significant work from a grandmaster is still plenty good. Even though a lot of the characters are clichés or the town is so \"American,\" I noticed implications of young girls desiring older men, and even the relationship between the uncle and niece at times does not seem ethical, although nothing intimate actually happens between them. This is what's most essential in Hitchcock's films, the characters are well groomed, well dressed and appear to be \"perfect,\" yet they are very much like how people are in reality and hold dark secrets. This to me is the essence of a world created by Hitchcock, which only few are able to do, to invent something of your own. Not to go too much into the movie, I would say it was mostly satisfying; however the ending could have been executed better. Joseph Cotten definitely delivers a chilling speech at the dinner table! It is quite strange that Hitchcock considers \"Shadow of a Doubt\" his best work, rather than \"Vertigo,\" \"North by Northwest,\" \"The Wrong Man,\" or \"Rear Window,\" etc. If I am not mistaken Scorsese's favorite from his films was \"The Age of Innocence,\" Welles' was \"Chimes at Midnight,\" and Bergman's favorite was \"Winter Light\" among his work. All those favorites are not considered the very best of their respective director by the majority. I guess everyone has their own preferences.",
            "review_date": "2012-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hitchcocks best early American films.  Thornton Wilder's screenplay focuses on 1940s era smalltown life and how it reacts to evil in the form of Joseph Cottons Uncle Charlie.  Deliberately paced with plenty of humor.",
            "review_date": "2012-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Out of all his movies, this was Alfred Hitchcock's favorite.",
            "review_date": "2012-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Master's first masterpiece. And the start of one hell of a film career.",
            "review_date": "2012-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know if this is another case of me judging old films with contemporary standards, but I felt that this movie squandered much of its potential. The relationship between uncle and niece is a very strong foundation and the supporting build an interesting environment. But much of the mystery is lost because the uncle's secret is revealed too early and the niece's reaction seems too rushed and unrealistic given her earlier behavior.",
            "review_date": "2012-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A weird story full of palpable sexual tension between a young girl an her crazy uncle. There was really no mystery in this, nor was her romance with that other guy believable.",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film according to interviews with director Alfred Hitchcock was his favorite to make. He enjoyed the thought of bringing danger and evil to a small town. I will say this is one of the better of the Hitchcock films, but it has aged in a way that some moments to me are creepy in different ways. Charlie Newton (Teresa Wright) is a young teenage lady that is living in her small little town. One day her favorite uncle that she hasn't seen in quite some time Charlie Oakley (Joseph Cotten) arrives in town. Charlie herself was named after Uncle Charlie and she's always felt a strong connection to him. Things seem to be great, but Uncle Charlie starts acting very suspicious. Cutting out certain articles in the newspaper about a murderer, acting strange around everyone else and overall just being kind of plain creepy. Soon enough Charlie's family is visited by Jack Graham (Macdonald Carey) and Fred Saunders (Wallace Ford) two undercover detectives that are actually looking into Uncle Charlie showing up as he is one of two suspects in a string of murders. Soon enough Charlie realizes that Uncle Charlie is not the man he said he is which leads Uncle Charlie to start plotting on how to silence young Charlie for good. Ok, so as opposed to Saboteur (1942) i found the pacing for this movie to be great. This is the second time I've seen this film and I remember not exactly being the greatest fan last time, but I enjoyed it more this time. Uncle Charlie is just creepy. Cotten does a great job in his portrayal here and I really found him to be the kind of suave gentlemen with a very dark secret. Wright as Charlie is kind of annoying. She's very naive in the beginning and she even has a subplot with Jack that was very strange to me since Charlie is a teenager and Jack is a full grown man. This romance subplot comes out of nowhere and gives me that 1940's feel of shitty writing. Yup once again I'm criticizing the great Hitchcock, but come on. The suspense here is great though and I overall enjoyed the twists and turns this one brings. I still don't appreciate the somewhat sudden endings to all these films though and would like a bit more meat on the backend, but like I said before that's the 1940's style here. Overall, a better film than Saboteur and overall a pretty solid film. We aren't quite at the legendary status of Hitchcock films yet, but we are getting there!",
            "review_date": "2012-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may have been Hitchcock's personal favorite of his own films, but it was not mine. Still, a good movie. The build-up of the suspense was perfect and the tension between young charlie and her namesake was great.",
            "review_date": "2012-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the film but somehow i feel it has not aged too well; Also I felt the ending to be incomplete.",
            "review_date": "2012-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have you ever had a family member that you dearly love who has been keeping a dark secret about themselves from you for your whole life? If so, then you'll be the first to relate to the main character of Alfred Hitchcock's 1943 mystery Shadow of a Doubt. Our main protagonist is Charlotte \"Charlie\" Newton (Teresa Wright), a bored teenager in a small California town who has just learned that her uncle (Joseph Cotten), with the same name, is coming to town to visit her and her family. During his visit, she notices that her uncle is acting very odd at times, mainly when he refuses to have his picture be taken by strangers. Things change further when she discovers the last thing that her uncle would want her to discover, that he may indeed be a murderer on the run. \n\nDirector Alfred Hitchcock considered Shadow of a Doubt his favorite film out of all the films he made. Coming from the same talented filmmaker who made Rear Window (1954), Vertigo (1958), North by Northwest (1959), and Psycho (1960), that's a high honor indeed. Looking at it again, I can certainly understand why that might be. It's basically a story about a young woman who goes through the most backstabbing situation she could find herself in. That, of course, being that she has a family member whom she can no longer trust because of a crime they committed. What's worse is that she wanted to know what secret this person was keeping from her in the first place. It's devastating because she sees another side to this person that she never thought she'd see and also didn't want them to become. \n\nShadow of a Doubt tells a powerful story that reminds us that there are going to be family members that aren't always going to be as trustworthy as we think they will be. No matter how hard we try to keep in touch with everyone in our families, there's always going to be difficulty in keeping tabs on each other and trying to know everything about a certain family member. In the case of the relationship between Uncle Charlie and Charlotte's mother Emma (Patricia Collinge), we have a brother-sister relationship in which the brother is trying to keep a secret that would separate him from his sister further. \n\nIf there are times in this movie in which you have to close your eyes because the worst thing imaginable is about to happen to these characters, then that means this film is doing its job. The reason being is that through all this dread with Charlotte emotionally separating further from her uncle, there is underlying suspense that indicates that it only gets worse. The screenplay by Thornton Wilder, Sally Benson, and Alma Reville creates tension all throughout the film and makes these characters feel real. It's fascinating that Charlotte's father (Henry Travers) invites his neighbor (Hume Cronyn) over for dinner every night just to talk about committing the perfect crime. All I can say is it's no wonder Charlotte doesn't react kindly to these conversations at dinner on top of her dilemma with her uncle. \n\nI sincerely believe that films and shows along the lines of Breaking Bad owe their existence to this masterful thriller. Joseph Cotten is chillingly good as the fishy uncle and Teresa Wright is full of life as his most cherished niece. The plot is powerful and very well paced by Hitchcock and his screenwriters. To talk any more about Shadow of a Doubt would only spoil the suspense along with your enjoyment of seeing it firsthand. So by all means, check out this Hitchcock classic and see why it's Hitchcock's own personal favorite.",
            "review_date": "2011-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred's own favorite, so how can you not like it?",
            "review_date": "2011-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only Alfred Hitchcock knows how to mix drama and suspense so beautifully in a peaceful family movie.",
            "review_date": "2011-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another classic from the master. Great suspense, great acting, and great storytelling all make this film one of the first Hitchcock classics.",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "up until the big climax at the end, which feels incredibly silly and looks it, this film is fantastic. Granted, you can pretty much tell from moment one Joseph Cotten is up to something, and I wish this had been more subtle. I wish it wasn't so incredibly obvious. This does not make Cotten's performance bad, on the contrary,  he's incredibly terrifying. But without a doubt the best in show is Teresa Wright, whose performance is absolutely brilliant. She goes from innocent to paranoid so naturally and believably, that you're waiting to see what she'll do next and if Joseph Cotten will thwart her. Still, with a better climax and an ending that doesn't feel so rushed, this would've easily been counted as one of Hitchock's best. As it is now, it's a good movie with a fantastic performance from Teresa Wright.",
            "review_date": "2011-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may have been Hitchcock's personal favorite, but for me, Shadow of a Doubt wasn't as great as his other films. However, you've got to hand it over to Joseph Cotten's chilling role as Charlie Oakley for making this a somewhat stylish thriller. At the same time, I wouldn't say the same thing for the other performances - definitely not for Teresa Wright's forever chiming Charlie Newton. By far  the biggest disappointment of all was, in my view, the final scene at Charlie's funeral - what a sudden and anti-climatic ending! Let's just hope that none of the other Merry Widow murderers end up in such a macabre and lifeless funeral ceremony as that. And one more thing - wasn't it obvious to Mrs Newton that the garage scene, where Charlie almost got suffocated to death, was no accident? Seems like the sky would have fallen on her and yet she and her family would remain just as oblivious. Those wonderful techniques Hitchcock used in this (such as the dialogue and that revelation scene in the library where Charlie finally realizes her ideal uncle's real worth) were what I ultimately enjoyed. Other than that, Shadow of a Doubt left didn't leave me a shadow of a doubt with regards to its drab plainness.",
            "review_date": "2011-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock's \"Shadow of a Doubt\" is a ver well executed, superbly acted, and highly suspenseful drama. Hitchcock's style of direction is classy, constructive, and intense. The performances from both Teresa Wright and Joseph Cotten are effective and natural. While the film moves at a slow pace and the plot is slightly predictable, \"Shadow of a Doubt\" is nonetheless a great film that represents Alfred Hitchcock at his typical stance as a director. It may not come across as his best film, but it still strikes chords as an engaging and interesting one.",
            "review_date": "2011-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock's \"Shadow of a Doubt\" is a ver well executed, superbly acted, and highly suspenseful drama. Hitchcock's style of direction is classy, constructive, and intense. The performances from both Teresa Wright and Joseph Cotten are effective and natural. While the film moves at a slow pace and the plot is slightly predictable, \"Shadow of a Doubt\" is nonetheless a great film that represents Alfred Hitchcock at his typical stance as a director. It may not come across as his best film, but it still strikes chords as an engaging and interesting one.",
            "review_date": "2011-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Compelling viewing of the highest order and a disturbingly convincing performance of a deluded murderer that emanates with defiance and intrigue. The development and interplay between the two Charlies (uncle and niece) can leave one desperately uncomfortable but in hindsight, there was no better way for Hitchcock to play this out and acheive his trademark dosage of taut suspense. Without any demonstration of physical violent acts (mainly to do with studio restraints and censorship), he managed a truly remarkable feat with this magnificent thriller.",
            "review_date": "2011-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "classic hitchock noir.",
            "review_date": "2011-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starring: Teresa Wright, Joseph Cotton, Macdonald Carey, Henry Travers, and Patricia Collinge\r\nDirector: Alfred Hitchcock\r\n\r\nEnnui-ridden teenager Charlie (Wright) finds her drab world filled with life and hope of excitement when her legendary, globe-trotting Uncle Charlie, the man she is named for, pays a surprise visit to her and family. But Charlie's delight soon gives way to suspicion, then fear, then terror as she gradually comes to realize that he is hiding a dark secret -- that he is a serial killer on the run.\r\n\r\n\r\n\r\nThis is said to be Hitchcock's personal favorite among all the movies he made, and he was well within his rights to be very, very proud of it. With a script that is absolutely perfect in every way, a setting that captures the essence of the idyllic small American town so perfectly that Ray Bradbury would be moved to tears, and a cast that all deliver great performances in parts it seems they were born to play, there simply is not a single sour note in this movie.\r\n\r\nIt starts with a script that deftly sets up all its characters and manages to draw them as fully realized, three-dimension people within minutes of their first appearances on screen... usually through subtle character actions or exchanges. The most impressive of these is the film's lead character, a typical whiny restless teenager who in a script from lesser writers and interpreted by a lesser director would have been extremely annoying and someone you might wish ill upon. However, the character is so deftly written here and her reactions so believable--a mixture of childishness and adult and perception of what it means to be an adult--that you are rooting for her almost from the moment she is introduced into the story. \r\n\r\nThe same is true of the opposite side of the coin, the film's other Charlie... a man on the run with a secret, who may or may not be a serial killer. Like Young Charlie, he is deftly established a few touches that are followed up with further development that lends texture and deep character to him. \r\n\r\nThese two characters, and the oft-referenced \"special bond\" that exists between them, are the solid center around which story and other characters rotate, each developed as they relate to the two Charlies and each eventually emerging as fully realized as they are. Even the \"special bond\" ends up taking on personality, evolving from childish imaginings born of coincidences to something more real and that gives sinister weight to either Charlie when the younger of the two promises she will kill the older one if he hurts her mother.\r\n\r\nHeck, this script is so perfect that the insta-romance the develops between Young Charlie and one of the detectives who come into town on Uncle Charlie's tail doesn't bother me one bit. Where this has nearly ruined a couple other Hitchcock films for me, here it \r\n\r\nOf course, as well-written as these characters are, they would have withered in the hands of the wrong actor. Here, the casting is so absolutely perfect that the actors have an exponential impact when it comes to breathing life into the characters. Casting Joseph Cotton as a serial killer, who up to this point in his career had played nothing but lovable good guys, was a stroke of genius, and petite Teresa Wright nails her teenaged character perfectly despite being 25 at the time this film was made. Even the bit-players--like the small town's librarian and traffic cop--fit their roles perfect and instantly make the audience feel they know the person in question.\r\n\r\nThe great script and the perfectly cast actors are further supported by a great location and even better sets. A problem I sometimes have with Hitchcock's American films is sometimes jarring and obvious difference between footage made on sets or the studio back lot versus footage made on location. The quality of the environments change so drastically that I am sometimes pushed out of being absorbed in the movie. Not so here. Location and sound stage merge seamlessly and undetectably to form a perfect whole.\r\n\r\nIf you only watch one Hitchcock film, this is the one to choose.",
            "review_date": "2011-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock's first masterpiece is an amazing character study and features my favorite performance from the great Joseph Cotton. A must see.",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Master's self-proclaimed \"favourite film\". The simple yet devilishly effective plot, smart casting and glorious use of black and white photography will keep you hooked.",
            "review_date": "2011-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In one of Hitchcock's earlier American films starring Joseph Cotten and Teresa Wright, Uncle Charlie comes to visit his niece namesake \"Charlie\" and the rest of the family. Initially the whole family seems to be in a funk until they find Charlie (Cotten) is coming to visit them in Santa Rosa. However, what they do not know is that he is a wanted murderer. Over time \"Charlie\" (Wright) becomes suspicious of her uncle and finally comes across the truth. Her uncle figures out what she knows and decides he must get rid of her. Living in constant peril, \"Charlie\" finally is forced to face him. In the ensuing struggle she fights madly for her life. With the constant discomfort and suspense, Hitchcock proves how powerful thrillers can be even in the home. Cotten and Wright both do a very good job in this film. Supposedly this was Hitchcock's favorite among his own films. I think it certainly one of the best of his lesser known movies.",
            "review_date": "2011-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Cotten, a tragically forgotten actor today, shows what type of dynamic a toe he was, playing the family member we only thought we knew.",
            "review_date": "2011-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simplistic at times, but still a very good early Hitchcock film.",
            "review_date": "2011-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aside from the weird sexual tension between uncle and neice it was a really good suspense/drama. And the ending was very good.",
            "review_date": "2011-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely Superb. Cinema at its best. Alfred Hitchcock's favourite film and in my opinion, his greatest all round film is an absolute masterpiece.\n\nHitchcock uses amazing themes and subtext in this film that all seem to connect with one another. The acting is spot on and the cast is brilliant. Every single role played from each cast member was interesting and unique. Hitchcock really couldn't have asked for a better cast. Joesph Cotton and Teresa Wright deliver knockout performances, especially Joseph Cotton who plays a character so sick and twisted, he leaches off and murders wealthy young women.\n\n The \"CONTROVERSIAL\" monolgue that Joseph Cotton also delivered in the film about \"women\" at the dinner table would've been somewhat shocking for audiences back in 1943. It's still somewhat shocking when you see that monologue today because it's so raw and features an abundance of anger and emotion. Even when you look at the film today, it is so insightful, extremely thought provoking and has a major impact on you when you watch it. It's a timeless film, it's  Hitchcock at his best. Shadow of a Doubt deserves maximum attention.",
            "review_date": "2011-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of times I have to watch older movies through a certain filter in order to appreciate them fully. This film requires no such mindset; masterful performances on all accounts, and the humanity and truly engaging nature of the story and its characters made this film a real joy to watch.",
            "review_date": "2011-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A near-perfect film. One of Hitchcock's best from the 40s.",
            "review_date": "2011-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing I can really say that hasn't already been said about anything Hitchcock's created. Shadow of a doubt once again shows that the guy knows how to create legitimate suspense and tension.",
            "review_date": "2011-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great, but the end was kinda flat.",
            "review_date": "2011-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good watch.Alfred Hitchcock's movie has always been my all time favorite.",
            "review_date": "2011-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful thriller. Charlie (Wright) is really excited when her Uncle Charlie (Cotten) is coming to town. But when Uncle Charlie is acting suspicious (tearing up newspapers, not letting his picture get taken) Charlie is determined to find the truth. Since Uncle Charlie ripped up a part of the newspaper, Charlie goes to the library to look at what wasn't there. She's shocked to see an article about the \"Merry Widow\" murderer, but is really freaked out when the latest victims initials is on the ring her uncle gave her. Soon the suspicion grows, and Charlie is scared for her life. Hitchcock's career was just getting started in America, and every film he made starting in 1940 was a big hit, and EVERY actor wanted to work with him. He got the best YET AGAIN-- great actor Joseph Cotten and award-winning actress Teresa Wright who both give excellent performances. Many many times, Hitch has called \"Shadow of a Doubt\" his favorite American thriller, and because I've seen many of his movies, I can say this is definitely one of his best. Though it isn't in the ranks of others like \"North by Northwest\" or \"Psycho\", \"Shadow of a Doubt\" stays consistent and is exciting throughout. Recommended.",
            "review_date": "2011-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie uses a library.  (3 1/2 stars out of four.  because Joseph Cotton would've killed his own cousin, if she hadn't over-powered him(somehow?)and pushed him off the train first.)",
            "review_date": "2011-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not one of Hitchcock's better works.  Creepy uncle comes into town to move in.  His niece figures out he's a mass murderer and becomes his next target.  Storyline had promise but the movie is simple and dull.",
            "review_date": "2011-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's from the 40's and it's good.",
            "review_date": "2011-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a very scary twisted movie!",
            "review_date": "2011-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitch has said this is his favorite of the films he made. That he captured perfectly here what he tried to in all his other films. While it's not my personal favorite, it is a solid little thriller that uses character and mystery to the great advantage of the overall experience. It's got some great acting and an awesome story. Definitely one of the Hitchcock greats.",
            "review_date": "2011-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the scariest nightmares I have is finding out that someone close to me, be it a family member or friend, is a serial killer. That's a scary thought, and Alfred Hitchcock captures the pure fright of such a situation in Shadow of a Doubt, one of Hitchcock's best films.\r\n\r\nIn this story, Charlie a young woman is ecstatic about her Uncle Charlie coming to visit her and her family, but as the story progresses, she slowly begins to realize that Uncle Charlie may not be who he says he is. This story isn't anything original, even for Hitchcock, but what makes this story special is the way the story unfolds. The film is told from Charlie's point of view, and we go through what she's going through. Before we find out about Uncle Charlie's past, we get to know him just like the other family members do, so that we understand how impossible it sounds to them that he could be a killer.\r\n\r\nThe build-up for this film is some of the greatest I have ever seen in film. The film makes scenes that seem normal and yet make you sit on the edge of your seat. Alfred Hitchcock has always been a fantastic director, and this is some of his best work. He creates suspense with nearly every single shot, even if the scene on screen is charming. This creates an atmosphere in which anything can happen and gives the movie an unpredictable aspect about it.\r\n\r\nThe performance for Uncle Charlie is also very good. Joseph Cotton gives one of the most realistic performances ever. He does good as the man we know is hiding something, and yet at the same time gives a façade so flawlessly that nobody suspects who he really is.\r\n\r\nThis film is almost flawless from start to finish. The beginning picks up your undivided attention, and the ending comes to a satisfying emotional turmoil and takes your breath away. The pacing is done really well, the acting is great from everybody, and there some real romantic chemistry between the two leads.\r\n\r\nAlfred Hitchcock often cited this film as his favorite film of his own, and who could blame him? Even though I've only seen a few, out of those, this is my 2nd favorite film that he has made, behind only Rear Window. A masterpiece in its own right, Shadow of a Doubt isn't given enough recognition, especially considering how well-crafted it is. Bravo.\r\n\r\n9.9/10",
            "review_date": "2011-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock and I wouldn't have gotten along. He claimed that \"Shadow of a Doubt\" was his favorite film and it's my least favorite of his. He claimed that Jimmy Stewart ruined \"Vertigo\" and he ended up hating the film and never speaking to the actor again, I on the other hand think it's his crowing achievement and a fantastic Stewart performance. For me, \"Shadow of a Doubt\" is just to disparate for me to embrace. While each of the elements seem interesting on their own, none of it congeals. The film has no back story, you are supposed to be caring for Charlie (or at least that's what the overwrought score seems to convey). How can we care for this main character (and Young Charlie) if we don't know anything about them. We know she is good and he is bad, but WHY? How can we possibly love a character when we know so little about their decision making process? To me, this is lazy filmmaking. The film tries to be thrilling, funny, dark, romantic and fails every step of the way due to the lack of characterization. All we end up with is a film that will only scare the naive morons of Middle America... (which is what the film is about, so maybe it works?... nahhh)",
            "review_date": "2011-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To a starving man, anything tastes fantastic. This movie sated information starved generations. In two hours nothing much happens. It pales in comparison to even the most boring movies of the modern era. Any positive review needs to be qualified with \"for the time\", doing otherwise is like talking about how Sony Walkman is an incredible portable music player or something. Irrespective of how good it was, how ahead of its time it was, today it's appallingly bad. Just like this movie.",
            "review_date": "2011-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best, most suspenseful Hitchcock films ever made!",
            "review_date": "2011-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock's favorite film is not my favorite film. However like most of his movies, it certainly is great, especially because of Joseph Cotten who was a great underrated actor and is someone I've admired for quite some time now. It's a good story, it does not lose itself and it's pretty straightforward. It has the classic Hitchcock feel with the tension and the suspense and mystery. I find it hard to call anything but Rear Window his finest work, that was his masterpiece along with The 39 Steps, those are the two that I will always remember one of the greatest directors of all time for.",
            "review_date": "2011-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why Joseph Cotten isn't regularly  lauded as one of the greatest actors of our time i'll never know. He is absolutely fantastic in his role as the nefarious Uncle Charlie. Cotten plays the role masterfully exuberantly     charming yet hiding a malevolence unbeknown to his sisters family. Teresa Wright deserves praise for her performance as well. She begins the film as Cotten's innocent young niece, but as the truth unravels you can see her age with every scene the more she uncovers. That childhood innocence and love for her Uncle slowly being destroyed. Hitchcock's favourite and certainly one of mine.",
            "review_date": "2011-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I did find this very engaging to be honest. I think in todays day and age, you wouldn't care about ruining your families name by confessing to have a murderer in the family so you really couldn't pull this movie off in the modern age world. The suspense was great and character development was even better... I mean we all felt sorry for Charlie, but we all hated UNCLE Charlie!",
            "review_date": "2011-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love it when Hitchcock gets perverse. And there's nothing more perverse than a niece lustin' after her uncle, and he lustin' for her right back.",
            "review_date": "2011-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Familiar Hitchcock elements set against 1930's America and a masterful performance by Joesph Cotton. The story moves quickly becoming more ominous after every scene, brilliantly edited and builds to a brilliantly shot conclusion.",
            "review_date": "2011-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A riveting and heart-pounding suspense thriller, in which Hitchcock dives into character development like no other film.",
            "review_date": "2011-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and well acted thou a little routine thriller film.",
            "review_date": "2011-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Alfred Hitchcock classic.",
            "review_date": "2011-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For lovers of thrillers this film will be a treat!",
            "review_date": "2011-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mind bending battle of wits between a young girl and her disturbed uncle.",
            "review_date": "2011-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The beginning of things to come: Hitchcock was first in true form here.  But ultimately for me the movie is shallow.  If you take away the technical excellence you've got nothing left.  Then again that's true of a large portion of Hitchcock's work; with the exception of a few masterpieces (some that are masterpieces perhaps also only on their technical merit, but that burst at the seams with it), many of his pictures seems to stem from tackling the challenge of taking one suspenseful idea that is probably in no way new and turning into an entertaining low-budget feature-length movie.  The sort of thing Stephen King has done with writing (King once referred to himself as \"the literary equivalent of a Big Mac and fries\").  At any rate, this is exactly the sort of movie that backs up my assertion that Charlie Chaplin and Stanley Kubrick are the two smartest people ever to come out of Hollywood; while Shadow of a Doubt is a masterful effort by a consistently strong auteur, the bulk of Hitchcock's work could be obliterated by almost any single randomly selected Chaplin or Kubrick feature.",
            "review_date": "2011-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a really good one, murderous but still gentle!",
            "review_date": "2011-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock called this the favourite of the films he directed. Knowing that, I was thoroughly disappointed by the rapid pace at which the plot unraveled, and the severely anticlimactic - even laughable - finale.",
            "review_date": "2011-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intriguing, thrilling, old-fashioned suspense.",
            "review_date": "2011-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film does a lot of things right, with its great suspense, acting and writing; but the story isn't developed well enough, most of the characters are dull/annoying, the actress who plays as Ann doesn't know how to act and the main protagonist's actions and the way he talks, makes it too easy to figure out that he is the killer in this film. \r\n\r\nThis film doesnt have the same charm as Hitchcock's other films, it has its moments but its highly passable because of its flaws. 5.5/10",
            "review_date": "2011-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good indeed. Recommended.",
            "review_date": "2011-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hitch's less potent thrillers, \"Shadow Of A Doubt\" is definitely worth seeing but it lacks the artistic touch of most of his films and is not a directorial achievement for the master. It is about the co-existence of good and evil in society but also in the very same person, a theme used in many of his films; here, though, it ends up being a fight between the two and, inevitably, sails towards conventionalities.",
            "review_date": "2011-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3.5/4.0\r\nConsidered as Hitchock's first masterpiece and a personal favorite of the director, \"Shadow of a Doubt\" feels like of the least Hitchcockian of the auteur's efforts possibly due to its insights into pre-War American suburban life thanks to its Santa Rosa, California setting. \r\nUncle Charlie (Joseph Cotton) decides to visit his sister Emma (Patricia Collinge) and her family to the excitement of Charlie (Teresa Wright), his eldest and most favorite niece who is named after him. Uncle Charlie brings with him lavish gifts and over time she gets to feel something is fishy especially when they are visited by two supposed surveyors who turn out to be detectives (she knows of it after Det. Jack Graham played by Macdonald Carey takes her on a date). Turns out her beloved uncle is the wanted serial killer known as the \"Merry Widow Murderer\". \r\nThe tension really builds towards the second half of the movie when Charlie and her uncle turn confrontational. Cotton is good playing the sweet faced killer - you really feel he continues to deceive us until the very end of the film. It holds well after all these years - it is a clean, well and smoothly layered and constructed piece of cinema. \"Shadow of a Doubt\" is definitely a unique movie within Hitchcock's extensive resume but not one of his utmost best! Nominated for One Oscar: Best Writing, Original Story.",
            "review_date": "2011-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some legendary lines, but the ending wasn't quite to my liking.",
            "review_date": "2011-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The grandmaster of suspense and thriller, the greatest director of all time Alfred Hitch cock's one of the most praises masterpieces, wonderfully directed and innovation of many corners of creations..a must see for Hitchcock fans..according to his granddaughter , this is his fav piece of creation.its at a time parallel and moral dualism, self confusion for what to do..really a great experience to see this true masterpiece..",
            "review_date": "2011-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Those were the days in Santa Rosa.",
            "review_date": "2011-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hitchcock's finest. Simple, sofisticated and nerve-wrecking, just like any other great film from the master of suspense.",
            "review_date": "2011-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The scene with the two Charlies in the bar is amazing.  Joseph Cotten is perfect in this role.  Some very memorable Hitchcock images: the way he films Charlie's speech at diner, Charlie's turnaround move at the top of the stairs, Charlie choking the air by the window.",
            "review_date": "2011-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another solid film by Hitchcock.",
            "review_date": "2011-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That's my Favourit Hitchcock Movie Film Noir par Excellence Thrilling Story, Beautiful Cinematography, Great Acting and Bombastic Music",
            "review_date": "2011-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best Hitchcock, but still an enjoyable movie.",
            "review_date": "2011-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really great story, amazing acting and awesome craft. One of my favorite Hitchcock films. I also really enjoy the subtle allusions to the devil/absolute evil.",
            "review_date": "2010-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"What does he do? Oh, he's just in business, you know, the way men are.\"",
            "review_date": "2010-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Hitchcock. Great stuff.",
            "review_date": "2010-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock said that this movie was his personal favourite, and I can see why. A story about a Californian family receiving a visit by their favourite uncle from New York, unaware of the fact that he might be a serial killer. A masterpiece that will hold your breath till the movie finishes.",
            "review_date": "2010-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best of Hitchcock but it's an interesting little story.",
            "review_date": "2010-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock's favorite film is not my favorite film. However like most of his movies, it certainly is great, especially because of Joseph Cotten who was a great underrated actor and is someone I've admired for quite some time now. It's a good story, it does not lose itself and it's pretty straightforward. It has the classic Hitchcock feel with the tension and the suspense and mystery. I find it hard to call anything but Rear Window his finest work, that was his masterpiece along with The 39 Steps, those are the two that I will always remember one of the greatest directors of all time for.",
            "review_date": "2010-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great suspense film - still left thinking at the end, twists, turns and thrills. Great acting, great script and superbly filmed a classic",
            "review_date": "2010-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock's first masterpiece!",
            "review_date": "2010-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Alfred Hitchcock masterpiece, and while it's not at the same level of Vertigo or Rebecca, it's very, very close to their quality level. An amazing story-telling, fascinating characters, a creepy and very cold-blood villain (superb Joseph Cotten), a clever, charming and brilliant performance by Teresa Wright, and even that little girl made me laugh with the funny smart things she said. The plot is structured perfectly, an amazing script. I would call it a beautiful dark thriller: charming, electrifying and exciting in equal proportions. Hitchcock's own personal favorite, is one of his best, no doubt about it.",
            "review_date": "2010-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lost track of what the main characters wanted about two-thirds of the way through, but still a thought-provoking and surprisingly funny movie mess of a movie with a number of great comic performances.",
            "review_date": "2010-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't get it. I assumed a twist ending was coming, but I guess it was a shocking one for 1943.",
            "review_date": "2010-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock's 1940s movies are really the best.  If you love his movies, you can't miss this one.",
            "review_date": "2010-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Alfred Hitchcock masterpiece, and while it's not at the same level of Vertigo or Rebecca, it's very, very close to their quality level. An amazing story-telling, fascinating characters, a creepy and very cold-blood villain (superb Joseph Cotten), a clever, charming and brilliant performance by Teresa Wright, and even that little girl made me laugh with the funny smart things she said. The plot is structured perfectly, an amazing script. I would call it a beautiful dark thriller: charming, electrifying and exciting in equal proportions. Hitchcock's own personal favorite, is one of his best, no doubt about it.",
            "review_date": "2010-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may not be the most celebrated Hitchcock film, but it is one of his favorites. The only other Hitchcock film I've seen to date is \"The Birds.\" Yes, I am missing out on many classic films, currently working on it. Anyways, Shadow of a Doubt is a masterfully made film. It is more suspenseful than most films I've seen in recent years. The subtle acting of the two leads also helps propel this film.\r\n\r\nThis film is, once you boil it down, about the relationships between two characters: Charlies and... well Charlie. They are both seemingly nice people, and it is established early that they are not interested in material things. Of course both have deal with this very differently. In the beginning of the film Hitchcock makes their relationship appear as if it may lead to a sexual one. Of course they are Uncle and Niece, and so seeing the two flirting and being close make the viewer very uncomfortable. It is rather brilliant.\r\n\r\nThere are so many motifs, subtleties and attention to detail that makes the film intriguing without even focusing on the plot. Hitchcock uses camera angles, recurring themes and photographic images to aid in the storytelling. Take the introductions of Charles and Charlie. Both these scenes are parallel to each other, showing both characters lying on their bed, shrouded in shadows. These small touches, and motifs really drew me in to the film, and made me yearn to watch more, and isn't that what a film is supposed to do?  \r\n\r\nThere are several images in the film that are hauntingly beautiful. As Charlie's brother stands at the train station, becoming enveloped by the shadows of the train, When Uncle Charlie is describing his hatred for rich widows and turns to the camera and says \"Are they?,\" And the devastating scene of young charlie realizing that her uncle is getting away with his crime and stares at him in the doorway. All of these images will most likely be etched in my memory for eternity. \r\n\r\nThis film has no gratuitous violence, in fact it has none. It is a quieter film than most thrillers today. I will need to watch it again in order to pick up on the numerous details of it. I suggest you do the same.",
            "review_date": "2010-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is so perfectly titled. It just haunted you intellectually in the meantime giving you the clues bit by bit.",
            "review_date": "2010-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A expertly crafted, supremely entertaining piece of work from the master of suspense - Alfred Hitchcock. While the ending leaves a gaping plot hole and some of the dialogue can come across as corny and obvious, the positives outweigh the negatives largely here. Both Joseph Cotten and Teresa Wright do what is expected of them skillfully (although the beginning of their relationship is quite, unintentionally, somewhat inappropriately \"touchy\", if you will). Still, what makes this film a classic is Hitchcock's feel for increasing suspense until his coda, where everything explodes and its entirely satisfying (the act, that is, not quite the aftermath). Definitely a must-see for any Hitchcock fan.",
            "review_date": "2010-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "brilliant and classic. all the more amazing when you realize it was shot entirely on location",
            "review_date": "2010-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As I said, Hitchcock is hit or miss, and this one is kind of neither.  The usual Hitchcock problems are still there, with the stupid criminal making stupid mistakes and good people being overly good, but the flow is smooth and for once, the girl in the movie is actually smart, although she is still annoying.",
            "review_date": "2010-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Shadow of a Doubt\" wastes no time in telling you that the main character, Charlie Oakley, is guilty. This is because \"Shadow of a Doubt\" is not a mystery film: it's suspense. Alfred Hitchcock once said that he was not interested in mystery. He explained that the surprise felt when the mystery is revealed is nothing compared to keeping suspense throughout the film. I agree.\r\n\r\n\"Shadow of a Doubt\" is a film about a man named Charlie Oakley, a real charmer with plenty of swagger to go around. From the very opening of the film, we can see that he has done something wrong and that he is being watched. Charlie decides to hide away as a guest in his sister's house. His niece, Charlotte, was named after him, and she goes by the name \"Charlie\". As soon as Charlie comes to stay at the house, everyone is happy to see him, most of all Charlotte. But as she begins to learn more about him, and what he has done, she wants him out. The problem: Charlie knows that she is privy to his crimes, and will stop at nothing to keep her silent.\r\n\r\n\"Shadow of a Doubt\" is a taut suspense film with plenty of dark humor as well. Like much of Hitchcock's work, it will keep you on the edge of your seat till the very end.",
            "review_date": "2010-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have one gaffe with the story in this amazing film by Alfred Hitchcock. I'm surprised how under the radar it is because it's simply brilliant. The script is full of substance that goes deeper than most and the actors compliment it to a T.",
            "review_date": "2010-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not one of Hitchcock's best but still worth watching.",
            "review_date": "2010-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good thriller but neary seventy years on the story has lost some of its impact and so is not one of Hitchcock's more exciting movies.",
            "review_date": "2010-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was Hitchcock's own personal favorite of his American movies. It's a real delight to watch. Joseph Cotten is great as creepy Uncle Charlie,a suave killer,wanted back east for relieving widows of their wealth and their lives. Returning to his sisters household to hideout.This movie sure has it's tense moments we've all come to love from a Hitchcock movie,and towards the end,there was a real sense of dread. Funny,gripping,and expertly shot by Joe Valentine,this is a small but memorable gem, and a must see for all Hitchcock fans",
            "review_date": "2010-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting and nail-biting Hitchcock flick, and without doubt a real classic that should not be avoided.",
            "review_date": "2010-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a little surprised along with most people that Hitch is often quoted as saying this is his favorite film.  It was pretty decent, with some minor mystery and intrigue, but some of the performances are over the top and the ending is abrupt and anti-climactic.",
            "review_date": "2010-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shadow of a Doubt is one of my favorite Hitchcock films I've yet to see. There's something so compelling about Charlie Oakley, who is a man on the run. He's charismatic, charming and well-spoken, but secretive. Joseph Cotten seems the perfect actor for this role as he can also pull off the menacing look a character like Charlie needs. \n\nSpoiler Alert I guess, I was thinking almost hoping that a twist would happen somewhere along the line where Cotten's character would be revealed to be innocent (which kind of did happen, but not exactly), and all the misleading evidence would be explained. Well, this didn't happen, but I kept thinking that he really wasn't a serial killer. Even after the death traps for some reason I still remained skeptical, although it should've been obvious at that point. I think that's what made my viewing so compelling though - I thought just as Charlie Newton did, that he couldn't have been the killer. I think that perspective is useful in relating to Teresa Wright's character and it makes Charlie Oakley seem that much more mysterious and interesting.\n\nRegardless, it's a great movie.",
            "review_date": "2010-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inexplicably overrated. There isnt enough of a story or ideas to sustain a two-hour long narrative. The niece suspects her beloved uncle of being a criminal, and so he is - thats it. The film lacks suspense, curiosity or surprise. This is the exact same story as 'Suspicion'. Only it ends the other way.",
            "review_date": "2010-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"You think you know something, don't you? You think you're the clever little girl who knows something. There's so much you don't know. So much.\"\n\nCharlie (Teresa Wright) is thrilled when her adored uncle (Joseph Cotten) comes to visit her family and shake her out of the malaise and monotony that she's been feeling. But when suspicion is cast on the man that she was named after, can she accept that he might be a killer? If he finds out what she suspects, could that put even the life of his beloved niece in jeopardy? \n\nI don't really know how to review Shadow of a Doubt. I found myself liking it, even though I can't give any particular reasons why. In fact, I found it to be meandering and a little unfocused, at times. Yet it still left me with a positive impression. It had a different feel from any of the other Hitchcock movies that I've seen. There's little mystery to it, and the thrills and suspense are of a different kind than those that were offered in North by Northwest or Notorious. I'd struggle to compare this to any of his other movies. Yet, the director felt that it was his favorite. I can't deny that I found the relationship between Charlie and her uncle to be interesting, in all its phases. And since so much of the plot hinges on that, then perhaps that explains some of Shadow of a Doubt's likeability.   \n\nI'd say that if you're a fan of Hitchcock, give this film about family menace in Santa Rosa a try. It's a bit of an odd duck, yet it was entertaining, nonetheless. I put it firmly in the middle of the pack of Hitchcock's movies.",
            "review_date": "2010-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock often stated that â\u0080\u009cShadow of a Doubtâ\u0080\u009d was his favorite among his American films. As I finished watching it for the first time recently, it occurred to me that this may be because of just how â\u0080\u009cAmericanâ\u0080\u009d the atmosphere and aesthetics of the movie are. This can undoubtedly be attributed to Thornton Wilder, who receives story credit on the film, and whose brilliant 1938 play â\u0080\u009cOur Townâ\u0080\u009d also depicts how unforeseen changes can affect a small American town. Hitchcockâ\u0080\u0099s first American film, and my personal favorite of his, was â\u0080\u009cRebeccaâ\u0080\u009d. The change in mood and tone between that and â\u0080\u009cShadowâ\u0080\u009d is considerable, and it shows the versatility of the director, as he maintains his style through unique blends of culture and genre.\n\nCharlotte â\u0080\u009cCharlieâ\u0080\u009d Newton (Teresa Wright) is a bright young girl who is intensely bored and dismayed with her uneventful life. She lives with her family in a small Northern California town where everyone knows each other. That is until she one day decides that she is going to send a telegram requesting her Uncle Charlie (Joseph Cotten), whom she is named after, come and visit. Charlie is her favorite relative, and as she arrives at the post office to send her message, she discovers that he is already en route to visit her and the family. This is where it first becomes clear that there is either something telepathic going on between the two characters, or perhaps Hitchcock and Wilder are playing around with coincidence and chance.\n\nThe most interesting thing about the characters that inhabit this small town is that each of them is slightly off-kilter from what one would expect. Charlotteâ\u0080\u0099s chirpy mother Emma (Patricia Collinge) pitter-patters around the house, yapping on and on about topics that have long been forgotten by all others in the room. When her brother Charlie arrives, she is so delighted, as she dotes upon his every need and concern, naively shrugging off his bizarre and morose rants about women and the world itself. These moments come quite unexpectedly, and without much warning, as do most of Charlieâ\u0080\u0099s darker impulses. He is, after all, her â\u0080\u009cspoiledâ\u0080\u009d younger brother. Why should he have anything to hide?\n\nWith â\u0080\u009cShadowâ\u0080\u009d, Hitchcock is able to masterfully blend the typical small-town America with the darkness that quietly prowls beneath it.  After Charlotte begins to suspect that Charlie is whom the papers are calling the â\u0080\u009cMerry Widow Murdererâ\u0080\u009d, strange and sinister events start to unfold, as a couple of detectives posing as government survey men show up and throw her entire sense of security and perception of her uncle off balance. There are wonderfully placed scenes of comic relief amongst the danger and mystery, featuring Charlotteâ\u0080\u0099s father Joseph (Henry Travers) and his friend Herbie (Hume Cronyn), who are both unsolved crime story enthusiasts. They frequently get together and discuss different ways in which they would murder each other. It provides the film with splendid irony and even suspense in one scene when they are at the dinner table discussing how to get away with murder right in front of murderous Uncle Charlie and his next target. \n\nI recently watched David Lynchâ\u0080\u0099s â\u0080\u009cBlue Velvetâ\u0080\u009d for the first time, and I canâ\u0080\u0099t decide where my thoughts lie with it until I have watched it a second time. I think that there is an undeniable link to be made between Hitchcock and Lynchâ\u0080\u0099s depictions of small-town America being infested and challenged by dark forces. There is a scene in â\u0080\u009cShadowâ\u0080\u009d where Charlie takes his niece to a small â\u0080\u009cundergroundâ\u0080\u009d club, a place she says she would never normally go. There is a waitress who speaks to them briefly, and it is in this scene that I was reminded of â\u0080\u009cBlue Velvetâ\u0080\u009d. From there, many details that followed also reminded me of Lynch, and of the way that he envisioned his small town USA and all of its quirky, off-center characters. The difference lies in how far the two directors go with the split of dark and light, and how far into each they descend. Hitchcock wisely shows the two sides rather evenly, and often times in the same room together. Unlike Dennis Hopperâ\u0080\u0099s character in Lynchâ\u0080\u0099s film, Uncle Charlie doesnâ\u0080\u0099t live in the darkness, but rather the light; the darkness lives in him, and as his desperation grows, he looses control and is forced to act on his inner impulses.\n\nThis is one of Hitchcockâ\u0080\u0099s films that I had never heard much about, and although it is now considered a classic, it didnâ\u0080\u0099t do much business, critically or financially, when it was first released in 1943. I think it was ahead of its time, as many of his projects were. It is an outstanding piece of work that deserves the highest praise possible. The performances by Cotten, Wright, Collinge, and Cronyn (his first film) are pitch perfect. The writing is so sharp and exciting that I would consider it to be one of my favorite scripts of all time.\n\n Charlotteâ\u0080\u0099s mother warns her in one scene, â\u0080\u009cWhen you whisper, anyone could hear you a block away.â\u0080\u009d That line is so well timed, and it is one of the many elements of the movie that elevate it to brilliance. It is a difficult task to blend the darkness and the light, and to still maintain such vivid suspense and biting humor. Hitchcock directs with utter precision and nothing less, and brings us another classic thriller that will hopefully be preserved for ages and ages to come.",
            "review_date": "2010-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock often stated that \"Shadow of a Doubt\" was his favorite among his American films. As I finished watching it for the first time recently, it occurred to me that this may be because of just how \"American\" the atmosphere and aesthetics of the movie are. This can undoubtedly be attributed to Thornton Wilder, who receives story credit on the film, and whose brilliant 1938 play \"Our Town\" also depicts how unforeseen changes can affect a small American town. Hitchcock's first American film, and my personal favorite of his, was \"Rebecca\". The change in mood and tone between that and \"Shadow\" is considerable, and it shows the versatility of the director, as he maintains his style through unique blends of culture and genre.\r\n\r\nCharlotte \"Charlie\" Newton (Teresa Wright) is a bright young girl who is intensely bored and dismayed with her uneventful life. She lives with her family in a small Northern California town where everyone knows each other. That is until she one day decides that she is going to send a telegram requesting her Uncle Charlie (Joseph Cotten), whom she is named after, come and visit. Charlie is her favorite relative, and as she arrives at the post office to send her message, she discovers that he is already en route to visit her and the family. This is where it first becomes clear that there is either something telepathic going on between the two characters, or perhaps Hitchcock and Wilder are playing around with coincidence and chance.\r\n\r\nThe most interesting thing about the characters that inhabit this small town is that each of them is slightly off-kilter from what one would expect. Charlotte's chirpy mother Emma (Patricia Collinge) pitter-patters around the house, yapping on and on about topics that have long been forgotten by all others in the room. When her brother Charlie arrives, she is so delighted, as she dotes upon his every need and concern, naively shrugging off his bizarre and morose rants about women and the world itself. These moments come quite unexpectedly, and without much warning, as do most of Charlie's darker impulses. He is, after all, her \"spoiled\" younger brother. Why should he have anything to hide?\r\n\r\nWith \"Shadow\", Hitchcock is able to masterfully blend the typical small-town America with the darkness that quietly prowls beneath it.  After Charlotte begins to suspect that Charlie is whom the papers are calling the \"Merry Widow Murderer\", strange and sinister events start to unfold, as a couple of detectives posing as government survey men show up and throw her entire sense of security and perception of her uncle off balance. There are wonderfully placed scenes of comic relief amongst the danger and mystery, featuring Charlotte's father Joseph (Henry Travers) and his friend Herbie (Hume Cronyn), who are both unsolved crime story enthusiasts. They frequently get together and discuss different ways in which they would murder each other. It provides the film with splendid irony and even suspense in one scene when they are at the dinner table discussing how to get away with murder right in front of murderous Uncle Charlie and his next target. \r\n\r\nI recently watched David Lynch's \"Blue Velvet\" for the first time, and I can't decide where my thoughts lie with it until I have watched it a second time. I think that there is an undeniable link to be made between Hitchcock and Lynch's depictions of small-town America being infested and challenged by dark forces. There is a scene in \"Shadow\" where Charlie takes his niece to a small \"underground\" club, a place she says she would never normally go. There is a waitress who speaks to them briefly, and it is in this scene that I was reminded of \"Blue Velvet\". From there, many details that followed also reminded me of Lynch, and of the way that he envisioned his small town USA and all of its quirky, off-center characters. The difference lies in how far the two directors go with the split of dark and light, and how far into each they descend. Hitchcock wisely shows the two sides rather evenly, and often times in the same room together. Unlike Dennis Hopper's character in Lynch's film, Uncle Charlie doesn't live in the darkness, but rather the light; the darkness lives in him, and as his desperation grows, he looses control and is forced to act on his inner impulses.\r\n\r\nThis is one of Hitchcock's films that I had never heard much about, and although it is now considered a classic, it didn't do much business, critically or financially, when it was first released in 1943. I think it was ahead of its time, as many of his projects were. It is an outstanding piece of work that deserves the highest praise possible. The performances by Cotten, Wright, Collinge, and Cronyn (his first film) are pitch perfect. The writing is so sharp and exciting that I would consider it to be one of my favorite scripts of all time.\r\n\r\n Charlotte's mother warns her in one scene, \"When you whisper, anyone could hear you a block away.\" That line is so well timed, and it is one of the many elements of the movie that elevate it to brilliance. It is a difficult task to blend the darkness and the light, and to still maintain such vivid suspense and biting humor. Hitchcock directs with utter precision and nothing less, and brings us another classic thriller that will hopefully be preserved for ages and ages to come.",
            "review_date": "2010-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching earl(ier) cinema can be a chore sometimes. I think it was mainly due to talentless acting and the need to provide vast minutes of wasted time to fill in the gaps to an exciting story that would not have had a sufficient runtime. There was something missing in this film: Suspense. This slow-boiler film noir is deemed Hitchcock's favorite film that he has made. I'm sure it looked great on paper, but the delivery was lost in the dull delivery of this film.\n\nIt truly is a shame, because some parts of this were really well done, the famed \"dinner scene\" got me listening intently and made way for a much awaited plot twist. But the characters (especially the women) are one dimensional and at times very annoying and even dim-witted. Surprising coming from the master of suspense.... I just did not feel any real tension.\n\nThis could be blamed on the advancement of technology and the laxness films have these days with the censors, but I do not come from a CGI-loving background, and am very supportive of slower paced films that are both gripping and enjoyable. I could refer to the films of Michael Haneke (particularly Funny Games), a slow-boiling film with not many characters, yet the delivery makes all the difference, whereas in Shadow of a Doubt, you wander around much unneeded sequences for about 90 minutes to finally cut to the chase, and then it just ends abruptly. These are the way films seemed to have been made back then, and especially since the release of Citizen Kane in 1941, there were were some directors trying to emulate Orson Welles' style. This film has some throwbacks to Citizen Kane, but not many, as Hitchcock had a very unique vision.\n\nThis film could have been better. Needed to up the excitement rather than focus on a passive mystery.",
            "review_date": "2010-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of two Hitchcock films that I wanted to seen and have finally seen (the other being Rebecca which I have not seen). This one is brilliant and the best Hitchcock film I have seen so far this year. A beautifully composed film with great parts from Joseph Cotton and Teresa Wright. Very suspenseful and with many great elements, including a beautiful ending. Another great film, and one including trains. Masterpiece! I understand why Hitchcock chose this one as a personal favourite.",
            "review_date": "2010-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Hitchcock film.",
            "review_date": "2010-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Shadow of a Doubt' was Hitchcock's favourite of his films, but it's not mine.  The script was awful and the interaction between the two Charlie's unbelievable",
            "review_date": "2010-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great suspense filled mystery.  Another great work by Hitchcock.",
            "review_date": "2010-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An ordinary person who discovers secret murders committed by a menacing figure who oozes Hays Code kinky eroticism - a Hitchcock classic.",
            "review_date": "2010-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here is a great, early Hitchcock film which features his methodical plot build up. A young woman suspects her uncle of being a serial killer.  As the story moves forward, the audience goes back and forth as to what they really think about Uncle Charlie.  This reportedly was Hitchcock's favorite film.",
            "review_date": "2010-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very solid earlier Hitchcock film. It's definitely not up there with my favorites of his, but it's still quite good. Teresa Wright plays a great Nancy Drew-type schoolgirl and Joseph Cotten plays a great man-with-a-secret.",
            "review_date": "2010-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i wish i liked this more considering it has joseph cotten as the villain but apart from his dinner table tirade about fat rich women the story was a bit slow and bland.",
            "review_date": "2010-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Hitchcock films I've seen. It's dark, but the black humour is truly entertaining and laugh out loud funny. I loved the little kids' conversations as well as the father and neighbour's. It shows very well that the most scary things can be right in your face. Credit to the writers. And remember this was made in early 1940's. Remarkable!",
            "review_date": "2010-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grabs you and makes you hold your breathe until the credits role",
            "review_date": "2010-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So I have a question, how come on the page for this Hitchcock classic, flixter lists Adam Sandler's Click as a film that is \"More Like This?\" That horrid piece of monkey shit does not deserve to be anywhere near anything that Hitchcock has ever done. Not to mention, um let's see, the fact that one's a thriller and the other is a \"comedy\"",
            "review_date": "2010-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I did find this very engaging to be honest. I think in todays day and age, you wouldn't care about ruining your families name by confessing to have a murderer in the family so you really couldn't pull this movie off in the modern age world. The suspense was great and character development was even better... I mean we all felt sorry for Charlie, but we all hated UNCLE Charlie!",
            "review_date": "2010-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing is scarier than having Joseph Cotton as your uncle, well, unless heâ\u0080\u0099s trying to kill you. I really think this is Hitchcock doing what he loves, scaring Middle America. Just when you think the world is safe again and you can live in peace with a nice house and a white picket fence, along comes a psychopath relative. Teresa Wright is amazing and really helps you buy into the fear of living with someone who is potentially a killer and a crook. Hitchcock turns a beautiful little town into a death trap with no escape.",
            "review_date": "2010-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh well, I really have watched a lot of film noir and Hitchcock movies lately, haven`t I? And this is no exeption. This is one of the earlier movies from Hitch, about a not so nice guy named Charlie. The police are after him, suspecting him to be the so-called \"Widow-strangler\". So Charlie leaves town, and decides to visit his older sister and her family to get the police out of his hair for a while. \r\n\r\nHis oldest niece is also called Charlie, and she adores her uncle. But she is a bright young girl, and after some time she starts wondering if everything really is as it seems when it comes to uncle Charlie.\r\n\r\nSo, this is another classic Hitchcock movie. In my opinion it is not in the league of \"Notorious\" and \"Rear Window\", but it is still very good, and it is easy to understand why old Hitch was considers the master of suspense.",
            "review_date": "2010-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupendous Joshep Cotten in remarkable thriller.Shall not miss it.",
            "review_date": "2010-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This lesser-known thriller from Alfred Hitchcock (\"Psycho\", \"North By Northwest\") should get more credit.  I was quite pleased with this film, especially considering it was made in 1943.  The pacing wasn't even that made for a film from this era.  \n\nThis is a story of an uncle who comes and stays with his sister's family.  The uncle's niece is particularly thrilled with this.  We come to find out that there were widows murdered back East and this uncle is a suspect.\n\nThe acting was pretty good in this.  Teresa Wright plays the niece and Joseph Cotten (\"Citizen Kane\") the uncle.  The acting is good.  Cotten could really toggle between being a loving uncle and cold-blooded murderer.\n\nThe story is dark, creepy, and suspenseful.  Alfred Hitchcock had a gift for cinematography.  A definite must-see for Hitchcock fans.  4.5/5 stars.  (4/21/10)",
            "review_date": "2010-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hitchcock's best - and most underrated.",
            "review_date": "2010-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A serial killer hiding in a small town at his sister's home, his adoring niece gets suspicious and \"dear uncle Charlie\" is willing to take all measures to escape any punishment... including killing his niece. Teresa Wright is so adorable and convincing in her role as the innocent niece.",
            "review_date": "2010-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock brings the personification of evil in a suburban neighborhood, resulting in a great build-up of tension, but short-lived however by the sudden, contrived climax. Joseph Cotten was unforgettable as \"Uncle Charlie\", a performance that gives him the right to be part of Hitch's gallery of great villains. If the film was made today, the approach to the \"Uncle Charlie\" character would have been left a little ambiguous, which I think Hitchcock could have pulled off, but it is an artistic license Hollywood is still not ready to allow at that period of time. Joseph Cotten's character, \"The Merry Widow Murderer\" shares the same motivations  as that of Chaplin's Monsieur Verdoux, but their bitter sentiments about the realities of life differs, but there is no doubt that the two were the product of a harsh, unforgiving world.",
            "review_date": "2010-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great slow burner from Hitchcock with some of his best wit and trademark gallows humor.  The suspense lies from knowing when little Charlie will find out about her sinister uncle and what she intends to do about it.  The cast in this film is just great, particularly precocious little Ann.  Hitchcock's sense of pace and control is unrivaled, and not once is the film boring.  I can see why he liked this film so much.",
            "review_date": "2010-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could anyone do much better at kind of this movie of willing well?\r\n\r\nI'd rather to said the film like \"Psycho\" is a durning-snack classic alone in nowadays if I still didn't get the pieces of detail over the B&W.\r\n\r\nMr.Hitchcock's films have appearance of obnoxious things and the factors of anti-elegance.Chinese try to make up such perfomance of work very years ago but they failed many times and realized ,eventually,If you don't have such an intermediator which gathering in the tapes ,you would be punishes by your self reviewing.\r\n\r\nThe film maker have a fatty protection for it.",
            "review_date": "2010-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Cotton made this film worthwhile to me. I've seen him in several other films and love his work. He's such a likable guy it's hard to see him as the bad guy. Great Hitchcock film.",
            "review_date": "2010-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the 1st of Hitchcock's US films to play on duality, it remains effectively sinister, despite a drawn-out 2nd half.",
            "review_date": "2010-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite Hitchcock films.  Charlies's performance is so real.  The characters drive the action so well, and everything is believable.  The story might unfold slowly, but that was the style then.  Not our fast paced films of today.  Truly a masterpiece!",
            "review_date": "2010-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In several interviews, Alfred Hitchcock noted that of all of the films he directed this was his favorite.  While it isn't my favorite of the directors (that would be \"Strangers on a Train\"), it is certainly one of Hitchcock's classic works and deserving of such distinction.  Two things I really like about this film is the somewhat satirical and relatively light tone that is taken for much of the film for what is essentially a serial killer mystery.  One of my favorite hallmarks of Hitchcock is the bizarre tone he chose in several of his pictures for what is essentially very dark and dramatic material.  You see it in a picture like \"Rope\", where Jimmy Stewart is discussing the practicality of murder in the same way one would discuss the purchase of new curtains for a window.  And in the aforementioned \"Strangers on a Train\", where a psychotic spoiled young man casually discusses the murder of his own man and a stranger's wife, as if it is perfectly natural for such conversations to take place in public settings.  The scenes where \"Uncle Charlie\" is working to fit in comfortably with what is essentially an \"All-American family\" are often as comical as they are suspenseful.  I enjoyed the story in this film, especially Joseph Cotten's performance as the man under suspicion who is living among the family.  Teresa Wright is also very good;  she manages to shift between a steadfast young woman who stubbornly believes her uncle's innocence to a confused young woman who believes \"Charlie\" might have a terrible secret with relative ease.  And of course the direction is spot-on;  I wouldn't expect anything less from Hitchcock.  This film doesn't pack quite as much of a punch as some of my favorite Hitchcock flicks, but it is still makes for entertaining fare.",
            "review_date": "2010-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Theresa Wright knocks this one out of the park.",
            "review_date": "2010-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting Hitchcock thriller about a girl who discovers that her uncle is a murderer. Great acting from Joseph Cotten and Teresa Wright. (First and only viewing - 9/22/2013)",
            "review_date": "2010-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was great watching this in class again today. One of my favorite Hitchcock films. Hume Cronyn steals the film. The whole thing is loaded with creepy subtext about incest and guilt transference.",
            "review_date": "2010-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a pretty good noir-ish film by hitchcock. the problem for me was it lacked the director's trademark suspense. it obvious to the audience what's going on from the get go and we're forced to endure a young woman's naivete about her uncle.\n\n hitchcock's dark humor is very much present but the overall feel of the movie is that it's an early effort.",
            "review_date": "2010-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If there was any question that Alfred Hitchcock had his style down pat before the much-lauded color classics, SHADOW OF A DOUBT puts that to rest. The British-born director displays an uncanny understanding not only of the American psyche, but of the forces of evil that prey there. In a time when Hollywood was plagued with quickie melodramas with lackluster talent, the inimitable Master of Suspense cut through the bullshit and produced a film of real quality. \r\n\r\nIn a seedy New Jersey tenement building, perfectly a propos, we first meet one of Hitch's most memorable villains-- Uncle Charlie. The coldly handsome Joseph Cotten was born to play the part, a role which like all of Hitchock's nemiseses is highly complex and multi-layered. Nothing is black and white beyond the film itself. \r\n\r\nUncle Charlie rouses himself from his contemplations to the discovery that two suit-clad men have staked out the building. The wily Cotten eludes his pursuers and boards a cross-continental train bound for his elder sister Emma's residence, the sleepy small town of Santa Rosa, California.\r\n\r\nIn classic style, the opening shot of Uncle Charlie is mirrored by that of another supine character, who we discover is the \"other\" Charlie-- played by the far prettier Teresa Wright. Worried that her household is stuck \"in a rut,\" she implores her father and mother to invite her beloved Uncle Charlie to visit, just to \"shake things up a little bit.\" Her mother demures, arguing that her uncle has more important things to do than visit them.\r\n\r\nBut of course, before she need despair over her parents having denied her request, Uncle Charlie announces via telegram his impending arrival. \"Do you believe in telepathy?\" asks young Charlie to the world-weary telegram operator. A running theme, we will discover, is the uncle and niece kinsmanship, in which young Charlie attests that she and her uncle are twins. But are they, really?\r\n\r\nThe darkness of New Jersey and the subtle moral deficiency we sense in Cotten's character are again seen, in a brilliant shot, when the train's long shadow encompasses the happy family waiting at the station. The potent symbolism, though somewhat below the radar, is just one of many examples of the decrepitude we'll get the vibe of from Hitch's master direction. \r\n\r\nThe small family of which young Charlie is a prominent member is brilliantly casted, each actor/actress inhibiting their roles sublimely. With the exception of Patricia Collinge's slightly overacted performance as the family matriarch, you sense the cast's preparedness and competence for their respective parts. Also of note is Henry Travers as the father and the know-it-all younger sister, Ann. And not slighting the other family member, youngest brother Roger, but his wasn't much of a remarkable role. \r\n\r\nHumor in the film is provided by the banter between a family friend, Herbie Hawkins (the talented Hume Cronyn), and the father. In classic Hitchcock humor, the two hold morbid conversations inspired by the mystery fiction the two enjoy. In my favorite line from the film, Cronyn's character says earnestly: \"Well, if I was gonna kill you, I wouldn't do a dumb thing like hitting you on the head. First of all, I don't like the fingerprint angle. Of course, I could always wear gloves. Press your hands against the pipe after you were dead and make you look like a suicide. Except it don't seem hardly likely that you'd beat yourself to death with a club. I'd murder you so it didn't look like murder.\"\r\n\r\nTogether the family welcomes Uncle Charlie to their charming home, a two story affair that perfectly conjures up the innocent feel of the characters. Young Charlie especially is effusive in welcoming her uncle, who at this point gives off ever stronger vibes that he is up to no good, and at first refuses the present he gives her on the grounds that his presence is gift enough. Eventually persuaded to accept it, young Charlie discovers in her all-trusting way that the stunning emerald ring has already been monogrammed-- \"CN to LL\" or something of the like. Her uncle is quick to call it a jeweler's mistake, and his niece doesn't suspect a thing. \r\n\r\nIn another scene indicative of Charlie's unnoticed menace, the uncle rashly tears off a piece of the father's evening paper, a piece that we will later discover is tantamount to understanding the crimes Charlie has committed. In another spry defense, he merrily uses the rest of the paper to construct a newspaper house for the children. Young Ann, especially, is not buying it from the outset. \r\n\r\nAnd so the multi-faceted plot boils down to a simple question: will Uncle Charlie's menace threaten the family that adores him?\r\n\r\nNot only do the plot and cast draw you into the film, the sleepy Santa Rosa acts as a third character in the movie. Hitchcock chose SHADOW OF A DOUBT as his personal favorite because he so enjoyed the prospect of corrupting an innocent small town with a swarthy villain. \r\n\r\nAnd it's easy to see how he could enjoy it, and why nearly 70 years later it still holds up as one of Hitch's best efforts. A likeable cast, in tandem with the Master of Suspense's direction, is a sure-fired recipe for thrills and chills of the first order. Not a SHADOW OF A DOUBT about it.",
            "review_date": "2010-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hitchcocks best. Joseph Cotten is as good as he's ever been.",
            "review_date": "2010-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock's first indisputable masterpiece... Hitchcock's discovery of darkness within the heart of small-town America remains one of his most harrowing films, a peek behind the facade of security that reveals loneliness, despair, and death",
            "review_date": "2010-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For some reason, I didn't review this one before. Hitchcock's own personal favorite film may not be my favorite of his, but perfect casting and an expertly paced plot combine to make Shadow of a Doubt a real winner. Joseph Cotten embodies Uncle Charlie, beloved family member and all around swell guy. The only problem is he just might have a dark secret. Teresa Wright slowly grows suspicious of her uncle, and a battle ensues behind the scenes as each tries to hide the conflict from the rest of the innocent and sweet family. Top shelf Hitchcock.",
            "review_date": "2010-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of Alfred Hitchcock!\r\n\r\nShadow of a doubt is dark, gritty, clever and one of the best crime films you'll ever feast eyes on. Although it's from another generation and in B&W It still holds that heart pounding fear your crave. Hitchcock gave us the murderer and his intensions, but created a story in which we feared how the crime would unfold. Now a days directors steal it's formula and destroy the suspense with gore and bloodshead. This film is a perfect tribute to how scary can be classy.",
            "review_date": "2010-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock deconstructs all preconceived notions of a normal family.  You're quickly love Josephy Cotten then become terrified of being near him.",
            "review_date": "2010-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most under-rated hitchcock films",
            "review_date": "2010-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fine Hitchcock thriller, and his personal favorite. Wonderful acting, especially Joseph Cotten, plus a delightfully offbeat role for Hume Cronyn as a detective-story fan with a sick sense of humor. And of course, there are some great moments of suspense.",
            "review_date": "2010-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All the characters were super ridiculous and said hilarious things the whole time. Not alot actually happened....except for over-the-top music playing the entire time to make you THINK something would actually happen.",
            "review_date": "2010-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The theme of doubles and symbolism on the dark undercurrents of society is so well portrayed here and it's also just a mainstream entertaining movie on top of all the depth. Truly one of Hitchcock's best.",
            "review_date": "2010-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film was genius with respect to script writing and casting. The plot kept me intrigued and very amused. Also, it was very nice to see piece together the subtle clues Hitchcock left throughout the movie.\r\n\r\nThis may not be Hitchcock's most famous work, but it is another fantastic film by a true cinematic visionary.",
            "review_date": "2010-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Hitchcock...he rarely disappoints.",
            "review_date": "2010-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious, genius, and the best lighting by Hitchcock i have ever seen. Macdonald Carey is brilliant and amazing. keeps you guessing. reminds me of Doubt with Amy Adams except this is better because Alfred exposes the truth",
            "review_date": "2010-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cerebral cat-and-mouse game that crackles with suspense and tension.  One of Hitchcock's brainiest ... and often overlooked.  \r\n\r\n\"Shadow\" is not a murder-mystery, but is a granddaddy of the psychological thriller genre.  The murders have happened and there's no doubt as to who committed them - celebrated favorite uncle and brother Charlie.  When he comes to visit none is more excited to see him than his admiring niece \"Charlie\" who's fawning and admiring begins to melt away as she begins to suspect her uncle of horrific crimes.\r\n\r\nHitchcock is less interested in catching the killer and more interested in exploring the reaction and actions of a loved one when they discover a dark secret.  And as the stakes get higher, the actions get even more dire.\r\n\r\nAcademy Award winner Teresa Wright (for Mrs Miniver) is luminous and Orson Welles mainstay Joseph Cotten is perfect.  \r\n\r\nThere's no doubt why \"Shadow\" was one of Hitchcock's favorites.",
            "review_date": "2010-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit overlong, but as almost always with Hitchcock sublimely executed. All of the characters felt genuine and three-dimensional, and the images of dancing couples is one of Hitchcock's most surreal and clever grounding the film as part of a continuing battle of the sexes. The female characters are all more interesting than the men here aside from the uncle who sets everything in motion. Our heroines suspiciouns about her favorite uncle perhaps bieng a murderer, lead her on a journey into the dissillusionment of adulthood without either aspect of the plot overwhelming the other. I liked this better some of the later Hitchcock stuff (I'm really more of a fan of his color films), but if anyone can suggest to me more of his early b&w stuff of this caliber, I will definitly look into it.",
            "review_date": "2010-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think enough people really consider this among Hitch's finest, but it's tight, gripping, and beautifully shot.  Joseph Cotten is also very striking.",
            "review_date": "2009-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "watching Shadow of a Doubt makes me think about Hitchcock's amazing feat of directing in 1943.",
            "review_date": "2009-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was a really good movie but i really felt like there was some incest going on behind the scenes.",
            "review_date": "2009-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb film. No doubt that this is one of Hitchcock's grimmest and most impressive movies.",
            "review_date": "2009-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is not hard to see why this is Hitchcock's favourite film he made.A young woman named Charlie does not what to do when she finds out her favourite uncle is a serial killer, wish she tell? \n\nLike many other films Hitchcock puts his input into the script, even thou he never wants the credit. Hitchcock has a unique style and this film has cemented him as my favourite film maker/director.",
            "review_date": "2009-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story. Intriguing plot. Suspenseful&captivating. And yes, the mystery, its what I love the most of this movie.",
            "review_date": "2009-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hitchcock's most under-rated films.    Joseph Cotten was a great actor, and certainly one of the un-sung heroes of the golden age of Hollywood.",
            "review_date": "2009-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hitchcock's best saw Joseph Cotten in peak form as a serial killer. His niece, played by the lovely Teresa Wright, is on to him, and she just might be next.",
            "review_date": "2009-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an entertaining mystery, but unconvincing...",
            "review_date": "2009-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Hitch fare. For when you are in a Turner Classic Movies mood.",
            "review_date": "2009-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock master film director!!!",
            "review_date": "2009-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite Hitchcock...just simply great.",
            "review_date": "2009-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uncle Charlie's Family Vacation.",
            "review_date": "2009-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plenty of suspense in this one. One of the Hitch's best!",
            "review_date": "2009-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Hitchcock classic. Very good suspense thriller.",
            "review_date": "2009-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many people say this movie is Hitchcock's first masterpiece. I think this is a little exaggerated. \"Sabotage\" springs to mind as being a masterpiece that is earlier than this movie. But this movie *is* a masterpiece and no doubt about it, and Hitchcock was certainly more consistently brilliant in the films after this one. Definitely a great movie.",
            "review_date": "2009-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joseph Cotton shines....not the biggest Hitchy fan, but this is one of his better ones...",
            "review_date": "2009-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty swell. Lots of nifty Hitchcockian sexual symbolism. Young Charlie is a fox.",
            "review_date": "2009-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A suspenseful tale from the Master of Suspense about seeking the truth about the few skeletons a family member may be hiding, a great mystery that goes in all sorts of directions",
            "review_date": "2009-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "★★★★ (out of four)\r\n\r\nOne of the best and, sadly, most overlooked of Alfred Hitchcock's thrillers.  It was one of his personal favorites and I can see why.  The idea of bringing corruption into the family unit works wonderfully.\r\n\r\nJoseph Cotten is Uncle Charlie, man who may be a murderer of rich, older women.  He shows up one day at his sister's Santa Rosa home for a long stay.  He strikes a bond with his niece(Teresa Wright), but the girl begins to suspect of him.\r\n\r\nGreat atmosphere and one of Cotten's best performances.  Plus there are some wonderful moments with Hume Cronyn and Henry Travers trying to come up with scenarios for the perfect murder.\r\n\r\n[IMG]http://img.photobucket.com/albums/v48/Zeppo1/Shadow.jpg[/IMG]",
            "review_date": "2009-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Hitchcock. \"Shadow of a Doubt\" is a tightly scripted, well-executed thriller that doesn't talk down to its audience and never meanders. Joseph Cotten is particularly good here as the suspected serial killer uncle.",
            "review_date": "2009-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Hitchcock, both funny and suspenseful.  Shadow of a Doubt makes excellent use of the home's architecture in its cinematography, and includes some terrific morbid humor.",
            "review_date": "2009-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldnt sit through the whole movie",
            "review_date": "2009-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great suspense, I loved how the story unfolds",
            "review_date": "2009-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shadow of a Doubt is truly one of Hitchcock's best. The gradual build is intense and intriguing, never giving too much away, but enough to make you feel as though you are working it all out. The family dynamic is well presented. Each member is different without being a forced caricature. This allows for some truly realistic and familiar moments. One of the best, little touches, the film offers is the father's relationship with his best friend. They discuss literature, and have a running conversation throughout the film where they try and come up with the best ways of killing each other. It's these little moments that add humour but hint at disaster. It's a wonderful film, and unlike the thrillers of today, stays it's course and keeps it's tone.",
            "review_date": "2009-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never trust an uncle from out of town.",
            "review_date": "2009-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock Suspense...",
            "review_date": "2009-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Hitchcock masterpiece, equally as good as my favourite of his, North by Northwest. And this was BW too. Cast was spectacular all around. The changes in the main characters are amazing to witness. Hitchcock has a way of leading the audience through a narrative by making them ask questions. He peels away layer by layer, exposing answers and more questions, and he always concludes films in a great way.",
            "review_date": "2009-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good, I always wanted to see it but i wasnt sure, then i watched it before i went to bed and i loved it. Joseph Cotton was  great in this movie, so was Teresa Wright. Alfred Hitchcock directed this film.",
            "review_date": "2009-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely superb entry from Hitchcock.",
            "review_date": "2009-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Word has it that this was Hitchcock's personal favorite of all of his films, and it's hard for me to disagree with him. A masterpiece.",
            "review_date": "2009-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock said this film is his personal favorite, as it is one of mine.  Nothing in the film gets old.  One hundred percent intriguing through and through.",
            "review_date": "2009-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another masterpiece of Hitchcock's, but fairly unknown under the shadow of Psycho, Rear Window, and Vertigo's fame. Shocking themes that definitely hold the attention of the audience, even the modern audience. And finally... the female protagonist is not blonde!",
            "review_date": "2009-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the classic thrillers of all time.",
            "review_date": "2009-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alfred Hitchcock retains his title of the greatest through this film",
            "review_date": "2009-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good movie, well shot",
            "review_date": "2009-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Hitchcock masterpiece...",
            "review_date": "2009-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story of a young woman (Teresa Wright) living in a small town with her family and looking forward to a visit from her favorite uncle (Joseph Cotten). The trouble is that she begins to suspect her uncle might be a serial killer known as the Merry Widow murderer.\r\n\r\nThe picture shows Hitchcock's great skill at developing suspense. While he would make many great thrillers over his career, this film stands out for me because it achieves this result without the fantastic locales or the spectacular set pieces of some of his later films.\r\n\r\nTeresa Wright who would be nominated for three Oscars and win one in the two years leading up to this film is very effective in her role. Equally as effective is Joseph Cotten at is most sinister.\r\n\r\nThe strong supporting cast includes MacDonald Carey, Henry Travers (Clarence from it s a Wonderful Life) and Hume Cronyn.\r\n\r\nThe script that so effectively works at building the suspense in the small town locale was co-written by Thorton Wilder (Our Town).\r\n\r\nAs has often been cited this was reportedly Hitchcock's personal favorites amongst his own films.",
            "review_date": "2009-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was hitchcock's favorite and it's easy to see why.",
            "review_date": "2009-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great suspense and mystery that keeps you guessing until the end :) Bravo!",
            "review_date": "2009-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock often said this was his favorite movie that he made.  Joseph Cotten stars as an affable uncle coming to visit his family, but may be on the run from a murder or two.  His niece, and biggest fan, starts to suspect somethings up.   Especially enjoyed a young Hume Cronyn as a friend of the family who's a murder mystery enthusiast.  Pretty good Hitch.",
            "review_date": "2009-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It?s been reported that this is Hitchcock?s personal favorite of his films, and I?d certainly place it in his top five.  Here is where I think Hitchcock went from being an exceptional maker of thrillers to being the master of suspense.  ?Uncle Charlie? is undoubtedly one of the greatest villains of Hollywood cinema and he?s masterfully played by Joseph Cotton.  I love how this movie has a real subversive edge about the illusion of safety that small towns provide.  While it is a mere thriller on the surface it?s really about the Teresa Wright character?s coming of age and newly found self awareness.  This isn?t the same old ?wrong man? plot that Hitchcock sort of ran into the ground, and one can really see the master going into a creative renaissance in some of the shots here.",
            "review_date": "2009-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "30/07/09\nrewatched 15/04/10\nrewatched 20/03/12",
            "review_date": "2009-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptionally well rounded characters ignite Hitchcock's favorite among his own.",
            "review_date": "2009-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shadow of a Doubt is a complex, compelling, and suspenseful film that showcases why Alfred Hitchcock is one of the best filmmakers of all time, and the inclusion of Wilder in the script writing process adds a philosophical layer to the film that results in far more than a simple genre film.\n\nRead the full review here: http://processedgrass.blogspot.com/2009/07/honey-what-reveals-you-is-what-you-try.html",
            "review_date": "2009-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vey good film that deserves to be better known. After reading a little bit about it I discovered quite a bit of symbolism especiallyabout  how the two Charlies are the two sides of the same coin. Joseph Cottten is an amazing villain. The suspense is maintained until the very end of the film and the film is has a fantastic atmosphere: I really loved the beginning where the viewer is trying to understand what is going on. It is a wonder how the two basically naive parents gave birth to those two extraordinarily inteligent daughters! The way Uncle Charlie talks about life and especially widows never make them suspicous not to mention the blatant attempts of Uncle Charlie to kill their daughter! The recurring Merry Widow theme with the dancers is a nice touch. Also the emphasis on Uncle Charlie's strong hands: genious! I strongly reccomend it!",
            "review_date": "2009-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My personal all time favorite Hitchcock film...Murderer comes to you're home & he's you're uncle...brilliant",
            "review_date": "2009-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Hitchcock for the strong acting.",
            "review_date": "2009-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Hitchcock for the strong acting.",
            "review_date": "2009-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Hitchcock- Love Joseph Cotton",
            "review_date": "2009-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorites. It accomplishes so much with so little. I love the family element of good and evil. There is more at stake when evil lives in someone you love. And as the story unfolds the small town life is turned on it's head. This is one of my favorite Alfred Hichcock films even though it is lesser known. It accomplishes so much emotionally, once you are on the ride it is hard to get off.  Great movie for rainy day.",
            "review_date": "2009-06-21",
            "source": "rt",
            "lang": "en"
        }
    ]
}