{
  "title": "American Psycho",
  "rating": 8.6,
  "release_date": "2000-04-14",
  "genre": [
    "Drama",
    "Thriller",
    "Crime"
  ],
  "summary": "Based on the novel by Bret Easton Ellis and featuring the sounds of Huey Lewis and other classic early 80s gems, this satire set in 1980s Manhattan follows the dual life of Patrick Bateman (Bale), zealously materialistic and misogynisitc Wall Street executive by day, murdering sociopath by night.",
  "critic_reviews": [
    "A lean and mean horror comedy classic.",
    "Funny, pungent, and weirdly gripping.",
    "Harron's adaptation of Ellis's novel is brilliant, probably better than the book itself.",
    "An ethereal, creepy, almost breathtaking meditation on the life of a mind snapped in two.",
    "Bateman could have been much more interesting if he'd been played by someone who wouldn't need to work quite so hard (Charlie Sheen or Rob Lowe might have been fascinating here).",
    "The slick satire cleverly equates materialism, narcissism, misogyny, and classism with homicide, but you may laugh so loud at the protagonist that you won't be able to hear yourself laughing with him.",
    "Cloaking (Bateman's) world in a hyperrealist light so sharp you could cut yourself on it, Harron keeps the violence minimal, over the top and ghoulishly funny.",
    "The real highlight is when Bateman and his co-workers compare custom business cards in a grueling, ego-shattering game of one-upmanship that is so linked to their sense of self it might as well be Russian roulette.",
    "Christian Bale is heroic in the way he allows the character to leap joyfully into despicability.",
    "Pace is sleek, airless and apt.",
    "Nearly perfect for what it is.",
    "Neither bloodthirsty enough to trigger the gag reflex of anyone but the most anemic viewer nor clever enough to yield much in the way of particularly engrossing insights.",
    "Harron validates and largely clarifies the work.",
    "It's not a great film, but let's face it: Considering the source, this is as good as it was ever going to get.",
    "There's nothing beyond the bloodshed and gallows humor, just intellectually secondhand implications about materialism, conformity and misogyny.",
    "A standard-issue slasher movie, stylishly shot, but with little to distinguish it from a long line of \"Psycho\"-spawned gorefests.",
    "(Harron) has made a passionless movie about a passionless man, and it's all supposed to add up to make us feel or even just think something, but what?",
    "(Herron) just doesn't make the case that this book was worth filming.",
    "A fairly loathsome and shallow movie about loathsome and shallow people, but it's almost worth catching to see star Christian Bale chew up the scenery.",
    "Lacking any equivalent to the Sadean excess of Ellis's prose, it is also further evacuated of purpose.",
    "Ambiguity can enrich a movie, but artists abdicate their responsibilities if they don't take a stance of any kind.",
    "Stillborn, pointless piece of work.",
    "Most of American Psycho just sits there, looking at trouble, rather than looking for it - complacent, overjoyed in fact to exist at all."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is a very intriguing movie. We get to watch as Patrick Bateman's sanity slowly slips away to his uncontrollable nightly blood lust. However, we find out that he may be delusional, and not necessarily dangerous. I still can't decide whether he is crazy or a serial killer.",
      "review_date": "2014-06-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best and most underrated movies of all time IMHO. Its smart , funny and gory with deep dark undertones about the paradoxical times we live in",
      "review_date": "2014-01-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wow just wow amazing movie hilarious and quotable i never get tired of it and Bales performance is mind blowing and this happens to be my favorite movie ever",
      "review_date": "2015-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nPublished in 1991, Bret Easton Ellis' third novel was greeted by howls of hatred more appropriate to a small war in the Third World or another Golan-Globus Lemon Popsicle sequel. A first person report from inside the mind of Patrick Bateman, who epitomises the ills of the 1980s by combining the professions of Wall Street broker (\"mergers and acquisitions\") and serial killer (\"murders and executions\"), the book was widely misinterpreted as a hideously misogynist tract that used explicit violence to draw attention to a thinly-plotted pretend thriller with dollops of surface-level satire.\r There has always been the threat of a film, with such scary names as Oliver Stone, Brian De Palma and David Cronenberg in the ring - but the project has fallen to Mary Harron, the ex-BBC documentarian who made an underrated debut with I Shot Andy Warhol, who has cannily brought aboard the apparently unlikely Guinevere Turner (the lesbian icon from Go Fish) to co-write and play the funniest victim. The result is the best imaginable film of very difficult material; it doesn't say much more than, \"The 80s were **** but manages exactly to catch the all-surfaces, dazzlingly obsessive tone of the novel, making its points by treating all subjects - nouvelle cuisine, MOR rock music, fitness kicks, clothes, personal grooming - with exactly the same pornographic attention to detail as the sex and violence.\r Like the book, the film makes a point of not having a real plot: a smooth PI (Dafoe) seems set to nail the killer for the murder of a rival trader (Leto), but fades into the wallpaper along with the crime itself. Bateman, played with dead-inside charm and mounting hysteria by an astonishing Christian Bale, invites us into his world of reservations at exclusive restaurants and competitions over the quality of business cards. His detours into murder - prefaced by detailed speeches about now-embarrassing musical enthusiasms (\"You actually own a Whitney Houston CD?\" gasps Turner through contemptuous laughter. \"More than one?\") - are hardly more bizarre and tasteless as everything else in his life. In the end, the scariest thing about Bateman is not that he's a Lecter-like freak - his crack-up in the last act brings him horribly closer to humanity - but that he is no worse than everyone else in his world, except humane-but-dim office minion Sevigny, whose role is to make the film bearable.\r As for the horror: Harron is mostly very discreet, but delivers one terrific apartment-of-grue sequence as Bateman's life falls to pieces along with many victims, featuring a truly nerve-shredding chainsaw sound effect.\r Often laugh-out-loud funny, conveying the cruelty of its world through persistent mistakings of identity among the well-scrubbed young men and details like the all-sharp-edges interior decor and elaborate but tiny meals, it's cool in the sense of remote rather than hip. And you wouldn't want to be seen dead with the soundtrack album.",
      "review_date": "2015-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A New York stock broker spends his evenings killing people, or does he?\r Like the book, the film makes a point of not having a real plot: a smooth PI (Dafoe) seems set to nail the killer for the murder of a rival trader (Leto), but fadesA New York stock broker spends his evenings killing people, or does he?\r Like the book, the film makes a point of not having a real plot: a smooth PI (Dafoe) seems set to nail the killer for the murder of a rival trader (Leto), but fades into the wallpaper along with the crime itself. Bateman, played with dead-inside charm and mounting hysteria by an astonishing Christian Bale, invites us into his world of reservations at exclusive restaurants and competitions over the quality of business cards. His detours into murder - prefaced by detailed speeches about now-embarrassing musical enthusiasms (\"You actually own a Whitney Houston CD?\" gasps Turner through contemptuous laughter. \"More than one?\") - are hardly more bizarre and tasteless as everything else in his life. In the end, the scariest thing about Bateman is not that he's a Lecter-like freak - his crack-up in the last act brings him horribly closer to humanity - but that he is no worse than everyone else in his world, except humane-but-dim office minion Sevigny, whose role is to make the film bearable.\r Often laugh-out-loud funny, conveying the cruelty of its world through persistent mistakings of identity among the well-scrubbed young men and details like the all-sharp-edges interior decor and elaborate but tiny meals, it's cool in the sense of remote rather than hip. Also a brilliant soundtrack album. One of the best films ever!",
      "review_date": "2015-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A New York stock broker spends his evenings killing people, or does he?\r Watching \"American Psycho\" is like witnessing a bravura sleight-of-hand feat. In adapting Bret Easton Ellis's turgid, gory 1991 novel to the screen, the director MaryA New York stock broker spends his evenings killing people, or does he?\r Watching \"American Psycho\" is like witnessing a bravura sleight-of-hand feat. In adapting Bret Easton Ellis's turgid, gory 1991 novel to the screen, the director Mary Harron has boiled a bloated stew of brand names and butchery into a lean and mean horror comedy classic. The transformation is so surprising that when the movie's over, it feels as if you've just seen a magician pull a dancing rabbit out of a top hat.\r At the heart of the film is a star-making performance by the handsome Welsh actor Christian Bale (adopting an impeccably snooty pseudo-preppie American accent) that softens the novel's portrait of a serial-killing Wall Street hotshot just enough to force us to identify with this ultimate narcissist. Mr. Bale's portrayal of 27-year-old Patrick Bateman, a budding master of the universe by day (he works in mergers and acquisitions, which he facetiously refers to as \"murders and executions\") and homicidal maniac by night, is alternately funny, blood-curdling and pathetic.\r From the opening credits, in which drops of blood are confused with red berry sauce drizzled on an exquisitely arranged plate of nouvelle cuisine, the movie establishes its insidious balance of humor and aestheticized gore. That sly confusion between the beautiful and the gruesome extends to the language of the screenplay by Ms. Harron and Guinevere Turner.\r As brilliantly as the movie's visual style evokes a world spat out by a Vanity Fair art director, \"American Psycho\" remains a one-joke satire of materialism and soullessness. It's a joke we would like to think we've got. Having arrived safely in the year 2000, it would be easy to shrug off \"American Psycho\" as the last cinematic word on an embarrassingly gluttonous cultural moment that has gone the way of Patrick's favorite murderous background anthem, \"Hip to Be Square.\" But has it?\r A very twisted and dark comedy. One of my personal favorites. Flawless!",
      "review_date": "2015-04-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A New York stock broker spends his evenings killing people, or does he?\r Watching \"American Psycho\" is like witnessing a bravura sleight-of-hand feat. In adapting Bret Easton Ellis's turgid, gory 1991 novel to the screen, the director MaryA New York stock broker spends his evenings killing people, or does he?\r Watching \"American Psycho\" is like witnessing a bravura sleight-of-hand feat. In adapting Bret Easton Ellis's turgid, gory 1991 novel to the screen, the director Mary Harron has boiled a bloated stew of brand names and butchery into a lean and mean horror comedy classic. The transformation is so surprising that when the movie's over, it feels as if you've just seen a magician pull a dancing rabbit out of a top hat.\r At the heart of the film is a star-making performance by the handsome Welsh actor Christian Bale (adopting an impeccably snooty pseudo-preppie American accent) that softens the novel's portrait of a serial-killing Wall Street hotshot just enough to force us to identify with this ultimate narcissist. Mr. Bale's portrayal of 27-year-old Patrick Bateman, a budding master of the universe by day (he works in mergers and acquisitions, which he facetiously refers to as \"murders and executions\") and homicidal maniac by night, is alternately funny, blood-curdling and pathetic.\r From the opening credits, in which drops of blood are confused with red berry sauce drizzled on an exquisitely arranged plate of nouvelle cuisine, the movie establishes its insidious balance of humor and aestheticized gore. That sly confusion between the beautiful and the gruesome extends to the language of the screenplay by Ms. Harron and Guinevere Turner.\r As brilliantly as the movie's visual style evokes a world spat out by a Vanity Fair art director, \"American Psycho\" remains a one-joke satire of materialism and soullessness. It's a joke we would like to think we've got. Having arrived safely in the year 2000, it would be easy to shrug off \"American Psycho\" as the last cinematic word on an embarrassingly gluttonous cultural moment that has gone the way of Patrick's favorite murderous background anthem, \"Hip to Be Square.\" But has it?\r A very twisted and dark comedy. One of my personal favorites. Flawless!",
      "review_date": "2015-12-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "'American Psycho': Murderer! Fiend! Cad! (But Well-Dressed)\r Watching \"American Psycho\" is like witnessing a bravura sleight-of-hand feat. In adapting Bret Easton Ellis's turgid, gory 1991 novel to the screen, the director Mary Harron has'American Psycho': Murderer! Fiend! Cad! (But Well-Dressed)\r Watching \"American Psycho\" is like witnessing a bravura sleight-of-hand feat. In adapting Bret Easton Ellis's turgid, gory 1991 novel to the screen, the director Mary Harron has boiled a bloated stew of brand names and butchery into a lean and mean horror comedy classic. The transformation is so surprising that when the movie's over, it feels as if you've just seen a magician pull a dancing rabbit out of a top hat.\r Four years ago Ms. Harron's film \"I Shot Andy Warhol\" performed similar magic by creating credible facsimiles of Warhol and his motley entourage. \"American Psycho,\" a more ambitious, far more confident film, salvages a novel widely loathed for its putative misogyny and gruesome torture scenes by removing its excess fat in a kind of cinematic liposuction. Except for a few wittily chosen lists, the book's numbing catalog of high-end consumer items has been drastically edited. Its murder rate has also plunged. The trimming demonstrates once again that less is often more. What remains of the story is a sleek, satirical, yuppie-era \"Jekyll and Hyde\" that blithely tap dances along the fault lines separating movie genres.\r At the heart of the film is a star-making performance by the handsome Welsh actor Christian Bale (adopting an impeccably snooty pseudo-preppie American accent) that softens the novel's portrait of a serial-killing Wall Street hotshot just enough to force us to identify with this ultimate narcissist. Mr. Bale's portrayal of 27-year-old Patrick Bateman, a budding master of the universe by day (he works in mergers and acquisitions, which he facetiously refers to as \"murders and executions\") and homicidal maniac by night, is alternately funny, blood-curdling and pathetic.\r As this character metamorphoses from preening, wolfish yuppie to chain-saw wielding maniac to whimpering crybaby, Mr. Bale makes us feel the underlying connections between these multiple personalities. One minute Mr. Bale's Patrick is a cowering corporate geek and self-described empty shell, the next an arrogant, name-dropping smoothie, the next a hysterical wimp unable to distinguish reality from fantasy.\r He's also a serial killer, or at least he is in his imagination. The movie plays adroitly with the notion that his violent spasms are merely the revenge fantasies of a repressed corporate toady. The fluidity with which Mr. Bale moves from one state of mind to the other makes for the kind of tour-de-force performance you'd expect from Sean Penn, another master of throwing tear-stained tantrums.\r From the opening credits, in which drops of blood are confused with red berry sauce drizzled on an exquisitely arranged plate of nouvelle cuisine, the movie establishes its insidious balance of humor and aestheticized gore. That sly confusion between the beautiful and the gruesome extends to the language of the screenplay by Ms. Harron and Guinevere Turner.\r Dinner specials are described by waiters in the tones of unctuous coroners announcing the results of autopsies.\r Some of the funniest speeches are Patrick's pompous lectures -- each a prelude to homicide -- on the 80's pop stalwarts Phil Collins, Whitney Houston, and Huey Lewis and the News.\r While the movie's interiors conform to late-80's styles of design and architecture, they, too, are eerily exaggerated. The severe black-and-white minimalism of Patrick's gadget-filled apartment has the feel of a high-rise morgue.\r The movie's sexual ethos is a bifurcated world of male monsters and their often shallow but still recognizably human girlfriends. Patrick and his Wall Street cronies are interchangeable reptilian pod people, soulless under their designer-label shells and supercilious smirks. (One running joke finds Patrick being continually confused with others, despite his wealth, status and miraculous instant entree to New York's priciest restaurants.)\r In one hilarious early scene, he and his colleagues compare their business cards (the texture of the paper and the quality of embossing) in a competitive game of show and tell that has a murderous undertone. Those colleagues, wittily embodied by Jared Leto, Justin Theroux, Matt Ross and Bill Sage, are the ne plus ultra in cocky, carnivorous sang-froid.\r Compared with these robotic cobras, the women are almost poignantly human. Reese Witherspoon,\r At the very least, \"American Psycho\" is a dazzling period satire. It's still too early to know what, if anything, it might foretell.",
      "review_date": "2016-04-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Leonardo DiCaprio was asking $21 million to play the lead, forcing the film's budget up to $40 million. When he quit, and Christian Bale resumed the role, the budget went back down to a more reasonable $7 million. With a box office take inLeonardo DiCaprio was asking $21 million to play the lead, forcing the film's budget up to $40 million. When he quit, and Christian Bale resumed the role, the budget went back down to a more reasonable $7 million. With a box office take in excess of $34 million, the film proved successful.",
      "review_date": "2021-04-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "American Psycho is one of the most deranged yet enjoyable stories ever committed to film. A satire of the \"yuppie\" lifestyle of the 1980s, and a warning against the corrupting power of money, it's expertly told, well-scripted, somewhatAmerican Psycho is one of the most deranged yet enjoyable stories ever committed to film. A satire of the \"yuppie\" lifestyle of the 1980s, and a warning against the corrupting power of money, it's expertly told, well-scripted, somewhat disturbingly funny, and grusomely thrilling. The entire film pretty much hinges on one performance, that of Christian Bale's increasingly disturbed Wall Street trader-by-day and serial killer-by-night Patrick Bateman. Bale doesn't disappoint, delivering the performance of his career, and in the process creating a horror villain to rival Norman Bates, and an anti-hero and chillingly disturbing narrator to rival Alex DeLarge. Comparissons to such films as Psycho and A Clockwork Orange are inevitable, and American Psycho could be seen as an affectionate tribute to both, but with its own ideas to add to the bubbling cauldron of depravity. All these films use madness as a metaphor for something wrong with society - in Psycho it's misogyny, in A Clockwork Orange it's the corruption of government, and in American Psycho it's the evils of capitalism. The films are similar in many ways, amd vastly different in others, but all three communicate a powerful message to their audience extremely effectively. American Psycho certainly deserves equal recognition as a film - the performances are just as good, the story just as engaging, the underlying themes just as dark and compelling. Even director Mary Harron shows great flair in her art, though sadly as a cult film director she is unlikely to be classed in the same league as so-called \"masters\" as **** and Kubrick. If you enjoy the film, cult icon as it is, then feel free to be smug in the fact that you and a select group of others appreciate a truly fine, though criminally underrated film.",
      "review_date": "2012-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Satiric and socially relevant. A film not for the faint of heart. Filled with violence but with a purpose. Christian Bale creates an interesting performance. A must see, well stylized dark comedy with a lot to say. Soon to be a modernSatiric and socially relevant. A film not for the faint of heart. Filled with violence but with a purpose. Christian Bale creates an interesting performance. A must see, well stylized dark comedy with a lot to say. Soon to be a modern classic, and certainly deserving of its cult following.",
      "review_date": "2011-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In the novel, Patrick Bateman is a way more misogynistic, racist, sexist, homophobic, and xenophobic character. These characteristics were overall heavily toned down in the film in order to make his character more tolerable, even though someIn the novel, Patrick Bateman is a way more misogynistic, racist, sexist, homophobic, and xenophobic character. These characteristics were overall heavily toned down in the film in order to make his character more tolerable, even though some of those characteristics were still subtly present.",
      "review_date": "2021-04-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Featuring some of Christian Bale's greatest work, and some priceless juxtapositions of horror and humor, \"American Psycho\" remains a hysterically written piece of satire.",
      "review_date": "2012-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Based on the book of the same name, American Psycho is a journey through the mind of a mentally deranged yuppie. While that makes it seem like a very serious movie it's actually very funny in a dark sense. Christian Bale is delightful as theBased on the book of the same name, American Psycho is a journey through the mind of a mentally deranged yuppie. While that makes it seem like a very serious movie it's actually very funny in a dark sense. Christian Bale is delightful as the main character Patrick Bateman.",
      "review_date": "2011-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "11/10 would watch again.\rIt's funny, I seriously just love watching people die. It legitimately turns me on, at least a bit. Good, good, good movie...",
      "review_date": "2012-08-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "American Psycho has a terrific plot, acting and is a satire of the lifestyle of those who lived in the 1980's.\rThe movie is absorbing and intricate which is great to see. The movie also has great comedy provided\rby Christian Bale. Bale putAmerican Psycho has a terrific plot, acting and is a satire of the lifestyle of those who lived in the 1980's.\rThe movie is absorbing and intricate which is great to see. The movie also has great comedy provided\rby Christian Bale. Bale put so many facets into his character that it would take a while to list them\rall, one of my favourite thrillers, A+.",
      "review_date": "2014-07-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "American Psycho is brilliant social satire cleverly dressed up as a slasher film. I love it! A masterwork.",
      "review_date": "2012-11-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "To be honest I never thought Christian Bale was that incredible as an actor... until I saw this movie, and I was blown away. What a an amazing performance, being able to create a character so deep but completely shallow at the same time. It'sTo be honest I never thought Christian Bale was that incredible as an actor... until I saw this movie, and I was blown away. What a an amazing performance, being able to create a character so deep but completely shallow at the same time. It's like Dexter, but 10 times more insane, satirical and absolutely terrifying.",
      "review_date": "2012-02-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Without a shadow of a doubt one of the most underrated movies I have ever had the privilege of watching. Christian Bale plays the role so well and the story is full of clever plot points and surprises throughout. Why this film got such mixedWithout a shadow of a doubt one of the most underrated movies I have ever had the privilege of watching. Christian Bale plays the role so well and the story is full of clever plot points and surprises throughout. Why this film got such mixed reviews upon release is beyond me, it's so well made. Thankfully with age this film has seen it's fan base and popularity grow and rightly so, this film is so worth watching!",
      "review_date": "2014-06-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of my favorite films of all time. It's extremely well-acted, and I love the 80's vibe of the film. It's quite an interesting take on the slasher film with our main character, portrayed quite darkly by Christian Bale. \"AmericanThis is one of my favorite films of all time. It's extremely well-acted, and I love the 80's vibe of the film. It's quite an interesting take on the slasher film with our main character, portrayed quite darkly by Christian Bale. \"American Psycho\" is a very interesting (and even sometimes funny) look into the mind of a serial killer, and it's a very intense and enjoyable film. I give it my highest recommendation.",
      "review_date": "2014-09-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing performance from Christian Bale and one of the best mindf**k movies I have seen. It makes you think, it is unpredictable, a bit weird but in a good way and interesting throughout. Didn't give it a 10 just because I give 10 only to myAmazing performance from Christian Bale and one of the best mindf**k movies I have seen. It makes you think, it is unpredictable, a bit weird but in a good way and interesting throughout. Didn't give it a 10 just because I give 10 only to my favorite movies and this is close, but no cigar.",
      "review_date": "2017-03-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Christian Bale is all around the film all the way through and this is why his character is age 27 and well educated and that is why he's born in 1974. I absolutely love Christian Bale's performance. He really does give his performance a lotChristian Bale is all around the film all the way through and this is why his character is age 27 and well educated and that is why he's born in 1974. I absolutely love Christian Bale's performance. He really does give his performance a lot of humor and horror which I don't think this movie is scary to be honest. There are some 80's songs which I absolutely love. They completely fit to the film in the late 1980's. I'm surprised that the filmmakers didn't put any 90's songs in it. Maybe it's because the novel seems written in the 80's.The 80's songs are:New Order - True Faith.You're a f&$%!^g ugly b£$%h. I want to stab you to death, and then play around with your blood.Katrina and the Waves - Walking on Sunshine.Robert Palmer - Simply Irresistible.I'm trying to listen to the new Robert Palmer tape, but Evelyn, my supposed fiancee, keeps buzzing in my ear.Huey Lewis and the News - Hip To Be Square.Do you like Huey Lewis and the News? They're OK. Their early work was a little too new wave for my tastes, but when Sports came out in '83, I think they really came into their own, commercially and artistically. The whole album has a clear, crisp sound, and a new sheen of consummate professionalism that really gives the songs a big boost. He's been compared to Elvis Costello, but I think Huey has a far more bitter, cynical sense of humour. Hey Halberstram. Yes, Allen? Why are there copies of the style section all over the place, d-do you have a dog? A little chow or something? No, Allen? Is that a rain coat? Yes it is! In '87, Huey released this, Fore, their most accomplished album. I think their undisputed masterpiece is ''Hip To Be Square'', a song so catchy' most people probably don't listen to the lyrics. But they should, because it's not just about the pleasures of conformity, and the importance of trends, it's also a personal statement about the band itself. Hey Paul! (Screams) TRY GETTING A RESERVATION AT DORSIA NOW, YOU F&^%ING STUPID B£$%^&D! (Screams) YOU F&^%ING B£$%^&D!Chris de Burgh - Lady in Red.Simply Red - If You Don't Know Me By Now.Genesis - In Too Deep.Do you like Phil Collins? I've been a big Genesis fan ever since the release of their 1980 album, Duke. Before that, I really didn't understand any of their work. Too artsy, too intellectual. it was on Duke where Phil Collins' presence became more apparent. I think Invisible Touch was the group's undisputed masterpiece. It's an epic meditation and on intangibility. At the same time, it deepens an enriches the meaning of the preceding three albums. Christy, take off the robe. Listen to the brilliant ensemble playing of Banks, Collins and Rutherford. You can practically hear every nuance of every instrument. Sabrina, remove you dress. In terms of lyrical craftsmanship, the sheer songwriting, this album hits a new peak of professionalism. Sabrina, why don't you, uh, dance a little. Take the lyrics to Land of Confusion. In this song, Phil Collins addresses the problems of abusive political authority. In To Deep is the most moving pop song in the 1980s, about monogamy and commitment. The song is extremely uplifting. Their lyrics are as positive and affirmative as anything I've heard in rock. Christy, get down on your knees so Sabrina can see your a$$hole. Phil Collins' solo career seems to be more commercial and therefore satisfying, in a narrower way. Especially songs like In The Air Tonight and Against All Odds. Sabrina, don't just stare at it, eat it. But I also think Phil Collins works best within the confines of the group, than as a solo artist, and I stress the word artist.Phil Collins - Sussudio.This is Sussudio, a great, great song, a personal favourite.Curiosity Killed The Cat - Red Lights.Whitney Houston - Greatest Love Of All. Do you know that Whitney Houston's debut LP, called simply Whitney Houston had 4 number one singles on it? Did you know that, Christy? You actually listen to Whitney Houston? You've own a Whitney Houston CD? More than one?' It's hard to choose a favourite among so many great tracks, but ''The Greatest Love Of All'' is one of the best, most powerful songs ever written about self-preservation, dignity. It's universal message crosses all boundaries and installs one with the hope that it's not late to better ourselves. Since, Elizabeth, it's impossible in this world we live in to empathize with others, we can always empathize with ourselves. It's an important message, crucial really. And it's beautifully stated on the album.(Whooh!) That's a lot of thought that I've been working on! There's just so many speeches that I have to put in what Christian Bale's character says. Well, that's the way it goes, folks. Brilliantly directed and acted by Christian Bale. Nothing can go wrong with the movie.",
      "review_date": "2018-03-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie proves why Christian Bale is one of the best actors. He is totally funny and creepy and brings so much charisma to patrick bateman. A movie that is both creepy and funny and knows how to balance the two tones.",
      "review_date": "2016-05-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSo many good and memorable moments, like when he talks to his victims about the music he likes, how passionate he is about his business card, or how much he prepares his face in the morning. Christian Bale did a perfect job, of representing the best serial killer in movie history.",
      "review_date": "2018-04-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "American Psycho is an enthralling satire on the world of Wall Street and how we could all be a little less narcissistic In our actions. The film takes an exaggerated but somewhat needed take on how we all want to be noticed and feelAmerican Psycho is an enthralling satire on the world of Wall Street and how we could all be a little less narcissistic In our actions. The film takes an exaggerated but somewhat needed take on how we all want to be noticed and feel important, and Christian bales performance personifies that. 87/100",
      "review_date": "2019-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nCrazy, messed up movie. I also loved its comedic elements. Incredible performance by Bale.",
      "review_date": "2019-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "During the shooting of the film, Christian Bale spoke in an American accent off-set at all times. At the wrap party, when he began to speak in his native English accent, many of the crew thought he was speaking that way as an accent forDuring the shooting of the film, Christian Bale spoke in an American accent off-set at all times. At the wrap party, when he began to speak in his native English accent, many of the crew thought he was speaking that way as an accent for another film. They had thought he was American throughout the entire shoot.",
      "review_date": "2021-04-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the great films of the 2000s!Look at that subtle and polished script. The tasteful cinematography and direction of it. Oh my God, it even has Christian Bale's finest performance.\n\nAmerican Psycho is a captivating study of a madmanOne of the great films of the 2000s!Look at that subtle and polished script. The tasteful cinematography and direction of it. Oh my God, it even has Christian Bale's finest performance.American Psycho is a captivating study of a madman who simultaneously obsesses and criticizes the shallow culture he's a part of and attempts to hide his chaotic personal life through excessive vanity and beautification. Harron's direction is very impressive as she manages to take the story through the narrow route that blurs the line between fiction and reality with great finesse. American Psycho is a fascinating vignette of lunacy and obsession as it intriguingly blends its elements of horror and dark comedy into an exquisitely paced, masterfully directed and magnificently written story that delves into the mind and psyche of its incredibly deranged individual with plenty of success, and remains one of the finest achievements of its genre(s) and of the greatest movies of the 2000s.",
      "review_date": "2021-04-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie with many funny scenes in the beginning about the artificial snobs from the Wall Street. Later the movie gets very bloody and in the end there are a lot of questions. Christian Bale is top",
      "review_date": "2021-02-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great soundtrack, good cameraman's work, Bale as always at his best, interesting plot with the deep meaning (no).",
      "review_date": "2020-06-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing movie, probably my favorite movie of all time. The end was slightly changed compared to the book, which I believe to be the better of the two, but really nothing major changed and it's almost as good. For anyone that thinks it's justAmazing movie, probably my favorite movie of all time. The end was slightly changed compared to the book, which I believe to be the better of the two, but really nothing major changed and it's almost as good. For anyone that thinks it's just a bunch of pointless killing, you should really watch an in-depth breakdown. That is something that certainly helped me enjoy the movie much, much more.",
      "review_date": "2019-08-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best performance in Christian's career plus a brilliant supporting cast.",
      "review_date": "2020-01-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "American Psycho is a brutal, vicious, nihilistic film that more-than-effectively portrays the hollowness of American life by painting Wall Street as a blank, white dystopia in which one's actions, intentions, and confessions mean absolutelyAmerican Psycho is a brutal, vicious, nihilistic film that more-than-effectively portrays the hollowness of American life by painting Wall Street as a blank, white dystopia in which one's actions, intentions, and confessions mean absolutely nothing and are never noticed. There's tons of great visual cues, which one might call gimmicky, but are nevertheless a hell of a lot of fun to point out and look out for upon rewatching. This is a film meant to resonate powerfully with the viewer and will keep them thinking for a long time to come. You couldn't ask for more from a horror film.",
      "review_date": "2020-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "a tremendous film and an incredible film in the fact that it does justice to what it is undoubtedly one of the greatest books ever written",
      "review_date": "2020-11-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe single biggest cost on the film was purchasing the rights to the various songs used throughout.",
      "review_date": "2021-04-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAt the beginning of the film Christian Bale's character takes offense to anti-Semitic remarks made by a collegue. In Shaft (2000), released just two months after this film, Christian Bale plays a character who makes racists remarks. Both incidents take place in a restaurant.",
      "review_date": "2021-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe film had various problems with designer labels during production. Cerruti agreed to allow Christian Bale to wear their clothes, but not when the character was killing anyone. Rolex agreed that anyone in the film could wear their watches except Bateman (hence the famous line from the book \"Don't touch the Rolex\" had to be changed to \"Don't touch the watch\"). Perry Ellis provided underwear at the last minute after Calvin Klein pulled out of the project. Comme des Garçons refused to allow one of their overnight bags to be used to carry a corpse, so Jean Paul Gaultier was used instead.",
      "review_date": "2021-04-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe \"whoosh\" sounds during the famous business card scene was created by slowing down the sound of a sword being drawn from its sheath.In the DVD commentary, co-writer and director Mary Harron says that during the first shower scene with Patrick Bateman, all of the women on-set gathered around to watch Christian Bale wash himself.",
      "review_date": "2021-04-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAmerican Psycho is a strangely satisfying film.One of the weirdest movies I've seen. Saw on video tape when it came out then recently watched it again 18 years later. Forgot how fun it is to watch. The absurdity of Bale's character Patrick Bateman's shallowness and preoccupation with superficial things like how upset he gets over a colleague having a better business card than him makes this movie comedic while he's slicing up victims. Still not sure about whether or not all of the things happening were all in his head. I guess that's up for anyone's interpretation of the story. Very well done and one of Bale's best performances as if he's ever performed badly.",
      "review_date": "2021-04-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSeveral of the CDs seen in in the film appear to be silver, blank \"burned\" CDs. CD burning software was not available to the public until the late 1990s.",
      "review_date": "2021-04-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Christian Bale underwent extensive dental work in order to play the character of Patrick Bateman. It is unclear whether or not this was a personal choice or whether he was instructed to do so by the director.",
      "review_date": "2021-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Looking for a way to create the character of Patrick Bateman, Christian Bale stumbled onto a Tom Cruise appearance on the Late Show with David Letterman (1993). According to co-writer and director Mary Harron, Bale saw in Cruise \"this veryLooking for a way to create the character of Patrick Bateman, Christian Bale stumbled onto a Tom Cruise appearance on the Late Show with David Letterman (1993). According to co-writer and director Mary Harron, Bale saw in Cruise \"this very intense friendliness with nothing behind the eyes,\" and Bale subsequently based the character of Bateman on that. Interestingly, Tom Cruise is actually featured in the novel. He lives in the same apartment complex as Bateman, who meets him in an elevator and gets the name of Cocktail (1988) wrong, calling it \"Bartender.\"",
      "review_date": "2021-04-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAlthough Patrick Bateman is extremely wealthy, we never actually see him do any work. In fact, none of his colleagues are seen doing any work.",
      "review_date": "2021-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "hiuggugughiihhiiugfytdrsfyfugug................\":;!?,.()*&^%$#@+×÷=_€£¥₩●○▪□■☆⊙°•●●♤♡◇♧《》•¤°°°°{}[]°°",
      "review_date": "2021-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Brilliantly Insane! This movie was just so fun and bat **** crazy to watch, the acting was superb and I enjoyed the **** outta the times when he casually started explaining different albums and songs and their meanings before doing the deed.Brilliantly Insane! This movie was just so fun and bat **** crazy to watch, the acting was superb and I enjoyed the **** outta the times when he casually started explaining different albums and songs and their meanings before doing the deed. The ending was very good for its time, I won't go into details about the philosophical aspects of the movie and what its trying to say about society for example since it was already explained and analyzed to dead. There were a bit of slow parts and some awkward acting but overall its a must see movie if you haven't already.",
      "review_date": "2021-09-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bale delivers one of the most interesting and brilliant characters I've ever seen on screen.",
      "review_date": "2009-08-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There is not a lot that this movie does wrong. Some people might not understand it. Some might not like it even if they do understand. This is easily one of my favorite cult films, right up there with Donnie Darko. It will also make you thinkThere is not a lot that this movie does wrong. Some people might not understand it. Some might not like it even if they do understand. This is easily one of my favorite cult films, right up there with Donnie Darko. It will also make you think twice next time you see a stray cat while at an ATM.",
      "review_date": "2021-07-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nCharacter Error Bateman could not have killed Jean with the nail gun because that model of nail gun must be plugged into an air compressor for the nails to be fired. If he had pulled the trigger the way he was holding it [without it plugged into anything], nothing would have happened.",
      "review_date": "2021-04-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe telephone next to Patrick Bateman's bed is a Bang & Olufsen model not available in the 1980s",
      "review_date": "2021-04-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nPatrick Bateman: [voiceover] When I get to Paul Allen's place, I use the keys I took from his pocket. There is a moment of sheer panic when I realize that Paul's apartment overlooks the park and is obviously more expensive than mine. I calm myself and move into the bedroom, where I find his suitcase and start to pack.",
      "review_date": "2021-04-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIncorrectly regarded as goofs (around 31 mins) When Bateman leaves the message on Paul Allen's voicemail, he ends it saying \"hasta la vista, baby\", Bateman was quoting the ending of \"Looking for a New Love\" which is a song by American dance-pop singer Jody Watley. It was released in January 1987 and reached number two on the US Billboard Hot 100 in May 1987 and spent four weeks at number-one on the US Billboard R&B chart. Bateman was not quoting Arnold Schwarzenegger's catchphrase from Terminator 2: Judgment Day, which was released in 1991.",
      "review_date": "2021-05-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAnachronisms(around 41 mins) The film is set in 1987. In his apartment, Patrick offers 'Christie' and 'Sabrina' a Varda truffle. Varda Chocolatiers was not established until 1989.",
      "review_date": "2021-05-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nCharacter ErrorPatrick's CD player in his apartment is missing in some scenes",
      "review_date": "2021-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nPatrick Bateman: [faking a conversation on the phone] Now, John, you've to wear clothes in proportion to your physique. There are definite dos and don'ts, good buddy of wearing a bold striped shirt. A bold stripe shirt calls for solid colored or discreetly patterned suits and ties.[pause]Patrick Bateman: Yes, always tip the stylist 15%. Listen, John, I've gotta go, T. Boone Pickens just walked in.[laughs]Patrick Bateman: Just joking. No, don't tip the owner of the salon. Okay John? Right? Got it.",
      "review_date": "2021-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "----------------------------------8.5/10-----------------------------------",
      "review_date": "2021-12-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One could argue American Psycho as the greatest films of the 2000s, led by Christian Bale's iconic performance as the crazed investment banker Patrick Bateman. Carrying massive cultural and social relevance to today, American Psycho continuesOne could argue American Psycho as the greatest films of the 2000s, led by Christian Bale's iconic performance as the crazed investment banker Patrick Bateman. Carrying massive cultural and social relevance to today, American Psycho continues to be one of the cornerstones of modern cinema, with an incredible directive experience led by Mary Harron and Edward Pressman. Willem Dafoe, Jared Leto, and Matt Ross provide memorable characters, with the beauty of Samantha Mathis and Chloë Sevigny contrasting the gore that defines the film. While the film's pace may be controversial to some, American Psycho remains one of the most vital American films of modern cinema; a truly remarkable performance by a near-perfectly suited cast for the horrific depiction of Reaganite Capitalism run amok.",
      "review_date": "2021-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "THE best film of 2000. Screw the stupid anti-suburban (its been done before better) American Beauty. American Psycho satirizes 90s materialistic narcisitic emptiness. People with wants, needs, and no ability to connect. Brilliant. Now \"Feed THE best film of 2000. Screw the stupid anti-suburban (its been done before better) American Beauty. American Psycho satirizes 90s materialistic narcisitic emptiness. People with wants, needs, and no ability to connect. Brilliant. Now \"Feed me the kitty!\"",
      "review_date": "2006-03-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amasing. Christian Bale is the best Patrick Bateman. The book is fantastic and the movie is also great.",
      "review_date": "2009-02-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic. Bale's finest performance onscreen. I did have a problem with the \"twist\" at the end, but the rest is fantastic.",
      "review_date": "2009-02-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●■■$$$$$$$$$$$$$$$$$$$$$$$$$÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷÷%÷%",
      "review_date": "2021-07-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Despite being a bit confusing especially the end, the characters in it were brilliant and Christian Bale acted brilliantly. The subtle jokes were the best and the satirical undertones were great.",
      "review_date": "2012-12-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Christian Bale gives a well acted performance in this cult classic as Patrick Bateman, a young handsome New Yorker who is just cold-hearted. The formula in this Mary Harron of horror and black comedy works perfectly. This movie is one of theChristian Bale gives a well acted performance in this cult classic as Patrick Bateman, a young handsome New Yorker who is just cold-hearted. The formula in this Mary Harron of horror and black comedy works perfectly. This movie is one of the best of 2000",
      "review_date": "2014-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I honestly kinda love this movie. It's so grotesque and over-the-top that you just have to love it. Patrick Bateman isn't really right in his mind, sure, but the thrilling and twisting story about him going on murderous rampages and slowlyI honestly kinda love this movie. It's so grotesque and over-the-top that you just have to love it. Patrick Bateman isn't really right in his mind, sure, but the thrilling and twisting story about him going on murderous rampages and slowly losing his mind was just a genuine great experience - with a somewhat bitter aftertaste.",
      "review_date": "2021-08-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Pretty much as the title says a psycho movie. After the end you don't really know what it was supposed to mean and theories and various explanations on the internet come up. It's hard to know what else to add. It's quite confusing. But thePretty much as the title says a psycho movie. After the end you don't really know what it was supposed to mean and theories and various explanations on the internet come up. It's hard to know what else to add. It's quite confusing. But the film did offer some cool scenes. For me, an above average film that I rather not recommend.",
      "review_date": "2021-07-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAmerican psycho has a great suspense about what is going to happen in the movie whether they are going to catch him or whether everything is a lie. It has a really good concept and Christian Bale's performance is excellent. The last 20 minutes are the only not so bad, but I would prefer to call them not so good as the twist was predictable and that disappointed me as I was expecting something bigger. Though the movie is really interesting and good in general. Not the best thriller I have ever seen but it's a good one to see. It is entertaining and suspense but while you expect something big you are given a twist that has been seen many times... Despite that, Thumb up!",
      "review_date": "2013-08-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "American Psycho is off the rails.\rChristian Bale has possibly the performance of his career as a psychopathic businessman on tilt of killing in public. This film is a blast.",
      "review_date": "2014-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The film entire is slightly blotched, or spotty, as the whole cast has a trouble fitting in with the themes of the story, with the exception of Bale. His acting range spreads far beyond than any other actor in his generation. His depth intoThe film entire is slightly blotched, or spotty, as the whole cast has a trouble fitting in with the themes of the story, with the exception of Bale. His acting range spreads far beyond than any other actor in his generation. His depth into the role of Bateman adds more to the already allegorical outlook of the whole plot, and he's oddly charming and funny, especially when he kills Jared Leto with an ax to the face.",
      "review_date": "2014-03-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In comparison to the book, it contains none of the subvertive text (How would it?) that is necessary for the characters and \"storyline\" to grip onto. Without reading between the lines, we're left with a pointless story about a pointless In comparison to the book, it contains none of the subvertive text (How would it?) that is necessary for the characters and \"storyline\" to grip onto. Without reading between the lines, we're left with a pointless story about a pointless man doing pointless things - A film which Withnail and I did many moons ago, without the grotesque and (film wise) unnecessary gore.",
      "review_date": "2008-10-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Yuppie bloke goes bonkers, has a breakdown & kills lots of people. Or does he?I'd never read the Brett Easton-Ellis book but had heard a lot about it before seeing this when it came out.Bale is excellent as Patrick Bateman & the mood & feelYuppie bloke goes bonkers, has a breakdown & kills lots of people. Or does he?I'd never read the Brett Easton-Ellis book but had heard a lot about it before seeing this when it came out.Bale is excellent as Patrick Bateman & the mood & feel of the late 80's is very well done.Certainly listening to Phil Collins is understandable that you'd want to kill someone.Great performance, if brief, by Willem Dafoe as Detective Kimble.",
      "review_date": "2010-09-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "First off, Christian Bale is totally excellent in this part; because I’ve seen all the Batman films before seeing this, it came as a bit of a culture shock to see him in this particular role. But he carries it off brilliantly! I love the wayFirst off, Christian Bale is totally excellent in this part; because I’ve seen all the Batman films before seeing this, it came as a bit of a culture shock to see him in this particular role. But he carries it off brilliantly! I love the way his character’s narration overlay’s the images and the musical references are worked in so well. It’s a really well made film too with a pretentious cuisine and big chunky telephones taking us back to the 80’s. Having not read the book I did find some of it a little hard to follow, but I’ll add it to the reading list and give this one another look afterwards. Definitely worth a look though, if just for Bale’s performance.\r SteelMonster’s verdict: RECOMMENDED\r My score: 8.1/10",
      "review_date": "2013-03-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A unique blend of comedy and horror, this film is infinitely enjoyable. Christian Bale kills it as psychotic serial killer Patrick Bateman. I never expected myself to find a movie of this type funny, but it most certainly is at times, whileA unique blend of comedy and horror, this film is infinitely enjoyable. Christian Bale kills it as psychotic serial killer Patrick Bateman. I never expected myself to find a movie of this type funny, but it most certainly is at times, while the horror scenes are certainly suitably bloody and terrifying. Really good film.",
      "review_date": "2014-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "American Psycho is a bloody success! It's funny and violent and Bale's performance was excellent. The largest problem I had with the film was the ambiguity of the ending  but that aside it's a must see!",
      "review_date": "2013-11-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In the end this movie left me wondering what the point of it was exactly. Christian Bale was really good though.",
      "review_date": "2018-04-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Christian Bale plays a character so simple, yet so complex, it's hard to understand what you're actually watching. In short, the movie's just about a man killing women. There is no great background story to why he's exactly doing this or notChristian Bale plays a character so simple, yet so complex, it's hard to understand what you're actually watching. In short, the movie's just about a man killing women. There is no great background story to why he's exactly doing this or not an ending that gives you a final conclusion. On one side, Christian Bale is perfect for this role, but somehow, at the same time, he's not. His preformance, however, is what makes this dark thriller so interresting and brutally funny, going so far it makes you wonder \"How  sick am I?\" every time you laugh at any of the events.",
      "review_date": "2013-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Classic. American Psycho is a masterpiece. Christian Bale is phenomenal. Patrick Bateman is the most interesting character I have ever seen on screen.",
      "review_date": "2013-11-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"American Psycho\" is a nightmarish movie that delivers humor, horror and a stupendous performance from the charming star Christian Bale even if it is not as scary as the book that it's based of.",
      "review_date": "2014-09-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Patrick Bateman is an obviously mentally deranged yuppie. We see right from the beginning that he is purely pop-culture and sex obsessed, and we see an embodiment right there of his narcissistic mentality and the sarcastic intonation of hisPatrick Bateman is an obviously mentally deranged yuppie. We see right from the beginning that he is purely pop-culture and sex obsessed, and we see an embodiment right there of his narcissistic mentality and the sarcastic intonation of his voice. If the film was meant to be artificial, then it was well-matched with its leading character. His crazed breakdown may be too far down the line for its previous contrast but the confessional point of view was the savior, and this portrayal of a typical yuppie was satirical enough to demand the cold sterility of an apartment, the emptiness of any kind of relationship he might have had, and the insistence of making reservations to end all reservations. Personal lifestyle for what sake?",
      "review_date": "2013-11-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A frank and unsettling insight into the mind of a psychopath. Christian Bale gives an excellent performance and really sells the character to the audience. The tension and thrills slowly and effectively build as the movie progresses. The filmA frank and unsettling insight into the mind of a psychopath. Christian Bale gives an excellent performance and really sells the character to the audience. The tension and thrills slowly and effectively build as the movie progresses. The film can be a bit disjointed at times, possibly due to the cutting of some material in the transition from book to movie.",
      "review_date": "2012-03-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "N'ayant pas lu le livre, je m'arrÃªterai donc Ã  ce film, assez spÃ©cial... Bizarre dÃ©jÃ  dans le sujet (un playboy qui nous raconte et montre ses pulsions meutriÃ¨resN'ayant pas lu le livre, je m'arrÃªterai donc Ã  ce film, assez spÃ©cial... Bizarre dÃ©jÃ  dans le sujet (un playboy qui nous raconte et montre ses pulsions meutriÃ¨res non sans pudeur), dÃ©voilant au passage un humour d'une noirceur sans nom, ce qui apporte Ã  American Psycho une jouissance quasi malsaine. Etrange dans le fait que le film n'apporte rien, si ce n'est que du divertissement qu'il faut prendre au dixiÃ¨me degrÃ© pour supporter et apprÃ©cier les dÃ©boires psychopathes de cet abominable personnage (l'interdiction au moins de 16 ans n'est pas une exagÃ©ration). Franchement spÃ©cial! Mais s'il fallait retenir quelque chose d'Ã©vident, c'est bien la prestation de Christian Bale, que j'ai rarement vu aussi glacial, fendard et talentueux qu'ailleurs que dans cet OVNI du cinÃ©ma.",
      "review_date": "2012-01-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "At its heart its a satire of the times u know sexist greedy pigs who have it all  Party and drug use rampant and filthy but clean and shiny fake.Just like Patrick Bateman wearing a mask of sanity the 80's was nothing but a lie on the outsideAt its heart its a satire of the times u know sexist greedy pigs who have it all  Party and drug use rampant and filthy but clean and shiny fake.Just like Patrick Bateman wearing a mask of sanity the 80's was nothing but a lie on the outside and empty on the inside. Great Movie must see or buy",
      "review_date": "2013-07-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The acting was solid and the entire film was interesting. I think the run time was pushing it a little bit and it does get boring at times. Also its pretty confusing as well.",
      "review_date": "2011-11-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's alright. It would helped to know about Patrick's past. It doesn't have enough gore. It seems like a comedy at times with little to no suspense.",
      "review_date": "2012-01-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bale absolutely knocks it out of the park with his performance, He truly carries the film above and beyond what it should have been. I would highly recommend watching it just for Bale's performance alone.",
      "review_date": "2020-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "From writer Bret Easton Ellis, author of the dark teen 1980â",
      "review_date": "2012-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "American Psycho is worth watching, but it`s just an over the top killing movie, so make sure you care for that kind of thing, or just have nothing else to watch. I could see how some people may find this movie great, but it`s just not forAmerican Psycho is worth watching, but it`s just an over the top killing movie, so make sure you care for that kind of thing, or just have nothing else to watch. I could see how some people may find this movie great, but it`s just not for me.I will say the word Psycho fits the main character in every way. If you want to see a Psycho who dresses like the every day business man this is the movie for you.",
      "review_date": "2013-09-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The american reality impersonated...or grotestically put on! American Psycho tells the story of Patrick Bateman living his \"ordinary\" life, with not ordinary desires, that lead him to brink of...who knows.\r The movie's presentation is veryThe american reality impersonated...or grotestically put on! American Psycho tells the story of Patrick Bateman living his \"ordinary\" life, with not ordinary desires, that lead him to brink of...who knows.\r The movie's presentation is very solid and direct, as you unravel through the first 30 minutes what could be a extremely crazy psychopath.The plot, therefore, is great, showing how deep is Bateman's life, together with many stereotypes and the high class of the american life. The environment represnts very well the story, and it's questions it could bring. It may be confusing a bit, but it's conduction leave it up to the viewer to bring most of it together.\r Probably the most intense representation of the movie is the caricature of each and every person, and how strange they seem when put together on Patrick's life. The script remains solid on that point, representing truthfully whom each one of them represents, even though some come off shallow or hardly representation of polished work on them. Despite that, the picture is clear on it's approach and shows great work from the director.\r However, there are a few low points that can badly contribute to the conclusion. At  few times the confusing tone of the last act performs weakly, lowering the blow of the  conclusion the viewer develops himself. And despite brilliant performance from Christian Bale, most of the cast falls very short, partially beacause of the story, and partially because of the weak secondary characters that lead to less impact from the story.\r In the end, the picture is very good, bringing up many questions and showing a character that could be a simple man, which lead to ultimately great conclusion.\r 7.6/10",
      "review_date": "2015-09-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "All the artistic value and ambition and all the effort from Christian Bale does not stop this film from being boring. As boring as a film can get. I am all for artistry and definitely prefer a small film with a lot of artistry than aAll the artistic value and ambition and all the effort from Christian Bale does not stop this film from being boring. As boring as a film can get. I am all for artistry and definitely prefer a small film with a lot of artistry than a blockbuster. But nothing justifies this type of boredom Slightly over rated film, although not many people know about it. They are not missing much.",
      "review_date": "2015-01-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nChristian Bale in this movie is remarkable in his performance of Patrick Bateman, his actions are sometimes funny, his prowl is dark and you can really make out the disguise he is presenting towards others as he goes on a murderous rampage. This is also a very well filmed movie, the cinematography is great (particularly in the stair flight chainsaw scene). However, my main issues with this movie is that It could not follow a certain tone to the overall movie. Don't get me wrong, I like when genres get infused with one another but in this film, it seemed messy. For example, In the first act of the movie it established a dark yet funny tone to it, you wanted to see murder but you didn't want it to be found out and you wanted this character to remain anonymous. By the second and third act, this movie was a slasher, it was a comedy it was a drama it was a fantasy....The scenes were acted well but I wish they would've stuck to the dark and anonymous tone instead of making the character cocky and then bursting into tears about what he's done at the end. Patrick Bateman should've sustained a disguise and presented no emotion because that's what the film did especially well in the first act and what I was looking forward to for the entire running time. This is still a very well acted and very well made movie to watch, you just may need to be understand that it'll put everything it can onto you.",
      "review_date": "2015-07-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "American Psycho is the kind of film which one may enjoy watching clips of when inebriated but isn't as enjoyable to watch as a whole. This is because it doesn't take enough direction from the novel and focuses too greatly on Bale'sAmerican Psycho is the kind of film which one may enjoy watching clips of when inebriated but isn't as enjoyable to watch as a whole. This is because it doesn't take enough direction from the novel and focuses too greatly on Bale's performance and his killing scenes.",
      "review_date": "2014-04-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "American Psycho is a sick and hilarious film, but unfortunately to boring for my taste.\r The film is about a killer and I really like the story. It illustrates how mankind’s needs depend on who you are, and how strong they can be.  TheAmerican Psycho is a sick and hilarious film, but unfortunately to boring for my taste.\r The film is about a killer and I really like the story. It illustrates how mankind’s needs depend on who you are, and how strong they can be.  The movie gives a great insight in who we are and who we can be on the inside. The film is about our basic needs; food, sex and in this case: blood.  The story is well presented by the awesome actor Christian Bale and he’s both funny and insane in this film. The reason why I only give this film a 6 is because there are much slow scenes. There are also not much unique things. It could have happened more. There’s also not a clear climax-part in the film, which made the ending a bit rash but I still like it. The ending sums up the film very well and even though there could have happened more in the film, do I really recommend it.\r The characters and the story are both awesome, but the story could have included more action.\r American Psycho gets a 6.5/10.",
      "review_date": "2014-12-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Although the ironic tone is ridiculously uneven, American Psycho gets a passing grade. Christian Bale is deranged, sick, and amusing here with his portrayal of a Wall Street hotshot, and his associates are all oblivious and blissfully unawareAlthough the ironic tone is ridiculously uneven, American Psycho gets a passing grade. Christian Bale is deranged, sick, and amusing here with his portrayal of a Wall Street hotshot, and his associates are all oblivious and blissfully unaware of anything going on in the movie to the point where it's funny. The best part about the film is the ambiguity of everything. To decipher what's real and imaginary is all speculation, and that's the fun of it. Many movies have done this \"main-character-is-delusional\" thing before (Shutter Island, to name one), but not many have achieved it so satisfyingly well as American Psycho.",
      "review_date": "2014-11-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Christian Bale play's the psychopathic businessman, Patrick Bateman, in New York City in the 1980s in Mary Harron's adaptation of Bret Easton Ellis' American Psycho. With a relatively cliched protagonist as well as a forgettable story, thisChristian Bale play's the psychopathic businessman, Patrick Bateman, in New York City in the 1980s in Mary Harron's adaptation of Bret Easton Ellis' American Psycho. With a relatively cliched protagonist as well as a forgettable story, this movies saving grace is found in the talented acting of Christian Bale.\r Bale's character is given little depth, as his motives are never made clear beyond a whim to kill. The viewer can not pity him in almost any way, except at the near end of the film, but Bale manages to turn this role into a very entertaining and somewhat interesting character. His voice-over at times also adds tremendously to the role.\r The story follows the life of Bale after he murders fellow businessman, Paul Allen, played by Jered Leto. It is simplistic within itself and offers very little if any groundbreaking cinematic moments.\r Though the camerawork and atmosphere of the movie are quite well put together and do allow for a more enjoyable movie experience.\r In the end this film offers nothing out of the way of normal psychopathic thrillers, but is decent enough to pass its running time.",
      "review_date": "2014-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Despite a rather rushed and weak last act, American Psycho is a pretty good movie. The acting was great, the movie was well shot, it was entertaining and the story was interesting. If you like movies about serial killers and you haven't seenDespite a rather rushed and weak last act, American Psycho is a pretty good movie. The acting was great, the movie was well shot, it was entertaining and the story was interesting. If you like movies about serial killers and you haven't seen this one, you should without a doubt watch it.",
      "review_date": "2019-01-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Christian Bale probably displays his best acting performance ever in American Psycho. He is just so nuts in this film and no one suspects anything until he's about to slit their throat. Its like a slasher film without all the jump out scares.Christian Bale probably displays his best acting performance ever in American Psycho. He is just so nuts in this film and no one suspects anything until he's about to slit their throat. Its like a slasher film without all the jump out scares. Bales character took a lot of thought and it was well executed. Such a great film.",
      "review_date": "2014-11-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A very original film about a rich Wall Street employee who really enjoys killing people. Christian Bale performance is excellent here, the story is surprisingly well handled; and the conclusion this film had will leave you searching into your head.",
      "review_date": "2015-06-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "American Psycho succeeds at being both a mind-bending psychological thriller and a smart political satire at the same time, a rare feat. This film makes you think, but at the same time keeps you interested. There are a lot of shockingAmerican Psycho succeeds at being both a mind-bending psychological thriller and a smart political satire at the same time, a rare feat. This film makes you think, but at the same time keeps you interested. There are a lot of shocking moments, all driven by Christian Bale's superb performance. All in all, this is a great movie that more mature fans of Christian Bale should definitely check out.",
      "review_date": "2015-04-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I feel like \"American Psycho\" sacrificed some of it's quality for the sake of making a point. I did not like that, I wish the film had thought of a better way to execute itself. The film is still worth watching, I believe...",
      "review_date": "2016-10-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Book is better than the movie (i know, what a shock).I did not like the  ending of the movie, but it has good satire and describes weird reality of egoism taken to next level, Psychopath.I can already see I am in minority, but it's ok. weBook is better than the movie (i know, what a shock).I did not like the  ending of the movie, but it has good satire and describes weird reality of egoism taken to next level, Psychopath.I can already see I am in minority, but it's ok. we don't have to like or dislike same things. If you like the movie - good!Actors are great! Movie itself is done good enough ,I just did not like the way they told the story from the book",
      "review_date": "2018-03-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A sharp critic of the vain, shallow style of life in the half of 80s. Christian Bale is playboy, memorable in the skin of a modern Dr. Jeckyll - Mr. Hyde. Pay attention for the songs of OST.",
      "review_date": "2017-03-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I finally got to see this movie, and... it certainly is nothing of what i was expecting. Although Christian Bale is outstanding playing the psychopathic murderer, the rest of the cast fails to reach the same level. Movie got me hooked throughI finally got to see this movie, and... it certainly is nothing of what i was expecting. Although Christian Bale is outstanding playing the psychopathic murderer, the rest of the cast fails to reach the same level. Movie got me hooked through out, but the ending although very ambiguous also very underwhelming and complete shift of what seemed to be reality turned into an extreme dream. I guess Patrick Bateman isn't the murder psycho, but just a psycho searching for recognition somehow. Not a bad movie, but i guess i went into this with very high expectations",
      "review_date": "2018-04-25",
      "source": "metacritic"
    }
  ],
  "num_reviews": 123
}