{
  "title": "Crouching Tiger, Hidden Dragon",
  "rating": 8.2,
  "release_date": "2000-12-08",
  "genre": [
    "Action",
    "Adventure",
    "Drama",
    "Fantasy",
    "Romance"
  ],
  "summary": "In 19th century China, a magical sword given by a warrior (Chow Yun-Fat) to his lover (Michelle Yeoh) is stolen and the quest to find it ensues.  The search leads to the House of Yu where the story travels in a different direction with the introduction of a mysterious assassin and another love story.",
  "critic_reviews": [
    "Handsome, passionate and fun. It's everything we go to the movies for.",
    "This is a great movie, but it needs a sales job because it's in Mandarin.",
    "Soaring and romantic, wild and serene, feminist and gutsy, Crouching Tiger, Hidden Dragon is one of the best movies of the year.",
    "Transcends its origins and becomes one of a kind. It's glorious, unashamed escapism and surprisingly touching at the same time.",
    "The landscapes are so gorgeous, the philosophy so richly appealing, the narrative so epically sweeping, and the characters so intense.",
    "This is a waking dream of truly operatic dimensions.",
    "The class act of action movies.",
    "Magnificently nonchalant about its magic.",
    "Brilliance of the action and effects are supplemented by a consistently superior and resourceful score by Tan Dun.",
    "The picture is more fun than it has a right to be.",
    "My first viewing left me dazzled but slightly confused; a second deeply impressed; a third rhapsodic. I wish I hadn't needed to rediagram it in my head to turn it into the masterpiece it so obviously wants to be.",
    "Crouching Tiger's blend of the magical, the mythical and the romantic fills a need in us we might not even realize we had.",
    "The first Ang Lee film I've seen that I've liked without qualification.",
    "Has the sprawling canvas of an epic and the emotional heat of classical melodrama.",
    "A sweeping romantic epic with a strong feminist backbone, the thoroughly entertaining Crouching Tiger, Hidden Dragon also happens to boast a generous offering of seriously kick-ass action sequences that make 'The Matrix' seem downright quaint by comparison.",
    "A masterful synthesis of generic conventions and creative imagination, a sublime amalgam of some of the best tendencies and talent our times have to offer.",
    "The film satisfies on both visceral and emotional levels.",
    "Crouching Tiger's dramatic line is so blurry that the central character is only a bystander to the climactic fight between forces of good and evil.",
    "There's so much dreamy beauty in Crouching Tiger, Hidden Dragon that it's almost like a narcotic.",
    "What about Ronny Yu's 1992 masterpiece \"The Bride With White Hair,\" of which Crouching Tiger, Hidden Dragon is a decent facsimile?",
    "The film may be too talky for action-minded viewers and too fantastic for more serious spectators, but it brings appealing twists - including a feminist sensibility - to the venerable martial-arts genre."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Saying this is a bad film just because you are bored of reading the subtitles proves how uneducated and childish some people can be.Americans tend not to recognize the fact there is filmmaking happening outside of America and the Uk too. I Saying this is a bad film just because you are bored of reading the subtitles proves how uneducated and childish some people can be.Americans tend not to recognize the fact there is filmmaking happening outside of America and the Uk too. I must admit the origins of the film increase the hype surrounding it but most of all it's a rewarding movie full of high aesthetics,great martial performances and if not good acting,at least perfect photography.It's a piece glistenning with oriental elegance!",
      "review_date": "2009-07-06"
    },
    {
      "review_title": null,
      "content": "Most of the reviews seem to be all or nothing, for me, great acting, better story, beautifully filmed.",
      "review_date": "2007-09-01"
    },
    {
      "review_title": null,
      "content": "Crouching Tiger, Hidden Dragon is Lee's masterpiece, and possibly his most creative film. He honors the traditional style of Chinese filmmaking with respect and careful attention to detail. It's beautiful and stunning, with memorable andCrouching Tiger, Hidden Dragon is Lee's masterpiece, and possibly his most creative film. He honors the traditional style of Chinese filmmaking with respect and careful attention to detail. It's beautiful and stunning, with memorable and expertly choreographed fighting scenes, and top-notch cinematography. Even thought the movie was translated into English for me, I still found its (translated) dialogue very well-written and well-said. Not to mention, the acting and story are pretty good as well, but not up to the level of the beauty and art side of the film.",
      "review_date": "2014-04-30"
    },
    {
      "review_title": null,
      "content": "I had no idea what to expect my first time watching this film and it had everything to make it a masterpiece and is also the film that cause an interest in foreign films for good reasons. As far as story go, Ang Lee dose a great job capturingI had no idea what to expect my first time watching this film and it had everything to make it a masterpiece and is also the film that cause an interest in foreign films for good reasons. As far as story go, Ang Lee dose a great job capturing the feel in every scene in both the action sequence and dramatic scenes that its beautiful to watch. It`s a story that blends action, romance, betrayal, and vengeance with flawless execution which makes for an experience unlike Hollywood will ever make. The special effects in this film makes it more unbelievable how incredible this film is. The only complaints is not a big deal unless you hate reading subtitles for an entire movie. I recommend anybody who wants a different experience than what their usually use to.",
      "review_date": "2010-09-21"
    },
    {
      "review_title": null,
      "content": "Boring! The story was long, drawn out, and had little to no redeeming qualities. The acting was good, though the whole idea of the movie was pushed at its \"amazing\" effects. I'm sorry, but people jumping around on trees obviously Boring! The story was long, drawn out, and had little to no redeeming qualities. The acting was good, though the whole idea of the movie was pushed at its \"amazing\" effects. I'm sorry, but people jumping around on trees obviously dangling from wires is not my idea of 'good' effects. Forget Crouching Tiger, Get \"House of Flying Daggers\" or \"Hero\". They are both 100% better than this.",
      "review_date": "2008-01-23"
    },
    {
      "review_title": null,
      "content": "Crouching poop is more like it. For sheep who want to belong to the hip crowd and the artsy fartsy folks with below average IQ. Clearly the reviewers were all paid off or cherry picked (Sony is notorious for fixing reviews), because they cantCrouching poop is more like it. For sheep who want to belong to the hip crowd and the artsy fartsy folks with below average IQ. Clearly the reviewers were all paid off or cherry picked (Sony is notorious for fixing reviews), because they cant get average real people to positively review their garbage. Extremely boring film with nonsensical plot, uninteresting characters that have no depth whatsoever on top of extremely stupid looking martial arts like we were back in the early 80s again (but without the grit). No redeeming qualities anywhere. This one was so bad I actually walked out of the movie theater on its premiere more than a decade ago. I asked and was given a refund. I watched it entirely a few days ago and basically played with my phone the second half of the movie out of boredom. For what its worth, I like action movies but I don't need explosions and effects to find enjoyment. I need a story 1st, and then anything else is gravy... it a movie after all. If i want to look at a painting ill go do that but this is a movie and not a painting. A movie is supposed to have a story to tell otherwise there is no reason to make it into a movie aside from appeasing one inflated ego. Even if a story is non-sense it could still be interesting if characters are interesting or funny. This movie has none of that. It might as well had been told in a 10 page picture book for kids.\r People need to stop selling out just to fit into the crowd. Grow a spine and call it what it is. This is a bad movie that was overrated through corporate payoffs.",
      "review_date": "2015-01-21"
    },
    {
      "review_title": null,
      "content": "One of the best movies ive seen ever, so beautiful the music is poetic and beautiful, the fight scenes beautifully choreographed, such a lovely movie.",
      "review_date": "2010-11-25"
    },
    {
      "review_title": null,
      "content": "Who the hell cared about a stupid movie as this? I just dont understand why anyone would like to waste 2 hours watching a movie they cant understand with no plot whatsoever.",
      "review_date": "2005-11-21"
    },
    {
      "review_title": null,
      "content": "This film really surprised me. It's very well made and stunning to watch. The scenery is spectacular, the film alone could be used as an advertisement for Tourism in China. The action sequences are unbelievable and the three main stars areThis film really surprised me. It's very well made and stunning to watch. The scenery is spectacular, the film alone could be used as an advertisement for Tourism in China. The action sequences are unbelievable and the three main stars are very well cast. This is a visual feast.",
      "review_date": "2010-10-04"
    },
    {
      "review_title": null,
      "content": "This is martial arts at its finest, a film where everybody is fighting for something, there is always a sense when watching a classic martial arts film that when these fight scenes happen, the artists involved appreciate and respect the skillThis is martial arts at its finest, a film where everybody is fighting for something, there is always a sense when watching a classic martial arts film that when these fight scenes happen, the artists involved appreciate and respect the skill of their enemy or counterpart, and director Ang Lee has respected this essence in this epic tale.\rNot only does he create some spectacular scenes of awe and beauty, but he also has a compelling and fluid story that equally matches the action, a feat that may seem impossible, given the ambitious, heroic and gravity-defying segments that are played out as a well choreographed drama that surprises throughout, it's a riveting fantasy but also keeps a very grounded element and human touch to drive the film forward.\rThe story surrounds a very ancient and sought-after sword, owned by veteran warrior Li Mu Bai (Chow Yun-Fat) who is now passing it along as a gift, something that surprises many, including his fellow warrior and longtime love interest Yu Shu Lien (Michelle Yeoh). But the such a sought after sword is not safe anywhere and a cunning but unknown thief steals the sword, setting various pieces of the puzzle into place, we are also introduced to  Jen Yu (Zhang Ziyi), who has a deep interest in the work of the warriors, but leads a very routine life and is soon to be married. She is the dark horse of the film, where it becomes clear that all is not as it seems with this mysterious girl.\rThis ties in well with the spectacular scenes of action involving roof chases, wall climbing and some very impressive sequences that were all done without computer generated actions, these actors and actresses did most of their own work, and it is the seamless motion of these moments, paired with an intriguing and in depth story that make this one of the best martial arts films ever made, it has moments of grandeur but also never let's go of its humility, which combines love, loss, anger and respect,all while also showing some groundbreaking fight sequences that will truly be viewed as unmatched.\rGreat performances, excellent direction and expert cinematography which creates a mesmerising film of epic proportions, it has a simple premise but is delivered on a much broader and intertwining story arc that keeps on giving right to the credits.",
      "review_date": "2013-09-02"
    },
    {
      "review_title": null,
      "content": "It goes from boring in the beginning all the way to the perfect martial arts/action movie. I found most of the martial arts scenes to be surprisingly ambitious.",
      "review_date": "2011-12-30"
    },
    {
      "review_title": null,
      "content": "Crouching Tiger, Hidden Dragon is arguably one of the finest movies ever made and it is truly a masterpiece in every aspect of film-making such as characterization, action sequences, screenplay, direction, cinematography, acting, the stoylineCrouching Tiger, Hidden Dragon is arguably one of the finest movies ever made and it is truly a masterpiece in every aspect of film-making such as characterization, action sequences, screenplay, direction, cinematography, acting, the stoyline and the main theme of the movie. I don't remember how many times I have watched this movie and it always feels so great, gives me much satisfaction.",
      "review_date": "2012-12-04"
    },
    {
      "review_title": null,
      "content": "The go-to wuxia film. Lyrical and elegant, at a certain point it becomes more than just an action film with beautifully choreographed action sequences.",
      "review_date": "2012-11-04"
    },
    {
      "review_title": null,
      "content": "I found it a little overrated. It wasn't as astonishing as I had expected. A little better than a so-so one for me. That's it. Some predictable stuff and not so amazing story to me.",
      "review_date": "2013-04-14"
    },
    {
      "review_title": null,
      "content": "This is not your typical American \"Chinese\" film about fighting, gangs and all that stereotypical crap. Humanism permeates this film as much as in other film by Lee Ang. All violence is token and is subjugated to a purpose. Comparing thisThis is not your typical American \"Chinese\" film about fighting, gangs and all that stereotypical crap. Humanism permeates this film as much as in other film by Lee Ang. All violence is token and is subjugated to a purpose. Comparing this film to Jackie Chan flicks is not unlike comparing fine cuisine in China to the supposed \"Chinese food\" in the US.",
      "review_date": "2013-05-10"
    },
    {
      "review_title": null,
      "content": "I must have seen a different movie. Many of my friends praise this as the ultimate (and poetic) martial arts movie. For me the movie was just above average. The story is nothing special for me. I will even say it was boring some times. TheI must have seen a different movie. Many of my friends praise this as the ultimate (and poetic) martial arts movie. For me the movie was just above average. The story is nothing special for me. I will even say it was boring some times. The pictures are fantastic and the soundtrack is good. The martial art scenes are good too and Chow Yun Fat is always a bonus point. The actors are good, a solid performance from everyone. Overall I find the movie is a bit overrated but by all standards no failure. I would give 6,5 /10 so that means rounded up 7/10.",
      "review_date": "2014-09-16"
    },
    {
      "review_title": null,
      "content": "When I watch an action movie that has romance, I cringe because alot of times those two genres dont get mixed very well, but the director did such a wonderful job paying sooo much attention to the music, film setting, and the beauty thatWhen I watch an action movie that has romance, I cringe because alot of times those two genres dont get mixed very well, but the director did such a wonderful job paying sooo much attention to the music, film setting, and the beauty that China has to offer. Yes, it is not that perfect in terms of predictability but you will get immersed in the interweaving plots that this movie has to offer. For me, it was quite relatable from the lessons that the director tried to convey. The fight scenes are of course classic and the acting is alright.\r I'm giving this a 10 because this is a unique film in its genre that gives a real story instead of just 2 hrs of hardcore action",
      "review_date": "2015-03-19"
    },
    {
      "review_title": null,
      "content": "I honestly headed into this film thinking that I would not like it because of the subtitles, but it was very good. Not the best movie ever, obviously, but it was very entertaining, especially once I came to understand what the characters wereI honestly headed into this film thinking that I would not like it because of the subtitles, but it was very good. Not the best movie ever, obviously, but it was very entertaining, especially once I came to understand what the characters were representing. Ang Lee did a fantastic job directing the film and all of the actors were marvelous as well.",
      "review_date": "2013-05-09"
    },
    {
      "review_title": null,
      "content": "Please no, make it stop. When the most over-rated director of all time is let loose with such a poor script and weak concept, no wonder the result is a muddled and contrived nonsense. Absolute drivel from start to finish, genuinely I can'tPlease no, make it stop. When the most over-rated director of all time is let loose with such a poor script and weak concept, no wonder the result is a muddled and contrived nonsense. Absolute drivel from start to finish, genuinely I can't find anything positive to say about this awful waste of time. I gave this 1 out of 10, and that point is only earned for it being the only film I ever walked out on at the cinema. I gave it a second chance on DVD, but to no avail. This motion picture is a modern day version of the emperors new clothes! People will tell you its good and give you that knowing look, as though there's some deep, wonderful secret to be found here. There isn't. The only secret is that its simply a woefully poor film. Avoid at all costs.",
      "review_date": "2012-08-04"
    },
    {
      "review_title": null,
      "content": "Brings an elegance to the martial arts movie that is of utmost significance. It is not the perfect film that the critics make it out to be, but I'm glad this film was made. It teaches us that a genre which seems flat and one-sided can beBrings an elegance to the martial arts movie that is of utmost significance. It is not the perfect film that the critics make it out to be, but I'm glad this film was made. It teaches us that a genre which seems flat and one-sided can be transcended and made important.",
      "review_date": "2012-11-17"
    },
    {
      "review_title": null,
      "content": "I was in the belief that this movie would turn out amongst the critics as a pile of worthless, tedious crap. I found myself choking on the fact that this actually did well at the box office, and even critics raved about. I've seen a lotI was in the belief that this movie would turn out amongst the critics as a pile of worthless, tedious crap. I found myself choking on the fact that this actually did well at the box office, and even critics raved about. I've seen a lot better films in my lifetime, and yet this tops off as best compared with films I've seen which ACTUALLY HAVE A PLOT. Darn it, I hoped something interesting would happen when I was watching this, but I couldn't, because I didn't know what the hell was going on. I couldn't exactly make out much apart from some sword, dancing through trees and some random love story, which in itself made no sense. And the ending? The worst ending in the history of the earth, a complete flop - fortunately, at least the other parts of the film were bad so it wasn't let down by the ending, although I wouldn't have minded in myself - it was so boring anyway, I didn't see why we should have turned it off while me and my family we watching before it finished. At least I got to see what sort of MASSIVE FAIL the ending was, to top it all off.",
      "review_date": "2011-10-16"
    },
    {
      "review_title": null,
      "content": "To this day I still do not understand what anyone got from this movie.  I waited and waited for a good scene, any good scene to arrive, then the movie abruptly ended.  Worst movie I can remember seeing.  \"Action\" movie?  There is NEVER anyTo this day I still do not understand what anyone got from this movie.  I waited and waited for a good scene, any good scene to arrive, then the movie abruptly ended.  Worst movie I can remember seeing.  \"Action\" movie?  There is NEVER any decent action and the story is rubbish.",
      "review_date": "2014-11-12"
    },
    {
      "review_title": null,
      "content": "Could not even get halfway through this stupid movie.",
      "review_date": "2005-10-11"
    },
    {
      "review_title": null,
      "content": "Really good movie and the action was awesome. Hard to follow in parts.",
      "review_date": "2007-02-08"
    },
    {
      "review_title": null,
      "content": "This movie is awesome and emotional. Very good music, actors, and have stunning atmosphere.",
      "review_date": "2019-08-06"
    },
    {
      "review_title": null,
      "content": "This movie was mad. The graphics was really good and thestroy line was interesting.",
      "review_date": "2008-03-03"
    },
    {
      "review_title": null,
      "content": "Films like this really annoy me, simply because of the over the top fighting. If you want a good martial arts film that is recent, then watch ong bak or tom yum goong(aka the protector aka the warrior king).",
      "review_date": "2006-11-30"
    },
    {
      "review_title": null,
      "content": "This movie was 10x better the Pan's Labyrinth, which in my mind was sorely disapointing reguardless of the hype. A little long but it tells a great story!",
      "review_date": "2008-08-19"
    },
    {
      "review_title": null,
      "content": "The biggest problem with Crouching Tiger was that it's brilliance and success opened the door to all the incoherent, emperor-worshiping, \"costumes and choreography over story\" crap like Hero and Flying Daggers and Golden Blossom. Those The biggest problem with Crouching Tiger was that it's brilliance and success opened the door to all the incoherent, emperor-worshiping, \"costumes and choreography over story\" crap like Hero and Flying Daggers and Golden Blossom. Those later wuxia offerings were visual spectacles, but lacked story or plot. Which is perhaps why simple-minded fanboys prefer them to the intelligence and grace of this masterpiece.",
      "review_date": "2009-02-07"
    },
    {
      "review_title": null,
      "content": "It's bomb! You know it!",
      "review_date": "2005-11-10"
    },
    {
      "review_title": null,
      "content": "An excellent film and perhaps the only variation on Pride and Prejudice I can stomach. It's a story primarily about the decisions one must make when duty and honor clash with desire and passion, told through moments of tender romance An excellent film and perhaps the only variation on Pride and Prejudice I can stomach. It's a story primarily about the decisions one must make when duty and honor clash with desire and passion, told through moments of tender romance and fierce conflict. I came to see an action flick. I left having seen an epic.",
      "review_date": "2006-08-11"
    },
    {
      "review_title": null,
      "content": "The film was rather interesting due to its storyline but it lacks action prior to the other Hong Kong thrillers. Still a watchable movie worthy of an Oscar.",
      "review_date": "2007-12-13"
    },
    {
      "review_title": null,
      "content": "It was ok. The fight scenes need a more aggressive editor. The film is gorgeous to look at and listen to. I don't find tragedy very entertaining. Especially when it unfolds so slowly.",
      "review_date": "2007-03-17"
    },
    {
      "review_title": null,
      "content": "This is honestly my favorite movie. I hadn't looked at these reviews yet, and it surprises me that it got such high scores because reviewers rarely like the same movies that I do. Oh, and to the kid who said that he likes The Protector This is honestly my favorite movie. I hadn't looked at these reviews yet, and it surprises me that it got such high scores because reviewers rarely like the same movies that I do. Oh, and to the kid who said that he likes The Protector better, I saw that and I agree that the action is absolutely stunning. I think that guy had to have almost died multiple times in the making of the movie, but the storyline was obviously the last thing on anyone's mind while making the movie.",
      "review_date": "2007-06-26"
    },
    {
      "review_title": null,
      "content": "An artistically stylized martial arts movie with great performances from all.",
      "review_date": "2008-07-15"
    },
    {
      "review_title": null,
      "content": "Crouching Tiger Hidden Dragon is a movie that explores the mythical side of our imagination, is something that begins to try and make our minds become a world in itself. However, was it the type of movie that is reaching for the stars when Crouching Tiger Hidden Dragon is a movie that explores the mythical side of our imagination, is something that begins to try and make our minds become a world in itself. However, was it the type of movie that is reaching for the stars when it can barely jump off the ground? ",
      "review_date": "2009-04-18"
    },
    {
      "review_title": null,
      "content": "Amazing, beautiful, and great action. Probally the best movie I've ever seen. Ang Lee did an amazing job.",
      "review_date": "2001-07-31"
    },
    {
      "review_title": null,
      "content": "Pshh, stupid chunk n. u must not know what a good movie is. this is a masterpeice of foreign filmmaking!",
      "review_date": "2005-10-21"
    },
    {
      "review_title": null,
      "content": "This movie was so awesome. If you are into Chinese mythology, you'll love this movie. If you are into Chinese ass kicking, you'll love this movie.",
      "review_date": "2005-12-09"
    },
    {
      "review_title": null,
      "content": "It's simply to say,that 'Crouching Tiger' is the best martial arts movie of all time! Great directing,good acting,excellent cinematography and impressive fight sequences!",
      "review_date": "2006-01-12"
    },
    {
      "review_title": null,
      "content": "I was mesmerized by a martial arts movie presented with the beauty and grace of a ballet. Martial arts movies are always about \"dance\" as we watch the warriors participating in moves rooted in nature. Usually these moves are fascinating to I was mesmerized by a martial arts movie presented with the beauty and grace of a ballet. Martial arts movies are always about \"dance\" as we watch the warriors participating in moves rooted in nature. Usually these moves are fascinating to watch. But, whereas others seized my attention by the complexity of the moves, this movie snared me with the expression of simple beauty.",
      "review_date": "2006-06-23"
    },
    {
      "review_title": null,
      "content": "Absolutely fantastic! This movie shows the true beauty of martial arts cinema, it's a shame not everybody understands it.",
      "review_date": "2007-01-27"
    },
    {
      "review_title": null,
      "content": "This movie is the very definition of perfection. The action, the editing, the music, the cinematography, the script - everything. It all just comes together into a single blend of perfect film-making that will never be surpassed.",
      "review_date": "2016-08-31"
    },
    {
      "review_title": null,
      "content": "CTHD is a sentimental period drama wrapped in a martial arts package. The writing, soundtrack, cast and fight choreography are superb keeping you drawn in. The quality of the production is exceptional and holds up well in 2022. I suppose theCTHD is a sentimental period drama wrapped in a martial arts package. The writing, soundtrack, cast and fight choreography are superb keeping you drawn in. The quality of the production is exceptional and holds up well in 2022. I suppose the only criticism for me is that Ang Lee never chooses to lean fully towards either the action or the drama so neither get the full focus to truly bring forth a 'perfect movie' experience.",
      "review_date": "2022-11-26"
    },
    {
      "review_title": null,
      "content": "After seeing good reviews for this movie I thought it was gonna be really cool but I was wrong. This movie is very overrated and has a boring story. The story is about a thief that steals a special sword, people chase after that thief, theAfter seeing good reviews for this movie I thought it was gonna be really cool but I was wrong. This movie is very overrated and has a boring story. The story is about a thief that steals a special sword, people chase after that thief, the thief falls in love the end. The fighting scenes are cheesy and not very good and the floating acrobatics did the movie no justice. Overall I wouldn't recommend this movie, there are better martial arts/fantasy movies out there.",
      "review_date": "2015-01-26"
    },
    {
      "review_title": null,
      "content": "I was absolutely mesmerised by Crouching Tiger, Hidden Dragon. Everything about it is breathtaking, it is nothing short of a poetic, visually gorgeous martial arts masterpiece. As much as I did love Brokeback Mountain, I think this is AngI was absolutely mesmerised by Crouching Tiger, Hidden Dragon. Everything about it is breathtaking, it is nothing short of a poetic, visually gorgeous martial arts masterpiece. As much as I did love Brokeback Mountain, I think this is Ang Lee's best film. Speaking of Lee, he is a fine director, and does a superb job with his direction on this film. The story is easy to follow, but there is also a certain complexity to it as it explores the perennial themes of love, loyalty, duty and sacrifice, while the script is wonderfully poetic and the pace rarely lags.The characters are also hugely credible. They could have been clichéd easily, but actually they have surprisingly so much depth to them and at the end you admire them. The visuals, music, stunt work and acting are what really impress though. The film looks gorgeous, all Ang Lee's films look beautiful but this gets my vote as his most visually stunning. The cinematography is beautiful, and the scenery and costumes are exquisite. The stunt work is brilliantly choreographed and the special effects actually enhance rather than distract. The music is just gorgeous, there were a few scenes where I was reduced to tears. And there are many memorable scenes especially the jaw-dropping rooftop pursuit and tree top battle. As for the acting, Chow Yun-Fat and Michelle Yeoh both excel, and I was surprised in a very good way by Zhang Ziyi who is electrifying as the teenage thief.In conclusion, this is a breathtaking film and a must see for anyone who loves martial arts or visually stunning movies especially. 10/10 Bethany Cox",
      "review_date": "2022-03-14"
    },
    {
      "review_title": null,
      "content": "Hands down, the best Ang Lee movie over all. I've finally experienced his movies and it assumes his best movie is also the best movie of 2000 according to the Metascore.",
      "review_date": "2016-05-01"
    },
    {
      "review_title": null,
      "content": "I had high expectations for this show but was largely let down. Although the special effects were good, the acting was mediocre and the ending was terrible and disappointing.",
      "review_date": "2015-12-28"
    },
    {
      "review_title": null,
      "content": "Plenty of movies claim to have \"something for everyone\", but few are able to master dozens of elements the way Crouching Tiger does. This is one of the great art house films ever made and also one of the great action spectaculars. HowPlenty of movies claim to have \"something for everyone\", but few are able to master dozens of elements the way Crouching Tiger does. This is one of the great art house films ever made and also one of the great action spectaculars. How delightfully crazy is that to think?",
      "review_date": "2018-06-23"
    },
    {
      "review_title": null,
      "content": "From the same school as Ben Hur and Spartacus, an epic adventure that intelligently combines martial arts with Chinese mythology, using astonishing choreography. It is true that there have been identical films, but none have been able toFrom the same school as Ben Hur and Spartacus, an epic adventure that intelligently combines martial arts with Chinese mythology, using astonishing choreography. It is true that there have been identical films, but none have been able to duplicate it. Some of the best of the new millennium.",
      "review_date": "2021-03-06"
    },
    {
      "review_title": null,
      "content": "hidden beneath its self-created legacy..Crouching Tiger, Hidden Dragon\n\nThe action sequences can be inedible for some viewers but one cannot deny the fact about the way they are projected, as they express rage, fury and vulnerability morehidden beneath its self-created legacy..Crouching Tiger, Hidden DragonThe action sequences can be inedible for some viewers but one cannot deny the fact about the way they are projected, as they express rage, fury and vulnerability more than the performance can; this is a masterstroke by the makers and the primary reason of its definite impression that it leaves the audience with. The script doesn't bar any specific format and has a newer and smarter structure to offer, that is completely adaptive and enthralling in its own way of storytelling. Ang Lee; the director, has done a tremendous work on executing such an eerie and humane vision of its \"meta-human\" characters. It is rich on technical aspects like editing, sound department and choreography. The performance unfortunately is not something where the feature scores and the actors, too weren't given enough range and room to flaunt in or factor in except for the lead actress. Despite of brilliant execution, it fails to draw out the essential emotions from the screen which at a certain point, is what it completely relies upon and in the end leaves this hollow space floating in the air. Crouching Tiger, Hidden Dragon is actually hidden beneath its self-created legacy that is layered and installed subtly which is plausible but it also never goes loud even when it becomes essential.",
      "review_date": "2018-06-20"
    },
    {
      "review_title": null,
      "content": "Watched this movie when I was very young and didn't get the meaning of it, but I liked the ending song anyway. Now I'm a grown-up, this movie really surprises me when re-watch.",
      "review_date": "2020-03-25"
    },
    {
      "review_title": null,
      "content": "This film bangs and is monstrously important to Western interest in Asian wuxia films. Buoyed by strong performances, explosive (though not literally) action sequences, and an atmospheric soundtrack, Crouching Tiger, Hidden Dragon stands as aThis film bangs and is monstrously important to Western interest in Asian wuxia films. Buoyed by strong performances, explosive (though not literally) action sequences, and an atmospheric soundtrack, Crouching Tiger, Hidden Dragon stands as a tribute to all the classic wuxia films. I find it funny that all the people giving negative reviews to this film have names like Kevin, Todd, and Tracey.",
      "review_date": "2018-06-29"
    },
    {
      "review_title": null,
      "content": "This movie feels like Imagine walking through a art gallery, beautiful and the focus isn't the story.",
      "review_date": "2020-01-25"
    },
    {
      "review_title": null,
      "content": "The main force of this movie is the way it is filmed: landscapes, fights scenes, light and the differents shooting plans in the overall are amazing, colorful and impressive. Choregraphies are barely too unbelievable to be underlined. ChoiceThe main force of this movie is the way it is filmed: landscapes, fights scenes, light and the differents shooting plans in the overall are amazing, colorful and impressive. Choregraphies are barely too unbelievable to be underlined. Choice of actors and their importance in the plot also are surprising. I was astonished by the place let to women in a 2000-movie taking place in the Medieval Asia. Hopefully these women are able to take the huge place they deserve in the story and complete it perfectly, making this a considerable piece in the feminist fight. Story by the way is crazy-original and totally goes out of the mainstream way of asian martial movies.Unfortunately the movie is constructed in a way it makes difficult to easily and clearly understand where it wants us to go. Stories are developped in parallel with varying levels of detail. The bad point about choregraphies is to look in the scenes in which characters 'fly' and 'run' of roofs. In these parts of the movie special effects simply sucks. It then becomes really hard to keep focus despite what the movie is showing us. Laughter is not welcome during drama scenes. I read a lot of people's opinion saying the acting was cool. I do not agree since half of the characters (often the oldest) seems to play like they were impassible monks. Hopefully the end brings a bit of emotions to everyone in the cast. Speaking of the ending (no spoil I promise), I just didn't get it. The credits truly seem to be in the bad place. I can't help thinking that producers didn't know how to end all this.",
      "review_date": "2020-11-15"
    },
    {
      "review_title": null,
      "content": "Beautiful visuals, excellent action sequences and great direction make this movie worth your time.",
      "review_date": "2019-08-22"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \namazing choreographed action movie one of the ogs this movie can go up there with the flying guillotine",
      "review_date": "2019-11-24"
    },
    {
      "review_title": null,
      "content": "Sauron's forces have laid siege to Minas Tirith, the capital of Gondor, in their efforts to eliminate the race of men. The once-great kingdom, watched over by a fading steward, has never been in more desperate need of its king. But canSauron's forces have laid siege to Minas Tirith, the capital of Gondor, in their efforts to eliminate the race of men. The once-great kingdom, watched over by a fading steward, has never been in more desperate need of its king. But can Aragorn (Viggo Mortensen) answer the call of his heritage and become what he was born to be? In no small",
      "review_date": "2022-09-19"
    },
    {
      "review_title": null,
      "content": "If you are a crying SJW, that os your movie! It is a masterpiece, with respecto for plot, characters and public inteligente! 2 thumbs UP....",
      "review_date": "2020-06-25"
    },
    {
      "review_title": null,
      "content": "Absolute magic. The story is simple but done extremely well. The choreography, camerawork and editing show mastery on another level. This is definitely a film worth owning and watching a hundred times over.",
      "review_date": "2020-07-06"
    },
    {
      "review_title": null,
      "content": "A fantastic layered story with it's stunning cinematography and beautifully choregraphed fight scenes all combines to make one of 2000's best movies.A classic.",
      "review_date": "2021-08-08"
    },
    {
      "review_title": null,
      "content": "A beautifully made, graceful, well acted, and emotional movie that is still excellent to watch to this day. Watching it in its original Chinese language with subtitles is an exceptional joy as effort was put into the subtitles to make it fitA beautifully made, graceful, well acted, and emotional movie that is still excellent to watch to this day. Watching it in its original Chinese language with subtitles is an exceptional joy as effort was put into the subtitles to make it fit with the somber nature of the film.",
      "review_date": "2022-07-30"
    },
    {
      "review_title": null,
      "content": "bel film con un bel finale.Zhang Ziyi e Michelle Yeoh superbe come sempre .oscar meritati",
      "review_date": "2023-02-07"
    }
  ],
  "num_reviews": 84
}