{
  "title": "The Holy Mountain",
  "rating": 6.2,
  "release_date": "1973-11-29",
  "genre": [
    "Adventure",
    "Drama",
    "Fantasy"
  ],
  "summary": "In a corrupt, greed-fueled world, a powerful alchemist leads a Christ-like character and seven materialistic figures to the Holy Mountain, where they hope to achieve enlightenment.",
  "critic_reviews": [
    "So extreme in its sacrilege that it achieves a kind of sacredness, The Holy Mountain is a transcendental feast of the grotesque and the sublime.",
    "Witty, disgusting, eye-popping, and incomprehensible, The Holy Mountain is every bit as pop-philosophical as Jodorowsky's earlier work, but it also contains original visual ideas nearly every 30 seconds, from frogs in armor to crucifixes made out of painted bread.",
    "A landmark of visionary filmmaking pitched somewhere between magic ritual and surreal burlesque.",
    "A plumply overripe fruit of the counterculture, dripping with the juices of spiritual rebellion, semi-comic posturing, consciousness-raising and all-around freakiness.",
    "More than three decades later, Jodorowsky’s vision of chaos has acquired a powerful aura of prophecy.",
    "On the whole, enjoyable nonsense.",
    "The Holy Mountain is nothing if not exuberant while cartwheeling its way through the cosmos and back through the non sequitur-strewn plains and deserts, towns and cities, ridges and ranges of Mexico.",
    "With Jodorowsky's meaning somewhat opaque, it's slightly tedious going, but you certainly get plenty to look at.",
    "Mr. Jodorowsky’s movie is a dazzling, rambling, often incoherent satire on consumerism, militarism and the exploitation of third world cultures by the West. It unfurls like a hallucinogenic daydream.",
    "The mise-en-scene is packed with colorful, often shocking images (blood and body wastes are recurring motifs) but orchestrated in a creative delirium."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Alejandro Jodorowski manages to convey his philosophical understanding of the world. Through the symbolism and the extremely influential surrealistic shots, a complete work of art comes to life in front of the spectators. Knowledge in theAlejandro Jodorowski manages to convey his philosophical understanding of the world. Through the symbolism and the extremely influential surrealistic shots, a complete work of art comes to life in front of the spectators. Knowledge in the field of religion and esotericism is required due to the presence of many images related to tarot, the meaning of the planets, even playing out important past events. This is a film that keeps you in the dark until the very end, where there is a sharp change in the whole idea of ​​the viewers and participants about the truth of reality, the path to wisdom and the difficulties and fears that follow it. The end is stunning to the mind and makes a comparison between reality and existence, body and soul, love and ego.",
      "review_date": "2021-03-25"
    },
    {
      "review_title": null,
      "content": "According to an acquaintance, underground film critic Aboul Clanché, \"Cinema is a shoddy product with reduced meaning, and therefore, aesthetically, masterpieces are born from shoddy products.\"Reading Bernie Bartels' film essay in theAccording to an acquaintance, underground film critic Aboul Clanché, \"Cinema is a shoddy product with reduced meaning, and therefore, aesthetically, masterpieces are born from shoddy products.\"Reading Bernie Bartels' film essay in the Spanish entertainment magazine Bound, the words \"In the art of cinema, when an image burns in the mind, it is either vomit or euphoria\" come to mind.And this film is somewhere between disgusting and pleasurable, reaching the height of bad taste at a time when one should either be incontinent or masturbating in a drive-through theater with something as beautiful and smelly as a rose.Holy Mountain is both a fine film and a playful visual magic show in which twisted freaks rush to the laboratory of the \"old man in the test tube\" seen through the foggy darkness of the freak show.And... By Tuck Ducky (blogger, deceased), \"an artful abolitionist film realized on film.\"If this film had been made in the silent film era, it might have surpassed Chaplin.",
      "review_date": "2023-01-26"
    }
  ],
  "num_reviews": 12
}