{
    "title": "Breaking the Waves",
    "rating": 8.0,
    "release_date": "1996-11-13",
    "genre": [
        "Drama",
        "Romance"
    ],
    "summary": "Set in a remote coastal village in northern Scotland, this is the extraordinary tale of a young woman's love and devotion to her husband, recently paralyzed in an oil rig accident.",
    "critic_reviews": [
        "True art is a journey to somewhere you've never been, and there has never been a movie quite like Breaking the Waves.",
        "There are few movies around that take such huge risks: this is high-wire filmmaking, without a net of irony.",
        "One of the most haunting and vital movies of the year.",
        "Not many movies like this get made, because not many filmmakers are so bold, angry and defiant.",
        "This is a dark, often funny walk through Ingmar Bergman turf.",
        "Philosophically complex, spiritual but anti-religious, harrowing yet hopeful.",
        "The simplified, handheld camerawork and the idea of “cutting for emotion” rather than continuity gets the most out of his actors, who are free to clash and improvise within a scene without worrying about hitting their marks.",
        "\"Waves\" is a spellbinder.",
        "A narrative path leading from the sincere to the ludicrous, and culminating in a final image of flabbergasting transcendance, gives Breaking the Waves its surprising power.",
        "What Von Trier arrives at is a complex, contemporary, and deeply moving exploration of faith.",
        "One of the most emotionally devastating movies of the decade.",
        "Watson is a major find as Bess.  Graced with delicate, expressive features, she gives an extraordinary performance.",
        "With this artlessly profound and affecting story of love, von Trier emerges as one of those blessed filmmakers  who've managed to blend their early stylistic flamboyance with enough human empathy to make their work both visually and emotionally compelling.",
        "If not for a somewhat forced catharsis during the epilogue (the weakest segment of the movie), Breaking the Waves would have been more wrenching than it is.",
        "In its pagan fervor, this is an almost religious experience.",
        "A trying, contrary mix of religion and carnality that teeters on the verge of preposterous self-indulgence.",
        "You won't come out of it indifferent, and even if it winds up enraging you (I could have done without most of the ending myself), it nonetheless commands attention.",
        "Audiences are likely to embrace Breaking the Waves as something rare and fierce and innovative, a passport into the depths of passion, but some people will reconsider when they get home.",
        "Although it contains many visually compelling passages and some provocative moments, the movie is strangely banal and simplistic.",
        "As frustrating as it is rewarding.",
        "Shallow where it would be meaningful, demanding leaps of faith it has not earned, this film's marriage of arresting technique to empty thinking is not unique, only frustrating."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "You just can't close your mouth once the movie has finished.",
            "review_date": "2008-09-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This ambitous film goes exactly where it wants to, but the editing is a bit generous, always an indicator that a film may be taking itself too seriously. Some of the enabling characters take on stereotypical tones, and the entire plot hangs This ambitous film goes exactly where it wants to, but the editing is a bit generous, always an indicator that a film may be taking itself too seriously. Some of the enabling characters take on stereotypical tones, and the entire plot hangs tenuously on a damning indictment of freighter captains. The shift at the end from actuality to religious allegory is a bit of a push. An obviously flawed movie, but remaining brilliantly undiminished because of its realistic portrayal of community chaos from too much order imposed by and upon the dysfunctional. The film is startling in its splendid acting, eclectic musical interludes, surreal cinematography, and powerful character development. Definitely not a film for all tastes, but dead on for those who have found life to work that way.",
            "review_date": "2005-10-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Unforgettable masterpiece with a masterclass perfomance by Emily Watson as Bess McNeill.",
            "review_date": "2006-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Despite Emily Watson's masterful acting, here's a pretentious and not a ambitious film.",
            "review_date": "2018-10-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadly boring. Give me back my 150 minutes. Total waste of time. I will never understand why people are so fascinated by these artsy craps. My eyes still hurt because of the pixeling..",
            "review_date": "2015-08-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Emotionally, the film is devastating, and it is certainly not a cheery movie. The performances are rich and deep, Emily Watson is amazing. I was a bit disappointed in the ending however, but it is a very well crafted film.",
            "review_date": "2009-08-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "at first, the movie is strange, and it stays that way till the end. but as simple as it seems, the mindset behind it and what von trier sees in people, makes you more human and gets you thinking and maybe crying at the same time. prepare forat first, the movie is strange, and it stays that way till the end. but as simple as it seems, the mindset behind it and what von trier sees in people, makes you more human and gets you thinking and maybe crying at the same time. prepare for a non-traditional romantic drama to watch.",
            "review_date": "2019-11-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "First film of the \"good heart trilogy\" by Von Trier. A great Emily Watson flanked by Stellan Skarsgård in this drama full of sentiment and clichés that never result to be neither disappointing or out of place. A heart-breaking drama thatFirst film of the \"good heart trilogy\" by Von Trier. A great Emily Watson flanked by Stellan Skarsgård in this drama full of sentiment and clichés that never result to be neither disappointing or out of place. A heart-breaking drama that contrasts goodness and wickedness in the contrast between two human beings: a selfish man and a good-heart woman in love with her husband willing to do anything for him, even to die.",
            "review_date": "2021-11-03",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 29
}