{
  "title": "Ghost in the Shell",
  "rating": 8.5,
  "release_date": "1996-03-29",
  "genre": [
    "Action",
    "Sci-Fi",
    "Mystery",
    "Thriller",
    "Animation"
  ],
  "summary": "In the year 2029, cybernetic government agent, Major Motoko Kusanagi and the Internal Bureau of Investigations are hot on the trail of “The Puppet Master”—a mysterious and threatening computer virus is capable of infiltrating human hosts. Working closely with her fellow agents from Section 9, the Major embarks on a high-tech race againstIn the year 2029, cybernetic government agent, Major Motoko Kusanagi and the Internal Bureau of Investigations are hot on the trail of “The Puppet Master”—a mysterious and threatening computer virus is capable of infiltrating human hosts. Working closely with her fellow agents from Section 9, the Major embarks on a high-tech race against time to capture the omnipresent entity.… Expand",
  "critic_reviews": [
    "There are gripping chases and balletic combat scenes, painstakingly realised by Oshii’s animators, but the mood is mostly cold and melancholic, as Kusanagi broods over the fleshly implications of living in a world of data",
    "Technically, Ghost in the Shell is astonishing, not only for its smooth meld of cell animation and state-of-the-art computer animation, but also for its imaginative storytelling and mood-setting (thanks to an eerie, non-thumping score by Kenji Kawai).",
    "For a movie that’s so photo-realistic in its backgrounds and detailed in its character design, Ghost In The Shell is just as effective when it goes minimal, suggesting presence through absence.",
    "The plot is impossibly dense and the characters – perhaps appropriately – feel like little more than cyphers, but for sheer mind-expanding sci-fi strangeness this is hard to beat.",
    "It is a dizzying, headspinning film, replete with violence, alienation and tech-porn. I confess I find it too opaque to make the kind of investment that would qualify me as a real fan. But it should be seen.",
    "Most alluring are the crumbling neon cityscapes, real world/cyberspace fusion and the musings on identity.",
    "From its baddie-eviscerating opening sequence through innumerable car chases, shoot outs and tongue-in-cheek dialogue exchanges, this is exactly the kind of film that James Cameron would make if they ever let him through the Disney front gates.",
    "The ghost of anime can be seen here trying to dive into the shell of the movie mainstream. But this particular film is too complex and murky to reach a large audience, I suspect; it's not until the second hour that the story begins to reveal its meaning. But I enjoyed its visuals, its evocative soundtrack (including a suite for percussion and heavy breathing), and its ideas.",
    "Mamoru Oshii's direction deftly merges gritty realism with a dreamlike quality. The only problem is that the characters reel off their existential speeches with such harried deadpan that it's hard to tell whether the angst is serious or tongue-in-cheek.",
    "Oshii is able to knit together action sequences with extraordinary power and conviction.... Ghost in the Shell is absolutely terrific.",
    "Less spectacular but more effectively atmospheric than Akira, Ghost in the Shell should gratify anime buffs and may well hook the uninitiated.",
    "Ghost in the Shell is a slick but plodding recycling of tired cyberpunk clichés that adds nothing new to the genre."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Прекрасное визуальное повествование, описывающие то будущее, которое вполне может ждать нас уже завтра, и задающие важные вопросы, не только для \"завтра\", но уже и для сегодняшнего дня. Меньше говорить, больше показывать, вот характер всейПрекрасное визуальное повествование, описывающие то будущее, которое вполне может ждать нас уже завтра, и задающие важные вопросы, не только для \"завтра\", но уже и для сегодняшнего дня. Меньше говорить, больше показывать, вот характер всей картины, и показывает она то, что сказать невозможно!",
      "review_date": "2017-04-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a brilliant piece of art where everything comes together superbly.  A strong philosophical story, great artwork, blended exquisitely with beautiful mood setting music, all deftly directed.  This is a must view movie.",
      "review_date": "2017-03-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ghost in the Shell is a beautiful, unique, atmospheric animated film. But why is it just now showing up on metacritic? Is it because the ratings for the live action version is tanking? It seems dishonest to add the highly regarded original toGhost in the Shell is a beautiful, unique, atmospheric animated film. But why is it just now showing up on metacritic? Is it because the ratings for the live action version is tanking? It seems dishonest to add the highly regarded original to the front page and potentially misleading people from how terrible the remake is.",
      "review_date": "2017-04-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Une adaptation fidèle à l'histoire du célèbre manga de Masamune Shirow mais qui propose sa propre interprétation, sa propre vision de son personnage principal : ainsi, on est passé d'une cyborg aux cheveux violets et aux yeux rouges à uneUne adaptation fidèle à l'histoire du célèbre manga de Masamune Shirow mais qui propose sa propre interprétation, sa propre vision de son personnage principal : ainsi, on est passé d'une cyborg aux cheveux violets et aux yeux rouges à une cyborg brune aux yeux bleus... ça peut paraître trivial mais ça en dit long sur la réprésentation de l'héroïne par le réalisateur Mamoru Oshii.Le reste est à l'avenant avec une Kusanagi qui reste Kusanagi bien sûr, mais dont la personnalité est sensiblement différente. Elle se pose ici bien des questions et n'est jamais à l'abri du doute à propos de sa condition, ce qui la rend beaucoup plus \"humaine\" que dans le manga ou dans les séries Stand Alone Complex, en raison même de son interrogation ontologique.Oshii imprime également son style sur cette adaptation souvent introspective ; il multiplie les plans contemplatifs sur la musique splendide de Kenji Kawaï sans mettre de côté l'action pour autant quand il le faut... et lorsqu'on compare la somme des dialogues, bien qu'assez nombreux ici, à ceux des Stand Alone Complex et dérivés, on s'étonne de leur sobriété et de leur clarté dans le film !Le film est certes court mais d'une belle densité et l'intrigue est bien déroulée, finalement davantage existentielle que politique, centrée entièrement sur notre super donzelle cybernétique.Bref,on est ici dans une approche plus émotionnelle, plus proche des considérations d'un \"ghost\" et de ce qui fait un \"ghost\" (une âme...) ou non. Voilà qui est fascinant et en même temps la grande force de ce GITS qui n'a pas pris une ride.Pour son âge, l'animation est très correcte voire même supérieure à ce qu'on pouvait voir à l'époque ; le film est resté assez joli également avec cette ville qui fait penser immanquablement à Hongkong.Comme jadis, seul un détail me chiffonne toujours, à savoir le comportement du Major au dessus du tank... c'était bien plus cohérent dans le manga. Mais ça reste un \"détail\" qui ne doit pas faire oublier les immenses qualités de ce chef-d'oeuvre cyberpunk très personnel.",
      "review_date": "2017-05-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you're about to watch one anime in your whole life, let it be this one. Fascinating, mature story about exploring the borders of humanity and challenging the way we look at life and self-conciousness.",
      "review_date": "2017-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Revolutionary for it’s combination of traditional cel-animation and CGI graphics (Ex. The opening green radar screen was homaged in The Matrix), Mamoru Oshii’s 1995 cyberpunk masterpiece concerns a public security agency known as Section 9Revolutionary for it’s combination of traditional cel-animation and CGI graphics (Ex. The opening green radar screen was homaged in The Matrix), Mamoru Oshii’s 1995 cyberpunk masterpiece concerns a public security agency known as Section 9 who are on the hunt for a mysterious hacker known as The Puppet Master. With the assistance of her team, Motoko Kusanagi tracks and finds the suspect only to get drawn into a complex web of political intrigue and cover-ups.Much like Blade Runner, GITS has an over-arching philosophical theme throughout it’s narrative concerning self-identify. In BR case it’s the question of what does the word “human” mean in a world were the difference between human and robot has all but disappeared.In the case of GITS, this question is taken deeper with the character of Motoko because she is a cyborg, so everything about her is artificial except her brain. If every part of your body can be replaced, then what room is there for a soul (aka. a ghost), hence the title?It is also scary given how this movie covers the issues of hackers and corporate blackmail, which have become all too real in this day and age.Part action-thriller, part sci-fi, and part art film; GITS is a movie that seems to only get better and better as I get older. Even though the movie has some great action scenes (Ex. Invisible Motoko vs. a henchman) and thought-provoking dialogue, my personal favorite parts are whenever the film slows down to silently showcase the cityscape.The futuristic Tokyo presented in GITS differs from Akira in which it is not nearly as flashy and chaotic, but instead has a sense of surreal foreboding and alienation. Everything seems to look fine, but it all seems empty and the eerie artful score by Kenji Kawai is the icing on the cake.It can be argued that this movie is just as influential as Blade Runner given it’s impact on modern-day science fiction (Ex. The Matrix, Avatar, A.I. Artificial Intelligence). It may come off as cold for some, but the deep philosophical subject manner and artful execution are what elevate this film to being one of my personal favorite films.And if you like this movie, then check out the underrated sequel, Ghost in the Shell: Innocence.",
      "review_date": "2018-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "To me this film is beautiful. It has a sense of calmness and serenity to it that I just adore, and the score adds to this.",
      "review_date": "2018-11-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Прекрасное произведение искусства, которое поднимает важные для нашего времени вопросы. Каждый аспект картины выполнен на твёрдую десятку. Даже если вы не любите аниме, вы всё равно обязаны посмотреть этот шедевр!Прекрасное произведение искусства, которое поднимает важные для нашего времени вопросы. Каждый аспект картины выполнен на твёрдую десятку. Даже если вы не любите аниме, вы всё равно обязаны посмотреть этот шедевр!",
      "review_date": "2017-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The animated film \"Ghost in the Shell\" was a very good movie, with a different story, with a very balanced rhythm and well-done action scenes, the characters were great and the story has conquered many manga fans And anime fans.",
      "review_date": "2017-04-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I very much enjoy and appreciate anime, and Ghost in the Shell is no exception. In fact Ghost in the Shell is not just one of the finest anime films not to have Studio Ghibli's name on it, but also ever. The animation is breathtaking toI very much enjoy and appreciate anime, and Ghost in the Shell is no exception. In fact Ghost in the Shell is not just one of the finest anime films not to have Studio Ghibli's name on it, but also ever. The animation is breathtaking to watch, ethereal, fluid and very detailed. The score is one of all-time favourites, I love music(especially film music, classical and opera) and from the enchanting melodies and vocals Ghost in the Shell is no exception, really drawing you in. The script is one that really makes you think, it's a very ambitious and thoughtful one with its scientific and philosophical elements. The story is unique and compelling right from the start to the end, the characters engage and the voice work(more in the subbed rather than dubbed version) is very dynamic. I can understand why some may be underwhelmed by the ending, first time I saw Ghost in the Shell I was, but now I don't have a problem with it, and even if I did it would not stop me from loving this film any less than I do. Overall, amazing, one of the best of its kind. 10/10 Bethany Cox",
      "review_date": "2022-03-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of ultimate master pieces of manga-anime. With a tangled but astonishing, absorbing story, established a before and after in sci-fi genre. The style of animation is what gives the most merit. Better off than life-action version.",
      "review_date": "2017-06-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I do not give 10s lightly. Or at all, really. But Ghost in the Shell (1995) I feel deserves this in lieu of the influence and standards this movie inspired.Prime example, The Matrix. The Wachowski Brothers cited GitS as a direct inspirationI do not give 10s lightly. Or at all, really. But Ghost in the Shell (1995) I feel deserves this in lieu of the influence and standards this movie inspired.Prime example, The Matrix. The Wachowski Brothers cited GitS as a direct inspiration in their credits; That's pretty damn impressive by itself. But it's more than capable of standing on its own with its beautiful, fluid animation, deeply philosophical and somber tone and thought-provoking theme.Plot-wise, I don't find it that powerful. The story is a little hard to grasp and isn't something masterfully planned. But this film is so much more as a visual experience than a narrative one; The characters and antagonists are there, but it's just enough to immerse you in this unique, unusual and perhaps not so far off future.",
      "review_date": "2018-09-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This along with Ninja Scroll lead the way for anime invasion in the 90s, it still looks new and sexy and entertaining today.",
      "review_date": "2020-01-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "1995 yapımı olan Ghost in the Shell, güzel konulara değinerek, gelecekte neler olacağıyla ilgili bir şeyler hissettirme uğraşında. Kişiliklerini ve yaşamlarını kaybetmiş, kişiler arasında benliğini bulmak isteyen bir karakterin hikayesi,1995 yapımı olan Ghost in the Shell, güzel konulara değinerek, gelecekte neler olacağıyla ilgili bir şeyler hissettirme uğraşında. Kişiliklerini ve yaşamlarını kaybetmiş, kişiler arasında benliğini bulmak isteyen bir karakterin hikayesi, güzel olmuş. Fakat filmin kısa süresi ve Japonca yüzünden, pek anlaşılamayan altyazısı ile birlikte, konu havada kalmış gibi duruyor. Dizi olarak olsa ve ağırdan alıp konuyu tamamlasalar cidden daha güzel olabilirmiş. 80 dakikalık sürede, nereden giriş yapıp, nerede bitireceklerini bilememişler. Bu yüzden kısa süresi, güzel bir hikaye anlatımını düşürerek, paldır kültür gidilmesini sağlamış. Bunların yanında müzik olarak da, güzel yerlerde kullanılmış ve hikaye yapısına uygun seçilmiş. 2017 yılında, çekilecek film öncesi, bilgi sahibi olmak adına izlemiştim fakat fazla da bir şey anladığımı söylemeyeceğim. Yine de izlemekten zarar gelmez, güzel filmdi.",
      "review_date": "2017-04-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Oshii draws a line on the humanitarian subject and the visuals keeps breaking the boundary, what a pleasure to watch them chase each other.Ghost In The Shell\n\nOshii is painting like a kid. Highly innocent and equally honest. The director,Oshii draws a line on the humanitarian subject and the visuals keeps breaking the boundary, what a pleasure to watch them chase each other.Ghost In The ShellOshii is painting like a kid. Highly innocent and equally honest. The director, Mamoru Oshii, has a precise vision about this world. In fact, the script itself might not have enough to say. Drawing plenty of the tracks from the comic book itself, the script follows a textbook structure, plot wise. Something that we have seen earlier too in a similar sci-fi futuristic world that breathes artificial intelligence and other highly configured robotic terms. And just like them, to be human, to feel and to be.. them, is what's grabbed from the first frame of the film. Reproduction takes a whole new explanation and so is death in a mythological prospect.But, what draws your attention is the layout of the film. Like some profound painting, the film is colored sensitively and staged colorfully that expresses intensively about the characters. The cinematography deserves a shout out, then so does the animation, yes, it does not hold up with time, yet, there is something soothing to every now and then, visit those perfect-imperfect world of 90s animation. It still cheers me up to see the hair in these format of the films float like they are underwater.Fortunately, the drama is embraced more, than the action is well choreographed. Even though, the stakes of the situations where our lead character often jumps in on, is low, it was smart of them to pull off an unstoppable aspect- time- for their final act. Again, I don't and didn't travel to this world for its gritty action stunts but the drama and just like the Blade Runner world, it not only doesn't thrive on it, but also is never provoked to punch its way out of the trouble, the deep down alter ego of ourselves, that Ghost In The Shell, that we all fear, is asked to face upon.",
      "review_date": "2019-05-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a brilliant work of art. I do not throw 10´s around easily.I bought it on VHS in 1996 (i think) with english voiceover, but i must since then have seen it so many times i could recite it by heart.It has a stunning atmosphere andThis is a brilliant work of art. I do not throw 10´s around easily.I bought it on VHS in 1996 (i think) with english voiceover, but i must since then have seen it so many times i could recite it by heart.It has a stunning atmosphere and visuals. Much of it partly inspired by Bladerunner at times (though never documented)The soundtrack is a huge key factor to set the movie to the timeless era of the 90s in a cluster of great anime´s.Masterpiece and essential..My only gripe is it is too short. But",
      "review_date": "2022-10-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "'Ghost in the Shell' has the incredible ability to question our relationship to technology and the future. We follow a cyborg-cop woman who asks herserlf about her humanity and her place in the contemporary society. The scenario is'Ghost in the Shell' has the incredible ability to question our relationship to technology and the future. We follow a cyborg-cop woman who asks herserlf about her humanity and her place in the contemporary society. The scenario is interesting and transcending, even if I found hard to get into it when you don't know the 'Ghost in the Shell' universe.The pace of the movie is just excellent: it varies between extremely beautiful and detailed environments and characters to intense action scenes. All the contemplative scenes are accompagnied by amazing architectures and soundtrack. The movie has this refined and complex style which is really pleasant to observe. Everything look so intense thanks to the ability of the producers to smartly use silences and music. Animation is surprisingly good for that time (1996).",
      "review_date": "2020-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Check out my latest podcast with Benjamin Hinz where we discuss an excellent double feature of animation by the great Mamoru Oshii: http://bit.ly/2Wwkjsu",
      "review_date": "2020-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While it can often feel rushed or too dependent on hard to follow exposition due to its unfairly short runtime, Ghost in the Shell is a movie that rises above almost all of its problems thanks to the sheer scope of its ambitious themes andWhile it can often feel rushed or too dependent on hard to follow exposition due to its unfairly short runtime, Ghost in the Shell is a movie that rises above almost all of its problems thanks to the sheer scope of its ambitious themes and ideas, gorgeous animation and fantastic world building.It definitely requires repeated viewings. I'm pretty sure that by the last time I saw it years ago I had finally gotten it, but rewatching it now I was lost again. But that's great, because now I get to re-rewatch it, which is always a treat.There's a sequence towards the middle of the films that ranks amongst my favorites not just in animation, but in cinema as a whole. It's a three minute long sequence of almost nothing but shots of the city, and it (accompanied by the incredible soundtrack) creates an almost transcendent atmosphere that perfectly encapsulates the grace and beauty that lies beneath the surface of this film.That beauty is what keeps me coming back to it, even when I have trouble keeping up with it.",
      "review_date": "2020-09-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Niesamowity film z ważnym tematem transhumanizmu. Tytuł mówi sam za siebie. Po prostu must watch",
      "review_date": "2021-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "You can't beat a ghost,That battles with his shell (1995) every day.-Confucius",
      "review_date": "2021-06-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An incredible movie with a gripping story of sentience and struggle in the far future with plot and sabotage between government departments slowly revelling who the real villain actually is. Combined with consistently stunning and spectacularAn incredible movie with a gripping story of sentience and struggle in the far future with plot and sabotage between government departments slowly revelling who the real villain actually is. Combined with consistently stunning and spectacular animation and design in all aspects this movie deserves a place on everybody's top 10 in the genre.",
      "review_date": "2021-10-29",
      "source": "metacritic"
    }
  ],
  "num_reviews": 34
}