{
    "title": "Secrets & Lies",
    "rating": 8.2,
    "release_date": "1996-09-27",
    "genre": [
        "Drama",
        "Comedy"
    ],
    "summary": "A middle-aged London factory worker is shocked when the mixed-race daughter she gave up at birth decides to track her down. At first she denies she is her mother. All family members become emotional, as everyone's secrets are exposed.",
    "critic_reviews": [
        "A masterful mix of wit and humor, sympathy and sadness.",
        "A magnificent melodrama that draws both tears and laughter from the everyday give-and-take of seemingly ordinary souls.",
        "Represents the director at his best -- unsentimental yet powerful, funny and poignant, and, in the end, undeniably satisfying.",
        "Reveals itself detail by searing detail.",
        "Blethyn is so astonishing that you forget you're seeing a performance.",
        "If film means anything to you, if emotional truth is a quality you care about, this is an event that ought not be missed.",
        "It moves us on a human level, it keeps us guessing during scenes as unpredictable as life, and it shows us how ordinary people have a chance of somehow coping with their problems, which are rather ordinary, too.",
        "Leigh goes right to the core of his character's lives and mines the place where we're weakest, most alone and sometimes the cruelest.",
        "There's not a weak performance in Secrets And Lies, a fact made more notable by the seeming ease with which the cast performs as an ensemble.",
        "The ride is remarkable.",
        "The acting is so strong--with Spall a particular standout--that you're carried along as by a tidal wave.",
        "The results are wondrous, wrenching and crazily funny to behold.",
        "Rich in humor, pained or frolicking.",
        "A radiant, heartbreaking film.",
        "Leigh has a gift for demonstrating character from the outside in.",
        "Secrets & Lies is all about wounds and our tendency to embrace placebos rather than the harder courses of treatment.",
        "A crowd-pleaser, all right, but, for all its appeal, a naggingly sanctimonious one.",
        "Crammed, cheek to jowl, with bleak moments, high hopes, sweetness and naked emotion.",
        "Leigh at his best is a renderer of moments--the wisest and deepest observer, probably, among living directors.",
        "Secrets & Lies, despite my dwelling on its problems, is a really solid and enjoyable movie. It's just not what I would call \"best of the fest.\"",
        "Unquestionably a finely observed, deeply felt work, though with some nagging problems in pacing and structure."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Phenomenal film! Brilliant screenplay, direction, and acting.",
            "review_date": "2006-12-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I can point out ten moments easily where the film hands over all the responsibilities to the actors, it's a breathtaking performance.Secrets And Lies\n\nLeigh is a family man. He understands the banal relations or relatives we've all got. AndI can point out ten moments easily where the film hands over all the responsibilities to the actors, it's a breathtaking performance.Secrets And LiesLeigh is a family man. He understands the banal relations or relatives we've all got. And he, the writer and director, Mike Leigh knows how to play a friendly chess with them. The primary reason I find his drama confident enough to run on only one piece of information is because he doesn't feel the need to give reasons for their behaviour. They are and will always be simpleton for that very note. Call it kryptonite or sensitivity, the hands starts to shake, voice breaks and, emotions on the surface. Leigh walks on his signature structure in script, i.e. to gather all the energy and motifs of characters and meet at a rendezvous point in its last act where he frames the entire burden of the film in the screen.And that scene in here, is a dinner table conversation. The camera is set and ready and, the character definitely not. The scene leaves you with chills in your spine and exhilaration is defined all over again. I don't think I have ever been so exhausted after the voice turns silence in the film; for a brief period, you get to have a similar experience after Tom Cruise ends his mission in Christopher McQuarrie's Fallout. Also, whenever something beautiful, simply beautiful comes by, that leaves me happy and satisfied.It always reminds me of Sam Mendes's American Beauty where the character is capturing varied snippets of nature. And I never thought it could be topped off by something so natural and warm. And then comes this montage of people getting their picture taken. Leigh, I think says a lot with those than he could ever with the film. This is exceptional filmmaking even for Mike Leigh, it is a whole new level. He is so rigid and strong on his views that as a viewer you are told to bend your opinions and Secrets And Lies.",
            "review_date": "2019-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Woman decides to trace her real mother after the death of her adoptive mother.Usual Mike Leigh affair with all the grit, tension & emotion you'd expect. Pretty well acted but thought it went a bit annoying towards the end. Thought theWoman decides to trace her real mother after the death of her adoptive mother.Usual Mike Leigh affair with all the grit, tension & emotion you'd expect. Pretty well acted but thought it went a bit annoying towards the end. Thought the musical score was a bit lame too & didn't really fit.",
            "review_date": "2010-08-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "awesome but predictable from the beginning if it is the wife... a true twist would it being the friend... the wife was fishy from the beginning , why is she pointing the murder weapon out to the cops and why is she always letting conelle inawesome but predictable from the beginning if it is the wife... a true twist would it being the friend... the wife was fishy from the beginning , why is she pointing the murder weapon out to the cops and why is she always letting conelle in when the husband is the suspect...hmmm cuz she did it and she wants all evidence found before the truth comes out that, that was the night she found out he cheated on her with the mother of the murdered child...",
            "review_date": "2015-04-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Best Movie I have ever seen, PERIOD! Unbelivable acting, great story, deeply moving. If you care about people more than special effects see this movie.",
            "review_date": "2005-10-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's a struggle to follow this movie in the early going as it tracks two sets of characters who do not initially interact. Finally what is going on reveals itself. From then on, one is witness to an important story exceptionally well It's a struggle to follow this movie in the early going as it tracks two sets of characters who do not initially interact. Finally what is going on reveals itself. From then on, one is witness to an important story exceptionally well told. Upon reflection the accomplishment of this film is exemplary. The last line of spoken dialogue, filled with peace, is as perfect a masterpiece of closure as any ever committed to film. A must see for those who differentiate the best from the rest. Despite the difficult setup I cannot recommend it highly enough.",
            "review_date": "2007-06-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Secrets & Lies is my favorite film from a terrific director in Mike Leigh. It's about intricate and rocky relationships evolving around a family, and at it's heart a woman finding her real mother becoming introduced into this family. It's notSecrets & Lies is my favorite film from a terrific director in Mike Leigh. It's about intricate and rocky relationships evolving around a family, and at it's heart a woman finding her real mother becoming introduced into this family. It's not just another \"searching for birth parent\" film, but one of real emotion and complexity. It has a host of terrific performances especially, from the great Brenda Blethyn as the mother struggling in her relations with one daughter, while coming to terms with another she never knew. This is one of my favorite films from the 1990's; just terrific!",
            "review_date": "2014-10-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The gearing up at the beginning of the film is slow while the cello and gray skies don't help much to break up the denseness.  Secrets and Lies becomes more engrossing as it goes along.  Terrific acting all the way really helps the vision.The gearing up at the beginning of the film is slow while the cello and gray skies don't help much to break up the denseness.  Secrets and Lies becomes more engrossing as it goes along.  Terrific acting all the way really helps the vision.  Reminds me a lot of \"In the Bedroom\" in that the sullen mood rarely lets go even when characters are smiling or laughing.  Over all a quality film.",
            "review_date": "2012-03-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mike Leigh reveals to us how secrets and lies can cause upset, pain, and regret in what has to be one of the best British films of all time. With spot-on dialogue and glorious performances it is hard to find fault with Leigh's masterpiece.Mike Leigh reveals to us how secrets and lies can cause upset, pain, and regret in what has to be one of the best British films of all time. With spot-on dialogue and glorious performances it is hard to find fault with Leigh's masterpiece. Just when we thought Cynthia would live out the rest of her days as a worker in a banal factory, with her confrontational daughter Roxanne, she is thrown a life line in the form of Hortense, and we see their relationship flourish. Timothy Spall is also on top form as the glue that holds the family together.",
            "review_date": "2010-12-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am a huge Mike Leigh fan and this is his crowning glory.  I still remember the first time I saw it at the movies.  I had the tears streaming down my face in several parts.  The acting is incredible.  The story really interesting.  It's an II am a huge Mike Leigh fan and this is his crowning glory.  I still remember the first time I saw it at the movies.  I had the tears streaming down my face in several parts.  The acting is incredible.  The story really interesting.  It's an I can't miss kind of film.  I am baffled that anyone would give it a negative review unless of course the only type of film they like is violent or action adventure.  This film is neither that's for sure.",
            "review_date": "2013-10-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Secrets & Lies will reveal the truth and get rid of the lies. By how exactly? That's where watching it will give you a clue. I mean, who would rather prefer speaking the truth? I do.",
            "review_date": "2016-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mike Leigh makes films about common folk. Consequently, they're horribly dreary and depressing, burdening the soul with a cumbrousness that only death can discharge. But pretty good otherwise.",
            "review_date": "2018-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Rarely does a movie bring tears to my eyes, this time it did. It's one of the best movies I've ever seen. Humans are complex and act in accordance with many, even contradictory values. The needs they produce may vary, but any attempt toRarely does a movie bring tears to my eyes, this time it did. It's one of the best movies I've ever seen. Humans are complex and act in accordance with many, even contradictory values. The needs they produce may vary, but any attempt to structure them is left wanting. The normally-functioning person, then, is able to access all the states at different times, and, over time, obtain all the different satisfactions that are available in these various states.",
            "review_date": "2022-12-12",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 34
}