{
  "title": "Sling Blade",
  "rating": 8.3,
  "release_date": "1996-11-27",
  "summary": "A southern gothic tale about a man named Karl (Thornton), who's just been released from an asylum -- some 25 years after he committed a gruesome crime.  He returns to the southern town of his youth, where his quiet, gentle manner and simple charm land him a job and lead him to an unlikely friendship with a young boy (Black) and his widowedA southern gothic tale about a man named Karl (Thornton), who's just been released from an asylum -- some 25 years after he committed a gruesome crime.  He returns to the southern town of his youth, where his quiet, gentle manner and simple charm land him a job and lead him to an unlikely friendship with a young boy (Black) and his widowed mother. When the mother's abusive boyfriend appears, however, this simple man is thrust into a combustible dilemma that has powerful, moving consequences for all.   (Miramax Films)… Expand",
  "critic_reviews": [
    "A story that's startling, soulful and absolutely unforgettable.",
    "Like the eloquent, darkly funny dialogue, the film's characters, setting and cadences draw us into its world, with all its terrors and tenderness. What emerges is a masterpiece of Southern storytelling that draws a sharp line between good and evil.",
    "Perhaps the most remarkable thing here is Thornton's nuanced performance, but the film has other rare virtues: all the characters are fully and richly fleshed out (with some unexpected turns by John Ritter and singer Dwight Yoakam), and the story's construction is carefully measured.",
    "Catches you up so firmly in its world that you find yourself accepting whatever Thornton presents right up to its deeply ironic finish.",
    "Takes you down paths full of primitive, almost biblical implications, but it also finds comic relief in moments of palpable tension.",
    "Sling Blade is perhaps the year's most impressive debut because it is an uncompromisingly told tale with a minimum of frills.",
    "Thornton, who wrote, directed, and stars in Sling Blade, has created an unforgettable character and situation, a film that's sure to become an American classic.",
    "There is pain, humor, irony and sweetness in the character, and a voice and manner so distinctive, he is the most memorable movie character I've seen in a long time.",
    "Resonates like the best of Southern fiction.",
    "What evolves among them is a kind of realistic fairy tale, sustained by the sweet gravity and guttural, deadpan minimalism of Thornton's performance.",
    "Marked by some powerful scenes, fine performances and colorful dialogue, this talented directorial debut by actor-writer Billy Bob Thornton has its effectiveness diluted by serious overlength and a rather monotonous, unmodulated tone.",
    "A remarkably moving and disturbing film about the possibility of belonging and the genealogy of violence.",
    "Builds slowly but passionately, not dancing to some Hollywood tune, but finding its characters where they are and letting them be who they are.",
    "Billy Bob Thornton wrote, directed and stars in this compassionate, occasionally funny, character-driven movie about a mentally unstable man who takes the best interests of children very seriously.",
    "The narrative is little more than a flimsy envelope -- it's the men and women who are sealed within that make Sling Blade worth watching.",
    "It's Thornton's rough and nuanced performance as Karl, not his modest filmmaking skills, that sucks you so quickly into Sling Blade's vortex.",
    "The atmosphere is Southern Gothic pure enough to do Carson McCullers proud -- grotesque, sentimental and dankly nasty -- and Thornton manages not to undermine his own writing.",
    "I can't help thinking, though, that maybe Thornton was too ambitious in trying to wear three hats.",
    "Thornton is sadly affecting in the film's central role."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "As a mental health professional, Billy Bob's portrayal was excellent and moving. This story is all too common and realistic about people in psychiatric hospitals, from Karl's character to the sadistic rapist in the hospital to As a mental health professional, Billy Bob's portrayal was excellent and moving. This story is all too common and realistic about people in psychiatric hospitals, from Karl's character to the sadistic rapist in the hospital to Doyle's drunken abusiveness. Excellent portrayal of too common a life for many.",
      "review_date": "2006-12-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A masterful script. Outstanding acting  Thorton is spellbinding in the lead role. His opening scene is without doubt the best I've seen.This is storytelling at its finest and directed with confidence, conviction and ease. Light and shade,A masterful script. Outstanding acting  Thorton is spellbinding in the lead role. His opening scene is without doubt the best I've seen.This is storytelling at its finest and directed with confidence, conviction and ease. Light and shade, humour and a fierce undercurrent of tension. To every film fan  watch it now!",
      "review_date": "2013-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The acting of Billy Bob Thornton was of such a high standard that my only impression was (in the dark room with the journalist)   was that Billy Bob was born to act, no other gift was better expressed. The movie had me in tears, it was aThe acting of Billy Bob Thornton was of such a high standard that my only impression was (in the dark room with the journalist)   was that Billy Bob was born to act, no other gift was better expressed. The movie had me in tears, it was a subtle performance, it is a sophisticated performance it is a human tale of suffering and just being despite how the world tries to label",
      "review_date": "2015-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing performances, great story. Billy Bob is a freak of the highest proportions :)",
      "review_date": "2005-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a story that while calmly told has you on the edge of your seat because you know it's going to have blast of an ending. Well written, great acting. It is so true to life it seems to be based on a true story. Billy Bob and the This is a story that while calmly told has you on the edge of your seat because you know it's going to have blast of an ending. Well written, great acting. It is so true to life it seems to be based on a true story. Billy Bob and the little boy's acting were amazing.",
      "review_date": "2006-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of the best movies I have ever seen in my life, and I am 51! It stirred every single emotion I have. Everything about it was superb! It baffles me that this movie has not made any TOP lists that I have seen.",
      "review_date": "2007-08-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Awesome and powwerful movie. Billy Bob's portrayal and character is moving and extremely believable.",
      "review_date": "2007-02-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i just seen the movie. Awesome, never thought i would get inot a movie like this. Awesome, i just hate i am just now seeing it.",
      "review_date": "2006-09-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is an unforgettable movie. The story very engaging and powerful. Thortons performance is just amazing, and the movie is just put together really well. I was still thinking about this movie days after watching it.",
      "review_date": "2009-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film manages to be beautiful and dark all at the same time. Although it's very intense in places and really puts you on edge with heightened emotion and great acting, it leaves you feeling warm and with a refreshed love of humanity.This film manages to be beautiful and dark all at the same time. Although it's very intense in places and really puts you on edge with heightened emotion and great acting, it leaves you feeling warm and with a refreshed love of humanity. Thornton's performance is so hauntingly amazing that you hardly even recognise him as Carl. His entire body and persona becomes transformed, more so than any other actor playing any part I've seen. The young Lucas Black gives a phenomenal performance as Frank as well. He's just so natural. I really can't praise this film enough. Thornton is a genius in my eyes and it's perfectly clear how he managed to bag himself Angelina Jolie at one point.",
      "review_date": "2014-04-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I reckon this is a fantastic film. Billy Bob Thornton is impeccable in the lead role here and it is truly a performance that makes me sit there and wonder if I had him all wrong all this time. Maybe he is a great actor. He is also quite theI reckon this is a fantastic film. Billy Bob Thornton is impeccable in the lead role here and it is truly a performance that makes me sit there and wonder if I had him all wrong all this time. Maybe he is a great actor. He is also quite the talent as a director and writer as this one is beautifully scripted and paced to perfection. His performance as the mentally slow Karl stands tall though as the best thing about this film, though the performances of everyone else here are also top-of-the-line. The characters are perfectly put together and their relationships feels entirely authentic. The film also feels incredibly Southern, which gives it a great authenticity on that front. A touching, well made, and at times thrilling film, Sling Blade is predictable at times and if you do not figure out how this one will end, you need to rewind and watch it again because you are not paying close enough attention. Yet, in spite of that, it is still a great film featuring an absolutely impeccable performance from Thornton as he proves his ability as an actor, director, and writer.",
      "review_date": "2015-06-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I had a few little problems with Sling Blade, and I thought there were one or two highly unnecessary scenes and characters. But that is not even close to enough to make me give this a bad review. Billy Bob is movie magic here. His captivatingI had a few little problems with Sling Blade, and I thought there were one or two highly unnecessary scenes and characters. But that is not even close to enough to make me give this a bad review. Billy Bob is movie magic here. His captivating performance of one of the most well-developed characters in movie history is something that I couldn't take my eyes off of. As a kind-spirited, mentally handicapped wanderer with seemingly no emotional response to murdering...Karl is a special feat of film making. I feel like if I said more I would spoil it. So I won't Great movie... although I do feel that it could have been a little more badass.",
      "review_date": "2013-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Featuring (quite possibly) Billy Bob Thornton's best performance in a film, \"Sling Blade\" is a simple, yet emotive drama with as much humor as it has heart.",
      "review_date": "2012-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a good film. At first look on a poster I thought that it was about Vietnam :D Without laugh, I recommended this film for my friends, because it is great work of Billy Bob, now for me he is not only bad Santa",
      "review_date": "2017-06-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It will probably go down in film history as Thorton's magnum opus. He is immediately convincing and captivating as Karl, one of the most complex characters I've ever seen in a film, which is ironic to the utmost extent. The script is simpleIt will probably go down in film history as Thorton's magnum opus. He is immediately convincing and captivating as Karl, one of the most complex characters I've ever seen in a film, which is ironic to the utmost extent. The script is simple but powerful, nevertheless. And the supporting cast, Lucas Black, John Ritter, and a masterful Dwight Yoakam, is absolutely phenomenal. There are a lack of suitable hyperboles to describe simply the talent in Sling Blade, in acting, writing, and directing.",
      "review_date": "2015-01-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Billy Bob Thornton succesfully makes himself a centre of this film : a director, a screenwriter and a leading role, but you will clearly remember one of those, an extraordinary performance. A tagline : \"Sometimes a hero comes from the mostBilly Bob Thornton succesfully makes himself a centre of this film : a director, a screenwriter and a leading role, but you will clearly remember one of those, an extraordinary performance. A tagline : \"Sometimes a hero comes from the most unlikely place.\" may has a different point of view, beautiful and dark come up, but it's nothing to do to this film. This film makes Southern storytelling / drama genre more powerful and stronger.",
      "review_date": "2014-05-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie made me think about different starting points we have. How we break some chains and how do we act in different circumstances. Movie had it's darker elements and it's up-lifters which were directed plausible. Billy Bob Thornton didThis movie made me think about different starting points we have. How we break some chains and how do we act in different circumstances. Movie had it's darker elements and it's up-lifters which were directed plausible. Billy Bob Thornton did a fantastic job. A very good movie.",
      "review_date": "2013-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my all time favorites. Nails pre-2000's life in Southern America perfectly. You'll find most of the main Deep South players: the easy-going down home folks, the outcasts, the violent drunks, and the meek driven to violent acts.One of my all time favorites. Nails pre-2000's life in Southern America perfectly. You'll find most of the main Deep South players: the easy-going down home folks, the outcasts, the violent drunks, and the meek driven to violent acts.Amazing film debut for Billy Bob Thornton. Dwight Yoakam should have won Best Supporting Actor for this; one of the best violent drunk bastards that has ever been in a movie.I recommend the extended version.",
      "review_date": "2020-01-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI love this movie so much!!! At the end I was crying so much. There is not a lot of movies that can take a character that has something wrong with them, make audiences cry, and in the end make you feel so bad for him. Those movies are real jems that needs to be cherished. This movie makes you be thankful for the life you have, because his live was so bad. Every moment is tear jerking whether by happiness or sadness. At the end he knew what he had to did and he sadly did it. Everything he does you know if because of his past and once he finally let’s go of the past he’s back where he was before. In all the story is told in a very natural way and they have very creative way of telling the story which is really smart. In a way the moments are they make you cry like in the pursuit of happyness but without a happy end.",
      "review_date": "2020-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is led by the brilliant Billy Bob Thornton who takes what could of been a simple and predictable story and elevates it to another level.",
      "review_date": "2021-06-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Billy Bob Thornton's debut project is a winning combination of character development, strong acting, and a clockwork plot that manages to not come across as a screenplay cheat.  I must applaud every actor involved as the intimacy scenesBilly Bob Thornton's debut project is a winning combination of character development, strong acting, and a clockwork plot that manages to not come across as a screenplay cheat.  I must applaud every actor involved as the intimacy scenes between their characters emits a brilliant aura of compatibility between their conversations and the audience.",
      "review_date": "2021-08-21",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 42,
  "genres": [
    "Drama"
  ]
}