{
  "title": "The Island of Dr. Moreau",
  "rating": "tbd",
  "release_date": "1996-08-23",
  "genre": [
    "Sci-Fi",
    "Thriller",
    "Horror"
  ],
  "summary": "After being rescued and brought to an island, a man discovers that its inhabitants are experimental animals being turned into strange-looking humans, all of it the work of a visionary doctor.",
  "critic_reviews": [
    "Brando's performance is enormous fun, but it's not just a joke. He's hilarious and gently mesmerizing at once, and director John Frankenheimer savvily adjusts the tone of his movie to fit Brando's daft brilliance...Let's face it -- this is one nutty movie. It's not exactly \"good,\" but I sure had a good time.",
    "He’s become such an obvious parody of himself that Frankenheimer has permitted Kilmer to do a wicked mid-movie impersonation of Brando’s character; it’s funny, but it also gives The Island of Dr. Moreau an extra layer of camp it certainly didn’t need.",
    "Frankenheimer resorts to gunfire and explosions to bring the film to its predictable end. It's when things get mundane that you find yourself wishing that Brando would reappear on the screen to make things interesting again.",
    "Insultingly, Frankenheimer concludes the movie with a short sermon about the fine line that separates man from beast. If the director actually wanted to get this point across, he should have worked it into the film rather than tacking it on as an afterthought. It is, after all, an integral aspect of the source material. That it has been so thoroughly excised from the main plot isn't The Island of Dr. Moreau's only problem, but it's symptomatic of the flawed mindset that went into planning this occasionally incoherent and ultimately disappointing motion picture.",
    "What we deserved was \"The Island of Jeanne Moreau.\" That I'd pay to see.",
    "I was never bored, even if the film ultimately amounts to little more than a very expensive freak show. Just before slurring one of the all-time great terrible last lines (\"I want to go to dog heaven\"), Kilmer utters, with sublime understatement, a line that doubles as the film's epitaph: \"Well, that didn't work out.\" Failure, Fiasco or Secret Success: Fiasco.",
    "As the barbaric Montgomery, who helps bring out the beast in the beast-men, Val Kilmer raids the closet of sinister mannerisms and tries them all on for size. Poor David Thewlis is in another movie entirely.",
    "Sympathizing with Moreau would be difficult in any case. But with Brando in the role, there is the added obstacle of needing to suppress laughter every time he opens his pursed mouth.",
    "John Frankenheimer is credited as director, but given the scrambled, multiple agendas at play here, he seems to function more like a bemused traffic cop.",
    "Mr. Brando's performance will be deemed interestingly audacious only by those who found \"Apocalypse Now\" too sane.",
    "The Island of Dr. Moreau ought to have been a great film in these times of gene splicing and DNA research and all the moral, ethical and practical questions those developments raise. But director John Frankenheimer and screenwriters Richard Stanley and Ron Hutchinson's attempt to update Wells yields only a maddening mess of empty gestures.",
    "As a sci-fi action movie, the latest Moreau is sub-schlock. As a thinly veiled post-colonial allegory, it's dangerously close to racism. Either way, it's one of the most ridiculous movies in a ridiculous summer."
  ],
  "reviews": [],
  "num_reviews": 12
}