{
    "rating": 9.0,
    "release_date": "1945-09-24",
    "num_reviews": 190,
    "genres": [
        "English"
    ],
    "summary": "When Mildred Pierce's (Joan Crawford) wealthy husband leaves her for another woman, Mildred decides to raise her two daughters on her own. Despite Mildred's financial successes in the restaurant business, her oldest daughter, Veda (Ann Blyth), resents her mother for degrading their social status. In the midst of a police investigation after the death of her second husband (Zachary Scott), Mildred must evaluate her own freedom and her complicated relationship with her daughter.",
    "reviews": [
        {
            "content": "Superb! Plot and acting are both phenomenal and the movie itself is legendary! On top of all this, Joan Crawford is one of if not my favorite old movie actress and probably still is one of my favorite actresses of all time! Albeit it has a few slow parts as especially a lot of older movies do. But ultimately will keep you on the edge of your seat from shocking twists and mystery. \"Mildred Pierce\" is an immaculate work of art!",
            "review_date": "2023-04-19",
            "source": "rt"
        },
        {
            "content": "Best Crawford! Such a wonderful film.",
            "review_date": "2022-10-08",
            "source": "rt"
        },
        {
            "content": "Shocking is a great way to describe this movie but for all the wrong reasons. I was expecting a Noir Murder mystery but instead I felt like a Frog who has been thrown in a Blender without a lid. Not only was the character development non existent but the lack of tenderness or humane responses to a tragic death like that of a young child was beyond appalling. Instead the plot changes are so drastic that it feels as if its audience is tossed into a Whirlwind of pointless destinations. One minute a common housewife  finds herself in dire straights without proper education or work experiences only to run not one ;but several restaurant chains. What? Are you serious? \nWe get to witness her spoiled and rotten daughter move from one unrealistic mansion to the next due to her mother's main motives solely  to impress her. Which of course is another mystery in itself that does not hold my interest in solving. What a colossal waste of time and energy it took to get through this perplexing, overdone convoluted mess my words fail to express. My head is still spinning after the conclusion to its ending has been drawn, the credits rolled out and staring at a blank screen equal to this mindless product. This is a movie I hope to erase from my memory hopefully very soon!",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Noir is a curious phenomenon; its exaggerated sense of style and its heightened themes charm us in relation to our willingness to abandon disbelief and accept a degree of transparent artifice. Films such as \"Laura\" and \"Detour\" are highly successful because the viewer cares about the story to the extent needed to become a complicit witness to their playfully farfetched overtones. \"Mildred Pierce,\" on the other hand, attempts haphazardly to craft a deeply human story that requires more plausibility than its contrived plot and flimsy characterizations can actually provide. We watch the film grimacing at the general lethargy of its plot while it routinely takes us through the paces of one mundane development after another in order to reach a preposterously ambitious end destination. In the meantime, an admittedly effective performance by Joan Crawford can't salvage the shallow and unbelievable character dynamics which constitute the heart of the film's intended impact. In the end, we're left with a film to be regarded as a curious misfire; a testament to the ordained failure of any family melodrama that concedes the tenets of effective character development in favor of run-of-the mill plot intrigue.",
            "review_date": "2022-04-13",
            "source": "rt"
        },
        {
            "content": "I think Mildred Pierce is a very put together and acted film. In terms of Noir it's brilliantly thought out by director Michael Curtiz. The non-linear narrative suits the story in the most effective ways. This form of storytelling added more tension as it went along which made it just as more enjoyable.\n\nJoan Crawford brings a career high performance, noticeable by her Best Actress Oscar win that following year for her performance as Mildred. She was truly brilliant. Playing a character that has to show two sides throughout the film. She makes her character meaningful as well as emotional. She strives for the best in life for not just her, but her family too. A brilliant performance. Jack Carson as Wally was a standout performer too. Added likeable humour to a dark film at times.\n\nAlso a very well written film by Ranald McDougall. Its a film shaped by family troubles and high aspirations and the script brought those themes to live, accompanied by top notch acting.\n\nA true noir and film classic.",
            "review_date": "2021-10-07",
            "source": "rt"
        },
        {
            "content": "A sad tale of a successful mother who's life falls apart at the hands of her lover, her work partner, and her own children. A classic whodunnit mystery with familial twists.",
            "review_date": "2021-08-06",
            "source": "rt"
        },
        {
            "content": "Interesting story. Good cast & acting. JOAN even glookn. JOAN CRAWFORD,And EVE ARDEN as her iconic personality. \nStill not sure why Bruce Bennett as the X-husband was brought in as suspect, \n\nFinally saw whole thing on The Movie Cjhannel, May 2021.  \n\nSPOILER ALERT: even tho seems certain that the evil daughter ANN BLYTHE guilty.",
            "review_date": "2021-05-08",
            "source": "rt"
        },
        {
            "content": "A great blend of classic Hollywood melodrama and noir. The murder mystery framing device is rather ingenious. It lures you in but even if you've determined who the killer is in advance of the reveal the characters are so compelling that you'll continue to be transfixed.",
            "review_date": "2021-04-28",
            "source": "rt"
        },
        {
            "content": "Crawford is great, but it's hard to appreciate Mildred as a self-reliant, independent woman when her hard work and determination is laid to waste by her shocking inability to discipline her borderline demon of a child in even the slightest way. Veda is just the absolute worst (which is a testament in part to Blyth's performance), but the blind eye that Mildred turns to her horrible behavior can't even be explained away by maternal affection. Where some parts seem timeless (Mildred's rough start in finding a job will ring in the ears of the Milennial crowd), but otherwise parts of her journey will seem farfetched and silly, like obtaining a California home on a handshake with no cash and building a successful restaurant franchise off little more than a few months of waitressing experience. Though it's called a noir, the film is 90% melodrama, and suffers from dodgy pacing at times. Some of the characters don't make a terrible amount of sense, particularly Veda, whose fierce independence coupled with insatiable greed leads her to angrily distance herself from her doting mother in pursuit of a higher standard of living so ... she leaves her comfortable existence to sing in a bar. The shining light in this otherwise relatively unexciting film is Crawford, who makes every other performer look second-rate by comparison, apart from the little-used Arden. The mother-daughter storyline lacks power largely because Veda is such an unsympathetic monster, and I can't say this is a personal favorite despite the acclaim. (3/5)",
            "review_date": "2021-04-04",
            "source": "rt"
        },
        {
            "content": "Really good. I figured out the murderer but still enjoyed the movie.",
            "review_date": "2021-03-25",
            "source": "rt"
        },
        {
            "content": "Noir's charm deepens the drama of this film and, we have a Joan Crawford - in excellent performance - playing the warrior Mildred and suffering in her relationships. I felt that the film gets a little tiring in certain parts.",
            "review_date": "2021-01-02",
            "source": "rt"
        },
        {
            "content": "Perfection. I didn't realize how different it was from the James M. Cain novel until I saw the much more faithful TV adaptation. But, for once, the Hollywood treatment did not impair the product. In fact, the movie is much more effective because of the changes. The TV miniseries is also excellent. They are two different works of art based on the same source material. \n\nIMHO James M. Cain is the quintessential American novelist. He's as underrated as Scott Fitzgerald and Ernest Hemingway are overrated. Cain's novels are as fresh today as they were over half a century ago, when they were written. Fitzgerald and Hemingway were \"dated\" by the 1950s.  Mildred Pierce, The Postman Always Rings Twice and Double Indemnity are cinema classics. Dozens of movies have been based on Hemingway and Fitzgerald novels, none of which are still watchable, let alone memorable. \"Snob appeal\" has no legs.",
            "review_date": "2020-11-19",
            "source": "rt"
        },
        {
            "content": "Much better than I expected as the noir style mystery kept the plot moving if the melodrama created by the voyeuristic look into this most unhealthy of relationships between a mother and daughter was not enough. Joan Crawford took on the lead well but it was Veda, played devilishly well by Ann Blyth, that was one of the more interesting and unlikely movie villains I have seen in a film lately. Eve Arden also stood out to me in her role as Ida. If you're thinking about having children this maybe one to skip for now.",
            "review_date": "2020-11-07",
            "source": "rt"
        },
        {
            "content": "Every now and then, you encounter a film from the studio era that perfectly encapsulates the ins and outs of its source material. Films like \"The Maltese Falcon\" and \"Double Indemnity\" may change names or condense scenes, but the overall feel of the original project resounds clearly, regardless of the adaptation process. With this film, however, it seems as though something may have gotten lost in the translation from page to screen. Struggling mightily in its attempts to balance the more melodramatic elements with an overarching sense of intrigue, it almost feels as though \"Mildred Pierce\" uses the innate \"shininess\" of a murder mystery to detract from the inherent tedium of its second act. Yes, Joan Crawford is fantastic in this, but I simply didn't find her character's financial plights to be of much interest to me. The ending brings a burst of satisfaction as well, but it's fleeting, and as we fade to black, you can't help but feel as though you've been duped into watching characters quibble about money for 100 minutes.",
            "review_date": "2020-10-19",
            "source": "rt"
        },
        {
            "content": "One of those rare occasions where the movie is better than the book.",
            "review_date": "2020-07-27",
            "source": "rt"
        },
        {
            "content": "Melodramatic but the acting saves it.",
            "review_date": "2020-07-22",
            "source": "rt"
        },
        {
            "content": "One of my my favorite director Michael Curtiz's movie is a must-see, Joan Crawford in the title role plays a small town homemaker turned waitress and finally starting a small business that booms. She does it only for her daughters to get a good, luxurious life. After her younger daughter's death she tries to please her elder daughter who in turn becomes a problem and spoilt to the core.  Finally a murder and a whodunnit caper ensues. \n* Joan Crawford won the Oscar for Best Actress in a led role.",
            "review_date": "2020-07-18",
            "source": "rt"
        },
        {
            "content": "Unbelievable performances and engaging storyline.  Well worth the watch!",
            "review_date": "2020-05-13",
            "source": "rt"
        },
        {
            "content": "With a Oscar-winning performance from Joan Crawford, Mildred Pierce is one of the most daring and important films for female cinema",
            "review_date": "2019-12-12",
            "source": "rt"
        },
        {
            "content": "Joan Crawford is one of the greatest movie stars of all time and people don't talk about this fact enough. A film like Mildred Pierce which is slow and moody needs an actress with the charisma and natural intensity of Crawford to engage audiences for up to two hours and she's up to the task as she gives arguably her greatest performance. Going in I was already a fan of Crawford but I hadn't exactly warmed to director Michael Curtiz who's most famous work is the extremely overrated Casablanca (1942). He does a great job with this film however as he weaves a story of intrigue and passion that ends not with an overly dramatic climax but with a rather sad acceptance from our protagonist. This is a film made with terrific skill and the efforts of the filmmakers are all clear on screen as they have made a film that still holds up 74 years later.\n\nMildred Pierce, Joan Crawford, breaks up with her husband over disagreements about her working and his mistress. She quickly makes a success of herself after the separation by teaming up with her husband's smitten former business partner Wally Fay, Jack Carson, to open up a restaurant which quickly becomes a sensation and allows her to open several more. The owner of the building in which the first restaurant was set up, Monty Beragon, Zachary Scott, catches Mildred's eye and the two begin a relationship despite his repeated borrowing from her. Complicating their relationship even further is the fact that Mildred's materialistic daughter Veda, Ann Blyth, is also infatuated with Monty and bleeds her mother dry for money. Mildred eventually reaches a breaking point as all of the people around her continue to use her and attempts to leave Monty and Veda behind but Veda takes a fatal action.\n\nThe heart of the film is the difficult relationship between mother and daughter as we see the hardworking Mildred spoil her daughter so much in childhood that when she grows up she has no appreciation for the luxuries she is provided with. She feels at once trapped by her mother as she needs money to pay for her expensive lifestyle but feels embarrassed that she needs money from her mother, whom she has disdain for because she ‘works'. There are several points in the film where Veda makes statements that are so utterly ridiculous that you have the strong urge to slap some sense into her. Towards the end of the film she angrily rejects her mother as she informs her that she and Monty will be married and will abandon her. She clearly has not thought this plan through as we are aware that Monty financially relies on Mildred and that he and Veda together would have no hope of surviving what with their complete lack of abilities or willingness to work. We feel a small victory as Monty then informs a shocked Veda that he never intended to marry her and was simply using her but that is quickly taken away from us as we realize that Mildred will continue to support her daughter even at her own risk.\n\nCrawford's central performance is stunning as we believe her innate strength from the moment we see her and yet she brings an unexpected vulnerability to a role that really needs it. She uses her wide eyes to convey Mildred's shock and horror but also her hurt in the many moments when she gets cut down by another person. In the final scene of the film she walks out of the police station with her ex-husband and we get the sense that she is free for the first time in her life but not enjoying it. Crawford was truly deserving of the Academy Award that she won and I only wish she had won more Academy Awards because she deserves more recognition for her acting talents.\n\nThis is a great film, one that everybody should see, and it's one of the finest examples of the much loved film noir genre that I have had the pleasure of seeing. The storyline and the performances are exceptional and you will walk away with an even greater appreciation for Crawford's talents as an actress.",
            "review_date": "2019-06-17",
            "source": "rt"
        },
        {
            "content": "The Crawford picture to END all Crawford pictures. ",
            "review_date": "2019-06-11",
            "source": "rt"
        },
        {
            "content": "This movie was released in 1945 with different mores and a different culture, right at the end of WWII. Especially evident is the patriarchal society which was not welcoming of the go-getter Pierce. It is sappy and schmaltzy and an early forerunner for soap operas. I was surprised to see that William Faulkner wrote the screenplay, which was altered considerably from the original James M Cain novel. I found Crawford's performance great but the script strains credulity.",
            "review_date": "2019-02-11",
            "source": "rt"
        },
        {
            "content": "Joan Crawford gives an Academy Award winning performance in the title role of this melodramatic film noir. After Mildred's second husband is murdered, flashbacks reveal the events leading up to his death. A doting mother, Mildred rises from waitress to restaurant-chain owner, but her spoiled daughter's selfishness results in heartbreak. With those broad shoulders, those wall-to-wall eyebrows, that steely look on her face, and wrapped in those expensive clothes, the inimitable Joan Crawford exudes glamour and resolve as famed Mildred Pierce, housewife turned businesswoman, in this Michael Curtiz-directed film, part mystery, part melodrama. Joan Crawford won the Academy Award for Best Actress for her portrayal of the title character in this 1945 noir classic . The tragedy of Mildred Pierce is an essential film noir.",
            "review_date": "2019-02-06",
            "source": "rt"
        },
        {
            "content": "enjoyed the noir elements and camerawork and Crawford's performance but couldnt stand her brat daughter and how Mildred wasted her life trying to give the unappreciative brat daughter everything she wanted ",
            "review_date": "2018-05-31",
            "source": "rt"
        },
        {
            "content": "This is a classic and has an depth of a meaning and a hint of a spiritual message about a mother and daughter's life.",
            "review_date": "2018-05-11",
            "source": "rt"
        },
        {
            "content": "Joan Crawford and Zakary Scott in the mirror, switching to a recollection scene, how to use windows and shadows, a time-honored last. It is relieved rather than being good, including the performances of the actors.",
            "review_date": "2018-04-21",
            "source": "rt"
        },
        {
            "content": "A 40'S melodrama that shows its age, but still watchable.",
            "review_date": "2018-03-29",
            "source": "rt"
        },
        {
            "content": "Brilliant Hollywood film combines murder mystery with social examination without one dominating the other. Great performances facilitate an impactful exploration of women's societal role and how greed can corrupt judgment.",
            "review_date": "2018-03-06",
            "source": "rt"
        },
        {
            "content": "Great movie, Miss Joan Crawford gives a stellar performance!",
            "review_date": "2017-12-29",
            "source": "rt"
        },
        {
            "content": "Crawford's best work ever.",
            "review_date": "2017-11-08",
            "source": "rt"
        },
        {
            "content": "Im not sure if Mildred Pierce is intended to feel like a traditional murder mystery, but it definitely does not. Despite the fact that it opens on a man being shot, through most of the film it doesnt come across like a crime story at all. More than anything this is the tragic tale of a womans struggle to do what she thinks is right, and being met by endless frustrations along the way. I felt for Joan Crawford throughout the film, because she makes Mildred a character you want to see succeed. However, I was constantly annoyed by the way people around her would treat her and take advantage. It made my skin crawl when every male would come on to her, and lets not even get started on how her daughter acts. It was the kind of movie that makes me uncomfortable because I want to intervene, and stop the madness. It doesnt help that Mildred herself seems to be condoning and rewarding some of the behavior, which just makes it that much more infuriating. The way the story is told in the framework of the police performing a murder investigation is probably the most intriguing part of the film, and it leads to a powerful climax. I wish more of the story was about the investigation. I see the quality in the film, particularly in the acting performances, but the experience of watching Mildred Pierce was largely unpleasant. I might still recommend it to some people, it just wasnt ideal for me.",
            "review_date": "2017-10-16",
            "source": "rt"
        },
        {
            "content": "A near perfect melodrama with excellent performances,shocking plot turns and Joan Crawford at her best.",
            "review_date": "2017-09-29",
            "source": "rt"
        },
        {
            "content": "Entertaining and disturbing, Joan Crawford is the perfect choice for this vehicle.",
            "review_date": "2017-08-27",
            "source": "rt"
        },
        {
            "content": "An undeniable classic, the opening scene with fur coated Joan Crawford at the dock is just iconic. Some dialogues and points of view reflected in the film stand out as misogynists and classists, which sometimes may draw you out of the film due to how outrageous they sound to our XXI ears. Despite that fact, a terrific mixture of a family melodrama and film noir with a very professional direction from mister Michael Curtiz. You will recognize his hand in some frames and camera compositions that resemble Casablanca, also the restaurant interiors retrace back to that other movie. Just for the iconic Joan Crawford in her Oscar winning role the film is a must-see for any movie geek.",
            "review_date": "2017-05-26",
            "source": "rt"
        },
        {
            "content": "Mildred Pierce (Michael Curtiz, 1945) - 7,0/10",
            "review_date": "2017-04-30",
            "source": "rt"
        },
        {
            "content": "6.9/10, my review: http://wp.me/p1eXom-2S7",
            "review_date": "2017-04-02",
            "source": "rt"
        },
        {
            "content": "Mildred Pierce is a neo-noir classic that despite adding some questionable plot lines over its source material, benefits from Joan Crawford's legendary performance in the title role.",
            "review_date": "2016-12-12",
            "source": "rt"
        },
        {
            "content": "Enjoyable, but felt almost soap opera like. I got so fed up with her daughter, but I guess it wouldn't have been so dramatic otherwise. 1001 movies to see before you die.",
            "review_date": "2016-10-23",
            "source": "rt"
        },
        {
            "content": "This movie is the tits! Incredible, on-your-toes characterization. Great acting. Conflict laden. Modernly, we'd see this as typical heavy-material'd, character-driven Oscar bait, making this form of film ahead of its time.",
            "review_date": "2016-10-16",
            "source": "rt"
        },
        {
            "content": "In an Oscar-winning performance, Crawford elevates this melodrama-noir that deserves credit for its splendid cinematography, mise-en-scène and structure, but the film hasn't aged very well with its patriarchal view that a married woman who leaves home will inevitably meet disaster.",
            "review_date": "2016-09-27",
            "source": "rt"
        },
        {
            "content": "Mildred Pierce is an awesome movie. It is filled with powerhouse performances with the deserved Oscar-winning performance from Joan Crawford, it is deftly edited, wonderfully directed and excellently scripted. It is a great mix of noir and drama, it is dramatic and always riveting, but above all emotional and a great commentary on parent-child bond with smart relationships and story, intriguing melodrama and terrific characters of which Veda is probably one of the most despicable characters ever portrayed in a film. The character of Kay and what they did with her is unfortunate, but that is the only problem in this otherwise incredible film that is one of the very best of its year.",
            "review_date": "2015-08-24",
            "source": "rt"
        },
        {
            "content": "This iconic classic is a great bit of entertainment despite itself. God bless its soap opera-drenched heart! Joan Crawford delivers a shamelessly hammy performance that makes the movie instead of damaging it.",
            "review_date": "2015-05-27",
            "source": "rt"
        },
        {
            "content": "Mildred Pierce is a truly amazing movie that is full of twists and turns. The film is not necessarily a film noir but contains heavy elements of film noir. The setting, lights, and shadows especially give the film the film noir look as well. Mildred Pierce really leaves the viewer on their seat in anxiety as the plot slow unravels.Joan won an Oscar for her breathtaking performance, but the tour de force powerhouse in \"Mildred Pierce\" was Ann Blyth. Black hearted Veda was the lynch pin of this movie, and Blyth's portrayal made Veda seem all too real and frightening. Nominated for an Oscar, she should have won.Don't miss this timeless nail-biter",
            "review_date": "2015-05-11",
            "source": "rt"
        },
        {
            "content": "Ridiculous, over-the-top melodrama with scenery-chewing actresses and I loved every second of it!",
            "review_date": "2015-04-08",
            "source": "rt"
        },
        {
            "content": "The film's fabula is a drama, while the syuzhet is a mystery noir. The overall form is very well-played with signs of being influenced and somewhat influential, next to Joan Crawford's award-winning performance that shows actual beauty. (B+)\n\n(Full review coming soon)",
            "review_date": "2015-04-08",
            "source": "rt"
        },
        {
            "content": "Interesting characters and themes of class and social status make for an engaging film noir.",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "DramÃ²n de los aÃ±os cuarenta , mezcla de drama y noir muy bien resuelto con una  Joan Crawford inolvidable, un clÃ sico.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "A solid film. Nothing special, but interesting none the less.",
            "review_date": "2014-12-29",
            "source": "rt"
        },
        {
            "content": "Despite genuine performances from its cast, Mildred Pierce comes off as mostly unrealistic.",
            "review_date": "2014-12-17",
            "source": "rt"
        },
        {
            "content": "Veda is one of the worst villains ever seen in Hollywood. Mildred Pierce looked to me like one of those B movies passing as a Film Noir. The truth is, it is both. But what drama and what noir. Recomendable.",
            "review_date": "2014-12-15",
            "source": "rt"
        },
        {
            "content": "Classic Joan Crawford in this wonderful  drama with perfect acting and a great story line. One of my favourite all time classics.",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "A chain of restaurants & an insanely strong maternal instinct are the driving forces in this amazing noir melodrama about a mother clawing her way up to appease her spoiled bitch of a daughter.",
            "review_date": "2014-12-03",
            "source": "rt"
        },
        {
            "content": "Typical black and white film with soap opera drama, surrounding a noir crime case. I found it a bit cartoonish and fake how some of this stuff went down-from the spoiled rotten daughter to the divorce. Many of the heavy events seemed to be glossed over like the death of Kay or the couple deciding to split. The acting was decent enough for the content The script was pretty bad and unnatural sounding. The twist at the end was meh. I mostly just enjoyed seeing the decor from back then, along with the hairdos and outfits. Also considering all the hoopla around Crawfords' personal life as a mother, I found the film ironic and was distracted more by that than the film itself.",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "A classic worth seeing. Mildred Pierce is a mystery drama with a great story. Joan Crawford plays the title character well. You really feel bad for her. (First and only viewing - 11/25/2014)",
            "review_date": "2014-11-18",
            "source": "rt"
        },
        {
            "content": "This is basically a poor-little-rich-girl soap opera, sitting in a (probably unneccessary) murder mystery frame, but why carp when it is filmed as lushly (some definite noir stuff) and especially performed as charismatically as this. It's dated as hell in its sexist politics (not dated enough, frankly), but that arguably adds to the interest. It might appear to be a female empowerment yarn, but what the film also becomes is a cautionary tale on the dangers of spoiling children. None of the characters (beyond the brilliant Eve Arden) are particularly endearing, but Crawford's sensational, iconic performance as the title character means once you're hooked, you won't let go.",
            "review_date": "2014-08-15",
            "source": "rt"
        },
        {
            "content": "What a film. I quite enjoyed it.\nThis was the first Joan Crawford I have ever seen and she is miraculous to say the least.\nI enjoyed her graceful yet powerful acting abilities and she greatly deserved her Oscar.\nMildred Pierce is about a mother of the title's name who gets separated from her husband and she must now figure a way to stand on her own, financially, to provide a life for her and he two daughters. (btw, the gender stereotypes and transgendered undertones are amazing).\nMildred ends up becoming a successful waitress and owning her own line of restaurants.\nBut at the same time, Mildred struggles after losing her younger daughter to pneumonia and trying to keep her older daughter in line as she is a real brat.\nThroughout the film, we see how Mildred becomes a strong independent woman. Her character is one that breaks the chains of gender stereotypes.\nMildred Pierce, I give you a 100%.",
            "review_date": "2014-05-24",
            "source": "rt"
        },
        {
            "content": "While it's not a bad film, it's certainly not anything extraordinary.",
            "review_date": "2014-04-08",
            "source": "rt"
        },
        {
            "content": "Mildred Pierce follows the titled character proving to her cheating husband she can become independent and successful. The story biggest strength lies heavily in the title heroine. She's a complicated individual that's easy to sympathize with, relate to, and made compelling for all the right reasons. She's receives substantial amount of development that does more than help her become three dimensional. Demonstrated numerous times Mildred Pierce is a strong dedicated individual and an intelligent one at that too. Being able to accomplished great things when she puts her mind on something, but when it comes to her home she's not as confident. There's a clear distinction made between business Pierce and at home Pierce. In both environment Pierce demonstrate a skills to understand an issue and quickly make her mind on how to resolve even if it's not the most rational in hindsight. Yet, it's when we see Mildred Pierce troubled home life where it made more evident of her weakness. Making way for a depiction that analyzes ambition and class struggles. Where the intentions is exactly part of the problem and what prevents it problem from being fixed. A depiction between Pierce and her daughter Veda clashing their personality with one inherited wealth vs. earned wealth. Both characters are flawed with opposing feelings with their vastly different lifestyle. It's difficult to the blame either individual for the way the story pans out as both as much in the right as they are in the wrong. \r\n\r\nAside from the title protagonist the film isn't short on great characters. Just about every major player in the plot are fleshed out. Each presenting a sentiment of the period it was made in. Bert Pierce represents men insecurity in a era where it was for a man to support his family with his own two hands. Veta Pierce represents the ever-changing youth and their opposition to previous generations customs. Monte Beragon represents the death of the upper class with his decay in power and money becoming accessible by the common man to gain. Ida Corwin is altogether unconventional with her husband-and-wife relationship with Mildred. These characters and others are supported by strong characterization that fleshes them out as three dimensional characters than just being a sentiment of an era. Never do what the characters represents comes off as an artifact of its era. \r\n\r\nMichael Curtiz's direction is truly superb in the way he presents the story as well as delving into the mind of its titular character. Curtiz also plays up to the noir style of the film by creating an opening sequence while never revealing who kills Monte. This would create a tone where it becomes very dark during Mildred's interrogation scenes. By the time the third act arrives, the mixture of melodrama and noir finally blend as the tone of the film darkens. Cinematographer Ernest Haller does a phenomenal job with the film's black-and-white photography from the wondrous, sunny look of the suburbs that Mildred lived in early in the film to the dark, eerie world that comes in later in the film. Max Steiner score is excellent from its sweeping theme that plays to the melodrama of the film to more uplifting pieces that plays to Mildred's rise. Steiner's score is definitely another of the film's highlights as it's truly spectacular.\r\n\r\nThe cast is definitely wonderful for its array of some very memorable performances from the big actors to some small roles by other actors. Mainly Joan Crawford in one of her finest performances as the title character brings realism to a woman in the 1940s trying to do what is right for her children. Bringing a sense of frustration over her spoiled child, but never once coming off as a mean spirited mother. It's an overall iconic performance from the legendary Crawford. Ann Blyth is superb as Veda, the ungrateful daughter who wants to become rich and ambitious as she is also a selfish, spoiled, and uncaring. With a stylized yet dramatic performance, Blyth succeeds in creating an unsympathetic character that everyone loves to hate. Jack Carson hints of a man with self-esteem issue, and even though he tries to cover it with playful banter, it comes through in his facial expressions. Zachary Scott is another strong additive to this mixture. As Monte, he carried himself very cool and laid back. His words were spoken softly, yet confidently. He very seldom needed to raise his voice, because his choice of words were so dead-on that the point was made with little effort. \r\n\r\nMildred Pierce is a masterpiece having one of the finest and most compelling leading character to have been written. The 1940's sentiment are very true to its era depicting accurately the changes in society without becoming a relic of its own time. Instead it uses these sentiments to giving more meaning to multilayered characters, but also serves as strong story characters adding to what's already a compelling and multilayered film.",
            "review_date": "2014-04-01",
            "source": "rt"
        },
        {
            "content": "A classic. Gotta love Joan!",
            "review_date": "2014-03-17",
            "source": "rt"
        },
        {
            "content": "A fabulous starring role for Joan Crawford (and for the longest time the best place to have brunch in Toronto). No one plays the strong female lead better and she navigates the obstacles placed in her path very effectively.",
            "review_date": "2013-12-20",
            "source": "rt"
        },
        {
            "content": "One of my personal favorite film noirs, \"Mildred Pierce\" captures the unique characters and surprising twists with such finesse and care, all while pacing itself steadily and engagingly in such a way as to keep the attention of most viewers. A must see for most average film viewers.",
            "review_date": "2013-11-06",
            "source": "rt"
        },
        {
            "content": "When I think of Joan Crawford, I think of \"Mommy Dearest\".  I can't help it, I didn't grow up in the era where she was a major film star.  This may actually be the only Crawford film I've seen to date, and now I know what all the fuss was about.  The matronly and stoic Mildred Pierce Beragon (not to be confused with the Japanese monster from Gamera movies), portrayed by Crawford, is in perfect contrast to her bratty, materialistic daughter Veda, played by Ann Blyth in one of her earliest roles.  As far as the male roles, Jack Carson steals the show as the somewhat sleazy real-estate partner Wally Fay.  Overall a very good \"whodunnit\".",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "I loved this movie. It's shows how much a mother could have rose tinted glasses. Joan Crawford was perfect for the role as the mother. She was strong female as well as weak for her daughter. I wanted to scream at her--tough love. It was well worth the oscar she won. It's a film noir with great cinematography.\n\nwww.what-to-watch.com",
            "review_date": "2013-09-12",
            "source": "rt"
        },
        {
            "content": "Joan..A great carry-over star from the Silent Era........",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "What can one write about this classic film? So much has been written. Just three words: pure film bliss. A perfect example of how brilliant the studio system could be.",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "Mediocre at best. Crawford was OK and the story bordering on tedious.",
            "review_date": "2013-06-15",
            "source": "rt"
        },
        {
            "content": "I've seen this movie a dozen times.  I can't turn the channel whenever it comes on TMC.   I get so drawn into the story that I just want to smack that spoiled and smug Veda each time I see her.  I love it.",
            "review_date": "2013-05-28",
            "source": "rt"
        },
        {
            "content": "Skims over parts of the story but reasonably effective nonetheless.  It's pretty obvious that Mildred's business acumen and work ethic include sex as part of the exchange of value in negotiating her path to security and wealth. Matter of factness about this seems common to early films about strong women. Good, solid supporting cast.  I especially enjoyed the other strong woman in the film, Ida, played by Eve Arden. She added humor while demonstrating that Mildred wasn't an anomaly in this film world.",
            "review_date": "2013-05-12",
            "source": "rt"
        },
        {
            "content": "I was completely taken by surprise by this movie. Knowing nothing of the original novel, and knowing the 2011 miniseries by name only; I went in with no expectations but came out genuinely pleasantly surprised. This is a first-rate drama that really delivers on the emotional side that these movies usually lack.\r\n\r\nThe story follows Mildred Pierce, a single mother trying to support her family. She divorces her first husband because they're not on the same page about how to raise their daughter, Veda. Mildred will do anything to give Veda the life that she never had. She works hard in the restaurant business and becomes very successful. Around this time, Mildred meets and almost falls in love with Monte Beragon, until she releases what a freeloading dirt bag he is. But Veda takes up a fascination with Monte; she thinks he is the only one who can satisfy her lavish lifestyle. Mildred is left with a plethora of moral choices to make.\r\n\r\nWhat makes the movie so great is the troubled heroine at the center. Joan Crawford is superb as Mildred, and totally deserving of her Oscar win. The character itself is fascinating, a woman who will do anything to get in the good graces of her egocentric daughter. She makes a lot of wrong decisions, but the audience still roots for her. Crawford nails the part of this very edgy character.\r\n\r\nProviding a memorable and despicable performance is Ann Blyth as Veda Pierce. I can't remember that last time I hated a character so much. Veda is selfish, uncaring, and completely lacking empathy. Crawford might give the best, most subtle performance, but Blyth gives the most memorable. She is utterly despicable in the part. For some unknown reason, Blyth was nominated but didn't win the Oscar for Best Supporting Actress. Her performance is far better than the actual winner's, Anne Revere in National Velvet.\r\n\r\nThe rest of the cast is also excellent. Eve Arden is funny and fantastic in her Oscar nominated turn as Ida. Jack Carson also turns in a great performance as Wally. But the two main male leads of the movie, Zachary Scott and Bruce Bennett, aren't entirely impressive.\r\n\r\nThis movie shows itself to be an above average noir drama, and it scored six Academy Award nominations to prove it. It's a class act that always entertains. The story pulls you right in and is riveting from start to finish. This is really a movie about people, the story isn't quite as important; and the phenomenal performances back up the fascinating characters.\r\n\r\n\"Personally, Veda's convinced me that alligators have the right idea. They eat their young.\" 8.5/10",
            "review_date": "2013-05-03",
            "source": "rt"
        },
        {
            "content": "Joan Crawford gives one of the most heart-wrenching performances of cinema. I really dug the black-n-white photography, especially in the scene where Veda and Monte are flirting on the bar.",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "I'm so smart it is a disease.\n\nMildred Pierce's husband cheats and deserts her, leaving her with a demanding daughter.  Mildred becomes an independent woman, starts working as a waitress, saves her pennies, and eventually opens her own restaurant.  She makes enough money to give her daughter the best life she can but her daughter keeps the pressure on her to make more and more money.  Can Mildred meet her daughter's expectations or will her life crumble through her fingers?\n\n\"You don't really think I could be in love with a rotten tramp like you, do you?\"\n\nMichael Curtiz, director of Casablanca, White Christmas, The Adventures of Robin Hood, The Vagabond King, Yankee Doodle Dandy, and Captain Blood, delivers Mildred Pierce.  The storyline for this picture is absolutely awesome.  The main character is mesmerizing and the side characters, male pursuers as well as the daughter, are so well written and delivered.  The performances are stunning and the cast includes Joan Crawford, Jack Carson, Zachary Scott, Eve Arden, Bruce Bennett, and Ann Blyth. \n\n\"Detectives have souls...the same as anyone else.\"\n\nI am a HUGE Michael Curtiz fan and I am coming around on Joan Crawford.  I found this picture on Turner Classic Movies (TCM) and decided to give it a shot.  I will tell you this is an amazing picture and easily my favorite Crawford film to date.  The story is intriguing, unpredictable, and very intricate and ways I hardly anticipated.  This thriller is a must see and amongst my favorite Curtiz films.\n\n\"I lost my awe of women at an early age.\"\n\nGrade: A+",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "IN PROGRESS Joan Crawford won a Best Actress Oscar portraying a single woman who works to become a successful businesswoman while desperately seeking the approval of her  spoiled daughter.   Along the way her life becomes intertwined with a collection of less than reputable men. \r\n\r\nThis is a film noir classic containing all the best elements of the genre: sex, murder, drama all told at a rapidly unfolding pace.  Joan Crawford was complimented by Ann Blyth as her scheming daughter and Eve Arden as her friend and confidant. Both were justly nominated for Supporting Actress Oscars. MORE TO COME.",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "James M Cain's novel 'Mildred Pierce' was much tougher, dirtier, violent and cynical than the gorgeously mounted movie it became, but the film still manages to maintain enough of the flavor of the book to be interesting.  This is not my favorite Joan Crawford film or adaptation from a novel.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "Joan Crawford won Lead Actress Oscar for this??  Give me the Kate Winslett version over this one any day.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Solid acting, writing, cinematography, and story. Having no idea of the plot beforehand, I found myself being sucked into Mildred's journey.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "Saw it for the first time recently and it took me by surprise. Not at all what I expected. It's a surprisingly daunting film.",
            "review_date": "2013-01-15",
            "source": "rt"
        },
        {
            "content": "Double crosses, tragic flaws and money. Lots of money.",
            "review_date": "2012-11-17",
            "source": "rt"
        },
        {
            "content": "Mildred Pierce is a genuine noir title, and Joan Crawford's tour de force. In this film, a murderous mystery tale (told through greatly-used retrospectives) intertwines with some incredibly touching melodramatic sensations. Mildred Pierce, a woman struggling to prove her independence and strength, wants to love and be loved, but those two don't necessarily come in pairs. Divorced and almost broke, the woman tries to persuade a wealthy lounge frequenter to help her create her own business, namely a chain of restaurants. As time passes, she becomes successful, but still not able to please her pretentious and disobeying daughter Vida. More problems arise for Mildred, and she gradually begins to understand that the only way out of the whole mess might be the most dangerous one. Mildred Pierce is a valuable noir movie, and a fantastic socially conscious cinematic achievement. The psychological aspects are a many, but their true value comes with wonderful performances, low-key lightning and moody cinematography that is as disturbing as it is acute. Mildred Pierce brings a story that influenced many related films, and developed into a classic in a short period of time.",
            "review_date": "2012-11-13",
            "source": "rt"
        },
        {
            "content": "Very good stuff. Solid Joan and the male support cast is pretty good too. more noirish than I expected which was a nice surprise.",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "Certainly very dramatic, but it is also extremely entertaining. I cannot help but imagine what the men who just came back from the War would have felt about Mildred's character in the film. The portrayal of Mildred is also entertaining, much like the woman who were thrusted into work in the 40's, Joan Crawford's character is also thrown into the world of business. The theme of gender reversal in the movie is apparent, so is the symbolic representation of each character, all of which are well represented. Veda is perhaps the most snobbish character anyone can ever find. Despite all the social issues Mildred Pierce tries to address, it is all embodied within a well constructed and enthralling story.",
            "review_date": "2012-11-07",
            "source": "rt"
        },
        {
            "content": "Sudsy melodrama, but what keeps this film lively is the way gender and power remain constantly in flux.  It's almost impossible to keep track of whose manipulations are working on whom, and how.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "It may appear as melodramatic, but Mildred Pierce thrives with a memorable performance by Crawford, skilled direction, and a wide scope of cinematography and lighting to define the film as a nostalgic film noir",
            "review_date": "2012-10-22",
            "source": "rt"
        },
        {
            "content": "I cann't stand the presence of Joan Crawford, among many other reasons.",
            "review_date": "2012-09-27",
            "source": "rt"
        },
        {
            "content": "Excellent must see movie for any fan of old movies!  It has a great story and great performances.",
            "review_date": "2012-08-15",
            "source": "rt"
        },
        {
            "content": "Mildred Pierce had plenty of melodrama, and at one point I tired of it. But it used linear flashbacks to establish a mood quite remarkable on its own accord, leading up to that final and shocking conclusion - the identity of the REAL femme fatale murderess. After all, Joan Crawford seems the archetypal woman for such a character, but the swift repression of that in the film was superbly done. The real culprit behind the film's murder was the bitchy daughter, played to a hatefully excellent level by young Ann Blyth, whose spoilage at the hands of an indulgent mother, which in turn soars following the death of her younger daughter, becomes her own undoing by the end. The movie is a tragedy, yes - but not the normal main-female-becoming-the-murderer archetype. Indeed, on another level, Mildred Pierce actually has a happy ending, freeing and severing all servile bonds that stuck mother-and-daughter and disabled the mother from pursuing a true relationship with a loyal and staunchly protective first husband.",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "This is by far one of my most favorites. Mom and I watched it when ever it was on.",
            "review_date": "2012-07-08",
            "source": "rt"
        },
        {
            "content": "joanie got that Oscar here folks see how/why as she rolled the dice at her new studio WB and hits it out of the park.",
            "review_date": "2012-07-04",
            "source": "rt"
        },
        {
            "content": "Definitely a classic movie. This film re-launched Joan Crawford's career, and it shows how much effort she put in to the part. This film is full of drama and keeps you wandering who the true murderer is.",
            "review_date": "2012-06-30",
            "source": "rt"
        },
        {
            "content": "Layered Contrivance, Maternal Excess, and Dark Brilliance--bleak and beautiful!!",
            "review_date": "2012-06-24",
            "source": "rt"
        },
        {
            "content": "A brilliant absorbing & enthralling portrayal of woman in a man's world & what she does to keep her family intact.\n\nJoan Crawford was a sensation as Mildred Pierce & throughly deserved her Oscar in 1945. The film's style & feel is unmistakably Noir but it's only second to a great compelling story with rich characters.\n\nIt covers so much in only 110 minutes, it deals with issues & themes very ahead of 1945 & all the acting is top knotch. I found myself fascinated by the film & it completely draws you in, an essential classic & a female film & performance of a lifetime.",
            "review_date": "2012-06-21",
            "source": "rt"
        },
        {
            "content": "Such a great movie and with so many layers.  Really good acting with Ms. Joan Crawford at her best.  Take a handful of entrepreneurship, a dash of co-dependence and insecurity and you have a great classic!!!",
            "review_date": "2012-06-12",
            "source": "rt"
        },
        {
            "content": "Awesome movie, joanie won her Academy for playing the hard trying mother to a wench of a daughter",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "Joan Crawford's best movie. I love the story. It's a real treat to see it restored in HD format too. \nIt would be so great if Hollywood remembered today that they were once able to tell a story without special effects and CGI.",
            "review_date": "2012-05-26",
            "source": "rt"
        },
        {
            "content": "its Mildred pierce people.",
            "review_date": "2012-05-13",
            "source": "rt"
        },
        {
            "content": "Great, classic drama.  Excellent plot - clever murder plot mixed with sensitive, emotional human drama.  Having seen the 2011 HBO miniseries first (and liked it a lot), much of the plot was familiar, but this did not detract from the impact of the movie.\n\nGreat direction by Michael Curtiz, who also directed Casablanca (for which he won an Oscar), White Christmas, Yankee Doodle Dandy (Oscar nomination) and Captain Blood (Oscar nomination).  Clever use of stories-within-scenes.  Pacing is spot on.\n\nJoan Crawford is superb as Mildred Pierce.  Good support from Zachary Scott, Jack Carson (especially) and Ann Blyth.\n  \nOverall, even better than the 2011 miniseries.  An understated classic.",
            "review_date": "2012-05-03",
            "source": "rt"
        },
        {
            "content": "melodrama with a twist of noir in the center. crawford is better than ever in her comeback performance.",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "Has to be one of the great archetypal America melodramas. Joan Crawford's defining role as the eponymous hard working, overindulgent mother with the bitch of a daughter is a cracking if hugely camp tale. The cast is brilliant, from the wise-cracking Jack Carson to the nails-down-a-blackboard voiced Butterfly McQueen but of the supporting cast, for me, it has always been Eve Arden as Ida that steals every scene. She's brilliant and gets all the best lines. Ms Crawford herself was never the greatest of actresses but here, all of her baggage and inabilities to convey passion and emotion are utilised to the full. This is the role she was born to play and boy does she milk it. She hogs every photon of light and God knows how many mink were slaughtered to fill her wardrobe. With genre-defining direction by Michael Curtiz this is 1940s Hollywood at its very best and can be enjoyed time and time again.",
            "review_date": "2012-04-15",
            "source": "rt"
        },
        {
            "content": "So I watched this after I finished watching Stanwyck's Stella Dallas. Both movie share similar plot and both are just great but somehow Barbara Stanwyck's portrayal as self sacrificing mother is somewhat more believable to me than Joan Crawford's.",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "its been a few weeks since i watched but wat i do know is that i loved it. it is shot well and has a good story even though not much happens until the end.joan crawford i found to have great presence and in a way was a very sexy housewife",
            "review_date": "2012-04-06",
            "source": "rt"
        },
        {
            "content": "I always enjoy a good Joan Crawford movie, and this one doesn't fail to disappoint. Crawford plays this wife who loses her youngest daughter and marriage, then turns around and starts up a chain of restaurants. Her oldest daughter is a spoiled selfish brat. Borrowing money from the waitresses at her mom's business, not pulling her weight when she should, making the maid wear a uniform and taking men from her momma. A regular piece of trash. Stuff gets funkier when Crawford marries Zachary Scott and baby wants him too. Almost had the momma in deep water behind it. Your regular average tear jerker.",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "Thoroughly enjoyable noir drama, Curtiz is a master of getting great performances from all his cast, so there are some excellent supporting roles here too, Butterfly McQueen steals every scene. What Curtiz does really well is to add a bit of light humor and irony to Cain's bleak tale, and like Casablanca he makes it a great film.",
            "review_date": "2012-03-14",
            "source": "rt"
        },
        {
            "content": "I recently saw the Hbo mini series which runs at 5 hours so i was interested to see a 2 hours version from the 40s,  there are indeed diferences, a murder being in here, for example, the film is well played and definatly a product of its time, Joan crawford is very good, and while 40s stageindg comes into play its a fine film.",
            "review_date": "2012-02-18",
            "source": "rt"
        },
        {
            "content": "Classic film version adapted from the James M. Cain novel.   Plays out more as a film noir than the source novel and has a huge narrative change.   Having seen this after the fantastic Todd Haynes HBO mini series, both can be seen as separate entities, which are great in their own rights.  Still, I think I much prefer the recent adaptation (which sticks to Cain's novel a lot closely), though the 1945 film is a great noir.",
            "review_date": "2012-02-15",
            "source": "rt"
        },
        {
            "content": "The story of \"Mildred Pierce,\" follows Mildred, a poor woman who is about to divorce her wealthy husband. Once this happens, she results to becoming a waitress in order to put food on the table for her children. She quickly moves up in the business and eventually takes a chance in creating her own restaurant chain. She becomes very successful and wealthy, but like all happiness, there is always an end. I absolutely loved every second of this film, even though there was an overload of cheesy lines and a scene (which I will not spoil) that was a little too random and subtle to be taken seriously. Besides it's few catastrophically minor setbacks, \"Mildred Pierce\" helms a spot at the top of my list of  mystery films. This film is a journey that I would be willing to take, many more times!",
            "review_date": "2012-01-20",
            "source": "rt"
        },
        {
            "content": "In Warner Bros' 1945 classic Mildred Pierce, Michael Curtiz expertly directs Joan Crawford in her finest performance.  Her landmark role is assisted by two other fantastic performances from Zachary Scott and Ann Blyth.  This story of a hard-working mother and ungrateful daughter is held together beautifully by Max Steiner's grand score.  Mildred Pierce is essential viewing for every cinephile.",
            "review_date": "2012-01-07",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2011/12/mildred-pierce.html",
            "review_date": "2011-12-15",
            "source": "rt"
        },
        {
            "content": "For the modern viewer who reaches into the past seeking film whose lack of modern effect and production focuses attention on plot-line and characterization, there can be a dizzying array of choices for your time and even a person interested in such as I am can completely miss out of hearing of some prominent films. \r\n\r\nWhile the name Joan Crawford has been known to me for much of my life, it has always been associated with vanity and emotional abuse as much as has for craft and performance. Here then a surprise as the caring mother working every angle possible to provide a life for her daughter that she did not have. \r\n\r\nLest one think that an overly simplistic theme follows of finding out that only love is the answer, I assure you that noir qualities of the day are on display with engaging dialogue and more than its share of base human weakness. \r\n\r\nAt the same time there is also an air of sophistication in the relationships which I would elaborate on if I did not feel it would spoil things for somebody that has not seen it. One example then would be the ability of divorced parents to interact maturely despite strong emotions, much as some people would in life. This from an age where I imagine divorce was far more scandalous than those of this day, and community opinion carrying more weight socially. \r\n\r\nThere is a cold matter-of-fact air to many of the characters in the film, and their words can be laced with an air of brutality. This \"no nonsense\" appeal permeates the viewing experience and offers much to the modern viewer as a result.",
            "review_date": "2011-11-04",
            "source": "rt"
        },
        {
            "content": "Michael Curtiz' academy award winning drama picture, Mildred Pierce is one of the finest drama thrillers i've seen in a long time. With an amazing performance by Joan Crawford, which is among the best performance in this Hollywood era, which won her sole oscar statuette.\n\nMildred Pierce is an adaption of James M. Cain novel. It's the story about the american woman named Mildred Pierce Beragon who is under suspicion of murdering her own husband Monte Beragon (Zachary Scott).  and is brought down to the station for interrogation, and she tells the whole story from when she divorced her former husband Albert Pierce (Bruce Bennett) to her next failed marriage with the former rich man, Monte Beragon, and her daughter, Veda Pierce (Ann Blyth) who's been soiled by her mother since she was a little child.\n\nMildred Pierce is one of the well ploted and structured films i've seen in a long time, with a great cast, specially Joan Crawford who's the queen of them all. The film might be in black and white, but it's plot and it's characters certainly isn't. A big thumbs up from me.",
            "review_date": "2011-10-29",
            "source": "rt"
        },
        {
            "content": "Great movie and a classic of the film noir genre! I took off 2 stars because of the awkward/cheesy dialogue at a few points in the movie, but overall, it's a very enjoyable movie.",
            "review_date": "2011-10-12",
            "source": "rt"
        },
        {
            "content": "Film Noir at its finest.  After recently seeing the \"Winslet\" version they truly toned down the sexual part in this film.  Without a doubt this is one of Crawford's finest film roles that truly gives her the \"respect that she is entitled to\".  Crawford earned her Oscar for this one but the supporting players are equally brilliant in their own right with their performances.  Ann Blythe set the tone for all other \"evil spirited\" adolescent characters as spoiled daughter Veda.  She was the epitome of sweet and evil with no visible distinction of each in the delivery of her lines.   Brilliant!  Kudo's to Eve Arden and Jack Carson in this film too.  It's not only worth watching, it's worth watching over and over again.",
            "review_date": "2011-09-05",
            "source": "rt"
        },
        {
            "content": "One of the classic films about a determined woman wanting all the best for her precious daughter, only to have things out of hand later on.",
            "review_date": "2011-08-26",
            "source": "rt"
        },
        {
            "content": "it's just beautiful. and strong. love b/w film.  lighting (the use of shadow!), composition... cool. can't believe it's made in 1945!!",
            "review_date": "2011-08-25",
            "source": "rt"
        },
        {
            "content": "Cutting performances from Joan Crawford and Ann Blyth alike pierce through in this female-centric take on the film noir genre.",
            "review_date": "2011-08-24",
            "source": "rt"
        },
        {
            "content": "Joan Crawford at Her Most Joan Crawford  \r\n\r\nI saw this movie once before, a long time ago in a film class I took in college.  It was about the history of the twentieth century through film, and this film was intended to represent the push to get women back into the home again after the relative freedoms they experienced during World War II, when they held their own jobs and had their own money.  The point was to show the dangers that awaited women in the Real World, to show that it was better to be protected and cared for by a man than to risk become cold, hard, and unfeminine.  It was one thing to hold a job because you had to, but the moral of the film is that there's an implicit danger to a woman in having an actual career, in doing anything other than living through and for her family.  In a way, it works best because it's Joan Crawford, who might as well be the poster child for feminine independence.  But no--she, too, needs a man to prevent everything from going wrong.\r\n\r\nThe story is told in flashback; Mildred Pierce Beragon (Crawford) is brought to the police station for questioning in the death of her husband, Monte (Zachary Scott).  Her first husband, Bert Pierce (Bruce Bennett), has confessed to the crime.  Mildred tells us the story of their lives.  Bert wasn't able to provide for Mildred and their daughters, Veda (Ann Blyth) and Kay (Jo Ann Marlowe), at all, much less in the manner that Mildred thinks the girls should live.  She starts out as a waitress and ends up running a chain of restaurants, divorcing Bert along the way.  Alas, Kay dies of pneumonia.  Veda is petty, selfish, and greedy.  She scorns the source of the money--both the restaurants and her mother.  She wants to live the kind of life Monte introduces her to, but Monte is only able to live that way on Mildred's money.  He marries Mildred as a business arrangement--he gets the money, and Veda comes back into her life.\r\n\r\nOf course, she'd be better off without her.  Veda is an interesting contemplation of nature versus nurture, one which might have been more clear had Kay not so conveniently died.  Did Mildred make Veda that way or was it born in her?  Though I think it's possible that both are true.  Mildred did raise Veda with a sense of entitlement, but she couldn't instill in her an impression that it took hard work to get what you want, at least most of the time.  There's something missing to both Veda and Monte, I think, and I don't think that's entirely Mildred's fault.  Both of them treat Mildred's work as though it's shameful.  To both of them, there is something disgusting about restaurants.  They both keep going on about the grease, though as Mildred points out, Monte doesn't exactly turn down fifty dollar bills that smell of it.  It's also possible that there's something to the society she was raised in which had something to do with it.  Any way you look at it, though, Veda was a horrible little thing who needed to be taken down a peg or two.\r\n\r\nIt almost seems as though Joan Crawford's entire career was built on watching her suffer.  Whether this is to provide some kind of vicarious pleasure out of watching her overcome whatever-it-is or because audiences never entirely liked her is interesting to speculate about; Joan Crawford did have a long career, but she was never really lovable.  It also seems as though the studios she worked for didn't know what to do with her, given how often she seems to have been stuck playing housewives.  In this, she insisted that her clothes for the part were bought off the rack, which was true enough.  However, she had them altered to fit her look, which kind of defeated the purpose.  No one went to see Joan Crawford movies because they were just like her.  She was, in whatever way you consider it, a kind of wish fulfillment.  You either gloried in watching her overcome hardships or else reveled in her getting her just deserts, whichever you preferred.\r\n\r\nThe DVD release date on the HBO miniseries is unknown.  I'm curious about it, because I'd like to see how certain aspects of the story are shown in a longer format which isn't hampered by the Code.  I suppose this means I ought to get around to reading the book at some point, but I've not yet bothered.  I tend to go through a fit of pulp reading about every other winter, so maybe I'll get to it come January or so.  It is interesting to consider what was allowed in different formats at the time.  The summary of the book on Wikipedia is much different from the movie, and I'm curious as to which way the miniseries goes.  It is also true that I find Kate Winslet an inherently more sympathetic figure than Joan Crawford, and I'm looking forward to finding out how that shapes my perception of the story.  The fact is, I don't like Joan Crawford and never much have.  I dislike Veda in this even more, but as far as I'm concerned, the whole lot of them could go crashing into the ocean.  This is not an attitude to take into a movie.",
            "review_date": "2011-08-24",
            "source": "rt"
        },
        {
            "content": "Great classic film noir!",
            "review_date": "2011-08-23",
            "source": "rt"
        },
        {
            "content": "A must-see! Mildred Pierce (Crawford) is being questioned by the police after they find her husband (Scott) dead, in her house. As she explains the events leading up to the fact, we find out that throughout her life as a mother, her oldest daughter Veda (Blyth) has ruled it, and Mildred had tried to impress her. But Veda has remained ungrateful until finally they are estranged. Still, this murder brings them back together. Who murdered this guy? Mildred or Veda? \"Mildred Pierce\" has been known to not only be Joan Crawfords best movie, but her huge comeback. From 1939 to 1944, Crawford had been named box office poison, which had really damaged her career. By the time this movie was in production, people had thought of her as a has-been and her career was pretty much over. At the point of casting, nobody wanted the role because the character Mildred Pierce had a teenage daughter and was over 40, and all of the leading actresses were too vain to accept that they were finally past the young love interest phase. So, the final two ended up being Barbara Stanwyck and Crawford. Curtiz chose Joan (though was leery at first), which was a great decision-- they not only worked great together, but they made many more movies as a team. Curtiz direction is absolutely flawless here-- he blends film noir and soap opera great, and keeps a balance between the two. And the fact that he had so many great actors at his aid helped a lot too. Joan of course is excellent (a lot better than Kate Winslet in my opinion), but Ann Blyth is really a standout. Blyth was only 17 at the time, and in fact, did get nominated for Best Supporting Actress. I'm sure she really wowed both the audiences and critics, because this really one of the best movie villains I've seen. She delivers her brutal lines with ice, and does not overact or seem unrealistic even once. Blyth almost upstages Crawford, that's how good she is. \"Mildred Pierce\" is a super film, and is a must-watch in my book.",
            "review_date": "2011-08-18",
            "source": "rt"
        },
        {
            "content": "(Four out of 4 stars.)  because it just blows u away with how great it is.  Clicks on all cylinders.  And Joan Crawford's shoulder pads are awesomely fierce.  Or perhaps they're just really her shoulders.?",
            "review_date": "2011-08-07",
            "source": "rt"
        },
        {
            "content": "LOVE this movie! Joan Crawford was born to play the title role. Anyone who's thinking about having kids just so someone will take care of them in their old age better watch this and quick...!",
            "review_date": "2011-08-06",
            "source": "rt"
        },
        {
            "content": "Clear why Joan Crawford won the Academy Award for best actress, stunning, performance.  Turned out to be a great date movie!",
            "review_date": "2011-07-31",
            "source": "rt"
        },
        {
            "content": "a great film noir with the amazing joan crawford. its dark, sleezy, kind of over the top, but still so much fun all the way. mother and daughter relationships are never easy. watch out for that snappy dialogue! oh, just slap her! yeah... good good :)",
            "review_date": "2011-07-25",
            "source": "rt"
        },
        {
            "content": "A amazing classic film noir.",
            "review_date": "2011-07-20",
            "source": "rt"
        },
        {
            "content": "Classic Joan Crawford, and far better than the recent HBO mini-series remake.",
            "review_date": "2011-06-23",
            "source": "rt"
        },
        {
            "content": "I still like this Version better than the recent Mini-Series with Kate Winslet, who I adore.Joan Crawford is so Elegant, even as a Waitress, & Eve Arden is always a treat as Second Banana.",
            "review_date": "2011-06-12",
            "source": "rt"
        },
        {
            "content": "Joan Crawford is excellent in the title role.",
            "review_date": "2011-05-27",
            "source": "rt"
        },
        {
            "content": "I had no idea what to expect from this film. I was pleasantly surprised by a strong sense of film noir. Visually playful, bordering, but never crossing, the line into kitsch. The entire cast is brilliant; I particularly liked the comedic turn given by Eve Arden.",
            "review_date": "2011-05-27",
            "source": "rt"
        },
        {
            "content": "In general, I think the \"noir\" and \"detective\" atmosphere of the movie was interesting and very well-done. I also like the relationship between the mother and the daughter with a mother too much in love with her daughter but a daughter so selfish and arrogant. Very good movie.",
            "review_date": "2011-05-22",
            "source": "rt"
        },
        {
            "content": "The quintessential Joan Crawford movie.  Damn good!!",
            "review_date": "2011-05-19",
            "source": "rt"
        },
        {
            "content": "Just not that terribly interesting.",
            "review_date": "2011-05-11",
            "source": "rt"
        },
        {
            "content": "Michael Curtiz was one of America's great filmmakers and Mildred Pierce is one of my favorite of his films. This melodramatic noir is beautifully lensed and the study of a mother sacrificing herself for the happiness of her sociopathic daughter is compelling.",
            "review_date": "2011-05-08",
            "source": "rt"
        },
        {
            "content": "Wonderfully portrayed by Joan Crawford, it's easy to see why Mildred Pierce as both character and film has been remembered so fondly over the years. Delivering a tale of class, family ties and horrendous snobbery, the narrative remains as engaging as it ever was thanks to director Michael Curtiz's authentic noir storytelling along with a host of fine performances, most notably from Oscar-winning Crawford and her on-screen daughter Ann Blyth who is brilliantly wicked as spoilt Veda.",
            "review_date": "2011-05-01",
            "source": "rt"
        },
        {
            "content": "Watching Joan Crawford in this iconic role, you can't help admiring her natural talent. She gives Mildred Pierce a soul. She's got an integrity and the spirit of a fighter. Compared to this version of the story, the latest mini-series with Kate Winslet starring as Mildred seems depressing and colorless.  Michael Curtiz's Oscar winning film is another original of unparalleled authenticity.",
            "review_date": "2011-04-30",
            "source": "rt"
        },
        {
            "content": "far better than the recent HBO miniseries in my humble....builds the characters tremendously well towards a surprising climax....very dated, of course, but what good film...Joan Crawford had ice in her veins....the whole cast is wonderful",
            "review_date": "2011-04-23",
            "source": "rt"
        },
        {
            "content": "A film noir at its best. Joan Crawford at her best winning an Oscar, This was a great murder mystery that gets even better with the performances and storytelling. Crawford is such a strong woman, but when it comes to her daughter, she lets her control her. It's a mother who desperately tries to hold on to her only daughter after the younger one dies. For someone as successful as Mildred, her personal life is pretty screwed up. This leads to an ending that is worth the wait and a stating that women can rock just as hard as the men. \r\n\r\nGrade: A-",
            "review_date": "2011-04-17",
            "source": "rt"
        },
        {
            "content": "My favorite melodrama.",
            "review_date": "2011-04-09",
            "source": "rt"
        },
        {
            "content": "Great Dialogue. Amazing acting. Interesting story. and the lighting......extremely dramatic and intense. Joan Crawford was an amazing actress of her time and she showcases her talent in this picture.",
            "review_date": "2011-04-07",
            "source": "rt"
        },
        {
            "content": "classic movies are really great. this one was fantastic! ^_^",
            "review_date": "2011-04-04",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies.  Want to see how women can play and get played, watch this and take notes.  Acting, story, direction, production - terrific.  As current as any movie from that time period can be.  I can see why HBO would do a remake but I was hoping it would be an update.  Watched both Sunday and thought they were both great but Joan Crawford owns this role.",
            "review_date": "2011-03-29",
            "source": "rt"
        },
        {
            "content": "Thought I'd check out the original before watching the HBO mini-series.  Glad I did.",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "Good classic film. Jack Carson great.",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "One of THE most interesting film noirs of the 1940s. Mildred was an incredible woman that awakened every emotion in the viewer thanks to Joan Crawford's Oscar winning performance. Ann Blyth also made us want to jump into our screens and slap her harder than her character's mother did =)",
            "review_date": "2011-03-27",
            "source": "rt"
        },
        {
            "content": "Even Marco reluctantly got sucked in!",
            "review_date": "2011-03-27",
            "source": "rt"
        },
        {
            "content": "I never saw this before last night!  It was really good!  Love Joan Crawford - what a class act.",
            "review_date": "2011-03-27",
            "source": "rt"
        },
        {
            "content": "An epic parade of delicious dread. Top-drawer crime melodrama.",
            "review_date": "2011-03-26",
            "source": "rt"
        },
        {
            "content": "Next time my mother complains about something I do, I'm going to refer to this movie. Seriously though, the performances were excellent. All the characters were vile human beings, but that didn't make me any less drawn in. I definitely figured out part of the twist at the end, but I don't want to ruin it for anyone else by saying what.",
            "review_date": "2011-03-21",
            "source": "rt"
        },
        {
            "content": "At times, the meoldramatic aspects cause serious harm to the film ( that irritating score). Luckily Joan Crawford and Ann Blyth gave wonderful performances that make us forget about such elements. An intriguing movie with great acting. Crawford won an Oscar for this film. She deserved it.",
            "review_date": "2011-03-12",
            "source": "rt"
        },
        {
            "content": "Mildred Pierce is one of Curtiz's masterpieces alongside Casablanca. It is a little melodramatic but nonetheless a great film noir if not one of the best. Joan Crawford gave an excellent performance as a mother. Actually more like a milf.",
            "review_date": "2011-03-06",
            "source": "rt"
        },
        {
            "content": "I'm not exactly sure why Mildred Pierce (Joan Crawford) feels compelled to live an unhappy and miserable existence just to try (and fail) repeatedly to please her spoiled social-climbing daughter Veda. But she does. From a divorced waitress, to a restaurant owner of a successful chain, and  then back to boderline penniless doormat we watch hopelessly as Mildred spirals downwards for 2 hrs. Her guilt is based solely on the premise that a child's happiness should always come first when parenting. Brilliant performance by Crawford. A depressing; yet entertaining film. Would like it for my own collection (if I can ever find it on DVD).",
            "review_date": "2011-03-02",
            "source": "rt"
        },
        {
            "content": "Fantastic noir/ melodrama.Visually, it's sublime: perfect lighting, wonderful camera movements, and masterful blocking. Joan Crawford is amazing in it.",
            "review_date": "2011-01-25",
            "source": "rt"
        },
        {
            "content": "Totally melodramatic, but it was JC's Oscar winner...and no one could widen those eyes like JC!",
            "review_date": "2011-01-22",
            "source": "rt"
        },
        {
            "content": "Fantastic acting.. kept me guessing.. Loved it!",
            "review_date": "2011-01-14",
            "source": "rt"
        },
        {
            "content": "A pivotal movie in the career of Grand Dame Joan Crawford, who had been a Movie Star, but her stock had fallen so dramatically that she hadn't acted in years, was kicked out by MGM, and had to do a screentest at Warner's to get this part. This film revived her career and did not just make her a Movie Star again, it turned her into an Actress, winning her an Oscar for the first time. \n\nJoan Crawford's long career is a rollercoaster ride of campily bad and outrageously good. Unlike actresses like Bette Davis or Katherine Hepburn who were in the first place concerned with Art (well, Art for a hefty pay-check most likely, but still), Crawford was mostly concerned with looking good and glamorous. She plays very few \"unattractive\" roles, and in all but one (\"Whatever Happened to Baby Jane?\") she looks ridiculously stunning for the part. But with a strong hands-on director like Curtiz, and a part that starts her out as \"frumpy\" (though I'm sure Davis & Hepburn would have scoffed at Crawford's version of frumpy) and quickly lets her glam up, she does the most with it, curbing her usual abrasive style and broad-shouldered Mega-Crawfordness (not easy to take for everyone, but I rather like it, in good movies, it works, in bad ones, it's hilarious). Naturally, the famous legs get a lot of attention (again, only in \"Baby Jane\" did the director manage to convince her that a cripple would not have her legs and that piece of flattery, barely, got her to keep her robe on), and no one can deny that the 41year old gams of Miss Joan could run circles around many a teenager's.\n\nRevelation of the film is actress Ann Blyth, who at only 17, portrays the femme fatale Veda to the utmost spoiled & despicable perfection. The supporting cast is rounded out with able veterans, with Eve Arden standing out as saucy Ida. Whenever I see Arden in a film, I wonder why she wasn't given more starring roles (or if she was given them, why I haven't seen them) .\n\nTo sum up, \"Mildred Pierce\" admirably walks a fine line between domestic soap opera, romantic melodrama & Film Noir, and though it has its flaws, the tight photography & lighting, strong direction, and above all, stellar cast, make these easy to overlook",
            "review_date": "2011-01-13",
            "source": "rt"
        },
        {
            "content": "Joan Crawford shines as the powerful, driven career woman Mildred Pierce whose fierce ambitions for her daughter drive her further away. Excellent dialogue, a tense atmosphere, in true Curtiz fashion, and a classic smoky noir feel, Mildred Pierce is excellent.",
            "review_date": "2011-01-10",
            "source": "rt"
        },
        {
            "content": "A mother gives into the wishes & whims of her ungrateful daughter. Featuring superb Oscar-winning performance from Joan Crawford.",
            "review_date": "2011-01-10",
            "source": "rt"
        },
        {
            "content": "La Crawford was at a low ebb when she was cast in Curtiz' adaptation of James M. Cain's daring novel (daring as in Raymond Chandler dared him to write something other than detective yarns)  but revived her career with this tempestuous melodrama. Crawford eats up the role as if she were mad(e) for it, her own life as it was aptly mirroring the all-consuming obsessions of its titular heroine. Sparkling support is provided by a superb cast (most notably Jack Carson and young Ann Blyth) but it is the diva's show all the way. Extra stars for Max Steiner's devilishly dramatic score and some suitably noirish cinematography and lighting. Saturday afternoon movie top ten.",
            "review_date": "2011-01-05",
            "source": "rt"
        },
        {
            "content": "Delicious soap opera on human sacrifice and ingratitude of the highest order. Best seen in a Joan Crawford double bill with \"Mommie Dearest\". Divine.",
            "review_date": "2010-12-06",
            "source": "rt"
        },
        {
            "content": "\"Oh boy! I'm so smart it's a disease!\"",
            "review_date": "2010-12-04",
            "source": "rt"
        },
        {
            "content": "A triumph of fur-coated, well lit, sharp-tongued, hard-boiled womanhood.",
            "review_date": "2010-12-01",
            "source": "rt"
        },
        {
            "content": "This is a pretty messy film.  It's part mystery, part melodrama and part black comedy.  The mystery should be compelling but unfortunately it really isn't gripping in anyway.  The film gets too bogged down in the melodrama and we stop caring about who killed him even though we can guess failry early on.  Really disappointing.",
            "review_date": "2010-10-12",
            "source": "rt"
        },
        {
            "content": "Joan Crawford is the star of this one with great support from Ann Blyth and Eve Arden. A gorgeous picture with a great adapted screenplay.",
            "review_date": "2010-09-20",
            "source": "rt"
        },
        {
            "content": "This is Joan Crawfords middle age resurrection after her two year hiatus from the movies following her firing from MGM.  The role of Mildred Pierce not only won her the coveted Best Actress Oscar, but it revitalized her sagging career, at the age of 40 no less.  Her portrayal of woman so hopelessly devoted to her daughter that she literally throws her life away is perhaps, the finest performance of her prolific and esteemed career.  However, despite Crawfords commanding performance, Mildred Pierce essentially amounts to a two hour, uneven, melodramatic soap opera.  In fact, it was probably the inspiration for the modern soap opera.\r\n\tMichael Curtiz has always been an overrated director in my opinion.  Sure, he directed a few gems, but considering the abundance of films he directed, it was inevitable that a few of them would turn out well.  Ive always liked his establishing shots, choice of camera angle, and use of shadow.  However, he has never been able to get to the hearts of his characters in any of his films.  Its as if hes telling a story that he really doesnt fully understand.  He never received a screenwriting credit and that speaks volumes about his storytelling ability.  He would have been much more suitable as a career cinematographer.\r\n\tWhat is the story being told in Mildred Pierce?  To some extent it is a noir mystery, but the mystery plotline is fairly thin and transparent which is probably why so little of the film is actually devoted to it.  The broader picture that seems to emerge from the film is a running commentary on gender roles in America.  Early in the film we see Mildred the homemaker, and she appears to be both fulfilled and content in this role.  However, once her husband loses his job and begins an affair with a neighbor woman, Mildred becomes a single mom and has to provide for her two daughters.  In no time at all, she is a successful entrepreneur, but her unmitigated devotion to her daughter Veda proves to be her downfall.  Mildred enters into a loveless marriage with a playboy as a desperate attempt to give Veda the elite lifestyle she lusts for.  Both Monte (the playboy) and Veda prove to be nothing more than back-stabbing parasites, though, and Mildred is reduced to financial ruin.  The message here is that a woman cannot handle being the bread winner because her emotions will get in the way.  Mildred comes off as an enabler and is used relentlessly until there is nothing left.  \r\n\tAs far as the aesthetic qualities of Mildred Pierce are concerned, the setting feels inappropriate for the story.  The film has a dark quality which does not mix well with the ocean-side views.  Curtiz uses frequent wide-angle shots which encapsulate the scenic backdrops of many of the scenes, but they do not compliment the action well and feel out of place with the tone of the film.  The score is absolutely bombastic and in stark contrast to many of the scenes.  I dont believe composer Max Steiner bothered to watch the film before creating a score for it.  That being said, there are some positives to be taken from the film.  Considering the many rewrites that the screenplay went through, it is easy to see how the story became so jumbled and over-the-top, but much of the dialogue is strong.  And with the pitiful exception of Bruce Bennett as Mr. Pierce, the performances of the supporting cast are stellar.  Ann Blyth is absolutely ruthless as Veda and Eve Arden has excellent comedic timing and brings a lighter element to many scenes.  Yes Mildred Pierce is sort of like a trashy romance/crime novel on the screen, but it does boast some strong production values and excellent performances.  Its certainly not a film worthy of a Best Picture nomination, but it is entertaining and engrossing in a sleazy sort of way.",
            "review_date": "2010-09-15",
            "source": "rt"
        },
        {
            "content": "Joan Crawford, exquisita, como madre abnegada en un dilema moral. Se agradece el tono noir del filme y el impecable diseÃ±o de producciÃ³n. No puedo esperar a la versiÃ³n de Tod Haynes con Kate Winslet en el papel estelar.",
            "review_date": "2010-09-10",
            "source": "rt"
        },
        {
            "content": "What a fantastic movie, I loved it, the story is great and the actors are even better!  One of my favourite movies.",
            "review_date": "2010-09-05",
            "source": "rt"
        },
        {
            "content": "Joan Crawford works hard for the money but devotes it all to her spoiled rotten daughter. With all the noir trappings (murder, flashbacks, shadowy lighting, double-crosses). A desperate need for love pushes her beyond the pale?",
            "review_date": "2010-08-30",
            "source": "rt"
        },
        {
            "content": "\"You'll never be anything but a common frump whose father lived over a grocery store and whose mother took in washing.\" Another of the great noirs based on a James Caine novel. Joan Crawford earned an Academy Award and revitalized her career for her exceptional acting in this film as Mildred Pierce, a woman obsessed with satisfying her daughter's desire for an upper class lifestyle. A compelling murder mystery with strong visual noir motifs and excellent plot development, this film is an entertaining and classic film well-preserved by time.",
            "review_date": "2010-08-20",
            "source": "rt"
        },
        {
            "content": "Great film! Really looking forward to seeing more of Michael Curtiz's work!\r\n\r\nSide note: Ida is the coolest secondary character from a film noir yet.  So sassy, love her!",
            "review_date": "2010-07-31",
            "source": "rt"
        },
        {
            "content": "What is touted to be a \"definitive women's noir picture\" turns out to be a faux pas, a faulty Hollywood representation of a resilient, self-sacrificing mother. Despite Curtiz's prestige direction, this is a manipulative, melodramatic blunder that barely goes skin-deep. Crawford is as overrated as the film, and compared to other sterling, more complex women-centric noir pictures Double Indemnity and The Letter, Mildred Pierce pales in comparison.",
            "review_date": "2010-07-25",
            "source": "rt"
        },
        {
            "content": "Sometimes old hollywood films are unwatchable, because of their exaggerated characterizations.  Here we have another much hated unrealistic character, the daughter.  The film itself is well-made and well-shot, but the impossible situations just put me off.",
            "review_date": "2010-06-20",
            "source": "rt"
        },
        {
            "content": "the ultimate spoilt brat!",
            "review_date": "2010-05-31",
            "source": "rt"
        },
        {
            "content": "\"Personally, Veda's convinced me that alligators have the right idea. They eat their young.\"\n\nA man, who mutters the title character's name as his last word, is murdered at his beach house. The police pick up a woman named Mildred Pierce as she is the wife of the man who was murdered. She is then questioned by the police, and so ensues an extended flashback to what lead up to the murder of her husband. All is eventually revealed by the end, which includes tragedies, blackmail, and a daughter full of contempt for her mother. A pretty unpredictable ending as well.\n\nThis is a fantastic melodramatic film noir. Mildred Pierce is really well written with some excellent dialogue. Michael Curtiz's direction is fantastic and rivals his earlier masterpiece Casablanca. The b&w cinematography is exquisitely shot by Ernest Haller, who an Oscar for his work. The first and final scenes use shadows to great effect and the flashback scenes that take up most of the film are evenly lit but as the film progresses to the final scenes the shadows start to show more and more. The shadows even make it seem more like Mildred is the femme fatale of the story but the flashbacks reveal who the real femme fatale is, her ungrateful daughter Veda.\n\nJoan Crawford is terrific and gives her signature performance. She holds the film together from beginning to end and it is in the end that she really earned her statuette as she brilliantly portrays Mildred as a pathetic person who will give everything just to keep her daughter from living a good life. But while Joan Crawford does get the deserved attention for her brilliant performance the supporting cast is great as well especially the other two female actresses: Eve Arden, who steals her scenes as Ida, Mildred's help with the restaurant; and Ann Blyth as Veda, the evil wench of a daughter who fails to appreciate all of the trouble her mother goes through to make her spoiled life better.\n\nLike Casablanca, it blends different genres, this time around mixing the family drama and melodrama genres with film noir. And like Casablanca, it is deservedly hailed as a classic of cinema. Mildred Pierce is an exquisite piece of film. 10/10",
            "review_date": "2010-05-11",
            "source": "rt"
        },
        {
            "content": "Drama/film noir starring Joan Crawford about a mother who is willing to do everything for her daughter. A little too much, obviously. Good film with lots of great lines, but I will never understand why Joan Crawford won an Oscar for this.",
            "review_date": "2010-05-08",
            "source": "rt"
        },
        {
            "content": "DramÃ²n de los aÃ±os cuarenta , mezcla de drama y noir muy bien resuelto con una  Joan Crawford inolvidable, un clÃ sico.",
            "review_date": "2010-04-20",
            "source": "rt"
        },
        {
            "content": "A great film about mothers and daughters - see it then see Mommy Dearest",
            "review_date": "2010-04-19",
            "source": "rt"
        },
        {
            "content": "Great stuff, Crawford is amazing as the single mother doing anything she can to provide for her children, the eldest of which is an almost cartoonishly spoiled and ungrateful brat that you'll hate from the first time she opens her mouth.\n\nWell worth a look, give it a rental.",
            "review_date": "2010-04-13",
            "source": "rt"
        },
        {
            "content": "This melodrama qualified as Joan Crawford''s best movie and she won a Best Actress Oscar to prove it.",
            "review_date": "2010-03-24",
            "source": "rt"
        },
        {
            "content": "\"Casablanca\" director Michael Curtiz made another classic melodrama with \"Mildred Pierce,\" and actress Joan Crawford scored a major comeback with this tour-de-force soap opera about the rise and fall of a woman as an entrepreneur. Crawford had been dumped by Metro-Goldwyn-Mayer and picked up by Warner Brothers where she loitered for a couple of years before she found precisely the kind of role that she felt was ideal for her.  Initially, Curtiz wanted nothing to do with the high-handed Crawford with her padded shoulders.  The Hungarian-born workalcoholic Curtiz originally sought Barbara Stanwyck for the lead role, but he changed his mind about Crawford when he observed her aggressive work ethic.  Indeed, \"Mildred Pierce\" represents Crawford at her zenith, and she won her one and only Best Actress Oscar. Warner Brothers surrounded Crawford with a sterling cast including Anne Blyth as her snotty, stuck-up daughter Veda, Jack Carson as the fast-talking Wally Fay, and Zachary Scott as a dissolute womanizer with a closet filled with swim suits belonging to his many sisters. The theme of mother versus daughter stands above all others in this woman's film that depicts a woman struggling to succeed in life without a man and raise two daughters.  At the same time, the theme of women versus men hovers in the background.  Just as Mildred seems doomed to be a bad mother because she indulges her arrogant daughter's every whim, Mildred achieves no success with the men in her life. Zachary Scott is simply brilliant as a worthless playboy type who preys on Mildred like a leech and eventually robs her of every dime. Cast as Monte Beragon, Scott not only takes Mildred to the cleaners, he takes advantage of Veda.  Hollywood made several movies about tempestuous mother and daughter relationships, among them the Bette Davis soaper \"Now, Voyager,\" but \"Mildred Pierce\" ranks as the most memorable.  Producer Jerry Wald convinced studio boss Jack Warner to buy the rights to James M. Cain's novel, but the writers had to eliminate much of the sexual content because the Production Code Administration prohibited the kind of behavior that Cain portrayed in his book.  Such had been the case with previous cinematic adaptations of Cain's work, including \"Double Indemnity\" (1944) and later \"The Postman Always Rings Twice\" (1946).  \r\n\r\nWarner Brothers released \"Mildred Pierce\" in 1945, less than a year after World War II ended.  Although there are many references to the war in the film, such as Monte's crack about nylons being out when he pays a spot inspection visit to Mildred's diner, the filmmakers never make any overt references to the war. The setting is clearly in the early 1940s while the Allies were fighting the Axis Powers.  Never do we see any servicemen in uniform wander through the mise-en-scene.  Essentially, \"Mildred Pierce\" qualifies as a film noir.  Curtiz shoots virtually everything with shadows and the plot focuses on the death of a major character at the outset of the action.  Curtiz loved to tell stories in flashback and his Humphrey Bogart World War II thriller \"Passage to Marseille\" is related in flashbacks within flashbacks within flashbacks.  \"Mildred Pierce\" isn't as convoluted as the Bogart film and the mystery about who murdered Monte Beragon is what drives this black & white film forward.  After the opening sequence when unsavory Monte is shot and killed in cold blood at his house, the plot reverts to the past as Mildred recounts her life story to a detective. We learn that the marriage between Mildred and her real estate salesman husband Bert (for U.S. Olympic shot-put champ Bruce Bennett) is not congenial.  Mildred lives and breathes to please her two daughters, Kay (Jo Ann Marlowe of \"Dangerous Intruder\") and Veda (Ann Blyth of \"Brute Force\"), but she concentrates on Veda, at the expense of Kay.  Sadly, nothing that Mildred does for Veda ever pleases Veda and Veda winds up making life hell for Mildred.  Mildred usurps her role as a wife and Bert grows sick of her and has an affair with Mrs. Maggie Biederhof (Lee Patrick of \"The Maltese Falcon\") that leads to his divorce from Mildred. Mildred strikes out on her own, reflecting the success that women achieved in the workplace since most men had been mobilized for the work effort.  Indeed, Mildred becomes a seeming success story over night, owning and managing a franchise of restaurants with the help of her right-hand girl, Ida Corwin (Eva Arden of \"The Doughgirls\"), who delivers the choicest wisecracks. At one point, Ida observes about her relationships with men: \"When men get around me, they get allergic to wedding rings.\"  Later, she adds about the opposite sex: \"Oh, men. I never yet met one of them that didn't have the instincts of a heel. Sometimes I wish I could get along without them.\"\r\n\r\nAltogether, Mildred tries to act as the mother and the father and she winds up failing miserably.  Daughter Veda emerges as a villainous of the worst sort and her comeuppance is something that you enjoy watching her get. \"Mildred Pierce\" emerges as a very atmospheric movie and Curtiz never wears out his welcome, even when he shifts back and forth in time. For the record, there was no murder in the novel, but it occupies the centerpiece of \"Mildred Pierce\" and all the characters swirl around it.  \"Mildred Pierce\" is a brilliant example of top-notch filmmaking.  Don't miss it.",
            "review_date": "2010-03-24",
            "source": "rt"
        },
        {
            "content": "This is sort of a meh film for me! It has really good parts: the story is interestingly put together, the film in general looks good, Joan Crawford is really good (and deserving of her Oscar for this) and the girl who plays her daughter is such a psycho bitch I loved her! She was amazing! I just wanted to punch her! Or push her down the stairs! But otherwise... it just din't move me. Except for the daughter- I just dropped my mouth and shook my head! She's nuts!",
            "review_date": "2010-03-22",
            "source": "rt"
        },
        {
            "content": "They sure knew how to light movies back then.  But why did Crawford get an Oscar for this and not Ann Blyth?  I mean, come on.",
            "review_date": "2010-03-20",
            "source": "rt"
        },
        {
            "content": "Disappointing film noir with very uninteresting characters. The twist in the end was not so much a twist and quite predictable too. This one has aged badly.",
            "review_date": "2010-03-12",
            "source": "rt"
        },
        {
            "content": "Tout le monde connait Casablanca, mais Michael Curtiz a rÃ©alisÃ© un autre chef d'Åuvre moins connu, ce Mildred Pierce, film noir, occasion d'un portrait d'une femme puissante, divorcÃ©e et chef d'entreprise, qui sacrifie tout pour l'amour de ses enfants ingrats. Classique Ã  redÃ©couvrir.",
            "review_date": "2010-03-10",
            "source": "rt"
        },
        {
            "content": "It's a very compelling story and told in a unique way which works very well.  I felt so sorry for Mildred, Veda is such an ungrateful bitch!",
            "review_date": "2010-03-04",
            "source": "rt"
        },
        {
            "content": "Joan Crawford's best movie.  Very good plot and pitch perfect dialogue, with Crawford leading a good cast.",
            "review_date": "2010-02-28",
            "source": "rt"
        },
        {
            "content": "\"Mildred Pierce\" (1945) is a fantastic movie.  It starts with a bang, a man falling to his death and saying his final word, \"Mildred.\"  Joan plays Mildred, a working class mom who starts her own business and becomes a success all to provide for her daughter Veda, the most ungrateful child in cinema history.  Mildred , like many a parent, would do anything for her child.  But would she commit murder.  My mom picked this movie up for me and told me I'd love it, and she was right.  The film was nominated fotr Best Picture of the Year but didn't win. But Crawford did win the coveted Best Actress Oscar and she is fantastic in it.  Joan, to me, was always a little overthe top, but here she is utter perfection.  This classic Warner Brothers release has a fantastic cast including Eve Arden and Ann Blyth (Best Sup. Actress nominations), Jack Carson, Zachery Scott,and Bruce Bennett.  This is one of those \"They don't make 'em like that anymore' movies and would make a fine addition to any serious film collectors library.  It was written by James M.Cain, the writer of \"The Postman Always Rings Twice\" and directed by the great Michael Curtiz.  Trivia Bit: If you've seen \"Mommie Dearest\"and believe it, Joan faked being sick the night of the Oscars because she was afraid she would lose, but had reporters waiting by her door, to get her acceptance speech from her bedside. Don't miss this one because it has Joan's finest performance and proves what a wonderful but underrated actorJack Carson was. r",
            "review_date": "2010-02-15",
            "source": "rt"
        },
        {
            "content": "Now this is what I call a brilliant film. The forshadowing at the beginning is great and there are several twists in determining the murderer of a man in beachfront home. Joan Crawford deserved her Best Actress award for her role. The most prominent part of the film that strikes at me is when Mildred (Crawford) gets a job as a waitress. I love how she struggles for the first couple weeks and becomes a great waitress at the restaurant. What makes the film more interesting is when Mildred launches a restaurant chain named after herself, where her first location is from an old house along the highway. She seems know many accounting principles and marketing concepts and becomes a powerful business woman when running her restaurant, eventually involving into a chain. Yet at the same time, she has to deal with the troubles of her daughters. Brilliant film!",
            "review_date": "2010-02-14",
            "source": "rt"
        },
        {
            "content": "*** (out of four)\r\n\r\nOne of Joan Crawford's definitive roles for which she one a Best Actress Academy Award.  The film is made mainly to appeal to women, but it certainly is well-done enough for everyone to enjoy.\r\n\r\nJoan Crawford is Mildred.  She has been accused of the murder of her former husband.  Told in flashbacks, Mildred's relationship with her oldest daughter becomes the center of the picture and the question arises as to what Mildred would do to protect her spoiled child.",
            "review_date": "2010-02-10",
            "source": "rt"
        },
        {
            "content": "I love film noir but I prefer something like Double Indemnity over this. Veda made me so furious and I can't help thinking that I might know some people like her. Eve Arden as Ida Corwin was undoubtedly my favorite character of the entire film and made it worth watching. The rest of the cast I am indifferent to for the most part except Veda of course, but who could feel anything but repulsion for her?",
            "review_date": "2010-02-08",
            "source": "rt"
        },
        {
            "content": "King Leo Front Row Center review\nhttp://kol-frontrowcenter.blogspot.com/2010/01/mildred-pierce-1945.html\n|W|",
            "review_date": "2010-01-30",
            "source": "rt"
        },
        {
            "content": "A great and quite tragic tale of a mothers love and toil to fulfill that love set into a taught noir thriller with a great and quite satisfying twist of an ending.",
            "review_date": "2010-01-06",
            "source": "rt"
        },
        {
            "content": "This was a really good movie told in flashback. It was kind of obvious where it was going, but I HATE the daughter in this and seeing it all play out just makes you feel like it's all justified. This poor lady worked her ass off and just had a bunch of really flawed people around her.",
            "review_date": "2010-01-05",
            "source": "rt"
        },
        {
            "content": "In my opinion, it's Joan's greatest film. It's a fantastic stoty of noir and melodrama about a woman struggling to provide luxury for her spoiled daughter. The charachters are great and one cannot look away from the screen and the film is overall a masterpiece.",
            "review_date": "2009-12-29",
            "source": "rt"
        },
        {
            "content": "This movie is just wonderul. I hated Joan Crawford after seeing \"Mommie Dearest\" but, this movie made me completely forget about that and renewed the Crawford fan in me. And Ann Blyth gives a standout performance as Veda. She was so believable, throughout the film I just wanted to punch her square in the face for what she was doing. I mean, pretending to be pregnant for some money? How cold can you be? Anyway, it's just a steller movie with a steller cast and should be viewed by every adult man and woman.",
            "review_date": "2009-12-21",
            "source": "rt"
        }
    ]
}