{
    "rating": 7.9,
    "release_date": "1945-01-25",
    "num_reviews": 91,
    "genres": [
        "English"
    ],
    "summary": "Famous retired detective Nick Charles (William Powell) takes his wife, Nora (Myrna Loy), and their dog, Asta, to visit Nick's parents in their small, quiet town. Determined that Nick's father respect Nick's profession, Nora urges him to find a crime to investigate, unaware that Nick's presence has already frightened spy Edgar Draque (Leon Ames) into action. After Nora buys a painting for Nick's birthday and the artist is murdered, Nick discovers that the murder is connected to espionage.",
    "reviews": [
        {
            "content": "A neat departure from the high crimes of the big city.\n\nDirector Richard Thorpe's romantic-comedy mystery The Thin Man Goes Home (1944) is quite fun as Thorpe emulates the fast pace and whimsical humor of The Thin Man's director W.S. Van Dyke's style from the first four Thin Man movies. It's a shame Van Dyke commited suicide before finishing his series, but Thorpe takes on the challenge with a neat small town whodunit. I liked how writers Harry Kurnitz, Robert Riskin, and Dwight Taylor create a serious story about hidden clues in plain sight. I really enjoyed the painting bit and how it's all about Nick getting acceptance from his father over his career path as a detective instead of a doctor.\n\nWilliam Powell is as funny as ever as detective Nick Charles. He gets a neat hesitancy around his tough father, played by the stern Harry Davenport. Myrna Loy is lovable as the curious, eager, and adventurous sleuth Nora Charles. She's simply divine and hilarious. Nora is a wonderful heroine and lovable wife figure for Nick, while being her own unique character trying to defend Nick to his father.\n\nLucile Watson is fun as Nick's enthusiastic mother. Gloria DeHaven gives an entertainingly over the top performance as Laurabelle Ronson. Anne Revere is touching as the mentally touched Crazy Mary. Helen Vinson is fun as the shady Helena Draque. Leon Ames is excellent as Edgar Draque, desperate to recover a painting. Donald Meek has a hysterical role as the painting salesman. Asta Jr. is wondrous as the wonder dog Asta with all his tricks and excitement.\n\nEditor Ralph E. Winters cuts The Thin Man Goes Home like  dark film noir. Karl Freund's cinematography makes this small town look like a dangerous place full of shadows. Art direction from Cedric Gibbons and Edward C. Carfagno uses brightly lit town views to juxtapose the dark and moody nights full of creepy shacks and shadows scattered all over. Edwin B. Willis' set decoration creates a charming home for Nick's parents and a lavish estate full of ornate furnishings for the Ronsons.\n\nComposer David Snell's music is very playful and captures that whimsical comedy tone with the tense melodies for the darker mystery atmosphere. I loved Irene's costumes for Myrna Loy with exquisite dresses and creative patterns. Her style is very different from the other Thin Man movies.\n\nIn short, The Thin Man Goes Home provides 101 minutes of pleasant comedy and intriguing mystery that keeps you on your toes.",
            "review_date": "2022-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the first two, the third not so much. This one, however, worked out fine, even if Nick drank nothing stronger than cider. (Though apple cider comes in both alcoholic and nonalcoholic versions.)\n\nNick brings Nora to Sycamore Springs, the rural town he grew up in, and visits his elderly father and mother. The father is a prominent local doctor who was disappointed that his son chose to become a policeman instead, though Nora responds by telling them what a wonderful detective Nick is-to Nick's embarrassment. Word spreads through town of Nick and Nora'a arrival, and the locals assume they are here to work on a criminal case. Of course, Nick and Nora only came for social reasons-until a man visits the father's house and is shot to death when the front door is answered. Now the pair have a crime to solve.\n\nUnlike the previous installments, Asta is helpful this time, and Nick sticks to cider and no longer smokes. The movie was made at the tail end of World War Two, and of course the war effort is a large part of the mystery. And the suspects are more obvious than usual. At least not as convoluted as the third movie.",
            "review_date": "2021-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this series and thanks to TCM, I was able to watch the complete series in order! What a treat!",
            "review_date": "2020-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good entry in the series.",
            "review_date": "2018-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed it, but there are scenes of Nick spanking Nora, and Nick being not nice in general, which make 21st century me cringe.",
            "review_date": "2016-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the 5th film in the \"Thin Man\" series, and though I enjoyed it, it's not as strong as some of the earlier films.   Powell and Loy have great chemistry and it's fun watching them together.  The formula for these films was well established by this point so there wasn't much surprises anymore, but there was a comforting factor to them  Worth checking out for fans of classic cinema.",
            "review_date": "2016-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "William Powell visits his hometown with wife Myrna Loy, and would you guess that Nick and Nora get caught up in another murder mystery? I suppose you can give the film points for mixing things up a bit, but I do prefer to see Nick & Nora swapping witty banter in Manhattan nightclubs rathe than being witty over picket fences in Sycamore Springs. This entry into the series clearly acknowledges that no one is going to these films for the mystery and are going for the comedy, because this film has significantly more humor than the prior films, which is not a bad thing, but that coupled with the drastic change of setting made this feel less like a Thin Man film and more just like another Powell/Loy vehicle. Still, it's hard to not love anything where Powell and Loy are doing comedy and charming witty banter.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this film last, despite it being the fifth film. Maybe that was a good thing. The movie's resolution with Nick's father, and the hilarious antics of his childhood home are all brought to hilarity in this installment. I don't really recall the big plot, but it was entertaining.",
            "review_date": "2015-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the 5th film in the long-running series, William Powell and Myrna Loy (as Nick and Nora Charles, created by Dashiell Hammett) head up to Saratoga Springs to visit Nick's parents and boyhood home.  Their double act is still amusing and lackadaisical but this time there is a great deal of obfuscation around the mystery - you couldn't solve it yourself (which I guess makes Nick Charles seem even more astounding).  Like many other films in this genre, all of the suspects end up in the same room at the end where Nick can surprise one of them into confessing.  However, this time Myrna Loy provides some meta-commentary about how all of Nick's cases always end up in this way - it's a bit more self-reflexive than I expected but when you are on film 5, I guess this is where your thoughts go.  Nothing wrong with this as a genre picture, although the two leads could act circles around the rest of the cast (save perhaps Asta).",
            "review_date": "2015-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another winner, this fifth film in the classic comedy detective series, this time with a new director at the helm in Richard Thorpe. It's good that they chose a different angle, in having Nick the prodigal son returning to his hometown and visiting his parents. The ending is quite touching.",
            "review_date": "2014-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nick goes home and finally introduces the wife to his boyhood haunts. Unfortunately his reputation, before & after growing up, precedes him. Several great moments and a decent attempt at red herrings, but this one doesn't quite fire on all cylinders. Though it's nice to see Nick outperform Nora in the hammock scene.",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific , great chemistry , funny and suspenseful!!! Great Saturday morning fare ;)",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just like the fourth entry (Shadow of the Thin Man), this fifth entry is one of my least favorites, though I give credit for changing things up in terms of the setting. It is still a decent murder/mystery with a few laughs, though the formula is showing its rust.\n\nGrade: B-",
            "review_date": "2013-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the gang's all back 4 #5 in this series oh except the director w s van dyke.",
            "review_date": "2012-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A strong position in the series, mostly due to a change of the environment  - from the crowded and urban New York to a small town, where nothing exceptional never happens (of course until the Charles family shows up). There is less drinking, or actually no drinking whatsoever (that's probably a good thing), and the whole mystery seems more intriguing than most of the previous ones. Than there is Nick's ongoing struggle, in order to prove to his father that he's more than just a regular detective. A fine installment, with an international intrigue that changes the locals into ruthless gun-carrying bandits.",
            "review_date": "2012-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my favourite thin man movies.",
            "review_date": "2012-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another madcap adventure with Nick and Nora Charles and Asta but in my opinion, not quite up to the standard set by the earlier films.",
            "review_date": "2012-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a slight improvement on the previous installment, as the humor surrounding the relationship with Nick's parents is consistently enjoyable. Otherwise, we get little variation from the pattern of these films, which work for what they are: enjoyable and increasingly disposable films that offer a few laughs, some intrigue, and a sweet marital relationship at the center of it all.",
            "review_date": "2011-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My personal favorite of the series. Nick & Nora Charles at there best!",
            "review_date": "2011-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Thin Man has sorta thinned out by it's forth entry but it still has it's charms especially the interaction between William Powell & Myrna Loy.  I think that is what kept this series alive.  This time out Powell is visiting his parents when someone is murdered on their front step & he must figure out who did it & why.  It's the same formula as Powell investigates, gets his suspects together @ the end & reveals the motive.  Fans of the series will find more of the same to like but I didn't find it nearly as good or enthralling as the original but it doesn't discourage me from watching more of the sequels.  I just didn't find Powell as charmingly drunk.  Sure he drinks a lot cider but it doesn't have quite the same effect.  Actually that sorta makes me thirsty for some cider; I should go down to the pub & have a pint..maybe a Snakebite (cider & Jagermeister)",
            "review_date": "2010-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "False motherhood can't replace Christmas.",
            "review_date": "2010-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another good, fun, and humorous sequel to the Thin Man.",
            "review_date": "2010-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My fav of all the Thin Man. Best cast by far.",
            "review_date": "2010-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The attempt to shake up the series' status quo isn't bad by any means, but compared to the previous films, moving the mystery to small town America and forcing Nick to stay sober throughout takes some of the sparkle and edge out of the movie. Nick & Nora remain brilliant though, keeping this mistep from becoming tiresome.",
            "review_date": "2010-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it starts out a bit slow and with forced humor it soon finds its pace and becomes yet another enjoyable Thin Man movie.  While the mystery isn't as good as the previous films the humor is great and though the witty banter is lacking more the slapstick is hilarious.  We meet Nick's parents this time and Nick wants to solve a mystery to impress his dad.  While the mystery is decent it isn't the focus of the film but rather the humor is which is a bit disappointing but the film still holds its own.",
            "review_date": "2010-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Thin Man Goes Home (1945)\n\nThis is the fifth in the Thin Man series of mysteries.  There's no Nicky Jr. in this film.  This time, Nick and Nora Charles (William Powell and Myrna Loy) are taking the train to see Nick's parents Dr. Bertram Charles (Harry Davenport) and Mrs. Charles (Lucile Watson) for Nick's birthday.\n\nNick is very much on the wagon on this trip (only drinking cider) although nobody believes him.  Naturally, the whole town suspects that Nick is in town on some big case, which Nora neither can confirm or deny.  Everyone seems to be impressed with Nick but his Dad, who Nick would love to get one, \"At-a-boy!\" from.\n\nWhile in the family home, a boy comes to the front door, and not long after he starts talking to Nick, he's shot in the back.  Naturally, Nora wants Nick to track down the murderer and try to impress his Dad.\n\nEdward Brophy returns, only now, as Nick's friend, Brogan.  He was Morelli in the original Thin Man movie.  Anne Revere, Gloria DeHaven, Donald Meek, Leon Ames, as well as many other familiar faces are in this movie.  There was even a quick walk-on part by Mike Mazurki as a guy in the barber shop wolf whistling at Nora.\n\nIf you're a big fan of the Thin Man series, you've got to love this one too.",
            "review_date": "2010-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another fun installment with william powell and myrna loy as nick and norah charles in the thin man series. powell and loy are always fun to watch.",
            "review_date": "2010-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Thin Man Goes Home is the fifth Thin Man film and it's evident the series is running out of steam.  There's a whole lot more slapstick and puppy comedy involving the dog, but the \"mystery\" involving a mysterious painting and of course, a couple of murders is just sort of background side story.  I know the Thin Man series relies on the humor and chemistry generated by Loy and Powell, but there also have to be situations that are humorous too.  Here, the situations are straining to be funny, but don't quite live up to the previous films.  Some of the things the super-sleuth uncovers seem far-fetched, even for a Thin Man movie.  Possibly the weakest of the Thin Man movies.",
            "review_date": "2010-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Thin Man Goes Home is the fifth Thin Man film and it's evident the series is running out of steam.  There's a whole lot more slapstick and puppy comedy involving the dog, but the \"mystery\" involving a mysterious painting and of course, a couple of murders is just sort of background side story.  I know the Thin Man series relies on the humor and chemistry generated by Loy and Powell, but there also have to be situations that are humorous too.  Here, the situations are straining to be funny, but don't quite live up to the previous films.  Some of the things the super-sleuth uncovers seem far-fetched, even for a Thin Man movie.  Possibly the weakest of the Thin Man movies.",
            "review_date": "2010-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Charles' head to his hometown to relax, only to get caught up in a murder mystery (as is their custom), during which Nora desperately tries to impress on her father-in-law just how good her husband is as a detective, since dear old dad has always seen him as a layabout..\n\nThey ditched the kid (\"He's in kindergarten, we didn't want to take him out of school\") in favor of giving us Nick and Nora sleuthing free of a diaper bag, but having Nick sober loses some of the character's flavor.\n\nWorth a rental.",
            "review_date": "2010-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So far, the most weakest Thin Man film (I havent seen the last one yet). Powell is fine. but Myrna Loy looks distracted this time out and disinterested. No wonder, as the plot beyond the murder. with Nick and Nora's intereactions this time out is weak, lots of sloppy filmmaking, somewhat overuse of Asta and the fact they disniss the kid at the beginning of the film (\"He's in Kindergarten, we didnt want take him out\") are all evidence of poor film planning on the producer's part. The murder mystery part is still good though.",
            "review_date": "2009-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best in the series for sure.  strays from the formula enough to keep things interesting.",
            "review_date": "2009-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In some ways this is my favorite of the Thin Man movies. Which is weird because it does feature a couple stupid moments with the dog.  But mainly, I think it's because it takes the Nick and Nora we've already met and puts them in a situation completely foreign to them: a small town.  Specifically, Nick's home town where he has almost as bad a relationship with his father as he does with his in-laws.  It is fun getting to see the sophisticated duo interact with the people of a town like Mayberry or Bedford Falls.  And the murder-mystery is about as good as that in any of the other movies, if more light and friendly feeling with less seedy characters.",
            "review_date": "2009-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first ones, but still fun!",
            "review_date": "2008-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Nick and Nora Charles (Powell and Loy) are vacationing in the small town where Nick grew up, a man is assassinated, literally in the doorway of the home of Nick's parents. Nora thinks this is a perfect opportunithy for Nick to show his father he isn't the drunken lout he believes him to be, and she pushes Nick to investigate the crime.\n \n[center][i][img]http://www.geocities.com/nuelow/movthinmanhome2.jpg[/img][/i][/center]\n[center][i]Nick and Nora Charles (William Powell and Myrna Loy) return [/i][/center]\n[center][i]for more murder and mirth in \"The Thin Man Goes Home\"[/i][/center]\n \n \n\"The Thin Man Goes Home\" is a change of pace and scenery for the classic \"Thin Man\" series of comedy-mysteries. Instead of being set in the swanky rooms of the wealthiest in America's largest cities, it takes place among the rich and powerful citizens in a picturesque small American town... and they are revealed to be every bit as vicious and self-centered and potentially evil as their supposedly more urbane counterparts.\n \nThe mystery in this film is more multi-faceted and involved than the one Nick was confronted with in the installment of the series immediately prior to this one (\"Shadow of the Thin Man\", [url=\"http://www.rottentomatoes.com/vine/journal_view.php?journalid=245672&entryid=544588&view=public\"]review here[/url]), making the film more interesting. The jokes and physical humor in this film are also funnier and more finely honed than they've been since the first movie in the series, making this the best sequel since \"After the Thin Man\", [url=\"http://www.rottentomatoes.com/vine/journal_view.php?journalid=245672&entryid=539809&view=public\"]review here[/url]).\n \nAnother difference in the film is that Nick actually solves the multiple mysteries that are tangled together in this film stone cold sober! Nick doesn't touch a drop of alcohol for the entire movie, because he is trying to impress his father (and also because in 1944, liquor was being rationed due to the war effort).\n \nWhat is the same, however, is the wonderful onscreen chemistry between William Powell and Myrna Loy, and the continued portrayal of the pefect married relationship shared by the Charleses. I really can't think of an on-screen married couple that are as fun as these two and the back-and-forth between these two characters are as important to these films as the mysteries. (Relationship highlights in this film include a fun exchange over Nora's failed attempt to set up a lawnchair; Nora buying a birthday present for Nick thinking it is tied to fond memories and later discovering that she didn't get the full story when it came to his childhood reminicing; and Nick stranding Nora at a charity dance with a jitterbugging sailor so he can go on an investigation. Actually, the scene at the charity dance is one of the highlights of the entire Thin Man series!)\n \nIt maybe nearly 65 years since \"The Thin Man Goes Home\" was made, but the humor is still fresh and story is as good, and even better, than the vast of majority of films that have been made since.\n \n \nThe Thin Man Goes Home\nStarring: William Powell, Myrna Loy, Harry Davenport, Lucile Watson, Gloria DeHaven, Edward Brophy, Lloyd Corrigan, Helen Vison and Leon Ames\nDirectors Richard Thorpe and Norman Taurog",
            "review_date": "2008-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of the THIN MAN movies.",
            "review_date": "2008-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At last i have now seen them all - and good though this is, it doesn't quite hit the heights of some of the earlier instalments. Maybe a few too many characters in this one, but the ready wit is as evident as ever!",
            "review_date": "2008-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The couple tries to regain their chemistry but it's already flailing. Good try though.",
            "review_date": "2008-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as many perfect one-liners, but still lovely chemistry and the maid is great.",
            "review_date": "2008-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best in the series, but still a humdinger!",
            "review_date": "2008-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best of the sequels.\n\nMyrna v. Lawn Chair...book it.",
            "review_date": "2008-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my personal favorites in the series. My favorite scene being the one where Nick's father sees him laying face down with a flask of cider.",
            "review_date": "2008-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was certainly a good fifth film, but had the odd spot that was a bit flat, especially at the start. But it kept the film series going and is enjoyable. Now I only have one more to see in the series.",
            "review_date": "2008-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst of the series.  The humor is not on the level of the other films in the series, and the plot goes nowhere for the first half hour of the film.",
            "review_date": "2008-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another good thin man movie\r\n\r\nBest Detective movies ever",
            "review_date": "2008-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best of the thin mans!",
            "review_date": "2008-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So far I think this might be the least interesting, but there is some cute romance between them.",
            "review_date": "2008-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kitsch at its greatest fast-talking sassiness.",
            "review_date": "2008-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nick and Nora are at it again. Fun film.",
            "review_date": "2008-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great banter between them and real chemistry.  Love all in the series!",
            "review_date": "2008-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thoroughly enjoy the Thin Man series. What a great cast as well.",
            "review_date": "2008-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yay, I love The Thin Man series.",
            "review_date": "2007-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love these old black & whites!  I couldn't even list them all....",
            "review_date": "2007-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[b][img]http://i17.photobucket.com/albums/b76/Linko05/MovieCovers2/ThinManGoesHome.jpg[/img]\n                 The Thin Man Goes Home (1945)[/b]\n  \n This is probably the worst of the first five movies but just a notch below the revered original Thin Man. A lot of the humor that was so effective in the previous movies were taken out because of the war.",
            "review_date": "2007-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a good movie, and quite funny, but it reminded me of a tacky mystery novel I read once. I also don't like the disregard for human life. For instance, when they find one of the characters dead, all they do is seem shocked and then move on with the story. No one wept for that character, and I don't think the importance of life should be pushed aside so easily.",
            "review_date": "2007-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the entire series, but this is one of my favorites.  It's terrific to see Nick and Nora take their NY sophistication to the small town where they \"knew him when.\"  The scene where he naps (or tries to nap) in a lawn chair is a hoot!",
            "review_date": "2007-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My oldest daughter and I love all of the Thin Man movies.",
            "review_date": "2007-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Works, but definitely different, and not always in a good way.  Still fun.",
            "review_date": "2007-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was soooo funny! And well made for an older movie!",
            "review_date": "2007-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched all the Thin Man movies within a few days, so I pretty much think of them as one big unit.  So my ratings of individual sequels aren't any reflection of that particular film.",
            "review_date": "2007-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good to see them attempt to sober up some...Myrna Loy is a sassy wife and Asta is a such a punk!",
            "review_date": "2007-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The thin man series are the coolest! I love Powell and Loy!",
            "review_date": "2007-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyed it greatly, but not as good as their previous work.",
            "review_date": "2007-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a classic movie such a great film",
            "review_date": "2007-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the lot. Lucile Watson should've been cloned so there's always one of her in every generation.",
            "review_date": "2007-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's about time we met Nicks parents and it was a real switch when Nick started to drink cider. Weird!",
            "review_date": "2007-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is this the one with the painting? I love this movie!! I do love the classics!",
            "review_date": "2007-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite one. It's the only one he doesn't drink in also.",
            "review_date": "2007-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not too bad considering this was the 5th in the series and actually its preety good. Only problem with it is I watch it too much",
            "review_date": "2007-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah, Nick and Nora.... this series started my love affair with Martooni's ....",
            "review_date": "2007-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a sucker for the thin Man series.",
            "review_date": "2007-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There comes a point when you ask why the movies still have Thin man in the title.",
            "review_date": "2007-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nick stops drinking and still solves the case.  cheers, michael!",
            "review_date": "2007-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sort of the Thin Man series meets the Andy Hardy series.  Good studio fun.\r\n  \r\n\"Nick, you have to do something... and that's not it!\"",
            "review_date": "2007-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely adore this movie, best movie quote ever: \"stinky was a cripple and he couldn't navigate\"",
            "review_date": "2007-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I go back to the Thin Man time and time again. The best actor pairing I've seen- with great chemistry.",
            "review_date": "2007-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They just kept on making these movies happen.",
            "review_date": "2007-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Different to the others but I liked it all the same!!",
            "review_date": "2007-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the Thin Man movies. Seriously considered naming the Katester - Asta...",
            "review_date": "2007-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great installment and one of the best of the Thin Man series. A lot better than you'd expect considering this is the fifth in the series and a different director is at the helm. No kid involved but we meet Nick's parents, namely his passive-aggressively disapproving father. Not a drink is served throughout the entire movie and because of that you're expecting The Thin Man Goes Home to suck, which strangely enough never happens. The Thin Man Dries Out. There are a lot of funny moments, namely Nora's delivery of the Stinky Davis case which is easily one the best moments in the entire series. Even if you're not a big fan of the series you should check it out. It's a perfect blend of screwball comedy and detective story.",
            "review_date": "2007-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very light-hearted & appealing.",
            "review_date": "2007-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of the Thin Man Seires. Classic Story.",
            "review_date": "2007-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of the series.",
            "review_date": "2007-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "again very funny! you would think that after 2 movies they would just get bad, but its not true, they just get better and better!!",
            "review_date": "2007-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I lliked all their movies.I love the dog too",
            "review_date": "2007-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Looking at this list...Im caught suddenly realizing that I may have only seen 5 of the 6 in this series...but one doesnt stand out from the rest...?\r\nI'll get around 2 figuring thatone out later.",
            "review_date": "2007-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my absolute, all time favorite of the Thin Man movies.  Nick goes home to his father's house.  His mother is a sweet old thing, played by character actress Lucile Watson, whose film career went back to an uncredited 1916 performance in [i]The Girl With Green Eyes[/i].  His father . . . is not.  He is played by Harry Davenport--Dr. Meade from [i]Gone With the Wind[/i], and his career went back to 1914.\r\n\r\nIn fact, all of the [i]Thin Man[/i] movies are filled with the very familiar and the vaguely familiar.  Heck, Jimmy Stewart's in [i]After the Thin Man[/i].  Half the cast tends to be someone you're sure you recognize from somewhere.\r\n\r\nAspects of the movie are quite different than in the ones before and after.  (Well, there's only one after.  But still.)  It's a delightfully middle-class film, very different from the rarefied atmosphere they generally inhabit.  There's very little drinking (apparently, liquor rationing was on at the time).  One feels Nick's liver must have delighted in the break.\r\n\r\nThe crowded train is another one of the WWII-centric aspects of this film.  (Well, it [i]was[/i] released in January, 1945.)  So are the omnipresent soldiers and sailors.  (The previous one, [i]Shadow Of the Thin Man[/i], was released in 1941, and the next, [i]Song of the Thin Man[/i], was '47.)  I strongly suspect that the \"charity\" bazaar and dance were to support war-related causes, though it's never actually specified.\r\n\r\nI love this movie.  Its cast of characters is delightful.  Its plot is nuanced (for a Thin Man movie, anyway).  And you spend far less of it worried about liver failure.",
            "review_date": "2006-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Thin Man series is the most consistently good movie series ever. Myrna Loy and William Powell were so natural together, and worked so well together, it is no wonder they made so many films together. The Thin man series very successfully blended comedy, mystery, touches of romance and suspense. Excellent and highly entertaining.",
            "review_date": "2006-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Next to last out of six, my viewing of this one completes my viewing of the whole series. TMGH had its moments of humor and had a valid resolution to the \"who done it\" part, but the humor wasn't enough, and the movie took forever to get going. Definitely not the best work of the series.\n \nMy Rating: 4/10\nDate Seen: 3/8/04",
            "review_date": "2004-03-09",
            "source": "rt",
            "lang": "en"
        }
    ]
}