{
    "title": "Battleship Potemkin",
    "rating": 8.5,
    "release_date": "1926-12-05",
    "genre": [
        "Drama",
        "History",
        "Thriller",
        "War"
    ],
    "summary": "In the midst of the Russian Revolution of 1905, the crew of the battleship Potemkin mutiny against the brutal, tyrannical regime of the vessel's officers. The resulting street demonstration in Odessa brings on a police massacre.",
    "critic_reviews": [
        "If you are at all interested in the history of cinema, or the influence of 20th century politics on the medium, then this film is a must-see, although over an hour of Soviet propaganda is likely to test the patience of modern viewers.",
        "One of the fundamental landmarks of cinema.",
        "Eisenstein's film still has a hypnotic urgency.",
        "It’s propaganda, yet of the most artistic variety.",
        "Potemkin is a vital viewing experience that transcends its landmark/milestone status. Its virtuoso technique remains dazzling and is at the service of a revolutionary fervour we can still experience.",
        "A persistently political work salvaged by its unforgettable grasp of motion.",
        "Battleship Potemkin remains remarkable for the way it builds over a brisk 69 minutes, setting the pace for nearly every action movie made since.",
        "Heralded as one of the most blisteringly influential films of all time, Eisenstein’s propaganda film has left an indelible scar on the establishment of film as art.",
        "If you only ever see one silent film, this is the one it should be. A masterpiece.",
        "It’s required viewing in virtually every Film 101 class. Look at any MTV video or any slick million- dollar minute of advertising, and you’ll see its origins in that assemblage of shots in Potemkin.",
        "To this day one of the most riveting, horrific, and empathetically turbocharged pieces of motion picture history ever recorded, Eisenstein's mind-bogglingly complex composition – utilizing a seeming cast of thousands of extras in addition to the unnamed, iconic main figures – is a gory ballet of marching Cossacks, frantic Odessites, trampled innocence, and doomed dissent.",
        "Let it suffice to say that if you've heard something about “montage” (the joining of filmed images to suggest an idea, create a mood, or evoke a theme), this is the work that defines it.",
        "Eisenstein’s account of the 1905 rebellion aboard a Russian battleship has been endlessly pored over and broken down, analyzed shot by shot to illustrate the filmmaker’s adherence to Soviet theories of montage. But what can get lost in the close readings, to say nothing of the innumerable homages to the film’s climactic Odessa Steps sequence, is how radical -- and how thrilling -- Eisenstein’s techniques remain.",
        "Battleship Potemkin is first and foremost an action drama, a work of straightforward emotion and pulse-quickening tension.",
        "Whether or not one is disposed to accept all the details as a faithful record, the fact remains that it is a production in which the director displays a vivid imagination and an artistic appreciation of motion picture values.",
        "Few films rival its ability to capture the danger, drama, uncertainty and energy of civil war or to respond so vitally to the urgent artistic challenges of their times.",
        "For all Potemkin’s rabble-rousing propaganda, Eisenstein’s aestheticism is everywhere apparent.",
        "A vibrant, cinematically radical, and extremely accomplished work which went on to become one of the most celebrated movies ever made."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "I haven t seen it yet, but it looks Epicard. I Love the ships movies and all that stuff.The brulmaster was here.",
            "review_date": "2020-10-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThey kill everyone at the end, and it’s amazing. AMAZING. I don’t think you all understand me. It’s AMAZING",
            "review_date": "2020-10-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I want you to take a moment to close your eyes and imagine the best movie you've ever seen in your entire life. Beautiful... Isn't it?",
            "review_date": "2020-10-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "amazon, this is the best movie of all time and should be mark'd as an historic moment",
            "review_date": "2020-10-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film noir portrait of corruption and morally-compromised obsessions stars Welles as Hank Quinlan, a crooked police chief who frames a Mexican youth as part of an intricate criminal plot. Charlton Heston plays an honorable MexicanThis film noir portrait of corruption and morally-compromised obsessions stars Welles as Hank Quinlan, a crooked police chief who frames a Mexican youth as part of an intricate criminal plot. Charlton Heston plays an honorable Mexican narcotics investigator who clashes with the bigoted Quinlan after probing into his dark past. A memorable",
            "review_date": "2022-09-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A vibrant, cinematically radical, and extremely accomplished work which went on to become one of the most celebrated movies ever made.",
            "review_date": "2021-02-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film is a classic and very strong and influential film that deserves the most Praises.",
            "review_date": "2021-12-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "content": "I am stunned at what an amazing film this actually is! From the ship mutiny to the brutal staircase battle scene, this silent masterpiece deserves to be seen.",
            "review_date": "2022-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a classic silent film. It has had various scores attached to it. Frequently, Shostakovich's 5th Symphony is used. The film provides a valuable look at the Russian Navy in the early part of the 20th century. It is a work of propaganda. The viewer would never know that the Russian Revolution of 1905 ended in failure from the film. In that regard, it provides valuable insight into Soviet propaganda.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin (1925) is a silent film that is often considered one of the most influential propaganda films as well as one of the greatest films of all time. The film is a Russian revolutionary propaganda film and involves sailors, who are treated subhuman, causing them to mutiny and stand up to their inhumane circumstances. The crew must endure many hardships in their struggle for fair treatment and go on to inspire countless others to stand up to the oppressive ways of the ruling government. The film's Director, Sergei Eisenstein, used the film as an experiment in his theories of montage and it is used in several different ways throughout the films five segments. While Eisenstein certainly isn't the only Director to use montage in his films, the emotional impact felt from these sequences are truly timeless and hugely influential. I have seen many propaganda films in my lifetime but Battleship Potemkin remains with me as such a powerful and inspiring piece of the genre in its strong and powerful message.\nMuch of the flow and feel of the film is reminiscence of the propaganda genre but the original use of montage is on display in the film and while elaborated on in later films, is the most pivotal in Battleship Potemkin. At times the film may come off to some as preachy or very direct but in terms of propaganda films it gets the message across with set pieces that are edited together using montage to great effect, both visually and emotionally. As a propaganda film it uses the plea to basic human rights and liberties to show the audience its message in a very real way. At the core of every propaganda film is a desire to express a message and to portray it in such a way as to inspire those that stand for the cause and convince or plea to the hearts of those that don't yet. The emotional pull touches each and every viewer with its depiction of innocence and fairness being taken away from the citizens and even military personnel. The film does a very good job of balancing the message of the film with just letting the events play out and the viewer making a decision on the matter themselves. Battleship Potemkin is one of the greatest films and remains such nearly ninety years later due to its wonderful balance and dramatic use of montage by the films gifted Director. To truly appreciate it's brilliance you have to view the film and make your own analysis of the message and the film lets you do this without prompting you with bias agendas.\nWhat an amazing feat for cinema in 1925 and is still today considered an essential piece of film history. Truly shocking and graphic for the day, the film is filled with tense and gripping imagery and a score that follows closely to really build the tension. The red flag, which was hand colored onto the original negative was an amazing symbolic image that really added something special to the film and it's message! Highly Recommended if you are into film and want to know one of the most influential and loved films of all time!",
            "review_date": "2022-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst 01 hour: and 07 minutes of silent war footage!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin is a Soviet silent film dramatizing the events of the 1905 mutiny aboard the Russian Battleship Potemkin and the massacre that occurred in Odessa, Ukraine. Although the film is first and foremost bolshevik, revolutionary propaganda, it displays unparalleled sequences of brutal action and intense pathos for its iconic imagery.",
            "review_date": "2022-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so $#@!! AWESOME it led me to support Mr. Putin and his struggle for freedom.  🇷🇺",
            "review_date": "2022-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They just don't make em like they used to. This Soviet silent film from 1925 held my attention pretty well considering the preceding words in this sentence.\n\nPotemkin can be watched from a variety of angles, three of which I probably found myself focusing on most. The first was as a literal recollection of events, just as you would appreciate any fact based film or biopic for the knowledge gained from it.\n\nI also found Potemkin interesting as a historical document or primary source, as we can look at the film in the context of what we know today and fairly question how much of the content is factually accurate vs political propaganda.\n\nIt was also hard to watch this film without recognizing the technical achievement on display. Einstein offered some impressive shots and was able to create a succinct story line. This was also apparently one of the first films in which montage was utilized. The sound design and Shostakovich influenced score helped bring it all together, creating an adequate form of emotional cues in the absence of dialogue.\n\nThis is hard to rate because while not necessarily enjoyable at face value as a typical movie watch, it is definitely interesting, especially for Russian history fans such as myself.",
            "review_date": "2021-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The classics of cinema, a must watch",
            "review_date": "2021-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies of the silent age, or any era for that matter...gotta re-order it and add to my extensive collection!",
            "review_date": "2021-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having delved into the world of silent films fairly recently, I can say that this is the best silent film out there, or at the very least in the top three. Ahead of it's time doesn't even begin to describe how masterfully this movie is put together. I'd always thought that silent films were very basic as technology at the time couldn't allow filmmakers to do much, but that thought has been laid to rest for me, because Battleship Potemkin is a marvel in just about every way.",
            "review_date": "2021-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most convincing examples of Soviet propaganda that, even to this day, like Brechtian theater, it might cause one to rise to action. Enough has been said about the Odessa steps - it's monumental, textbook montage. The film is also a geometrical exercise, Eisenstein juxtaposing not just exact images, but bold shapes, which may not be obvious at first. Eisenstein works with large blocks, chipping away until the most precise ideas are reached, and then arranges them in such a way as to rouse it's viewer.",
            "review_date": "2021-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are some truly powerful images in this film, particularly the scenes in Odessa.",
            "review_date": "2021-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anyone who considers themselves a fan of cinema owes it to themselves to see Sergei Eisenstein's Battleship Potemkin at least once in their life.  While it is clearly Soviet propaganda, it is also one of the most influential films ever made. The Odessa Steps sequence, arguably the most famous scene in movie history, introduced the world to Eisenstein's montage technique and essentially changed the way films were made.  While the movie is admittedly short on any kind of character development, this may have been Eisenstein's point – the story is about revolution and the Russian proletariat, which was greater than any specific individual.  Made almost a century ago, the Odessa Steps scene still feels fresh and has maintained its power and significance over the decades.",
            "review_date": "2021-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly watchable. The second half draws you in, sometimes uncomfortably so",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Film Description (SPOILERS)\nBattleship Potemkin is a film about a mistreated military ship crew that mutinies against the captain who kills a rebel leader and ignites an uprising of the whole town of Odessa against the government.\n\nAbout The Film\nIn 1925, the production company Mosfilm of the USSR released the silent motion picture, Battleship Potemkin. Though silent the film has Russian intertitles laced through it. Sergei Eisenstein is the director and his execution of Battleship Potemkin cemented his place as one of the greatest film directors of all time. The film is regularly quoted as the favorite film of many great modern film directors and for good reason: the film is a masterpiece. \n\nPros/Cons (SPOILERS)\nNo scene is wasted when it comes to visual metaphor in Battleship Potemkin. This film does this with exquisite subtlety and continuity. It is this quality that puts this film at the top of any movie buff's list. Any scene could be chosen as an example so I will choose my favorite. This particular scene is very spiritual despite the anti-religious theme that was woven throughout the narrative. It takes place in Act III: Rebel leader Vakulinchuk (Aleksandr Antonov), who is killed during the mutiny, is laid to rest in a tent by the harbor. The camera is shooting from Vakulinchuk's perspective inside the tent facing towards the opening flap. You see the harbor, sail boats, and bright sky through the opening. His lifeless body stretches from the bottom center of the screen making it seem like his toes are touching the edge of the harbor. Directly above the body is a reflection of the sun glittering on the surface of the water. The entire movie uses water as a representation of emotion and subconscious. The calmness of the water subconsciously makes you feel tranquil and mirrors the peace of death This shimmery light, especially being placed over his body, is a visual metaphor of Vakulinchuk's soul. It seems to be hovering above his body as if saying goodbye. Soon a ship starts to creep into view from the left side of the tent opening. It is a dark silhouette that slowly passes over the opening and soon swallows the screen in darkness and the water shimmers no more. This visual narrative suggests that this spirit has left and only darkness remains. Since the object that eclipses the light is a sail boat it feels as though this soul has been picked up by this new vessel and is ready for the next adventure.\nWhat could be a point of weakness for some people in this film is perhaps the attack of religion since many people are religious. I think since Eisenstein seems to allude to the spirit he does not deny the existence of a higher power but is only criticizing institutionalized and weaponized religion. In the movie you can see that the priest was on the side of the oppressors and used to manipulate people emotionally into subordination. I think this nuance could potentially be hard to grasp at first for some people but it is also why I think the movie is brilliant. \n\nMeaning and Value\nEisenstein meant to create a film that glorified revolutions and overthrowing oppressors. It was propaganda for the working class to stand up to mistreatment and tyranny. In the world today many people have been standing up to the tyrants of the world. Globally people are protesting and rioting in an unprecedented simultaneous way. I think Battleship Potemkin speaks to the current mood of our lives right now. I think it is important for everybody to watch the film today to realize that a just society is not something you can just keep when you have it— it must be upheld and watched vigilantly. Oppressors of all forms have always existed to find any means necessary to take power. This film is evidence to this pattern of history as well as a call to action towards the oppressed. \n\nShould You Watch This Film?\nI think everybody should watch this film. It should be mandatory in every film class just to be exposed to masterful film making. Realistically, this may not be the film for someone that looks for more surface level entertainment from their films. It is definitely not for kids and may even be too challenging for some teenagers. Many people may not be into heady black and white silent films. I was never into the silent or black and white films until I this movie changed that for me. \n\nRating\nThe influence of this film still reaches the silver screen to this day. Every scene was layered and meticulously engineered by intelligent and crafty artists of cinema. It's themes stand the test of time. While all this that is amazing I think the fact that it is also an entertaining story is what makes it a success. I give Battleship Potemkin five stars out of five.",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another masterpiece by Eisensten.  A historical moment in Russian history when the crew of the Potemkim sided with the revolutionaries that were fighting tyranny of Russian tsars.  Unlike Ivan the Terrible where Eisenstein seemed to present a well-rounded film on the medieval tsar, Potemkin does come across as a Soviet propaganda movie.  However, it is easy to see that Eisenstein was a early genius of the film industry.  A true artist of cinema.  His experimentation with montage remains influential to this day.  The one scene that stands out, the Odessa steps scene.  Full of graphic violence for it's time and repeated many times later, including in The Untouchables.",
            "review_date": "2020-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you want a really boring example of Cinema Art this one is right up there with 400 Blows. In fact can't think of an example that blows more, with the possible exception of Breathless or the Bicycle Thief.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful, effective and and true achievement for the time!",
            "review_date": "2020-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An engaging storyline despite the somewhat \"documentary\" feel of the film as it eschews individual protagonists or a romance subplot that would otherwise be par for the course. Indeed the closest thing to an individual hero in the film, Vakulenchuk, is killed partway through, his death being a motivating factor in galvanizing the masses against the brutal and arbitrary authority of the Tsarist regime. This, of course, may well be what makes it good Soviet cinema - the protagonist IS the masses collectively, and the symbol of their power is the great battleship itself.",
            "review_date": "2020-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think the movie was pretty decent. The plot kinda doesn't make any sense when you don't know what's going on in the movie such as hundreds of citizens came to see Grigory Vakulenchuk's dead body by the bay like if they knew who Grigory Vakulenchuk was when he died during at the film's timeline? It has some decent battle scenes and we get to know that the officers and government are corrupted.",
            "review_date": "2020-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Battleship Potemkin\" is a 1925 silent Soviet propaganda film directed by Sergei Einstein. The story is exciting and engaging. However, it is the use of editing that makes this film a classic. It is masterfully shot and tactfully edited. This movie performs these aspects better than even some modern films. The montage editing techniques have influenced several fils since it's release. The imagery can be haunting with it's brutality and realism. There may not be an abundance of characters to follow, but the way the story is told, there is not a very strong need for characters. The political upheaval in the film is shown in great detail and artistic fervor. When it comes to silent film, and film in general, \"Battleship Potemkin\" is a must watch. Overall, I give this film an 8.5/10.",
            "review_date": "2020-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lovely old film, a great piece of work",
            "review_date": "2020-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like some innovations that this film presents, although I think it has aged badly and does not bring the reach of new audiences to watch",
            "review_date": "2020-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very epic silent film of that era!",
            "review_date": "2020-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eww, the meat had maggots on them and they expect them to just wash it out and eat it? That's nasty. If this shit went on back then, which I imagine it did since they're making a movie about it, this is completely cruel and disgusting. \n\nTaking justice into their own hands from dictator-like captains and officers on a ship is the main message in this movie. Although the message is clear and important, I couldn't help but doze off a couple times during the movie. And it's not the movies fault, it was just the time that it was made. The limitations of the movie - it being a silent movie and all and the cinematography is obviously limited too because of the tight spaces and the lack of technological advances. I do have to say though, the director and production made the best of what they had. The editing and scene changes are amazing. \n\nThat's so ballsy to make a statement by putting a dead mans's body on display for all the townsfolk to see what injustice was committed. It's incredible to see how the whole city came to pay their respects to the deceased sailor. That town massacre scene was brutal. \n\nThis is a pretty optimistic view of people standing up and rising up for justice. But nowadays this kind of shit wouldn't happen. Everyone's too accustomed to the life that they're living and they're comfortably numb. The only way people would come together and do an uprising like in this movie is if the system completely disrupted the people's way of living. \n\nI imagine this was a pretty revelatory and mind-blowing movie when it came out since nothing like this had been made. But with that being said, I'm not a big fan of silent movies. With the exception of Charlie Chaplin movies and the movie Vampyr (which was a movie that stood on it's own and didn't really need voice acting). But overall it was a pretty interesting movie with some nice surprises and a great message.",
            "review_date": "2020-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a beautiful and classic movie with gorgeous use of image and spectacular pacing and editing.",
            "review_date": "2020-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great piece of propaganda that successfully creates a compelling story that would unite a nation against ruthless soldiers and Cossacks!",
            "review_date": "2019-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When the film was made in 1925, it quickly established a film editing as one of the key elements of film language and radically changed cinema. Indeed, when we're watching this film it's hard to believe that was shot in distant 1925. However, Battleship Potemkin should not be viewed as a museum artifact. Today, as almost one hundred years ago, it calls to revolt against oppression and oppressors, and its powerful propaganda message carries the energy of not only the past but also the future revolutions.\n\nIn 1918 Sergei Eisenstein left the studies of architecture and joined the Russian Revolution, where he became a revolutionary propagandist. Together with Dziga Vertov and others he developed a new cinematic language that went out to change the cinema forever. Eisenstein wanted to stir the emotions and inspire viewers of his short films, and in this way to put the new art, cinematography, in the service of the Revolution. By far the strongest and longest lasting effects achieved his feature films Strike, October and above all Battleship Potemkin which soon upon release inspired hundreds of thousands of viewers, among them hundreds of future film directors. Luis BuÃ±uel said that this movie changed his life and decisively influenced his decision to become a film director.\n\nHistorically, sailors' mutiny on the imperial Russian military ship \"Potemkin\" of June 27, foretold the first, unsuccessful, Russian revolution that erupted in October 1905, and was crushed in December that same year.\n\nDuring the Russo-Japanese War of 1904/05 most of the sailors of the Black Sea fleet were transferred to the Pacific, leaving ships with mostly inexperienced recruits and less capable officers. In this situation, the Central Committee of the Social Democratic Organization of the Black Sea Fleet, called \"Tsentralka\" made a decision to start preparations for the simultaneous revolt on all ships of the Black Sea Fleet. The first rebellion erupted on \"Potemkin\", when on 27 June 1905, the deputy commander of the ship threatened to shot sailors who refused to eat maggoty meat. After a short struggle sailors took control of the ship and on the same evening sailed in Odessa flying a red flag.\n\nBased on actual events.",
            "review_date": "2019-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Historic and great.\n\nOdessa, 1905.  The crew of the Russian battleship Potemkin mutiny against their uncaring, sadistic officers and take over the ship.  The mutiny starts an uprising against the tsarist government among the people of Odessa.  However, the government sends a squadron of warships to bring the crew of the Potemkin to heel.   Things look grim for the crew.\n\nDirected by Sergei Eisenstein, Battleship Potemkin is not just a landmark film in history, for its cinematic innovations, but a great film full stop.   Great action, empathetic characters and plot and a fantastic cliff-hanger at the end.\n\nEisenstein's main contribution to cinematic development was 'Soviet montage theory': through clever editing, the viewer is drawn into and carried along with the scene.  A great example of this in Battleship Potemkin is the soldiers vs townsfolk scene on the steps.  Through dozens of mini-scenes within the main scene, the dynamism, panic and horror of the situation are conveyed to the audience.",
            "review_date": "2018-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin is rabble-rousing Soviet propaganda with visceral appeal even today.",
            "review_date": "2017-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is admittedly a good movie, but flat out communist propaganda. So, it gets a 100% on Rotten Tomatoes to no one's surprise.",
            "review_date": "2017-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin (1925), being technically ingenious and startlingly powerful, continues to stand as a crucial pillar of film history. It's easy to see why it was banned for decades. Battleship Potemkin, 92 years on, can still engross and enthral any audience who watches it. Battleship Potemkin's montage editing still influences filmmakers today. It compresses time, quickens the pace and gets the pulse racing. There's nothing subtle about the film at all; it screams from the rooftops - it's relentless. The Odessa steps sequence is iconic and the original musical accompaniment stirring. The whole spectacle is inflammatory, even for those unfamiliar with the historical context. Unlike many films today, not one second of Battleship Potemkin gives the audience a break from the brutality it exhibits. It's overwhelming. Battleship Potemkin (1925) is an iconic landmark of a film, and compulsory viewing for all those interested in film history.",
            "review_date": "2017-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Violent, relatable soldier scenes, and the iconic stairs scene. This film is excellent, and the violence was gruesome, AND THIS WAS MADE IN 1925!!!",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With unique editing, Battleship Potemkin is pure amazing on chaos in the historical event",
            "review_date": "2017-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of people note that director Sergei Eisenstein was ahead of his time with his 'film montage' technique, used so effectively in the massacre scene on the steps of Odessa, but it should also be noted that he captures brilliant images throughout this movie.   It's certainly worth watching as a result, and is probably a must for students of film.  However, what undoubtedly stirred emotions in 1925 - possibly sympathy for the communist movement, or fear of inciting revolutionary thoughts given the mutiny that takes place on the Potemkin, or squeamishness at the moments of violence (all of which contributed to the film being banned in many countries, including the Soviet Union!) - is less impactful ninety years later.   It also suffers for being a propaganda film, with less nuance in its characters and plot.",
            "review_date": "2016-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin is an enthralling and almost overwhelming film that contains no spoken words! Yet the stirring music that accompanies the exquisite cinematography intimately transports the viewer directly into the world of czarist Russia and revolutions. \n\nThis movie came out the year my father was born and he took me to see it when I was a young child. Years later I had the opportunity to travel to Odessa and I could almost relive the terrible massacre of innocent civilians on the staircase.\n\nThis movie is classified as a masterpiece for many different reasons, but most importantly, it is a brilliant flame of creativity that demands of us emotional, intellectual, spiritual, and physical responses--all of which define our humanity.",
            "review_date": "2016-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As narrative films go, \"Battleship Potemkin\" is incredibly simplistic ... intentionally so.  The characters are deliberately one dimensional and take on a symbolic role in driving the plot forward.  It's a cartoon meant not so much to make a political point, but rather to inspire the audience towards political action.  That may sound like I'm knocking it, but I'm absolutely not.  It's easily one of the most amazingly effective narrative propaganda films, and it retains much of it's power today despite being copied and quoted in hundreds of other films.  If you are a fan of silent cinema, you know that the rhythms of silent cinema are very different from modern films.  This film is about as close to a modern film as you will find in the 20's.",
            "review_date": "2016-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful with technical brilliance, striking editing, and more than one hero, The Battleship Potempkin is one of the most influential, though somewhat propagandistic, Russian films ever.",
            "review_date": "2016-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin may honestly be the best film ever made. The problem many encounter with older films is that they are boring. This is never the case with Sergei Eisenstein's masterpiece and not just because it is pretty short. Instead, he manages to keep both the tension and emotional tension up the entire time and keeps you on the edge of your seat as you watch the events unfold. While undeniably communist propaganda, Battleship Potemkin is still a brilliant and highly influential film that will hopefully live on forever.",
            "review_date": "2016-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin is a Soviet propaganda film.  It is an epic silent film, studied by cinema critics and film-makers since its release to American & European audiences.  The movie is based on true historic events of 1905 and provides an insight to the standards and treatment of people during Czarist Russia.  It generates empathy from viewer to provide understanding of the events leading up to the Bolshevik Revolution of 1917.\n\nThe plot focuses on life in the Czarist navy and builds to a climax to one of the greatest cinematic scenes of all time at the Odessa Steps.  Historical events such as these would largely be forgotten by modern culture had they not have been preserved in films like these.  \n\nI hope that viewers can absorb the turmoil and oppression of those times to understand the basis of the Bolshevik revolution and overthrow of the monarchy.  Let this be a lesson - the masses can only be pushed so far, until there is a sentiment to revolution.",
            "review_date": "2016-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant examination of political injustice, Battleship Potemkin has withstood the test of time, choosing to use the platform of film as a bold piece of propaganda.",
            "review_date": "2016-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most influential movies ever, and one of the best war films of all time!\n\nOverall Grade: A+ (10/10)",
            "review_date": "2015-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is it a technical masterpiece of yesterday? Yes. Does it hold up today? Absolutely not. But, at just over an hour in length, watching \"Battleship Potemkin\" is no big commitment, especially for the film buffs to whom it should already be a must-see.",
            "review_date": "2015-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really find it hard to describe Battleship Potemkin because it's just a film that just wows you over before you can even stop to think about it, a technical masterpiece with a genuinely thrilling plot. The story takes place in June of 1905 on the battleship well Potemkin, we see the crew of the ship are not so happy and they are revolted by the standards they have and so they stick up for themselves and when fellow crew members are nearly killed by their own officers, it seems quite the time for the crew to get up and fight. It is a dramatized version of true events but this movie really pumps up the workers as complete heroes, I mean this movie is Soviet propaganda through and through, but it's superbly well made even if it is.\n\nThe man behind this perfectly crafted motion picture is Sergei Eisenstein who directs this in a way which even when it's going very slow still manages to either be thrilling or throw in some kind of thing to make it so amazing. I think what he also does is create a movie that isn't just for critics to feast their eyes on, this can be enjoyed by anyone I swear and it's actually a genuinely exciting kind of movie, although I would always watch a few silent movies beforehand so that you get the right feel of this. What Eisenstein also does is bring in all the crafts that make up a film and creates an art piece, one that's cameras are perfectly working, editing is finely tuned, dialogue (even for a silent movie) is great and then utilises production design especially in the famous \"Odessa Steps\" scene where the outfits and the general look of the scene looks amazing.\n\nThis is so often placed on the lists that people compile with the greatest movies and for good reason, the reasons become even more so when you consider this was made in 1925 and it is silent, but you never truly think about that and this doesn't seem to have aged at all, in fact other than the cast the only expired thing is the Soviet Union. Yet again it is Eisenstein who makes it ageless, I felt he just knew what he wanted and did it, made a film that although is made for a certain political position, can still entertain no matter what your views on politics.\n\nI feel that again those steps are like come on, I mean those boots are just a brilliant cinematic piece. The scene is one that is thrilling yet also oddly touching with a little added darkness (well OK make that quite a bit). The choreography of the entire scene is marvellous too with the enormous cast to run and fall down it not only makes it incredible to see but you'd think also really dangerous! Don't watch this just for this scene I mean this has sublime scenes elsewhere, take for example the ending which of course I won't spoil but when you think one thing it does something else and builds you up until you are really excited to see what happens next. \n\nI think that if you consider this not your kind of film then think again, this isn't a movie that should only be shown in history classes or film studying lectures, it's a movie that should be seen because it is entertaining but also technically a film of flawless dimensions. Yes feast in what Soviet cinema has to offer and maybe you might like it quite a bit, in fact you might even be accustomed to raising a red flag above your house even if the neighbour calls you a commie.",
            "review_date": "2015-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie in constant motion, whether that be crawling, shooting, or a baby carriage rolling down the Odessa Stes. Or masses of an unordered crowd contrasted with the precision of a military rand and file. Or the motions of the red (truly red) in the film. It is in motion continually, but Eisenstein weaves this into the film so that you don't feel the movement, but rather feel the excitement.",
            "review_date": "2015-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece of cinema, Battleship Potemkin remains an influential picture that stands the test of time",
            "review_date": "2015-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic editing, great acting, and beautiful cinematography. Sergei Eisentein's film about the uprising of 1905 was a masterpiece.",
            "review_date": "2015-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film which this year celebrates it's 90th birthday has been frequently cited among the greatest of all time, and has occasionally occupied the top slot on such lists. As a propaganda film it shamelessly depicts its antagonists as cruel snobs who care nothing for those below themselves, and gives them no redeeming features whatsoever. Most of them don't even have names. Without paying even close attention, many of the technical cracks are plain to see. It's integration of stock footage and even cutaway shots to what looks like a toy ship floating in a tub of water against a grey backdrop seem especially silly by today's standards, but what still holds up are its themes and morals. Much like The Bicycle Thief, another masterpiece, simple human desires, in this case the craving for liberation and fair treatment, appear small at first, but the film cleverly amplifies them to the point where you can feel them in every moment. The Odessa Step sequence, a scene that bears the drool marks of film historians and directors the world over, still holds up very well, existing as a hallmark of directing, camera-work, editing and stark, often brutal imagery. It's not the kind of film you would watch on a regular basis, especially if entertainment is all you seek, but with ever-relevant themes, a stirring musical score and surprising tension and emotional heft, Battleship Potemkin is rightly regarded as a piece of seminal cinema.",
            "review_date": "2015-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece of international cinema, I hadn't seen this film school, do it was great to revisit it on Blu-Ray. Such a great film, it ushered in editing techniques that are now just standard part of cinema, but were incentive for their time, the \"Odessa Steps\" scene is a great example, and it was paid tribute to by Brian DePalma in\"The Untouchables\".  This film needs to be seen by all serious film fans!",
            "review_date": "2015-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was so impressive. A film that depicts the crude and terrible conditions in the Russian navy. It uses unique editing technics. I uses huge crowds of extras. The scale of this film looks awesome. I have never seen the technic where selective color is used in the coloring of this film. I loved and was shocked when I saw a Russian Red flag appear in this film that as a whole is filmed in black and white. This was very impressive when you hear that this film was being edited up to the end, The cuts were being edited together up to the end so much so that the cuts were being licked together before the opening premier. I enjoyed the film musical score. This is one of the best silent films I have ever seen. I just wish I understood with more context the culture or what was going on with some of the large crowds or why people were being attacked. I found it unique how not everything needed subtitles or was given subtitles so that the audience could interpret what was going on in a scene. \n\n\nThis is impressive when you consider that this was made by a 25 year old where this was his second film of all time and was hired by the Russian government to make a propaganda film.",
            "review_date": "2015-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "groundbreaking and grippingly shot.",
            "review_date": "2015-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like \"Birth of a Nation,\" the Russian silent film \"Battleship Potemkin\" is pure propaganda, but fortunately doesn't have the level of racism of the former. What it does have is incredible camerawork, huge set pieces, melodrama, and tension. The massacre of civilians on the Odessa Steps is especially well shot, with a variety of closeups and long shots, as well as panning shots following the soldiers and their hail of bullets down the stairs. The scenes are shocking, violent, melodramatic, and gigantic in scope.\n\nThe plot/history reenactment is relatively simple: sailors refuse to eat the borscht full of rancid, maggot infested meat. When the officers decide to make an example of several sailors, the sailors rise up against them and take over the ship, just as revolution begins to spread across Russia.",
            "review_date": "2015-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hands down one of the greatest films ever made. A true masterpiece.",
            "review_date": "2015-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not going to lie, I did not enjoy this. I appreciate the importance of the film and the enormous steps it took for early cinema but wow, I was so excited for it to be over. Obviously the context of the film is incredibly important, and it is vital to note that this is a propaganda film. That being said, there aren't really characters. It's like there were just two: the people and the soldiers. The stair scene is just as legendary as it is hailed to be. Halfway through it I noticed my jaw was dropped open as much as possible. I've been watching early films lately and I must say that the violence is shocking. It's not especially graphic or even realistically performed, but the reasons they have to start fighting and the quickness of it was jarring. These soldiers just gunning down civilians was incredibly disturbing and I can't believe that that is a thing that happened, and continues to happen. There were a lot of creative angles and techniques used, absolutely. Just the way the story was told left me guessing a lot. Wasn't a lot of build-up to action, it was just suddenly inaction to action- and since I didn't know what was going on all the time, it was really confusing. Just not a format I'm used to, but I'm working on it.\n\nThere were so many points where I was like \"okay, I GET IT\" like so many repetitive shots and close-ups held for far too long. There were a lot of shots that should have been cut shorter because it would continue on even after the characters were mostly out of frame. There was one scene where two people walk away and the scene keeps going until all we can see is their ankles and I was like, \"ok, what do these ankles symbolize\" Just kidding, haha, I mean I can't knock this film too much because it's truly an important part of the foundation of modern cinema, and these guys were out there with nothing but ideas and some film equipment. They didn't have film schools, they didn't have movies to watch and study, they didn't have books about filmmaking. I do appreciate this movie's contribution to film but I did not have a good time watching this film. The story didn't do it for me and the shooting style was extremely frustrating to watch. The stair scene is worth a viewing, but I don't intend to watch this again. Not sure why any government would endorse/pay for this, but I'll never pretend to understand Russia. \n\nDid I enjoy it? No\nDo I ever want to see it again? No\nDo I ever want to include it in my own collection? No\n\n6/10\nBye love you\n-Jessie Carlson",
            "review_date": "2015-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything would be great unless it's comiunism propaganda.",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A True Russian masterpiece.",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably one of the finest silent films & by far one of the most significant from Russia. This is truly a masterpiece that requires viewing from film lovers.\n\nThe story of a mutiny on the Potemkin Battleship that flooded onto the streets of Moscow under the Tzar ruling.\n\nDirected to near perfection by Sergei Eisenstein with some unforgettable shots like the child in the pram going down steps with bullets flying by her & the peasant woman being shot from behind. \n\nIt's a challenging & important film to watch!!!!",
            "review_date": "2014-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The quintessential propaganda movie. So this is about the crew of a Russian ship, the Potemkin.  When there is a disagreement regarding the quality of the food that is being served, it directly leads to a mutiny, which indirectly leads to an uprising against the Russian overlords.  Speaking plainly, it is a bit difficult to approach reviews for old school classics such as this one, because there are a few questions that I feel that I am required to address when I go about critiquing.  Is this mandatory viewing for any film lover?  Absolutely, and with good reason.  Over at theyshootpictures.com, a place where I occasionally go for classier (and sometimes snootier) film recommendations, this is ranked as the 11th best movie of all time, and that is not without merit, especially from a technical standpoint.  Does this demand multiple viewings?  I'm pretty certain I will see this again at some point in my life, but I have no inherent desire to rewatch this.  Does it play well to today's modern audience who can't stand in a line for more than 45 seconds without checking their smart phones?  Well, I wouldn't necessarily go that far.  I've dabbled a bit in silent films, but it's hard to deny: almost every silent movie feels about twice its length due to modern film and television desensitizing our attention span.  With shorts, it's not that big of a deal, but for full length features, you do feel it, even if it's a modest 69 minutes like this one is.  With Battleship Potemkin, they made the smart decision to divide this into five definitive chapters, all of which feel like their own personal segment.  This allows you to pace yourself, which puts your A.D.D. at ease.  The first three chapters are all well and good, but they aren't what you talk about once you walk away from it, as they are mostly setup.  The last two chapters are where this feature truly shines, most notably with The Steps of Odessa.  This isn't just a massacre, it's an ambush, so much so that you, as an audience member, are taken aback with how jarring the tonal shift is.  It's one of the first montages in cinema, and it is unnerving, even in the year 2014; seeing this relentless opposition bear down on innocent bystanders would be disturbing even in a non-propaganda movie.  Also, in the fifth chapter, it features honest to God tension that keeps building and building to music that continues to crescendo until the point that you're ready to yell at the screen, and it's pretty impressive that a movie that is this old can still be so affecting.  The print on Netflix is very crisp, and there is plenty of memorable imagery to be found here.  Even without the context, the propaganda effect is not lost; the flashing of fast title cards that read, \"the land is ours\" and \"tomorrow is ours\" leave an imprint in your brain, whether it be on a conscious or a subconscious level.  Should you watch this?  Yes, it's 100% required viewing, if only to see what we came from in cinema.",
            "review_date": "2014-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A riveting example of energized and intense film editing. This is a great example of how an entire story can be told with powerful images and creative editing in place of pointless or obvious dialogue that reiterates what is already being shown. The tension of the final scene of the Potemkin plowing through the waters towards its supposed doom at the hands of the admiral's squadron is masterful to say the least.",
            "review_date": "2014-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To call Battleship Potemkin the greatest propaganda film of all time may not be the highest of praise, but the impact of the editing techniques pioneered by Eisenstein in this film have been felt since its release. Using technical achievements to invoke emotional response is perhaps the greatest tool that cinema can employ and it began here with Battleship Potemkin. This is the world's first film; all that came before were simply movies.",
            "review_date": "2014-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eisenstein understands the way the human eye and brain work so well that this film could be shown to anyone at any point in history and they would likely connect with it on a subliminal level, even without any context or shared language to fall back on.",
            "review_date": "2014-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent. 9.6/10. A+. Awesomely awesometastic.\n\n\nAn incredibly influential film, a technical marvel, and also a thoroughly entertaining and effortlessly watchable epic, Battleship Potemkin is one of the best directed and composed films of all time, and even one of the best films of all time.",
            "review_date": "2014-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nearly 90 years later, Sergei M. Eisenstein's \"Battleship Potemkin\" is still a Masterpiece of Cinema!",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie. Very sad and realistic for an old fashioned silent film. It was brilliantly made and ahead of it's time. I couldn't think of one thing wrong with the film.",
            "review_date": "2014-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A savagely harsh and gripping film about the Russian revolution. Chilling, real and bleak. A unique beast from the silent era.",
            "review_date": "2014-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "During the opening scenes I couldn't understand what the all the fuss was about. Not so amazing villainous ship captains surrounded by unmemorable characters. I couldn't see why everyone lauded this as a masterpiece. Then I saw the Odessa Step sequence. Boy was I wrong. That sequence alone warrants the watching of this movie. While other scenes have aged badly the Odessa Steps remains as exciting as it was in 1925 and does not rely on quaint charm to be enjoyed. The sequence is jarring, remarkable for a film made in 1925. The brutality and violence during this scene shown in a wonderful montage can still move and shock modern audiences that have become accustomed to violence in modern cinema. You hold your breath and don't exhale till the onslaught by Czar's soldiers is over.",
            "review_date": "2014-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"There is an uprising!\"\n\nBattleship Potemkin is one of the true masterpieces from the silent film era thanks to the innovative editing techniques used by director Sergei Eisenstein. He took the basic principles of continuous editing that D.W. Griffith had used a decade earlier and revolutionized film with his now famous montages. Battleship Potemkin has brilliant montages and by combining these different shots together an entire new meaning emerges. This is one of those rare silent films that not only can be appreciated for the important role it played in the revolution of cinema, but it also happens to be very entertaining on its own. The action scenes were beautifully shot and edited together to stir an even greater emotional impact. Of course, the film isn't without its flaws because being the political film it is (Communist propaganda), its leftist message is heavy handed. The sailors and workers are presented as the saints, while the tsarists are demonized. No matter if you agree or not with the message of the film, there is no denying that this movie is worth watching thanks to Eisenstein's technical achievements and some iconic scenes that continue to influence the way we view cinema today. \n\nThe screenplay commemorating the uprising of 1905 in Russia was written by Nina Agadzhanova. The story focuses on the crew of the Battleship Potemkin who were being treated poorly by their commanders. One of the sailors, Vokulinchuk (Alexander Antonov), decides it's time for them to stand up like the rest of the nation has against this oppressive government. The next day, the crew refuses to eat the rotten meat served for them and begin a protest which leads to a violent riot. The sailors try to ignite the revolution by raising a red flag near their home port, but when Vokulinchuk is violently killed the people of Odessa become outraged. Things get out of control for the Tsar regime who violently kill hundreds of innocent people on the Odessa Steps, which only ignites more indignation from the rest of the protestors. They have reached a point of no return and there is no stopping the revolution now.\n\nThe climactic and most memorable action scene takes place during the middle of the film in the Odessa Steps where Eisenstein brilliantly uses rhythmic editing to build the suspense. This scene has become iconic and many directors have payed homage to it. These montages were a perfect fit for propagandistic purposes because they stirred powerful emotions and could easily manipulate the audience. That is why some directors prefer using long takes instead of montages, but there is no denying that Eisenstein's visionary way of directing has influenced cinema today. I appreciated this film very much, but I also enjoyed it and was entertained throughout its short running time. There are also some beautiful shots in Potemkin so a lot of credit has to be given to cinematographer Eduard Tisse. This is a must see film for all the technical achievements involved, and you will be surprised at how well Eisenstein put together those scenes to leave audiences at the edge of their seats.",
            "review_date": "2014-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"There is an uprising!\"\n\nBattleship Potemkin is one of the true masterpieces from the silent film era thanks to the innovative editing techniques used by director Sergei Eisenstein. He took the basic principles of continuous editing that D.W. Griffith had used a decade earlier and revolutionized film with his now famous montages. Battleship Potemkin has brilliant montages and by combining these different shots together an entire new meaning emerges. This is one of those rare silent films that not only can be appreciated for the important role it played in the revolution of cinema, but it also happens to be very entertaining on its own. The action scenes were beautifully shot and edited together to stir an even greater emotional impact. Of course, the film isn't without its flaws because being the political film it is (Communist propaganda), its leftist message is heavy handed. The sailors and workers are presented as the saints, while the tsarists are demonized. No matter if you agree or not with the message of the film, there is no denying that this movie is worth watching thanks to Eisenstein's technical achievements and some iconic scenes that continue to influence the way we view cinema today. \n\nThe screenplay commemorating the uprising of 1905 in Russia was written by Nina Agadzhanova. The story focuses on the crew of the Battleship Potemkin who were being treated poorly by their commanders. One of the sailors, Vokulinchuk (Alexander Antonov), decides it's time for them to stand up like the rest of the nation has against this oppressive government. The next day, the crew refuses to eat the rotten meat served for them and begin a protest which leads to a violent riot. The sailors try to ignite the revolution by raising a red flag near their home port, but when Vokulinchuk is violently killed the people of Odessa become outraged. Things get out of control for the Tsar regime who violently kill hundreds of innocent people on the Odessa Steps, which only ignites more indignation from the rest of the protestors. They have reached a point of no return and there is no stopping the revolution now.\n\nThe climactic and most memorable action scene takes place during the middle of the film in the Odessa Steps where Eisenstein brilliantly uses rhythmic editing to build the suspense. This scene has become iconic and many directors have payed homage to it. These montages were a perfect fit for propagandistic purposes because they stirred powerful emotions and could easily manipulate the audience. That is why some directors prefer using long takes instead of montages, but there is no denying that Eisenstein's visionary way of directing has influenced cinema today. I appreciated this film very much, but I also enjoyed it and was entertained throughout its short running time. There are also some beautiful shots in Potemkin so a lot of credit has to be given to cinematographer Eduard Tisse. This is a must see film for all the technical achievements involved, and you will be surprised at how well Eisenstein put together those scenes to leave audiences at the edge of their seats.",
            "review_date": "2014-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's structure, it's symbolism, Eisenstein's influential and astonishing aestheticism, the baby carriage on the steps. Battleship Potemkin is one of the medium's crowning achievements and along with D.W Griffith's Birth of a Nation, is one of the propagandist movies of cinema's early days with questionable ideologies but film-making which invented new cinematic forms and rhythms still prevalent in movies today.",
            "review_date": "2014-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another film from Eisenstein with improved narrative, slightly more entertainment value, and the same nature in being masterfully influential and not being pretty. (B)\n\n(Full review coming soon)",
            "review_date": "2014-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directed by Sergei Eisenstein (October: Ten Days That Shook the World (1928), The General Line (1929) and Ivan The Terrible (1944-46)), this silent war film was based on true events that occured in 1905. It is a hard film to watch, but you can see what films it went on to influence and why film critics swear by this film, but that's made it feel less special than it is. The film is told in 5 episodes, 'Men and Maggots', where the crew of the Battleship Potemkin live in squalid conditions and are given rancid food, 'Drama on Deck' shows the crew having lost patience with the conditions, and leading a mutiny against their leader Grigory Vakulinchuk (Aleksandr Antonov). In 'A Dead Man Calls for Justice', the people of Odessa mourn over the death of Vakulinchuk, then in 'The Odessa Staircase', Tsarist soldiers turn on the people of Odessa, causing a bloody massacre. Then in 'The Rendez-Vous with the Squadron', another battleship is sent to intercept the Potemkin, only for both ships to join together in mutiny. The film requires a knowledge of what was going on in Russia at the time, it looks good but it's heavy going and it's not one you can watch again in a hurry. It was banned for nearly 30 years in the UK for \"inflammatory subtitles and Bolshevist Propaganda, which just goes to show how paranoid people were against Communism back then.",
            "review_date": "2014-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't looking forward to watching this because it's a 1925 Soviet silent propaganda film about a period I don't know anything about. With that in mind, and with the monotonous longevity of some of the scenes aside,  I actually really enjoyed it and can appreciate how breakthrough it was in terms of editing and influence in general.",
            "review_date": "2014-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Historic. Monumental. All around, very entraining to watch. The montage is a cinematic technique that will never fail to amaze.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic masterpiece! First saw it in my early teens, and thought it was fascinating. I highly recommend this to those interested in the History of Cinema or History in general.",
            "review_date": "2014-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well-filmed, but I don't feel comfortable giving a fresh score to propaganda. Full review soon.",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest influences ever on the way films are shot and edited, Battleship Potemkin is nothing short of a masterpiece.",
            "review_date": "2014-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Originating multiple troupes still found in modern filmmaking, \"Battleship Potempkin\" is an exhilarating, thought-provoking piece of work that ranks with the very best.",
            "review_date": "2014-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of course this is shallow propaganda, but you can really see why it is so revered. The shots are indelible: still gorgeous, original, dynamic and rousing 90 years on.",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film paves the way for modern action films and thrillers. Great suspense build up keeps you hanging on.",
            "review_date": "2014-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How does one add commentary to what has been called the \"greatest film of all time?\"  First off, I'm not sure about that.  Granted, the direction and editing created emotional intensity and empathy via montages, which proved highly influential in the history of film.  However, the use of quick montage was also revolutionary when Abel Gance used it in \"La Roue\" to much the same effect a year earlier.  Today, we are so accustomed to quick multiple edits and montages that it's difficult to analyze it from an uninitiated viewpoint.  \n\nSecondly, this is a propaganda film, plain & simple.  I'm a bit surprised that the US ever allowed it to be shown due to its philosophical support of communism.  However, it should be seen and studied by everyone so as to keep democracies from succumbing to the same sort of propaganda - and likewise to understand the elements that create such a populist revolution.  When you disrespect the workers, create blatant inequalities, and serve them tainted meat . . . well, this is what happens.",
            "review_date": "2014-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound: The orchestral score written for this film synchs well and helps drive the tension and energy of the film. There even is am homage to Tchaikovsky's 1812 overture by using Le Marsellaise in the score. \n90/100 \n\nTechnical: Poor use of the ship model. Eisenstein breaks the 180 degree plane a couple of times. The montage editing drives the pace and tension of the film. Excellent use of framing and camera angles. \n95/100 \n\nNarrative: Episodic in 5 parts but it flows together. Weak ending if the film was not for propaganda use. \n100/100 \n\nActing/Character: Excellent acting for the era. Eisenstein is not afraid of using close ups of the supporting cast; great faces too. Superb use of the different ranks and groups to signify the proletariat, bourgeoisie, and the elite classes; for the propaganda use. \n95/100 \n\nDid I like it: Yes, but if the ending were true to the real actions of the Soviet Union the ending would have had more bloodshed. \n90/100 \n\nArtistic merit: Excellent use of montage, controversial subject matter, and a film with a history of being banned or edited. This films influence on setting standards for future films weighs heavy here. It also shows the power of a \"silent\" film. \n100/100 \n\nTotal score 95/100",
            "review_date": "2013-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Potemkin sets itself aside from other propaganda films by including a plot, emotion, and production values. Excellent cinematography, creating high levels of suspense. The Odessa Steps scene is one of the greatest ever.",
            "review_date": "2013-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin the Propaganda of the Montage \nBattleship Potemkin is a Russian silent film made in 1925, directed by the great Soviets filmmaker Sergei Eisenstein. The story in this film is based on a true events during the revolution in The Unions Soviets. In 1905, protest of workers begin against the regime. A ship full of officers called Potemkin. Some officers have decide to punishment a few rebel workers, then the some officers refuse to do so, and they take over the ship. When they return to the city they found out that there was a thousand civilians been shot and killed by the regime, many others wounded. The film is considered one of the best classical film in history of cinema in the silent era. The scene were a baby in a carriage falling down the stairs is truly the beginning of many new montage theories in cinema.\nAs Dylan Hintz claims in his essay \"Sergei Eisenstein's 1925 masterpiece of Soviet Montage, The Battleship Potemkin. This statement links clashing close up images of water crashing upon rocks- a natural violence of warlike proportions displayed to give the viewer a feeling of great chaos- to the entirety of the film in a message and theme of collision and amassed disturbance\". In this film the montage, unlike Griffith films in the United States, we find that the cuts designed to deliver a message of the revolutionary propaganda. The montage is confusing to the eye but attractive to the mind. The most important is the way montage pieces were puts together. thats way this film is significant to the history of the cinema. Is this film about political propaganda, I don't think so. To the cinema, this film encourages the filmmakers around the world to use the montage to do they own propaganda. \n\tIt is a difficult to be make a film that has a lot of affect in the moviegoers during  the silent  period. The Russians directors such as Einstein among with others find away to be more able to exploit the story using the montage as highest artistic value to make remarkable films. We see the cinema in France such as Lumiere Brothers, George Melies never try to play with the montage. In the other side of the world we see also the American filmmakers such as Griffith and Edson, using the traditional classic ways of montage. Einstein with his vision, was able to create something different in the montage. The technique he makes in the editing has lots of impacts and  influential to the public. The shoot mixing with powerful montage are capable to send the philosophy and the ideas of the film esay to the audience. Looking to part of this essay by Gregg Severson \"Eisenstein is creating a narrative film, and Hough purports to write a history, but both are stories of the event with an intended audience and an intended effect. The small differences between the two perspectives offered by Hough and Eisenstein is significant and colors what the audience thinks of the mutiny and how they identify with it\".\n\t In term of length we see a long shot mixing with short cuts. The duration for each cut in very short if needed and very long if needed. A strong use of the graphic match in the baby's scene. In his intellectual we can feel the strong relationships between the shots. In his film, Eisenstein, we can see the achievements of the mise-en-scèn a few shots to deliver moments of people while they facing hard time with the dictatorial government authorities. Many of medium shots in the film, but the Odessa Steps clip, he almost never uses a long shots. He uses this technique to be more tough on the audience in the cinema, in order to let them sympathize with the victims of the movie. Many great outstanding tracking shots, were in a time there are no steadicam on set. As great way to balance the mise-en-scèn, he puts his camera on his DOP's shoulder many times to makes steps sequences more realistic and touching . In term of light Eisenstein uses the sunlight, among with street light. Some time he shows the camera from the police guys perspective, and many time he shows the shot from his people perspective, this is a smart way to manipulate the viewers . As other Soviets, Eisenstein, has never do a slow and boring cuts in his montag, as US filmmakers did. The establishing shot for the steps sequences are absolutely breaking the 180-degree rule, Eisenstein wants us to understand we are watching a film during his opening sequences! With no  sound effects and dialogue, in this scene, Eisenstein successfully makes strong images with his montage, as Anna Chen says in her journal that \"Although Eisenstein is widely credited as the 'father of montage' - a form of editing technique - he wasn't strictly the first director to cut film in order to construct scenes. Early filmmakers such as George Méliès and the Lumière brothers had lifted existing theatrical methods for the screen wholesale, with little or no adaptation to the new medium. A stationary camera, the equivalent of a static audience, was placed at a fixed distance from the actors, where it passively recorded the basic mise-en-scèn\".\n\tIs this the film carries an agenda? Is this the film is made in order to achieve a political goals ? Was the film carries propaganda? It is clear to say that it is a naive to see this film as just made for that. This film devices many methods for the film industry to make greatest and better movies.\"\"we can see the seeds for the films of Alfred Hitchcock, Stanley Kubrick, Quentin Tarantino, and others. Filmed in beautiful black and white, its scenes of uprising are rousing and incredible. The Odessa staircase scene, where the baby carriage with baby in tow glides slowly down the stairs, is one of the most famous film sequences and rightly so. Battleship Potemkin is a superior film and during its editing process, Sergei Eisenstein must have surely invented some new techniques that would inspire generations of filmmakers to come.\"(filmreviewsnsuch).\" This film and the Odessa Steps clip opens many doors for the creativity and innovation in the montage. The creation of many important filmmakers around the world for the use of montage in an unusual manner. Eisenstein's masterpiece has lots of influences to French wave, Italian realism, and American New Wave. A lot of creative filmmakers around the world consider it as one of the most important film in the history of cinema.",
            "review_date": "2013-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A technical masterpiece indeed, but an uninspired story filled with types.",
            "review_date": "2013-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantozzi was wrong ... partially. I can't say how it compares to other silent movies of the period, however, despite being the narration quite pleasant, the plot is trivial and there is no art, it is almost exclusively a propaganda film.",
            "review_date": "2013-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most influential propaganda films of all time, this pro-bolshevism film is about a battleship under tsarist rule whose crew rebels against the admirals. Under the people's rule, the ship is welcomed to Odessa & presented with gifts & tidings. Only after the tsar's army attacks the citizens is the battleship forced to arms only to discover, at the climax, that the other ships have been overthrown.\nYay bolshevism!",
            "review_date": "2013-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How can we not notice the superb editing and cinematography of this incredible silent film directed by Sergei M. Eisenstein. The film tells the account of a rebellion at Battleship Potemkin that instigated an uprising in Odessa. Featuring the famous \"Odessa steps\" sequence with a scene we've all seen in De Palma's Untouchables and a other amazing scenes and shots. This is honestly a real jewel of pioneer cinema.",
            "review_date": "2013-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its lines are a bit too simplistic and the film has the same problems almost every war film has - lack of emotional involvement and weaker character development, but Battleship Potemkin is a powerful experience and a groundbreaking film with incredibly good camera work and effects for the time, very good soundtrack and acting, with war scenes filled with uncommon realism and daring brutality and with some grand scenes, particularly The Odessa Steps scene which is iconic for a good reason - it is very cinematic, intense and captivating, holding your attention completely in awe.",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Up there with the top films ever made, nearly 90 years later.",
            "review_date": "2013-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin is a technical masterpiece as it was an experiment in \"montage\" and its editing techniques remain influential to this day. As a propaganda film it exceeds expectations, presenting a story that's deeply emotional even for a foreign audience. There is no question that Battleship Potemkin should be seen by every film student, but is it as mandatory for a more casual viewer?\n\tLet's face it; Battleship Potemkin is a propaganda film. It portrays the government as rats and does nothing to redeem them. However, this is no worse then the way The Empire is portrayed in Star Wars or Loki in The Avengers. There are no real characters to attach to, because this movie isn't about characters. It's about a general population and their struggle to have rights and that story is done incredibly well, both for a 1925 film and even for a film today. The story evolves and evolves taking you places you wouldn't expect, and this makes the film actually a unique watch. For how old this movie is, its story isn't that cliché and it's really quite refreshing.\n\tThe solid story wouldn't be nearly as strong if Sergei Eisenstein hadn't been able to encapsulate the emotion like he did through editing and cinematography. The staircase scene, the fight on the battleship, and the ending scene are all monumentally tense and effective. The staircase sequence alone is shocking enough, especially if you go in with 1920s expectations. Going from a more basic movie like a Chaplin or Keaton work to this will make the film all the more effective. While those movies work just fine, Battleship Potemkin exceeds all expectations and destroys all comfort you may have. The violence used and the shocking portrayal of humanity being destroyed is something that wouldn't be done today, let alone back then.\n\tWhere this film does fail is the uneven pacing. There are plenty of points in-between the more dramatic scenes where the movie just hits a brick wall. People are just standing around talking, or they're just doing... stuff. Getting ready for war or protesting bad meat, all at a slow pace and with nothing particularly interesting to look at. The soundtrack helps a little as it's generally very dramatic and nice to listen to, but that doesn't completely rid you of the creeping sense of... boredom. \nIf you can make it through the movie, and odds are you will, there will be no doubt that what you watched was totally worth every moment and that you won't forget it any time soon. Battleship Potemkin is a masterpiece of a movie. Not without the typical pacing problems of the time, it's still a great watch and in my opinion something that even a more casual viewer can enjoy.\ngo to mentalmultiverse.wordpress.com for more reviews",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hugely hyped film by real film critics however, I tend to rate my films based on how much I enjoyed watching it rather than how influencial and ground-breaking a film might have been back in the 1920's. Obviously, to see such an old Russian film about revolution, albeit over a few maggots, is still interesting but I didn't take an awful lot from this film unfortunately.",
            "review_date": "2013-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An astonishing propaganda film about overthrowing tyranny, Battleship Potemkin is brilliantly scripted to perfection, masterly edited for its time period, and overall executed with a sincere amount of fortitude to its material that leaves the audience incessantly engaged, this film has earned its place in history as the greatest film of all time.",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A staggering masterpiece with the most meaningfull narrative technique in the history of film.",
            "review_date": "2013-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Due to it's amazing editing, score, and tone Battleship Potemkin is a masterpiece that can stand the test of time.",
            "review_date": "2013-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin is certainly a movie that stands the test of time. The movie is an exciting step into film editing and other such technology. The movie is simple in story, but rich in cultural history. We begin on the Potemkin, in which the sailor revolt due to poor conditions, such as their food; rotten with maggots. \r\n\r\nAfter the brave Bolshevik Vakulinchuk dies after the soldiers take over the battleship, his body then becomes a symbol of public outcry. This then leads to the infamous staircase scene, where Tsarist soldiers massacre the citizens of Odessa. \r\nThe movie uses the technique of montage, relatively new at the time. The use of it in the movie is brilliant, helping give off the emotions the film is trying to portrait. If I were to nitpick, I would say the characters of the film are too simple and not fleshed out enough and are treated more like symbols, but this movie, in reality, is a propaganda film, and the characterization were intentional. \r\n\r\nThe editing is quick and skilled, giving a heart-pounding experience in a relatively short film (the Kino restoration is about 70 minutes long). If one were to view a film in which its editing could impact the masses, this would be the movie to see. It is noted that the Nazi propagandist Joseph Goebbels said that the film was, \"a marvelous film without equal in the cinema ... anyone who had no firm political conviction could become a Bolshevik after seeing the film.\" This showcases the amazing power the film has to have you root to the cause it presents. \r\n\r\n**** out of ****",
            "review_date": "2013-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most powerful movie of all time.",
            "review_date": "2013-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most of the movie is just fine, but the Odessa steps make it memorable.",
            "review_date": "2013-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly one of the most important films ever made and revolutionary to the art of editing, but not my cup of tea.",
            "review_date": "2013-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film which taught me editing!",
            "review_date": "2013-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although I personally prefer the film \"Strike,\" Sergei Eisenstein's \"Battleship Potemkin\" is justifiably regarded as one of the seminal works of modern film. Eisenstein was a true master.",
            "review_date": "2013-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Charlie Chaplin's all-time favorite film (Billy Wilder too)",
            "review_date": "2013-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What do you saw about one of the most important films in the history of cinema? What is most astounding is that Eisnstein is still being copied and referenced today, almost 100 years later. The steps at Odessa will give you chills, such a powerful scene in an already powerful film.",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eisenstein's film is a political movie ( some could  like or  not) The real fact is the genious and great imagination that had Sergei  Eisenstein of amaze us because of the way he show us that story.",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you watch this you can see where guys like Hitchcock and Brian De Palma got a lot of their visual ideas.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great with the pet shop boys soundtrack",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's slightly dated, but this silent movie masterpiece was one of the most groundbreaking films of its time, and its innovative montage sequences are still pretty effective today.",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "NO!  Not a good film.  who cares if one F'ing scene defined \"dramatic pacing.  WHO CARES.  It's not like people wouldn't have figured this out eventually anyways.",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just to put this way: A rebellion started for what I think, a bowl of soup! And worms, and fierce men that are mistreated from their majors, and that was their last straw; Rot Meat! Silent Cinema never brought a war-rebellion epic so intense presence and powerful imagery that almost seems allegoric and surreal as this one before, just doesn't feel like it belongs in this film, and still manages to work brilliantly, brilliantly, that's both imagery and sountrack. It is a Masterpiece on its own. Images that will stay in my mind forever, a great inspiration. one of the old ones still shines as a aspiring thunder, munching for power!",
            "review_date": "2013-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually stunning for a 1925 silent film.\r\nDiscussed this movie in my film class. We talked mostly about the terrifying massacre scene and all the amazing techniques used for the emotional effect.\r\nGreat film.",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film of inestimable value. Eisenstein, known as the father of the montage. From the orchestration used in the analogue editing techniques, to the artistry of the photography and the use of a mass of people as central character rather than building a story around two characters, this legendary film was and still is to this day one of the most influential works ever made. The Battleship Potemkin is one of the finest films Soviet cinema ever produced and still to this day as spectacular as it was at the time of its release, with scenes like the famous Odessa massacre one still very renowned and often even referenced by other filmmakers as one of the most gripping and intense ever filmed.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lives up to its reputation and then some!",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The director gave a great illusion.",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's only lack is that it was made before sound and colour was invented for films. Without a doubt one of the most important films ever in the sense of film-history and in the sense of it's effect on real life. This film shows the revolution in culture that followed the Russian revolution (until Stalin took over) which created a foundation for revolutionary new developments in several art form and raised them to a higher quality than ever before. No where is that truer than in the art of film-making.",
            "review_date": "2012-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though visually engaging, it is too vague in terms of storytelling and sequence. Some of the scenes does not make sense for me in terms of a comprehensive and solid plot.",
            "review_date": "2012-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not many films deserve a mandatory rating, but Potemkin does.",
            "review_date": "2012-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin had without a doubt the greatest cinematography of its time, and for decades to come. The Odessa steps scene was so beautiful and artistic it truly felt like a piece of art. I hope to explore more Eisenstien in the future. This is a Soviet and a world classic, with limited propaganda. Short and always to the point. Magnificent film",
            "review_date": "2012-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has some interesting scenes in it that they should freeze frame into about into about 11 photos and then burn then put this movie permanently in storage.  The acting is incredibly bad even for 1925.  I am so glad it was a silent picture.",
            "review_date": "2012-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely well done story with gripping conflict and action",
            "review_date": "2012-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Odessa steps scene...wow. It's brilliant",
            "review_date": "2012-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most influential propaganda war films based on the 1905 mutiny. Famous for it's montage scenes and camera techniques. The film made in 1925 continues to inspire modern Directors.\n\nIn the film The Untouchables, Brian De Palma pays homage to Battleship Potemkin with one key scene. A baby carriage going down some stairs amid gunfire.",
            "review_date": "2012-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deserves praise for its technical achievements, but lacks in story and emotional debt. With the exception of the exciting Odessa stairs sequence the film is a boring sit and can only be recommended to people who are interested in the history of film (like myself).",
            "review_date": "2012-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is beautiful is that while there is no one or two characters, there is such a masterful focus on the spectacle in Soviet cinema, with Eisenstein's perfection in its technical qualities.",
            "review_date": "2012-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I look upon it less fondly than perhaps I should. While it's very innovative and cinematically important, I just find it a bit boring... Besides the Oddessa steps sequence, which is very impressive, there's nothing to grab me. It's a film that I greatly respect, but it's not breaking any of my top tens.",
            "review_date": "2012-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the greatest film ever made.",
            "review_date": "2012-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterwork of cinematic craftsmanship, Battleship Potemkin is one of the best Soviet films, boasting innovative editing methods.",
            "review_date": "2012-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another of cinema's greatest achievements, Sergei Eisenstein monumental artistic masterpiece looks and sounds brilliant even today.  It a thunderous, powerful piece of filmmaking, and one that imprints itself into the memory with a knockout punch.  Just superb.",
            "review_date": "2012-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid technical achievement for its time, though being classified as one of the best films of all time is a bit overboard.  It isn't even one of my favorite silent films.  Still, there's no doubt that it is a film worth seeing and it has some obviously excellent and influential scenes.",
            "review_date": "2012-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring as fuck -- it only truly comes alive when its most famous scene, the Odessa steps massacre, starts.",
            "review_date": "2012-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great re-telling of the Russian revolution on a smaller scale.",
            "review_date": "2012-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel a rewritten review is necessary for this one. I think I came into it with the wrong attitude; when I watched this movie a long time ago, I had only ever seen one other silent movie, Nosferatu. Nosferatu was, for the most part, fairly traditional, and it didn't deviate from today's filmgoing expectations of narrative. Now having seen at least fifty silent films, I have a much better understanding of what this fragile era in movie history represented. This was truly the time of auteurs, a time to strike out and make a name for yourself however you could (or, in the case of Eisenstein, however you were commisioned to). Battleship Potemkin is less a narrative movie than several linked short films about an event in Russian history, and to look at it this way completely changes my perspective. These cinematic poems are stunningly beautiful and invigorating, and Potemkin may be one of the defining works of film art. On an unrelated note, Potemkin, for the first time ever, didn't make the top ten in Sight and Sound's poll. Perhaps it's because hacks like me are finally beginning to understand it, so they figured they needed a new gimmick.",
            "review_date": "2012-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sheer soviet propaganda, but a classic silent movie, including the Odessa steps!  It is worth seeing, especially for the upcoming Russian adventure.",
            "review_date": "2012-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not worth 100% rating.",
            "review_date": "2012-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty damn good for its time. It might get a little dull, but you have to remember that this movie is about 87 years old and is basically 90 minutes of propaganda. That said, if you watch it for what it is, you'll find that this film is nothing short of a masterpiece. Every person who calls him/herself a Film Snob should check this one out, especially for the Odessa Steps Sequence. Those 5 minutes alone will make your heart beat like it was participating in the Indy 500.",
            "review_date": "2012-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Revolutionary in every sense...",
            "review_date": "2012-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daring and still manages to get the pulse racing nearly a century later.",
            "review_date": "2012-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may be a propaganda film, but I stand firm in my belief that Battleship Potemkin is one of the finest war films ever crafted. Its influence and values stand the test of time. With its public-domain status, I recommend checking it out.",
            "review_date": "2012-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel honored that the first time I watch this movie was on Super 8mm. This film was outstanding. Having recently read on Sergei Eisenstein I appreciated this film even more. His theory of montage is used superbly in this film. I found myself absolutely engrossed by this revolutionary film. This is a must see for all filmmakers and film lovers.",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the most intense film of all time",
            "review_date": "2012-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Obviously, for historical importance this would be a 5/5.  It's actually a pretty enjoyable though, too.",
            "review_date": "2012-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some nice camera work. Some Surprisingly moving scenes. Propaganda that was actually somewhat effective.",
            "review_date": "2012-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solely for the \"staircase\" sequence alone. The rest of the film pales in comparison to that sequence.",
            "review_date": "2012-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remember kids, it does not matter if a film is silent or in black and white.\nI grew up with some of that stuff.\nThis is a propaganda masterpiece everybody needs to watch.\nIt is about standing up for your rights (like them Russian sailors was doing when they were being fed badly).\nAs we are currently suffering from a cruel recession today, this film should inspire us to start a revolution against that moron, David Cameron.",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On account of a spoonful of borshch...",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What began as a protest about the serving of rotten meat aboard a Russian warship ended in a massacre on The Odessa Steps, a classic sequence that has been homaged in subsequent films such as The Untouchables, Bonnie and Clyde and The Godfather. For this reason and more, this has to be counted as one of the greatest films of all-time. Such was the belief in its power to incite revolutionary fervour it was banned in the UK until 1954.",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eisentsein's \"Battleship Potemkin\" is an undeniable game changer for film and he ushered in a whole new way of perceiving editing theory, but as for the story?... well, it's extremely overwrought, melodramatic and nonsensical, well too me at least. Just because it features fine examples of the birth of a vision, editing and scoring does not mean what were watching is good. Sure, it's a very influential picture, but as far an enjoyment goes, it's batting zero.",
            "review_date": "2012-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just saw the whole film, a technical marvel, great experiment with film editing. The story makes you think has very strong moments for its time. The film is very much ahead of its time. A recommendation for sure.",
            "review_date": "2012-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin isn't very entertaining but it does have one of the greatest scenes from early silent history (the massacre on the steps may be one of the greatest shot scenes I have ever seen in any movie). Eisenstein uses a ton of propaganda and the story begins to drag towards its short 1 hour ending but Battleship Potemkin manages to make its point without being overly preachy.",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extraordinary achievement in editing and dramatic shots, Battleship Potemkin is Sergei Eisenstein's flawless masterpiece, a critic-proof movie that challenge the skepticism of propagandistic cinema with powerful performances and hard, patient directional  hand. \n\nWith some of the most memorable, suspensful scenes, its one of the most recognizable, and most influential movies of all time.",
            "review_date": "2012-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotional string-pulling in its most primitive cinematic form.",
            "review_date": "2012-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally got round to watching this film. Fell asleep on my first viewing but remained attentive on my second. My first silent film as well. Anyway, on the second viewing, I could see why the film is influential. Even for a silent film, it was pretty thrilling (thanks to the really great score). The Odessa steps sequence spawned countless remakes and parodies. Yes, it is influential but that does not mean it is 'great'.",
            "review_date": "2012-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the finest films ever produced and one of the best directed films ever. Sergei Eisenstein proved himself to be a genius. While this film definitely played like a propaganda reel, the directing and the overall story really kept you on the edge of your seat. Sure it might have been over the top and way too melodramatic, but it definitely blazed a new path for film editing and the way directors do films. Some of would argue that Battleship Potemkin is highly overrated and that Eisenstein's contributions might be over-exaggerated. I am not one of those people. Eisenstein definitely knew what he was doing and Battleship Potemkin is still relevant nearly 100 years after production.",
            "review_date": "2012-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As the blurb states, this is a technical masterpiece. Still to this day I am floored by the scene of the baby carriage rolling down the stairs. This film is a marvel.",
            "review_date": "2012-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now I see where Brian De Palma got his idea for The Untouchables. This was a masterpiece. It was beautifully directed, produced, and written. The Odessa Steps sequence is with out a doubt the best scene in film history. It was so dramatic and entertaining. It was emotional that engaging. I also couldn't believe how much propaganda they had back then. I had a bit of trouble with keeping up. The scenes came so fast and it was silent so it is a very difficult film to keep up with. But if your patient then the experience can be rewarding. The editing is also really good considering that this was made during the 20's. Back when they used film reels they had to actually cut the film and paste them to get the scenes they want. Considering that there is so many cut scenes imagine all the work they had to do. And I'm here struggling writing this review. This film is for those that are into good old classic cinema.",
            "review_date": "2012-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eisenstein had dreamed of a cinema that could affect the masses - yet one could argue that his theories on montage reserved themselves for the intellectual, even if that wasn't his intent. Battleship Potemkin is caught between the two, the story of a peoples' revolution told through Eisenstein's brilliant, yet high-browed montage style.",
            "review_date": "2012-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "perfect music, perfect editing, to be agitpropaganda, it's to artsy, see how it changed the view of cinema, cinema class 101",
            "review_date": "2012-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "impressive. powerful film, sound and montage.",
            "review_date": "2012-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anti-religion, Antisemitic, Communistic propaganda but overall very good :)",
            "review_date": "2012-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film was very challenging to stomach, and the Odessa Steps sequence, as famous and technical it is, it challenges emotionally. This is drama to the highest pedigree, and a great one.",
            "review_date": "2012-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From a theatrical history point of view, the Battleship Potemkin is required viewing as it pushes the bar of what a silent film can deliver. However, from an entertainment point of view, Potemkin is creaky and suffers from a depreciation in quality of the film. Soviet propaganda experts will no doubt enjoy this film.",
            "review_date": "2012-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just to put this way: A rebellion started for what I think, a bowl of soup! And worms, and fierce men that are mistreated from their majors, and that was their last straw; Rot Meat! Silent Cinema never brought a war-rebellion epic so intense presence and powerful imagery that almost seems allegoric and surreal as this one before, just doesn't feel like it belongs in this film, and still manages to work brilliantly, brilliantly, that's both imagery and sountrack. It is a Masterpiece on its own. Images that will stay in my mind forever, a great inspiration. one of the old ones still shines as a aspiring thunder, munching for power!",
            "review_date": "2012-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's easy to see why a people's revolt story would get made in the early years of Communist Russia and it clearly has a related agenda, as silent movie dramatisations go this is a spectacular effort.",
            "review_date": "2011-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this day and age, many people find it difficult to be entertained by a silent film. This is why, if any, they will watch the energetic, in-your-face comedies of Chaplin or Keaton. 'The Battleship Potemkin' is far from a comedy, but you don't have to go in with an open mind or anything specific like that. It's a mind-blowing film for it's time, with powerful moments such as the ship's shooting squad refusing to execute the mutinying men, and the infamous Odessa steps sequence. Sergei Eisenstein's photography and style of editing are quite impressive even by today's standards, and it tells a shocking, dramatic and interesting story.",
            "review_date": "2011-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It takes a lot of effort to enjoy a silent film, especially a drama, but films like Battleship Potemkin prove that this effort is entirely worth it. Come on! You owe it to yourself to watch this film! Your movie education is incomplete without it. \"Battleship Potemkin\" is a movie classic that brings on an intellectual enlightenment to the forefront of the wonderful world of cinema!! YOU MUST SEE \"BATTLESHIP POTEMKIN\" IT IS ABSOLUTELY FABULOUS!! HERE IS A BIT OF VERY INTERESTING TRIVIA FOR YOU: \"BATTLESHIP POTEMKIN\" WAS CHARLIE CHAPLIN'S FAVORITE MOVIE!!",
            "review_date": "2011-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most powerful pictures i have ever seen",
            "review_date": "2011-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It might seem boring, but you have to put yourself in the mindset of the audience.  It's soviet, so they love the collective nature of the plot line.  Even I enjoyed the collectie nature.  It's a powerful, epic story with a creative use of editing.",
            "review_date": "2011-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Read the full review at my blog: \nhttp://capote12883.wordpress.com/1926/12/05/battleship-potemkin-bronenosets-potyomkin-1925/",
            "review_date": "2011-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cinematography and action scenes are quite sophisticated for its time.",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Battleship Potemkin\" is essential viewing in learning how the language of film developed, especially the influence of Soviet theories of film montage; the juxtaposition of sequential images which comment on, reinforce, or undermine each other. This is so much a part of the language of film now that it is expected that the audience understand this vocabulary - Eisenstein was one of the most influential teachers of this filmic grammar.\r\n\r\nThe film itself, the second in an uncompleted series, \"The Year 1905\" (following \"Strike\"), contains powerful sequences and effectively uses the masses of people available to him in creating profound images but has less story momentum that \"Strike\" and less consistently masterful scene composition. It seems that \"Strike\", in many ways the better film, has been overshadowed by \"Potemkin\" because of a few influential scenes.\r\n\r\nSeen with modern eyes much of the movie is a bit clunky and heavy with propaganda (it may have even seemed heavy with propaganda then) but it had tremendous influence on the way films were made, contributed a great deal to the vocabulary of cinema, and there are segments which are affecting and still stirringly effective nearly a century later. Merely coordinating the masses of people moving through some of the scenes is an impressive feat by itself.",
            "review_date": "2011-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "todays movies are nothing compared to this",
            "review_date": "2011-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this might be one of the best silent era films that I have seen. Of course I have seen the Odessa staircase sequence, out of context, many times. Within context it is a pivotal part of an astounding film.",
            "review_date": "2011-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film triumph, one which shows how the idea of a few men can sweep across a nation.",
            "review_date": "2011-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another masterpiece among Eisenstein's political movies and impressive for the technical quality considering the time of its release.",
            "review_date": "2011-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Film plays out of symphony..",
            "review_date": "2011-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The groundbreaking soviet montage film that revolutionized cinema. The only film that has consistently been on Sight & Sounds top ten poll since the 50s. The Odessa steps sequence is among the greatest pioneering moments of film editing. The film may be propaganda but Eisenstein was saying something vital and relevant.",
            "review_date": "2011-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mainly for cinematography and the music.",
            "review_date": "2011-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe some time in the future I'll be a real film nerd and judge films upon their editing and directing and technical and artistical value. For now, I like to be entertained and watch a good story or some nice characters with some neat visuals and so on.\r\n\r\nBattleship Potemkin doesn't offer very much of this. Although it's somehow amusing to see all the overacting and the exaggerated stereotypes the communist proganda uses and yes, it's technically masterful especially considering its age (nothing less than I expected), after all, it's just propaganda. Against the imperial regime, the high society and the church.\r\n\r\nIt's influential, costumes, sets and the ships look quite nice and authentic and the cinematography and the editing is revolutionary (pun intented) but for a more or less casual viewer it's not very interesting - that doesn't mean it's a bad film but not one of the best.\r\n\r\nPS: The staircase scene is great indeed.\r\n\r\nPPS: The film shows why films usually have protagonists - not having one is a bit odd for today's standards.",
            "review_date": "2011-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When assessing any classic film, one has a duty to point out any flaws or shortcomings even while accepting whatever historical significance the film holds. While it's pointless to criticise an old film without knowledge of its artistic, social and technological context (in other words, what could and couldn't be done at the time), it's every bit as asinine to go all rose-tinted and claim that someone has great worth purely because of its age.\r\n\r\nWe might admire silent films as a genre, but that does not mean that every silent film is up to the standard of The General. We might acknowledge the contribution that The Birth of a Nation made to the art of editing, but that does not excuse its inherent racism. Likewise, it is possible to admire Battleship Potemkin for its advances in the art of montage and for its spectacular set-pieces. But admiration of either aspect is not enough to excuse its overwrought tone, poor storytelling and its abject failure as a piece of propaganda.\r\n\r\nBattleship Potemkin could be called the high point of Sergei Eisenstein's first career. Prior to falling out with Joseph Stalin in the late-1920s, the eccentric Soviet filmmaker had won the favour of the Communist Party with his first feature Strike, an episodic recreation of a 1903 strike at a Russian factory. As part of his theory of montage, Eisenstein intercut scenes of factory workers being suppressed with footage of cattle being slaughtered, using unrelated images to generate an emotional response. The film impressed Stalin and Eisenstein was commissioned by the Party to make Battleship Potemkin as a follow-up.\r\n\r\nBoth Strike and Battleship Potemkin use a past event in pre-Soviet Russia to illuminate the class struggle of the present. Bolshevism, and the Marxism upon which it was based, rested on the principle that history is based upon struggles between the workers and the bourgeoisie, with the former eventually leading a revolution to overthrow the latter and create a society based upon equality and communal ownership (a rank generalisation, but for these purposes it will suffice). By invoking examples of revolts or struggles which occurred before the Bolsheviks swept to power, Eisenstein would instil in people the idea that they were part of a greater struggle, and that liberty was now within their grasp.\r\n\r\nThere is no denying that Battleship Potemkin deserves credit and admiration on a technical level. While the age and variable quality of surviving prints makes it difficult to judge Eisenstein's visuals, the use of montage has never been replicated to quite the same effect in any other film. We tend to think of montage as an editing technique to denote the passage of time - cutting together scenes of, say, a couple together in various poses or locations to show how long they have been together.\r\n\r\nEisenstein's montage, on the other hand, is driven by emotional response: shots of people are intercut in such a way as to provoke a reaction from the crowd. One example of this comes early on, when the crew are arguing about being served maggot-ridden meat. Eisenstein intercuts gruesome shots of the meat with the sailors' faces, to reinforce their degraded state. While the direct practice of Russian montage has been virtually non-existent since the 1950s, Eisenstein's work represents a huge step forward in the language of editing: his use of cutting to convey emotion is as radical as D. W. Griffith's use of panning shots to show battles on a huge scale in The Birth of a Nation.\r\n\r\nThere are also several moments in Battleship Potemkin which are exciting, or at least impressive. The Odessa Steps sequence, depicting a bloody but completely fictitious massacre, has entered the canon of all-time great scenes, and remains without question the best part of the film. The shot of the pram running down the eponymous steps was famously parodied in The Untouchables, which was itself parodied in the third Naked Gun film seven years later. But the scene is also memorable for its shocking moments, from the sight of a young boy being shot to the silent scream of a woman with shattered spectacles, an image which Francis Bacon used as the basis for several of his paintings.\r\n\r\nSo far, then, Battleship Potemkin would seem to be as much of a classic as it has been revered to be. But once we get beyond admiring its technical achievements, or experiencing brief shock at the violent moments, or gaining some small understanding of the context in which it was made, what we are left with is a lot more underwhelming and poorly constructed than its reputation would lead us to believe. Its flaws are not enough to completely turn our hearts, but all the admiration in the world can't make up for them.\r\n\r\nFor starters, the film is thinly written and poorly paced. Silent films relied primarily on physical expression to tell their stories and flesh out characters, since having actors mouth long speeches intercut with lengthy inter-titles would not be dramatically engaging. By using exaggerated movement and meticulous facial expression, the likes of Buster Keaton and Charlie Chaplin were able to convey in a second what the talkies would need a whole minute to say. This gave silent films an in-built modesty and efficiency, so that when they did run longer than an hour (or two, as Metropolis did), they usually earned the right to do so.\r\n\r\nEven at 74 minutes, Battleship Potemkin is about three times longer than it needs to be to serve such a simple story. Eisenstein's use of montage may generate a certain amount of emotion, but it has the side effect of dragging out the action long after the point has been made, and made, and made again. Compared to later propaganda works like Triumph of the Will, the point the film makes about class unity and power is insultingly simple, even to an audience who were potentially illiterate and therefore couldn't read inter-titles.\r\n\r\nWhile Eisenstein may have the subtlety of a hammer, he lacks the sharp edge of a sickle. There's no point trying to assess Battleship Potemkin in terms of characters, because the point of Soviet propaganda was to instil collective identity and prioritise class unity over the satisfaction of individual wants and needs. Complaining that there is no discernible protagonist, or that the only charismatic character is killed off after 20 minutes, is nothing more than a reflection of our own film discourse; we expect things to be a certain way because we have been taught that that is the only way.\r\n\r\nEven if we accept this, however, the film is massively overwrought and narratively fanciful. Because this is a propaganda film, it's a waste of time trying to separate fact from fiction, because everything has been dressed up both in the language of Eisenstein's editing and the political views it takes. But even with that level of acceptance, it is frankly ridiculous to believe that the whole fleet would refuse to fire on the Potemkin having been impressed by their bravery. Not only is it a huge anti-climax, it's so out of the blue and illogical that it threatens to undo whatever hard work Eisenstein had done up to that point.\r\n\r\nWorst of all, Battleship Potemkin fails because it does not cut the mustard as propaganda: it does not do what is says on the tin. Just as all good comedies should make you laugh, and all good horror movies should scare you, so a properly made propaganda film should draw you into the story or ideas so that you are convinced by them, even if only for the moment when the film is playing.\r\n\r\nPropaganda films are the exception to the rule that you cannot judge a film by its box office. Triumph of the Will worked because it appealed to ordinary men and women, many of whom didn't vote for the Nazis in the first place: it was a hit because, to quote Leni Riefenstahl, it \"impressed an audience which was not necessarily interested in politics\". Battleship Potemkin, which had all the distribution you could ask for, failed to become a popular hit. This is not because punters in the 1920s were stupid: it is because the film preaches to the converted.  The Party's message had become so saturated in popular art and culture that there was no need for anyone in the Soviet Union to see it.\r\n\r\nTime has not been kind to Battleship Potemkin. Certainly the decision of the Brussels World's Fair to name it the greatest film ever in 1958 looks every bit as foolish as the Academy's decision to give the Best Film Oscar to How Green Was My Valley over Citizen Kane. Its innovations in editing and structure still stand, and as an historical artefact it retains some degree of importance. But otherwise there is precious little to celebrate about it, falling short on an emotional level of both Griffith and Riefenstahl.",
            "review_date": "2011-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest movie ever to have made in Soviet Russia! The Odessa Steps scene is the most iconic of all featured scenes!",
            "review_date": "2011-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The great thing about silent films is that they have no language barriers. The visuals displayed on the screen and the score to accent the action convey a story of oppression, rebellion, and suppression. This film is more art than entertainment (although it is entertaining), as a single red flag breaks through the monotonous grey to invoke freedom. With the tense maritime battle building to a frenzied crescendo at the end, one can't help but wonder if their freedom might be cut short.\n\nPS - For those of you who aren't really into movies, this film is referenced a number of times with the scene of a baby in a carriage rolling down a long set of stairs.",
            "review_date": "2011-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Given its a silent movie its quite good. But this is the 21st century and I'm watching a silent movie. The times have changed. Two things noticeable. Firstly, the director was far happier to film ugly people than a modern day director would, which gives is a tinge of authenticity. Secondly, we don't do carte blanche propaganda like they did back in the day. Ha, wow that is some unashamed nonsense and political grandstanding.",
            "review_date": "2011-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergei Eisenstien's Battleship Potemkin is among the finest movies ever made and possibly the best of the silent era. Eisenstien was a pioneer of film form and his use of montage editing has influenced movies to this day. The Odessa Steps massacre footage is as powerful today as it was when first seen over 70 years ago. DO NOT pass up the chance to see this movie!",
            "review_date": "2011-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Five stars for cine-files who will recognize many film techniques decades before their time.  Amazing direction.  You have seen a lot of these scenes redone by other great directors, so why not spend an hour to see where those great directors got their ideas.",
            "review_date": "2011-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty decent, considering the vintage - although to be honest I wouldn't rush to see this type of film, even if it were made today, as the storyline doesn't particularly grab me.  The now famous Odessa Steps sequence stands out above everything else, and there is no doubt that this a fine acheivement, considering that cinema was a mere 29 years young when it was made.",
            "review_date": "2011-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fuck talkies, who needs 'em? Almost a century ago, a brisk, clean and focused masterwork surfaced to tackle ideologies like communism, inequality and insurrection. With nappy mustaches at every corner, Eisenstein tells a tale of a tyrannical Russian battleship and the discontent amid the sailors. Demise is surefire when military hostility and irascibility reach a pinnacle. The images will shock. The orchestral crescendos will amaze. A certain rhythm, which I can only imagine could be accomplished via editing prowess, makes this film unforgettable. ... Oh, and the sorcerer that looks like Albert Einstein fucked Jerry Garcia.",
            "review_date": "2011-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good and intense navy film set during the Russian revolution. I think foreign films in the '20s were at a peak of art, films like \"Metropolis\", \"Nosferatu\" and \"Faust\"",
            "review_date": "2011-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone's heard about this movie, but relatively few people have actually seen it these days. It's not the most fun to watch, especially given how differently its narrative works from what we are used to seeing, but there's no denying its creativity and importance in film history.\n\nThe film, which was commissioned by Soviet authorities to commemorate the 20th anniversary of the events which it depicts, is a re-enactment of the 1905 mutiny on the battleship Potemkin and the short-lived proletariat uprising it inspired. Contrary to the expectations we have of movies these days, the film has no central protagonist or, indeed, any well-developed characters at all. The focus is always on the groups of people, and so the contemporary viewer has no individual characters to identify with or invest it. This fits the purpose with which the film was made, but does make it seem a remote curiosity to us today.\n\nThe most famous part of the movie is the \"Odessa Steps\" sequence, in which a whole bunch of peasants get ruthlessly massacred by an anonymous line of czarist troops. It is indeed still an effective sequence, and the image of that stroller careening down the steps is still pretty scary. It's been referenced and parodied a bunch, and I think even Tarantino may have been at least subconsciously thinking of it for the climax of Inglourious Basterds, although in that movie our sympathies are with the people doing the massacring. \n\nThe film's director, Sergei Eisenstein, like many people who thought about film in his day, had a narrow and dogmatic conception of cinema. He thought there was only important film technique, juxtaposition through associative montage editing, and only one purpose to that technique, to stir revolutionary fervor among the masses. Obviously, film can and should do all sorts of things Eisenstein wouldn't have done with it, but I have to hand it to the commie bastard, he was good at that one thing (montage) he chose to focus on. He's like a guy who thinks you should only eat steak for each and every meal, but who does admittedly make a good steak. Eisenstein's use of montage, and the increasingly furious rhythm with which he cuts back and forth between different images, is still striking 86 years later. Even though the overall narrative of the film leaves a lot to be desired, the moments where it shines are undeniably well put-together. Watching it today is basically film-history homework, but it's an important homework assignment.",
            "review_date": "2011-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the most important and imitated films in history as it was the first to every have a montage, and it uses them quite often.  This technique is especially impactful in silent film (which this is).  The tension is build fantastically here as the images of working sailors, rampaging soldiers, advancing battleships, and fleeing townsfolk are edited to the beat of the tense music.  The movie is mostly about the working class overcoming the tyranny of oppressive leadership, and it is filled with propaganda (raise the red flag!).  Despite the somewhat bland story, the imagery and pacing definitely make this film worth seeing today.",
            "review_date": "2011-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well currently, I'm finally back at film school, so right now i'm taking a Understanding of Film Expression class and with most of that comes watching a lot of film in order to learn particular things about all kinds of film expression. So a lot of the reviews i'm going to write in the future are going to be films that I'm going to watch such as this film, 400 blows, The Graduate, and Bonnie and Clyde. So without further ado, I give you my ado to this excellent silent film; Battleship Potemkin.\r\n\r\nPlot: This is set in 1905 where a Russian crew od the battleship Potemkin create a mutiny against their officers and start to for a rebellion against the Tsarist regime. \r\n\r\nThis as clever but brutal film. The messed up thing to me was the stairs scene. no one was safe, not the little boy, not the mother or even her precious baby in that carriage. But what's messed up to me is that it didn't even actually happen during this particular event. It apparently was more something to put in the film to give an idea about that particular time. In fact, this film has been re edited by the government a few times to get rid of some of the more brutal moments. \r\n\r\nNormally I'd give you a section that list the main actors but there isn't really any in this film. In a sense, the crew is all one in fighting against their enemies. There are some named here and their but nothing to me that was exactly the most important character in the film aside from the character Grigory Vakulinchuk's brief part in the film. That aside, I'll just say that the acting was very well done and everyone did an excellent job with showing us these suspenseful or brutal events.\r\n   \r\n\r\nChoreography/Editing: They've done and excellent job with the choreography and editing. This film was very well shot and I liked what they really did with the editing. most of what they did in something suspenseful was repeatedly showing several things in some very quick cuts to build the suspense and acknowledge every single detail that happens. especially at the very end where the music slowly but surly gets louder and louder as it focuses on the ship and the squadron, the cannons aiming, the engines going like crazy and so on. It's a very good film to show to give the idea of giving suspense by making a lot of quick cuts.\r\n\r\n\r\nAnd that is my review for Battleship Potemkin. next class we'll be watching The General, and I look forward to what I may learn there.",
            "review_date": "2011-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin directed by Sergei Eisenstein. A class of film from silent-era, with astonishing cinematography and montage-work as portrayed by legendary Soviet Director Sergei Eisenstein. It is short in its duration but keeps the the story told in such a simple and thorough way, without (of-course) words to communicate; I guess it is a masterclass approach to gain such professional-skills. Great film Titanic, which James Cameron had said that he had worked out a story of romance so that audience would sympathize with the characters on the ship. Likewise, Sergei Eisenstein's conclusion that a plot of rotten meant with maggots had to be worked out so that audience would sympathize with sailors, about to station an uprising.\r\n\r\nA great propaganda film, I think even the other propaganda TALKIE film Oscar-winning All Quite on The Western Front, could less send out its message and theme, as much as Battleship Potemkin does being silent-film.",
            "review_date": "2011-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As probably the most influential of films made by the supposed father of non-linear storytelling, Battleship Potemkin looks at the hardships of the Revolution through the eyes of Soviet sailors, their captains, Soviet civilians, and even God himself.",
            "review_date": "2011-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A propaganda piece but this does not effect the power of this movie and its influence on cinema today.",
            "review_date": "2011-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unabashed propaganda but incredibly staged and filmed. The scenes of the Tsar's army firing on the citizens of Odessa are poswerful and mesmerizing.",
            "review_date": "2011-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even despite a primitive idea of narrative mechanics, The Battleship Potemkin ably works at mood, character, mise en scene. Well-steered and effective.",
            "review_date": "2011-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to be honest I was not sure what to expect before watching this movie.  I was slightly skeptical about whether or not I would enjoy watching it though...only because of the brief description I had heard.  Watching it, within the first half an hour, I was amazed by the strength of the imagery used in the film.  For example the first appearance of the priest on the battleship.  And somehow, even though the film was black and white the director still managed to use color symbolically.  There were many shocking scenes in this film, suspense, raw emotion, and brutal opinion throughout.  I personally think it is a masterpiece, certainly for the time it was made and even now.  To be so powerful in it's message, without dialogue, color, special effects, or enhanced cinematography.  Very impressed.  The only reason I am not giving it a 10 out of 10 is because I felt the ending was a tad too abrupt.",
            "review_date": "2011-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A revolution, wheater it be for war or peace, always starts with an opinion. That's what Sergei Eisenstein's The Battleship Potemkin is all about: the opinion that caused the uprising in 1905 in Russia. \n\nIt was not an immideate success, but it soon earned it's standard as the greatest propaganda film ever made and also stands as a symbol of revolution, as well the revolution for the craft of cinema with it's innovative use of montage editing.\n\n\nForever shall your memory be immortal, Sergei M. Eisenstein!",
            "review_date": "2011-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most significant of silent films. Broken up into five parts, three of which are phenomenal. It's amazing how tightly constructed the editing and score are to a movie made almost 90 years ago. Many sequences build quite a bit of tension and it's easy to understand why this was banned for decades for inciting action among it's viewers. Recommended stuff.",
            "review_date": "2011-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A revolution, wheater it be for war or peace, always starts with an opinion. That's what Sergei Eisenstein's The Battleship Potemkin is all about: the opinion that caused the uprising in 1905 in Russia. \n\nIt was not an immideate success, but it soon earned it's standard as the greatest propaganda film ever made and also stands as a symbol of revolution, as well the revolution for the craft of cinema with it's innovative use of montage editing.\n\n\nForever shall your memory be immortal, Sergei M. Eisenstein!",
            "review_date": "2011-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good old timey stuff.",
            "review_date": "2011-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin is a classic film with vivid images. It is about a great Russian naval mutiny and a resulting street demonstration which brought a police massacre. The cast is excellent. The screenplay is well written. Sergei M. Eisenstein did a great job directing this movie. I enjoyed this motion picture because of the drama and history. Battleship Potemkin is a must see.",
            "review_date": "2011-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Monday, June 27, 2011\r\n\r\n(1925) Battleship Potemkin\r\nWAR\r\n\r\n  With a running time of an hour and 10 minutes, this is a film base on fact stating the purpose of the known uprising of Russia's revolution which started in 1905 about the wealthy Czar's unfair treatment to it's commoners, especially when an upper class treata class of lower rank  as lower than a dog, and surprisingly this kind of practice is still happening, such as places around Libia where corruption exists among the wealthiest!  Extremely intense and symbollic and may be a film ahead of it's time which can be labelled as one of the most influential films of all time.\r\n\r\n3.5 out of 4",
            "review_date": "2011-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only real \"flaw\" would be the story, but this is a rare time when the story does not matter as much. Either way, it is clear the film is a masterpiece...",
            "review_date": "2011-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this at Cine Lumiere at L'institut Francais and, yes, that is as wanky as it sounds. Liked the subject matter, liked the montages, loved the scene on the stairs, lots of stairs involved both on and off the ship. Propaganda done well.\n\nMemorable moments:\nFist/Anger montage\nTracking shot on the stairs\nMusic at the climax",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow-moving, repetitive, over-dramatic, tub-thumping and dull. Its official, I'm a film heathen. Watching Battleship Potemkin reminded me of reading Marxist polemics at uni... sincere, but dry dry dry. That's my excuse.",
            "review_date": "2011-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seen with modern eyes much of the movie is a bit clunky and heavy with propaganda (it may have even seemed heavy with propaganda then) but it had tremendous influence on the way films were made, contributed a great deal to the vocabulary of cinema, and there are segments which are affecting and still stirringly effective nearly a century later. Merely coordinating the masses of people moving through some of the scenes is an impressive feat by itself.",
            "review_date": "2011-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "more famous for the Odessa steps than the entire film, still it's a gripping piece of silent film.",
            "review_date": "2011-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastically crafted and emotionally moving, but wrong.",
            "review_date": "2011-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate to say it but I thought this movie was super boring.  The only part of it that I enjoyed was the Odessa Steps scene because we got to watch all those dumb Russians get killed.  I laughed everytime some dumb old lady got shot or the soldiers killed some kid who got in the way.  It was like The Untouchables just not as good. I'm being sarcastic.  Brian DePalma did it way better. It's just a shame he didn't think of it first.",
            "review_date": "2011-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As influential in its own right as Birth of a Nation was a decade prior, Battleship Potemkin is a masterful example of the power of editing to force an emotional response in the viewer. From the harsh living conditions and class gap to the famous Odessa Steps massacre sequence, Eistenstein's film is an agitprop ode to revolution. There is little narrative complexity here, but what the film lacks in plot it more than makes up for in poetic style, resulting in one of the most defining works in the history of cinema.",
            "review_date": "2011-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this much better than I thought I would. The Odessa stair sequence still stands out as one of the best, most important film sequences I've seen. A very good film.",
            "review_date": "2011-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty hard to fault one of the most influential movies ever made. Even if the Odessa Stairs sequence has been copied to death in homages or even parodies, the original scene, with all the violent shots entact is still one of the most powerful scenes ever assembled. Although since that one scene is what we all remember, most forget the rest of the movie, and the actual history of the mutiny and the changes it made. The editing of the movie entirely still stands today as a visual marvel that doesn't feel old. Pretty impressive feat almost 90 years later.",
            "review_date": "2011-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For those of you with no experience of silent cinema (shame on you!), this is a fantastic introduction. This is, quite simply, an unforgettable cinematic experience, one that everybody who loves movies should have.",
            "review_date": "2011-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing film , a MUST for all you Menshevik revisionist lilies out there that have lost their taste for fight !!",
            "review_date": "2011-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If only the whole movie was as good as the Odessa Steps sequence is.",
            "review_date": "2011-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Undeniably breathtaking [in an almost too literal manner], Sergei M. Eisentein's pivotal masterpiece is quite simply an exhilarating experience from start to finish. Even with it's more dated elements [the Russian militaristic propaganda for one], the film never loses it's power over the audience. Much of this is due to Eisentein's unsparing approach to the material, Edmund Meisel's pulse racing score, and the benchmark quick editing style for which the film has become renowned. If film is thought primarily as a medium of sight and sound, I cannot think of one greater than Battleship Potemkin.",
            "review_date": "2011-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When the downtrodden workers stand up to there masters and fight back, they become heroes an icon against tyranny. Yet their victory comes at a great cost. The horrible imagery presented in this film shows the terrors of war, and shows that revolution can cause just as much harm as doing nothing can. One of the all time greats.",
            "review_date": "2011-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Revolutions are complex things that rise from the most basic of grievances - want of shelter, work, and (most often) safe, ample, nourishing food. Some historians have pointed to the \"bread marches\" of Russian mothers and wives in the winter of 1917 as the tipping point of the communist revolution in that country. They were loosely following the example set by a group of disgruntled, demoralized, and underfed sailors fighting in Tsar Nicolas II's ill-fated 1905 war against Japan. \"Battleship Potemkin,\" a classic silent film directed by the great Sergei Eisenstein, dramatizes this struggle at sea and the subsequent fervor in the port city of Odessa. These protests are unabashed displays of patriotism and, ultimately, sacrifice. Despite its rousing ending, Eisenstein feeds no illusions about the long road that lies ahead for discontented.\n\nAmazingly, I think \"Potemkin\" is my first encounter with a full feature-length silent film; it has been recently restored by a German film museum. But it is definitely not my first political thriller, and I can say that it is easily better than most modern ones. \n\n\"Potemkin\" is almost constant motion. The natives grow restless due to worm-ridden meat rations and the commander tries to make an example of the anyone who dares to point out the harm in this. What occurs throughout the rest of the film is finely choreographed chaos that carries a convincing sense of constant peril. It's not too much of a stretch to say the film nothing but one long, exhausting perilous precipice of a story: hundreds of actors pack the frame under a looming gun turret, heads pop out of portholes and brandish rifles, men are hurled from railings and into the deep. There are far more symbols than characters. Eisenstein aims to create agitprop that identifies the enemies of the people - clergy, aristocracy, anti-Semites - rather than nuanced drama that examines where they all come from.\n\nEisenstein's true extremism lies not in his politics but in his technical chops. The famous bravura sequence depicting a massacre of protesters in solidarity with the red mutineers still mesmerizes. Its influence is positively egalitarian,  inspiring operatic greatness and blockbuster hackdom in equal measure.  Onscreen space shrinks rapidly, suggesting the Tsar's power to immobilize and confine his subjects is vast and successful in making every rejoinder for the rights of the people into a literal uphill battle. This one, though, is not nearly as pitched as the others in the film. It is fought by citizens, not soldiers, and quickly tumbles out of sight at the point of a gun. Therein is \"Potemkin\" - a war film that is about nothing but the war outside our own homes.",
            "review_date": "2011-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure how revolutionary it was at the time, as my knowledge of film pre-1925 is pretty limited, but I've read about it quite a bit.  I really wasn't expecting much, but it really delivered on the excitement, especially for a non-talkie.  It would be great to watch this with someone who really knows movies",
            "review_date": "2011-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I completely underestimated the silent film. This is an amazing work of art.",
            "review_date": "2011-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The correct release date for this is 1926.",
            "review_date": "2011-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Drags a bit in the middle, but still some wonderful stuff here.  The famous stairway scene remains one of the most powerful moments in cinema.",
            "review_date": "2011-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this in a Film Study class in high school. It's educational when it comes to studying film but not really enjoyable or fun to watch by any means.",
            "review_date": "2011-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still surprisingly shocking and engrossing, the set-piece on the Odessa steps and the  finale as two battle-ships prepare to face each other are abstract, rhythmic montage editing masterpieces.",
            "review_date": "2011-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin is best silent war film ever in 1920's.",
            "review_date": "2011-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can see how technically important it was, but frankly it's a chore to watch - it keeps telling you how to feel without justifying those feelings.",
            "review_date": "2011-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russian history meets revolutionary, masterful direction in this moving piece. After so many years, it's not surprising that its impact has been somewhat diluted, so most might find it kind of boring. Still, no silent film has moved me this much (and I'll cite the scene at the steps of Odessa as the obvious example). I can see how this movie changed cinematographic technique for many directors and editors in the years to come. A definite must for film history geeks!",
            "review_date": "2011-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "now i understand what that stairs scene is all about. it really gives you the chills.",
            "review_date": "2011-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film classic that every film lover should see.",
            "review_date": "2010-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful and important movie full of iconic moments that will echo through film industry for decades. In itself it's essentially a silent movie commisioned as a tribute to the 1905 Russian revolution, superbly edited by Eisenstein to maintain a tension and poignance seldom recreated by any subsequent film maker to such a degree. Undoubtably in a visual sense it has'nt aged well, and is possibly not one for repeated viewings, nonetheless, it must be seen at least once, if only to bask in it's political importance and consider it's incredible legacy.",
            "review_date": "2010-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most powerful pictures i have ever seen",
            "review_date": "2010-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good Russian film. The massacre at the Odessa staircase was powerful drama.(26)",
            "review_date": "2010-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aged 16, i can see the thrill of watching the latest, action packed, computerized movie, however, there's no denying the brilliance of this movie. Starting slowly possibly, the film kicks in and, without doubt, the 'Odessa Steps' sequence remains my favorite scene of all time.. This film certainly opened the door into silent film for me.",
            "review_date": "2010-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film holds so much emotion and expressionism that you wonder how you could feel for those caught up in the war. I found myself actually rooting for the \"good\" side. The Odessa Steps sequence shows such intensity and shock value that it makes me wonder how those who saw it during its release must have felt.",
            "review_date": "2010-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4 Stars out of 4\r\n\r\nSergei Eisenstein's The Battleship Potemkin hurdles past cinema into the heart of history itself. It manipulates montage to a tee and also manipulates our sympathy to the point that the film is a transgressive angle to historical analysis. Never have I seen a film that made me want to root, cry, squirm, and then applaud. Eisenstein's film is labeled, in a simple sense, as propaganda. It gives the film a harsh label, and not one it deserves, because it evokes feelings that, despite Eisenstein's conceited ways, never feel synthetic.\r\n\r\nThe film released 8 years after the beginning of the Bolshevik Revolution, where Communist took on an age of its own. Russian socialists began to rebel against the elitist tsarists and violence, pain, and civil animosity was overwhelming. As a silent film, The Battleship Potemkin works best. In all the quiet, the film is juxtaposed by a visual that moves vigorously. In the silence, the mayhem surrounding evokes repression and the emotional strife of sympathizing with our inferior heroes.\r\n\r\nWell, the point is these heroes are no longer tolerating their subjugation. What began as a quarrel over food rations snowballs into a grand-scaled uprising on the ship - you guessed it - the Potemkin. The ship holds a triumphant stance; it travels along the waters at ease and aggressive power. The sailors move throughout in coordinates but feel disjointed from each other and discontent with their duties. \r\n\r\nSoon, all hell breaks loose. They rise up and Eisenstein emphasizes courage over disruption. The narration, written by Eisenstein, is expressed mostly in dialogical passages that evoke urgency. The music, orchestrated (from the version I saw) was by the Club Foot Orchestra who nail the daringly ostentatious epic soundtrack. \r\n\r\nThe Battleship Potemkin is divided into episodes, which give the audience an obvious direction towards the emotional impact. Emotion, in this film, is delivered through set pieces, that's power is assured through the film's brutal courage. During the famous Odessa Staircase sequence, the Tsar's Cossacks march in a mechanical and highly foreboding manner towards a crowd of rioting civilians. They fire at the people, as the bullets tare through the crowd and into our emotions. After we are perturbed by Eisenstein's startling sequence, a baby carriage tumbles down the stairwell as the Cossacks fire frantically. Eisenstein power is pure: no one was afraid to shoot the baby - which symbolically, and fairly so, refers to the neglected, fragile, yet very healthy Bolsheviks.\r\n\r\nEisenstein is said to have made the film based on the Kuleshov school of filmmaking, which emphasized splicing images together to create the most emotional resonance. The film's weight even affected ruthless Nazism and figures of that political position who became fascinated by the film's ability to epitomize the pleasure of revolt and chaos. The Battleship Potemkin is a turning force against authority but it also believes in authority in another sense - the coerciveness of the mutineers. \r\n\r\nJoseph Stalin would ban the film during his reign when the Comintern ceased to promote world revolution and mutiny among the navies of capitalist countries. It was eventually repudiated by Nazi Germany and tagged 'X Rated' until 1978. Despite its contention, the film is appreciated, homaged, and transcended in contemporary cinema. De Palma revitalized the Odessa Staircase sequence in The Untouchables - great film. Even George Lucas reflected the episodic sense of chaos in Star Wars: Revenge of the Sith. \r\n\r\nSo where does this leave the film? A masterwork, slow at times (as I find most silent films) but it conveys itself in a way that a silent film only could: restrained, elegant, yet relentlessly exuberant. It should be watched by all film and even history students because it manipulates the true effects of cinema, while balancing the subjective vulnerability of history. When that woman bled from her right eye, Eisenstein presented something uncanny, disturbing, and unknowable. We never could understand the agony of those neglected. Eisenstein tells us why we always root for the underdog in cinema.",
            "review_date": "2010-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Historically accurate in terms of the 1905 mutiny that occurred on the Russian Battleship Potemkin against the Tsarist regime.It's all about sedition, insurrection and a propaganda film after all. Such an important film in the history of cinema but from an spectator point of view, I liked more Mother, an utterly underrated film and October:10 Days That Shook The World both by the great Eisenstein. I guess this film is so famous because it was the movie that saw the  birth of film montage.",
            "review_date": "2010-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly effective, sweeping film from the mute era. Certain scenes from this historically wildly inaccurate propaganda film are so well-known and remembered that they are actually accepted as history (cf The Odessa stairs massacre, which is completely fictional).\n\nOne can understand why: the powerful images, the trampling of innocence by robotic uniformed monsters, the ultraviolent vibes, and the compelling instrumental score all serve to almost make you wish it had actually happened so you can wallow in your righteous indignation.",
            "review_date": "2010-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are some nice sequences throughout this film, the Odessa steps sequence is rightfully famous, but the film comes across as a tad hodge-podge. Individual sequences are brilliently edited, but a tad more attention needed to be payed to each individual frame in many instances. Some type of flow between the sections would have been nice as well. However this film still holds up  by way of the strength of the editing.",
            "review_date": "2010-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally, I've experienced the baby buggy scene!",
            "review_date": "2010-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great piece of Cinema History and a good view even today. Easy to see how Eisenstein contributed to film.",
            "review_date": "2010-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eisenstein Is The King Of Montage, And This Film Proves Just That. Fantastic Editing And Direction.",
            "review_date": "2010-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3.5: Potemkin is obviously an incredibly important and influential film, but I can't say I particularly enjoy it, except from an analytical point of view.  Comparing it to other pictures from the era is fairly laughable.  Nobody was editing like this.  I would go so far as to say that the editing is much closer to the style of the French Nouvelle Vague or contemporary cinema than it is to any cinema from the 10's, 20's, 30's, or 40's.  The juxtaposition of unrelated images in order to maximize empathy and emotional impact was pure genius.  It seems incredible that what was designed to be a simple propaganda film to commemorate the rebellion on a Tsarist vessel in 1905, which subsequently spreads to the port city of Odessa, turned to be a lasting work of art and influence.  However, it certainly isn't the only film of its kind.  Goebbels and the German's enjoyed it so much it undoubtedly influenced their sponsorship of Riefenstahl's Triumph of the Will and Olympia, both masterpieces of propaganda in their own right.  Eisenstein's work broke down some of the barriers relating to the use of images in the cinema, even if film everywhere took a big step backward with the advent of sound.  The scene on the Odessa steps is remarkable, as is the gradual build up to the potential naval battle in the end.  It actually reminded me of the end of Last of the Mohicans, which I recently watched, especially with the pounding and repetitious score on the Blu-Ray version.  The picture looks rather remarkable considering it was made in the Soviet Union around 1925.  I couldn't help but feel that Eisenstein wasn't fully invested in the subject matter though.  There were numerous instances where I could imagine him making a much stronger case for rebellion.  Perhaps he didn't feel he needed to justify the rebellion, given his audience, but it seemed like a fairly halfhearted endorsement to me.  The picture definitely provides a unique and interesting view into the collective culture and mind of Russia.",
            "review_date": "2010-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lil dry at first but it does deliver in the end",
            "review_date": "2010-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That contains all of the rhetoric of the film in this film.\nThe best silent movies.",
            "review_date": "2010-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, the montage effects defines the art form and the shot composition is pretty close to perfection.  But what is often overlooked is also the power of the script, necessarily minimal but perfectly judged.  A monument to collectivism, Sergei builds a story based largely around shots of massed groups taking action against individual tyrants, with virtually no individual characterization.  This movie is the purest antidote to Hollywood blockbusters",
            "review_date": "2010-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If this isn't shown in your film history/appreciation class, you're going to the wrong school.",
            "review_date": "2010-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eisentsein's \"Battleship Potemkin\" is an undeniable game changer for film and he ushered in a whole new way of perceiving editing theory, but as for the story?... well, it's extremely overwrought, melodramatic and nonsensical, well too me at least. Just because it features fine examples of the birth of a vision, editing and scoring does not mean what were watching is good. Sure, it's a very influential picture, but as far an enjoyment goes, it's batting zero.",
            "review_date": "2010-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Propaganda films have ranged in variety over the past hundred years or so, but the best ones oftentimes remain classic not just because of their subject, but the way they are filmed, what they change about the state of cinema, and what they intend to change in their viewer's mindset. After seeing \"Triumph of the Will,\" I had thought I had seen the masterwork in the genre of propaganda films, but this treasure is beyond what is commonly referred to as propaganda. Taken from a true account of a ship mutiny in 1905, Sergei Eisenstein changed the way films were made, especially because he was one of the first to use montages. These five sequences, spliced together to create a narrative about the Bolshevik Revolution to come, made for emotional turmoil on the part of the viewer. Yes, there are some overtly political elements and definitely enraging sequences, but this film does not shrink from reality. The story goes that these shipmates were being fed rotten meat infested with maggots, that citizens are murdered, bloody in the streets, and that these men, fueled by the good tide of Communism, rose to the challenge of overthrowing their oppressors. It's definitely a film that leans to the goodwill of the Russian government, but there is also some shocking imagery and poetic visuals that will astound you. It's simply awe inspiring how some of the more violent and cruel deaths of these citizens are actually shown even though the times were ridden with censorship. An old woman is shot through the eye, and her blood runs down her chin while her glasses sit broken on her face! The visual alone will haunt your dreams, but that's not the worst death to accompany this film. There's also truth to this violence, and so it becomes even stranger to watch the film, knowing it's more than a propaganda film, but one made to encroach sympathy and anger for the ills of old. Breathtaking for its simplicity and yet irrevocably strong, it definitely stands the test of time.",
            "review_date": "2010-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, it kicks the shit out of Birth of a Nation, at least.",
            "review_date": "2010-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films to come out of the silent era and foreign films. A film that is 85 years old and is still as powerfull, shocking,iconic and awe inspiring as when it still came out. The film also arguably helped to shape montage and general film making more than anyone other DW Griffith. Eisenstein's film is beyond propaganda and is a masterpiece.",
            "review_date": "2010-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The bit on the steps is powerful stuff-easy to see why its so influential.",
            "review_date": "2010-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First time watching the entire film. I really liked it!",
            "review_date": "2010-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies ever made.!!",
            "review_date": "2010-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For some reason Iâ\u0080\u0099ve never seen this from beginning to end. Sure, Iâ\u0080\u0099ve seen the Odessa Steps countless times (especially while in college) but this is my first time seeing the entire film. Well, it certainly is impressive and deserves its praise. So many great shots throughout and awesome editing.",
            "review_date": "2010-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had heard a lot about this fiolm by Eisenstein, but never seen it until now.  Yes, it is a masterpiece of propoganda.  The rebellion of crew of the battleship stemming from one spoonfull of borscht.  The oppression of the crew by the officers, and the oppression of the people by the imperial army was enough to light the fuse of rebellion.  Cossacks killing women and children whipped the people into a frenzy...\r\n\r\nIf you are interested in politics, propoganda, Soviet history, or related subjects you need to watch this film.",
            "review_date": "2010-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Soviet propaganda film making at it's finest.",
            "review_date": "2010-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, but somewhat boring.  I didn't get to watch the entire movie yet, though.  I plan on watching it again.",
            "review_date": "2010-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Historic Mater Piece",
            "review_date": "2010-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic silent by Eisenstein extolling the virtues of the 1905 uprising of Russian sailors against their Czarist superiors (a precursor to the great October Revolution of 1917) is still held a staple of film schools around the world, and rightly so - though the film has certain technical limitations, it remains a remarkable effort considering the age in which it was filmed and a valuable historical artifact of filmed propaganda as well. The opening act on the title ship are somewhat static and pedestrian, but it is when the body of the dead sailor Vakulinchuk is deposited on the docks of Odessa, spurring a huge procession of oppressed Russians, that the film kicks into high gear - the montage of images combining close-ups of grieving workers interspersed with the quick-cut editing of clenched fists and angry eyes gives the film an astonishing amount of coiled energy which is finally unleashed in the famous Odessa Steps sequence, with the strident motif of faceless boots and rifles marching downwards toward the panicked chaos of the crushed mob - and of course, the terrifying and iconic sight of an out-of-control baby carriage. Unfortunately, the third act can't keep up the same amount of tension - Eisenstein seems constrained by the limitations of filming at sea. However, this film is a must for students of cinema and world history.",
            "review_date": "2010-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is only when one is confronted with artistry of this supreme kind that one sees what film can and must be.\r\n\r\nIn Eisenstein\u0092s The Battleship Potemkin silent film and film in toto has found its ultimate expression. This is, quite simply, the greatest film of all time.",
            "review_date": "2010-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is only when one is confronted with artistry of this supreme kind that one sees what film can and must be.\n\nIn Eisensteinâ\u0080\u0099s The Battleship Potemkin silent film and film in toto has found its ultimate expression. This is, quite simply, the greatest film of all time.",
            "review_date": "2010-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great and amazing epic here, even though it's just a little more then an hour, about how Borscht caused a revolution. Eisenstein fills the screen with image after image of power, and it's edited into amazingly tight montages. A must for film fans, maybe a little much for your normal movie buff, but hey, it's an hour to kill, and it'll be worth your while.",
            "review_date": "2010-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Naturally it's a little boring, but this is silent film at it's most profound and visionary through innovative film editing and realistic violence. It's up there with The Bicycle Thieves, The Third Man, and Citizen Kane. 97/100",
            "review_date": "2010-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Comically exaggerated versions of good and evil are paraded before the ignorant masses in order to inspire a great emotional response...  No it's not the World Wrestling Federation, it's 1925's Battleship Potemkin, a piece of early Soviet propaganda from director Sergei M. Eisenstein, who makes great and, pardon the pun, revolutionary use of the montage.  The storyline is simple: some sailors, tired of being served rancid meat, revolt and take over their ship.  One of the men is killed by the officers, and when his body is taken back to shore, a giant impromtu memorial is created by the citizens of the town.  The czar's army is sent in to squash the memorial/revolt, and several women and children are killed.  Although it's supposed to be a historical drama, most of this story never took place, and was embellished in order to generate a bigger, more passionate response from the audience.  The film was so powerful in it's time however, that it came to be viewed almost as a documentary.  Hitler's propagandist called this one of the greatest films ever, and it shows the proper way in which to shape movie-goers opinions using the most suggestive images.  I found it to be on the trite side, and when it goes for the gut, it's clumsy and obvious.  The much lauded stairway sequence is amazing though, and it truly inspires horror with it's graphic depictions of violence.  But one great five or ten minute scene does not a great film make.  I can overlook outrageously over the top silent film performances if they don't get in the way of the story (Birth of a Nation is one example of great filmmaking overcoming distasteful subject matter and performance), but Battleship Potemkin didn't engage me with it's one-dimensional story.",
            "review_date": "2010-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Comically exaggerated versions of good and evil are paraded before the ignorant masses in order to inspire a great emotional response...  No it's not the World Wrestling Federation, it's 1925's Battleship Potemkin, a piece of early Soviet propaganda from director Sergei M. Eisenstein, who makes great and, pardon the pun, revolutionary use of the montage.  The storyline is simple: some sailors, tired of being served rancid meat, revolt and take over their ship.  One of the men is killed by the officers, and when his body is taken back to shore, a giant impromtu memorial is created by the citizens of the town.  The czar's army is sent in to squash the memorial/revolt, and several women and children are killed.  Although it's supposed to be a historical drama, most of this story never took place, and was embellished in order to generate a bigger, more passionate response from the audience.  The film was so powerful in it's time however, that it came to be viewed almost as a documentary.  Hitler's propagandist called this one of the greatest films ever, and it shows the proper way in which to shape movie-goers opinions using the most suggestive images.  I found it to be on the trite side, and when it goes for the gut, it's clumsy and obvious.  The much lauded stairway sequence is amazing though, and it truly inspires horror with it's graphic depictions of violence.  But one great five or ten minute scene does not a great film make.  I can overlook outrageously over the top silent film performances if they don't get in the way of the story (Birth of a Nation is one example of great filmmaking overcoming distasteful subject matter and performance), but Battleship Potemkin didn't engage me with it's one-dimensional story.",
            "review_date": "2010-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The tensions and turmoil of the Russian Revolution are vividly evoked in \"Battleship Potemkin\", a finely shot and superbly edited silent film whose influences on cinematic technique continue to echo on through the movies of today. Among such influences are the use of dissolves to give the illusion of images fading into frame as if ghosts, and the use of rapid montage which has become a staple for action sequences ever since. The most unforgettable application of this method is in the brutal massacre scene, shot on the steps of Odessa where it actually occurred in 1905. But the photography and editing are only one reason to watch this film, for it is also a stirring story of social upheaval. Director Sergei Eisenstein initially intended to tell a revolution story with larger scope, but instead, wisely chose to focus on a single event and then extrapolate to a bigger picture using symbolic images, such as worms crawling on dead meat representing the belittled masses, a pair of glasses ingeniously representing the blindness of the government, and three quick shots of three stone lions that represents the waking of an angry people who won't stay quiet anymore.",
            "review_date": "2010-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Follows the style of Eisenstein's first full-length film, Strike, with its strong imagery of clenched fists, walls of impenetrable authority figures, and violence against the innocent. They are films chronicling another time, in a different place, where collectivism is held high above individuals. I was drawn into this film more than Strike, but they both jar me profoundly, in a negative way. I enjoy the cinematography greatly: Eisenstein has a great eye for powerful shots that stir emotion. But the plot here again feels messy and scatter-shot. The people of Odessa decide to assist the Potemkin's crew in fighting for a better country, but then they are mercilessly slaughtered while the Potemkin looks on...not a very helpful crew! This film, more than the first, smelt like propaganda, and maybe that's why it is so wildly adored, for the influence it had in Russia and abroad. I suppose this would feel like a grander film if I didn't already know how the Communist movement would be nearly as bad as Tsarist Russia. It makes the movie ring hollow, despite its attempt to make the sailors heroes. I felt like they were misled.",
            "review_date": "2010-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not so much a fan of silent films, but this one has some strong attributes. First, the red flag in the middle of the black and white is fascinating. Second, the score is great. Third, the footage of the citizens from Odessa being attacked by the soldiers is shockingly incredible. This silent film stands out from the others. Despite me not being a big of non-talkies, this may be worth a re-watch, just to see it a second time and I might possibly like it better.",
            "review_date": "2010-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eisenstein has created a visual masterpiece, revolutionist propaganda that stands as one of the most influential movies ever made.",
            "review_date": "2010-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "still good love the montage work",
            "review_date": "2010-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I must thank You Tube, to finally see a film I heard so much about but had never seen. I have to keep reminding myself what they had to work with in the mid 1920's and by doing so I can really appreciate the vision of Eisenstein. The more you see it, the more you see how many, even thousands of directors have copied on camera angles, building suspense etc. It is one of the true greats that is rarely shown, where today all i see is merchandised popcorn nonsense.",
            "review_date": "2010-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Any student of film in any capacity has seen or needs to see this film. It's essentially filmmaking 101.",
            "review_date": "2010-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Pre-Classic ! Great visuals, interesting  musical score and Revolution!",
            "review_date": "2010-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film, it really is as amazing as everyone who has seen it says it is.",
            "review_date": "2010-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard to properly rate an 80-year-old silent propaganda film for the Russian Revolution when I am an American citizen in 2013. How can I saw this is or isn't as powerful as it is or isn't? I get what is conveyed, but the film goes from brilliant to melodrama to overdone to perfect. The Odessa Steps are this film's real contribution to cinema, and they are likely the only reason most people will view this film.",
            "review_date": "2010-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Damn it! I have just recently made my top 100 fav movies,now i think i need to change it,Masterpiece! Eisenstein at his best!",
            "review_date": "2010-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For it's time, this was an incredible movie.  If someone who had no understanding of movie history were to watch this, they would get little to nothing out of it.  However, if you do have some knowledge or interest in movie history, this is a very important movie.  The editing techniques developed by Eisenstein were revolutionary.  So many movies have taken something from this film or paid tribute to it in one way or another.",
            "review_date": "2010-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sound: The orchestral score written for this film synchs well and helps drive the tension and energy of the film. There even is am homage to Tchaikovsky's 1812 overture by using Le Marsellaise in the score.\r\n90/100\r\n\r\nTechnical: Poor use of the ship model. Eisenstein breaks the 180 degree plane a couple of times. The montage editing drives the pace and tension of the film. Excellent use of framing and camera angles.\r\n95/100\r\n\r\nNarrative:  Episodic in 5 parts but it flows together. Weak ending if the film was not for propaganda use.\r\n100/100\r\n\r\nActing/Character: Excellent acting for the era. Eisenstein is not afraid of using close ups of the supporting cast; great faces too. Superb use of the different ranks and groups to signify the proletariat, bourgeoisie, and the elite classes; for the propaganda use.\r\n95/100\r\n\r\nDid I like it: Yes, but if the ending were true to the real actions of the Soviet Union the ending would have had more bloodshed.\r\n90/100\r\n\r\nArtistic merit: Excellent use of montage, controversial subject matter, and a film with a history of being banned or edited. This films influence on setting standards for future films weighs heavy here. It also shows the power of a \"silent\" film.\r\n100/100\r\n\r\nTotal score 95/100",
            "review_date": "2010-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best classic.",
            "review_date": "2010-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is simply a masterpiece. BP easily joins the ranks of Citizen Kane and The Birth Of A Nation. I must have watched this over a dozen times and never seem to be tired of Sergei Eisenstein's picture.",
            "review_date": "2010-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice film which was silent as it was an old film which was released in 1925... There r many faults in editing and direction but in that time it was really a big brave to take such a film with such a massive crowd people who contributed a lot... This was the times a long film which make u remember about cinema how long it had come from 1925... The battle was not shown well at the climax but the dialogues which screened makes us to understand in a simplest way... Without the dialogues on the screen its very difficult to understand this film... congrats for the hard work done by everyone for this film...",
            "review_date": "2010-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute milestone in film history and a triumph for its director Sergei Eisenstein in every way. The  Odessa steps sequence is perhaps the most famous movie scene ever. The whole movie is a joy to watch. Don't miss this one!",
            "review_date": "2010-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth the Odessa staircase sequence alone. The rest of the film was less than noteworthy. The fact that they can put on a scene like the Odessa steps back in '25 shows how amazing Eisenstein was and how much of an impact he had on the future of cinema. I wasn't blown away by the film, but the Odessa steps sequence will impact me as a filmmaker from now on.",
            "review_date": "2010-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie to be admired more for its impact on the progression of cinema as an art form than as a good film in its own right.",
            "review_date": "2010-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "four stars for the odessa staircase. otherwise dull & banal.",
            "review_date": "2010-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scary horrible war film; you're doing it right!\nThis is a very difficult watch (nout just because it is silent and Russian) but you'll feel accomplished if you get all the way through.\n\nJust make sure you have some sweet tea and Prozac on standby.",
            "review_date": "2010-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most important films ever made.",
            "review_date": "2010-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sure, Eisenstein's classic of montage & propaganda shows its age, but it retains a dynamic charge that can't be denied.",
            "review_date": "2010-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HAD to watch it for film class but would never CHOOSE to watch on my own. Having said that I think it's a valuable contribution to film",
            "review_date": "2010-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this kind of films, even if they are so old and mute. A real classic.",
            "review_date": "2010-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Purely on a craft level, the editing, for it's time, was unbelievably fast and concise. Not many silent films can claim to be pulse quickening.",
            "review_date": "2010-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Montage at its finest! Such a significant film not only socially, emotionally, and politically, but also artistically. 'Bronenosets Potyomkin' or 'Battleship Potyomkin' would be one of the greatest films in the world. Sergei Eisenstein's masterpiece is a shocker.  Excellent film editing, cinematography, production, and so on.\n\nIt is a story of revolution, in which heroes and freedom fighters began to stand up to tyranny and autocracy, even if they have to be dead to get rid of them. It started with a violent mutiny on the battleship where crewmen had had enough of the mistreatment of their superiors. Because of the death of one, people cry out for justice. The most memorable scene in the Odessa staircase underlined the film's dramatic intentions. However, it is not my favourite. I liked more the scene where the camera shots from an elevation the exodus and lining up of people while descending the steps. The transition from empty to crowded steps is ground-breaking.\n\nThis would be one of the films that you won't get tired of watching again and again, analyzing, and connecting with its message. An excellent silent classic. Truly a film you must see before you die.",
            "review_date": "2010-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best editing jobs ever done on such an early film. Well-used techniques of inter- and intraframe narrative. The \"silent\" film does a great job of establishing narrative and dialogue, just through the use of shots, lighting, editing and score. The obvious propagandic motives are entertaining too!",
            "review_date": "2010-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very inovative for it's time. Strong political propaganda and it may be considered a little bit too gory for that time.",
            "review_date": "2010-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Look back through film history and one of the most iconic and important films you will see mentioned is Sergei Eisenstein's Battleship Potemkin. Eisenstein was one of the first directors to realise the importance of visuals as a storytelling tool, as important to the emotional telling of the story as every other element. He introduced the use of montage and revolutionised the way films were made during the time period, technically and visually. Full of searing images and real emotion, Battleship Potemkin builds tension and fear expertly, leading to the famous and iconic final scenes at the Odessa steps. The film is also important in an historical context too. A real classic and a milestone in cinema, Battleship Potemkin can be hard work but is well worth your time, espically if you're interested in the evolution of filmmaking.",
            "review_date": "2010-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Contains the most important scene in film history",
            "review_date": "2010-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the cinematic classics and even if you were a film student this is a classic wok of cinema and really is as motivational even if it was used as propaganda in its inception. Can't say I would watch it more than once so it cannot get the five star rating.",
            "review_date": "2010-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Revolutionary in its time, still very impressive.",
            "review_date": "2010-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "compelling imagery albeit dated agitprop",
            "review_date": "2010-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Along with its visual achievements, the Battleship Potemkin also displays the worst propagandist features. The movie has utterly one-dimensional characters: spineless and evil Imperialists as well as heroic and oppressed Comrades. \n\nThe visuals are memorable: A hero gets shot in the back. The \"imperialists'\" shooting of a child is placed in clear display. At another point, the classic scene of a pram taking ages to begin its roll down a flight of stairs where it is precariously positioned is shown. This probably led to a lot of imitators allowing those painful seconds to pass very slowly by cutting between views. Classic it maybe; its goodness is debatable.",
            "review_date": "2010-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I wont lie about the reason I watched Battleship Potemkin. I thought it said Battleship Pokemon.\"\r\n\r\nRead the full review at...\r\n\r\nhttp://predictabilityofstupidity-alfindeol.blogspot.com/2010/01/battleship-potemkin-1925.html",
            "review_date": "2010-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite possibly my favorite silent film of all time.",
            "review_date": "2010-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so boring, I would rather watch some guy take a crap for 2 hours.",
            "review_date": "2010-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This certainly has to be ranked as one of the greatest films of all time. It is visually stunning, a real piece of art. Amazing and hauntingly unforgettable, and the scenes on the steps is one of the greatest ever filmed. Sergei Eisensteins direction is remarkable, what vision and insight he had. A one of a kind classic, brilliantly edited and a piece of film history. A must for any serious movie buffs.",
            "review_date": "2009-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "film making landmark; still used in film schools. that being said, it takes some amount of patience to sit through it, even though it's relatively short. have to admit though, for what was being made in 1925, it's beyond solid. p.s.: if citizen kane was renowned for it's special effects, not sure why this movie (and eisenstein) doesn't get more credit for its montages.",
            "review_date": "2009-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not a big fan of silent films. I find that most of them just sort of drag along, and criticize me all you want for this, but I need dialogue and good acting to keep me going. While this one certainly does drag in parts, I admire the hell out of it, because even 84 years later, there are scenes in this movie that are still shocking. The cover of this film is a picture of the best scene where a little boy is massacred in cold blood by Cossack troops and a mother cries in grief as she holds him in his arms. Powerful stuff!",
            "review_date": "2009-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hard to reccomend to modern day audiences, but it's historically invaluable and has one of the most influential scenes ever filmed.",
            "review_date": "2009-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate a lot of movies that most other people seem to like, and it looks like I'm in the minority once again.  So here goes.\n\nBattleship Potemkin is overrated crap that manages to be both emotionally manipulative and relentlessly boring.  Eisenstein completely fails to understand that long dialogue scenes don't work without sound.  This is the Communist equivalent to Glenn Beck, just as whiny, dishonest, and self-celebratory.\n\nThe bit with the lion statue is moderately clever, but nowhere near as innovative as they'd have you believe (Fritz Lang did basically the same thing three years earlier in Metropolis), and, within the context of the film, seems thoroughly gratuitous and nonsensical.\n\nIn conclusion, fuck this movie.  Fuck it with a rubber hose.",
            "review_date": "2009-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good, considered to be one of the best movies of all time. It will probably bore the general movie watcher because it is a silent film, really old, and it is black and white,etc. So watch it only if you appreciate cinema, otherwise you won't like it. I would give it 3.5/5.",
            "review_date": "2009-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Odessa Steps sequence in this film is absolutely incredible, and over shadows everything else in the film with its sheer scope and influence in film editing. so much so that the opening/closing chapters of the film honestly don't measure up, and that's what hurts the films overall appeal to me.",
            "review_date": "2009-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long scenes, not clearly related with each others",
            "review_date": "2009-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All I can say is that this film is a MUST SEE for any film buff!  One of the greatest films ever made.",
            "review_date": "2009-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "three words to describe this film a cimematic masterpeice although it dose play fast and loose with history it is stunning. the story is set in 1905 when the russian force have lost agianst japan in the russo- jappaniesse war. the sailors of the potemkin rebel against the ships offercers after thier harsh treatment towards them. although the film appers to be in parts a pro commuinst propoganda film sergi enistein gave the world one of cimemas first masterpieces. a classic for all ages (however the fate of the actual saliors is not showen in the film in real life they were exectued for thier actions) 100/100",
            "review_date": "2009-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally I got to watch this -- one of the most famous films in the world. I must say that after nearly 85 years it made quite an impact! I jumped several times in my chair, and the final scene was very dramatic! It feels more like a newsreel than a movie though. Eisenstein was the master of montage. Master of exciting films if you ask me. His \"Ivan the Terrible\" films as well as \"Alexander Nevsky\" are brilliant too.",
            "review_date": "2009-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eisenstein`s \"Potemkin\" is a masterfully done work of art and is nothing short of a timeless classic. Thrilling and impressive film!",
            "review_date": "2009-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one word :  C L A S S I C.",
            "review_date": "2009-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin: Almost matching birth of a nation (3hr plus epic) in its number of shots this 80 minute intense soviet montage masterpiece excels at being evocative in a stylish, symoblic and sophisticated way. Staggering. 9.1/10",
            "review_date": "2009-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful cinematography and revolutionary editing shine in this film, but it's also the sort film that once you've seen it, you will most likely have no interest in ever seeing it again.",
            "review_date": "2009-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Battleship Potemkin is one of the movies we've watched in out World Cinema class, and its influence is both obvious and still profoundly affecting.  The movie is beautifully made, an important stride forward in the history of film for the deeper possibilities of film.  The use of montage to suggest more complex relationships between characters, ideas, and events is beautiful and paved the way for many, many films to come.  Beyond that, the story is exciting and the camerawork is jaw-droppingly beautiful.  The Odessa steps sequence is one of the most memorable and wonderful scenes in cinema.  A must-see masterpiece.",
            "review_date": "2009-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An obvious work of genius. The Odessa staircase is awe-inspiring.",
            "review_date": "2009-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russian propaganda picture from the 1920's and one of the best silent pictures I've ever seen. Visually it's absolutely nothing less than a masterpiece, especially when you think of the famous staircase scene, which looks as good as any such scene from a nowaday movie - and in those days they didn't have as much equipment as now, not by far!\nNot only visually, but also if you take a look at the story, the film is far from dated; it appealed to me like not many silent pictures do, so I can imagine it was a very succesful piece of propaganda (though it didn't turn me into a communist :p), and I can't do else than agree with what I've heard about it before seeing it: it's timeless.",
            "review_date": "2009-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smash the dragons!  This is what revolutionary film-making looks like, even today.",
            "review_date": "2009-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic without question and a pioneering effort by Russian Sergei Eisenstein, The Battleship Potemkin is art + entertainment... a formula that seems to be lacking in modern cinema.",
            "review_date": "2009-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dreadfully slow and horribly overrated, Battleship Potemkin's saving grace comes in its fourth chapter (the story is broken down like a novel). The massacre on the Odessa Staircase by Tsarist soldiers is brutally violent and almost painful to watch, even to this day. See it for that and a touch of Russian propoganda but don't expect much else.",
            "review_date": "2009-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1001 movies to see before you die and another lost flixster rating.",
            "review_date": "2009-10-18",
            "source": "rt",
            "lang": "en"
        }
    ],
    "num_reviews": 395,
    "rt_rating": 8.6,
    "rt_summary": "When they are fed rancid meat, the sailors on the Potemkin revolt against their harsh conditions. Led by Vakulinchuk (Aleksandr Antonov), the sailors kill the officers of the ship to gain their freedom. Vakulinchuk is also killed, and the people of Odessa honor him as a symbol of revolution. Tsarist soldiers arrive and massacre the civilians to quell the uprising. A squadron of ships is sent to overthrow the Potemkin, but the ships side with the revolt and refuse to attack.",
    "vibes": [
        "iconic",
        "enthralling",
        "crazy",
        "suspenseful",
        "historical",
        "adequate",
        "primary",
        "succinct",
        "celebratory",
        "dishonest",
        "gratuitous",
        "manipulative",
        "simplistic",
        "classic",
        "memorable",
        "worth",
        "pivotal",
        "debatable",
        "heroic",
        "spineless",
        "amusing",
        "artistical",
        "authentic",
        "neat",
        "flawless",
        "masterful",
        "available",
        "sequential",
        "quiet",
        "angry",
        "fictional",
        "inaccurate",
        "instrumental",
        "righteous",
        "uniformed",
        "poetic",
        "influential",
        "brief",
        "intense",
        "distant",
        "inexperienced",
        "unsuccessful",
        "exquisite",
        "particular",
        "precious",
        "controversial",
        "famous",
        "significant",
        "tired",
        "necessary",
        "traditional",
        "powerful",
        "symbolic",
        "enormous"
    ]
}