{
  "title": "Shadow of a Doubt",
  "rating": 8.2,
  "release_date": "1943-01-15",
  "genre": [
    "Thriller"
  ],
  "summary": "A young woman discovers her visiting uncle may not be the man he seems to be.",
  "critic_reviews": [
    "Hitchcock's discovery of darkness within the heart of small-town America remains one of his most harrowing films, a peek behind the facade of security that reveals loneliness, despair, and death.",
    "No one would ever accuse Alfred Hitchcock's Shadow of a Doubt of being plausible, but it is framed so distinctively in the Hitchcock style that it plays firmly and never breaks out of the story.",
    "You've got to hand it to Alfred Hitchcock: when he sows the fearful seeds of mistrust in one of his motion pictures he can raise more goose pimples to the square inch of a customer's flesh than any other director of thrillers in Hollywood.",
    "Hitch’s habit of taking us to the edge of the abyss and then returning us with a wink, so often resulting in unconvincing happy endings, here seals one of his most pitiless visions of a monstrous cosmos admitted only to be denied.",
    "The sly Hitchcock made this chiller all the more frightening by having his crafty homicidal maniac intrude into the tranquility of a warm, middle-class family living in a small town, deeply developing his characters and drawing from the soft-spoken Joseph Cotten one of the actor's most remarkable and fascinating performances.",
    "A superb film.",
    "Hitchcock is fully Hitchcock here, plunging deeply into his characters’ psyches, and remaining in full control of every cinematic effect.",
    "Funny, gripping, and expertly shot by Joe Valentine, it's a small but memorable gem.",
    "Hitchcock deftly etches his small-town characters and homey surroundings. Wright provides a sincere and persuasive portrayal as the girl, while Cotten is excellent as the motivating factor in the proceedings.",
    "Certainly one of Hitchcocks most satisfying thrillers, mostly thanks to Wright and Cottens believable relationship."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Really unrated, maybe one of its best works. A true thriller, a beautiful movie.",
      "review_date": "2019-06-14"
    },
    {
      "review_title": null,
      "content": "I never noticed until the last viewing how close the uncle and niece are, he puts a ring on her wedding finger, opposite hand.",
      "review_date": "2020-06-25"
    },
    {
      "review_title": null,
      "content": "This is a slow burner of a film - the plot development gets quite good towards the end. there is a certain plausability about it, which is a little spooky I suppose. Its a typical film noir film, with frustratingly over the top incidentalThis is a slow burner of a film - the plot development gets quite good towards the end. there is a certain plausability about it, which is a little spooky I suppose. Its a typical film noir film, with frustratingly over the top incidental music at times but I liked the character development and as a Hitchcock film, it's not bad, particularly with the plot twists but its not entirely gripping I suppose. It's not a bad film and so I'd recommend it, yes.",
      "review_date": "2021-11-23"
    },
    {
      "review_title": null,
      "content": "'Shadow of a Doubt' is a masterpiece. It continues to be well understood and enjoyed in both the present and the future because of its smart characters and script. I'm not exaggerating, this film is home to, quite possibly, the smartest'Shadow of a Doubt' is a masterpiece. It continues to be well understood and enjoyed in both the present and the future because of its smart characters and script. I'm not exaggerating, this film is home to, quite possibly, the smartest female lead character at the time of its release. This is just one of many parts that make 'Shadow of a Doubt' so brilliant because when all is said and done, this film was a game changer. Many Thrillers since have been inspired by its modern writing, pacing, and cinematography. It is such a pleasure to watch these film elements unfold because I had fun comparing some scenes from the film with the future films it inspired. Whenever Hitchcock was asked in interviews, 'What is your favourite film from your filmography?' His response was \"Shadow of a Doubt\". It was certainly a damn fine choice.",
      "review_date": "2021-08-21"
    }
  ],
  "num_reviews": 14
}