{
    "rating": 0.0,
    "release_date": "2000-09-09",
    "num_reviews": 107,
    "genres": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Peace Is Preserved Hiding the Truth \u0096 A Touching Antiwar Movie",
            "content": "After a shootout at the common security area at the border of the two Koreas, when two soldiers were murdered, Maj. Sophie E. Jean (Yeong-ae Lee) is assigned by the Neutral Nations Supervisory Commission to investigate the incident. The smart Major finds lack of consistency in the statements of the survivors, and in spite of being pressed by her superior, she interviews South Koreans Sgt. Lee Soo-hyeok (Byung-hun Lee) and private Nam Sung-shik (Tae-woo Kim), and the North Korean Sgt. Oh Kyeong-pil (Kang-ho Song), disclosing a tragic story of friendship. In the end, peace and Sgt. Oh are preserved hiding the truth in her report.\"Gongdong Gyeongbi Guyeok JSA\" is a magnificent and touching antiwar movie. Directed by Chan-wook Park, the director of the cult \"Oldboy\", only now this film was released in Brazil, after the success of \"Oldboy\". This movie has a fantastic screenplay that keeps the interest in the impressive story until the very last scene. I was moved with the sad story of friendship between brothers in this polemic theme. The Common Security Area, created on 27 July 1953 with the armistice between the two Koreas after three years of war, and their reunification, seem to be a taboo for these peoples and I appreciate the courage of this group of excellent actors and actress in approaching such theme. In the Extras of the DVD, the cast and director give interviews about the story but never give their opinion about the reunification of these nations. The stunning cinematography and camera work are also very beautiful. My vote is nine.Yitle (Brazil): \"Zona de Risco\" (\"Zone of Risk\")",
            "review_date": "2006-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Surprisingly Moving Piece of Korean Cinema",
            "content": "Fusing a Hollywood-style 'who-dunnit' with an intellectually poignant essay on Korean geopolitics, 'Joint Security Area' ('JSA') offered a surprisingly moving twist to an otherwise engaging film. It raises questions on the incredulity of ideological differences. It showcased the ridiculous, yet tragic consequences such an imposed barrier can have on its people. People, whom if not separated by mere political allegiance, have more in common than they care to admit. 'JSA' perceptively explored a modern day Korean psyche - that heartfelt desire for kinship and unity between the people of both Koreas.'Joint Security Area' is a timely film with a universal message - \"Let not differences in race, religion or ideological allegiance blindside our judgement, especially in these violent and confusing times.\"\nI instinctively respond to this message. I hope you do as well.",
            "review_date": "2001-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent Korean drama from Old Boy director",
            "content": "After a general moratorium on film exports, JSA was amongst the first few Korean films to appear in west, to be associated with the emerging Korean 'New Wave' cinema. It was also one of the most successful and expensive films made in the country at the time, and as such was director Chan-Wook Park's breakthrough film. Park has since gone on to direct such cult items as Oldboy, in which he combines a sure sense of staging with a visual, kinetic flamboyance all of his own. A compelling and moving work in its own right, JSA makes something haunting and memorable out of a situation which, in outline, could easily have proved propagandist and dull.It takes place entirely at the Panmunjom, the Korea DMZ peace village where North and South Koreans face off under the terms of 50-year-old treaty, glaring at each other across a thin stretch of ground, huddled over spyglasses and rifle barrels, or staring each other down across a borderline. The bitter division of the country provides a frequent background to much of its cinema just as, in its way, the spectre of past nuclear destruction has haunted that of the Japanese. But there is a difference. Japanese cinema often shows the dangerous unity of clan, kin or country in the face of crisis. In Korean cinema, brothers are often divided whilst, around them, a fractured society threatens and fights itself. Sometimes the violent resolution of the country's famous stand off promises mutually assured destruction, as is presented symbolically at the climax of Attack The Gas Station! (1999). In other films it can appear as part of an action thriller (Shiri), or as the basis of a recent war film (Taegukgi, 2004), and so on. In the more profound JSA, national division provides a starting point for an examination of the human condition, as soldiers on either side of the line discover what it is to establish warm, normal interaction - even at terrible cost.\"There are two kinds of people in this world - Commie bastards and the Commie bastards' enemies\" says a South Korean officer to the Swiss investigator Major Sophie Jean (Yeong-ae Lee) at the start of Park's film. Jean works for the Neutral Nations Supervisory Commission. Previously her superior has warned her that her real job is not to investigate, \"who, but why,\" and that \"the outcome is less important than the procedure.\" But as Jean delves deeper into recent events with an insistence born of her own family history, revelations prove Rashmon-like, proving that the truth is by no means black and white. In fact the opening scenes, containing the harsh protocols for her work, are the least satisfying of the film. (A fact exacerbated by the poor spoken English of actress Lee and the woodenness of her Swedish companion). It is only once the viewer enters the experience of the soldiers - a process gradually revealed through a number of sometimes-gnomic flashbacks - that JSA becomes interesting.JSA was a controversial success in Korea. The action is set very precisely, at the borderline between two societies and Park was concerned to make it as realistic as possible, spending $1 million on building his own Panmunjom. As a narrative his film is just as deliberately less exact, hovering between military thriller, patriotic tragedy, personal loyalty tale as we learn more about the soldiers, now tight-lipped under independent interrogation. Enemies, then friends, comrades and brothers, the men's deepening relationship also suggests a more taboo attraction, one which proved unsettling to home audiences. Ultimately the 'Joint Security Area' becomes less a site of military stalemate than a place where emotional ties ought to provide their own justification and balance.The structure of Park's film is an intriguing one: a straightforward, and reasonably suspenseful investigation of an outrage frames a sequence of flashbacks and reminiscences, often presented in non-linear manner, fleshing out the main story. In between there is some newsreel footage as well as some exploration of Major Jean's motivations, while the feelings of the soldiers concerned are never elucidated, merely explored through past events. The director's achievement lies in tying all this into a reasonably convincing whole, moving the audience from the coldness of a military tribunal to the warm realm of human feeling.There are several moments in JSA to savour, some of which occur within the no man's land between the two societies itself - a neutrality which seems to encourage a self reflection and recognition between main participants: the snowy, wordless encounter between two border patrols for instance, where tension is dissipated with a single cigarette; or the first encounter on a cold night between Sergeant Oh and Sergeant Lee, surrounded by mines, their breath freezing in an field. Elsewhere Park's camera records the absurdities of petty border etiquette, at one point shooting from overhead the dividing line where soldiers square off against one another, placing figures in some lunatic grid of their own devising. (At one point Park has two of the soldiers mock the solemnity and rigidity of the border by playing spitting games across the line.) There's a similar overhead shot later, this time looking down at a fallen soldier face up in the rain. The camera also plays a memorable part in the last scene of the film, as an ordinary snapshot is transversed by a slow pan, which pulls out of the composition a final, mute commentary of its own.Asked earlier why one of the soldiers had deserted his post just to relieve himself, the blithe answer comes back as: \"People with constipation should seize the chance when it comes.\" It's a philosophy that informs a good deal of JSA. Not to put too fine a point on it, the film suggests that, blocked by its own political impasse, Korea needs to loosen up and seek relief as it can. Park's film shows one way, perhaps not the best, but a memorable story all the same.",
            "review_date": "2005-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Film about the futility of enmity, and the gift of true friendship",
            "content": "The Korean peninsula is divided like no other. The two countries are still fighting in a sense the cold war, divided by loyalty to different creeds. Not an easy subject to tackle, but this film takes the subject and smooths off the edges to show us that there is hope and beauty underneath.The film centres round an investigation over a border-side killing. Unbeknown to the investigators, intertwined into their investigation is a friendship that had developed, behind the back of their superiors, of two sets of border guards on either side of a bridge dividing the countries. The secret friendship seems to concentrate the whole Korean divide issue simply, but minor hostility still pops its head up now and again, nevertheless without needing any kind of over-dramatics the men all respect and begin to ultimately care for each ahead of all else As expected, the whole situation comes to a head, and their is some strong emotional moments but the education to anyone who watches this more than makes up for all else.I can't think of many more emotive subjects or films that I have seen this year. The acting and direction is perfect, whilst the script is funny and emotional. Korean films are just so far ahead of all else, it just defies belief. Highly recommended, you can't go wrong with this gem of a movie.",
            "review_date": "2006-08-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This must have been a knockout in Korea (well, the South, at least)",
            "content": "JOINT SECURITY AREA is pretty amazing, but the less said about the plot, the better to insure your full enjoyment, surprise and emotional connection. Another member puts the film down for its sentimentality. I don't know about that: When a country has been as divided as has Korea for the past half-century, a movie like this must have really knocked the socks off of a lot of South Koreans (I doubt it could be shown in the North). I'm trying to think of some equivalently themed American film, but nothing comes to mind. \"A Midnight Clear\"--or a film about comradeship on either side of, say, America's Civil War-- just couldn't provide the sense of long-term division/separation that Korea has experienced. Beautifully filmed, with flashbacks and varied points-of-view, this puzzle movie eventually comes together, offering some of its best moments toward the end. The last shot is astonishing: simple and reminiscent, but now seen with enough clarity and irony to open mouths and overflow tear ducts.",
            "review_date": "2004-09-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brothers Disarmed...",
            "content": "Hands across the void, separated by dogma, briefly reunited, candid, without melodrama. A gulf simply straddled, a divide quickly filled, no malice or distrust, as partnerships re-build.Leaders seldom lead, people following the bread, on all sides there's mistrust, of what's been spoken and what's been read. Continually replayed, along friction points that burn, when constructs are embellished from pontificating churn.If only others didn't get in the way, what a great place the world could be, every day, after day, after day.",
            "review_date": "2022-01-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Chan-wook Park's most politically-charged film tackles the very volatile tension that exists between the North and South Koreans.",
            "content": "Chan-wook Park's most politically-charged film tackles the very volatile tension that exists between the North and South Koreans. This could have easily been propagandistic in nature, with this South Korean film portraying the Northerners as mere caricatures of Communistic ideals, but instead the film happily sidesteps this and portrays both the North Koreans and South Koreans as kinsmen.In the beginning of the picture, both sides have a skewed view of one another, seeing each through the lens of their political temperament - the border between the two thus is interpreted as a wall that filters and jades each one's perspective. However, once that that wall is finally crossed, the two sides realize that no wall really exists, and they begin to see each other as human beings - The soldiers first call one another \"enemies\", but soon they are calling one another \"brothers\".The characters are richly drawn and dynamic to reflect this - each are humans, with their own unique demeanor, and that their national identity is nothing more than a facade. While the soldiers are alone, away from their government infrastructures, both sides cling to one another in fellowship as they find themselves all the same. Only when the absent governmental element is reintroduced are the soldiers forced to revert back behind their facades, and tragedy results.A powerfully moving and keenly intelligent analysis of the confusing political situation between the two opposing governmental systems. Despite being slightly marred by a few lapses into melodrama and overstatement, that can not take away from its piercing effectiveness.The highest recommendation possible.",
            "review_date": "2008-02-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "AWESOME PIECE OF WORK: Rent this today if you can!",
            "content": "It's been a few years, but I saw this in a Singapore theatre a day or two after it opened there. A Korean friend had mentioned it was good, so I went to check it out assuming it would be good. OH MY GOSH! This was an excellent movie and it seems so unfortunate that it didn't get a wide-release in North American (or not that I know of) as I think it would have done really well! This was #1 in Korea beating out Spider Man!! In fact, the North Korean leader even requested a copy for his viewing pleasure -- perhaps to get his own look at what South Korea might be plotting, or maybe simply to be entertained with some great film-making.The movie combines a very likable Hollywood touch with compelling plot action, in contrast to some very personal moments and an amazing sense of suspense in this movie. I was floored.The whole location of where the movie takes place -- in the demilitarized zone between North and South Korea -- and the acute tension was certainly captured and sure made for great story-telling. I can't remember another movie where I saw and experienced more tension in a story than in this movie! It fit the story perfectly, and really got the movie off to a great start. Then, as the characters were introduced, piece by piece, we explored action, emotion, and thought. The movie examined, re-examined and really brought us close not only to the events, but to the people in the story. I felt a range of emotions in this story culminating in a really great movie!This is a must-see!",
            "review_date": "2005-09-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A truly inspiring movie that makes you ask \"Why do we have wars?\"",
            "content": "I must admit when i first saw the cover of this movie my initial thoughts were \"oh man another pointless testosterone military driven movie\", how wrong i was.This is a wonderfully crafted masterpiece that evokes the strongest emotions in a person's heart. The movie is set in Korea and portrays how different people can set asides their differences and be able to see each other in the purest form, that we are the same, brothers and sisters.I found myself on a roller coaster ride of emotions, laughing one minute, in with tears in another. All the actors and actress have done a superb job in this one. The most emotionally powerful scene was the last scene. Only a photograph but conveys so much meaning and emotions.Definitely a must watch movie, no matter what nationality you are, you will be enchanted and inspired by this movie's magic, and understand a bit more about what it means to be a person.",
            "review_date": "2005-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Excellent Film",
            "content": "In recent years South Korea has produced some of the best cinema in the world in recent years and Park Chan-Wook is one of the best directors to come out of the nation. This was film that proved he was a skilled film-maker and broke a number of box-office records in South Korea. Because of this film that Park Chan-Wook was able to do his Vengeance trilogy.In the Joint Security Area on the border of North and South Korea the rival states have a border dispute. A South Korean soldier had killed two North Korean soldiers and injured another. The South Korean army claimed that their man was kidnapped and he was acting in self-defence, whilst the North said it was an unprovoked attack. A team of Swiss and Swedish soldiers, led by Major Sophie Jean, a Swiss born woman from Korean ancestry. When she comes to Korea she discovered that this was not a clear cut case. It was discovered in a flashback that Sgt. Lee Soo-hyeok had befriended two North Korean soldiers who had saved his live after he stepped on a mine. He starts to write to the young private before crossing the border and getting very close to the soldiers. This is a big shock because of the difference between the North and South and both sides are taught that they are the supiour. It also becomes more dangerous with both sides suffering from increased hostilities.Joint Security Area is a fantansic film. It is brilliant written and directed, which Park showing some of his trade make shots. The acting is excellent and the subject matter is very well handled. This is a story of friendship in impossible circumstances. The soldiers realise that they have a lot in common and that the North and South are not that different from each other. It is bittersweet, but at times humorous. There are debates about Korean politics, such as unification, and North Korea's nuclear ambitions, and the soldiers involved are patriotic to their countries. Their are aspects to the both sides military, and neither get off lightly in this film.I highly recommend this film.",
            "review_date": "2008-09-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Well done!",
            "content": "Expecting an Asian remake of A few good men, I was pleasantly surprised to find a well acted movie with a different storyline. It expressed the feeling of absurdity that exist in such places as a DMZ, with nice attention to details. Anyone who has been in places or situations like these will recognize the cigarette rituals and so on.I think the movie excellently describes the stupidity and rigidity of war and the military life - just like in the movie, all it ultimately leads to is friends killing each other for no good reason.The people who are complaining about the bad English in the movie obviously never heard Swiss and Swedish people speak English - none of the \"foreigners\" are supposed to be native English speakers, so it makes perfect sense for them to speak as they do!All in all, a visually beautiful movie with a nice but slightly over-obvious script, nice acting from the four main Korean characters, some very funny scenes that gives comic relief to fend off the impending doom of the inevitable end, and actually quite realistic, in my opinion.Now I am going to check out Sympathy for Mr Vengeance and Old Boy!",
            "review_date": "2004-06-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "JSA\u0097Just Simply Amazing!",
            "content": "Korea is a divided country and Panmunjom, where North meets South, is an area where tension inevitably runs high. When a shooting incident there leaves two Northern soldiers dead, Major. Sophie E. Jean, (the gorgeous Yeong-ae Lee) of the Neutral Nations Supervisory Commission, is called in to head the investigation. A South Korean soldier, Sgt. Lee Soo-hyeok (Byung-hun Lee), takes responsibility for the killings, claiming he was kidnapped by the North, and that he shot the men as he attempted to escape.But as Sophie slowly unravels the truth, she learns that the reality is far more tragic and, in a series of flashbacks, we get to witness the events leading up to the shooting: Sgt. Lee straying into the Northern half of the Demilitarized Zone (DMZ) and accidentally treading on a mine; his rescue by 'the enemy'\u0097two guards who work a stone's throw from Lee's own post, just on the other side of the border; and Lee's eventual friendship with his rescuers, which sees him crossing into the North at night to spend time with his new pals.After a while, Lee introduces his trusted workmate to his new 'brothers'. The four become close friends, and spend time together drinking, gambling and playing games\u0097that is until the night when their secret is discovered and things go remarkably pear-shaped!I first experienced the work of director Chan-wook Park when I watched the brilliant Oldboy (2003)\u0097a gripping, violent and bloody tale of revenge. My next choice was Sympathy For Mr. Vengeance, which was made one year previous to Oldboy, but which failed to impress me as much.JSA was made in 2000, and I feared that, possibly, I might like this even less, since the subject matter didn't particularly appeal to me. I needn't have worried: Joint Security Area is a magnificent film that tells a gripping story whilst also delivering a poignant message about the stupidity of war.Beautifully shot and carefully pieced together, this amazing film builds slowly, but surely, until the compelling ending when tragedy inevitably strikes. Only the slightly confusing 'shootout scene' at the end of the film stops me from giving this film a perfect 10, although one does not need to fully understand the details of this moment to recognise the brilliance of JSA, nor feel its powerful message.",
            "review_date": "2007-02-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "JSA is a beautifully executed and highly intelligent piece of cinema",
            "content": "\"Joint Security Area\" (2000) is directed and co-written by Park Chan-wook and is plainly put, brilliant cinema.The convoluted plot is intelligently edited and paced and as a result, the film is greatly entertaining. The way Park Chan-wook uses the camera is bar none amazing; he truly has a great director's eye for cinematography.The production design of the border between the Koreas. The performances from leading roles. It all adds up to an emotional crescendo as a stroke of genius from a masterful director. Highly recommended!",
            "review_date": "2022-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A film with surprising emotional impact",
            "content": "Chan-wook Park's third feature and first big hit. He's of course best known for his Vengeance Trilogy, and is seen something as a genre filmmaker, maybe most closely associated with horror (his most recent film is the vampire flick Thirst). I had always thought J.S.A. was some kind of espionage thriller. How wrong I was. Though definitely in his own recognizable style, J.S.A. is an extremely serious-minded movie about the relationship between the two Koreas. It is built as a mystery, where a Swiss woman of Korean origin (Yeong-ae Lee), a member of a neutral investigation committee, investigates a border incident where a South Korean guard has apparently escaped from the North Korean post across the border after having shot and killed two guards and injuring another. Lee is allowed to go between the two countries to interview the people involved, study the crime scene and study the bodies. The stories she gets from the two survivors are wildly inconsistent. As the film moves on, Park slowly reveals the truth behind the matter. What results is a touching and tragic incident involving a friendship forming between four border guards, two each from the respective countries. The story is hard to get a hold of at the beginning, but when all is said and done, it's an incredibly powerful piece of cinema. The final sequence, where we are asked to examine closely a photo we've seen taken earlier in the film, is absolutely devastating. It's the kind of film where you don't even realize how powerful it is until the right moment, when all the emotions come flooding in to overwhelm you.",
            "review_date": "2009-12-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Korean movie ever",
            "content": "Although a native Korean, I've always been skeptical of Korean movies. They tend to overplay emotions and lack realism.  Well, this movie changed my whole outlook - it is a grippingly realistic movie that rips through the storyline.  I was spellbound. Set in the highly charged Korean demilitarized zone, it is the tale of a shootout gone wrong, but the movie is much more than just a whodunit.  It illustrates quite subtly the delicate North-South emotions that transcends ideologies of the 2 regimes; it really is about characters and their situations, rather than actions.  The film also features some beautiful cinematography - the scenes I remember are the tall grass (the minefield incident) and the muted cigarette exchange on top of a snow-covered hill. The latter, particularly, is extremely poignant in its silence.  Why are they smoking together?  And why do they not speak?  The answers to these questions, I guess, are the subjects and emotions that the movie tries to convey. The only flaw I can offer is the clear mis-casting of Lee Young-Ae as the neutral major, but her role in the movie is not central enough (although she does take up quite an amount of air time) to drag down the whole movie. IMHO, I would have used a Korean-European new face in the role. I am sure that it appeals to Koreans more than foreigners, although i'm also sure you can enjoy it without prior knowledge.  I recommend this very highly.  It's a pity that it's still not out on DVD even after 1 year following its release, and I hope it is released soon so that movie lovers everywhere can appreciate it.",
            "review_date": "2001-10-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The peace is preserved by hiding the truth.",
            "content": "One of Chan-wook Park's earlier films, before Sympathy for Mr. Vengeance, Old Boy, and Lady Vengeance. It shows the promise that will come later.Yeong-ae Lee (Lady Vengeance) is investigating and incident that happened at the JSA. Of course, nothing is as it first appears, and as is reported in depositions taken before she got there.This is a political thriller, told in flashbacks. It is about four soldiers that bridge the JSA and become friends.Excellent storytelling by Chan-wook Park with help from Seong-san Jeong, Hyeon-seok Kim, and Mu-yeong Lee.",
            "review_date": "2010-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very good, when the dialog is in Korean",
            "content": "I saw this as the second half of a double bill and after the first five minutes of truly horrible english dialog I thought I was in for a rather lame movie going experience, but i was too be proven wrong.JSA is quite a good film, especially when it is looking back on the friendship of the North & South Korean border guards.  Anytime the film went to english dialog, the film took a turn for the worse.Violent in parts, funny in others, a great human story set in the DMZ, a place not renowned for it's humanity.",
            "review_date": "2004-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The story of four \"brothers\"",
            "content": "Major Sophie (Lee Young Ae), from Switzerland, is in charge of the investigation about a shooting in a North Korean border house. Lee Soo-hyeok (Lee Byung-Hun) is the main suspect of the dead of two North Korean soldiers after he escape from the soldiers according to his confession but Major Sophie will find some contradictions in Lee's confession, specially because of the number of bullets in the dead bodies. Soon the truth will be know.The plot of this film, directed by Chan-wook Park before his great and famous \"Vengeance trilogy\", involve one of the most difficult themes for the two Koreas and a tragic and touching story about friendship set in an absurd thing called war. The storyline is perfect and very touching, first it seems to be a story about mystery involving a murderer but later with the flashbacks it turns into a story full of humanity in which the protagonists are afraid to tell the truth thanks to the assured reaction of their governments that will place them as treacherous. So the film is very antiwar and always have a great message that every person in the world must practice.The cast is great and i think is not very easy to make a film about this difficult theme and all the actors and actresses are just perfect. And the cinematography is just amazing with some of the most memorable scenes that i have seen on a film, specially every time we can see how close is the border between this two countries. Also i think the very last photography is very beautiful showing the four \"brothers\" before the tragic story. And i read that it is impossible to film in the Joint Security Area so they create a perfect replica for the film so is also a very valuable thing.Conclusion: watch this excellent film, it was the biggest success in the history of Korean cinema and is another great film by the great Chan-wook Park. 9.5 out of 10DVD: the last year the company Quality Films released in Mexico the collection \"Cinema Xtreme: Asian Series\", with a lot of excellent films including this one. I own like 4 films of this collection and are just great, with few but good bonus material. The only bad thing is the package of this DVD that is not as good as the rest of the collection and i don't know why. Anyway is excellent that we can enjoy this films in Mexico.",
            "review_date": "2008-01-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A film every Korean has probably seen, and every other person should see to understand the country",
            "content": "Writing up this review has a little special meaning for myself since I lived in the country teaching English some time ago, and have been back many times since for vacations.In a nutshell, this film is a masterpiece when it focuses on the Korean actors and how they live in this overcrowded no mans land. Inside this area of huge protocol we get to see how both sides are just ordinary people, and have the same desires and wishes as any Korean.The basic plot involves a border incident that involves 2 North Korean soldiers allegedly murdered in a North border outpost by 2 South Korean military border guards. A mixed Korean woman of Swiss descent is sent in for her neutrality to investigate and find out the truth.The masterpiece falls apart when the film has to focus on the setup with the foreign actors (WHO ARE HORRIBLE!!!). Luckily one of them, a Swedish soldier has very little presence so he's ok, but the investigators chief commander a Swiss general is not worthy of any screen time what so ever. Also the Korean actress's command of English for someone who is suppose to have learned Korean second hand in Switzerland, is awkward and fake. It's obvious she doesn't have command of the English language in this film and makes for some bad dialogue, and doesn't make her character believable. A particularly unnecessary scene comes toward the end of the film when the Swiss general explains why he chose her to lead the investigation. The acting and exchange is bad, and there should have been a better place used to describe the situation probably in Korean with one of the other Korean actors. Or it should have just been flat out cut from the film all-together.Luckily though, 75% of the story is focused on the Korean border guards from both sides. What we soon discover is that 2 of the South Koreans have been secretly visiting 2 North Koreans and developing a close friendship. In flashbacks we find out that they share their ideas, do fun things, play cards, and even at a very poignant part of the film - exchange addresses in hopes that they can someday visit each other. The actors playing these roles are magnificent and flawless. This is where JSA becomes something more than just a kooky drama, and ends up reaching something special and poignant.The film is also wonderfully directed, and shot. The cinematography at one point when two soldiers are standing in an open field (a South Korean trapped on a mine and a North Korean discovering him not knowing what to do) is breathtaking and ironic for its meaning. There are also many light hearted comedic moments, which I won't spoil, some neat directing tricks, and has one of the most lasting images in film I have ever seen.In the end it points out mostly what most Koreans already know. The existence of a place like the DMZ and the failure of people on both sides has to do with the fact that the governments can't focus on what Koreans have in common, and can't drop the charade of 'Loosing Face' with each other over this issue. If they could just act and share their camaraderie as these soldiers do in this film things would be so much easier.Alas politics are involved (also many things that happen in this film are just not realistic in the actual DMZ), and the situation continues. The film is sad, wonderful, enjoyable, uplifting, and tragic all at once. Just cut out the foreigners in the film and you have a masterpiece..Rating 7.5 out of 10",
            "review_date": "2002-10-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Korean and World Film Classic.",
            "content": "I saw it many years ago and then again tonight. Not only does JSA hold up well, it does so because it is the mature masterpiece it has been called and continues to hold its distinction as one of the greatest of Korean films. Others have already commented in detail on the rich direction, story, and acting, so I will just add my voice to the 21 years of praise for this sometimes charming and funny, and other times shocking and heartbreaking film that has the talent and courage to challenge us to see ourselves as brothers and sisters first. (And Song Kang Ho remains as awesome today as he is in this film.)",
            "review_date": "2021-02-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Emotionally resonant. Politically relevant. Watch it and learn.",
            "content": "Among the recent explosion of Korean movies, this is by far the most poignant and politically resonant, especially after Sep 11. Yes, you heard right.   Fusing a Hollywood-style 'who-dunnit' with an intellectually poignant essay on Korean geopolitics, 'JSA' centred on an investigation surrounding a late night, cross border shooting involving soldiers on both sides of the Korean Peninsula. Alternately shifting between action, comedy and drama, this beautifully shot film offered a surprisingly moving twist to an otherwise engaging thriller. With humour and unexpected pathos, we were introduced to the protagonists from both sides, as the film progressed. Through this, we were allowed us to see the faces behind the conflict. Implicitly, it brought to fore our realisation that these adversaries, though separated by their political allegiances, have more in common than they cared to admit. But as the foreshadowed tragedy had already succeeded this series of flashbacked tales, it further heightened our painful reflection. That more could have been done to prevent this unnecessary precipitation of violence. This poetic cautionary tale thus amplified the incredulity on how ideological differences tore a country apart and continues to do so today. 'JSA' perceptively explored the psyche of a fractured country. It gave a voice to the people of both Koreas, a voice to express their heartfelt desire for kinship and unity.This made the film all the more timely and universal. In these violent and confusing times, should we continue to let differences in race, religion or opposing ideologies blindside our judgement?   Look at Israel. Violence begets violence. One can only hope that peace, will prevail. One can only pray too, that this is not the end.",
            "review_date": "2002-03-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not what I thought it would be, a STUNNING movie.",
            "content": "I have been putting off watching this movie for some reason, now I don't know what I was missing. I am in the AirForce and spent time in Korea (A-Town, Kunsan Korea) and worked with the Army close to the DMZ, so most of the references in the movie I knew about. The movie starts slowly, but the ending is worth the effort. As for most of my reviews, I won't bore you with the plot as every review here will do that, I will just let you know this movie is amazingly human, heartfelt and sad at the same time. It has a whole bigger meaning than what is seen on the screen, and I KNOW Koreans (especially war veterans) are asking themselves \"why do we still hate our brothers in the north?\". The weakest parts were the Swedish investigators, but thankfully they played a small role. I actually laughed out loud at the antics of the supposed \"ememies\" that were secretly friends. I guess a bad fart is universally funny in all languages. The movie takes your emotions on a roller-coaster ride, and just when you think the 2 sides could be true friends, the movie throws you for a loop and the reality of the long period of mistrust between the divided country sinks in. As usual, the cinematography of this film was very good and the DMZ areas looked very close to what I saw. The end of the film is what was pure genius, actually showing the 4 friends before they knew each other unknowingly in a picture together, as if to say they were destined to meet. I can't adequately explain the emotion of that scene, but I replayed it 5 or 6 times. I've always been a pretty tough Military man, but I cried for the Korean people after that scene. Don't miss this movie.",
            "review_date": "2005-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An emotional film",
            "content": "In 2009, director Quentin Tarantino placed JSA amongst his top twenty films since 1992. Directed by Park Chan-wook, who also made Oldboy, this film tells the tale of a fatal shooting within the DMZ that exists between the borders of North and South Korea.At one point the highest-grossing film in Korean history, JSA is the story of the fragile friendship that starts between four soldiers who are on opposite sides. Yet why did two of the North's soldiers get killed and why are the stories so inconsistent? That's what a neutral Swiss team of investigators wants to figure out.Sergeant Lee Soo-hyeok (Lee Byung-hun, Storm Shadow in the G.I. Joe movies) is a South Korean soldier who has run back to his own country, rescued by his own troops and potentially guilty of shooting three North Korean soldiers, leaving two dead. He claims that he was kidnapped.One of the dead, Jeong Woo-jin (Shin Ha-kyun, Sympathy for Mr. Vengeance) was shot eight times, which doesn't seem like self-defense. And one of the other South Korean troops, Jeong Woo-jin (Shin Ha-kyun), suddenly tries to commit suicide.The truth is that for some time, the men had all been friends. In fact, the surviving soldiers and Woo-jin were attempting to protect one another, something that had been happening since Kyeong-pil and Woo-jin saved Soo-hyeok from one of their land mines.Yet can even the truth - once discovered - save anyone? This is a tense exploration of the divide that exists between people who are not all that different.This is a tense watch and one that will anger you by the close. I have no idea how to save the world. All I know is to watch movies.",
            "review_date": "2021-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best Korean movies in my life.",
            "content": "When my friends forced me to see this movie with them, I really didn't know what to expect. Raving reviews bursted out everywhere that no Korean movies would be better than this one. Nevertheless, I was hesitant to go to cinema. I insisted that I am not in the mood watching serious movie.It was finally started, I found myself laughed out to tears through the movie. It's supposed to be a serious movie, but not at all. It was a really inspiring one which is more worth than one thousand times Reunite demonstration.Of course this movie is not a perfect one. If you look through the movie carefully to find plot holes, there are so many. At first Joint security area is not such a remiss place as it portrayed. And there aren't any certain explains why two lead south soldiers shot one north soldier dead who once considered to be their best friend and brother.One more thing, I could hardly understand why two south soldiers ended up like that. Well, These some hurts the greatness of this film.The most powerful scene was the last scene. It was the best of all. I was extremely touched by only one that scene. That picture explains everything that the director might have wanted to say.Don't miss this one. Even though you are not a Korean, I bet you would understand the air of this film, and could laugh together, and could touched together.",
            "review_date": "2000-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the most touching movies I've seen",
            "content": "JSA is a masterpiece, no doubt about it. The story is really something to ponder in the modern day society. People that are forced to take sides because of national interests meet and find out that they are not that different at all.The characters are clearly defined with great depth, the way it's filmed is just awesome and the story is an important lesson to us all. If you walk out of the theater after watching this movie without being deeply moved, you probably don't have any feelings at all.Chan-wook is a master and with this film he confirms his place on the throne.",
            "review_date": "2006-08-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful, funny, sad",
            "content": "Park Chan-wook is such a talented director, it just doesn't seem he can do anything that is merely good. Like his subsequent Revenge Trilogy, this film depicts a story of deep and complex human emotion, poetic irony which alternates between humorous and tragic or both all at once; all of which unfolds amid virtuosic camera work, editing, and cinematography. Chan-wook knows how to surround himself with talent to augment his own, and the result here is a beautiful, sad, funny movie that is not to be missed.",
            "review_date": "2020-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the human being who is the enemy",
            "content": "The South Korean film universe never ceases to provide surprises with almost every movie I see. 'Joint Security Area' was created by Chan-wook Park in 2000, three years before directing 'Oldboy', the film that made him famous and propelled him to the attention of film viewers and critics around the world. Under the pretext of an investigation into an incident at the armistice line between the two Koreas that resulted in the death of two North Korean soldiers, Chan-wook Park is making a film about the absurdity of war and the brotherhood between soldiers who are apparently dead enemies. good tradition and maybe inspired by classic films like Stanley Kubrick's 'Paths of Glory'.The story in the film takes place in the demilitarized zone, one of the most tense places on the planet, a place where the armies of South and North Korea are facing each other, in an uncomfortable armistice of a war suspended over 65 years ago , armistice sprinkled with incidents that sometimes result in victims. But the armies are made up of people, many of them young people sent to do their \"patriotic duty\" towards the respective countries, and in this case belong to the same people fractured by history. The film describes an unlikely human fraternization that is disapproved and repressed by the superior officers on both sides of the conflict and ignored by the neutral observers whose mission is to prevent incidents and investigate them when they happen. Nobody in this film seems to be interested in revealing the truth about the incident that tragically concludes the micro-coexistence attempt of the soldiers engaged in a macro-conflict. It is an action movie with elements of criminal investigation film, but what remains in the viewers' minds are the human aspects of the encounter between four young people who refuse to be enemies.I liked the story and the message, even if some details and even the whole situation are not completely credible. The actors, especially those who play the roles of soldiers, are well-chosen and fit perfectly into the roles. The film suffers from an excess of rhetoric, but the sincerity of approaching such a delicate subject manages to prevail. In 2000, the vision proposed by this film was considered radical by some of the viewers, but it attracted the curiosity of South Korean viewers. In this country 'Joint Security Area' sold more tickets than 'Titanic' and launched the career of one of the most famous South Korean directors! We can understand why.",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Park Chan-Wook's Underrated Masterpiece.",
            "content": "Park Chan-wook's breakthrough feature is an expertly crafted, immensely touching & emotionally engaging tale about the futility of war & the beauty of friendship that can't be confined by borders or fences. Featuring two of South Korean cinema's most recognisable faces in Lee Byung-hun & Song Kang-ho, both in their earliest roles, Joint Security Area introduces its director on the big stage with a promise of greater things to come & how true that turned out to be when only a few years later, Park graced us with Oldboy.",
            "review_date": "2014-03-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Friendship under hardship",
            "content": "It's a legal/detective drama stapled to a friendship-amid-hardship story. The latter part is the greater and the better-executed. I found the friendship between the soldiers touching.The English-speaking parts felt stilted and I'm not sure whether that's only because the actors aren't native speakers. I don't think it is. There was one part where the audio felt off: someone was speaking and it sounded like a person speaking into a studio mic rather than the environment the character was in (no echo, no distance).",
            "review_date": "2022-08-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Flawed but okay",
            "content": "The movie followed the blockbuster \"Shiri\" and outdid its predecessor at the box office. Showing sympathy for the North had long been taboo in South Korea, thus the movie broke new ground.That said, the character Sophie was totally unnecessary as I found her part to be a big nuisance. The actress couldn't speak English and didn't look mixed, as her character was supposed to have learned Korean as a second language and had a Korean father and Swiss mother.There have been reports of soldiers of the two Koreas mingling over booze at times, so the story is not implausible. But the movie had quite a bit of excess baggage - Sophie, the UN soldiers, etc - that is simply didn't need.",
            "review_date": "2002-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Devastating",
            "content": "This one starts off awfully with a shot of a CGI owl flying across a CGI moon and just gets better from there. Shades of RASHOMON in the fragmented story of an incident at the DMZ which leaves a number of soldiers on both sides dead and injured. An investigator is called in to piece together what happened, so the back story then plays out and a compelling one it is too. Park Chan-wook offers us a searing critique of not only North/South Korean politics but also the human race as a whole. Both Lee Byung-hun and Song Kang-ho offer star-making performances in a slow-burning tale that gradually builds to a devastating climax.",
            "review_date": "2022-01-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "first you hate it, then you love it, finally you understand it.",
            "content": "This is one mysterious and yet beautiful movie! First, I hated watching the cruelty and the suffering content of this movie. However, in the end, I came out totally amazed. With my mouth open wide and my pupils grown! Everything made sense in the end. I wasn't disappointed at all. In fact, I'm thankful to have watched this film. I recommend this movie to anyone from mail-man to the soldiers. Get on with it! You will laugh, cry and shout! Just sit back and enjoy the movie. Good luck!",
            "review_date": "2002-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Re-watched and after 10 yrs still excellent detective story.",
            "content": "It may be in a military setting, it is basically a detective story. Surprising plot, good to great acting. The latter especially by Kang-ho Song who once again outplays everybody like in most films he is in. The only negative \"stain\" are the English scenes which are so cringey, just awful, both by female lead with an awkward English accent as well as the supposedly Swedish military, who by the way are actually German actors. They should have left these out. Nonetheless great movie.",
            "review_date": "2020-05-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ending ruins everything",
            "content": "The movie seems flawless from starting except the actress English accent (annoying). The friendship among those four soldiers captivates the main attraction. There is hardly anyone who ever think about friendship,chemistry,bonding between North Koreans and South Koreans, specially between soldiers. I was wondering and enjoying at the same time how beautifully the relationship is presented. I was thinking about how the soldiers going to unify their individual Korea into a single Korea by the bonding of friendship which would eventually overcome all obstacles coming in its way. But this ended up in a different way which was totally unexpected at the same time ruins every single thing.Spoilers,Ending was filled with several plot holes like,\nWhy Lee Byung Hun (South Korean soldier) shots Shin Ha(North Korean Soldier) 8 times , really? He was his friend the whole time. He also killed\nthe North Korean chief. But Oh Kyeong(North Korean soldier) told Lee Byung Hun and Kim Tae (South Korean soldier) to leave the place and advised them to tell the South Korean soldiers that they were kidnapped by North Koreans. Really is it supposed to make sense? Lee Byung Hun killed two of his companions but he is helping them out. Kim Tae killed himself, why? He even didn't kill someone.At the end Lee Byung Hun killed himself out of guiltiness but why now?",
            "review_date": "2021-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "WOW! This film surpassed all my expectations!",
            "content": "I admit, I did not know much about Korean films, nor was I particularly interested in getting to know them. What a mistake! This thing was so suspenseful and well made. The actors, the cinematography, the dialogues, the timeline: everything was so much in tune. And, of course, the story is extremely interesting for Germans. We had a separation of our nation similar to that of the Koreas until 12 years ago. It was spooky to see it again. The film shows much of a cold war situation but with a Korean touch, and this makes it even more intense. I will definitely go and try to see some more Korean films.",
            "review_date": "2002-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A movie with a latitude",
            "content": "\"Joint Security Area\" takes place entirely at the Panmunjom, Korea  DMZ peace village (a mockup thereof) at the 38th parallel border crossing where North and South Koreans face off with a 24x7x365 military presence engaged in a tense show of force held in check by a 50 year old treaty. The film tells of the shooting to death of a North and a South Korean soldier which is investigated by a Korean-Swiss military woman. In flashback, the film shows the events leading up to the killings and then what transpires thereafter in the resolution. As such military murder/investigation films go (A Few Good Men, The General's Daughter, etc.), this one has little to offer save it's unique location. The film delivers good production value but plays out like a Hollywood B-flick and fails to achieve the gritty reality warranted by the subject matter. Recommended only for those with an interest in Korea or the DMZ.",
            "review_date": "2004-03-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Emotions vs duty",
            "content": "It's a wonderful story which shows story of soldiers of same age, same culture and same feelings. They have to speak and fight against each other due to geopolitical reason.It's a must watch korean movie.",
            "review_date": "2021-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A whip-smart whodunnit with a political message - sometimes politics are dumb.",
            "content": "The Joint Security Area (JSA) refers to the North and South Korean border. A tense and formal area manned on both sides by armed soldiers. By day a South Korean tourist attraction manned by uniformed expressionless guards 8 feet apart, by night the sides withdraw to either side of a bridge in manned posts perhaps 100 metres apart. The no-man's land alongside the bridge is patrolled by teams who must be ever wary of the presence of booby traps or land mines.On one night though shots ring out, 2 North Korean soldiers are killed, apparently by a South Korean soldier named Sgt Lee Soo Hyuk on a road who has confessed but refuses to talk further. In fact neither side wants to talk about it.Lee Soo Hyuk is condemned by the Northern forces and protected by the South, with each party possessing such a strong bias a neutral investigation is commenced lead by Major Sophie Jean, a Swiss resident with Korean ties and a mastery of the language.In interviews and flashbacks the real story gradually unfolds, nothing is as simple – or funnily enough as complicated – as it first seems.It is not fair to the film to say much more, I will say that it takes time for the real events to unravel but it is worth the wait. Being a Park Chan-Wook film it is well acted and immaculately paced, and JSA also contains some moments of great innocence and humanity. In fact the final truth is far more 'boring' and human than anyone might guess from the serious tone of the first few minutes.The film is laid out in three chapters, the first shows the viewpoint of the investigators, the second the actual events from the soldier's point of view and the third the conclusion and ultimately the truth.JSA is never less than intriguing and even though it isn't as great as the Vengeance trilogy it possesses perhaps the strongest final frame in almost any film that I can recall.Final Rating – 8 / 10. A who-dunnit with a difference. An extremely effective drama with a strong cast, a great plot and the usual exceptional direction of a modern day master.",
            "review_date": "2011-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fascinating glimpse at a complex political situation.",
            "content": "It's a shame that so few Korean films (almost none) get any showing in the U.S.  I saw this film at a mini film fest held at a university and I'm very glad I went.  The story is set as a murder mystery but that is only the framework to study the tense situation that North and South Koreans have to live with every day as their people are split in two with absolutely no communication between them.  Even under the threat of execution, the soldiers in this film risk a friendship.  Yet it doesn't devolve into \"can't we all just get along\" smarminess, the beliefs and motivations of these characters are complex.  Sgt. Oh may like the treats that the southerners send but he has no desire to leave his country and believes it will one day surpass the south in every way.  I read that this is the number one movie of all time in Korea surpassing even Titanic.  I think the fact that it deals with a topic so central to Korean life and yet so seldom openly discussed is a big reason for its success.",
            "review_date": "2001-02-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Trust Park Chanwook",
            "content": "When \"Joint Security Area\" began, with non-descript military figures of various origins walking around and discussing dull events in different languages and accents, I was prepared for a tedious military/political thriller like \"A Few Good Men\".I should have trusted Park Chanwook.This is, after all, about the demilitarized zone in between the two Koreas, perhaps the only place on Earth where soldiers of either side come into relatively friendly contact with one another.This has to be one of the most fascinating contemporary topics, and the movie really comes alive when flashbacks of the soldiers interacting play out. This is, thankfully, the majority of the run-time.If the movie has a failing, it's the framing story - showing a young woman investigating the mysterious shooting that resulted from the unusual north-meets-south dynamic - this part doesn't work so well on its own. I think Park wasn't able to find a vein to really connect these scenes with the reader. Perhaps they could have been stripped back, left out, or approached some other way.",
            "review_date": "2018-11-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "one of the best korean blockbusters",
            "content": "Recently, the size of the Korean movies have become enormous. But there are not many Korean blockbusters that satisfy the audience. Many of them are cheezy or don't make senses. \"JSA\", however, is a great film. It's got a wonderful drama, good humor, excellent use of Kim Kwang Seok's songs, great acting and editing. I really enjoy the movie and afterwards, I also felt very emotional. Many South Koreans were forced to believe that every North Koreans are villains and we have to hate them when we were young.  This film, however, asserts that there is no difference between North and South Koreans and ideologies are useless. I hope every Korean movies will have as high quality as \"JSA\".",
            "review_date": "2002-03-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A highpoint of Korean cinema",
            "content": "The story is simple but never simplistic. The two Koreas are separated by the narrowest of bridges, on either side of which is a command post each manned by two soldiers. There is a neutral investigation in progress over an 'incident' at the border patrol that left three men dead and two men injured. Neither North or South wants the situation to escalate, but the investigators are having trouble getting the surviving soldiers to talk.Therein lies the drama. Why, when both armies have been indoctrinated to hate the other, is nobody willing to point the finger? What really happened out there to cause such a bloodbath? So many issues are broached - the absurdity of war, the futility of war deaths, loyalty, friendship, trust, suspicion, and love - and all of them treated in a fresh and quite original way.It's a thriller, a drama, a black comedy at times, and ultimately a plea. If you stick it out for the first twenty minutes or so, burdened as they are by some rather stilted acting and dubious accents, you're in for a treat. This movie is a real surprise - beautifully scripted, wonderfully acted and clearly a labour of love for all concerned. SEE IT.",
            "review_date": "2006-06-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not Bad, Still, Not That Gripping",
            "content": "On paper, this plot promises much - Joint Security Area between two Koreas and a conflict there. Koreans know how to cut great war epics. Here, they tried and mostly failed due to a very usual and thus very schematic plot, often too poor and corny performances, often too predictable a next step. Seems like Koreas want to break down that wall, but the film does not break any - we have seen such twists and turns in The Base or any other political thriller with some shooting involved. That being said, we have to commend camera work and awesome nature views. Apart and beyond, we are fed with a very trivial casual political soup of no fresh value",
            "review_date": "2017-08-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Well intentioned",
            "content": "This is a well intentioned but flawed movie showing the joint humanity and friendship between North and South featuring 2 of the biggest stars in Korea.It's clear what happened quite early on but it is interesting to see how things unfold.",
            "review_date": "2020-03-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simple and complex- JSA is a masterpiece",
            "content": "The headline says it all. While the story has complex elements in its structure and details, thematically it is a simple example of friendship, loyalty and primal fear. The setting- the joint security area separating North and South Korea becomes a crime scene after two North Korean soldiers are found dead at a border outpost. A neutral military taskforce from Switzerland is sent in to investigate and deflate potentially catastrophic hostilities. Complicating matters is the conflicting narratives told by the soldiers on either side of the border. What else to say? Just go watch this movie.",
            "review_date": "2020-12-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Male homo-social desire at the border between the two Koreas",
            "content": "Dear Chan-wook Park, it was a really nice idea to make a film about male homo-social desire set near the Korean border. And it was damn provocative to set a woman right at the center of the investigation concerning the incident at the border. Alas, you cast the Korean equivalent of Anushka Sharma or something in that important role. That actress ruined this film a little bit. Even though the plot was far fetched (or do soldiers from enemy nations at borders actually get together? I don't know), it was a riveting film. The interactions between the soldiers from the two Koreas was electrifying. There was always a hint of danger and violence beneath their camaraderie. I was amazed by the almost effortless brilliance of the actors. Some of the best Indian actors could not pull off these roles effectively. It is an extremely depressing film at the end of the day. A lot of us take borders and our border patrols for granted. But your film shows how petty, ugly and violent it all is. I am sure some fools in Hollywood and Bollywood would remake this and ruin it completely. Especially Bollywood. I can imagine Farhan Akhtar and Hritik Roshan lining up already. Hope you can sue them if they ever try to remake your film. Best Regards, Pimpin. (8/10)",
            "review_date": "2016-01-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A bittersweet life.",
            "content": "'Joint Security Area (2000)' is Park Chan-wook's breakout feature (he directed two lesser-known films prior, but it was this that really put him on the map). It tells the story of a skirmish that breaks out in the DMZ, a demilitarised zone that sits between North and South Korea, and the subsequent investigation that surrounds it. Starting out as a political thriller that follows a Swiss/Swedish team of investigators trying to determine what truly happened (the North and the South present slightly different versions of the event), the picture eventually morphs into an exploration of those involved with the shooting and becomes much more distinct and affecting when it does. The middle portion of the piece is dedicated to the ill-fated friendship that forms between four soldiers, two from the North and two from the South, who spend increasing amounts of time together in a security hut that sits in the middle of the DMZ. Due to the affair's structure, a lot of the plot is a foregone conclusion; as such, the story is incredibly tragic, even when it's at its most genuinely hopeful. In many ways, it resembles 'Romeo and Juliet', actually. At its core, it's an exploration of friendship. People with differing political views can be friends, and human connection will always find a way to thrive no matter what sanctions are imposed on it. Despite being about the tensions between North and South Korea, it doesn't actually take a side; neither country is portrayed as the 'bad guy'. Instead, it presents the tension itself as the antagonist, the only thing standing in the way of its core characters' one true goal: companionship. It's a really sad film overall, but its mid-section is brimming with joy. It renders its central friendship as shaky but substantial, often conveying a sort of child-like wonder at the fact that such a connection can exist. It's really sweet to see, even if there's always an inevitable sense of impending doom gnawing away at you. The movie is incredibly compelling. Its mystery aspects are engaging and its emotional punch is palpable. It's a picture which feels as though it actively wants everyone to put aside their differences and just shake hands, but it also feels as though it knows such a thing is unlikely to actually to happen. It's bittersweet, for sure, but its message is important: after all, if soldiers from opposite sides of one of the most politically intense scenarios in the world can be friends, why can't we all?",
            "review_date": "2022-04-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "When enemies become friends...",
            "content": "A story about enemies becoming friends, and how terribly wrong things turned for them. This interesting story can easily be divided into three acts. The first act sets up the criminal scene, where the killings took place. It is mysterious and the investigation itself is interesting as they try to put pieces of the puzzle together.The second act takes us back in time and set up the circle of friends. It tells us how the two soldiers from South Korea and two soldiers from North Korea met, and how they became close friends and shared anything from showing off their girlfriends to playing silly games together. It just proofs again soldiers from different countries can actually be friends instead of killing each other simply because their governments demand it. The film was a bit slow moving during this part, but it was nevertheless interesting.The third act takes us to the present again, as the past and present meet, and the investigation continues. This was very interesting indeed, but it does have an unexpected ending.",
            "review_date": "2018-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Park Chan-wook draws a line between war, antiwar, friendship and animosity with a timeless cultural phenomenon.",
            "content": "JSA: Joint Security Area (2000) :\nBrief Review -Park Chan-wook draws a line between war, antiwar, friendship and animosity with a timeless cultural phenomenon. I am an Indian and I can imagine what the situation and tension between soldiers can be on the borders. Especially India and Pakistan and India and Bangladesh, because we have a past that connects the cultural and patriotic hatred between these nations. All the Korean audiences must have seen Park Chan-wook's JSA with the same mindset, and I am sure it would have left them stunned. I don't care if the film was a huge hit at the box office, because this isn't just a film made for money. This is a cultural phenomenon that every Korean must see. I am an Indian. I don't know anything about Korean wars and borders and yet I am saying this, so you can imagine what impact this film has. It is about friendship between enemies and a lesson that this kind of friendship lasts longer than BFFs and childhood buddies because, you know, the friend is a national enemy and the patriotism in your blood does not understand the difference. You can't think by mind and heart when your actions demand the brain, and sometimes it gives a lifetime of pain to your heart and mind. After a shooting incident at the North/South Korean border/DMZ leaves 2 North Korean soldiers dead, a neutral Swiss/Swedish team investigates what actually happened. It's not a typical thriller but has a few slides of it, which works ultimately. The performances of all five leading actors are top notch, especially the four soldiers. You can feel the tension when they shiver. That sweat falling off their bodies makes you sweat out the situation. The atmospheric impact is damn too effective. This has to be Park Chan-wook's best work before \"Oldboy\", and if some people say that JSA is a better and bigger classic than Oldboy, then I swear, I won't argue with them. The motive and its importance of JSA's subject are way beyond borders.RATING - 8/10*By - #samthebestest.",
            "review_date": "2022-09-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Little more about the film and the director",
            "content": "Absolutely I loved this film. In 1999 and 2000, there were two huge hits in Korean box office, both of which were based upon the theme of 'division and reunification of two Koreas'. The first one is Swiri(aka. Suiri). The other is JSA.I really loathed the first one since it just imitated Hollywood action movies based on 'the cold war ideology'(kind of SWAT) while I loved the latter. Apart from my comments on this film, what I really want to mention is about the director, Chanwook Park, who won the Grand-prize of Jury at the Cannes Film festival just a few days ago with his film, \"oldboy\".IMHO, Chanwook Park is one of the most promising directors in Korea along with Changdong Lee(Oasis, and Peppermint Candy). However, in his early days, he was not quite commercially successful with his two films though they were stylistically unique. ('trio' and 'the moon is a dream of the sun')For several years, the director Park could not start his own film (probably) because of lack of funding. During the time, he worked as a film reviewer in film magazines. JSA is, as many mentioned, based on a novel with the same title. But the film was not the director's project. Simply speaking, Park was hired by a film-making company which valued his talents as a director.This film, JSA, is not a film which really shows the director's own directing style though he did a great job in this film.After the success of JSA, he has made two films on the theme of 'revenge', both of which are what Park really wanted to make. If you are really interested with the director's other works, I highly recommend \"Sympathy for Mr. Vengeance\" and \"Oldboy\". He is remarkable as a director in them. He will finish triology of the 'revenge' films probably next year (Sympathy for Lady vengeance).",
            "review_date": "2004-05-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Couldn't care less",
            "content": "I watched this because it was made by the old boy from Old Boy. I had also recently seen Memories of Murder and thought I was on a winning streak of enjoyable Korean movies.Strike three - I'm out.I can see what they were trying to do, and the story is familiar of people from opposite sides making bonds that break.My main problem is that I found that I couldn't care less about any of the characters. The acting ranged from fair to appalling. The female non-Korean Korean inspector was probably the worst.The story was nothing magical and there are no surprises for anyone over the age of 21 as all of the elements have been done before.I suppose I was also disappointed after hearing so many good reviews - my expectations were set so high they had further to fall.My advice is that if you enjoyed the other movies I mentioned, and Olboy more so than memories, then save yourself and move on to another choice.",
            "review_date": "2012-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very good human drama",
            "content": "This movie is much less about the solving of a crime than it is about the difficulty of one people living apart by an absurd accident of history. It is not a whodunit, it is a story of human friendship above rules and almost fanatical enmity. Al characters portrayed are equally human, even up to the completely one-sided South Korean general who thinks the only good commie is a dead one. This movie is a metaphor for both Korea's today, seeking to come closer to each but prepared to slit each others throat in a split second just the same. At the same time the practical difficulties in making friends across such a divide show that not only can the difficulties of two countries be accurately conveyed into the behavior of just four people, it also shows how vice-versa the actions of both Korea's, which inevitably lead to great drama, is at the same time a metaphor for the small tragedy that unfolds in the joint security area. Highly recommended, if only for the last shot of the film which is almost literally a snapshot of the entire bond of friendship portrayed in the film, even beyond borders.",
            "review_date": "2008-06-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "KNOW THY ENEMY",
            "content": "You may be tired of hearing it but I'll say it again anyway. One of the joys of movies coming out on disc is the availability of seeing films you might otherwise have no access to. This is particularly true when it comes to foreign films. Don't get me wrong, I'm not one of those people who think all foreign films are artistic masterpieces that American directors should follow. But it's a nice to experience the films from other countries and other viewpoints on various topics.One such film is JOINT SECURITY AREA, a Korean film directed by Park Chan-Wook in 2000. Famous for his trilogy that included SYMPATHY FOR MR. VENGEANCE, OLDBOY and LADY VENGEANCE, this film was made just before that series began. The film focuses on the situation in North and South Korea and gives us a look at it from a Korean perspective.In the de-militarized zone (DMZ) Joint Security Area at a North Korean border house just across the bridge of no return two North Korean officers have been killed. Sergeant Lee Soo-hyeok (Lee Byung-hun) is a South Korean soldier who crosses the bridge wounded as gunfire erupts from both sides. Why he was there and how he may or may not have been involved in the deaths of the two other soldiers is the crux of the film.The thin line between the two countries is fragile at best and what transpires may have a major effect on their situation. The Neutral Nations Supervisory Committee sends in an investigator, a Swiss Army Major named Sophie Lee (Lee Young-ae). As she investigates things don't add up. In particular the fact that the story Sgt. Lee has told her doesn't match with that of North Korean Sergeant Oh Kyeong-pil (Song Kang-ho).Sgt. Lee confesses to shooting both dead victims after he'd been captured and began an escape. Sgt. Oh claims that he barged in and began shooting everyone before escaping. In the melee that follows the number of bullets found in the various bodies and location don't add up to the same number fired. One is missing.In the course of the investigation another witness is called in, Private First Class Nam Sung-shik (Kim Tae-woo). He seems troubled with the line of questioning and is pressured by those conducting his interview. So much so that he jumps out of the window of the interrogation room in an attempt to commit suicide.As the film and investigation move forward we learn more about what was going on at this border location. A set of circumstances set into motion a friendship between the guards on both sides, led by both sergeants. It is a gradual friendship that transpires over time. But a major event takes place that led to the shooting. Just who the real guilty part is isn't revealed until the end.It is rare, if ever, that we as an audience are allowed to see or hear much about the border between North and South Korea. With the exception of the film/series M*A*S*H and President Trump's recent visit to that border I can't think of much we've heard about it. This film presents us a picture of two groups of people literally at each other's door who discover they may have more in common than they realized. It is only the bureaucracy of each that interferes with more people discovering this.The movie is amazing and highly entertaining. I found myself caught up in the story and never once noticed that it was sub-titled or felt the need to grab the remote in search of the fast forward button. The movie is as much about people and friendship as it is about the problems of both countries. That draws you into the more human aspects of the story.Wook is an amazing director as is seen not just here but in all of his films. Here he works with a more subtle story than I was used to seeing from him. The development of the plot taking it's time to unwind works well with this story. The back and forth from one version to the other also helps present underlying issues surrounding that story. The end result is a wonderfully dramatic film that most will enjoy if they only give it the chance.",
            "review_date": "2021-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great one",
            "content": "It's very difficult to rate this film because it's a masterpiece from the moment that they - Norherners and the Southerners - meet for the first time, but the first act is merely ok, with the English bits being barely tolerable.The friendship, that feeling of discovery, the danger of the unknown and forbidden - all that makes the best of this film and, of course, you can't forget the fantastic job done by these superb actors. This was the first big success of Park chan-Wook and it's easy to understand why. He seems to manage the camara, the silence, the close-ups, the non-verbal language like very few. It's probably his easiest film or the most mainstream friendly, but it's so provocative than in the hands of most other directors would never be called mainstream.",
            "review_date": "2022-05-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "goosebumps of the utterly corny",
            "content": "instructions for survivors of JointSecurityArea: clear the area, check your security, and smoke a joint--forget the pain and the shame of having been fooled into watching JSA. I'm kidding. It's not as bad as I am trying to preach it to be, but the frame of the main story is so awful in every way, that Steve Oedekerk ought to do a Kung Pow on this. There's a nice tension build-up as things get complicated between the four main characters, and then, there is a shameful flow of tears on the part of a conveniently over-emotional female officer whose only purpose is to work as an applause sign on a sitcom recorded before a live audience for the female audience it obviously targeted. yuck. muck. The narrator of the main story also looks like the skinny guy from the comedian team Bakusho Mondai. And everything is meant to sit so heavy on your stomach like really cheap Chinese take-out grease. You could picture the producer sitting in the audience and in a low dead voice say \"oh no!\" every half-second by the end of the movie.",
            "review_date": "2002-04-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A linear tale failing to truly deliver its message",
            "content": "While the scenario of the incident itself is pretty good, the introduction and embodiment of it into an investigation is a disaster. The acting of the so-called neutral investigators were miserable, Yeong ae Lee as the major was disappointing, and her Swedish colleague is not worth mentioning.While lacking a bit of originality the movie still highlights the absurd border tension between the North and the South.The major problem was the lack of character development leading to nonexistent affiliation to their feelings resulting in an emotionless conclusion.Apart from this the direction was on point, as you would expect from Chan-wook Park, and the movie ends on a stunning note leaving you with a sweet aftertaste that the film doesn't truly deserves.The movie isn't bad, but if you're looking for yet another of Park's masterpiece, sadly this isn't one.Special mention for Song Kang-ho for his impeccable performance!",
            "review_date": "2017-08-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad script and mediocre comedic acting",
            "content": "It's just not a good movie.It tries to be a detective movie. So how well did they pull off this goal? Terribly. There is a female investigator looking into a shooting. She's supposed to be Swiss yet she speaks fluent Korean as she learned it in Switzerland. She looks 100% South Korean, not mixed race, and she speaks broken English with a heavy Korean accent. Even when she speaks to other Swiss workers she never once speaks anything besides very broken English and Korean. She doesn't look or seem European at all. Anyhow, she is supposed to investigate a shooting where 2 fake reports about it have been filled. But instead of her slowly uncovering the evidence we just get A TON of flashback scenes showing us what really happened way before she uncovers it. They don't even let her uncover the evidence to then show us much more. We learn it way before she does all the time. At the end you just get those overly emotional scenes where people can't hold back and confess to everything one after another. There is no detective work. It's all just gifted to her because they are all overly emotional. This is just bad writing 101. A Hollywood movie written this way would get panned by everyone.It not only fails horribly as a detective movie, overall it's just over the top often focused on slapstick. So the drama also doesn't quite work as half the movie is shown via flashbacks. It's stuff that already happened and often focused on silly scenes like friends pointing guns at each other for fun. Stuff you NEVER do unless you want to either kill or be killed. This script thinks all that comedic stuff is a fine substitute for a deeper story. Just a bunch of silly nonsense. You can't really get into any one story because we fly all around times and places. Especially the female detective doesn't get enough to do. But she's painfully off in this role so you really don't want to see much of her. The other characters also just have things happening TO THEM. There are maybe 2 semi-important choices taken by characters. Everything else are just random events. So as an action, detective, comedy, plot focused movie it fails. I guess it may be emotional for some? But since half of it is flashbacks I don't see how anyone can feel like this is a proper way to tell any sort of story. The South Korea and North Korea conflict is not enough to make this feel emotional. You still need to write a proper script. Here the scenes are set in a very small area in small places so it also looks like cheap melodrama.Skip this.",
            "review_date": "2021-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Joint Security Area",
            "content": "A mysterious shoot-out at the North/South Korea border sparks an investigation by the countries overseeing the neutral zone. I was quite pleased with the story of the incident and the events leading up to it. Park's approach to relations between the two nations is very humanist, with warm performances from the four characters involved. I really wanted to see how the situation developed. What didn't work well at all was the framing structure. Although I hate to sneeze at any opportunity to watch Lee Yeong-ae (LADY VENGEANCE) at work, the scenes involving her were the most clichéd and perfunctory. Also, the investigation parts go away for a long time in the middle, and it's a bit disorienting when they return. It's weird to be given the story in small bits for a while and then suddenly be given a huge chunk of it. I think the framing device would have worked better if it was more like bookends, or heck, even just tell the story in straight chronological order. But it's not a large detriment to the film, which in general is engaging, if not quite as distinctive as Park's vengeance trilogy.",
            "review_date": "2012-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disappointing",
            "content": "I watched SYMPATHY FOR MR. VENGEANCE a few months ago and absolutely loved it. Brilliant visuals, great acting and the story really moved me. So of course I was curious about what else director Chan-wook Park had done. I decided I would pick up his earlier film \"JSA - Joint Security Area\" at the first chance I'd get.However, the film turned out to be a total disappointment. Yes, there were a few brilliant visuals but this time around I just didn't care for any of the characters. I get the impression that the film is supposed to be suspenseful but for me it was mostly boring. The film was a huge hit in Korea so I assume that if you are more familiar with the real life political issues addressed in JSA it plays better. SYMPATHY FOR MR. VENGEANCE certainly tells a much more universal story that could happen everywhere in the world...JSA is not a terrible film but nowhere near the brilliance of SYMPATHY FOR MR. VENGEANCE.",
            "review_date": "2003-12-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good, Early Park Chan-Wook",
            "content": "Joint Security Area is a complex early work of Park Chan-Wook, combining a military political thriller with a meditation on the brotherhood of man. Although it does not reach the heights of his later works such as Old Boy and Thirst, it is an early demonstration of his ample talent, and features several actors who would figure prominently in his later work.Tensions on the Korean peninsula escalate wildly in the wake of a shooting incident just over the North Korean border, in which a South Korean soldier is the culprit. A Swiss soldier of Korean descent is sent as a neutral investigator. However, what initially appears to be a story of international aggression by either one side or the other soon turns out to be something far more complex, and tragic.This film showcases the things that made Park Chan-Wook's later films classics. It weaves a complex, non-linear storyline with the innovative cinematography that make all of his films beautiful. Furthermore, the performances by Lee Young Ae and Song Kang-ho are powerful, prefiguring their fine turns in Sympathy for Lady Vengeance and Thirst, respectively.Although this film did not show the level of creativity associated with Park's best work, such as Old Boy, it is more than worthy of being sought out by fans of his other films.",
            "review_date": "2010-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hooks you up",
            "content": "Wonderful. The story of nations divided by the politics and how the persons in army are just doing their duty even though same blood flows through their veins too. Good use of wide shots. The story keeps you hooked to itself as it is revealing. The story unfolds on itself and calmness really matters when everything turns into chaos. The one who prevailed was the one who remained calm and true to his soul while others just lead the rash decision change their life forever. The guilt is what drowns you soon enough. Can we really be united? Not until we have the greedy politicians. But which side is right and which one is wrong? The answer is never in binary. It is amalgamation of both.",
            "review_date": "2022-09-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "JSA - Just Satanize America!",
            "content": "I had high expectations before seeing this movie.  After all, it was the highest gross movie ever in Korea with raving reviews, boy, was I disappointed....* POSSIBLE SPOILER BELOW *The movie has so many holes that probably the only thing with more holes is the insecurity of the border between Koreas as depicted in the movie.  And what's with the American bashing?  \"If America started the war, both Koreas would be finished in minutes.\"...I think if you grew up in Korea, you would be \"indoctrinated\" with the belief that the North and the South would eventually unify, that people were the same...  This is probably why this movie is so popular - because it combines those 2 beliefs and gives people what they want to hear.  I do not hold that belief, this is why I have trouble with all these glaring holes - the poreness of the border, the impossible belief that life-long enemies can make friends so easily, the American bashing, the carelessness of soldiers (especially they knew Choi's visits from time to time).* END OF SPOILER *Besides the holes, the movie is meant to be a suspense thriller? but the cat is out of the bag too early in the movie, so there is really no mystery. The movie also does not do justice in showing the full spectrum of how difficult building friendship and trust between 2 sides really is.  You save my life, now we are friends, just doesn't cut it.Major Sophie's English is another distraction.  Her English dialog is rather awkward...  Most of her scenes are pretty bad actually - I can't but laugh at how she is able to obtain Lee's/Oh's confidence...  Why would they even trust her???Bad movie, bad acting, bad plot...",
            "review_date": "2003-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Deeply moved",
            "content": "I think \"Oldboy\" was the first flick I ever saw by Chan-wook Park and it turned out to be a good entrance to the realm of Korean movies. Before that, I was particularly fond of Japanese flicks (and still am) but I discovered that Korean flicks have the true potential of delivering that little something something, too.\"Joint Security Area\" features much more than classic tension between two worlds (in this case regimes), and, the flick depicts very well the emotions carried by the characters here. Along with some great acting performances, the scenery is really sweet. There are a few of these which are really that something something! To those who expect raw violence of war, keep on looking because you're not going to find it here.I have nothing really to rant about. The plot is nice and with ease I perceive this original flick to be a piece by Chan-wook Park and with that comes good quality all along. 7/10.",
            "review_date": "2006-07-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A feastful delight of intelligent, yet heart stimulating Drama/Thriller.",
            "content": "This is just one of the most memorable film i've ever seen in the past months,although the genre suggest \"Political cold war thriller\" i dont really go with that, the mentioned genre suits more for films like The Siege (1998?).There should be a specific genre for a film like this, i roughly refer it as \"Male bonding thriller\", despite the risk of being cheesy this film actually manages to surpass the level of the corny field, at the same time hits the goal in being one of the most memorable film in 2000. If Oscar works universally , this is a no-question contender for acting, direction, photography, editing and heaps more.(yes people, i do mean it!).So, JSA revolves around the mystery that happens around the Line Perimeter that separates North and South of Korea, thus its called \"Joint Security Area\", the film starts with a chaotic gun blazings between the mentioned border, as a result Two of the North korean soldiers ends up worm chow, one wounded southie, the frame of the story recoils around the investigation of the neutral Swiss unit, sending one of their Military investigator; a Swedish grown Korean Major Sophie Lang.First i must to advise viewers for those who are not familiar of what happened between the North and the South (Korea) two countries that has been separated under two different ruling system, South being a Republic and the north being Communist(since the China alliance).In the process of peace keeping and the intention to unite, forms of violence has occured,making the vibe between these two neighbouring brothers a murky and hateful one, similarly to what happened with UK and Ireland. Ok that is the ball park estimation to whats going on , since i dont want to go on about histories, however i still advise those who have heard of the hype of this masterpiece and yet hold no idea of the conflict of the two countries, to read some articles about it.And with that the unfolding of the mystery is on the process, as the film goes we are offered little clues and hints of flash backs(most of the film consist of flashbacks) that shed some light of what really happened, and by the the second to third act, audience will realize why i call this a male bonding thriller.Director Chan Won Park, combines a subtle mixture of Hollywood-big-budget-ish vibe with the traditional methodic essence of Asian Cinema story telling, and what a job he did! From the First scene one would assume that this will be another Shiri(1999) type-o-ride, since Shiri coincidentally also revolves around the conflict of south and north.The lush Photography which lately have become a flaunting show in Korean cinema , managed to capture the cold intense atmosphere of the border area, and this is great because most of the location are limited to borders, fields and military bases.The acting was an all around power house, especially one Kang Ho song, playing the brutish charismatic Sgt.Oh Kyung Pil of North, the one person without any professional acting experience delivered his screen persona raw and primal. Yong Ae Lee as Maj. Sophie Lang, her role is not an easy one, since she is the sole female character in a male dominated Military drama, and also she speaks alot of english in this film, now usually this is a very hard job to do for Asian Actors, that is, unless they have been trained in a western country, yet she avoid the goofy land mines succesfully, credits to her (freudian slip: for a painfully obvious example of Asian actors hitting the goofy land mines while speaking english check Hsu Qi in Wesleys Mysterious File(2002)or in that matter, almost every try to be international techno spy Hongkong film). The rest of the cast never once act flat as to insult the audience, each seriously drowned in their screen characters, also last but not least the \"Gwaylo\" actor Chris Hoftrichter playing the wise sage Swedish General Botta, for once i finally see a western actor who didnt won the most over acting Gwaylo award, you know, the ones who usually appears in 80's John woo films.All in all i have to say that this film is a must buy, having it on my DVD collection it is such a shame that special features have never been subtitled in Korean release DVD, and if its going to be released in reg. 1 its most probably have been chopped off like they did to Nowehere to Hide(1999).PS: watch for the last 5-10 minutes, the most beautiful photographical symbolism ever hit on cinemas for so many years, that scene struck me so strong in the sad soppy nerves, darn.4.4 outta 5 stars.+ 4.4 because all the whiz i already revealed up there.-0.6 for some tricky pacings although it doesn't occured more than twice or thrice at most, and also for some minor flaw in an obvious use of CGI.",
            "review_date": "2002-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Chan-wook Park is a completely underestimated talent",
            "content": "This film is even more testimony to what a brilliant film maker Chan-Wook Park really is. Memories of Murder, Oldboy and Last Life in the Universe...each of them showed a new and creatively delicious side of what a great director can accomplish given a great crew and cast as well. It could just be the fact that I'm such a huge fan of his work, but I think he's a genius. Not only that, but there's no Asian actor working today that I could say I respect more than the one and only Kang-ho Song. These two are some of my idols. They're the best at what they do. If you haven't yet watched JSA, watch it. It's a beautiful story that shows just how tragic and unnecessary war is. After watching this, a few of my friends (pro-Iraq War republicans) actually told me how it really moved them. It's worth a watch, without a doubt. If you're thinking about watching the dubbed version, DON'T! It completely ruins the passion and humanity of the characters. If you don't understand Korean, choose Korean audio, English subtitles.",
            "review_date": "2006-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beyond borders and beyond 26 Alphabets",
            "content": "Awesome movie, really a worth watching one for sure. Beautifully directed and even more powerfully presented by all the actors. Amount of emotions that are displayed by characters are in just 3 hours are really amazing. It really makes us think really why , why we all have wars and borders. World should be an open place without borders . Just one nation named \"Our Human Race\". It really promotes peace . Just because previous generations had war doesn't mean this and upcoming generations should also have war . We have a choice , let's choose peace for betterment and enrichment of all of us. We need no-nonsense and more quality movies like this.",
            "review_date": "2022-10-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rarest film ever !!",
            "content": "Rarest film ever !!What a movie, its a bold rare attempt which brings North and South Korea together directly for a movie story. I have never seen a south korean movie which direclty shows the north korean military backset without affecting the relations.JSA is the place where south and north korea meets for bilateral discussions, called as truce village.Story is well written , scripted and directed. I have seen Park Chan Wook's old boy, Mr Vengene, Lady vengence. JSA was made before these. However its so beautifully taken and ending with an emotional note.Bagged alot of awards, due to the excellent actingWorth a watch as there are very less movies which decipits normal soldier's story which tied to both nations.",
            "review_date": "2021-05-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heartwarming and a thoughtful retrospect",
            "content": "The first Korean movie I ever watched, and what a wonderful film it was. JSA surprisingly, not only entertaining but also has something meaningful to say about the current dilemma/division between North and South Korea. The story is about a current investigation into the killings of two N. Korean border watchers by a S. Korean officer.  If you were aware of the politics in today's Koreas, than you would know how easy a little spark could cause the two Koreas into war. But instead of dwelling on the aspect of politics o military, the writer chose to emphasize on the humane aspect and thus has managed to give us, the audience, a profound message in a world that is ever-more divided by race, religions, idealogies, etc.The movie doesn't choose sides and instead create a 'neutral' character, Major Sophie, as the investigator of the 'truth' behind the killings. The film also intelligently unravels the real story behind the incident, through cuts of flashbacks between the survivors involved in it. But unlike the different interpretations of truth in the minds of the perpetrators, in Kurosawa's Rashomon, there is only one continuous truth in JSA. The only lies were constructed by the government and military of both Koreas for the sake of division and war, instead of peace and union.The performances by the lead actors were excellent; it's a pity I cannot say the same thing about Lee Yeong-ae, who seemed was concentrating more on her English than her acting. The same goes for all the caucasian 'actors' in the movie, who couldn't hold their grounds when compared to the korean male actors' performances.Not knowing any Korean actors/actresses in fact, gave me the advantage of not choosing side either. It gave me the chance to see the movie unbiased. Overall the movie may seem over-glossed with espionage/hi-tech military politics, but by the end of the film, you would feel like you have been through a dark long tunnel and came out on a very bright and beautiful side.I must say the last scene of the movie is one of the best visual conclusions to the essence of a story in decades.Peace.",
            "review_date": "2002-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a korean masterpiece that deceptively amazes",
            "content": "I won't go into massive detail but it is a excellent example of korean cinema led by massively likable song kang ho and while the murder element does take away from the film somewhat it leads to a immensely satisfying conclusion The story begins with murder and mystery with political overtones, yet at it's heart, it's a film about friendship. The likable characters which never succumb to stereotypes bring to life a strange friendship which is rare under the political times but is treasured all the same. It does help if you have some knowledge of korean history but isn't required and can appeal any audience willing to invest time into the slow start.",
            "review_date": "2010-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie, but here is some background for those who did not like this film because of misunderstanding.",
            "content": "This is one of my favorite movies despite some flaws.First, I'd like to point out for those who've watched this film after realizing it was made by the same director, Chan-wook Park (Oldboy). Please keep in mind this is one of his first films. Before this film Park was basically an unknown. You can tell that it is a low budget film. This explains the bad acting on part of the English speaking actors.Second, you must understand the background for this movie. This film is loosely based on a true incident near the border. If you think this film was 'unbelievable,' I'd like to point out that it is merely improbable, but not impossible. While the North and South Korea are still technically at war, it has been over 50 years since the war broke out. Public opinion has been changing, but even so this film was extremely controversial because it portrayed North Koreans as human beings instead of the enemy. This movie touches on an extremely sensitive subject - perhaps akin to a Jordanian-Israelite friendship story. The point of the movie is that even during war, there is always a sliver of humanity (Like the film Joyeux Noel).Third, this film is NOT homo-erotic. Many things considered 'gay' in other countries do not equate to the same things in other countries. It doesn't make Koreans any more or less homophobic as say, in the US, but there is a different definition of what is considered gay. In Korea male bonding is considered very important. Many friends consider each other as close as brothers. This is completely normal in Korean society. In fact, Lee's role as the only female cast was chosen to 'balance out' all the male relationships. While I do not agree with this decision, I am extremely glad there weren't any needless love scenes so common in movies.I urge people to understand the context of this film before watching for maximum enjoyment. The premise is incredible, the directing is good, but unfortunately the acting of foreigners and the choice of Lee prevents me from giving this film a perfect 10. Yes, it was a little melodramatic, but you should expect that from most Asian cinema. Many Asian countries have experienced extreme violence in their own land in the 20th century. 8.5/10",
            "review_date": "2009-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A well crafted mystery centred around the relationship between North and South Korean soldiers",
            "content": "Joint Security Area is not a war movie, but a mystery movie at its core. It's not particularly heavy, as it's filled with humour rather than gut-wrenching depictions of real-life North Korea. It's also quite sweet, which I found to be its saving grace. In all honesty, I wasn't enjoying the movie until probably half way through, once we begin to see the true nature of our protagonists relationships.The structure of this film is very unique in that it portrays multiple realities as described by different characters. Looking back, it reminds me of what I had hoped The Hole (2001) would be, instead of the blatantly obvious anti-mystery that it was. JSA manages to provide some basic information about the situation, and then depicts the situation in three different ways, all of which were plausible and, from what I remember, consistent with the details outlined by Major Jean. It's almost like a classic whodunit.What I didn't like unfortunately, was pretty much every scene that wasn't focused on our four main characters. I found the performances by the Swedish and Swiss soldiers, as well as Major Jean, to be amateurish. Particularly during their English dialogues - which is guess is forgivable as I assume English is at least a second language to each of them.There were also times when Major Jean was laying out her analyses of the murders that I simply couldn't follow. Mostly cases wherein her logic seemed nonsensical, and her proposed explanations came out of convenience rather than actual detective work.All in all it's a pretty good movie, but I still have my issues with it. I have to say it's probably my least favourite film from Park.",
            "review_date": "2021-07-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not bad",
            "content": "Being a huge fan of Parks \"Oldboy\" i bought this movie and was quite disappointed (in comparison), but it is difficult to say where exactly the flaws were. The plot is not without interesting twists and the movie avoids most clichés that you await in your standard military-research movie. But especially the female-lead character is far too weak elaborated. I had difficulties to follow the motivation of all the characters (especially the soldiers), and the cast was permanently overacting. As Park mentioned in an interview \"between the lines\": this project was mainly intended to hit the box-office so that he could get his next work (\"Oldboy\") financed, and being the most successful south-Korean movie of all times we have to admit that this goal was achieved. But it is far from the emotional impact that a movie like \"No man's land\" had on me, who has a quite similar subject. (5/10)",
            "review_date": "2006-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "War(m)-up set for Park Chan-Wook",
            "content": "To be honest, i expected this to be the weakest Park Chan-Wook movie, especially since it's his first ''real'' feature-length film. But this was really impressive stuff, particularly with having that in mind.Narrative is a little bit scattered, and i caught myself being lost couple of times trough the movie. Maybe it's the language barrier contributing to that as well, especially since not a single English subtitles was translating when characters spoke English, and that was a nightmare to understand, let me tell you that.Performances are (mostly) great, but in correlation to what i said above, every time English is spoken in the movie i had a feeling that it dragged down performances of the actors speaking it.Maybe even i approached the movie with the wrong mindset, expecting mystery, and was negatively surprised when i noticed how predictable it is from the start. Thankfully, it's much more than that. Don't expect mind blowing twists and fireworks, there are some there, but expect to be moved and to relate with people you will follow trough this story.It's really important movie, and i think director Park succeeded in delivering the message he wanted to deliver, and that he did in style, while at same time shedding some needed light onto South Korean/North Korean conflict and mentality to the world. He achieves to involve the viewer emotionally in the movie, and that's the most important part to achieve as a filmmaker here, to make you care and be involved in the situation and events you absolutely have no business to care for.When i noticed the music in the movie i instantly knew it was Jo Yeong-Wook, the legend himself, the Korean Hans Zimmer. Surely enough he delivered once again, with deeply touching and chilling score.And that last scene, or should i just call it the last picture...Amazing stuff. It seals the deal, and makes sure the movie stays in your memory.",
            "review_date": "2022-01-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie, but no masterpiece here",
            "content": "I'm not a Korean, but I do have a pretty good understanding of the historical background between the N and S Korea. That said, I didn't try to watch this movie as an historical evaluation piece. I went in with the mindset of watching an movie. With that mindset, I'd say this is a pretty good movie. Is it a masterpiece though, well, unfortunately no. This movie has a military investagation - i.e. one of those 'who did it?' or 'what really happened?' plot. I guess you could call it a 'military mystery' movie. This mystery started up pretty interesting with the the 'extra bullet' setup, but with all the buildup throughout the entire movie you kindda expect more. And when the cat's finally out of the bag you kindda go \"Huh? That was it?!\"There's good acting from all 4 Korean soldiers, while I think the acting from the female investigator's not as strong in comparison. Which is not to say it's weak acting ... but relative to the 4 actors it was lacking. The role almost spells out \"Demi Moore from A Few Good Men\" and in this case, the performance's far inferior to Moore's ... which probably isn't a fair comparison though.The performance by the 4 actors' so good it made you believe in the friendship between those 4 soldiers. And because of that **SPOILER AHEAD** it makes you question why did the S. Korean soldier shoot one of the N Korean soldiers. At least if the movie went in a little more depth on the psychological state of the soldier to explain why he took 8 shots at his 'friend' while just taking a single shot towards that N. Korean superior would help. Furthermore, after his fellow N Korean comrade was killed by 8 shots, it becomes impossible to justify Sgt Oh's action of protecting his S.Korean new friends, instead finding justification for the death of his N Korean comrade. It just isn't human nature.And I can never understand why the other S. Korean soldier (sorry but I'm poor with names) would commit suicide by jumping off the building, especially when it's later revealed he didn't kill anybody.All plots have flaws. But when this is movie based upon conflict of loyalty towards your country and friendship, a flaw in that coarse of action leaves a big question mark on the main plot of this movie.It's a beautifully filmed movie, and is an interesting mystery with a smart setup. It just fell short of a masterpiece with a few significant flaws that are simply anti-human nature. That said, it's still a movie I'd recommend to spend the time and money on.3.5 stars / 5.",
            "review_date": "2004-10-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful, emotional and engrossing",
            "content": "Great movie, well shot and edited, good music and actors that do an excellent work. So the story with the Swiss/Korean officer investigating the case is very so-so and the idiot that plays the male Swiss (?) officer should not be acting at all - but the film was just about the best film I saw one day at the Jerusalem Film Festival. With only 30 people in the audience and no prep work at all - just a wonderful movie with a lot of things to say about the silliness of war and hostility between two countries that are in fact one nation.Go see it, you won't regret it, I hope Chan-wook Park goes on doing great stuff like this in the future. Byung-hun Lee (as Sgt. Lee Soo-hyeok) is one sexy and talented actor (no wonder Nam Sung-shik falls in love with him...) which I hope to see in other movies. Once again, East Asia produces films that are fresh and fun to see.",
            "review_date": "2001-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie",
            "content": "Another example of Asian movie making being superior to American films. This is a great film of four guys (two from South Korea and two from North Korea) who become friends during very tense times. Great performances from the four stars, Byung-hun Lee, Tae-wo Kim, Ha-kyun Shin and especially Kang-Lo Song. It is a very tense story of these four men who meet, drink and play games at the Demilitarized Zone. They come to realize that instead of \"Comrade\" they are \"Brothers\" until the tragic end. If this film was made in the US the ending would have been different. Tom Cruise or Leonardo DiCaprio would not have done what the actor did at the end of this film. I hope that an American director does not try to remake this one. I definitely recommend this film to anyone who love great film making",
            "review_date": "2005-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "More than we expected",
            "content": "We both went into this movie with different preconceptions of what it would be like and when it was through, we both liked enough to give it a 9.We would have given it a 10 if it weren't for the weak acting on the part of the westerners and the female lead, but the story was so good that it still resonates a week after watching it.This is not really a mystery, but a story of humans caught in something larger than themselves and the decisions they make to remain human.",
            "review_date": "2002-09-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unexpected",
            "content": "When I started this film I was think it was a classical action and war movie. At the first 30 minutes in fact, that is but then it's revealed the born and raising of a male friendship between the soldiers. And there is more: there are some winks of homoeroticism around their relation wich considering the context it's something shocking (and inusual for an assian film of the early 2000's).My respects for JSA and Chan- Wook Park!",
            "review_date": "2020-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great!",
            "content": "A really great movie with a rather unusual plot, very good acting, and fast cuts. The end can be a bit hard to understand but that is not the important part of the movie. You can share the movie into two parts; 1. The shooting drama and 2. The friendship that evolves between former enemies. The first part puts the second part in a sort of frame and that is really excellent, however it is the second part that makes the movie worth seeing.In one of the lead roles can you see the (probably) best actor in the world right now, Son Kang-Ho. No actor is bad but he just plays in a class of his own. See this movie!!!!!",
            "review_date": "2006-02-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A terrifically wonderful, enlightening,",
            "content": "sad, and horribly tragic movie. Probably the best movie I've seen all year, and very probably one of the best movies I've ever seen. I am reminded somehow of the tragic heroes of Midnight Cowboy. It was the harmonica music at the end that helped trigger the memory, but the heroes in this movie are equally as tragic even though the circumstances are completely different. There are true heroes, clearly defined enemies and a horrific, terrific blurring of both definitions that left me in a state of bliss, melancholy, joy and sadness. The questions I am sure this movie intended to evoke will probably never be answered to my satisfaction or to the satisfaction of humanity, but lets hope people keep trying. A terrific use of film!!",
            "review_date": "2005-05-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Romeo and Juliet for the 21st Century",
            "content": "I may have been a little swift in titling this review. It most certainly is no Romance, nor is it any kind of a period drama. JSA is however, one of the finest tragedies I have had the pleasure of watching in recent years (and certain elements of the bards famous tale are certainly hidden under the cover of a fine political drama). A precursor to Chan-Wook Parks excellent 'Vengeance' trilogy, this is the calling card any director should wish they could leave. I must admit, when the first five minutes of the film had finished, I verged on going in to shut down mode. The little part of me that doubts maestros came creeping in and started fiddling with my remote controlling fingers. Mr. Park, as it turned out, had other plans. Before I knew it, I was hooked on the stellar performances as they guided me along the same railway tracks of the script which we knew would only end in tragedy. I watched as the camera eschewed poetic quill strokes which would shame most Mamet wannabes of today. This also served as a powerful message. Perhaps a little too idealistic and romanticised for the all too bleak world we have to live in, but this film managed to put aside political differences for a few precious celluloid frames to create one of the greatest friendships I might have seen if the Lenny Smalls and George Milton in Of Mice and Men had just made it through the depression and it shows you what Butch and Sundance might have said to one another if they had turned up at each others bachelor do's for their last goodbyes. But this is not the case, and we know it all too soon. In most cases, when I finish one of my Asia movies reviews, I find my self asking why the west can not make a film like this. In this case I will not say that. Instead I will state 'Keep away from this one America. Do not try to tamper with it with any attempt of a remake, adaptation or manipulation. This is one Da Vinci which should be left behind protected glass, only making an appearance to the west in the form of a Wish you were here post card. Watch and learn, but admire from a distance.' Had this been the first Park film I had seen, I would have gladly waited for a decade for his follow up. Had Sympathy for Mr. Vengeance been his last, I would have gladly waited for the same. Instead, we have since been treated with two tragic-feasts which are just waiting to be viewed, and viewed they should be. Watch them, admire them, review them, and then spread the gospel truth. Chan-Wook Park is one of the new breed, true to his goals and honest with his creations. This is no Frankenstein's Monster, rather the perfect result of an experiment gone right. And to think, JSA is available wherever you go. Food for thought?",
            "review_date": "2011-03-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "CSI at JSA - where friendship is a casualty of war",
            "content": "I don't even remember how it is that I staggered across this movie. One thing is for sure, I won't forget about it in a hurry. JSA is a remarkable story about an incident where two North Korean soldiers are killed in the DMZ, and the investigation that follows. What is discovered as a result highlights that tragedy that befell upon the Korean Peninsula over fifty years ago.Skillfully directed by Park Chan-wook, who would go on to direct the \"Vengence Trilogy,\" JSA has a female lead (Lee Young Ae), who thankfully disappears into the background when the film shifts its focus to the events that lead up to the incident where the North Koreans are killed. Lee Byung-hun and Song Kang-ho are the key performers, playing soldiers on opposite sites, whom share an unlikely first encounter, which is followed by other encounters, before a friendship between the two is formed. Ultimately, four soldiers, two from each side, become friends in a highly unusual setting, as they guard the two respective sides of the \"Bridge of No Return.\" When the friendship is predictably discovered by an NK officer, two soldiers are killed, bringing the film to it's eventual climax. Not wanting to endanger the life of his friend on the other side, the South Korean soldier in custody for the killings gives a fabricated version of events, as does the surviving soldier on the northern side. The final meeting between the two takes place in the conference room at JSA. With the truth seemingly uncovered by the UN investigators, a final tragic truth is revealed about the shootings, which in turn leads to a tragic finale. The final scene of the film, which is a flashback, is quite moving.Overall, in spite of some minor annoyances, ie the English speaking roles, this film is one not to be missed. Whilst the investigation is not exactly rocket science, the story itself is one of friendship under extraordinary circumstances, with a strong anti-war message behind it. Korea is a complicated issue, and what this film succeeds in doing is highlighting just how tragic the consequences are in relation to the unresolved issues on the Korean peninsula. The performances by the four central characters are outstanding, particularly Song Kang-ho as the seasoned North Korean sergeant.History is written by the victor. When there is no victor, there are two different versions of history. As a result, there are consequences, and regrettably, this leads to casualties. This film is about some of those casualties.",
            "review_date": "2011-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Surprising and touching",
            "content": "I saw this film at the Berlinale last week and I was very, very surprised. The publicity led me to believe that this would be a typical Asian actioner, and indeed at the start it looked as though this was going to be the case but as the story unfolded it became apparent that this was a lot more than that. At it's core it's a Roshomon-type whodunnit but the moral of the story along with the amazing photography and stellar acting lifts it up to the level of a true big-budget world film. The four main leads are excellent and thoroughly believable. The \"what really happened?\" style of story telling keeps you engaged throughout and the denoument is very moving without being patronising.If you get the chance to see this film I fully recommend it. You too should be surprised.",
            "review_date": "2001-02-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A must watch Anti-War movie",
            "content": "If supreme leaders of nation think the way these soldiers think and make the world a better place and peace will be achived.. Humans evolved so much in most of the aspects and didn't evolve much from the wild nature in terms of borders and their greed for expansion..",
            "review_date": "2021-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "JSA",
            "content": "My knowledge about the North Korea/South Korea conflict is embarrassingly inadequate. So I cannot talk about the situation solely based on this film or I cannot make an arguement on if this film is realistic about the situation or not.But also, this film gives a general idea about it. In essence, film shows you how the conflict between two governments hurts their people and the tension among the militaries of both countries. Done in the most Park Chan-wook-ian way possible.All I can say is that I am very happy that you did not end up in jail, Mr. Park.",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "really a good sign of reunification",
            "content": "It's really by chance for me to got this film to see, but it make me gain much more than expectation. Though I still haven't got know the nomination on Berlin film prize when I found it, but the subject related in this film draw me attention, seemed sensitive to me¡ª¡ªa China's buffer. When the movie played for half hour, I just consider it as a well-intimated Hollywood Work due to it's tense and suspend mood. However, the end absolutely proved my misjudgement. \"JSA\" is indeed a masterpiece, at lease among the same type movies, political or war. It make me immediately think the same masterpiece, Kusturica's \"Underground\".  Maybe it can compare with it, because of the common affection about the humanism on the people amid the cruel war.  The courage of the Director is really admirable, since the vivid character and imprejudice on North Korea soldier built and depict by a South Korea Director, it's impossible to achieve it if author has no profoundly understand to the history background and great sympathy to compatriot.\nLikewise, the movie make me recall many thing about South Korea, like the campaign against to Japan's whitewash about crime in WWII, government's Sunshine policy on the relation with North Korea, and so on. All this things absolutely prove a sort of quality embed in Korea which probably is the lack in Contemporary Chinese.  Anyway, I sincerely bless Korea, though I don't believe in Jesus, but I still like to say \" God save Korea, the day of reunification will be soon\" .",
            "review_date": "2001-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unforgettable..",
            "content": "This is truly a masterpiece. If you're not Korean, you'll enjoy the masterpiece as an emotional piece of cinema, if you are Korean or even know in detail about Korean history, you will remember it as a message from above.If you haven't seen it, and wanna know in one simple sentence what it's about-- just think of it as Romeo + Juliet, only with friendship instead of love, and two countries instead of two families pulling the relationship apart.Incredible film. That's all I can say..If You Liked This Also see: Chin goo, Failan",
            "review_date": "2002-05-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A noteworthy South Korean movie that lacks political innuendos against North Korea",
            "content": "A noteworthy movie that keeps viewer's interest till the end, \"Joint Security Area\" is abstaining the glaring calumnies and propagandistic political innuendos against the DPR of Korea. And the movie sticks till the end on this \"political sobriety\" with the exception of some divergences. And just on account of the absence of a structured anticommunism, the movie gets quite convincing, while the development of the main characters and the script itself are remarkable.However, the film appears to suffer from historical imprecision and ideological disorientation, since: 1. The division of Korea with all the tragic consequences for the Korean people is somehow presented as result of the political struggle between capitalism and communism. But this is only the half \"truth\".The truth is that after the end of WWII, the allies (USA, Soviet Union and Britain) committed themselves that \"the two zones of military responsibility (in Korea) should be unified as fast as possible in order to form a united and independent state. However, the intentions of the United States and the reactionary circles of Korea were different. Their objective was the socio-political control of the whole country, something that wasn't an easy task for them, since the Korean People's Movement was powerful, and so were the revolutionary forces themselves. Under these conditions, it was obvious that a unified Korean state could not satisfy the interests of the domestic reactionary circles and American imperialism. Thus, despite the international agreements and the will of the Korean people, in August 1948 they established a puppet regime in the southern part of the country with head Lee Seung-Man (Syngman Rhee) that was named \"Republic of Korea\". These developments compelled the progressive forces of the Korean people to respond with the founding of a proportionate type of formation in the north. One month later, in September 1948, Democratic People's Republic of Korea was founded.\"2. The viewer is emotionally loaded as the movie underlines the necessity of reunification, but it never puts the question: \"what kind of reunification shall it be\". And this constitutes a pitfall for the unsuspected viewer. What shall be the political direction of the resulting new state? Because any reunification process has to lead to a definite economic, social and political status. It cannot be neither apolitical, nor neutral, nor completely independent from any ideology. Today there is a lot of experience on the issue of \"reunification\", and an excellent example is the reunification of Germany and its consequences. What do the Germans who were living in the Socialist East Germany, the German Democratic Republic (DDR), what do they say today about the capitalistic reunification of the two Germanies that took place on 1990? What happened afterwards? What is happening the last years to the social and labour rights of the workers of the former DDR and West Germany? The answer is given in a relatively recent poll of the German political magazine \"Der Spiegel\". (Majority of Eastern Germans Feel Life Better under Communism).Consequently, it is undoubtedly sure that a reunification in a capitalistic social-economic direction will lead, on one hand to the constant deterioration of workers' life in North and South Korea, and on the other hand on the rise of the profitability and the possibilities of exploitation for the south Korean and foreign bourgeoisie. That's why it is not adequate to talk about reunification without determining the political direction of the reunification. Concluding, the struggle for reunification of the Korean Working people of South and North is inevitably coincided with their common anti-imperialist struggle and the struggle for a Socialist Korea.3. The movie is covering up the huge and dominating military presence of the USA in the DMZ, obscuring the \"bonds of blood\" between the South Korean bourgeoisie and American imperialism.",
            "review_date": "2011-04-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Artful, funny, and tragic",
            "content": "Saw this film at the Newport Beach Film Festival, and glad I did.  It was very, very good, with mostly excellent performances.  The film is in Korean AND English, with subtitles in the Korean parts here in America.What is so compelling about this movie is how well they constructed the mystery, AND how much we care about the main Korean soldiers involved (and purposely DON'T care about the Swiss officials).  Also, the true foreign view of America is interesting to see (both envy and disdain, with a real sense of their helplessness in the global scheme of things).I would recommend this film to anyone who enjoys well crafted films with good acting, where you both laugh and nearly cry, and learn something new about the world.  If you are just looking for a shootemup thriller or mystery, go elsewhere, because though graphic and violent in parts, this film has far more to offer than that.Personally, as a film concurrent with Crouching Tiger, Hidden Dragon, this is a far superior film out of Asia, but was most likely glossed over due to marketing and lack of martial arts.  But the filmmaking itself is very advanced, especially visually, and ranks up there with some of the best directing and photography the world has to offer right now.",
            "review_date": "2002-06-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best debuts from one of the best directors period",
            "content": "I decided to watch this amazing film again after 5 years or so of when I initially watched it. I must say the film hit me even harder the second time. The acting from the main cast was exceptional and I'm going far as to say the acting of Song Kang Ho haunted me. The only criticism I'm dishing out is to the acting of the Swedish officers and Lee Young-Ae in parts - this is mainly due to the awkward English (why didn't they speak Swedish amongst themselves?) but I don't blame the actors at all as it's obviously their second language. Go watch this film if you got a sec to visit the bay ;) - a true masterpiece of a debut that captures true human emotions/bonds",
            "review_date": "2015-07-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Somewhat of a masterpiece",
            "content": "I don't really care much for the political presence and historical background in the film.  Ultimately the film was a solid mystery that transcends into a powerful dramatic piece.  My two complaints about the film is the miscast of the Korean Swedish women, whose English was a real distraction; and the film really goes out of it's way to convey some anti American thoughts.  The director's other film, Sympathy for MR. Vengeance, does just about the same thing, but less abruptly and more of it.  The story telling, and the unfolding of the plot is rather unique.  Although it is told in a series of flashbacks, no other movie has done it quite this way; which really adds to the effect of the conclusion.  The film was very engaging, right down to the depressing finish.  This is the type of movie you'll think about for the next 30 minutes or so after watching it, trying to piece things together.9/10 Highly recommended",
            "review_date": "2004-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "BSU: Brotherhood Sacrifice Unity",
            "content": "By looking at the other comments on this movie, it must be obvious to you that this film is not one to be missed. Hence the pointlessness of another comment. But one cannot help but to write a few lines when one has discovered something so great.Probably considered the most mainstream and lacking in style of Park Chan-Wook's films, this is still a great piece of work and is not one bit inferior than any of the director's later (more explosive) Revenge Trilogy films. When compared with \"Oldboy\" or \"Sympathy for Mr Vengeance\", the camera work here does lack a bit of artistic quality. One must forgive Park for this as he is simply lending his directorial talents to a studio picture. This is not a \"Park Chan-Wook film\" in the most strict sense, he didn't even write the script himself. With that said, this is still a very well photographed film compared to most American films. The snow scene in particular was very breath-taking.In my opinion, this film ties with \"Cut\" of \"Three...Extremes\" as Park's funniest effort. The bonding of the \"Brothers\" are absolutely hilarious and is very engaging. On top of that, we have a powerfully gripping drama reflecting the Korean people's ideal for unity, the importance of friendship/brotherhood plus an intricate storyline (you try and work out why there's 16 bullets!) you've got a real winner.The only let down was the slightly weak first few minutes of the film and a few horrible English speaking roles. Would have been a 10/10 otherwise. I love Park Chan-Wook :)",
            "review_date": "2005-12-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mind blowing by heart and hands!",
            "content": "Simple war story but bring you to the different angle of the war. Enemies and friends are not antonym.",
            "review_date": "2018-08-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A truly remarkable work!",
            "content": "I had the great experience of seeing \"Joint Security Area\" at theSeattle International Film Festival where it played for packedaudiences two years in a row.  The film begins when Major Sophie Lang, a half-Korean investigator from Switzerland, is sent to the DMZ to investigate ashooting that left two North Korean soldiers dead.   The film is notso much about her, but rather the events that led up to the tragicincident.  The surviving soldiers are very reticent anduncooperative at first, but the narrative slowly unfolds to reveal thetruth of the matter.The film is an extremely intimate look at the human side of international tension.  It explores themes of friendship, loyalty, andpolitics with great sensitivity.  The film does have some scenes ofviolence, but they only serve to illustrate the brutality of thesituation.   It is a very important film that gives insight into anunfortunate political situation.  All in all, it is a moving and catharticexperience.\"Joint Security Area\"  was a huge hit in South Korea,  andthroughout Asia.  Unfortunately, it has not been picked up by anAmerican distributor.  This is a film that deserves to be shownbecause it needs to be seen.",
            "review_date": "2002-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Intricate map with powerful storyline that unfolds bit by bit",
            "content": "Contradictions abound early on.  A crippled soldier dragging himself across a bridge amidst gunfire.  North and South Korean guards spitting on each other... yet grinning.  20 minutes into the movie and I was wondering if it was yet another wasted $8.50 to the movie producers.  But full credit to the storyline and director, the intricate map unfolds beautifully as the movie progresses.  What I enjoyed most was the intense exploration of the internal conflict within the soldiers as they were forced to choose between friends and country in that riveting final scene in the North Korean defence post. More intense than Shiri, the other Korean movie I have seen.",
            "review_date": "2001-10-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic Korean movie",
            "content": "Another gem by the Koreans who have far surpassed the Japanese movies in the last five years.I loved it from beginning to the phenomenal end (with the exception of the two European actors who were terrible). Please do yourself a favor and watch this movie. You will have to replay the ending a few times to understand the brilliance of the final scene.I must admit that my political views are very much like the tough South Korean Colonel (General?) in the beginning of the movie who despises \"commies\". By the end of the film I caught myself thinking about how pour souls can wind up being trapped in a communist hellhole simply by being born on the wrong side of the fence while their brethren enjoy a much better lifestyle on the other side of the fence.A tour de force by a brilliant young director.",
            "review_date": "2005-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm surprised this movie is not a huge famous movie",
            "content": "JSA has an important message, no matter the politics is about we are all humans no matter from the north side or the south side.And the two actors who play the north soldier and south soldier portrayed this message very well.",
            "review_date": "2021-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "wind of change",
            "content": "After the Korea War,every South Korean people had learned all North Korean were a red monster..and they were always watching a chance to invade again...But things are changing........Korea ,the originally one nation,was separated by the world's big power countries and the difference of ideology.. Now,we come to begin to have a mind that we are all the same people. And then the head of North Korea met the one of South Korea in Pyeng-Yang. That event was really shocking...cause we have never ever imagined that kind of thing!The back ground of this movie is Joint Security Area. The place ,the symbol of our separation is  a very sensitive area. In that place,some small accidents could be a big  war.A South Korea sergeant LEE fall behind during the patrol. He tries to find his companion but unfortunately is trapped a mine. At that time, he meets two North Korea soldiers. They are really alarmed each other but surprisingly the North Korean soldier save LEE from the mine.  After that time ,LEE have a chance to meet them(the two North Korea soldiers)..they give and take nods..with a smile. The friendship is going to grow ..they exchange some letters and cigarettes in secret. The more they know each other,the more they realize the North Korean and South Korean are all human just like their friends or family. But their friendship cannot go to long ..cause some tragedy accidents happen..This movie has a special angle of view about the North Korea. In the movie, I can feel humanism. Compared to SWIRI,it's really ironical. The former is old fashioned..the latter is the coming mind, hear,South Korea.If you see these two movie with comparing(SWIRI and JSA) ,it's MORE INTERESTING ~I bet!",
            "review_date": "2000-09-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Surprisingly good!",
            "content": "I watched this movie because I had time on my hands, and there was no other movie to watch. I didn't know anything about this movie, and did not expect much from it. The movie, set in Korea, is about a killing of two North Korean soldiers, shot several times, and an injured South Korean soldier whose gun was found to have pulled the trigger.The movie follows somewhat the style of Under Suspicion. The movie shows the story the person is telling. As the story changes, or is told by different people, the same scene changes slightly. Time goes backwards, and forwards. Eventually the whole story is told, and by the end of the show you are left in your seat saying \"Ah......\"While Joint Security Area showcases the hostilities between North and South Korea, and touches on the serious topic of friendship amid hatred, the movie manages to include humour as well. While the original Korean meaning was probably lost in the translation, the jokes still turned out funny. This movie is a must-watch!",
            "review_date": "2001-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Must See For Every Lover Of Magnificent Films.",
            "content": "I was lucky enough to catch this superb movie at our International Film Festival, 2001. So impressed was I, I dragged three friends to the only two other screenings, forgoing other films I had already reserved.A cinematographic masterpiece this story is touching, humorous and remindful of how little we sometimes review our friendships. Well worth the time and ticket price, the pace of this movie is slow to some but weighted and intoxicating to others.The performances by lead actors could not be bettered and their total immersion into their roles leaves you fixated and emotionally involved with their on-screen fate.I highly recommend this film, in every aspect. It is available on DVD (Finally!!) and fairly priced as well.See it, See it, SEE IT!!",
            "review_date": "2002-04-27",
            "lang": "en",
            "source": "imdb"
        }
    ]
}