{
    "rating": 0.0,
    "release_date": "2000-08-31",
    "num_reviews": 136,
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "The Best \"Con Caper\" in Years",
            "content": "This is a very well-done movie.  The writing, acting and direction are all right on target with all contributing to the story without distraction.  The direction is very evenly paced with no sags in the middle, but without the constant sensory overload that seems to be the Hollywood norm in this genre.The story reminded me of the \"The Sting\" in subject matter and quality.  The movie keeps you guessing as to who will end up with the money and how they will get to it.I highly recommend this movie.",
            "review_date": "2003-02-08"
        },
        {
            "review_title": "David Mamet, eat your heart out!",
            "content": "This film by the very talented Fabian Bielinsky, has been compared, at least in the United States, with films directed by David Mamet, who a lot consider a master in this genre. I dare anyone to take a second look at those films and compare them to 9 Queens. They all pale in comparison! In fact, Mr. Mamet can take lessons from Mr. Bielinsky in how he accomplished writing and directing with a very tight budget and still given us a film that looks a lot more expensive than what it really must have cost.Suffice it to say that 9 Queens is a joy to look at. The story of a con artist and his apprentice is executed with great flair and panache. The Buenos Aires of today looks even better as seen by Mr. Bielinsky behind his camera. The three principals, Richardo Darin, Gaston Pauls and Leticia Bredice shine in this story of deception where what we see is not necessarily what's behind the real plot of the story. Ricardo Darin, who was excellent in The Son of the Bride, outdoes himself portraying his street smart thief. Gaston Pauls is very credible behind the facade of the trusting learner of the trade that Mr Darin is willing to teach him. This film was a surprise because it is very well paced and it keeps the viewer going in one direction and presenting us an ending that is both credible and possible. Let's hope for more films from Fabian Bielinsky in the not too distant future.",
            "review_date": "2002-05-19"
        },
        {
            "review_title": "Engaging, well-paced thriller.",
            "content": "To tell you the truth, I was a little wary of this movie at the beginning, because the minor scams the characters were pulling off seemed kind of lame, but as the story progressed and the stakes got higher and higher, it became an engaging, clever, well-paced and well-acted heist thriller. It certainly has the requisite number of twists and turns to please any fan of the genre. At the end, the 114 minutes had passed like a breeze, and that's one of the sure signs of a good movie. (***)",
            "review_date": "2004-06-11"
        },
        {
            "review_title": "Sticky & Square",
            "content": "Wonderful little movie about two small time con-men, Marcos & Juan, in Buenos Aires who come upon a scheme involving \"The Nine Queens\". A set of rare stamps from the long defunct German Weimar Republic that are worth a kings ransom. We then soon get to see the ups and downs by the two in the movie to first obtain them and then fence them. Marcos' sister Anibal who works as a manager in a large hotel in Buenos Aires call her brother to help an old friend of his, Sandler, who collapsed in the lobby and to take him home.Arriving at the hotel with his friend Juan, Marcos finds old man Sandler is not only very sick but also excited about a guest staying at the hotel. Sandler also recognized Juan as the son of a person that he worked with years ago in forging money documents and stamps. Sandler tells the two con men that there's a guest in the hotel who is being deported to Venezuela within the next few days who's the multi-millionaire industrialist Vidal Gandolfo who also collect stamps for a hobby.Sandler goes on to tell the two con-men that he can counterfeit the famous \"Nine Queens\" stamps and sell them to Gandolfo and they all can split the take, which runs as high as half a million dollars. The three become involve with the scheme to first fool and then fleece Gandolfo of the money he'll be willing to pay for the stamps. What they didn't realize was just how many other persons will become involve with their plan that in the end will lead to one of the most surprising endings you'll ever see in a crime caper film. Ingenious story with a WOW ending that will keep you guessing all through the movie and won't let you down in the end. A very south, Argentina, of the border version of \"Treasure of the Sierra Madre\" film about greed and deception and what it does to people effected by it. Fine acting and direction with a top flight story makes \"The Nine Queens\" one of the best of it's kind. The movie is so good that it's really hard to write too much about it in fear of spoiling it for those who haven't seen it. All I can say is stay with it until the final credits are rolling up the screen and don't let it's slow pace for the first 45 or so minutes or so make you turn it off the movie more then makes up for it in the end.",
            "review_date": "2004-03-06"
        },
        {
            "review_title": "The mirror of deception",
            "content": "`Nueve reinas' or `Nine Queens,'a film made in Argentina on a shoestring, is one of the most elaborate and authentic grifter/con films ever made, and I don't know if I could explain it if I wanted to.  In fact to explain it would be to ruin it for anyone who hasn't already seen it, because each successive grift is a surprise, and it's only after one has seen it that one wants very much to discuss just what it is that happened all through and above all what that final sequence means.  It is the gift of `Nine Queens' to pile surprise on surprise on surprise until it seems that the grifters are the victims of their own grift at every stage of the long fascinating game.  This is not a parable about cons but a literal con.  It's the real thing.  Stories about grifters or con artists, like, say, the excellent Stephen Frears movie, `The Grifters,' (1990), or the ingenious David Mamet movie,  `The Spanish Prisoner' (1997). or Fred Schepisi's illuminating `Six Degrees of Separation' (1993), have some point to make, but the only point of a real con is that the con artist can never be trusted and his victims can always be fooled, and it's the essence of dealing with such people that you realize at some point that nothing they said was reliable, from the very first word. This is the way it is with `Nine Queens,' and that's what makes it such a classic movie and such an ultimate depiction of the world of the grifter. And so the movie becomes a kind of parable after all, because as Calderón said, Life is a dream and a dream of a dream, and as I would like to point out for those who I hope will not find it too obvious, a filmmaker is a con artist too, because he sets out to make us believe that what he depicts is real, which it is not, and that his actors are the people they portray, which they are not.  And so a con artist is a perfect role for an actor to play.Perhaps Fabián Bielinsky, the creator of `Nine Queens,' who's less famous than Mamet and Frears and Schepisi, is therefore more modest, and is therefore able to focus on the con within the con without making any point besides conning us through to the end of this ingenious story.  The actors are not famous, but like any actors worth their salt they are convincing and charismatic enough to hold our attention and make us believe that they are doing what they say they are.  The very simplicity of the production and modesty of the actors (not of their skills, which are excellent, but of their reputations, which are minor) aid in convincing us of the audience that the scenes we are watching are or could be quite real. The story begins when a younger man who has been conning the staff of a convenience store gets caught in his con, and an older man comes in successfully posing as a policeman and takes him away, thus freeing him from the clutches of the store manager and staff.  Thus two con artists, Juan, the younger man, and Marcos, the older one, meet and form an alliance, in which Marcos enlists Juan's help in a scheme he has yet to explain.At one point early on Marcos makes a phone call when Juan is out of earshot and he says only, `It's on.'  What?  Do we ever find out?  What is clear from that moment, if not before, is that no alliance between con artists is a sharing of trust.The ultimate lesson to be learned from `Nine Queens' is that no one is more gullible than a con man \u0096 that grifters, in order to con people, have to be able to believe in their own fabrications, and thereby they become potential victims of the grift. Eventually the two deceivers are led to a set of stamps of great value called `The Nine Queens,' which they set out to sell to a very rich man visiting from Spain called Gandolfo.  Gandolfo seems almost ridiculously eager to purchase these items from these fellows who have no pedigree or legitimate provenance.  But herein lies another truth, that greed \u0096 in this case the rich collector's greed to obtain a prize item by any means necessary \u0096 will lead men to take unreasonable risks.  Everyone once a con is afoot is eager to make a profit, and both con artist and victim want to believe they have found a wonder at a bargain price.It is essential to the value of the movie that we in the audience realize only at the end that the con is on us.  No story is more focused than this one.  Like a picaresque tale it moves from moment to moment: each moment is a transformation, and must be watched with riveted attention because it will change what comes next.  Such a simple and effective means of constructing a movie!  Yet how rarely are such means put to such good use!  `Nine Queens' has etched a small but permanent niche for itself in the history of cinema.This is a mean and ugly world, which at the same time is utterly fascinating and compulsively watchable.  Can people really be like this?  Indeed they can.  And the interest with which we watch it all happen shows that we are made of the same cloth.",
            "review_date": "2002-11-01"
        },
        {
            "review_title": "The Argentinean Sting",
            "content": "In Buenos Aires, the swindler Juan (Gastón Pauls) cheats the cashier of a convenience store with a bill-changing scam observed by Marcos (Ricardo Darín). Then Juan tries to lure the cashier on the next shift but he is caught by the manager. Marcos claims to be a police officer and arrests Juan; he also brings the money claiming to be evidence. Sooner Juan learns that Marcos is actually an experienced con artist and he invites Juan to be his partner in a scheme.They head to a five-star hotel where Marcos meets his estranged sister Valeria (Leticia Brédice) in the reception. She tells that Marco's friend Sandler (Oscar Nuñez ) is very ill and wants to talk to him in the locker room. Sandler explains that he had forged a sheet of the valuable stamps Nueve Reinas using a picture he took from the collection that belongs to his sister. He also tells that the Spaniard Vidal Gandolfo (Ignasi Abadal) that is lodged in the hotel is a collector of stamps and will travel on the next morning. Therefore, the stamps should be negotiated on that day. Marcos distributes percentages to a network of swindlers to work with him but there are too many con artists in action luring each other.\"Nueve Reinas\" is one of the most entertaining Argentinean film that I have ever seen and the film that introduced the great actor Ricardo Darín to the Brazilian audiences. I saw this film for the first time many years ago and today I have just seen it again with my family and friends.The story seems to be inspired in \"The Sting\" (1973) or \"The Spanish Prisoner\" (1997), with sophisticated entwined schemes where the viewer never knows who is conning whom. My vote is nine.Title (Brazil): \"Nove Rainhas\" (\"Nine Queens\")",
            "review_date": "2012-02-22"
        },
        {
            "review_title": "Fantastic Film! Don't be afraid of the subtitles!",
            "content": "I know some people out there who don't like to watch movies with subtitles. It either makes them feel that they are missing out on the essence of the film because they do not understand the language being spoken, or they simply don't want to be forced to read in order understand what's going on. For those who share that opinion, it's quite a shame because this is one fantastic film that you will be missing. Being the son of an Argentine-born parent, I more or less understand a lot of the Spanish spoken by the characters in this film, though I am in no way fluent. As you watch this film though, you almost forget that the subtitles are there. You can miss a few lines of dialog and still have a good grasp of exactly what's going on. This is due mainly to the two starring actors in the film who were absolutely incredible. First, Ricardo Darin, is nothing short of brilliant. He's a well-known actor in Argentina and has such an incredibly natural on-screen presence that you can't help but be captivated by his performance. He plays the role of a professional con-man to perfection, combining his dramatic and comedic skills to form an equally villainous as well as sympathetic character. Secondly, his counterpart Gaston Pauls is equally brilliant as Darin's baby-faced accomplice in what is to be a \"one in a million\" opportunity to swindle a wealthy businessman out of a small fortune. I've seen the American version \"Criminal\" - 2004, which is also good, but does not really do justice to the original. Nine Queens is a brilliant piece of international film-making that will not disappoint any fan of the genre. As mentioned by a reviewer, there is absolutely zero \"down time\" in this film. The dialog is crisp, the characters are very well cast and there is no time wasted with any unnecessary filler or elongated scenes. Every word and every scene builds a bridge to the next and culminates with a surprising and satisfying ending that you definitely will not be expecting. Please, don't let the language barrier prevent you from seeing this film. It's very easy to follow and well worth the small effort required. 10/10.",
            "review_date": "2007-07-05"
        },
        {
            "review_title": "Excellent, even if you don't understand Spanish.",
            "content": "I have watched this movie about four times in last two years. It is an excellent movie, very believable. More so than similar Hollywood movies in the recent years. Movie has good casting, excellent script, and very good acting. I highly recommend this movie even if you don't understand Spanish- I have enjoyed it every time, even with sub-titles. There is a Hollywood remake of this move in works, the script is golden. The story is particularly relevant, considering what has happened in Argentina over the last four years. I with the director would make more movies. I have searched for his first movie (Sonámbula, La) in US but have been unable to find it. I hope it airs on one of the premium channels.9 out of 10 stars.",
            "review_date": "2004-04-22"
        },
        {
            "review_title": "I have never seen a film as relentlessly uncompromising about the allure, power, and banality of the con game.",
            "content": "I have never seen a film as relentlessly uncompromising about the allure, power, and banality of the con game as I have seen in the Argentine `Nine Queens.' From the opening sequence where small-time grifter Juan pulls a $20 switch at a convenience store to the final scam that looks like `House of Cards' and `The Sting' welded onto `Hard Eight,' nothing is as it seems and no one can be trusted. More recently think of  `Sexy Beast,' `The Heist,' and `The Score.' However this is David Mamet territory, where buddies keep one eye on the target and the other on the buddy. In the current `Enron' environment, no surprise at the allegorical suggestion of this film that trust is a rare commodity these days, banks are vulnerable (consider the Argentinean economy), and lame goddess Nemesis may never catch up with some of business's most egregious con artists, from CEO's to salespeople. The film's pace is quick, like the hands of 3-card Monte; emotional involvement either on the screen or in the audience is minimal; everyone has a moment of triumph and defeat. Even beauty has its deceptive moment when Leticia Bredice, as the sister of other con artist Ricardo Darin, struts her stuff in the hotel lobby. `Nine Queens' won 7 awards from the Argentinean Film Critics Association. I'm betting that's not a con.",
            "review_date": "2002-07-23"
        },
        {
            "review_title": "Simple and elegant",
            "content": "Nine Queens is a simple story about two con men. Like any other story of this type, there is confusion, different characters and of course 'Money'. The story proceeds very smoothly and as it moves, there comes a point when you wonder who is a bad guy and who is good. Simple story line and good acting make it a very interesting watch. The director has obviously focused strongly on story telling and not tried any gimmicks. I found this movie during some random surfing and it was pretty fun to watch. As long as you don't have any specific expectations in mind, you will like it. There was definitely not one point during the movie that I felt bored. I would rate it 7/10 for its simplicity and elegance.",
            "review_date": "2009-09-03"
        },
        {
            "review_title": "The jack-in-the-box ending rivals The Usual Suspects.",
            "content": "Seen The Sting? Treasure of Sierra Madre? Catch Me if You Can? You probably have come to expect that most characters are lying in the con-artist film. Thankfully there is always some innocent involved who reminds us that the world isn't completely cynical. In Nine Queens, however, the atmosphere of deceit is so complete that everyone is either running a scam, or expecting one.This Argentinian film will never be featured to promote tourism in Buenos Aires. An artificial economic bubble full of overvalued pesos in Argentinia means hard financial times. Hard times breeds desperation and cunning. The Buenos Aires of Nine Queens is teeming with thieves among whom there is no honour. This film will appeal to the cynic in all of us. Sometimes the safest approach to people is to expect the worst from them.Ricardo Darin's performance as 'Marcos' is as perfect and intricate as the swiss made time-pieces he probably swipes. Watch with morbid fascination as he gives up little parts of his soul until there is nothing left.The jack-in-the-box ending rivals The Usual Suspects.",
            "review_date": "2010-03-21"
        },
        {
            "review_title": "Fantastic",
            "content": "This is a great film, one of the best non-American movie that I've seen. It has everything that you can expect from this kind of movies, action, suspense, and humor. You can see it 9 times and never get tired of it, it's so well performed and directed that it's just perfect.From the beginning to the end this picture keeps you alert, there are no boring moments, even if you don't speak Spanish the dialogues can be understood, the English subtitles are OK . I'm sure that if it was an American film it would have become a classic. If you haven't seen it yet ,do yourself a favour and rent it, you won't regret.10 out of 10 stars.",
            "review_date": "2005-01-18"
        },
        {
            "review_title": "Two con men partner up for a big swindle",
            "content": "Nine Queens is a fantastic film out of Argentina, with a screenplay by Fabián Bielinsky, who also directs.The story concerns two men, Marcos and Juan, both low-level con men, who become partners in order to pull off a once in a lifetime swindle. They hope to sell The Nine Queens, extremely rare stamps, to a wealthy collector. The stamps are forgeries done by a very ill friend of Marcos, and if they are able to complete the transaction as the collector is about to leave town, he will not have time to go to a laboratory and discover the stamps are fake. The fakes are good enough to pass any other muster.This is a marvelous film, made with a modest budget, that is entertaining, imaginative, and very clever. It's along the lines of House of Games and The Spanish Prisoner, both written by David Mamet, who seems to have cornered the market on this kind of plot. The story here is more straightforward, more streetwise, and grittier than anything of Mamet's. Also, as good as Mamet's work in this area is, there's always a little staginess that makes one wary of a setup. There's none of that here.Highly recommended - you won't mind the subtitles.",
            "review_date": "2013-12-17"
        },
        {
            "review_title": "No shortage of plot twists...",
            "content": "This is a pretty good movie about con artists possibly inspired by David Mamet films like The Spanish Prisoner. The plot twists never fall short. The cast is pretty decent.I would rate this a 7 and not an 8-9 for two reasons. I felt that the script should have been peppered with more humor. I can understand that it could not be very stylish ala The Sting due to the low budget, but at least it could have provided a few more laughs. Also, the ending (last 2 minutes) was a little \"Hollywood\". I don't mean that there should have been a different ending - just that it could have been more subtle instead of trying to force the punch-line down the audiences throat.",
            "review_date": "2006-04-18"
        },
        {
            "review_title": "Honour Among Thieves",
            "content": "A slickly directed tale about a pair of confidence tricksters at large in Buenos Aires on the eve of the financial crash of 2001; when it was awash with money (much of it dubiously acquired and easily lost) but also rife with low level criminality, as is lovingly depicted here.In his feature film debut, the late writer-director Fabián Bielinsky (who only lived to make one more feature film after hitting the ground flying with this) gets superb performances from all of his cast, and the most suspenseful aspect of his labyrinthine script predictably full of surprises (that synthesises many classic McGuffins of the past but probably most recalls David Mamet's 'House of Cards') is just who's scheming against who and who will ultimately end up with the spoils.",
            "review_date": "2019-06-07"
        },
        {
            "review_title": "Go on...watch it!",
            "content": "There are a few movies that have the premise found in this movie and that is the old 'sting' or the 'con'. 'The Sting' with Paul Newman did spring to mind at certain scenes whilst watching this but, to be honest, this film is very original and has something all of it's own. Very well acted by the main actors as well as the rest of the cast, the plot was superb, seemingly predictable at first, there was a moment when during the film you suddenly realised that you didn't have a clue who was conning who and what exactly was REALLY going on?!Very well written and as some have said here already, the twist is wonderful and surprising, by then I had suspected every possible scenario as the reality but failed to get it right!Recommended watching. There is a reason this film is included in the book '1001 Movies You must see before you Die'.",
            "review_date": "2012-10-06"
        },
        {
            "review_title": "A bit like an Argentinian version of \"The Sting\"",
            "content": "When the film begins, Marcos observes a young grifter, Juan, in action. The older and more experienced con-man likes the younger guy's style and offers to teach him the trade. Through much of the day that follows, the pair do a variety of relatively low value cons--nickle and diming unsuspecting folks here and there. However, later in the day Marcos gets word from his sister that there is a dying many asking to see him at her hotel. When Marcos (with Juan in tow) arrives, you can tell that she hates Marcos--and has had lots of reason over the years to feel this way. Regardless, Marcos and Juan visit the sickly man and learn that he's also a con-man-- and was prepared to make a bit killing by selling a nasty mobster some stamps nicknamed 'the 9 queens'. But because the guy is so sick, he wants Marcos to pull off the con--selling the mobster some forged stamps for a fortune. What's next? A lot, believe me...but I don't want to spoil the surprise.This is an excellent swindle and sting sort of picture. It's not as good or stylish as \"The Sting\", though it is very well made--with some nice acting and a finale that really pays off well. I'd say more but I don't want to ruin the surprises...and there are plenty.",
            "review_date": "2015-03-29"
        },
        {
            "review_title": "Scams and con artists in modern day Buenos Aires",
            "content": "This is one of the best whodunit's in years! The acting is great, and cleverly staged. Each individual adds more and more complexity to the storyline such that you can't discount whether or not they're crucial to the plot. The plot unweaves slowly, but evenly, adding layer on layer of innuendo, suggestion, twists, and turns that catch you off guard. No one character, or actor for that matter, overtakes any of the others. I don't think you'll get this consistency, unless Mamet directs. The downtown realism of Buenos Aires only adds to the story. It's not a shoot location we're used to seeing, and the novel setting creates an odd contrast to what we've seen come out of modern Europe. The action is well-paced, with a steady guessing, and wondering-what's-gonna-happen-next pace. I highly recommend seeing this movie before, and if, a US version is released.",
            "review_date": "2006-04-13"
        },
        {
            "review_title": "The longest con",
            "content": "The central idea of the classic con-trick movie, exemplified by 'The Sting' and perfected by David Mamet, is that there's always a bigger con; and the director usually tries conning the audience as well, convincing us we have finally understood what's going while retaining a trick up his sleeve. In fact, there have been so many such movies that at first 'Nine Queens', Fabien Bielinsky's effort in this genre, feels uncomfortable to watch, as it seems likely we are going to get a fairly standard assembly of trick-upon-trick: more than once it explicitly acknowledges Mamet's 'House of Games'. But the film soon starts to redeem itself, when it becomes clear that the characters are also aware of the long con, and are all mutually suspicious of each other's intentions; the question is, who is playing the biggest trick? The real reason this works, with a plot arguably less intricate than Mamet's finest, is the great performances from the lead actors, Ricardo Darin, and Gaston Pauls; the two mean they play are very different, and Darin's character is logically (although not in fact) unlikeable; together, they give the movie an odd-couple charm, which spreads far enough that, after spending the whole film looking for the final trap, the audience is nonetheless distracted and fails to spot it in advance. At least, in my case, I foresaw everything other than the most important detail; which is the sign of a con-trick film that got it right. The death of Bielinsky, whose second (and final) film ('El Aura', starring Darin in a very different role) was also superb, was a sad loss for cinema.",
            "review_date": "2009-02-02"
        },
        {
            "review_title": "twisted spin-off of Mamet's \"House of Games (1987)\"",
            "content": "I'm surprised no other has seen nine queens is actually a spin-off, or, better, a parody of \"House of Games\". The analysis of the differences between the two movies is a very interesting subject i submit to all imdb addicts and con-movies experts. I have to admit that, following Mamet's plot, i fell in bielinsky's trap exactly as i suspect he expected me to.",
            "review_date": "2002-08-23"
        },
        {
            "review_title": "Watch this instead of the Remake",
            "content": "I haven't seen the Remake yet (I think, if I have it must really be dreadful), but either way I suggest you stay with this as your initial and maybe only choice. This movie is a little gem, unfortunately unknown to many people. It has a terrific script to start with, that will leave you wondering and guessing what will happen next. The twists and turns it takes are all believable in the realm the movie takes place and make it even more exciting.One of the main actors is starring in the current Oscar winner for best foreign movie. But he has a great partner to play off with. But as I said before, the script is the main star, with great dialog and a story worthy to see. There is so much tension and so many things happening, you will enjoy this. Just don't think about it as real life. This is a movie and of course a few things that happen there, could not really happen or that too many things are coincidences. This would spoil the fun you could have with this movie!",
            "review_date": "2010-09-15"
        },
        {
            "review_title": "Brilliant Movie",
            "content": "I saw this movie in an open air film festival on the Dutch Island Terschelling. Sometimes you visit a movie without exp actions, even after reading a summary you don't expect a lot. Buy hey you are on holiday, it's a beautiful summer night so what does it matter. So with low expectations, laying down on the ground in the sand in a not so comfortable position, i was really surprised by the fantastic twists in this Argentinian movie who gave me a trip on a very surprising roller-coaster. Only after the movie, when I stood up, i felt that i had been laying down very uncomfortable in the sand and had problems getting up. Sometimes a movie is so energetic and thrilling that you forget everything around you. A great movie, 10 on 10",
            "review_date": "2008-01-05"
        },
        {
            "review_title": "Nine Queens for only one...",
            "content": "\"Nine Queens\" is a movie in which we watch two con artists try to make a deal with a stamp collector by selling him a sheet of counterfeit rare stamps. Also in their try to make this deal happen they have to give many things in order to get what they want, so we watch them fight with their selves to succeed this.I really liked this movie because of the plot which I believe it was great and in some moments I could not know what to believe or better who to believe. In addition to this I have to say that the direction of Fabian Bielinsky was really good and this is something that we can understand in the whole duration of the film. About the interpretations of this movie I have to mention the very good interpretation of Ricardo Darín who was for one more time outstanding in his role and the interpretations of Gastón Pauls and Leticia Brédice who were equally good.Lastly I want to say that \"Nine Queens\" is a really different movie than the other Crime - Thriller movies because it combines very good the plot which is perfectly written with the cast. Also I have to say that this movie remind me the movie \"The Game\" with Michael Douglas which I believe has many common things and one of those is that you can not expect anything and you can not believe anyone.",
            "review_date": "2015-01-27"
        },
        {
            "review_title": "Grifter genre",
            "content": "What I find interesting about this movie is that it gives you no easy way out. The ending shows an ambiguity not usually present in the genre, at least if you compare it to the US versions of this genre. If you compare it with Matchstick Man or The Grifters, and the sanitized Hollywood versions, The sting: all of them seem to take a clear moral view of the characters, one way or another. I can't quite remember House of Games, but I do believe in all of them we are in a world apart and individuals make a choice between a \"moral\" way of living and one in which the \"con game\" rules. I don't think this is the case for Nueve Reinas, the ending does not give you a clear guideline for judging the characters, you have to make your own interpretation. On the one hand Marcos is not at all likable and becomes the fooler fooled. But Juan, who we are happy to learn, fools him, I'm not sure is any less of a fooler, just a more \"natural talent.\" That ambiguity in the ending I don't think is completely apparent to all. The fact that Juan gives his, in the end we find out, girl-friend the ring he stole with Marcos, from an old lady and a ring that was a family memento ... a minor detail maybe, but a cruel act typical of the \"con\" artist who takes advantaged of an old lady's solitude (not a pretty picture). And are we sure that he does this for his dad, or is that just a \"con\" the picture create ... and is the girl friend just out to swindle the brother. In the end Juan, the guy with the honest face, has learned all to well how to \"survive\", and I wonder if in the end that is not what we are looking at in this movie. The ending does not give you all the answers, and maybe that is what makes this such an interesting movie and one that can be seen more than once",
            "review_date": "2005-01-13"
        },
        {
            "review_title": "Perfect",
            "content": "Literally a perfectly realized movie. The premise is excellent, about both a rookie and a veteran con artists that get to know each other and they quickly end up having a huge opportunity to sell some fake stamps to a rich Spaniard. But they have to hurry up because he's leaving the country in hours.The great introduction of the two main characters in the first act, the natural flow of the story, the increasing tension, the attention to details that pay off really well in the end. Everything is so well done. Ricardo Darín is a great actor, but in this role, at that time, he was all-time great level. Gastón Pauls is a good second banana. The rest of the cast is excellent. And the humor (not a small part) scattered through the film is not just to spare us from tension or dark scenes, but the result of logical humorous reactions to the crazy situations the characters were living through, and always respecting the characters personalities.",
            "review_date": "2020-01-10"
        },
        {
            "review_title": "Enough twists to keep even the most veteran of movie watchers guessing.",
            "content": "****SPOILERS ALERT****Take one part David Fincher's 'The Game', one part George Roy Hill's 'The Sting' and one part David Mamet 'House of Games', add some foreign cinema flare and you have the recipe for the very entertaining Nine Queens (Nueve reinas).  Nine Queens is written and directed by Fabian Bielinsky and stars Gastón Pauls as Juan, a small time crook who meets veteran crook Marcos, played brilliantly by Ricardo Darín, when trying to scam a gas station attendant out of change for a small purchase.  When Marcos pretends to be a police officer and takes Juan out of the station with the money in hand, a friendship is then created as the two scam artists put their own unique skills towards larger fare.  Juan seems naive and skeptical at first under the guidance of the veteran Marcos, but soon, both are running the streets of Argentina scamming everyone from old ladies out of money for a nephew that never visits, to restaurant waiters who are duped out of change for money that was never received.  The main story surrounds a scam about priceless flawed stamps known as the 'Nine Queens' that the two try and sell to a collector.  Many obstacles are put in the characters way en route to the score, and these situations keep the story moving at a lightening pace.  As time goes on, Juan develops as a character with a conscious who does not feel at ease in the targets picked by his counterpart.  Meanwhile, Marcos develops into a dark, mean character who even double crosses his old partners and even pimps his own sister for the purpose of a big score. Surprisingly, as repulsive as this action may imply, we never dislike any of the characters in the film, and thus we are thrown into a story where trying to determine who indeed is the mastermind behind the scams is always in doubt.  Maybe the most surprising is how easy the scams are for the two partners. In a world everyone seems to be working on a scam yet no one claims not to be a crook, we see two characters pulling small heists on the average community with an ease and confidence that could easily represent our very own lives or experiences.  There are many subplots in Nine Queens.  There are actually so many subplots that you may get lost if your attention is diverted.  A dispute within Marcos' family regarding an inheritance, Juan's father in jail needing $70,000, and old partners once scammed by Marcos coming back to assist in the overall heist.  However, each subplot comes full cirlce and each player shows their true colors by the closing credits.Beautifully photographed, the film takes the viewer on a rollercoaster ride where no one can be trusted and everything is a means to the eventual end. It was the directing debut of Fabian Bielinsky and he handles the pace with incredible percision and a flare for what is known as Mametisms. \nKudos to all those involved with Nine Queens.  American film makers could take a page from this film.",
            "review_date": "2003-01-19"
        },
        {
            "review_title": "It was only the beginning...",
            "content": "Soon after the release of this movie, the Argentinian banking-system completely fell apart.  Fabiàn Bielinsky, the director and the script-writer, delivers us a psychological insight into the birth of corruption and its bitter fruits so you see what happens if a nation cannot stand against its criminals, who claim that they are not...crooks. Everybody is sheeting everybody in this movie but nobody accepts to be identified as a criminal.  Bielinsky started as a first-assistant director of documentaries as \"Republica perdida (1985)\" about the Argentinian dictatorship or a Science-Fiction movie as \"La Sonambula (1998)\"; he then used an actor Gaston Pauls (Juan) who is the key-figure as an experienced crook in this movie. The movie keeps its surprising rhythm until just before the end. The very end of the story is somewhat strange and has not the label \"top-quality\"  of the start and of the development.  After all, this movie proofs that a good thriller can be written and executed by an experienced cinematograph if the intention to catch the audience by an intelligent plot is held continuously.  Some sub-plots are difficult to understand but they do never brake the rapidity of the social exchanges, dialogues, interventions (f.i.: the father of Marco (Ricardo Darin) in prison). Remains the question: why is everybody trying to swindle everybody in Buenos Aires?",
            "review_date": "2003-01-31"
        },
        {
            "review_title": "Fun movie, Could have been slightly more convoluted!",
            "content": "This movie keeps throwing twists your way repeatedly. But the problem is, people who have seen too many of these 'heist/con' movies might guess each curve ball (including the ending) some time before it comes along, so the effect of the 'aha!' moment is slightly reduced. Be that as it may, the plot is smart enough to at least force us to be alert if we want to stay ahead of it. The entire movie becomes a game of whack-a-mole, where you see a twist coming up in some time, think you have a grasp of the plot in its entirety, only to notice small signals of another one coming right ahead. All the characters were really well played (especially Marcos(Ricardo Darin)), which is rare for a movie of this genre. On the whole this is a fun movie with a taut script.",
            "review_date": "2013-04-30"
        },
        {
            "review_title": "Fast-paced and well cast",
            "content": "Caper/revenge movies like \"The Sting\" and \"Ocean's Eleven\" usually fill you in on the characters and their roles at the beginning and then you see how the whole scam plays out. \"Nine Queens\" follows the opposite route, not letting you know who is in on what, or what anyone's real motive is. It is fast paced and well-cast, although some of the English translations for Spanish swear words and vulgarities are quite original. And the film's trailer calls the female lead \"a beauty\" which is an exaggeration, to say the least.",
            "review_date": "2018-10-12"
        },
        {
            "review_title": "Nine Stars for Nine Queens - Another Argentinian Gem",
            "content": "If you ever need a reminder that you can make a class A film on a shoe-string budget, rent Nueve Reinas (Nine Queens), a marvelous, gripping, and often very funny drama about the culture of con-men and those whom they con. I'm not sure what the budget of this film was, and I'm sure the very professional and excellent actors and crew were well-paid, but my point is that the story-line and direction are what make this film, and the actors are so well-cast that it all comes off without a hitch. Unlike some con-movies, the whole thing is believable and I had a hard time finding holes in the plausibility post-facto. Leticia Bredice, who played a vulnerable, sexpot-victim in _Cenizas del Paraiso_, plays *quite* an impressively different character here. Ricardo Darin and Gaston Pauls are fascinating and marvelous. I'll let you decide for yourselves whether there's any transcendent message in this film, but even without, it's some serious fun.",
            "review_date": "2008-07-18"
        },
        {
            "review_title": "Great Bielinsky work.",
            "content": "This is another movie that shows the resurrection of Argentina film industry. Is clearly one of the best Argentina movies in the past years. Its very interest how the director shows Buenos Aires, not only in a decadent way as much of our films does (which is not a critic to them), and over everything, it´s original comparing to the what we have seen recently. Fabian Bielinsky has a different and interesting style of filming.Ricardo Darin is excellent, the best of the film. Gaston Pauls made an interesting portrait of its character, and the secondary cast made the plot run smooth. A great story with a surprising ending (it reminds me of the \"Usual suspects\" one). Although this movie seems to have a lot of US independant filmography characteristics, it has an obvious Argentinian touch that make it a top movie.I don´t agree with TomyGrau opinion. I think that Argentina cinematography is excellent, for an obvious reason, when you have a low budget to make a movie (with few efforts from the state, not knowing if it will be released in theatres, or will ever see the money invested again) you have to make something different and original to succed. They do not copy classics.\nLots of Argentina movies were original and they succed. Examples in the last 5 years, \"Pizza Birra Faso\", \"Mundo Grua\" or \"9 Reinas\", None of them have a message. They just tell a story or are a description of our reality. There are very few Tango-like examples around by now.Best 2000 Argentina movie with \"Felicidades\" & \"76-89-03\".Rate this movie with a 7.5 out of 10.",
            "review_date": "2002-01-19"
        },
        {
            "review_title": "Superbly plotted twister",
            "content": "This film is done in the style of David Mamet's Spanish Prisoner or House of Games.I think it is better than either of those films.The plot is carefully crafted, with lots of twists and turns.When you get to the end, you realize that everything that happened up to that point had a significance.There is not a single detail that doesn't make sense (in retrospect).The acting is understated and that makes it even more believable. It is as innocent as the characters in Fargo before they became recognizable film stars.",
            "review_date": "2007-01-19"
        },
        {
            "review_title": "Licked",
            "content": "Spoilers herein.Some genres are extremely rigid, that rigidity being their very reason to exist. The main branch that concerns us here is the mystery. That's where the viewer/reader and the narrator/writer are made equal and are pitted against each other. It is a mental contest to see who clarifies the story first, and is a contest with very specific rules.Film is more visceral than the written word but less engaging in terms of the imagination, and many viewers don't like to work. So an offshoot of the mystery is the con film. In this case, we expect the film to surprise us. The rules are less rigid: it has to make sense at the end, but we don't need explicit clues. We do expect a narrative upset at the end. In the best of these, we are drawn into a story that we invest in -- the more sense it makes, the greater the upset.This scam is a larger twist than normal, but is is really easy to anticipate because of how the story unfolds. The setup is so elaborate, and the characters so cartoonishly extreme that we know from the first scene who the real artist is. Otherwise, there wouldn't be a film.Part of the game in the con setup is the language along the way. Its a trick of Shakespeare's that Mamet has embraced. The more engaging the language and related metaphors, the more investment we have in what is overturned. It is the only reason Mamet uses the form I believe -- it is the best way to leverage his skill. The language here could be particularly spellbinding in Spanish, but certainly not in the English subtitles.The title (and hence the maguffen) derives from a basic card scam, not explained here.Near the beginning is some masterful editing, showing a deep fabric of crookedness when the same is described.Ted's Evaluation -- 2 of 4: Has some interesting elements.",
            "review_date": "2002-12-23"
        },
        {
            "review_title": "excellent - excelente",
            "content": "Great movie - the only flaw? it should have ended after the bank closes...THAT REALLY happened in Argentina (and it was AFTER the movie was released!) everybody's assests in the banks were FROZEN and exchanged for bonds, that value NOTHING.It should have just ended there to clearly show that the government is the biggest con artist, the worst thief of them all!great movie, you can get a feeling (in a fun way) of living in Buenos Aires sometimes...  I was mugged on the bus so many times... but we still love that city....---------",
            "review_date": "2003-04-12"
        },
        {
            "review_title": "Nifty and sharp little Argentinian crime thriller looking at petty street cons and large scale heists.",
            "content": "Nine Queens is a tricky little film, a film so in love with the notion of tricks and heists and cons that it revolves most of its first hour or so around extended shots of two people walking, talking and engaging in heists and cons. Before you know it, you're being set up for the much bigger picture – which is one massive theft of some stamps that evolves into a con itself. Yes, it's complicated but its the nature of the game and of the life the people within the film live. Nine Queens lures you in, like a con artist would. It lures you in and dares you to try and keep up with these rather shady but relatively smart and good-looking leads as they talk the talk and walk the walk in and about their chosen lifestyle. You don't want to fall behind and you don't want to feel as if you're being conned in the process.Such is the manner of Nine Queens, a film I sought out after watching director Fabián Bielinsky's quite excellent 2005, but unreleased in Britain, film entitled 'The Aura' which itself was a heist film of sorts but incorporated many other aspects of a theoretical and film-making nature. Nine Queens carries a distinct style and its twisting, intriguing narrative keeps on bending and twirling whilst providing necessary substance. This is more about introducing characters as archetype thieves to the degree the writer/director deems fit and then allowing the film's plot, twists 'n' all, to just take over and force the fleshing out to occur if and when necessary.The thinking required for the film is kicked off in the opening scene. Juan (Pauls), a young and 'upcoming' con artist, tries to covertly rob an all night store in the same cheeky manner he has already done. The staff notice and he's in trouble but for Ricardo Darín's character Marcos, who poses as a police man and escorts poor Juan to safety. Juan realises that Marcos isn't a cop once they're out and gone and they exchange words. Turns out Marcos is a con artist as well and they banter. But did Juan get caught on purpose or is he just an inexperienced kid? Did Marcos step in because he needs a fall guy, or because he pitied the man? Who's acting? Who isn't? Who's playing who and who knows more than the other? The mind games in the exchanges have only just begun.Initially, I think the film is so bold as to actually play out in real time. The scenes of Juan and Marcos scouring the streets in search of potential cons, as Marcos adopts the teacher role in showing pupil Juan the tricks of the trade, are fascinating. Initially, the symbolism of each other's respective 'role' lies in their clothes. Juan's casual, young and therefore inexperienced 'role' is suggested through his casual jacket and jeans but is it just acting as a distraction? On the other hand, Marcos' suit and very formal get up suggests the term 'organised criminal', someone who takes pride in their dress sense and (albeit illegal) work. Someone rich with experience and with a certain guile – it suggests Marcos is perhaps smarter.But is Bielinsky leading us down a path with this visual representation and pretty basic student/pupil set up? The bolt from the blue is the bombshell Marcos drops on Juan to do with the thieving of some priceless stamps, from whence the title of the film is born, due to be passed onto a Spanish buyer in the next few days. This is further developed when it is revealed Marcos' sister, Valeria (Brédice), works at the hotel the deal is supposed to occur in and doubles up as someone Juan seems to have his eye on from the beginning. Again, what does it all mean? Who knows more than the other? What's the con that's going on? With Juan needing a certain amount of money to aid in his arrested father's pledge for freedom, a sum close to half a million all of a sudden looks like quite a payday.But the film is more than a few cheery scenes of inventive cons and tricks. The film pauses for its characters to question themselves, raising issues of identity within this criminal circuit. While it doesn't glamorise theft or criminal activity, Marcos tells Juan of the misconception behind what it is they do. There is a consistent referring to how crooks are different to thieves, something that walks along the lines of theft and masterminding a con being an art-form in which it takes a certain amount of skill and acting in pulling off that sort of robbery. I believe this to be comparable to a 'crook' mentality, in which charging in with guns blazing and getting away with money whilst leaving a room of corpses is the alternative. Marcos argues that being a thief is not the same as being a crook and that there are other terms for thieves whereas a criminal is just a criminal.As the narrative draws to a close and certain revelations took place, I was amazed at how my own emotions had been twisted and manipulated. What at first seemed like bizarre coincidences or acts of basic stupidity perhaps propelled by a bad script were, in fact, planned actions designed to lull both us and certain characters in. There is a punch to Nine Queens, a gritty realism and a definite 'look' delivered on top of a neat little narrative that I think works really well. It even inspired the Americans to remake it in 2004.",
            "review_date": "2009-04-03"
        },
        {
            "review_title": "Nine Queens:An excellent thriller from Argentina which has been shamelessly copied by other incompetent cinemas.",
            "content": "An intelligent thriller film is one which not only has ample elements of thrill but also has enough material to keep viewers glued to the edge of their seats. Nine Queens, a fast paced thriller by Argentinian director Fabián Bielinsky tackles the enviable theme of con men running after stamps having considerable monetary worth. Although it is not a new theme in the history of cinema as Polish author Kieslowski's Decalogue 10 was also about two brothers losing a valuable stamp, Nine Queens does make a mark as a different film as it is literally a training manual for crooks who would like to con gullible people. It is true that the film's main theme is revealed quite late, numerous con tricks by Nine Queens' main protagonists' facilitate the building of excitement in viewers' minds. This helps in the creation of enormous excitement for leading men Ricardo Darín and Gastón Pauls as they execute their plan without getting conned. The beauty of this film lies in its simplicity as despite a fair amount of crooks with guns not a single shot is fired. This would serve as a indispensable lesson for those directors who would like to bathe their films in human blood.",
            "review_date": "2013-07-21"
        },
        {
            "review_title": "Whalloping Ride of a Twisty Caper Film",
            "content": "\"Nine Queens (Nueve Reinas)\" is a walloping ride of a twisty caper film. I hope when the inevitable American re-make comes they get the right tone of more like \"Usual Suspects\" than \"The Sting\" though there's plenty of laugh out loud humor amidst \"The Heist\"-like treacheries.Writer/director Fabian Belinsky makes a terrific debut with a wonderful cast, including crafty Ricardo Darin (though sporting a more annoying haircut than in \"Son of the Bride (El Hijo de la Novia)\"), innocent-faced Gaston Pauls, and vixen Leticia Bredize.I didn't quite follow all the twists and Milo Minderbinder deals (though I appreciated the tribute to \"Charade\"), and the re-make will have to Americanize one financial twist unique to Argentina, but that can be easily Wall Street-ized. Doubtless Americans will find a way to add violence, though this is about cleverness.The twists though are not helped by the annoying subtitles that show both parts of a dialog all too quickly at once. Hey distributor, we can read fast enough to show the lines as they're spoken. (originally written 5/5/2002)",
            "review_date": "2005-11-29"
        },
        {
            "review_title": "first no, second no, third yes",
            "content": "this movie is excellent, though I noticed it only after 30 minutes.a week ago, I saw the first 25 minutes of it. I was thinking all the time 'what junk is this? why am I wasting my life with it?' so I turned it off.two days ago, I watched 5 minutes more of it. I was really certain it was not the kind of movie I like.but I'm an obsessive movie freak. I want to see every movie there ever was and ever will be. I hope that when I'm dead, I still will be able to watch the movies to come after my death.that's why I watched the rest of the movie yesterday. wow, I was wrong! this movie is so great! so terribly good! the acting performances are fantastic (with a shocking ending well done), the storyline is well worked out, the music is at it's place, the sounds are promising, ...if you want to see a good foreign movie, don't hesitate to watch this one.",
            "review_date": "2009-04-07"
        },
        {
            "review_title": "My comments, and everybody else's, are rife with spoilers",
            "content": "A gem. I have only one complaint: that Fabián Bielinsky chose to shoot it in colour rather than black-and-white, in which it would look much better. Bielinsky DOES nothing with the colours, and rightly so; this doesn't hurt the film, and may well help it - but no colour at all was clearly the way to go; the material begs for such treatment.It's one of those films where it's all in the script (apart from the three understated but exactly right central performances by Gastón Pauls, Ricardo Darín and Leticia Brédice), and the script is crafted with meticulous care. The twists and surprises are all of the delightful kind that make more, not less sense of the preceding material (all of the night I saw the film, and most of the next morning, I was recalling details and saying \"Ah! of course\"), and so they're fun to be sprung by even if they don't surprise us (although only one of them failed to surprise me). If Bielinsky had simply ended...And remember, I warned you about spoilers...If Bielinsky had simply ended with the shot of Juan walking away from Marcos as the latter wore a look of utter dismay and exhaustion on seeing the bank crash, that would have been a brilliant ending - one of the best. Yet he kept the camera running and found a better one. BOTH endings, considered all by themselves, will bear examination afterwards. How's that for a coup?We're told, and what's more we SENSE, that the streets are full of people all attempting to extract they all need out of one another, living by the motto \"Do others, for they would do you\", and that this desperate NEED to swindle pervades the entire society (which is why the bank crash was such a perfect touch, and incidentally, the only thing I actually saw coming). It may be no accident that the film was made in Argentina, a country that has been swindled on a grand scale by the World Bank, a country that has been forced into an economic system based on the art of swindling which more powerful countries are at least free to abandon if they choose. Don't get me wrong: this would be a good movie even if it WEREN'T a perfect metaphor for its time; that it is a perfect metaphor is just icing on the cake.",
            "review_date": "2002-10-04"
        },
        {
            "review_title": "Nine Queens - Fast-Paced and Full of Twists and Turns",
            "content": "Nine Queens follows the activities of two Argentine street-hustlers who team-up as partners for a day. Juan is a young man whose good looks and innocent appearance give him an advantage over the women that he cheats. He was taught some tricks of the trade by his father who is now in prison awaiting trial and regrets teaching his son how to steal. Marcos, the older of the two men, attempts to open Juan's eyes to the scams that are going on everywhere around them in the streets of Buenos Aires, where every thief claims not to be a thief. He sees Juan as being naive because the younger man expresses some sympathy for his victims and puts limits on what he will take from them. Marcos has no such remorse. He thinks of having a conscience as ridiculous and a hindrance to his trade.The action suddenly becomes more intense when a former partner of Marcos introduces the pair to the scam of a lifetime. The man has counterfeited a sheet of nine rare stamps, worth hundreds of thousands if genuine. He plans to sell the stamps each of which display the image of a woman in profile, the nine queens, to a billionaire stamp collector. Unable to carry out the sale himself, the forger enlists Marcos' help in selling the stamps. Things quickly devolve into a series of struggles over who will get what percentage of the take as everyone who becomes involved uses their skills to overcome the obstacles to the sale, leaving the viewer uncertain about who is the hustler and who is being hustled.The story is fast-paced and well-acted. Dialogue is in Spanish with English and French subtitles.",
            "review_date": "2014-07-15"
        },
        {
            "review_title": "Slippin' Juan",
            "content": "This fascinatingly layered Argentinian con/caper film is never quite as far ahead of you as it could be, but still has you spiralling down guesswork rabbitholes right until the final scene. It can be a little dry but bolstered by some grand performances, sharp set pieces and I think some sincere social commentary - it's certainly worth a watch. There's also a melancholy behind the joyful credits when you discover the director died very suddenly and quite young - bravely turning down the opportunity to remake the film for American audiences. It now sits in a pantheon of well-loved Argentinian films that were recommended enthusiastically to me by someone from the country. It's the charismatic Ricardo Darín that serves as the throughline, and often the emotional anchor of all of these films and here as the morally grey Marcos, he's especially good.",
            "review_date": "2022-09-01"
        },
        {
            "review_title": "100% Reliable...",
            "content": "9 Reinas is one of the most successful Argentinian movies ever, a movie about small time thieves, about swindlers, about the wonderful techniques they all use in order to get a couple of bucks. With the rhythm of Mamet's \"House Of Games\" and the ironic/sarcastic sense of humor of Berlanga. Ricardo Darín's superb performance got him to Spanish's halls of fame (indeed after the success of 9 Reinas, they showed in the Spanish's cinemas some of his previous works, such as \"El Mismo Amor, La Misma Lluvia\"). A great script perfectly cobbled together so you may get to the ending with a big \"no shhhh...!!!\" look on your face. Fun, traps, intelligent dialogs...100% Recommended.*My rate: 8/10",
            "review_date": "2005-08-21"
        },
        {
            "review_title": "Marvelous",
            "content": "Rarely do script, cast and director gel so effectively. Fabián Bielinsky fashions a slick, fast-paced, cerebral con flick that keeps you guessing till the last minute. Nine Queens requires double the allotted running time to view, because as soon as it is over you will want to watch it again.Gastón Pauls is the hangdog scam artist Juan, a small-timer with the vestiges of a conscience that can only hamper his career as a grifter. When a play goes wrong he is rescued by the more experienced Marcos, played by Ricardo Darín. They team up for the day, quickly forming a mentor/mentee relationship. Things escalate when the Nine Queens, a rare set of defective stamps from the Weimar Republic, falls into their hands.Nine Queens demands that you pay attention and leaves you asking questions afterwards. As soon as the credits roll, you will find yourself playing the movie back in your head. There is not a wasted moment in this film, a masterclass in economy and pace. The documentary touch in the direction, hand-held and close-ups predominating, adds to the grit. It is tense throughout, but when Marcos' sister Valeria (Leticia Brédice) is introduced, there are moments where you dare not breathe.Wonderfully observed, superbly executed, Nine Queens sustains and entertains from start to finish.",
            "review_date": "2009-02-15"
        },
        {
            "review_title": "A Day in the Life of Two Con Artists",
            "content": "This enjoyable movie has been hyped to a level it doesn't deserve.  In an Argentine city where many of the locations are identical to those familiar to Americans and Europeans (a mini-mart at a gas station, an upscale hotel, a subway complete with a deaf panhandler, etc.) two con artists adventitiously meet and embark on an increasingly complicated but not complex scam.  If the viewer hopes for a slice of non-touristy Argentina, forget it.From beating out old ladies of money they can ill afford to lose to trying to outwit shrewder prey, the two petty crooks face challenges and obstacles. Nice guys?  Not these two.  With elements of both the caper and buddy-bonding genres, \"Nine Queens,\" the title referring to a supposedly rare set of stamps the crooks want to peddle, the film moves along in starts and jolts while remaining consistently entertaining.Don't look for depth here.  The reviewer who likened this film to the movies of Hemingway and Mamet was way off.It isn't hard to figure out, early in the film, who the screwers and the screwees are. But it is fun to watch the plot unfold.Worth renting when it becomes available - which will be soon.",
            "review_date": "2002-05-12"
        },
        {
            "review_title": "Great movie",
            "content": "Great movie. Another good performance from Ricardo Darín. Gastón Pauls did well too. Started a rough day and managed to get worse, and worse. Each turn grabbed me and made me feel for them. But in an entertaining way, with enough bitterness to think deeper about human nature. Just the right amount. Some parts reminded me of Sting and Dirty Rotten Scandals.",
            "review_date": "2021-10-25"
        },
        {
            "review_title": "Other Argentinian movie titles besides \"Nueve reinas\"",
            "content": "As an Argentinian living in Spain (and before in the United States for many years), it deeply saddens me to read so many good reviews for \"Nine Queens\" and at the same time see how profoundly unknown to the rest of the world viewers is the Argentinian Cinema otherwise.It is a real pity, since for several decades that country has been producing an excellent cinema (incredible fact, considering their chronic catastrophic economy!). Did you know that their total yearly budget for the whole movie industry is equal to the budget of ONE single average North American movie?!I believe that for somebody interested in exploring a bit further about Argentinian films, IMDb could be an excellent start.All the above applies exactly the same for the Brazilian, the Mexican and the Spanish movies (I myself, since living in Spain, am head over heels in love with the Spanish cinema).A few (very few!) Argentinian movies I've seen and loved here in Spain:\"El sueño de Valentín\" (\"Valentin\")-2003- Director: Alejandro Agresti... \"El hijo de la novia\" (\"The Bride's son\" ?) -2001- Director: Juan José Campanella... \"Antigua, vida mía\" (\"Antigua, my own\" ?) -2001- Director: Héctor Olivera... \"Herencia\" (\"Heredity\" ?) -2001- Director: Paula Hernández... \"Plata quemada\" (Burnt money\") - 2000- Director: Marcelo Piñeyro... \"Eva Perón\" - Director: Juan Carlos Desanzo... \"Martín H\"... \"Tango\"...A note of advice: If you look for Special Effects (Monsters of all kind, car chases, car crashes, explosions, etc.) please, disregard completely this email.",
            "review_date": "2004-04-26"
        },
        {
            "review_title": "most underrated movie ever",
            "content": "We have so many .....man movies: irishman superman batman spiderman ironman ENOUGH HOLLYWOOD we got conned for years but we are awake now. IF YOU WANT BE AWAKEN BY HOLLYWOOD CONS AND SEE A REAL MOVIE , JUST FIND AND WATCH THIS EPIC MOVIE..",
            "review_date": "2019-11-28"
        },
        {
            "review_title": "Well-constructed con-artist movie , excellent pacing",
            "content": "\"Nine Queens\"Swinder's black comedy movie about an experience indebted con-man (Marcos) teaming with a rookie con-man (Juan) for the day to swindle some grannies and coffee shops, when he gets tipped off by an old partner of the biggest con of their time: a wanted wealthy man who happens to be a stamp collector is taking refugee inside Marco sister's hotel. It has a counterfeit sheet of some rare stamps called \"Nine Queens\" that are worth over a million dollars ....Marcos takes the job , but there's catches to everything when in business with a swindler , and as other people hear of the con, they want a piece of the cut too. From bike thieves, crooked cops, dimwitted crime partners, crooked stamp verifier, attempts to hustle old ladies who have the real stamps, a sister and brother fighting over inheritance custody, the stamp collector horny addiction to his sister, to a bounced check ... This movie comes full circle and is a well-constructed, highly thought out swindle movie9.5/10",
            "review_date": "2018-01-07"
        },
        {
            "review_title": "Masterclass in writing and acting!",
            "content": "This film has it all, it's serious yet comical at times in it's reality. The actors are great, the setting is legit.Nothing is certain until the end, great fun to watch.",
            "review_date": "2019-08-18"
        },
        {
            "review_title": "One of the best movies I'v seen",
            "content": "I saw this movie when I was 8 and it made me fall in love with cinema , a great movie full of drama , action and also funny moments ,the acting of Gaston Pauls and Ricardo Darin is excellent as always and you can see that the chemistry between the two starring character is great, the story keeps you on the edge of your sit at all times guessing if Marcos and Juan are going to the able to swindle the fake \"nine queens\" , and you're gonna loved the unexpected ending.Nine Queens is A timeless masterpiece ,The American version \"Criminal\" didn't do justice to this masterpiece but it wasn't bad. The best Argentinian movie and mi opinion, a must watch and one of my favorites movies of all time. You're going to love it.",
            "review_date": "2016-06-16"
        },
        {
            "review_title": "Too slow",
            "content": "Two con men try to pull off an elaborate con involving nine valuable stamps (the Nine Queens).  They are hearless, evil-looking Marcos (Ricardo Darin) and gorgeous, baby-faced Juan (Gaston Pauls).Well done but slow moving...that's never a good idea in a movie where everybody is double-crossing everybody else.  Also I saw every con coming, with one of two exceptions.  Basically, I was bored and looking at my watch a lot.  Only the gorgeous Pauls kept me in my seat.Not recommended.",
            "review_date": "2002-05-13"
        },
        {
            "review_title": "A Brilliantly Structured and Tricky Heist Film",
            "content": "*WARNING: subtle spoiler*     Out of \"Heist\", \"The Score\", and the 2000 Argentinean film \"Nine Queens\", all clever and well-staged, character-driven heist films, this one is the best.  It is a slick, tricky and fun, but low key caper movie with a great sense of humor and one of the best twist endings I have seen in a long time (and it doesn't manipulate you by it). It opens with a young man named Juan pulling a clever little trick on multiple clerks at a convenience store.  He is caught and saved, unknowingly, by a mysteriously adroit thief who takes him under his wing and prepares him for the heist of a pricey collection of stamps.  The odds seem to be against this odd couple in a crazy day filled with wild turns.",
            "review_date": "2003-04-26"
        },
        {
            "review_title": "Nine Twists",
            "content": "A mildly engaging, if predictable, movie that relies heavily on fast dialogue made ponderous by subtitles.  Anyone who has seen his share of con artists either in real life or on film spots quickly where this one is going.  In spite of a clever ending, it is derivative in almost every way.As a fan of truly original Argentine filmmaking, I thought the sequence near the beginning that captured glimpses of what appeared on the surface to be ordinary folk on the streets of Buenos Aires engaged in one or another scam was the highlight of this story.  Much of the rest is just too slow and talky, made all the more irritating by long walks through some glitzy hotel to the sound of Muzak.  Nevertheless, a good ensemble and workmanlike direction.  Compares favorably with other films of the genre.",
            "review_date": "2004-07-14"
        },
        {
            "review_title": "With a pay-off worth the wait",
            "content": "A complex tale of revenge, with a morality of its own, that deserves patience, but rewards in the end. The best tribute you can pay to such a film is that it lingers in the mind, as you try to work out its internal logic, and that it's a film you'd be pleased to watch it again.The plot cleverly disguises the sting, in fact misleading the viewer so much; we keep waiting for the pay-off, but it's so cunningly placed that I doubt few people will see it coming. A fitting irony considering this is a film about con-artists.It has a nice line in sardonic humour, especially the older con-artist Marcos (Darin)and the running gag with several villains complaining about 'crooks' etc.The double twist at the end perhaps doesn't take your breath away like 'the Usual Suspects' (Spacey's Oscar winning performance), but this is a cunning, interesting film (and much more intriguing than Mamet's 'Spanish Prisoner').",
            "review_date": "2002-07-25"
        },
        {
            "review_title": "A tale of Argentina",
            "content": "Another way to appreciate this fine film is to look at it as a tale of Argentina. At one point one grifter asks the other: \"What kind of work do you qualify for by doing this (con games) and perfecting your skills?\" Answer: \"A ministerial portfolio?\" I liked this film a lot and I love Argentina and its people, but the film also reminds you that Argentine society has been on the verge of breaking down for some time. Any society in which everyone believes that everyone else is on the make or on the take and that only a sucker plays it straight, leads a very precarious existence. When mutual distrust and suspicion are so pervasive and it's assumed that there's a crooked angle to everything (even the music, the tango, is redolent of this), a society lacks the minimum of solidarity to undertake and execute collective projects, which are the basis of social order and stability. A social order can survive on this basis if circumstances have allowed its economy to prosper (Argentina in the 20s & 30s, Italy today). But when hard times come, it's the Hobbesian nightmare of a war of all against all (which is nothing other than capitalist competition with the gloves off). The ending to this film (which suggests a kind of dreamed-of solidarity among Argentines) cannot overcome the feeling of pessimism it leaves you with for the future of Argentine society.",
            "review_date": "2002-12-09"
        },
        {
            "review_title": "Great, fun and original.",
            "content": "This is how a crime movie should be like; great, clever, fun and original. \"Nueve reinas\" has all of these elements in it, making this a great movie to watch! Really, it's a movie that deserves to be seen by more but most people have most likely never even heard about this movie, since it's an Argentinian production. This shall probably also scare a whole bunch of people off already but honestly, Latin American productions are often perfectly watchable ones and besides made in pretty much the same style as Hollywood productions. In other words; perfectly accessible to watch, even for those who aren't really accustomed to watching 'foreign' movies.It luckily was a movie that earned lots of critical praise and got recognized by still many, all over the world, as a great movie. It makes at all the more a big shame that director Fabián Bielinsky died a couple of years after this movie, at a fairly young age. I'm convinced that this guy could had made many more great movies, like this one.Foremost reason why this movie works out well is because it's being a fun movie to watch. Not necessarily in a comedy way but more due to the way the story progresses and how the main characters slowly but steadily get into more and more trouble, as they try to make a big score. It often gets them in some unexpected situations and ensures that the movie makes plenty of twists and turns with its story.It's a simple movie with its setup but one that gets made slightly more complicated with developments. Not that the movie ever gets hard to follow though. Saying that it's often being clever does not mean that it's also totally going overboard with anything and the story becomes too hard or complex to follow.It has some solid characters in it as well and the movie gets mostly carried by its two main leads, played by Ricardo Darín and Gastón Pauls. All around the movie features some good performances in it, which was also necessary, since it's actually a very talkative movie as well, once you start thinking back about it. Don't let this scare you off though, since the movie is still fast paced as well and features plenty of great developments and situations in it, that will keep you interested at all times.A movie that deserves to be seen by more!8/10 http://bobafett1138.blogspot.com/",
            "review_date": "2012-04-29"
        },
        {
            "review_title": "An excellent film - entertaining, funny, well acted, outstanding script",
            "content": "I have seen this film twice now, on the SBS TV channel in Australia, a station that fortunately regularly screens such non-English speaking gems like this. The film has an extremely well-written, tightly conceived script with a surprising number of exciting plot twists. The 'heroes' are two smalltime con men in contemporary Argentina where everyone seems to be on the make. The acting is outstanding, and one of the strengths of the film is that one develops real feeling and liking for these most unlikely characters. On one level, the film is almost a morality tale, albeit a very funny one - this is a world where nobody is straight or honest, nobody trusts anybody, everybody is on the make, yet, strangely, there is a kind of weird humanity to these struggling characters that is entirely captivating. The film is funny, hugely entertaining, and utterly believable. The subtitles are no problem at all - the acting is so good, and the scenes are so well structured that the film just draws you in. See it!",
            "review_date": "2006-11-07"
        },
        {
            "review_title": "Excellent film and quite a surprise ending.",
            "content": "I went into this knowing nothing about the film, the director or the actors, just that it was a \"Sting\" story premise. Starting from this point, it would be easy to say that it would have taken little to please me, but I was very, very surprised and impressed. Well acted, directed and photographed, the basic story is simple but clever and has a great twist at the end that I just didn't see coming (and I don't think I'm easily fooled).We really do need to pay more attention to \"foreign language\" films.An English language remake, \"Criminal\", was released in 2004. I haven't seen that yet, but the line-up, director and producers mean it should be pretty good.I have now seen \"Criminal\" and, whilst it was very good, still think the original is best.But see both if you can - \"Nine Queens\" first, of course.",
            "review_date": "2006-07-01"
        },
        {
            "review_title": "Phenomenal!",
            "content": "Nueve Reinas is a phenomenal movie having to do with two Argentinean men who earn their money by conning people in shops and on the streets. The two men stumble upon each other one day and decide to work together for the rest of the day. This day turns out to be the day in which they could make the most money they have ever brought in. Whilst dealing with the reality of the dangers that exist on the streets of Argentina, the director allows the audience to see a more comedic side of things by entangling the con-men in unexpected situations. Throughout the film we meet several incredibly entertaining characters who have extremely peculiar relationships and encounters with the two con-men. The acting of all the characters, together with the circumstances they find themselves in, are great aspects which make this movie thoroughly enjoyable. Furthermore, the director includes very amusing dialogue between characters as well as adding discrete lines and comments which make it cleverly comedic. All these aspects go without mentioning the different twists and turns which can only be revealed by watching the movie itself.",
            "review_date": "2011-05-22"
        },
        {
            "review_title": "Bielinsky´s first movie...wow!",
            "content": "Watch this movie and vote for it please! It´s the best movie of the last decade that´s been made in my country. There aren´t enough positive adjectives to describe it. This film is also a chance for you to get a glimpse of our culture. Believe me you won´t be disappointed, i bet the Nine Queens on it...",
            "review_date": "2001-05-31"
        },
        {
            "review_title": "Nine Queens",
            "content": "I found this Argentine film because it was formerly listed in the book 1001 Movies You Must See Before You Die, obviously I didn't know anything about it prior, but it was rated well and I was prepared to give it a try. Basically, in Buenos Aires, at a convenience store early in the morning, con artist Juan (Gastón Pauls) successfully scams the cashier. Marcos (Ricardo Darín) observes him attempting the same scam again, he steps in pretending to be a police officer and takes Juan away. When they are far enough, Marcos reveals Juan he is a fellow con man himself. Juan asks Marcos to show him the ropes, because his father, also a con man, is in jail and he wants to raise money fast to bribe a judge to reduce his father's sentence from 10 years to 6 months. Then a scheme seems to fall into their laps: Sandler (Oscar Nuñez), a former business associate of Marcos, needs help to sell counterfeit copies of some rare stamps called \"The Nine Queens\". Vidal Gandolfo (Ignasi Abadal) is a rich Spaniard facing deportation and desperate to smuggle his wealth out of the country. Gandolfo has no time to fully check if the stamps are authentic but hired expert (Leo Dyzen) checks and is satisfied. He offers $450,000 for the stamps, but he knows they are forged, and demands a cut from Juan and Marcos. The fake stamps are then stolen out of the cons' hands by thieves on motorcycles who, unaware of their value, toss them into a river. To salvage the scheme, Marcos approaches Sandler's widowed sister Berta (Elsa Berenguer), the owner of the real stamps, who agrees to sell them for $250,000. Marcos is able put up $200,000 and asks Juan to put in the remaining $50,000. Juan has suspicions that he is being conned by Marcos as he is asking for exactly the amount that Juan has saved up; but Juan reluctantly agrees as the $50,000 is not enough to help his father. They buy the real stamps and go to Gandolfo's hotel, but he says he's changed his mind and will now only buy the stamps if he also gets to sleep with Marcos' sister Valeria (Leticia Brédice), who works at the hotel. Valeria's price is that Marcos must confess to their younger brother Federico (Tomás Fonzi) how Marcos cheated him out of their family inheritance in Italy. Gandolfo pays for the stamps with a certified check, but the bank crashes the next morning, making the check worthless. Juan and Marcos are both ruined. Juan meets with the motorcycle thieves in a warehouse, they are revealed to be Gandolfo, Sandler and his sister Berta, and Juan's fiancée Valeria (Leticia Brédice). The real con was to swindle Marcos out of $200,000 as revenge for all the times he cheated his family and his partners. Pauls and Darín do give good performances as the two con artists, it seems like a simple job to make money out of counterfeit stamps, but obviously there is more to it than that, to completely honest I couldn't follow it all properly, or maybe I didn't pay the fullest attention, but the Argentina locations are good to see, and it was sort of interesting, an alright crime drama. Worth watching!",
            "review_date": "2019-10-29"
        },
        {
            "review_title": "Here a scam, there a scam, everywhere a scam-scam",
            "content": "Scamming is the name of the game in \"Nine Queens\" which tells a convoluted tale about a couple of con artists who become embroiled in a scam to sell nine counterfeit stamps (the \"nine queens\"). An okay flick which gets a little difficult to follow with scams up the wazoo and lots of subtitle reading, \"Nine Queens\" is all drama-lite worth a look for those interested in grifting Argentine style. (C+)",
            "review_date": "2002-10-01"
        },
        {
            "review_title": "Average con artist movie",
            "content": "My Rating : 4/10A decent attempt at a story about scammers in Buenos Aires. Kind of straightforward, not as many twists and turns that I would have liked to see.4/10 for me.",
            "review_date": "2018-10-12"
        },
        {
            "review_title": "Enough Nice Touches",
            "content": "'Nine Queens' starts off, rather than in a bar like 'The Grifters', in a convenience store where a bit of a sleight of hand/deception by a professional con (Juan, as played by Gastón Pauls) is carried out. A customer (Marcos \u0096 Ricardo Darin) has observed all and after helping Juan out of a tight spot picks up a conversation with Juan afterwards in the parking lot. As they move along we find that Marcos has admired Juan's maneuver but criticizes his style and probes to learn more about him. We quickly note this is a two-way exploration, and within short order another opportunity to bilk an unsuspecting soul from their money presents itself. And so begins a semi-companionable relationship based on, well, not trust but perhaps need and opportunity.As in any good crime caper, events begin to unfold and we wonder how much is coincidental and how much is pre-planned. The Nine Queens of the title refer to a set of stamps of great value and we will continue to focus on how the pair might profit from serving as middlemen in their sale. There are a few disappointments in this film. One is that the location \u0096 Argentina \u0096 is never used to great advantage \u0096 this could have been shot anywhere. A second is the ending, which is so remindful of a good American Western that it cannot be credited here.But overall we find a satisfying tale in which determining who is fooling whom is all the fun. There are enough nice touches \u0096 the owner of the stamps and her life circumstances and Marcos' attractive sister with her look and attitude \u0096 to carry over the story. Rating: Three Stars.",
            "review_date": "2004-12-10"
        },
        {
            "review_title": "An OK film but not as good as it needed to be to pull it off (spoilers)",
            "content": "Juan is a small time con artist who goes into a garage to pull the old \"change\" con of confusing the teller. He is caught doing it by security but is taken from the store by an off duty cop. Luckily the \"off duty cop\" is Marcos, also a con artist who spotted Juan working the store and decided to help him out of trouble and offer him a deal. Marcos' partner has gone missing and his cons need two people to work, so he offers Juan the chance to join him and also see it as a learning experience. Very quickly they settle into one another and they stay together when a chance falls in their lap to pull a job involving a priceless set of stamps called the Nine Queens.Con artist films are all the rage in the past few years and in some ways they always have been \u0096 I'm not sure if it is the cool calm that they are given in films but they seem to have an universal appeal. I didn't know that this film was about that when I came to watch it but it was interesting enough to make me watch it (funnily enough, just after an episode of The Simpsons where Homer and Bart become grifters). From the start of the film, there is a good pace to it that soon builds to the actual plot being revealed. At this point it slows down a bit and requires more detail that the brisk introduction to characters and the game; this kind of is where the problems start to come in. See, here's the thing with this genre \u0096 it needs to grip or at least engage/entertain you because if it doesn't then it gives you time to look around for the con. With Nine Queens, I wasn't held by the detail and found it a bit hard work at times and this allowed me to distract myself with the side issues of where it was going \u0096 we all know it is not what it seems, so we try to see it coming and work it out. This is always going to happen but the film should minimise it by not freeing us up to do this \u0096 hence a lot of the genre are fun, free-flowing, cool and twisty.Here the film is entertaining in its own way but doesn't have the staying power or genre value to make it work. The plot is OK but nothing special and it doesn't glide so much as plod at times. The mind wanders to the possible sting that always comes and, by the time it has come I had spent so much time thinking about it that the obvious and downbeat denouncement is rather flat. The use of the Argentinean economy as a backdrop is interesting but it isn't used as an allegory or use to provide insight or comment as some reviewers here have suggested; it is simply there and what connection there is is merely superficial. I don't want to come across too hard on the film because it does OK and I enjoyed it reasonably well but it doesn't compete with many slicker and more enjoyable entries into the genre and just because it has connections to society and has subtitles doesn't make it a deep meaningful experience \u0096 it is still a genre film, and only an OK one at that.The cast are pretty good all round, although they are mostly weakened by the material. Pauls is engagingly soft and sadly the genre spoils his work because we know he cannot just be this. Darin is better because he goes through so many emotions but yet we never know when he is conning us or when he isn't. Bredice only has a few scenes but she is good with what little she has. Outside of these three, the support cast is too busy and relies on a lot of names moving in and out \u0096 it clutters the plot, slowing it down a bit and allowing us to wander \u0096 falling down in the process.Overall this is a genre film and it is only an OK one at that. The plot gets a bit heavy at times and it allows us to think around it rather than being part of it and really into it and it loses a lot of impact. The best of the genre keep us busy looking one way, or entertaining us or never letting us try to work it out (or even just making us think there is nothing to work out) but here we are never in doubt that the twists are coming. The backdrop of the economy is a vague connection but to read more than that into it requires a lot of forgiving and reading that it never made me willing to do. Not terrible by any means but it doesn't do what the genre normally does and sadly doesn't have much of its own to fill this gap with. Genre fans will get some good out of it and viewers will still find it passable but there are better out there than this.",
            "review_date": "2004-12-10"
        },
        {
            "review_title": "This movie is just Brilliant!!!!!!",
            "content": "I loved this movie,Oceans Eleven and all the other con movies are nothing compared to this piece or Argentinian movie making. This film is about 2 guys who are con men, theres always a Teacher and an apprendice,but theres more than meets the eye in a con they get for selling some rare stamps to a mob boss,The movie moves fast and the dialogue is very funny and intelligent. It really deserves to have a great place in a movie collection,This movie makes you realize its very hard to trust someone these days. Ill give it a huge 10 out of 10 on con-artist movies.",
            "review_date": "2002-12-11"
        },
        {
            "review_title": "Tricked in Buenos Aires",
            "content": "Story with several twists about a scam. Although it starts slowly, pacing is increased considerably towards the last half hour making that the most interesting part. It is reasonably written, but lazy and incompetent in the execution. Only the hotel scenes are well shot: large impersonal spaces, camera-movement around three people showing their perspective on the story unfolding. But ultimately it lacks a soul. And do not expect great cinema here. There is some criticism of Argentinian society sipping through: everybody tries to swindle each other, the bank plays a major part in it all. This was made with the banking crisis still fresh.Matchstick Men was made some years later, but is far superior in direction and made the audience an interactive part of the trickery. Nueve Reinas is of interest for those who loved Memento or The Usual Suspects.",
            "review_date": "2005-07-02"
        },
        {
            "review_title": "Entertaining. Engrossing. Admirable. Meaningless.",
            "content": "Nine Queens is a story about con artists. From the opening scenes there is no doubt that this will be the theme. With con artists, nothing is what it seems.The film took me for a fun ride, but ultimately it left me empty. I got no meaning from the movie, only what I came into it with, to wit: With con artists, nothing is what it seems.This is not a detective story, but the equivalent of a very well executed visual adaptation of those pick-a-path books some of us used to read as children. These books all had multiple endings and, based on the choices you make as you went along, the story ended in a particular, albeit somewhat random way.There are many ways that this movie could have ended, and the final scenes concretize only what the filmmakers wanted us to see - but it could easily have been any of the possible endings at all. Since we are viewing a movie about con artists the ending only relies on the filmmakers ability to execute their chosen ending in a believable way. Sadly they fell a little short in my opinion.While I enjoyed the movie, the impossibility of knowing how much to accept of what I saw did spoil it, though it did keep me thinking. This is a movie and not real life, and the situations are not reliably portrayed as they would occur in real life, so teach us nothing.However, for the thinkers among you, you can be satisfied in knowing that it's still possible to put together an entertaining, engrossing admirable film without needing big actors, special effects, name-brand scores, hundreds of millions of dollars, the English language, or the United States. It is unfortunate, then, that the theme is based on deception, and we as viewers have no solid ground to observe the realities of the film until it grinds to it's unexpected but ultimately meaningless end.I would like to see the writing and production team that created this movie deliver a detective story or a comedy, it would certainly be something I would buy and put on my shelf.It gets 7 stars from me. I wish I could give it 7.5 - for hitting the mark three out of four times.",
            "review_date": "2005-02-06"
        },
        {
            "review_title": "A Good drama movie!!!",
            "content": "Awesome actors and the drama was excellent. I have to say that the English version (Criminals)is not as good as this one. If you like the cheat-thief movies this is the one for you. The place for this movie es excellent which better country that Argentina to film this. The country have some economic issues and the thief's are trying to cheat some Billionaire guy to get money with False stamps. The only con.... if is a con is that all is in Spanish but this is the real version. The drama of Criminals is base on this movie. Its good but not as good like this movie and the actors are the best of the best in Argentina. This is a 10+ Movie i recommend this to you and your family you will enjoy it believe me.",
            "review_date": "2006-07-05"
        },
        {
            "review_title": "Nice characters/unoriginal story/lazy directing",
            "content": "Were it not for Ricardo Darín, his young fellow and his lovely sister I would say this is a very bad movie.The biggest flaw is the linear uninventive story-telling. And the unoriginal story of Nueve Reinas badly needs one for it's only a series of sketches good enough for TV and packed together with that stuff about unique stamps; hence this McGuffin title.What's left? Exotic cinema. So let's not be lenient: this is a poor movie.",
            "review_date": "2002-09-19"
        },
        {
            "review_title": "Nine Queens",
            "content": "Nine Queens is a great, action-thriller that keeps you guessing till the very end. Set in Argentina,two small time scam artists meet up for a day and swindle money from unsuspecting people. Then they must figure out how to sell counterfeited stamps of the most rare stamp collection in the world, the \"Nine Queens\". This movie is full of twists and turns in the plot, you never know what might happen next. The actors, Ricardo Darin, Gaston Pauls and Leticia Bredice do an excellent job in this movie. I would recommend this movie to all. Very well directed by Fabian Bielinsky.",
            "review_date": "2010-04-19"
        },
        {
            "review_title": "The best con movie out there",
            "content": "I had just seen Duck Season , a Mexican movie which was simple but brilliant. I came across Nine Queens , and it was described as the Latin version of The Sting. As a huge movie fan , i have to say that this beats out any heist or con movie that Hollywood has ever produced. Highly unpredictable, this was an entertaining movie beyond any expectation. Better than The Oceans,better than The Sting, better than CONfidence(Dustin Hoffman,Paul Giamatti) . You have to see it for yourself , nostalgia aside.I dare anyone to call a con movie from Hollywood, that is better than this.Even those that we have come to call Classics.I highly recommend this movie to anyone that loves twists surprises and plot plays that would have you thinking , what on earth just happened.",
            "review_date": "2009-01-27"
        },
        {
            "review_title": "con artists and the economic crisis in Argentina",
            "content": "\"Nueve Reinas\" is a typical story of two con artists, one being older and more experienced, and the other learning from him. One of the two characters not having a conscience and being completely corrupt is also a common thing to see in this type of movie. In that sense, what we see in \"Nueve Reinas\" is nothing new for the genre. However, the thing that transforms this movie from something fun and forgettable into something different and memorable is the social aspect which reveals the economic situation and the crisis in Argentina.Juan is a young swindler who is trying to get some money to get his father out of jail. He makes a mistake while performing one of his tricks and he is helped by Marcos, who turns out to be in the same line of work. They decide to work together for one day only. Unexpectedly, they are given a chance to earn millions in this one day of work. All they have to do is to sell a fake stamp collection to a Spanish millionaire. Trying to do that, they get themselves in a bunch of situations that could cost them the money.Although this is a pretty fast and intense movie, it also covers more serious themes like the family. A part of the story is the relationship between Marcos and his sister, who are fighting over a property they inherited. It represents the idea that some people would do anything for money, and go as far as to sacrificing their family to get to it. Ideas like this one appear quite a lot in the movie and turn the story into a much more complex one, not just because of the twists in the plot, but also because of the emotions that they produce.Visually, \"Nueve Reinas\" is modern and simple, which works well with all the action. The actors, especially Ricardo Darín as Marcos, play their roles perfectly. They are the most important reason, along with an interesting plot, for this movie to be such a success. The American version of it, \"Criminal\" shows clearly that the story, although interesting, is not enough in itself. When we contrast that movie with \"Nueve Reinas\", it is even clearer to see what an amazing job the Argentine actors did in \"Nueve Reinas\".The biggest problem with the American version was the end of the movie. The most interesting part of Nueve Reinas is the way in which the director includes the story of the \"corralito\" (when people in Argentina could not take their money out of the banks, and watched its value go down until many lost all their savings). This idea of Juan and Marcos losing everything because of the country's economic problems works much better than the last scene used in \"Criminal\" (the check is false). To see all those people who lost all their savings and to understand the magnitude of the event has a much stronger impact on the viewer than just understanding that the whole relationship between Juan and Marcos was just a trick, a job. The irony that, in the end, it does not matter whether the check is real or not, is something that the audience does not forget quickly.",
            "review_date": "2005-12-13"
        },
        {
            "review_title": "Gripping, Scheming and Refreshing",
            "content": "An excellent movie! Great script. Brilliant performances by all actors. The movie manages to keep the audience hooked till the end and trust me, you wouldn't have imagined how it would end.The movie not only takes a closer look at the lives of con artists but it also shows to what extent they can go to achieve their objective. A \"Long Con\" is an art where the con artist offers a \"bait\" (a small investment) to get a much bigger haul from the victim. And during the entire process not once does the victim realize that he is being conned. That is exactly what this movie is all about.If think you are too smart to be conned, try guessing the end of this movie.A must watch for all.",
            "review_date": "2005-10-16"
        },
        {
            "review_title": "An Italian Job",
            "content": "The movie was The Italian Job, quite literally, since it is an Italian film. The fact that it also involves a bunch of crooks and betrayal over a large fortune is just ironic.  But yes, that's basically the gist of this movie.I'm not a huge fan of foreign films but have been increasing changing my opinion with films such as The Eye and this one.  The film pairs together two con artists who try to score one big take by selling a sheet of rare stamps, The Nine Queens.  Misfortune and complications soon arise as the pair try to carry out their deception.  One crook is in it to enrich his life while the other is trying to get his father out of jail.  Both of them put their personal fortunes on the line in a dicey game of trust. \nIn another sympathetic-thief film (The Italian Job again) the lesson taught here is to be careful who you con and steal from, because one day you're number might just be up.  In retrospect, I think you'll find some circumstances of the story too incredible, but it still makes for a good story nonetheless.",
            "review_date": "2004-08-22"
        },
        {
            "review_title": "More of a Jack.",
            "content": "There is an essential quality to every con movie like this one. The con is always aimed at the audience, like a mystery movie with more complexities than simply \"whodunit?, the audience needs to be fooled and then there needs to be pay off where all is revealed, this obviously should not be easy to figure out or otherwise the film wouldn't work. It wouldn't be a proper con film.This brings a problem for writers, as more and more con movies are made and become a distinct style of its own, more and more elaborate and unlikely narrative tricks are needed to hoodwink the audience so in order they will remain guessing the outcome to the end. This is why the genre constantly changes \u0096 magicians seem to be the in thing \u0096 in both content and in form. This is also why to complain about the lack of logic or realism in a con film is similar to complaining about the lack of logic or realism in, say, a fantasy children's book. The genre creates its own logic (which could be said for all genres, if we are being honest.).Therefore this film was a failure, for me, in being a con movie. Or rather its ending failed having too much of a \"David Mamet in Argentina\" feel. It was for me used to such films, Obvious. Though perhaps this was its local appeal \u0096 Obvious in how corrupt and double dealing all the characters are in an Argentine context, a country which has come a by name for political corruption and given its potency to portray in such a (Unique?) way in a local film. Though I admit complete ignorance of Argentine cinema (this was my first ever Argentine film, any recommendations for any others?).That is not to say it isn't good if not earth-shattering or highly original. It is a competent job \u0096 acting, characterization, cinematography, plotting and pacing are all good, and the director made the film flow and didn't focus attention on himself. In this way I recommend it if you are wishing just to spend an hour and a half watching a good, decent movie without expecting anything new, unless you are a virgin to this territory. In which case I recommend it even more; it is pretty much got all the genre staples. I guess \"good, not great\" would sum my feelings. 7/10.",
            "review_date": "2008-03-15"
        },
        {
            "review_title": "this is argentina, post 2000. is bielinsky most influential movie ever",
            "content": "This con-movie, like esperando la carroza, in many ways become a way to show argentina to others, and many scenes and lines are still used inthe argentina lexicon...so imagine, with the good and the bad, this movie still talks about people betraying each other, but bielinksy direction and script have so many lines still used by everybody, that is weird to say that, 22 years later, this movie still is loved by everyone-even non movie fans people-because this movie shows the average side of argentina, the dirty side everybody have here...and thats why even after wild tales, this movie still provides explanation to why governments fails, people is dumb here, ambitious etc...is like bielinsky was talking more about argentina reputation, than con people...like esperando la carroza, this movie is about argentina as the tango.drama and comedy in the same page.",
            "review_date": "2022-05-27"
        },
        {
            "review_title": "a pleasant surprise",
            "content": "I'm from Argentina, where this movie is from and I must say that I trully hate argentine movies... But this one is different I was surprised by the simplicity of this movie. It is usual in argentine movies to try to force a message, to try to \"say\" something mostly copying ideas from big classics.. \"nueve reinas\" is not the case. It's refreshing to see Buenos Aires as it really is, far away from that \"tango-like\" image every argentine filmaker try to show to the rest of the world. We can see real people doing the thing that are really done in Argentina...This is not an excelent movie but it shows that we are in the right way... (i'm sorry for my english)",
            "review_date": "2000-09-11"
        },
        {
            "review_title": "My interpretation of Nine Queens",
            "content": "Fabian Bielinsky's Nine Queens is a powerful film that primarily focuses on money, greed and the game. The con artists (Marcos and Juan) are in a large Spanish city where coning is more than just a game or high-seeking thrill, it is their jobs. Within the city coning seems to be the way of life for the majority, especially when speaking about Marcos and Juan. They become emotionally and physically wrapped up in the business of being con artists that neither friendship nor family is extremely important. What distinguishes Nine Queens as an abnormal con film is the concept of a con within in a con. The concept is hard to grasp until the credits but is very intriguing for the viewer to observe during the process. In Nine Queens the essential motive for social status take a toll on Marcos, especially after the scandal with his family (sister Valeria and younger brother Federico). That status situation for Marcos falls apart at the end, which comes to show that you cant always get what you want and nothing comes without a price. Despite the issues between Marcos and his family, the films plot is exceptional along with the quality. When considering the quality of the film a viewer definitely would notice the specific camera angles in which the scenes were shot and the non-dialectic sound, and know that Bielinksy put a lot of time and effort into this piece of work. Nine Queens most definitely has all the elements for a passion-filled film with excitement thrown in along the way.",
            "review_date": "2010-05-02"
        },
        {
            "review_title": "Great fun",
            "content": "Nine Queens is a small gem from Argentina- the kind of refreshing indie hit that comes along all too rarely. It tells the story of two conmen, who strike up a partnership after one of them tries to trick a small shop. The more experienced of the two, Marco, convinces the younger one, Juan, to stick with him for a day of conning. However it soon becomes clear that Marco needs Juan as much as Juan needs Marco, so beginning a fast paced and thoroughly entertaining ride through the Argentinian underworld. Not being a veteran of Argentian cinema, I couldn't really compare and contrast this movie to whatever else Argentina produces, having stumbled across this one on pay per view. However, the sheer quality of this production just goes to show that it is not only American cinema that can create a great film about deception, which in itself deceives the viewer through a plethora of nifty tricks and twists. The final twist, is also a doozy, so to speak.The film benefits from soldity all around. The acting is completely unprententious, fuss-free and utterly convincing. This also applies to the direction which (at times) borders on the superb through its use of tension building devices. The script is witty and fresh and the use of editing in combination with the swift direction, creates a strong pace even through the most action-free scenes. Relying on dialogue instead of violence or setpieces, excellent characterisation is also achieved confidently.Its familiar territory, sure, but Nine Queens is fresh, fun, non-pretentious and thoroughly gripping film making.",
            "review_date": "2003-08-03"
        },
        {
            "review_title": "Twists within twists",
            "content": "For those who say the ending made no sense: I predicted it near the beginning of the film, when Juan and Marcos were doing the torn-bill scam at the restaurant (see my post on the message board for this film if you want an explanation). For those who say the ending was predictable: I wasn't sure I was right *until* the end. The writing, directing, acting and all production qualities are excellent. There are a couple of confusing points, but they were very minor. Just pay attention, don't assume that *anyone* is who they seem to be (although they might be, as well), and you'll thoroughly enjoy this film.",
            "review_date": "2004-01-26"
        },
        {
            "review_title": "Best dialogues ever",
            "content": "SPOILERS ALL OVER ITThis is a very good argentine movie that has crossed its country's barriers and gained success in the exterior. Good for Fabián Belinski and his crew.The strongest point of the movie is the plot, full of truly surprising twists and some of the best dialogue ever. Really, it's convincing, natural, and at the same time very witty, specially Marco's speech in the toilet with the towels. Some parts made me laugh out loud because the twists were so great it was hard not to admit the unbelieveable wit behind them.However, I was disappointed by the ending (and the final twist) for three reasons: 1) it really p***es me off because it ruins a lot of great scenes that, if Juan set it all up, were in fact pure acting (I mean the characters acting). 2) Juan's culpability is just too \"denied\" by previous scenes, and it's not a good twist if you re-watch the movie and find out how difficult is to buy this set-up, specially because when Juan's alone with Valeria, they don't seem too confident; that's a plot flaw, maybe the only one. 3) it's impossible to make such a con; Juan would have had to run a lot of risks: after all, he couldn't be sure that Marcos would help him in the convenient store, and he sure as hell couldn't have planed in advance going to see Sandler's sister because it was Marco's idea to do so.Despite that only flaw the rest of the movie is a light of hope in the otherwise poor field of argentine cinema.SAY NO MORE.",
            "review_date": "2002-10-26"
        },
        {
            "review_title": "This movie is 10 minutes too long.",
            "content": "This is a good film but it suffers from the usual \"con movie\" failing - we know it's a con movie, therefore we're expecting a sting in the tail. Not only that, we know it's supposed to be what we least expect so we formulate our own ideas about the finale as we watch the film so that, ultimately, most of us have already guessed what's going on. BUT, this film contains two twists - and, ideally, the credits should have rolled after the first of them because I didn't see that one coming, whereas the second one was altogether more obvious.The acting from the main characters is first class, although the supporting cast leaves a little to be desired. The plot moves along at a reasonable pace and the dialogue doesn't overwhelm the non-native Spanish speakers.Overall, this is a good film which could have been great if it had avoided the \"con\" cliche at last hurdle.",
            "review_date": "2003-10-22"
        },
        {
            "review_title": "Slow paced satisfying heist thriller",
            "content": "This film takes its own sweet time to get things stirring. And normally this slow pace might seem out of place in a heist movie, the payoffs are really worth it. Though one does began to guess who is really getting swindled in actuality towards the last half, nevertheless the finale is a sweet satisfying twist. The actors have done an amazing job further helped by a tight and focused script. I particularly love Ricardo Darin whenever he shows up on screen. He is really an amazing actor with a huge range. It's always a huge excitement to watch him become one with his characters on screen. Loved the film. Truly an underrated gem!",
            "review_date": "2022-04-07"
        },
        {
            "review_title": "Bravo!",
            "content": "Nine Queens starts out slow and easy then piles tricks on tricks on tricks like a Mamet film. But this is better than a Mamet film. It's just as clever but the dialogue is not brittle or artificial and the characters will interest you. Terrific actors, low key but very expressive. The plot is as intricate and as funny as a Rube Goldberg contraption.I don't like tricksy films but this one is irresistible. See for yourself.",
            "review_date": "2002-05-05"
        },
        {
            "review_title": "What the good movie !",
            "content": "This movie is amazing !I had not seen such a good film for a long time. Fabian Bilinsky was a genius. Its very sad that he died so soon.In this movie you are surprised every moment and you cant predict exactly what will happen. There are a lot of movies like this in Hollywood, but none of them are as good as Nine Queens. This movie shows you a detailed picture of the city of Buenos Aires. Do not expect to see tango dancing or anything like that in this movie.This film is a true picture of Argentina. Ricardo Darin is a really good actor. I wish he could act in international films. My rating for this movie is 9 out of 10.",
            "review_date": "2021-08-31"
        },
        {
            "review_title": "Ocean's Eleven goes to Argentina",
            "content": "This was an excellent movie! Usual suspects without the violence. Ocean's Eleven in Spanish. It will leave you with a smile and wanting to discuss the pieces of this puzzle with friends. No sex, no violence, clever crime story. It is completely entertaining.",
            "review_date": "2003-01-13"
        },
        {
            "review_title": "Disappointing",
            "content": "Very disappointing unfortunately. The blurb said it was a mix of Amorres Perros and Memento... two of my favourite films of the last few years.I guess they chose Amorres Perros because it was a foreign film, but that's where the comparison finishes, and Memento had absolutely nothing in common with it. Gotta stop believing those quotes, especially when they are taken from Vanity Fair!!All in all it was an average film. Nicely made with some admittedly very good acting. The problem is, it moves so slowly and the story hasn't enough happening to keep you interested. I guessed the ending about two thirds the way through the film, I thought it was pretty obvious. There are some nice smart one liners and the characters are great and it shows you the REAL Argentina. It's just all too lethargically implemented.Some of my favourite movies of the last few years have come from South America but I have a feeling that too many people are jumping on the idea that it's South American film and therefore giving it too much credit. It's an okay movie, great in parts but it doesn't completely work as a whole.",
            "review_date": "2002-08-22"
        },
        {
            "review_title": "An entertaining movie.",
            "content": "I just came upon this movie by chance. It was well done with a lot of surprises and twists. At times, you would feel sorry for the main charactor until you come up to the next plot. This movie is worth watching again.",
            "review_date": "2002-12-02"
        },
        {
            "review_title": "The Grifters meets The Heist",
            "content": "Boy, this is one movie that keeps you guessing right to theend...and even when you think it is over, it opens yet anotherChinese box at you.  After seeing Village Idiot movies like StarWars II, what a refreshing change to watch something that involvesyou and keeps you thinking throughout the movie.  Buenos Aires inall its tangled splendor and edgy personality is personified in thismovie (although I'm not sure I'd visit it now without having a moneybelt chained to my body!), even the banter and belittling anddiminutives captured the real flavour of an Argentinianconversation.  All throughout the movie you are rooting for the poorbaby faced  Juan as he and his money are separated by thecunning and experienced Marcos (who as the villain, is as likeableas the Sheriff was in \"Robin Hood:Prince of Thieves\") in anelaborately planned scam involved the sale of 9 rare stamps (theNine Queens of the title).  To say more would ruin the surprise;there are even some nicely plotted references to Argentina'scurrent financial crisis which may hit just a little too close to homefor some.  You won't see the travelogue Argentina; in fact it couldhave been filmed in just about any Spanish-speaking city in theentire world and been believable from a set perspective, the realkiller is the staccato dialogue who others have compared toMamet and Tarantino, for the non Argentinian Spanish speakersthe subtitles really don't do it justice.  In any case, go see it, you'llfeel your pocket slowly being picked for the $13 admission, butwhen it is this enjoyable, you really don't mind.",
            "review_date": "2002-06-14"
        },
        {
            "review_title": "Just see it",
            "content": "The less said about this film, the better. It is full of twists and turns and you have to pay close attention to keep up. It would be hard to describe much of this without getting into spoilers, so I won't. It is one of the best films about con artists and swindlers I have seen.It is great to see such good films coming from Argentina, a country with a lot of talent and artistic heritage to draw on. It is also a beautiful country and looks good on film.This film is now out on DVD. For those who do not speak Spanish, you will have a lot of subtitles to read and you may want to pause and even go back at times to make sure you don't miss anything. I speak Spanish, so I was able to follow it fairly well, although the Argentine accent takes some time to adjust to if you are not from the southern cone of South America.",
            "review_date": "2006-01-01"
        },
        {
            "review_title": "Ingenious ... Can't wait for the remake",
            "content": "A very ingenious film, with more twists and turns than you can count and a deliciously droll kicker of an ending. As good as it is, I can easily see a better Americanized version, with perhaps George Clooney as the con man who gets conned, Julia Roberts as the sister and bright newcomer as the \"innocent\" younger con man. Too bad Pitt and Damon are too old for that now, and have lost the edge of guileless innocence the part requires. But the seedier side of New York City would be a perfect American setting, and I can see Abe Vigoda as the forger, Sylvia Miles as the aunt and an number of veteran New York actors turning in great supporting turns. A good project for Soderburg, one would think.",
            "review_date": "2002-07-22"
        },
        {
            "review_title": "caveat emptor",
            "content": "I picked up this movie last week in the video store. I did not know anything about it except it was an non-hollywood film. I had no expectations. Unfortunately I found the movie to be uninvolving. I watched it with the same dispassion  as I had when I watched Unbreakable, The Game, Jacob's Ladder, and The Spanish Prisoner. Nine Queens like all those other is about plot twists not about characters. These movies are about misleading the audience not about telling a story.  It becomes a game of wits between the filmmaker and viewer. Can the filmmaker distract the viewer from considering every possible ending before the film finishes. I feel here the filmmaker does not succeed. Sure I thought of that possible ending but disregarded it as not believable. Learning for Jacob's Ladder, I  pick one solution and stick with it. The plot will usually twist around again.SPOILERS ONI have seen \"House of Games\" and \"Spanish Prisoner\", I know how con-artist movies work. The basic premise that everyone you see is in on the con. Doesn't matter if there are 5 people or 50 everyone is in. That rule definitely worked in \"Spanish Prisoner\" and it works here.  I was as suspicious as Juan claimed to be that everything was a con.  I didn't take anyone for face value and was annoyed when one of the characters trusted another. No, it is not as bad as SP, campbell scott in that movie was so gullible, I wanted to scream. Still I was waiting for the point where, like in House of Games,characters had to sacrifice their own money. That took forever!I would have prefer it if Juan told Marco's sister that he could get marco to tell the truth ala get the old woman's bag. That would have been a better payoff and given her a motive to be in on the scheme.SPOILERS OFFI fully admit that my prior viewing ruined nine queens for me but the film makers of Unbreakable, The Game, Jacob's Ladder, and The Spanish Prisoner ruined thrillers for everyone by such cold calculated filmmaking.",
            "review_date": "2003-07-02"
        },
        {
            "review_title": "Solid movie",
            "content": "Very engaging with solid plot and exceptional acting. There is something for the plot-twist lovers as well. A must watch.",
            "review_date": "2020-09-08"
        },
        {
            "review_title": "A Little Gem",
            "content": "This is a little gem of a film. Tight, fun and down right surprising.With an Argentine city as its every changing backdrop, two con artists (of varying degrees of expertise....) hook up temporarily to sell a block of fake rare stamps. All of the actors are wonderfully directed and if you pay close attention to everyone you will be pleasantly surprised at the wrap of the film. Production values are very high and you will have an enjoyable trip! I viewed the DVD (Region 1) and it is excellent and the subtitles unobtrusive and right on.",
            "review_date": "2004-07-22"
        },
        {
            "review_title": "Hollywood take note (yeah, right)!!!",
            "content": "One the better heist movies of movies that I've seen.  This is very clever movie, and it doesn't bang you over the head with any of those ridiculous subplots or plot twist in your typical Hollywood heist movie (Unlike some Hollywood films that think they're clever, but there not).  I found the ending to be a great surprise, and very rewarding.  I didn't see that coming at all.  This might the first film I've seen from Argentina, and I'm very impressed.  This a foreign indy gem, and it deserves to be seen.",
            "review_date": "2003-08-31"
        },
        {
            "review_title": "I feel pity...",
            "content": "...for those people that would miss this movie because it is with subtitles.This is an excellent, entertaining movie that if had been made by Hollywood it would have become a blockbuster for the only reason that it would be spoken in English...Well acted, including in its cast some of the best Argentinian actors; Darin is superb in his portray of a disgusting character that goes in the world betraying even his younger brother and asking his sister to go to bed with somebody she doesn't know when money is the issue. But it is not a drama, unless you have a brother like him in real life. Is a movie to enjoy. Be prepared to distrust even the air you breath. You will be rewarded.",
            "review_date": "2003-12-26"
        },
        {
            "review_title": "One of the best heist movies ever!",
            "content": "I've seen a lot of movies, and recently everything has been garbage.  But this is a really rare movie that no one has heard of, that you have no idea what it's about, and it'll blow you away.  A movie that surprises you at every moment and give you hope in movies again (although not in movies produced in Hollywood).",
            "review_date": "2003-02-24"
        },
        {
            "review_title": "Really cool",
            "content": "So many of the characters were suspect in this it was hard initially to tell what was what.  Although I did manage to figure out who was screwing who well before the end, it was very well done and a thoroughly enjoyable film. I'd see this one again in a heartbeat! =^.^=",
            "review_date": "2002-06-16"
        },
        {
            "review_title": "Unforgettable and wonderful!!!",
            "content": "It is a movie that does not seem to have been made in our country. I loved it. Its intriguing plot is interesting as soon as it starts and its unexpected ending is unforgettable. Ricardo Darín and Gaston Pauls show us once more the quality of the Argentine actors...",
            "review_date": "2001-01-16"
        },
        {
            "review_title": "a movie that could make you feel good about yourself!",
            "content": "I utterly enjoyed this movie, in all his aspects: the acting is truly realistic, the lead actors seem born to be con-men, the screenplay is detailed yet simple, giving the viewer a chance to play Sherlock Holmes (as I did), in the process of guessing the real plot behind the facade. Yet, by guessing, you don't think you have done it because the movie is predictable. On the contrary, it boosts your self esteem, as you think you have been really clever. Throughout the whole movie, I was never once bored or distracted, and I particularly liked the perceived lack of musical background, as if it didn't need it as most movies seem to do, nowadays. David Mamet wouldn't have anything to say against this film, in fact, it could have easily been conceived by him. Less elegant than his movies (see \"the house of games\"),but probably, for the same reason, closer to the true idea of a con-man's mind and image. Especially as it is set in sunny, latin Argentina. Loved it.",
            "review_date": "2004-03-17"
        },
        {
            "review_title": "Cool urban movie",
            "content": "Like many other people, I was amazed by the great reviews this movie had before its premier in Venezuela, so I went to see it immediately.This is a very cool movie in a sort of Tarantino-meets-Guy-Ritchie way, but it's quite obvious that Bielinsky doesn't copy any of these styles, and tries to develop his very own language. And in my opinion, he succeeded!Nice to see a South American movie that tries to be entertaining, and not the usual \"I want to show the social problems, so I can change the world\" crap...For me, I'll be waiting for Bielinsky next deliver...",
            "review_date": "2001-09-16"
        },
        {
            "review_title": "Argentinian Guy Ritchie",
            "content": "This is a phenomenal film following in the style of Guy Ritchie and his two wonderful movies: Snatch, and Lock Stock and Two Smoking Barrels. Bielinski does a wonderful job directing his amazing script.Quite simply, as I won't bore with a plot summary, it is an adaptation, of sorts, of The Usual Suspects, but it is much better and has a better ending as well. If you liked Usual Suspects, you LOVE Nine Queens.My vote: 9 out of 10",
            "review_date": "2002-12-02"
        },
        {
            "review_title": "Not so good.....",
            "content": "Okay, the movie was clean and nicely done, but the plot was not so good or realistic. There was probably too much cons and misleads. The movie was full of inconsistencies, which made it possible to end the movie the way it ended. Nueve reinas is a fine movie, but definitely not one of the greatest.",
            "review_date": "2003-09-30"
        },
        {
            "review_title": "A very Argentinian variation of \"The Sting\".",
            "content": "The premise is simple enough: in 2000's Argentina, two con-men meet by chance and have the opportunity of a lifetime to make it big. If only it were so easy. A very believable and relevant setting for those of us who come from countries where economic turmoil is the norm. Where the subsequent uncertainty, fear, desperation, and good-old greed entices the individual to behave amorally, in order to get ahead of his equals.",
            "review_date": "2022-03-05"
        },
        {
            "review_title": "bueno",
            "content": "this was my favourite film of the year (until i seen amores perros last night). a brilliantly crafted experience. this film had me constantly thinking about it for a week afterwards. and like i was told, the ending is brilliant. a real shock to the senses. a treat",
            "review_date": "2002-10-03"
        },
        {
            "review_title": "It may take two to Tango but dont trust anyone.Great Movie.",
            "content": "A wonderful film that must rank with all the great Con/Sting depictions in Cinema History.There is also the powerful subtext showing some of the economic problems that were to engulf the country in 2002.The storyline will keep you so engrossed that when the end comes.........WOW !! The acting is fine within the constraints of a very powerful script and the settings have a freshness that is quite delightful. A must see particularly for those who like to analyse what really went on!",
            "review_date": "2002-08-20"
        },
        {
            "review_title": "Scams growing crescendo",
            "content": "Nine Queens is a clever movie about cons and liars. Two small criminals embark in a journey to set up their biggest con ever. However, not everything unfolds as planned. All characters involved in the plan want their share of the cake and will try to coerce others to meet their interests. Our two artists must thus find ingenious ways to react and stay on track. The set of characters involved and the complexity of the scams grow crescendo, making it a captivating movie full of twists and turns. It will engage your brain to keep track of the events, but won't cross the threshold of confusion. The actors are sympathetic, the direction is solid, and the dialogs are punchy. The plot is convincing and witty. We could challenge its realism, as with any such movie, but it has not obvious holes and is a very good entertainment! A highly recommended movie for those who like puzzles.",
            "review_date": "2013-08-22"
        },
        {
            "review_title": "Excellent movie.",
            "content": "I was really surprised to see so much positive reviews of `Nueve Reinas' when it got to the movies here in Brazil. After all, we are not used to see much films of our neighbor country getting the attention of the general public. But this film sure deserved all the compliments it received and more. Not only the screenplay is very interesting and well written, but also in all aspects the film shows a high degree of quality. Ricardo Darin is superb in his role as a heartless, cynic grifter, while Gatón Pauls really convinces as a disturbed, unwilling one. All the secondary roles are played by competent actors (which is very surprising in South American movies, where you can easily find excellent actors sharing stage with amateurs). Everything works fine in this movie: the direction, the timing, the end. It is really worth seeing.",
            "review_date": "2001-07-22"
        },
        {
            "review_title": "Excellent film!!!!!!! Flawless!!!!!!",
            "content": "This is the best Argentinian thriller ever made!! No doubt!! Its plot is perfect, very original, directing is great, acting is superb: Ricardo Darin and Gaston Pauls have played in a very good shape, and I really hope this film gets to be worldwide well known, because it deserves to be in everybody's mouth, as it is so spectacular. Cheers to all the people who worked on it and in it, and, please, watch this film, you'll not regret!!!!!",
            "review_date": "2001-10-04"
        },
        {
            "review_title": "One of the top 5 best Argentine movies!",
            "content": "First of all, I've to recognize that I didn't expect too much of this movie. Although the theatrical trailer, which was released in early june, presented the movie as a very funny one. But I thought that was an optical illusion... a good plot in an Argentine movie?? that can't be possible. I have to be sincere, the quality of these movies in the last years was improving, but anyway nobody was expecting it to be blockbuster. I saw the movie after 2 weeks of its release in theaters and when I walked out of the cinema, I couldn't believe what my eyes had just seen... It was very simple, the movie was great. It has such a good plot, with such good actors that the first thing you think once the movie is ended, is when you'll have the pleasure of seeing it again... I swear, if you don't know very much about Argentine movies, or the ones you've seen were very disappointing, this is your chance to see something different and to enjoy it from beginning to end.",
            "review_date": "2002-05-29"
        },
        {
            "review_title": "Tight plot and rich depiction of Buenos Aires - place and characters",
            "content": "This movie's plot is well-stitched together and it is worth watching just on that merit.  More interesting is its very rich picture of Buenos Aires, showing places rarely seen in cinema, and the best is the peculiarities of the characters, who (aside from being mostly small-time con artists) embody traits that are uniquely Buenos Aires. If you know the type, you'll admire the characterization; if you don't, you'll get a picture of certain Buenos Aires characters as nuanced as Woody Allen's portrayal of Manhattan types.",
            "review_date": "2002-06-01"
        },
        {
            "review_title": "What a great movie",
            "content": "About once a year I find a comedy which really makes me laugh, the rest just leaves me smiling, more or less. This movie is full of real fun and universal humor while not denying its Argentinean background(I am already fed up with Hollywood, so what I really can't stand are non US productions trying to be Hollywood-like; I believe that German cinema is so bad because its a cheap clone of Hollywood).If you can manage to watch it, don't miss the opportunity, you won't get bored for a single minute.Fabian, thank you for this wonderful movie and please, don't allow anybody to tempt you away from Buenos Aires, one of the greatest cities in the world!",
            "review_date": "2002-08-28"
        },
        {
            "review_title": "The most unexpected end",
            "content": "Nueve Reinas is a film that maintains to the spectator stuck to the chair from the beginning and until the surprising end that nobody hoped. The performances are brilliant and Ricardo Darín elaborates a paper that, if it were a film made by the great producers of Hollywood, without a doubt would make it deserving of a prize of the Academy. The argument seems simple but as it advances the film, it is become more complicated and different personages interlace themselves who give to history a dye him of irresistible. Every second, the public will ask itself who wants to deceive whom, and more than nothing how it will do it. Luckily, the end of Nueve Reinas will bury all the previous speculations and it will leave us to all with the open mouth.",
            "review_date": "2005-09-12"
        },
        {
            "review_title": "The Ulysses of con movies",
            "content": "The kind of very tight movie that spans no more than a day or two, where a set of characters grind through a \"quest\", be it a job a heist or a journey to find themselves. Through their journey they meet colorful side characters, make perilous encounters and fight destiny to accomplish ancient drama-tier endeavors. And Nine Queen hits all the marks of the genre, while being a masterful crime thriller.\nCon movies have this low profile action, very subtle, from Ocean's Eleven to Catch me if You Can, all the beauty lies in the cons, the tricks, \"los trucos\" as we hear very early in the film, during the amazing introduction.\nIn this kind of story, exposition is scarce, dropped here and there through dialogue. We see a cigarette lighting up another one. The man behind the smoke, mid-sized young man yet already balding, high brow, naive looks yet a hint of something underneath, walks into a grocery store. Inside, he notices another man, whom he tries to avoid, as he crouches to check some cans. He takes one, hides it behind his elbow, takes another one, stands up, puts the first one in his pocket and goes to check out. Establishes friendly contact with the cashier, has no change only a 50 bill, she agrees to break it anyways, he finally finds change in his pockets, puts it on the cash she gave him, counts it confusingly, then proposes to give her a 100 as he takes the loose bills. She got shortchanged and didn't even notice, but the other man did, as he poses as a policeman and begins to fake the arrest of the conman...\nCons outsmarting cons, outsmarting big wigs, outsmarting the game, outsmarting even fate, Nine Queens leads you from street hustle to forged antiques trafficking in an odyssey through Buenos Aires, one encounter at the time, in the manner of the classic Ulysses, birth act of this \"one day story\" genre that became a staple of postmodern storytelling.",
            "review_date": "2019-07-08"
        },
        {
            "review_title": "a masterpiece!",
            "content": "Watch out Tarantino! Here comes a movie directly from Argentina to show everybody the excellent quality of this kind of films! Suspense, and nice twists make this film really a masterpiece of the director Fabian Beilinsky (this is actually, his first film). Ricardo Darin and Gaston Pauls are two good actors who show they can really do such an excellent performance (when they want to). This nihilist film will leave you stuck to the chair from it's beginning 'till it's end. The plot is simply unique for the genre, which finally leads to a twisting unpredictable end. In conclusion: a must see! Don't miss it!",
            "review_date": "2001-06-08"
        },
        {
            "review_title": "\"Nueve reinas\" rocks!",
            "content": "It's hard to find movies from Argentina y my country. I went to see it because I read on the paper that it was really good. I took this for granted and went to the movie theatre. The movie is funny and the ending is so unpredictable, you will want to see it again. Very good option!",
            "review_date": "2001-07-30"
        },
        {
            "review_title": "A great film, but a Hollywood ending",
            "content": "I find it hard to believe they could have gotten a plot that grandiose off the ground in a single day, what with all the other players who were in on it. I think they changed from an otherwise flawless plot to wit...... 1. In the original ending, Vidal was the one who was sold either real or fake stamps and had to pay by cashier's check due to the difficulty of arranging large amounts of cash in a single day. So Vidal was not in on it, but in fact the source of a lot more than Marcos's $200,000. I can get along with the notion of having to pay with a bank check and also that both Juan and Marcos probably keep all their assets in easily accessible cash, explaining how the sale could go ahead in a day. Sandler's sister was not in on it either -- and her scene was great either way. 2. That they probably had an ending in which both Juan and Marcos were planning to con each other out of the entire amount, but before receiving the cash, the bank had failed, thereby leaving them both in an unhappy ending that nevertheless had a twist -- that the con was real and successful, but they lost the money due to unforeseen circumstances. The movie allowed me to suspend my disbelief right up to the ending - either one or the other was setting it up, but there remained the possibility that they were both having an extraordinary day and opportunity and just couldn't walk away in spite of all the red flags. But an unhappy ending is usually too somber for the people charged with trying to sell films to handle, so they probably re-wrote or re-shot the final scene, which encompasses almost all of the film's implausibilities, to wit.... + about 10 people seem to be happy to share Marcos's measly $200,000 among themselves, as if this was a con not to make any money, but to \"win one for the team.\" + Valeria is happy to share out most of the money she was suing Marcos for. If she was really appalled about being conned by her own brother out of the inheritance, would she then get involved with several experienced con-artists just to get him to lose her money to them? + Would they have been able in one day to fake a news article about a high-profile guy being deported in a high-profile way the next day? Or are we supposed to believe that someone was able to check into the hotel, impersonating Vidal all the way up to the moment he surrenders to the authorities? No, sorry, I think Vidal was originally a real buyer, not in on the con. I also don't think they originally had that \"polvo\" stuff about Marcos's sister (would you send your sister with the real stamps into his room and wait for your money all night? Not even if it was a legitimate sale and you were totally naive would you or anyone else do that, much less so a cynical con-man.) The movie's got all the stuff you want to enjoy the ride: characters, slang dialog, action, Buenos Aires, right up to that last quarter hour: Cut off that ending, leave most of the supporting actors out of the main con, and put in another 10 min in which each of Juan and Marcos tries a last minute and unsuccessful scam on the other, only to soon find that they'll never cash the check, and you've got the original story. But instead we got a really \"cute\" skin-grafted-on ending where the proper birthright is restored (literally), the \"guy gets the girl\" and viewers get a feel-good distinction between good and evil: the \"good\" con-artists restore cosmic harmony and triumph over the \"evil\" one who has crossed some kind of moral line and brought disrepute to their profession. Another great idea crashes on the rocks of the banal ending.",
            "review_date": "2005-01-22"
        },
        {
            "review_title": "Argentinian version of Mamet",
            "content": "All the comments equating this to Usual Suspects and Ocean's Eleven are interesting but off the mark.  This is simply Mamet's \"House of Games\" set in Argentina.  Worth a watch.  Excellently produced on a low budget. Beilinsky has a very bright future. 8/10",
            "review_date": "2003-01-25"
        },
        {
            "review_title": "Back to Basics",
            "content": "\"Nueve Reinas\" is a serious attempt to portrait argentine´s idosincracy. Bielinsky delivered an honest story by looking into his own background and making this film mainly for the argentine audience. It reminds me to my all-time favorite argentine movie \"Esperando la Carroza\" in the way local color is used to make the picture believable and familiar to us, even if they are such different films. The story is tight with no plot holes and the casting is outstanding with great acting, but what I liked the most was the special care that was put on dialogue. It helps the characters build and develope as the film goes by, which makes such a big difference comparing to the soap-opera dialogue we are used to in argentine films (e.g. Federico Lupi´s usual coursing \"LA PUTA MADRE QUE TE PARIÓ\" every time his script writers want to tell us that he is mad at someone). For those who still believe in argentine cinema I recommend this one as well as \"El Padre de la Novia\".",
            "review_date": "2002-02-04"
        },
        {
            "review_title": "One of the best mystery movies",
            "content": "This film will get your atencion from the first scene. The directing, acting, plot are excellent!!!!!! This movie is also known as Nine Queens. If you love the mystery and suspense movies or the good movies in general remember this title, and go to see it!!!!!!!",
            "review_date": "2002-02-18"
        },
        {
            "review_title": "Great plot, great acting, great story and a great twist - Makes the genre proud",
            "content": "If you are a fan of hustle/con films and TV shows (Hustle,Leverage,The Sting,Oceans Trilogy etc.) then this is perfect for you. The film starts with a small time grifter scamming a woman who's working the till in a convenience store. The trouble starts however when he tries to do it again on the woman who's working the next shift. When hes caught, an experienced con-man (who is quickly shown as being more willing to risk it) saves him from being handed to the police. And just like that a partnership is formed, things are going well and when a once in a lifetime opportunity seemingly falls into their laps they are quick to take up the offer to make thousands. All they have to do is take some fake stamps and sell them to a collector and he wont have time to check them properly so - its easy money. However everything starts going wrong for them and they find themselves facing the prospect of spending more to make less. Well paced suspense and drama leads to the killer ending where everything is turned upside down with the final twist.Cinema has always been well-suited to con-artist movies, perhaps because the medium itself is based on illusion, deception, and directorial sleight of hand. But Nine Queens (a huge hit in its native Argentina) excels itself and secures itself a spot next to the classics such as the sting and house of games.The films twists and turns never leave the viewer fully aware of whats going on but one things for sure nothing and nobody is quite what they seem.",
            "review_date": "2009-07-26"
        },
        {
            "review_title": "Very good story and superb acting",
            "content": "The story unfolds quickly and gains the involvement of the viewer from the first scene. Then the very credible acting of Pauls and Darin increases the expectations at every moment, making one wonder how their plans will result. Both are con artists, but of very different level. Darin's character is the one with higher ambition and more sophisticated methods, but is also the one whose life seems to be on the verge of total disaster. The tension derived from his messy life and desperate situation, makes him a candidate for any audacity. On the other hand, his just met partner (almost an apprentice), is tempted by the plan crafted by his more experienced colleague, but is always watching out not to be cheated himself. Distrust among the thieves is what mainly makes the movie so good. The end won't disappoint the viewer at all.",
            "review_date": "2005-10-19"
        },
        {
            "review_title": "takes a bit, but good",
            "content": "Well, I'll agree with the last person that its a little slow and there's a decidedly evil looking guy and the main character is rather on the nice-looking side. However.I (as well as the rest of my friends and so on) watched this first in a Spanish class. Of course, not typically very exciting. BUT! After a few periods we started getting really into it- we'd want SO much to see the movie. In the hallways we'd try to figure out what would happen from morning classes. When one class saw the end, the message that suddenly exploded was \"OH MY GOD THE ENDING IS SO COOL\"I agree- its very cool. The thing is, though, to really enjoy the movie, you can't think about it and try to figure things out. In my opinion, I like Oceans Eleven a whole lot, but this was about 10 times better.",
            "review_date": "2004-06-06"
        }
    ]
}