{
    "rating": 0.0,
    "release_date": "2000-07-28",
    "num_reviews": 194,
    "genres": [
        "Comedy",
        "Romance",
        "Sci-Fi"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "How much Eddie Murphy can you take?",
            "content": "How much one likes `The Nutty Professor II: The Klumps' depends on how much Eddie Murphy you can stand.  After grossing more than $125 million at the box office, I would have to conclude that moviegoers couldn't get enough. This sequel is a one-man show built around a character skit from the first movie.  Murphy plays eight different roles and gives a tour de force performance without the benefit of any story whatever.  I got the impression that the writers were superfluous anyway, since Murphy was obviously ad libbing about 90% of the time.The humor is lowbrow and delivers a good deal of physical comedy laced with sexual innuendo.  Though Murphy's caricatures are consistently droll, they rely too much on unflattering stereotypes of blacks.  The first dinner scene is a rehash of the dinner scene from the first film.  After that scene, most of the film is a repetition of the same tired sight gags.  Though Murphy's amusing electricity runs through every character, once the novelty wears off the film's appeal wears thin.Kudos to the makeup department for an outstanding job on Murphy's various alter egos.  Otherwise, the production of this film was nothing out of the ordinary.  Larry Miller also gets a very honorable mention as the obnoxious Dean Richmond, getting his just deserts at the hands of a giant hamster.This film has some laughs but not enough substance for a feature length movie.  I rated it a 6/10.  Add two or three points if you are an Eddie Murphy fan.",
            "review_date": "2001-01-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Doesn't Measure Up",
            "content": "This cannot measure up to the first film - the first with Eddie Murphy, that is, not the Jerry Lewis film from 1963. (Actually, this doesn't measure up to the Lewis film, either.)For me, the biggest disappointment was the \"family\" scenes in which Murphy plays almost all the roles including old ladies. In the first film, some of that was absolutely hilarious, the highlight of the movie. Here, that isn't the case. Also, some of the dialog is almost impossible to decipher. It's also too raunchy and this film should have been rated \"R.\" A PG-13 rating is ridiculous with all the emphasis on sex. I hate to see kids watch movies like this.Still, this had a decent share of funny moments. Also, to its credit, it is not as mean-spirited as the first film turned out to be. Still, the bad outweighs the good. It needed to be funnier, and less raunchy.",
            "review_date": "2006-11-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "could be much better",
            "content": "Frustrated by erratic and uncontrollable behavior at the hands of his troublesome alter ego, Professor Sherman Klump undergoes an experiment that separates his personality and allows the suave Buddy Love to become his own person. This time around they're battling each other for possession of invaluable scientific research which only further complicates matters in Sherman's personal life with colleague Jackson. Murphy, who's clearly having fun in his pull-out-all-the-stops portrayal of a horny grandmother, is as likable and energetic as he's ever been, but the script is awfully slim and throws out only a few genuinely funny ideas. A disappointment considering the impact of its predecessor. **",
            "review_date": "2002-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not as good as the first film, but a fairly amusing sequel nonetheless",
            "content": "I loved the first film, it was funny and touching, and I feel it is underrated. This sequel is inferior, but I have honestly seen much worse sequels than this. There are some things wrong, such as the weak plot, uneven script, a slow beginning and uneven direction, but it is very amusing regardless. Thanks to some great sight gags such as the Fountain of Youth and the giant sex-mad hamster, another brilliant performance from Eddie Murphy and Janet Jackson very effective at playing it straight as the long suffering girlfriend. I also liked how it was filmed, and the score was lovely.Overall, this is not a bad movie, not great, but not at all terrible.6/10 Bethany Cox",
            "review_date": "2010-04-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You have to be hating the world so much to love this movie !",
            "content": "This is hard to watch, hard to finish, and hard to remember.Too far is a word that this movie capably embodies. Review the number of characters Eddie Murphy plays: Sherman Klump, Buddy Love, Granny Klump, Mama Klump, Papa Klump, Young Papa Klump, Ernie Klump, and Lance Perkinscan. WAW, however needless to worn you that too far can be too wrong sometimes. In this manner, they went so far with the filthy material to an extent that turns the movie into a docudrama about the human body's middle, and its various secretions, or simply one of the most emetic movies ever made!Mainly the idea is good, \"The Fountain of Youth\", however the script just wanted to play dirty, with nothing but nauseating sex and endless farts in its mind. It is actually a milestone in the fart comedy (the Hollywood comedy once!). Among the many similar comedies nowadays, this one is a godfather and a record. Makes you think deeply; had decency become so old-fashioned? Or had Hollywood become really bankrupt and incredibly dirty in the same time?Since the start of the 1970s, movies such as (John Waters)'s used to be described as transgressing, with historically awful scenes, frankly nasty elements, done in mostly independent production. Since the end of the 1990s, mainstream Hollywood comedies seem to be feeding on none other than (Waters)'s inspirations. For instance the sexual humor, that this movie savors excessively, is beyond horrible. Just remember an anal sex between a man and a huge hamster, and an oral sex between 80 year old granny and her grandson's alter ego. So the historically awful scenes, the frankly nasty elements,.. are now being done with big budgets, famous stars, and sold as lovable time, for the PG-13 audience. See how we live an age where the major studios transgress us!Now I have to talk about the scene in which the hamster excretes, rather explodes with excrements, in the face of many dressy people at the press conference. While being one of the top nightmarish moments I have experienced with movies, not believing till now that it was verily made, I have to admit that it seduces a dark place in some of us, and even satisfies it. Sometimes you hate your world so much; hypocrisy, stupidity, corruption.. whatever the reason why, at that point, you want to do what the hamster did, everyone with their hated persons who deserve such a fate best (a machine gun full of.. you know what!). Therefore, the movie utilizes this desire, and realizes it. And instead of spreading values like indulgence or tolerance, it meets violence with violence.. smelly violence for that matter.But despite being dirty dream and cool moment for some, it's not a solution inasmuch as a problem. Just ask yourself: why the dream has to be dirty?, why the compensation has to be twisted?, and why the cinematic imagination has to be that disturbing? At any rate, feeding ourselves on filth can't be healthy, and using hamster's excrements for punishing the world - in this movie's fantasy or yours - isn't a right prescription for normal.Look how many family movies Murphy had to make right after this one: Shrek (2001), Dr. Dolittle 2 (2001), Daddy Day Care (2003), The Haunted Mansion (2003), Shrek 2 (2004), and Imagine That (2009). I can't precisely decide; was that a purgation? Or was it a way to woo his raising kids, trying to persuade them that he's a good movie star, or nice person? The thing that I know for sure is that - unfortunately - old habits die hard, because in no time he went, or went back, to make Norbit (2007)!In brief, I detest (Nutty Professor II: The Klumps). It's poor, unfunny, and too smelly to stand. It has a talent only in bringing up a shockingly ugly thing every minute, to top it by yet another shockingly ugly thing in the next minute; which is not my thing at all. My theory is that you have to be hating the world so much to love this movie altogether. As for me, I'll make every effort to find any atom of indulgence or tolerance inside of me, so I won't hate it.. more!PS: I loved Hollywood's sneering at this piece of work in Tropic Thunder (2008). Parodying it as \"The Fatties: Fart Two\" made me feel that lastly I'm not alone in this universe, and that Hollywood does have a conscience, well.. some sort of it anyway!",
            "review_date": "2011-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not very funny, and even less plot",
            "content": "I expected to see lots of variations of the humor that The Nutty Professor (the Murphy version) used in the classic scene of the Klumps at the dinner table. Instead, what little humor this sequel had split time with disgust as the movie went mostly for sexy granny jokes.The sad thing is, more fart humor would have been an *improvement.* This movie was boring. It was uninteresting. It missed numerous opportunities to have some fun. And it spent too much time showing off make-up and not enough time being entertaining.Perhaps most painful to watch was Eddie Murphy just being Eddie Murphy (as Buddy Love). I never understand why some actors/directors think that if a character screams real loud and makes a face, it's funny. It is especially not funny when it happens 2-3 times. In the first movie, Buddy Love was funny (if cruel), and his observations were right on target. In The Klumps, Love is like a grown version of that Home Alone kid, when he grabs his face and just yells at the camera. Uh, if you are done shouting now, can we move on?Janet Jackson was fluff. And I don't know what she has done with her chest, but it seems unusually huge here.I suppose it would be appropriate to say how well done the make up is as Murphy plays his half-dozen or so characters. Yes, he makes them seem like different people, at least superficially. But none of the characters are really there, you know? They each have little tag lines, and maybe a quirk, and those lines and that quirk are used to death. Take the granny. Yep, she likes sex. She is a sex machine. She wants every man. OK, uh, so? We've seen that 20 times. Can we get to something new?Overall, I feel sad to see the level Murphy's wit has been reduced to. He used to be more biting, more insightful and more, well, funny. Now he is a human cartoon. I gave this movie a 4.",
            "review_date": "2000-08-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny and great movie!!!",
            "content": "The Klumps gives the viewers a more in-depth look into their lives!!! Especially Sherman (The Nutty Professor) and his romance and struggles with keeping Buddy Love definitely gets in the way. GREAT, LAUGH OUT LOUD funny movie.",
            "review_date": "2019-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Basically I thought this film had some funny moments, Eddie Murphy is amazing, Janet looked great, but the story was weak, and overall it wasn't nearly as funny as the first.",
            "content": "Eddie Murphy once again slaps on the fat suit to play Sherman Klump. And Mama Klump, and Big Daddy Klump, and Grandma Klump, and Brother Klump, and Buddy Love (although without the fat suit on that one). Since the Klump dinner scene was easily the best scene in the original film, they decided to focus on the entire family in the sequel. And somehow got Janet Jackson to fall in love with Sherman. I wish I knew how that happened. Anyway, while the movie still focuses on Sherman and his quest for love and scientific goals (this time making people younger), the rest of the family gets involved in the story lines. And I thought that took away from the heart of the film. While it was fun to see all the Murphy characters, there needed to be a better story line for them, rather than a bad marriage. Although I will admit the horny Grandmother Klump story line was very funny. They should make a movie just about her next time. But I regress. The story line with Sherman and Buddy, about how Buddy was still inside Sherman, and Sherman managed to get him out, only to have Buddy come to life, and then Sherman is becoming more stupid by the minute and will go into a vegetable state unless he eats Buddy. It's all very cheesy. I mean come on, one tear from Janet near the end manages to bring Sherman back to life? It was all very corny.\nThis is not to say that there aren't funny scenes in the movie. Again, I thought the best scene was the entire Klump family going out to dinner and all the hi-jinks that ensue. And there were other funny moments scattered throughout the film, but not enough for me to really get into the movie and enjoy it. Basically it was a moment to moment film, not an overall enjoyment film. Eddie Murphy is amazing, and Martin Lawrence has got nothing on dressing up as a fat woman, but it's just not enough. The Klumps is something you can rent for a quiet evening at home.",
            "review_date": "2002-06-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You basically saw the funny stuff in the commercials.",
            "content": "Usually, you will have one are two funny scenes that are totally unexpected in a comedy that you don't even see a hint of in the commercial.  For this movie if you seen the barrage of previews for this commercial, then you have seen all the funniest scenes period.  By the time I saw this at the theater the scenes were very stale as they repeated the commercials so much it was pathetic.  This one has a bit more of the family in it, which was the highlight of the first one.  To bad they are not as funny in larger doses. The plot has Sherman somehow extracting the part of him that is Buddy Love. This form somehow comes to life on its own and starts wrecking havoc.  This was such an awful plot device you wonder why it is even there.  Why have Buddy Love return, is it just to show the audience that Eddie Murphy is actually in shape or what?  This movie also has to many scenes where it takes itself to seriously and gets to sappy.  What is the matter with just having a comedy without the tender moments?  Tender moments are not what I go to a comedy to see most of the time and this is a movie I was expecting none.  If you saw the many advertisements of this one, don't bother...you have seen all the funniest parts.  If you haven't seen much on it, you may want to give it a go.",
            "review_date": "2003-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stretches the Limits of PG-13 Rating!",
            "content": "This picture is a crass and obnoxious misfire from Murphy, primarily due to it's unbelievably undeserved PG-13 rating.  Laced with profanity, sexual innuendo and bathroom humor, you have to wonder if anyone from the ratings board was awake when this film was screened.  If they think this type of fare is appropriate for young teenagers, they must live on another planet. Of course, if it had been rated \"R\", perhaps my opinion would be different:  Murphy is often at his funniest when he's profane & irreverant, but that's for my adult sensibilities, not for those of pre-pubescent or (just barely) post-pubescent sensibilities.  Murphy should know better (and has shown better judgement with the \"Dr. DoLittle\" pics) than to pander this kind of junk to kids.All that notwithstanding, Murphy again essays multiple roles (under tons of Makeup) as nearly every member of the Klump family.  Murphy has already worn more makeup than Boris Karloff ever did in his whole lifetime, so he must enjoy it.  Tech credits are good as Murphy appears with Murphy, Murphy and Murphy in umpteen scenes, proving that split screen has been adequately exceeded with digital replacement.Half-witted plot has professor Klump developing a youth serum, while dealing with the personal inner demons of his \"Buddy Love\" personna (see first movie for more details).  Klump, constantly embarrased by subliminal impulses from his \"Buddy\" personna,  isolates & extracts the Buddy Love DNA, which later spills onto the laboratory pet dog, resulting in an incomprehensible reincarnation of Buddy in human form (but with latent doggy traits).  Buddy is intent on stealing the youth formula. and a race ensues to see who can complete the deal, with several dilemmas thrown in along the way.  Looks like the sreenwriters swiped a few ideas from early Star Trek episodes (see \"The Enemy Within\").Never mind what happens next.  Change the channel.  And definitely avoid the \"Uncensored Director's Cut\";  it just makes a bad movie worse.",
            "review_date": "2001-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Murphy gives it his best but there's only so much he can do with such dire writing",
            "content": "I could probably count on one hand how many movie sequels are anything other than a complete waste of everybody's time. The Nutty Professor II is no exception, and I would go as far as to say that the 2 minutes of outtakes are probably funnier than the rest of the film combined.The original was a definite success and featured one of Eddie Murphy's career-best performances. Unfortunately, the follow-up is little more than a lazy cash-grab that sucks the life out of the previously hilarious Klumps with a barrage of crass toilet humour. The storyline is absolutely atrocious and it culminates in a completely nonsensical ending. Murphy does just enough to make this film watchable but even he can't make up for such a bad script.If you enjoyed the first movie, you'd be better off re-watching it than putting yourself through this. Really lame stuff and a massive insult to its excellent predecessor.",
            "review_date": "2020-04-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "absolutely putrid, worst of the year",
            "content": "I'm usually not hard on bad movies. I either leave the theater or turn the channel, but here, I cannot just dismiss this. 4(!) screenwriters, 9(!!!) producers, and all they could turn out is this junk. OBVIOUSLY taking advantage of part 1's success, they churned out something I could see them saying \"Ah, it'll be good enough to make an easy 100 mil before bad word of mouth kills it\" about. A blatant rehashing of the first film, with endless farts, stupid sex talk, and a plot that actually takes itself seriously. It seems at times that they are really concerned with the story, as there are no jokes, just drama dealing with Murphy's (the Sherman version) discovery. It also bogs down the film with needless special effects, which really show where the money was spent, on f/x and not screenwriters. And it doesn't end there, they actually try to drum up sympathy for one of his characters that has erectile-dysfunction! The old man and his wife argue seriously about it! What is this? Trying to give a smarmy, raunch film an emotional dynamic? Comes off TERRIBLE here. And the Eddie that is identifiable, sans make-up, sadly reverts to his \"Beverly Hills Cop II\" act of SCREAMING his dialogue and laughing at the top of his lungs. That is what sunk \"Cop II\", him thinking that blasting his voice would get a laugh, it didn't there, and brought back annoying memories here. Maybe the worst element are the long, utterly humorless stretches where the family banter with each other. Nothing remotely funny to say, and others have wisely pointed out how inaudible the dialogue is sometimes. Murphy either slurs the words or adds some voice affectation this is totally indecipherable. Gets irritating real quick, as does seeing the same actor clutter the screen, scene after scene. Yeah, the make-up is great, but it's the same stuff we saw in part 1, and all the praise for a swiveling camera capturing one actor playing multiple characters was acheived 11 years ago in \"Back to the Future Part II\" (yes, I am partial to that series). As far as the other content, it SO points out how very, very much this is strictly aimed at kids, as they should enjoy countless farts, the word \"titties\" mentioned a bunch of times, and moronic moments such as a giant hamster shooting its fesces across a room. I didn't really enjoy the first film that much, but I'd take it any day over this. I haven't added to my worst of all time list in a while, but now, behind \"Three Ninjas\", \"Texas Chainsaw Massacre 2\", and \"Fierce Creatures\", comes the new number four: da, da, da, daaaa, \"Nutty Professor II\"! Ick, get it away from me.",
            "review_date": "2001-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A credit to Eddie Murphy's talent...",
            "content": "As I was rediscovering Eddie Murphy's \"Nutty Professor\" saga, the movies grew on me in a way I didn't expect. And realizing that the Klump family should be the first role for the actor to be remembered. I say 'should' because there's no way it will ever beat Axel Folley. But I'm not sure the 'Beverly Hills Cop' movies aged as well as the Klumps, even the first opus didn't leave me quite ecstatic, Murphy was good but in a rather thin plot. But you can count on the Klumps to fatten even the thinner plot, the family was the juiciest and certainly the best role for Eddie Murphy... because it's to be used in a plural form.Eddie Murphy has always been a versatile actor within his comedic range and his talent to embody multiple characters seemed to have reached a pinnacle with \"Coming to America\", but it wasn't until 1996 that he could transcend it by playing gag-guys who were not just one or two-scene wonders but fully developed characters with different personalities. It seems crazy but the suspension of disbelief does work, you know it's Eddie Murphy all right but there comes a point where you identify each member of the family and take them as separate persons.He can be a boorish father with a good heart, a loving Big Mama, a depraved grandma and a boorish big brother yet be believable in each of these disguises. But as Sherman Klump, Murphy exudes such likability and tenderness that you're almost sorry this guy doesn't exist while his alter-ego is the original version. Buddy Love embodies his primal role as a true villain (like the original with Jerry Lewis) and whenever he shows up, loudly and annoyingly, there's something infuriating about him and you just want Klump to punch him in the face. In a smart self-loathing way, Murphy makes his usual self the bad guy.And once you're in Klump territory, you know you're in there for laughs and good spirit... not so good spirit, you know you'll have to deal with a few poop jokes here and there, but it's weird how the sweetness cancels everything out and make you forgive the most shameful parts or the bits where the plot loses its way or goes too \"fart\" in the gross department. Take the character of Denise, played by Janet Jackson, as the plot goes on, she's given every possible and vulgar excuse to dump Sherman yet she stays, she forgives him. I love how patient she is with the man she loves, I like the way she's the one making the first movie, and I liked that she played a different character, it was a nice touch in regard of Jada Pinkett Smith who turned out to simply be a friend. And Sherman is the kind of man to make friends and to attract girls with his kindness, if only he knew the potential he had and how great he was. A lesser film would have made \"conquering her heart\" the big issue while it's more about getting back the \"brain\" and even more about conquering your self-esteem.Take the way Sherman Klump feels overshadowed by the loud and extraverted personality of Buddy Love. \"The Klumps\" takes the concept to the extreme by separating the two men and confronting one to another, this extraction didn't go without side effects, one dramatic: Buddy taking Sherman's intelligence and making us witness the slow process of his dumbing down and losing his number three asset (gentleness and honesty being the first) and a funnier one: Buddy's DNA mixed with a dog with funny consequences. There was something of Dr. Jekyll and Mr. Hyde in the original idea, we all live with an idealized perception of ourselves. I've always had height issues and blame my shyness and low self-esteem on what I regarded as a tragic case of 'arrested development'. The subsequent thought was \"if only I were tall\", I imagined myself more confident, more talkative, more mature etc. Maybe it's true, maybe I'm only projecting an idealization, maybe if I were another person, I would have hated myself, but how would I know?The first film's lesson was about appreciating who you are and learning to live with yourself. This still applies in \"The Klumps\" with the added notion that you have to try to improve a little bit, if you can, to trust yourself. The film explores marital insecurities between the parents as the father lost his job and suffers from impotence, and the mother feels abandoned and hides behind her shining smile an emotional vulnerability. Grandma Klump supplies the best and raunchiest jokes while the relationship between Dean Richmond (Larry Miller) and Klump provide some of the funniest bits of dialogues.Now, as a sequel? The inevitable question is: is it better than the first? I would say, it's as good, it carries as much depth and heart and fun as the first and works as a nice little continuation of the first, even more genuine since there was no third opus. This is one of Murphy's finest hours and I wish the film would be more recognized for its quality in terms of comedic acting, make-up and special effects. It's not just that the characters behave differently but they also look differently in a credible way, even the unexpected young version of Papa Klump.Apparently, the film is worth less than a five on IMDb, well, I think it deserves a second chance, it's better than that, it's funny, gentle and provide some touching emotional moments. And Murphy isn't just good when it comes to scream, dance, laugh or shout, the climactic moment in the train station almost had me choking, that's a credit to Eddie Murphy's talent.",
            "review_date": "2018-07-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unfunny, vulgar excuse for comedy",
            "content": "If you think a fart is the appropriate punchline for most jokes, this movie might be for you.  It makes Animal House look like upscale, sophisticated comedy.  But the worst thing about this movie is not its non-stop, juvenile, toilet-oriented attempts at humor, but that fact that it is NOT FUNNY.  It is just long and dumb.  I finally got so bored that 3/4 of the way through it I rewound it and took it back to Blockbuster.  This movie is not fit for adults or kids.",
            "review_date": "2001-03-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No mere stunt-- Murphy really delivers on 6 great roles. Great Flick!!!",
            "content": "Eddie Murphy is truly a genius. In his earlier movies he played, mostly, his smart-aleck, wiseguy playboy character, and that was often entertaining, and sometimes funny. In \"Coming to America\" back in the 80s, he played several roles, as did co-star Arsenio Hall. While that was funny, it came off more as a stunt. However, in the first \"Nutty Professor\" movie Murphy did, he demonstrated distinct, actual, likeable characters. I was truthfully surprised to find at the end of the movie during the credits that Murphy played all those women, and the effeminate white exercise guy. I really thought that most of those characters were separate, and very talented, actors!During this wonderful new \"Nutty Professor\" movie, Murphy propels the multi character thing a bit further. His portrayals are warm, real, appropriate, and moving.The humor is grand-- raunchy and slapstick. The plot is inconsequential. Oh, and Michael Jackson has never looked better. His skin has returned to a nice healthy beautiful brown, and he has discarded that hideous wig. In this movie he also appears a bit more masculine that usual, for him, but I liked the change!Anyway-- go see the movie, is great, and you'll like it. Oh-- do NOT take your young children to see it, much of the humor, while stupid and harmless (I loved it!) is nonetheless too sexual for kids.",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Completely laughable...",
            "content": "...but not in the way that the writers and directors had intended.  The largest, and funniest joke of all is that this movie ever got made in the first place, not to mention the fact that it grossed over 124 million at the box office without a single laugh-worthy scene.  From the first 10 minutes of the movie I could tell that this was going to be the type of movie that left me scratching my head saying \"I wasted $5 to rent this???\" I never even made it past the first hour of the film so it is possible that the movie got better, but I highly doubt it.  There is always something good to say about every movie, and here, it had to be the make up crew which transformed Eddie Murphy into 7 or 8 different characters.  This did nothing to redeem the fact that each of his characters was completely annoying and totally \"un-funny\" - I found myself straining to understand the unintelligible dialogue.   The plot line(and I use that term loosely) was so thin it was virtually invisible, the acting was embarrassing and the jokes were completely absent from the poorly written script. All in all....save your money.  I'm not sure what has happened to the movie industry's idea of \"funny\", but if this is the kind of comedy that can achieve box office success, us comedy lovers will spend less money at the box office and more time renting the old favourites from a video store near you.",
            "review_date": "2000-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Terrible",
            "content": "This was not a funny movie. Eddie Murphy who has starred in movies such as \"Coming To America\" and \"Beverly Hills Cop\" which were both hilarious, has struck out here in the poorest fashion possible.\"The Nutty Professor\" (1996) was okay because of the use of the Klump family who appeared throughout the movie every so often breaking it up with some humorous scenes. In \"The Klumps\", the family were over used and relied on for all the laughs, but instead just became sickening and in turn extremely boring. I understand using the Klump family was the idea for the sequel, it's just that it doesn't come close to working.",
            "review_date": "2000-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "LAUGHABLY MADE!",
            "content": "This film has to be the worst, if not one of, films ever made!  Not once did I laugh at this attempt to be trash.  Sure, critics say that \"Eddie Murphy gives a rousing performance\", but what about the film as a whole?  Do they ever actually get into its core and speak on it?  Peter Segal hasn't yet grasped the gist of comedic timing.  After 'Tommy Boy', which I laughed my butt off on, this is a dissapointment to say the least.  Quoting from the intelligent character that Bruce Willis played in 'The Kid', Russ Duritz, if you like this movie, you're STOOOPID.",
            "review_date": "2000-08-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "OH COME ON people I found this film to be the most hilarious sequel to a very funny movie",
            "content": "OK so im a big fan of the loud-mouthed Eddie Murphy so it was no surprise that The Nutty Professor got a sequel in 2000. This time around Sherman Klumps(Eddie Murphy) has a new love interest called Denise Gaynes played by Janet Jackson in her film debut)who are planning to get married(OK now this is weird cause I thought he was in love with Mrs Pretty aka Jada Pinkett Smith from the first movie,so why is he in love with Janet Jackson now and how did he propose to her oh well at least the very beginning was a flashback/nightmare with Buddy Love returning).Of course Sherman starts acting strange as he back answers people,and discovers that Buddy Love (again Eddie Murphy) is taking over and Sherman decides to experiment again on himself to get rid of him forever,but there is a catch because if he gets rid of him then he will suffer memory loss and become a vegetable. But when Buddy Love's DNA mixes with a hair from a hound dog he comes to life and wrecks Sherman's new formula.Meanwhile Klumps father Mr Klump(Murphy again)wants to be young so when he finds out that his son is hiding a slim potion at the garage he turns into a 1970s disco diva idiot.Yes the fart jokes are back and this movie isn't really original as its the same scenario as the 1st one but for some strange reason I found myself laughing so hard at one particular scene involving the Grandmother(Murphy again OH COME ON why does he have to play bloody 7 parts ANYWAY for eh!?!)showing off some cleavage and dotting after Buddy Love in a meadow and her cleavage is bouncing up and down.Overall again im giving it a 6 out of 10 cause YES it is so stupid but I found it laughable.",
            "review_date": "2013-06-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A NICE SEQUEL & ALWAYS A JOY TO SPEND TIME WITH THE KLUMP FAMILY",
            "content": "I have always loved the First Nutty Professor film & it's one of my most watched films ever & one of my all time favourite movies & i do really like it's sweet & silly sequel.It's always a joy to spend time with the funny & lovable KLUMP family & here in this slightly sillier sequel we get a movie based around the family this time!!!\nEddie Murphy is again a comic genius as he creates each memorable performance into a proper character that you just love. Here lovable & brilliant Sherman Klump has found a new love in fellow teacher, Denise played by Janet Jackson who is not as good as Jada Pinkett Smith from the first film but she's ok & it's a completely different role, Sherman also has created a new youth serum that can turn people young again but he's also dealing with the trauma of his alter ego Buddy Love, who still haunts him & who will eventually return. That's the basic story but we get lots more hilarious scenes with the Klump family & lots of nice special effects & a nice feelgood & slapstick tone. It's nice that the very funny Larry Miller returns as Dean Richmond as i loved him in the first film & Buddy Love is just as crazy & manic as he was in the first film but this sequel is much more over-the-top in a way & very silly but still in a harmless fun way, it's not as great as the 90's Classic but it's still a great sequel & it's ALWAYS nice to see Sherman Klump back on screen. In this sequel Sherman's Dad nearly steals the show as he's hilarious here & does some great stuff here & really rocks his scenes!!!I personally think that The Nutty Professor (1996) is Eddie Murphy's best film ever, it's a Comedy MASTERPIECE!!!\n\"The Klumps\" is still a very funny & very good, well made Sequel that's cheerful, colourful & Happy.",
            "review_date": "2020-03-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Over complicated toilet comedy",
            "content": "The story picks up with Professor Sherman Klump working on a youth serum in his lab. However he is still plagued by Buddy Love's voice in his head and is trying to develop a relationship with Denise (Janet Jackson). He decides to remove the gene that \"is\" Buddy Love however this not only causes his brain cells to die off but also releases Buddy back into the world. With a drug company offering $150,000000 for proof of the youth serum, Buddy plans to get hold of the only serum available.This is a sequel to the Nutty Professor and has the promise to be better because it has a greater focus on one of the funniest elements of the first film - the Klump family (all played by Murphy). However it isn't as good as the first one by a long shot, mainly because it tries to hard to set up as many jokes as possible. For example Buddy Love can't just be recreated - he's mixed with a dog to set up later jokes. It just seems like there's too much going on.Unfortunately this desire to cram as much in as possible takes away from the comedy. Where the family were hilarious in small doses in the first film, here they are given too much story, too much detail for most of the jokes too work. Even the granny is less funny because she is stretched so thin. The plot is even more trivial than in the first film, but with more strands to it and less laughs it is more noticeable. This takes the comedy of the first (which was never Noel Coward) and makes it even grosser - basically if you find the idea of a giant hamster performing anal sex on a man funny then you'll probably love this.There are plenty of funny bits (the Cape Fear spoof, some of the family segments) but the amount of plot they tried to cram in really kills the comedy. On the whole though you feel that this misses most of the potential jokes rather than hits them. Eddie Murphy is great in all his roles (although Love and Granny both seem more over the top and forced), Miller is funny as the unfortunate Dean but Janet Jackson is a real weak link as the love interest. It makes you realise how good (and sexy) Jada Pinkett was in the first movie.This had the potential to be funny - by merely repeating the first film with a slightly different plot. But by making the comedy more gross-out and trying to make all the supporting characters into joint leads this is nowhere near as funny as you want it to be.",
            "review_date": "2001-11-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eddie Murphy - you suck!",
            "content": "I can't really explain fully how bad this film is without using obscene profanity. the first one was bad enough but the sequel -  I can only use the words of Janice from 'friends' OH MY GOD! i saw this film in German and I was horrified, it's probably a lot worse when you can actually hear that idiot Eddie Murphy's annoying voice. He can't seem to grasp the fact that there are other ways of making people laugh without showing a giant hamster butt screwing a random guy. Janet Jackson didn't help much by co-starring in this insult to the word film. The script was awful, the acting was terrible and by the end of the film, all I could hear in the cinema was moans and groans from the rest of the audience who obviously agreed with my judgment. Nice try Eddie but I think you peaked a long time ago. Go back to Brooklyn because you suck.",
            "review_date": "2000-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Back for another explosive funny round, Klump style",
            "content": "I must say this was a funny night at the movies, and for a sequel, this almost matched the original, but there was a lot of fun moments here, but this had more meat to it, than the predecessor. What I also appreciated was another fun family moment, around the dining table, here it's at a sizzler type place. It cracked me up, even in it's starting where we see silhouettes of the Klumps, about to do damage at this popular eatery, the fat's boy's mouth a human garbage disposal, and dispenser for soft serve. Grandma Klump was totally hysterical in the stripping scene. We spend more time around The Klumps, this time around, Father Klump's line to his son, \"Family's important\" was a line I never forget. We have the addition of Janet Jackson, who's turns in not a half bad performance, and is credited with a finale song, I liked. Sherman's getting ready for the big day, as to marry Janet, but his alter ego, that annoying Buddy Love has returned. Sherman letting his thoughts pour out to his shrink, is a face from the past, whose been stereo typed in these roles. Buddy has corrupted a potion of Sherman's that decreases intelligence, where Sherman's is quickly dropping IQ which really made matters interesting story wise. I'd almost go with 2 over 1, as like I said there's so much more here to offer. But don't forget such classically side splitting sections from the 1'st like Buddy's Love retaliation against, that stinker of a comic played brilliantly by Chappelle.",
            "review_date": "2014-10-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Almost as Good as the Original",
            "content": "Eddie Murphy proves it time and time again that he knows comedy and he always goes the extra mile to be funny by playing half the cast himself. Reprising all of the first movie's characters and even much of the formula with body noises, hallucinations and jokes intact, the sequel actually has very little to tell it apart from the first other than the wonderful presence of Janet Jackson. Far sexier than Jada, she returns to her acting roots and even sings one of the songs in the soundtrack. Standing out of Eddie's way to let him do his thing, she provides the movie much of it's charm and virtue as Eddie provides the laughs and the imagination. Fresh from his failed series, John Ales joins Larry Miller into re-creating the same old stereotypes they already created but with Eddie providing much of the laughs, there's not much room for them to flesh out their roles. Still, there's enough new stuff here to make this sequel worth a look.",
            "review_date": "2001-01-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Murphy has come further than he ever has before, but...",
            "content": "Title: Nutty Professor II, The: The KlumpsRating: **1/2 (out of 4)Review:  I've never been a die-hard Eddie Murphy fan, but that's  of course not to say that he isn't funny or endearing, either.  TRADING PLACES has always been my favorite Murphy movie, with the original BEVERLY HILLS COP a close second.  He's a funny guy, and he has come further than he ever has had before with NUTTY II.  The original 1996 film was both funny and enjoyable, if having the distinction of having occasional unnecessary bathroom humor.  NUTTY II, however, is taken to extremes with the bathroom humor, everywhere from Grandma Klump giving Buddy Love oral sex in a hot tub to a hamster growing to epic proportions giving anal sex to Klump's boss, this film revels in bad taste way too much.  Is the film funny?  Sure it is, and it would have been a lot funnier if not for all the sickenening humor that we've seen dozens of times before (I don't blame Murphy particularly for this, considering the script was co-written by the guys who wrote AMERICAN PIE, and directed by Peter Segal, who has had his fair share of films with the same type of humor).  They don't make the sick humor at least clever, which is the problem.  THERE'S SOMETHING ABOUT MARY and BASEKETBALL made their bathroom humor clever, but  NUTTY II doesn't.Murphy fans are sure to love this, though, because I was telling the truth before about him coming further than he ever has before.  Playing no less than 8 roles (this might be some kind of record), his main character is Sherman Klump, a charmingly overweight professor who, in the original wanted to get rid of all the weight and became a stud in Buddy Love to make a beautiful co-ed (Jada Pinkett, whose missing prescence in the sequel is annoyingly unexplained) and eventually learns in the end that you should be yourself and that personality is way more important about looks.  In the sequel, he can't shake off the DNA that Buddy has left inside of him, so he decides to attempt to get rid of it, but Buddy eventually (and predictably) regenerates himself with a new thing on his mind.  Sherman, apparantly, has discovered the fountain of youth, and now Buddy is going to stop him and take the invention to his own credit. This film, apart from the original, focuses more on Sherman's family, right down to their gluttonous eating habits to their sexual fantasies. That's basically the whole plot in a nutshell.  As I've said before, Murphy is terrific, and he's well worth watching in his eight roles, but this film will turn off a lot of viewers because all the sick humor, which I must say is more silly than funny, yet you find yourself for some reason still laughing to it (or rather, at it).  Janet Jackson, as Eddie's love interest here, is OK, but she seems to be more important to the audience (any audience, not just the African-American audience) as a male fantasy figure than an actress.  Overall, I'm looking at this film as another one to add to Murphy's list of commercial successes that is funny enough to make him a respectable comedian, but for once I want him to go more towards not grossing us out and finding a concept to appeal to anyone and everyone.",
            "review_date": "2000-08-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Vulgar sequel for a great family film",
            "content": "I expected to see lots of variations of the humor that The Nutty Professor (the Murphy version) used in the classic scene of the Klumps at the dinner table. Instead, what little humor this sequel had split time with disgust as the movie went mostly for sexy granny jokes.The sad thing is, more fart humor would have been an *improvement.* This movie was boring. It was uninteresting. It missed numerous opportunities to have some fun. And it spent too much time showing off make-up and not enough time being entertaining.Perhaps most painful to watch was Eddie Murphy just being Eddie Murphy (as Buddy Love). I never understand why some actors/directors think that if a character screams real loud and makes a face, it's funny. It is especially not funny when it happens 2-3 times. In the first movie, Buddy Love was funny (if cruel), and his observations were right on target. In The Klumps, Love is like a grown version of that Home Alone kid, when he grabs his face and just yells at the camera. Uh, if you are done shouting now, can we move on?Janet Jackson was fluff. She is a good singer, but her acting left much to be desired. And I don't know what she has done with her chest, but it seems unusually huge here. What happened to Carla from the first film? In truth, switching Jada Pinkett-Smith for Janet Jackson is like in 2000, we stopped using Pentium PC's (used in 1996, at time of the first film), and go back to use 486 PC's (used mostly in 1990, at Ms. Jackson's peak of her music career).I suppose it would be appropriate to say how well done the make up is as Murphy plays his half-dozen or so characters. Yes, he makes them seem like different people, at least superficially. But none of the characters are really there, you know? They each have little tag lines, and maybe a quirk, and those lines and that quirk are used to death. Take the granny. Yep, she likes sex. She is a sex machine. She wants every man. OK, uh, so? We've seen that 20 times. Can we get to something new? Baby Buddy Love ripping off the blouse of a woman to reveal her bra.Overall, I feel sad to see the level Murphy's wit has been reduced to. He used to be more biting, more insightful and more, well, funny. Now he is a human cartoon.P.S.: I recommend this movie if you're a die hard Eddie Murphy or Janet Jackson fan.",
            "review_date": "2017-05-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disgusting and unfunny",
            "content": "There is only one word that can be used to describe Nutty Professor 2, disgusting. This movie was filthy, every joke in it was about fat, flatulence or sex. And on top of that the jokes were not funny, they were just gross. Do I really want to hear about how long it takes for a 90 year old man to get an erection? NO!I like Eddie Murphy, and this movie shows off that he definatly has talent. The scenes where he plays just about everyone are very believable, you'll even forget that he's playing them all at times (except for the similar voices). Unfortunatly the jokes weren't any good so his talent in playing multiple charactors didn't really matter.Despite Eddie Murphy's fine acting skills, I really disliked this movie. I thought the humor was crude, rude and even insulting at times. The whole thing was just one sickining toilet joke after another. A word of warning to parents who want to control what their children watch, this movie should be rated R. There is no doubt in my mind that the only reason it wasn't rated R was because of Eddie Murphy's name on it. There isn't much swearing or anything like that but the humor is very inappropriate for younger children. It got so racy at times that even I was embarresed. So unless you're extremely immature and feel like spending an hour and a half hearing about the details of extremely old people having sex, than avoid this movie at all costs. I give Nutty Professor 2, 3 stars out of 10 because I thought it was better than What Lies Beneath which I gave 2 stars.",
            "review_date": "2000-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Terrible",
            "content": "Terrible excuse for a movie. The first Nutty proffesser had some amusing moments like Fat Murphy getting insulted at a club by stand up comedian Dave Chappell with insulting wisecracks and then getting him back later as thin Murphy with some even funnier wisecracks, and the scenes with Murphy and Ms. Purty. Ms. Purty wasn't even in this movie, and there was hardly even any mention of her. Instead, we got Janet Jackson, who proved to us she just needs to stick to singing. Janet Jackson's a great singer, but acting is a different thing. But the Klumps themselves, oh no. They were sort of funny in the first movie, but even then, the excessive use of fart jokes and colon jokes is just not for me. I sort of liked the joke in the first film about the huge, excessive amounts of food on the dinner table at the Klumps' house. But this movie had absolutely no funny moments with the Klumps at all. It was All constant fart and granny sex jokes from them, excessive yelling, and No funny jokes. They were also used five times as much in this film than in the first film. Less is more. A little of them go a long way. In the first film, there were other funny parts with just Murphy, and I liked the scenes with the dean in the first film who detested fat Murphy and kept giving him a hard time. But in this film, the dean has the most horrible, embarrassingly dreadful scene with a large hamster. And the noise the dean made while the huge hamster had his way with the dean was one of the most terrible, disturbing, embarrassing, horrible HORRIBLE experiences I ever had watching any film. Ever!",
            "review_date": "2016-03-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Major disappointment",
            "content": "No one was expecting much when Eddie Murphy remade the Jerry Lewis movie \"The Nutty Professor,\" so the touching, funny result was a surprise.  And it raised expectations for this sequel -- which is nearly a total disaster. All the wrong elements have been emphasized; we see ENTIRELY too much of the professor's family; the jokes are extremely crude and obvious throughout; instead of sympathizing with the characters, we're invited to regard them as grotesque and ludicrous.  A running gag centers on the impotence of Sherman's father (also Eddie Murphy, of course) and the horniness of his toothless grandmother (also Eddie Murphy, of course).   Sherman's mother (also Eddie Murphy, of course) does little other than clap her hands and moon over her brilliant son.  Sherman's brother (also Eddie Murphy, of course) is given nothing to do.  What's really surprising is that even Buddy Love (also Eddie Murphy, of course) appears so little, and has a different, less interesting personality; before he was a mean, dangerous egotist; now he's a silly, prankish egotist.  (There's one element about Buddy, regarding a dog, that's actually quite funny, and semi-original).As Sherman Klump, Murphy is occasionally quite moving, but this is rare here; instead, most of the time this sequel robs him of the most surprising and worthwhile aspect of the Nutty Professor the first Murphy time around: his dignity.  Even when -- never mind why -- Sherman starts losing the major source of his pride, his intelligence, the movie laughs at him.  This is a shamefully bad treatment of a good character.",
            "review_date": "2000-07-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Oh - go on. Let's all throw some custard pies...",
            "content": "Plot - dreadful Script - dire The film in general is of course terrible.But.... Im sorry, I laughed, and laughed alot. I probably need councilling or something, maybe ECT ? Possibly, but Klumps is funny. Eddie Murphy is an exceptionally talented man - no doubts. If for no other reason, see this one just to watch him go to work.Maybe one day he'll land a role like Alec Guiness in 'Kind Hearts and Coronets' (Barry Norman's favourite film btw)....which I probably need to go out and rent asap - by way of an antedote....",
            "review_date": "2001-10-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Viagra don't work on me no more. Been taking them like M&M's!\"",
            "content": "\"The Klumps\" is just as funny as the first Nutty Professor. One aspect of the movie I enjoyed was that Eddie Murphy broadened his portrayal of the Klump family (Which, if you're not aware, every family member except the boy are Murphy. His talent is unbelievable.) and gave them larger roles in the sequel. It's a lot dirtier than the first film. We learn a heck of a lot more about Granny. The nudity scene was hilarious. The plot is about the professor, who is about to get married but his bad self, Buddy Love, is acting up. When Buddy escapes, there are two professors running lose and the professor's got himself a problem. It has many hilarious moments, but is different than the original as it's unrated and has some naughty but absolutely hilarious moments.However, the movie isn't 100% perfect. Where it faulters is in terms of a decent story-line. It felt like a bit of a re-trip to the first movie with a similar plot. The film, though, is hilarious and will have you repeating lines for days after it, but my only recommendation is that you see it twice. The first time round, you are getting to grips with the story-line, and I have to admit, because I didn't catch all the jokes, I didn't find it that funny. But when you go back a second time, as you know the basic story-line (which is there - despite what I said earlier), you can listen in for the jokes, as they are quite hard to catch sometimes. Altogether, \"Nutty Professor 2: The Klumps\" is very good - in fact it is one of the best sequels that I have seen.Overall rating: 7 out of 10.",
            "review_date": "2016-08-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lighthearted Fare Ignited by Murphy's Inventive, Comedic Genius",
            "content": "Considering the fact that most sequels almost never live up to the original, Nutty Professor II does an good job of living up to the original in its humor.  Although this movie does have the now obligatory gross-out humor that has become a fad thanks to the Farrelly brothers, it doesn't assail the audience with it; it uses it sporadically, thankfully, because this is the lowest point of the film.Nutty Professor II: The Klumps brings back Eddie Murphy's sweet, likeable Professor Klump, who must somehow find a way to rid himself of his alter-ego Buddy Love, who threatens to ruin his relationship with beautiful fellow professor Jackson.  But when his experimental gene-removing procedure fails, Buddy is on the lose, while the side effect of the gene-tinkering has left Professor Klump with a slow brain-debilitating condition.Again, there are present some gross-out gags, but for the most part they are kept to a minimum.  While the story may be thin, it's not ultra-thin and it keeps the film moving along at a nice, brisk pace.  However, as we see Sherman slowly trying to keep his intelligence afloat in order to be loved by Jackson for his mind, a bit of the underlying theme of the first installment, that is, we should be happy and cared about for who we are, not who we aren't, comes through.  Murphy's character has found in Jackson someone who cares for who he is, and he'll be damned if he becomes someone else.Obviously, the centerpiece and shining component of the film is not the plot.  This is Murphy's show all the way, and his portrayal of eight unique, funny, and completely different characters in the film is, quite honestly, staggering.  It is very difficult to see each character as being played by Murphy: instead, each character is an individual creation with its own mannerisms, tics, and voice.  It's amazing to see Murphy play so many characters so well; again, one forgets he is seeing only one actor playing each character so hilariously funny.  If audiences thought Eddie Murphy's comedic flare was waning, this will certainly prove to them he is a genius at his craft.Surprisingly sweet and honest at times, Nutty II is a sequel that does what many sequels do not: it completely lives up to the first in its hilarious jokes, and packs in brilliant characterizations of the Klump family, thanks to magical makeup work and Murphy's brilliance.  While flatulence and scatological jokes sometimes litter the screen, it's definitely a lighthearted comedy that is actually quite disarming.7 out of 10",
            "review_date": "2000-11-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of Eddie Murphy's best part 2",
            "content": "I saw this film today, and I must say I liked what I saw.  It kept me in laughter for a long time afterward.  In the previews, I thought it gave the details all away.  Not true (and neither will I).  All I will say is that instead of Dr. Sherman Klump (played by Murphy in 1 out of 8 roles) being concerned with his weight like in part 1, this time he is starting to loose his mind, literally.  Very funny scenes, but also sweet performances by Eddie in 8 roles- (Sherman, Clesius (papa), Young Clesius, Mama, Granny and Ernie Klump, Lance Perkins and Buddy Love) and surprisingly Janet Jackson, who returns to the screen after a 7 year abscence.  My favorite Klump of course is Granny Klump, but some might think different.  One of the best comedies of the year.  A+",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Murphy's tour de force: Rick Baker",
            "content": "NUTTY PROFESSOR II : THE KLUMPS (2000) *** Eddie Murphy, Janet Jackson, Larry Miller, John Ales, Richard Gant, Anna Maria Horsford, Melinda McGraw, Jamal Mixon.  (Dir: Peter Segal) The sequel to the remake of the Jerry Lewis classic `The Nutty Professor', with Eddie Murphy multiplied to the power of 6 has tons of laughs and charm to spare. Murphy reprises his overweight and friendly college chemistry professor Sherman Klump and his entire brood as well as his alter ego, the diabolical Buddy Love this time with the kindly obese prof falling in love with his research assistant Denise Gaines (the voluptuous Jackson) and the discovery of a youth serum all the while battling with sustaining the maniacal id inside, Buddy Love, who eventually breaks free from his chubby trappings to wreak havoc on Klump by trying to beat him to the punch in pitching the miracle solvent to a prestigious pharmaceutical conglomerate for a wealthy sum for exclusive rights. But the real focus of attention is Sherman's calorically challenged brood, his perpetually bickering family including Mama, Papa, Ernie & Granny Klump, the latter being the scene stealer for the entire film's run.  While Sherman wrestles with his other side in his attempt to ask Denise to marry him, Buddy tries in vein to locate the chemical and to Sherman' s discovery realizes that the side effect of having Love out of his body is slowly making his intelligence drop.  It's a race to beat the clock to thwart his opposite from gaining any more leverage. Murphy is marvelous as all six (well ok seven if you include Papa Klump's temporary younger self after guzzling down the potent potable) of the Klump brood, each unique in personality, that you gradually get over the fact he's in fat suits and under layers of brilliant make-up by the legendary Oscar-winning Rick Baker (including an Academy Award from the first `Nutty').   Murphy has set the high standard for interacting with himself on so many levels its daunting but this veteran comic makes the best of it in a decathlon of laughs, albeit vulgar and of the gas-inducing variety.  But it is his Granny Klump who walks away with the picture exhibiting a no-holds bar for speaking her surprisingly agile mind (and scarily )her promiscuous sexuality still in gear, particularly her hilarious close encounter with Buddy (if you think of it, it's Murphy soul-kissing Murphy).  Perhaps the only run for her money in laughs is the too-close for comfort interaction between the college's dean (Miller returning as well) and a genetically enhanced giant hamster (you have to see it to believe it). The film obviously relishes in its bathroom humor but underneath it all the concept of family values doesn't ring hollow during the film's climax with the aid of Sherman's dad.  Heart is in the right place as well as the funny bone.",
            "review_date": "2004-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Even though it's a bad movie, I thought it was better than the first",
            "content": "OK, I admit the fart jokes are a little too much, and Janet does nothing but pretty much smile and look hot in the film. Eddie goes a little far with some jokes, but over all, I hate to admit but will, I did kind of in some sick way enjoyed the film. Maybe I just needed a good laugh and needed to enjoy myself. Sometimes I think you need to let go and have some fun, or maybe I was just touched by the ending. :) But I would recommend this if you had fun with the first film or even didn't. Again, the jokes are stupid and the story is cheesy, but I think we should all just have a good time with this nutty professor once again.5/10",
            "review_date": "2006-02-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "strong talent wasted on lavatory humor",
            "content": "Nobody watching `Nutty Professor II:  The Klumps' could ever doubt either Eddie Murphy's extraordinary talent for comic impersonation nor the ingenious skill of the special effects team that has managed to bring the actor's many characters to fruition on film.  The utterly seamless merging of all Murphy's personas into a single shot is indeed something wondrous to behold.  Unfortunately, no amount of acting or technical expertise can compensate for a weak script - for a comedy is, after all, only as good as its writing.  In the case of `NP II,' the writing leaves a great deal to be desired.In many ways, the film's greatest strength turns out, ultimately, to be its greatest weakness.  Murphy is so good at delineating and inhabiting his characters that it is quite understandable that the filmmakers would want to apportion virtually equal time to each and every one of them.  This turns out to be a problem.  For one thing, it manages to dilute the focus of the film's storyline quite frequently.  Time and again, we find the narrative wandering back and forth between unrelated situations.  Just as we become involved in the affairs of one character, we shift over to the quandaries of another.Still, this would be acceptable if the film at least managed to be funny. It does offer a few laughs along the way, but the film's script rarely rises above the waistline in its humor.  If a joke doesn't deal with a specific body part (and we're not talking about hands, feet and noses here), it probably deals with a bodily function either sexual or scatological in nature.  I have no personal objection to dirty jokes, but when an entire film consists of nothing BUT such jokes, the whole enterprise ultimately becomes tasteless, tedious and unpleasant.  Take heed if you plan on watching this film with your young children.In terms of acting, Murphy proves once again his phenomenal ability to create characters who are offbeat, individualized and likable.  What a shame that the filmmakers were not able to craft a vehicle commensurate with his talent.",
            "review_date": "2001-09-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ah Nuts.",
            "content": "Eddie Murphy returns and plays numerous roles once again thanks to lots of latex and lots of makeup in this dull and ultimately empty sequel to 1996's \"The Nutty Professor\". While that film was far from a masterpiece, it had some good social messages and some nice moments mixed in with the dead time. This time those two things are gone and there is just dead time. As the professor Murphy has a new youth serum, but it quickly falls into the hands of alter ego Buddy Love and he wants to get away from the professor for good. Silly production all the way around. Amazing that so much time was spent in the makeup chair to produce so very little. 2 stars out of 5.",
            "review_date": "2003-01-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "They should show this to convicts as punishment!",
            "content": "This was the second worst movie I have ever seen (the first being Gone Fishin').  Was I watching the same movie as everyone else who reviewed this? It was disgusting, inane, predictable, and lacking in any type of humor (other than cheap fart gags).  Sure, Murphy's makeup is extraordinarily impressive, but, Eddie, send me a picture of your makeup art to admire. Don't make me sit through that again.  It was one of those movies that makes you look at your watch every five seconds.  I should have known that it would be bad when Eddie Murphy popped out of his own crotch in the first five minutes.  Sheesh!",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I Felt A Pain In My Chest...And I realised I Was Standing On My Ti*ties!!!",
            "content": "Let me be very clear about this one.This movie is Eddie and The Klumps all day long, he is the complete star of the film and all the best laughs come courtesy of The Klumps.Janet Jackson is pleasant to watch.Otherwise its a little lacking compared to the first movie.Note* The bloopers for both movies are also a fun watch :)",
            "review_date": "2021-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No redeeming feature",
            "content": "What a waste of time, talent and money!  There is no redeeming feature to this film which wastes the once funny talent of Eddie Murphy by spreading it thin over a plethora of characters, the Klumpp family, some of whom are almost unintelligible.  The plot line, what there is, is stretched so thin it almost vanishes in favour of the special effects.  Basically, Professor Klumpp makes a special potion which has unforeseen side effects, allowing Eddie Murphy to do a Jekyll & Hyde as the Professor and his alter ego. Janet Jackson sleepwalks her way through the resulting mess.",
            "review_date": "2000-11-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perverse",
            "content": "Eddie Murphy had to ruin this movie with his warp ideas about the men's anatomy. I mean enough is enough already. Get a life. The concept of Eddie Murphy playing all these characters was really great, but the storyline was so stupid you just have to know not to run to see anymore Eddie Murphy's movie.",
            "review_date": "2001-07-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Could have been good; mostly just plain sick (SPOILERS)",
            "content": "At the start of the movie, Professor Sherman Klump is getting married to Professor Denise Gaines. When the minister asks if there is any reason the two should not be wed, something happens that puts an end to the wedding.Sherman has developed a formula to make people and animals appear younger. A test on a dog shows that it works only temporarily.  Still, he gets a chance to make a presentation to a big company.  Meanwhile, Sherman has several problems:  he opens his mouth to speak, and the words he speaks are those of his alter ego Buddy Love, the nasty and conceited persona created in the first movie by another formula. Also, Denise has a job offer that will require her to move, and Sherman must find a way to make her stay.To get rid of Buddy, Sherman tries an experiment which goes completely wrong when the dog has an accident in the lab.  Buddy is on the loose!  And Sherman is literally losing his mind as a result of the experiment.   \nThis could have been an interesting and harmless live-action cartoon.  But there was way too much off color humor, and it went beyond the bounds of decency.  The scene where Sherman's family ate in a restaurant with an all-you-can-eat policy (BAD idea), for example.  I won't say how the restaurant got set on fire.  Just that the fire was put out quickly.Eddie Murphy did a good job playing many different characters.  None of the performances went beyond the cartoon level of acting, but he was entertaining nonetheless.  Or would have been.  Sherman was just about the only Murphy character who didn't have a potty mouth, and his grandmother was the worst of all.  The makeup, fat suits, and visual effects were wonderful. It really looked like three or four Murphy characters were in the room at once.I was all set to recommend this movie, but close to the finish it just went way off the deep end.SPOILERS:To start with, at the wedding, Buddy appeared in a way that I was amazed made it past network censors.  But it was Buddy and not ... something else. The wedding guests ran in fear.  Then Sherman woke up.I won't go into detail about all the terrible things the Klumps said.  Actually, their comments weren't the worst things in the movie.  In his presentation, Sherman used his formula on a hamster who turned into Mighty Joe Young, The Sequel (sort of like King Kong).  The hamster did something to Dean Richmond that I'd just as soon not describe.In addition to the horny hamster, the baby Buddy Love, which was created with a concentrated dose of the formula, turned out to be much more vile and obscene than his adult counterpart.  And he ran around the building naked, though at least he seemed to be missing one important body part.  The objective was to make him so young he would turn into liquid to be reunited with Sherman and give him his mind back.",
            "review_date": "2003-07-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Could Be The Worst Film Of The Year!",
            "content": "`Sometimes you feel like a nut, sometimes you don't.' Nutty Professor 1 had laughs, Nutty Professor 2: The Klumps don't. This sequel was not even close to being equal to the original. It was an unfunny boring stinker! You would really have to be nuts to go watch this one again! But I guess it comes down to that question again `to see or nut to see.' I will go with the latter! * Failure",
            "review_date": "2000-09-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Someone please stop that man!!!!",
            "content": "I probably don't understand anything about humor, but I really didn't find this movie funny. It's always the same, it's not only a complete copy of what Eddy Murphy did in the first movie, it's also a copy of many other comedies with typical toilet humor. Apparently it's incredibly hilarious to see someone lighting the curtains by farting in front of a candle (No, I'm really not making this up). If that is todays standard when it comes to humor, than I'll have to go trough life without ever laughing again.This time professor Klump hasn't created a potion to become thin, but it's something to make old people and animals young again. But of course his alter ego Buddy Love tries to make his work impossible and steals the potion as soon as it is finished.The only thing that I really admired in this movie was that Murphy played 8 different roles. That's probably not the easiest thing to do, so respect for that. But than again, those roles aren't that good either. They all look and act the same. They are all mumbling, farting and all love to eat a lot. How difficult can those roles be to play? No, someone should try to explain to Eddy Murphy that he once was funny and sometimes still is (as Donkey in Shrek for example), but that overall his movies really suck. I give it a 3/10.",
            "review_date": "2004-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "if u dont laugh at this, u must be really boring",
            "content": "This movie have so many jokes, from all kind, that if u dont ever laugh, you need to check yourself.",
            "review_date": "2021-09-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "As good as the first",
            "content": "This movie is really awesome, even though Jada Pinkett Smith's character from the first is not there anymore but is replaced by the beautiful Janet Jackson.  Sherman Klump is back and keeps getting sights of Buddy Love in him.  So Sherman takes some drink and gets buddy out on DNA.  Buddy gets some DNA and is now in his own form.  What Sherman doesn't know is that the drink had some horrible side effects.Overall the movie is definitely as good as the first and was extremely funny.  Rating 10 out of 10.",
            "review_date": "2002-05-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Oh my God, this was awful.",
            "content": "I don't usually walk out of movies, especially when I buy the ticket for only $5.25, but this was really bad. I could stand Down to You and Mystery Men, but this was really bad. Unless you like repetitive humour, humour that's not even that humourous nor clever, I wouldn't recommend this flick.",
            "review_date": "2000-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "juvenile and then a giant hamster",
            "content": "Professor Sherman Klump (Eddie Murphy) is stressed by his impending marriage to Denise (Janet Jackson) and his alter-ego Buddy Love's threatened reemergence. He creates a new fountain of youth formula but it quickly fails. He extracts Buddy Love but in the process of separation, his mind starts to deteriorate. Buddy Love tries to take his youth formula and he hides it at home. Family members find the serum and start using it for their own benefit.There is a charm with the original even in its juvenile nature. This one has no charms and wallows in juvenile humor. There are countless fart jokes. They are too many to count. It's weak humor but not irredeemable. That is until a giant hamster fires poop out of its butt. It's too stupid and not funny at all. It deteriorates from a bad sequel to a franchise killer. The story itself is clunky. There are multitudes of issues which leave this not salvageable.",
            "review_date": "2017-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Once was enough",
            "content": "When eddie Murphy came out with the NUTTY PROFESSOR those of us who HAD been Eddies fans but thought he'd slid down the slope of badness were relieved to see him back to being funny. Then Nutty Professor 2 came out and he slid back right down (at least til SHREK came out where he was again funny). i would like to say that Part 2 of the Nutty PROFESSOR is a re-hash of Part One, but that isnt true because ITS JUST NOT FUNNY. At all. I think I laughed ONCE! Because the other one was so funny this is just appaulingly bad. You cant figure out where they dropped the ball. And the fart jokes have just been done to death. Enough!",
            "review_date": "2004-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Klumps are back",
            "content": "The Nutty Professor remake allowed Eddie Murphy to target the family audience market and was a big box office success as well.With a revitalised Murphy going family friendly, a sequel was a given and this time the fat suit is in overdrive as Murphy plays eight roles.This time Sherman is convinced that Buddy is inside him and trying to take over his personality, at the same time he has found a formula to make people young and found love with a fellow professor (Janet Jackson). His efforts to extract Buddy from his DNA results in Buddy coming to life and going after the fountain of youth formula. There is a side effect that the extraction has made Sherman go stupid.There is a mixture of physical and lowbrow comedy with some sexual innuendos. This is Murphy's film though as he plays the various members of the Klumps both male and female as well as Buddy Love.Only Larry Miller can keep up with Murphy with the comedy as the slimy college Dean who gets attacked by a giant hamster.However the film is uneven, some of it feels like long sketches and some of the scenes seemed to be rehashed from the first film such as the dinner table scene.",
            "review_date": "2014-10-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Nutty Professor II: The Klumps",
            "content": "If you have seen the first film, then this sequel is a good return for the overweight, good hearted man and his loud-mouthed arrogant alter ego, but in terms of some story, not perfect. Basically Professor Sherman Klump (Eddie Murphy) thought he got rid of Buddy Love forever, but his DNA still runs his system, and occasionally takes Sherman over, making him say horrible things. Sherman, after a while of putting up with it, finally decides to link a tube to his veins and extract Buddy out, a very dangerous, almost fatal operation. Not long after doing this, and Buddy is in a beaker, Sherman proposes to the girl he has long loved, Professor Denise Gaines (Janet Jackson), and she accepts. But Sherman's troubles have only just begun, when a hair of dog Buster's falls into Buddy's spilt DNA, and he generates into his own body, and Sherman meanwhile, because of the DNA extraction, is suffering loss of intelligence. The worst part of it is that he has to give a presentation about his youth formula, for $150m, and Buddy plans to steal it for the money. Also starring Larry Miller as Dean Richmond, John Ales as a less jumpy Jason, Bean's Richard Gant as Mr. Gaines, Anna Maria Horsford as Mrs. Gaines, Melinda McGraw as Leanne Guilford, Jamal Mixon as Ernie Klump, Jr. and Terminator's Earl Boen as Dr. Knoll. The difference with this sequel to the first film, it gives more opportunity for the other Klump members (all played by Murphy) to have their own bits. Anna 'Mama' Klump wants more passion from Cletus 'Papa' Klump, he nicks Sherman's youth formula and fails to impress Anna, Ida Mae 'Granny' Klump has a moment of falling for Buddy, taking off her clothes, and snogging him, and Ernie Klump, Sr. just appears once in a while snickering, mumbling and making a tit of himself. Again, not a lot of great story parts, but still great fun with great make up and special effects, including a giant hamster! Good!",
            "review_date": "2005-09-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I didn't expect much, I got even less. But the makeup is great!!",
            "content": "Free DVD rental from my local county library, I watched \"The Klumps\" last night.  Shortened a little by skipping a couple of chapters in the middle. I enjoyed the scenes where all the Klumps were together, it still is amazing to realize that Eddie Murphy in different makeup plays all the parts. The extras on the DVD, showing the makeup process and aspects of the overall \"making of\" I found more interesting than the movie itself. Although there are a number of funny scenes, but for my liking just too much 'bathroom' humor.I was pleasantly surprised at what a good actress Janet Jackson is, playing a genetics professor. In an early scene she is lecturing, and her delivery of highly technical lines sounded authentic. I contrast this with what Denise Richards did as a scientist in her James Bond role, where her lines were absolutely, totally unbelievable.  Hats off to Janet Jackson!!",
            "review_date": "2003-04-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Movie",
            "content": "Such a wonderful, funny, loving movie and the FACT THAT EDDIE MURPHY PLAYS MOST OF THE CHARACTERS!!!!",
            "review_date": "2019-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Comparable to NP1",
            "content": "Very similar to humor and storyline of the first Nutty Professor. A few funny moments but overall not that great.",
            "review_date": "2021-09-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eddie, What Are You Doing?",
            "content": "I don't want to say that as much as I loved \"Nutty Professor\" I hated \"The Klumps\" because it's not that drastic. I loved \"Nutty Professor.\" I think I loved it even more than \"Coming to America\" or anything else Eddie Murphy did. \"The Klumps,\" however, was bad. It wasn't lets-start-a-riot bad, but it was My-God-Eddie-what-are-you-doing-bad. What's worse is that this seemed to be the beginning of the end. I know some of you reading will say that it started with \"Holy Man,\" but I happened to like both Doctor Dolittles. \"The Klumps\" was more crass, more slapstick, and less funny. Those are not the ingredients for a successful movie, let alone a successful sequel.",
            "review_date": "2021-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Please make the pain stop",
            "content": "After the unfunny and in general uninteresting first, this, as the title suggests, focuses on the family. You know, the most obnoxious and stupid aspect in a movie entirely built on the two. As expected, it does not turn out well. This is nastier, louder, dumber and every other time they thought they had a punchline, they repeated it excessively. The Klumps have one-note personalities, and the fact that their flat and stereotypical characters in no way have enough dimensions to be the focus of an entire feature is evident in the fact that this is also about Sherman, whose job and relationship with the attractive female lead is threatened by the actions of Buddy, whom he cannot control. Wait... that's the plot of the original! Well, Pinkett-Smith was smart and did not reprise her role(I'd personally like to think that she channeled her hubby and answered the makers of this mess with a big ol' heartfelt \"aw, hell no!\"), so they got Janet Jackson and her breasts instead, and writing Jada off with a single \"explanatory\" line. Plus, Mr. Love gets a body of his own, and... get this... he behaves in a dog-like manner! Isn't that hilarious? No, it isn't, but it's about as good as it gets here. Common sense goes out the window to make way for more \"jokes\" and gags. The effects are better, though they push them way too far. There are no genuine laughs to be found here. The ethical ramifications are mentioned and not explored. Production is standard. Even if you liked the 1996 flick, you probably won't enjoy this; go ahead and ask people who have watched both. There is crude and sexual material in this. I recommend this only to those who refuse to miss it. 3/10",
            "review_date": "2009-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Too much Klumps & tasteless jokes and not enough Sherman & Buddy Love",
            "content": "Released in 2000 and directed by Peter Segal, \"Nutty Professor II: The Klumps\" brings back Eddie Murphy as Sherman Klump, grossly overweight professor with a good heart, who's dating a new girl (Janet Jackson) and still battling with his thin, charismatic alter ego, Buddy Love (also Murphy), although the way Buddy manifests is different. Larry Miller is on hand as the dean of the university while Melinda McGraw plays a representative of a company interested in purchasing a youth-giving potion. Like the first movie, Murphy plays all the adult Klump members (Granny, Mama, Papa and Ernie).Janet is a superb replacement for Jada Pinkett Smith as Sherman's girlfriend and, like the first film, Sherman is a sympathetic character while Buddy Love is charismatic. I might be in the minority, but I wasn't a fan of the two Klump dinner table scenes in the 1996 movie, which explains why I feel this sequel is a drop in quality: There are too many tasteless scenes with the Klumps – not to mention unnecessarily crude scenes in general – and not enough with the best characters, Sherman and Buddy Love. Buddy in particular is mysteriously absent much of the time, which is inexplicable in that he was one of the comedic highlights of the earlier movie.The way Eddie plays all the different characters is genius and well-executed, but the film's simply not as funny as the first one, unless you favor flatulence jokes and vulgar humor in general. The first movie had both, but there's more of it here and less of what was good.The movie runs 106 minutes and was shot mostly in the Los Angeles area, but also Moore's Crossroads, South Carolina (presumably the opening church scene).GRADE: C",
            "review_date": "2016-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nutty Professor II: The Awfuls",
            "content": "I enjoyed the first Nutty Professor as it was something different and new. However, \"The Klumps\" is absolutely awful with wooden performances, especially from Jackson, which really doesn't reflect the hard work from Murphy and the rest of the team.  Fair enough the special effects are brilliant but that's the only good thing you can say.  I went to see this at the cinema with my friend and we both walked out which I have always said I would never do.  Very, very bad film which you don't care what the outcome is.  YAAAWWNNN!!!!",
            "review_date": "2001-09-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Klumped Full of Crap.",
            "content": "The Nutty Professor 2: The Klumps (2000): Dir: Peter Segal / Cast: Eddie Murphy, Janet Jackson, Larry Miller, John Ales, Wanda Sykes: Sequel with ideas and innovation that, despite its efforts, never involves viewers. It regards unity or family starring Eddie Murphy who returns as professor Sherman Klump. Janet Jackson is introduced as his fiancé but a gene of egotistical Buddy Love still exists thus preventing Sherman from having total control. Plot regards a youth formula that Buddy wishes to obtain. They have tested it successfully on a dog but a hair drifts into it thus leaving Buddy contracting symptoms. Excellent makeup with a giant hamster poising an attack against police. Directed by Peter Segal who has directed comedy sequels before with the hilarious The Naked Gun 33 1/3: The Final Insult. Murphy carries the film conveying Sherman and Buddy on screen at once. He also portrays members of the Klump family but the youthful finale lacks emotional payoff. Jackson is no Jada Pinkett. In fact, one could guess that Pinkett suspected that this would not live up to the first film. Larry Miller and John Ales reprise their roles as dean and student associate but they are merely appearances. Special effects are creative and inventive but the youth formula needs explanation that prevents this film from becoming involving and merely settling for big budget chaos. Score: 4 ½ / 10",
            "review_date": "2015-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Does Cletus know i'm strapped?.....",
            "content": "Sherman Klump is getting married, and the family could not be more delighted for him. But Buddy Love, his alter-ego, is back and trying to make it on his own. Buddy keeps resurfacing in untimely outbursts, and threatening the professor's marriage plans to Denise. Utilising Denise's cutting edge DNA research, Sherman decides to rid himself of his nemesis, and his outbursts once and for all by extracting Buddy's DNA from his system. But Buddy bursts full bodied into Sherman's world and lays claim to the professor's invention, a revolutionary youth serum. Desperate to keep it from Buddy, Sherman hides the serum in the Klump family home, thinking it will be safe. But to get it, Buddy has to deal with the entire Klump family first....The first film was a return to form for Murphy, he put everything he had into that movie, and it was one of the most heartwarming movies of Murphys career.This in the other hand, is the Buddy Love to that movie. It's loud, crass, really over the top with the innuendo, and worst of all devoid of any laughs.I was looking forward to the family having dinner scene, but it was basically the same as the first, and everything that you liked about Sherman was taken away, thanks to his little outbursts every now and again.The first film had a great script and story, but this relies heavily on gross out humour and disgusting set pieces.This was the beginning of Murphys second decline, almost ten years after his first, and apart from Shrek, he still has to recover.It's his worst movie by miles, and i've seen Best Defence.",
            "review_date": "2013-06-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The writing and concepts felt rushed and not as funny or entertaining as the previous picture",
            "content": "Nutty Professor II: The Klumps (2000) is a movie in the DVD collection that I recently rewatched with my daughter on Netflix. The storyline for this follows our favorite professor as he tries to move on from the events of the last movie while dealing with the insecurities of his weight and his previous happiness as Buddy Love. He meets a new love interest and as things get serious he realizes that he still has side effects from the previous use of his product. Meanwhile out of nowhere Buddy has returned as a separate entity than Professor Klump further complicating matters. This movie is directed by Peter Segal (Naked Gun 33 1/3) and stars Eddie Murphy (Golden Child), Janet Jackson (Poetic Justice), Larry Miller (Pretty Woman), Richard Gant (Jason Goes to Hell), Wanda Sykes (Bad Moms) and Chris Elliott (Scary Movie 2). The storyline for this picture was absolutely dreadful compared to the first one. The writing and concepts felt rushed and not as funny or entertaining as the previous picture. I will say the opening buffet scene, granny scenes and the proposal were funny; but other than that, most of the other scenes seemed awkward. Murphy was still outstanding in this and did the best he could; but honestly, there wasn't much to see here. This is a very average addition to the genre that I'd score a 4.5-5/10.",
            "review_date": "2021-11-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rude, Crude Eddie Murphy Vehicle...",
            "content": "In 1996, a new kind of comedy was born. Using advanced, fake \"fat,\" filmmakers turned Eddie Murphy into a blob named Sherman Klump, of the Klump family; a band of rude, crude, obnoxious and extremely large pigs.\n \"The Nutty Professor 2: The Klumps,\" continues the story of Sherman Klump and his weight losing potion, which this time holds even \"smaller\" attributes in store for its consumer... I'll admit that the \"fat\" on Murphy is extremely convincing and repulsing, much like the Austin Powers character \"Fat B*s*a*d.\" Unfortunately, much to the effort of the film crew on \"The Klumps,\" this flop contains few laughs, and is more disgusting and repulsive than the all three \"Powers\" films combined (well, maybe not, but almost...) Eddie Murphy is losing his star status, and without Shrek, he might have already been in the gutter by now. But after making flops like \"Showtime\" (decent film, still a flop) and \"I Spy,\" Murphy will probably be eager for \"Shrek 2\" to come out. \"The Klumps\" is a horrid film, that stinks a mile away. Only watch if it's on cable, and you were a fan of the original, which I wasn't particularly... 1/5 stars-John Ulmer",
            "review_date": "2002-12-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Overall.....disappointing",
            "content": "Eddie Murphy was excellent portraying the different characters; that's actually what made me pay the $8.50 to see this movie in the first place. But after this movie, hardly ever again will i go to the movie theater to watch a comedy again.  The story in this movie is simply horrible.  Eddie Murphy's talent holds this movie together with his acting of the Klumps; but the story suffers miserably.  Overall, it's a disappointing sequel.",
            "review_date": "2000-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Goof and funny...",
            "content": "The comedy genre doesn't appeal to me, however Eddie Murphy's impeccable, dynamic and diverse performance is simply passionate, you can't help but admire the formidable work done, a fun, simple and captivating comedy, a cute sequel, where. Alto They are the familiars of the protagonists, all with perfect performance by Murphy...",
            "review_date": "2022-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "t was a bad movie, but it was fun to watch",
            "content": "It was a bad movie, but it was fun to watch. When I was a kid at my grandfather's house, I found the VHS and watched it.",
            "review_date": "2021-08-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eddie Murphy tries his Best, but it wasn't enough,",
            "content": "Nutty Professor II: The Klumps is a brutal movie with a very poorly written storyline, despite a great comedic cast. Eddie Murphy is very good in this movie and it's still very entertaining to see him portray so many different characters that are nothing like the other, but sadly it just dosen't work out like the first one did, it isn't as funny, it was very rare that I genuinely laughed during this. The storyline is ridiculous, the first one was as well, but it embraced that fact, however, with this it almost seems to think it's clever, using different science formulas to create substances and inventions that would never work in real life, the way in which Buddy Love comes back is stupid, I know these movies don't aim to be scientifically accurate, but this was just pure stupidity. I could tolerate the films dumb, far fetched storyline if it was a good comedy, but it's not at all, every joke is lame and, for the most part, really disgusting, it seemed to rely on being gross, even hard to watch at times, instead of trying to be funny. Murphy is a talented comedian, but he's not enough to recommend Nutty Professor II: the Klumps, better off avoided. Sherman Klump's upcoming product launch and love life are threatened by the return of Buddy Love, the ruder and louder side of him. Best Performance: Eddie Murphy",
            "review_date": "2015-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ruder & Cruder",
            "content": "Continuing my plan to watch every Eddie Murphy movie in order, I come to The Nutty Professor 2: The KlumpsPlot In A Paragraph: Buddy Love returns just as everything is going great for Sherman Klump.I didn't enjoy this at all. I loved the dinner table scene in the first movie, but a little goes a long way. It's too much here. The alleged humour is awfully unfunny. Ruder and cruder does not make it funnier. Considering how much I liked the first one, this, this is a huge disappointment.Nutty Professor 2 grossed $123 million at the domestic box office, to end the year the 16th highest grossing movie of the year.",
            "review_date": "2018-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent, hilarious sequel about respecting yourself which is sometimes crass",
            "content": "NUTTY PROFESSOR II: THE KLUMPS, in my opinion, is an excellent, hilarious sequel about respecting yourself which is sometimes crass. If you ask me, Klump (Eddie Murphy) was a very brilliant scientist despite the fact that he sometimes let Buddy (Eddie Murphy) get the best of him. When Buddy started acting like a dog, I laughed like a hyena. Also, I thought that Leanne (Melinda McGraw) was kind of snobby. In addition, I thought that Denise (Janet Jackson) was a very beautiful woman. Also, when Cletus (Eddie Murphy) used Klump's formula, I laughed really hard. You'll have to see the film if you want to know why. Before I wrap this up, I'd like to say that everything about this film was spectacular, especially the performances. Now, in conclusion, I highly recommend this excellent, hilarious sequel about respecting yourself which is sometimes crass to any Eddie Murphy fan who hasn't seen it.",
            "review_date": "2008-08-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Enough is Enough",
            "content": "First we see a remake of the original then we see this.... garbage. This movie was...was...there is no word to explain the level of badness. When I saw this movie half the theater got up and left within five seconds of the movie. When will Eddie Murphy learn he is not funny anymore, making movies like this, Dr. Dolittle 2, and That Pluto Nash garbage. If anyone watched this movie and liked it please tell me because your stupid and I would like to make fun of you.Rating: Zero Thumbs Up",
            "review_date": "2003-08-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Entertaining enough sequel has some genuine laughs but it is quite a mess.",
            "content": "Professor Sherman Klump (Eddie Murphy) has finally found his dream woman, her name is Denise Gaines (Janet Jackson). Which she's also a professor as well. But Sherman still feels his alter-ego Buddy Love (Played by Murphy) is waiting to get the worse of him. Sherman is working on a new formula that is trying to find the answer of the fountain of love. But the formula only works in a limited time only and Sherman is trying to find the missing ingredient to his DNA Cutting Edge work. If he does, he will finally get the money he needs for his research. But when Sherman can't trouble his alter-ego Buddy anymore, he decides to destroy the genes in his body to get rid of Buddy by injecting himself. Now the rest of Buddy Love is in a liquid goo. By destroying Buddy, it seems to work but Sherman is slowly losing his brain cells and losing his intelligence. Now Buddy finds himself back in human form with that got accidentally mixed with Dog DNA! Now Buddy tries to the steal the formula by stalking Sherman and his overbearing family (Nearly all played by Murphy as well).Directed by Peter Segal (Naked Gun 33 1/3:The Final Insult, Anger Management, The Longest Yard \"2005\") made an amusing enough sequel to the surprise box office hit of the 1996 remake. Murphy is just as brilliant playing six various characters in the movie and the make-up effects by six times Oscar-Winner:Rick Baker (Click, Coming to America, Ed Wood) are just as wonderful to look at. But Segal's wild energy and the often funny if messy screenplay by Barry W. Blaustein (Beyond the Mat, The Ringer), David Sheffield (Police Academy 2:The First Assignment, Boomering, The Honeymooners), Paul Weitz (About a Boy, American Pie, Down to Earth) and Chris Weitz (Antz, The Golden Compass) doesn't always pay off.The direction is a mess at times and the script, especially the wild humour is not always on target. But there's some good genuine laughs here and a few gross-out humour as well. While this sequel is a bit different from the 1996 picture, it doesn't quite match the quality of the first movie. Although Jackson is actually more charming as his love interest than Jada Pinkett Smith did in the 1996 version. Die-Hard fans of Murphy's work and Baker's wonderful make-up effects will certainly find some amusing here. It is certainly not the worst or best of Murphy's work but it's entertaining and far from boring. Worth a look. From a story by Steve Oedekerk (Ace Ventura 2:When Nature Calls, Nothing to Lose, Patch Adams), Blaustein and Sheffield. Unrated Version also available. (*** ½/*****).",
            "review_date": "2007-12-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Genetic extraction at its most devious!",
            "content": "\"Nutty Professor II: The Klumps\" is a nutty, wacky, funny, touching sequel to the 1996 film \"The Nutty Professor\", starring Eddie Murphy times seven, portraying virtually the entire Klump family! The family sequences in the first film created such an impact with audiences that it was decided that the sequel would focus much more on the Klump clan, resulting in some rather astonishing trick photography. Once again, the main character is the overweight, adorable, sweet-natured, brilliant genetics professor Sherman Klump, only this time around, his love interest is his colleague Prof. Denise Gaines (Janet Jackson). Reprising their roles from the first film are John Ales as Sherman's faithful student Jason, and Larry Miller as the pompous weenie Dean Richmond. The plot? Well, you'll just have to see it for yourselves.My favorite scenes from \"The Klumps\" include the following (DO NOT read any further if you have not yet seen this sequel). As Sherman rests by the fountain, Denise shows her deep love and concern for him when, upon discovering that he has lost almost all of his intelligence, she weeps and hugs him, promising that she will take care of him. When Sherman imagines himself as an astronaut, Papa Klump appears as Obi Wan Kanobe (spoofing \"Star Wars\") and instructs Sherman to use a \"force\" deep down inside him; Sherman does so by - what else? - farting! (I'm a sucker for toilet humor!) Grandma Klump really gets to shine in this movie as she gets horny with Sherman's arrogant alter ego Buddy Love. When Buddy accidentally drinks Sherman's youth formula and turns himself into goo, he winds up on a portly woman's butt and makes a wisecrack; the woman then turns around and slugs the guy behind her! Sherman tries to give his dad the Heimlich at a restaurant, causing Papa to fart and subsequently extinguish some nearby birthday candles, setting some curtains on fire. Sherman hires a Mariachi ensemble to serenade Denise on her balcony, but the presence of the evil Buddy inside the kindly Sherman (taking control of Sherman's thoughts and words) causes him to say and do certain things that abruptly end the serenade.\"Nutty Professor II: The Klumps\" is a brilliantly entertaining comedy directed by Peter Segal. I must admit that I watched this sequel before I had even seen the first film, and as a result, it was a bit overwhelming. Funnier than the first movie? I don't know. When watching this film, or ANY film, I always try to separate the character from the actor; in this case, I'm not sure how I personally feel about Eddie Murphy and Janet Jackson, but I highly admire Sherman Klump and Denise Gaines for their brilliance, decency, and sweetness. On a final note, Murphy is to be commended for his skills as a character actor in this film, portraying several men and women of various heights, postures, walks, voices, personalities, etc.",
            "review_date": "2009-01-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hilarious once again",
            "content": "I'm sorry to see many IMDb-users have not thought much of this excellent movie but then again, it's quite useless to argue what is funny and what is not. I just watched NP2 a second time and laughed my skinny ass off. Eddie's performance is CLASSIC and you totally forget that he's actually playing all of the family members. They're not Eddie anymore, they're the Klumps. I usually do not watch the \"How this movie was made\"-kind of extras, but this time I found myself making and exception and watching it made me appreciate Eddie's work even more. I knew it must've been difficultíssimo setting up those dinner scenes, but sheeeesh! Great work! There are too many classic moments in this film to mention....OK, I'll mention one: When the serum has reduced Buddy to a blob but still keeps on giving the passers-by hell. \"What the HELL are you looking at!?!?\" I hope they make a third one though I doubt it. Here's to yo fat ass, Sherman!",
            "review_date": "2005-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "And this is WHOSE idea of a family movie?",
            "content": "\"Nutty Professor II: The Klumps\" has most of the same virtues of the previous movie and all of its vices, with Eddie Murphy again on form as Professor Klump, his family, and his alter ego Buddy Love; there are also some genuinely funny and tender moments. But alas, the movie is again undercut by its crudity; for every warm scene, writers Barry W. Blaustein, David Sheffield, Chris Weitz and Paul Weitz add about three or four jokes about bodily functions, sex etc. which all but cancel out the movie's points about people having to be what they are for better or worse (a message which nonetheless somehow manages to come through in the end).Sweet though she is, Janet Jackson proves that she was the peak of her powers, acting-wise, when she was on \"Good Times\" (the only time she registers is singing) - Nikki Cox's cameo as a student is more adept than Janet's entire performance. And there is no way on Earth the movie's low point - the scene with the giant hamster, an \"inspired\" mix of bestiality and, let's face it, rape - would EVER have been included in the final cut had the victim been a woman (see also a not dissimilar joke in \"The Simpsons\" with Homer and a panda).As for the Klumps, they were an entertaining side joke in the previous film, but upgrading them for the sequel was a mistake, especially since only Mama and Papa Klump really have anything worthwhile to do; would you want your daughter (or son, or father, or mother, or anyone) to marry one? In the end, the movie's a tasteless disgrace; in the battle between sweetness and nausea, nausea wins. Come back \"Little House on the Prairie,\" all is forgiven!",
            "review_date": "2002-04-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The greatest Dr. Strangelove adaption!!",
            "content": "The funniest joke is when the hamster dumps on everyone!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Nutty Professor is back (and not too badly I might add)",
            "content": "Well, despite all the criticism (by others and me) this film can be enjoyed. Just turn your brains off, think it will be really crappy and stupid like Hot Shots 2 or Spy Hard. That's what I did and I enjoyed it (to a certain level). OK there are very stupid scenes in this one, but some really good ones too (the Armageddon dream sequence is hilarious). Plus the ending with the marriage and all is kind of sweet so my verdict is:\n7 out of 10",
            "review_date": "2001-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Delightful sequel",
            "content": "This is one of the rare sequels that is better than the original. Eddie goes all out playing most of the major cast members. I suppose some critics and viewers will get hung up on the \"poddy\" humor, but it is done so quickly that it doesn't really have time to be offensive.Underneath there is a nice story about what is really important in life. If the energy of this film can be maintain in a third film, I will be glad to attend. THE KLUMPS is good fast-paced, earthy fun.",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It sucks big time!",
            "content": "What an awful excuse for a movie. Has Eddie Murphy gotten so cheap that he won't hire other actors. He has no one to blame but himself for this travesty. No plot, no redeeming value, and very little fun. If he had hired a cast instead of doing it all himself this film MIGHT have been saved.",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nutty Professor II: The Original was Better(2000)",
            "content": "Like most Eddie Murphy sequels this one doesn't recapture the magic of the original movie. Which while was vulgar still had a heart but while this one has it's moments. One with with a hamster! The film itself is stupid! The performances are fantastic but the movie is stupid!2(**)out of 4(****)stars",
            "review_date": "2003-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A laugh riot of epic proportions",
            "content": "Being big and fat wasn't this much hilarious since Roseanne's loud, obnoxious take on \"The Star-spangled Banner!\" Eddie Murphy is back as Sherman Klump, Buddy Love, and the whole Klump clan in \"Nutty Professor II: The Klumps,\" the sequel to the monster 1996 hit. This time around, it's amore extreme for Sherman, who has the hots for a new college instructor named Denise (Janet Jackson, in her first role since 1993's \"Poetic Justice\"), but something's not right with Sherman, because his sleazy alter ego Buddy Love is still alive and kicking! Both men are trying toget a new serum that will bring anyone's youth back, to themarket, but strange things keep happening, by the truckload!Unlike the first movie, \"NPII\" gives the rest of the Klumpfamily more screen presence. We get more upclose hysterics withthe whole gang more than ever, and some of the antics are down- right wild! (Check out Grandma Klump's erotic fanatasies!Yechh!!) The problems with the movie is that the flick runs over 2 hours, and the overall time might cause some discriminatingviewers to get impatient. Plus, there are a few sappy, senti- mental parts that don't really fit in with the randy, sexual jokes that run amok in this flick. But other than that, thefilm is great, and it's guaranteed to make anyone burst out laughing.",
            "review_date": "2000-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "4.6 Rating? Please....",
            "content": "***Starring: Eddie Murphy (x 7), Janet Jackson, and Larry Miller.Everyone's favorite obese professor is back, this time creating a youth formula.  When Buddy Love becomes a terrible alter-ego, he decides to get rid of him forever by ridding of the genes.  But Buddy gets resurrected into a whole person when a strand of a dog's hair gets in his genes; thus, creating him.  Professor Klump also notices that taking Buddy out starts to make him lose intelligence, and it comes at the wrong time when he has to make a presentation for his new formula.The absence of Jada Pinkett Smith confused me, but I let that go.  the movie is hilarious, and it shows more of Murphy's other characters which make this funny.",
            "review_date": "2003-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Terrible.....",
            "content": "This movie was the pits. Eddie Murphy thinks that he can be funny by talking loudly and using heavy accents. If an actor uses an accent, he could at least make sure his diction and pronunciation are intelligible to the audience. Half the message was lost on me. I couldn't understand hardly any of it. It was also crude, purile and humourless. Shame because Eddie's previous work wasn't bad at all. Lately, it's garbage.",
            "review_date": "2000-10-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better then the first.",
            "content": "Professor Sherman Klump (Eddie Murphy) discovers a sort of fountain of youth potion, but discovers in the process that Buddy Love (also Murphy) is back and trying to steal the potion and ruin his engagement to beautiful Janet Jackson.Sequel manges to outdo the original with twice the special effects, twice the humor, and twice the heart. Eddie Murphy is absolutely brilliant playing as many as eight roles!! ( At least that is what I counted) and Janet Jackson  is fun and appealing. The Klumps ( all of them are almost played byMurphy) make a bigger appearence ( no pun intended ) in this sequel and are a welcome addition too. Also watch the end credits, quite funny. My rating: 8 out of 10. Also features a funny Star Wars and giant monster movie spoof. GREAT FUN!!!",
            "review_date": "2000-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Can be better",
            "content": "Is interesting i thought this sequel can be better than the first one. I have watched the first part which i can see is much more better. Although the second serial is quite emotional at the end but there are still lacks of something inside.The camera simply move too fast from one person to the other and the language is too fast to be understand. Viewer probably find it a bit sick if they have motion sickness.Overall, can be better.",
            "review_date": "2000-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Klumps suffers a mild case of sequelitis.",
            "content": "When seeing the trailers for NUTTY PROFESSOR II: THE KLUMPS, I was rolling my eyes saying, \"why make a sequel to a good comedy?\" I'm pleased to say that KLUMPS is entertaining, but not as good as the original (sequelitis).  No, the last movie that over came sequelitis is TOY STORY 2, so it will be about another few more years until we see a sequel better than it's predecessor.      KLUMPS has Eddie Murphy returning as Professor Sherman Klump, a man who's waist is awfully big, but so is his heart. Also returning is Mama, Papa, Ernie, and Grandma Klump, all played by Murphy.  And making a unwelcome return is the vicious and cruel alter-ego of Sherman, Buddy Love.  Sherman is suffering from saying or doing cruel and rude remarks from the Buddy Love gene inside his body.  Sherman is very worried, because he wants to start a serious relationship with his colleague, Denice Gains (Janet Jackson).  But it's the Buddy in him that holding Sherman up.  So Sherman decides to take that gene out of him, causing Sherman to lose his intelligence more and more every second.  And even worse, Buddy manage to come into form from a piece of dog DNA, causing Buddy to actually act like a dog! Buddy first appears in a nice homage to the classic film noir film CAPE FEAR. And poor Papa Klump, he's suffering from a \"limp noodle\" it seems that he can't get it up anymore.  Mama Klump suggests viagria, but Papa replies that he's been taking them like, \"M & M's.\"  And Sherman also invented a youth formula, that is worth millions, and Dean Richmond (Larry Miller) only cares about getting that check in his hand, and could care less about Sherman's diminishing intelligence. There are some parts in KLUMPS that are just downright funny.  I was laughing my head off at some of the scenes.  Then I was rather shocked to see some of the other scenes.  I was shocked because it was rather obscene, and it's in a PG-13 movie, when it's along the same lines as ME, MYSELF, & IRENE. But KLUMPS does manage to have plenty of funny scenes to make it worthwhile. I figured out that any recent funny Eddie Murphy movie is funny is when Murphy isn't playing himself. BOWFINGER, the original NUTTY PROFESSOR, and this film are all funny since Murphy plays a variety of characters that shows the great talent that Murphy has.  Where in films like DOCTOR DOLITTLE and LIFE, Murphy is playing his usual role, and makes it very dull.  It was funny back in the '80's, but it's rather old now.  And I don't know why Janet Jackson replaced Jada Pinkett?  I mean, Jackson isn't horrible playing Sherman's love interest, but she really doesn't stand out.  And Larry Miller is a little less colder than he was in the original NUTTY, but he does manage to shoot some some cruel remarks to Sherman. I was rather pleased to see that the sequel was filmed on the campus of University of Southern California.  I was attending USC for summer school when I first saw the original NUTTY PROFESSOR.  I brought back good memories seeing the campus, and seeing the familiar faces of the Klump family also brought back good memories. KLUMPS is a comedy that ranks in the middle of funny films for the year.  It's not as funny as CHICKEN RUN or ROAD TRIP. But it's way more funnier than BIG MOMMA'S HOUSE and READY TO RUMBLE. However, I think that Eddie Murphy should put the Klump routine to rest, and think of a clever character that's far from his normal personality, like his Jiff character from BOWFINGER.  KLUMPS is o.k., but see it after you've see everything else this summer.  ***1/3 (out of five)",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lots of bathroom humour.",
            "content": "Short, sweet, brilliant touches of sentiment and occasional flashes of brilliance do not make up for some jokes that are so poorly conceived that they are embarrassing to watch.The true genius in this new Eddie Murphy vehicle is in the editing and multiple characterizations that Mr. Murphy accomplishes so successfully.His characters, while all belonging to the same family, are diverse enough and he performs them consistently enough that they become believable as individuals. The seamless editing certainly enhances the performance(s) by Mr. Murphy.There is quite a bit of juvenile, bathroom humour \u0096 which doesn't particularly appeal to me \u0096 but most of the rest of the audience seemed to enjoy it.Casting Janet Jackson was genius; she is very good as the sweet and supportive Denise Gains.  But I did wonder why she was cast when there are so many other underutilized African American actresses that could have been showcased.  Was it for her box office drawing power?  Or did she just need the money?The make up department will probably be nominated for all the major awards (Golden Globe, Oscar, etc.) and will probably walk away with at least one of them.However, one of the most appealing aspects of this movie was the superb soundtrack \u0096 it was magnificently composed, wonderfully orchestrated and perfectly performed.",
            "review_date": "2000-08-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "7 on a scale of 10",
            "content": "I gave the original an 8. This one was about a 6.6, but rounded to a 7.I was again very impressed with the job Murphy did. He is a genius to be sure. And, the make-up was sensational. Having said that, it doesn't make a movie.There was a little comedy and it had a sweet feel to it. But, the crude behavior was the only thing that allowed me to err on the side of a 7 versus lower. I like crude.Unfortunately, since that is what the movie was about, it didn't have enough and what it had wasn't funny most of the time.I would NOT go see a third version of this movie. There is simply no way it could offer anything beyond what the first to offered. The \"joke\" really started to get old by the end of the movie and I can only imagine that a third version would be a disaster.",
            "review_date": "2000-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't let the ads klump your mind",
            "content": "Hollywood is making us believe that this is the best comedy around ever. I think they are trying to klump our brains with vulgar jokes which are pretty stupid to say the least.I can't believe this movie is number one.I did not laugh once and preferred The Nutty Professor 1 over this movie. Again, this is an affirmation of the rule: THE SEQUEL IS NEVER AS GOOD AS THE ORIGINAL.Save your money, go watch the movie \"The Kid\" instead with Bruce Willis. Raphael Abbate",
            "review_date": "2000-08-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "terrible tripe",
            "content": "This film confirms Eddie Murphy's slide into movie mediocrity. This is almost 100% toilet humour. Virtually none of the jokes raise even a fraction of a ripple of a smile. Its awful in every way, nothing endears it to viewers. Anybody who buys this film needs instant surgery to correct their mind. Its a terrible offering. That money has been paid for the Klumps is a disgrace. All profits should be confiscated and given to charity or something. It horrifies me that people have earned money from a film so amazingly bad. Murphy seems to play every character, but in any role he fails to entertain. The Klumps is another of those sorry cash-ins that try and relive the glory of the first movie, which in this case was adequate at best.",
            "review_date": "2005-04-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful...simply awful",
            "content": "This movie was a tedious 1.45 hours.  I sat there in awe of how unbelievably awful it truly was.  There was so much of the dialogue I couldn't understand (when the Klumps would converse) and the storyline and plot just was awful. Do yourselves a favor and don't see it.  You'll be checking your watch every 5 minutes and wishing you were 8 dollars richer.",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful...",
            "content": "Another comedy bites the dust. I didn't laugh once during themovie. The whole thing was stupid. The only thing that amusedme was watching Eddie Murphy play almost the entire Klumpfamily.NOT RECOMMENDED.3.5 out of 10",
            "review_date": "2002-06-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Uncreative and raunchy... I wouldn't advise watching this while eating",
            "content": "This was on the living room TV one Saturday evening, and I was trying to enjoy a slice of pizza to no avail. Nutty Professor II: The Klumps was a waste of money to make. It was stupid and gross. Absolute cringe from start to finish. The characters don't do anything but talk about sex and pass gas. To be honest I didn't think the first movie was all that great either, when Professor Klump's family was passing gas at the dinner table. How is that funny? It's ignorant and vulgar. Only kids laugh at that nonsense. Adults who think that's funny make me lose faith in humanity. The humor is just too off the wall for my taste. The grandmother stripping down to her birthday suit, and then forcing Professor Klump's alter ego to kiss her, was awful. The scene with the giant hamster wasn't any better. That was highly disturbing. No way is this on my list of favorite movies. I will give Eddie Murphy props - it takes a lot of talent to play more than one character. But the flatulence and sex jokes were overdone. I'm skinny and I even found it offensive how overweight people were portrayed as disgusting. I know my review is 22 years late, but nonetheless, please do better, Hollywood! Movies influence how people see each other. They're a contributing factor to racial and gender stereotypes. Maybe it's because I studied the behavioral and social sciences in college, but I honestly do believe how people treat one another in society will not improve until films start improving, and that includes comedies. If you think toilet humor and sexual dialogue are hilarious, then you will enjoy yourself. This film wasn't my cup of tea, and neither was the original for that matter.",
            "review_date": "2022-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "good",
            "content": "beautiful film. As to the usual one, the usual negative comments which talk about a classical film some years 80 which everyone does not like it to the nostalgic ones are met.Sure Heros that this film had to have a judgment in this site. In fact reviewers' good part has put a high vote to the previous episodes. Because this contrast? I know the reason. Since assumptive reviewers' good part favorably sees the past and as the past is \"better\" than the present they have given several credit to the preceding episodes being still the last episode more explosive and spectacular. At this point should reject also the old episodes but there are here two weights and two measure.In fact also cinema masterpieces have been criticized and denigrated. Good part some reviewers of this site belong to the very bad reviewers. Better think separately with its head. I was sure that the god fun old episode did not like it. Who has to be withdrawn is not george lucas but the last reviewer SAMPAT",
            "review_date": "2008-09-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Really Bad",
            "content": "This is the worst movie ever made. Throughout the movie I found myself trying to leave, even though it was my own house. The jokes were not funny in the least, and all the punchlines could be seen from a mile away or were overly built up. I love Eddie Murphy, but I don't know what he was thinking during the making of this pile of worthless film.",
            "review_date": "2002-04-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very, very funny",
            "content": "\"Nutty Professor 2\" is a very, very funny movie, it is Eddie Murphy's best and funniest film since \"Dr. Dolittle\" from 1998.  Eddie Murphy plays six roles in this film, it is a real treat to watch him do his thing. Though the film goes the toilet humor route in parts it is still very funny and I recommend it .",
            "review_date": "2000-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "to sick for it's own good",
            "content": "I'm a pretty casual Eddie Murphy fan.  I love the Beverly Hills Cop movies. I loved Coming to America more than any other Eddie Murphy movie.  I also loved the first Murphy Nutty Professor.  It had the right combination between tasteless toilet humor and tasteful humor.  Well, the sequel isn't like the original.I will admit, most of the movie is funny.  The whole bit about Buddy Love being part dog is hilarious.  There is some classic Murphy humor here. However, most of the movie is filled with fart jokes, `poop' gags, and sex humor.  When I say sex humor, I don't mean humor like Austin Powers One.  I mean old people shagging.  Who wants to watch old people talk about acts that would make a 13-year-old blush?Now, I can take toilet humor.  It ain't my favorite brand of humor. Honestly I prefer intelligent, yet silly movies like This is Spinal Tap, Clerks, Caddyshack, Monty Python, and, hell, even Adam Sandler.  Let's not forget the Simpsons!  Well, The Nutty Professor II is just fart jokes, and I found the movie to be completely tasteless and disgusting.  Like I said, I thought the first Eddie Murphy: Nutty Professor was a classic.  But this new one is just too much.Immature teenagers will love this movie.  Anyone who has any maturity will not.  I saw this with my dad, and almost convinced me to leave the theater. I would have done that, but I have a philosophy of \"If I paid for it, I'm going try and get my money's worth\".So, basically, if you like Eddie Murphy, do see this movie.  Some jokes are funny. (some spoiling) The end of the movie is terribly sappy, especially how Sherman Klump and Dean Richmond just become friends for no reason. They're supposed to hate each other, and they quickly become friends\u0085 really quickly.  I wish Murphy had done more with this movie than fart jokes.  I really do. \nI will say that the visual effects are pretty amazing.  Seeing how every character is Eddie Murphy in makeup is just astounding!  They pass food around the table in an un-cut, 360 degree swoop, they sit watching television while slapping each other on the back, and they even attend a party where they crisscross through the crowd all in the same shot.  Truly amazing.Eddie Murphy is a genius, but he doesn't show it here.\n4/10",
            "review_date": "2000-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Profoundly latrine",
            "content": "The first Nutty Professor was actually a funny remake of the now legendary Jerry Lewis movie. In some ways actually funnier than its original. This sequel is almost not at all funny. As much farting as there is a lack of story which is quite a lot. There are a few witty moments but most of the time Eddie Murphy dirt talks his way through his many roles. How incredibly he may mask himself he fails to make actual dialog between the characters and the talking quickly becomes a tiring cacophony of words.Thomas Nielsen",
            "review_date": "2004-01-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "*** out of ****",
            "content": "Even though the title is annoying, I thought \"The Klumps\" was better than the first. Sure, its jokes are somewhat disgusting, but it's still surprisingly touching. The plot is interesting and you can't help but fall for the Klump family.",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny film",
            "content": "Eddie Murphy runs wild through this comedy. I enjoyed getting to know the Klumps family. A laugh riot!!",
            "review_date": "2020-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I liked the first one a lot more",
            "content": "A sequel is never great but I gave this movie a 4 because it wasn't very funny and it was way too long for a movie like this",
            "review_date": "2021-03-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I Gave This 3 Stars",
            "content": "I didn't like it. Nope. Not very much at all. That's why I gave it only three stars.",
            "review_date": "2018-10-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "pretty good",
            "content": "I think we all have relatives, in-laws and family members that we could identify with in `The Nutty Professor 2'\u0085although they may not be as extreme as some of these characters.This movie is basically the `Eddie Murphy Show' as he plays the entire Klump family. The basic story line revolves around Sherman Klump developing the formula for age reversal. Somewhere along the way, Buddy Love (Sherman's alter self) gets his hands on it and decides that he's going to be the one to reap the benefits of this youth formula.   I don't want to give away too much of the plot and ruin it for you.The makeup in this movie was fantastic. The fat suits that Murphy wears are so realistic and follow his movements so well that you think these characters were real. He plays all the characters so differently but at the same time with a hint of similarity that it's not hard to believe that they're all related to each other. He particularly plays Grandma Klump well. She is such a riot and so is Mother Klump. It seems that Eddie Murphy's career is starting to turn the corner.Janet Jackson plays Sherman's girlfriend moderately well. It wasn't great but it wasn't bad\u0085just ok. At times she seemed to look like she was struggling to find the right way to display the emotion the particular scene called for but otherwise she was fine. She will get better as she gains more experience.The one thing that may have taken away from this movie was that it may have had one too many crude toilet jokes. Most of them were inserted at the right moment but there was the odd one that wasn't really necessary and could potentially have been annoying.Overall, this was an entertaining movie. If nothing else, see this movie just to see Eddie's different characters.",
            "review_date": "2000-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lots of laughs, but without much plot and the heart of the original movie",
            "content": "\"The Klumps\" was mediocre and least a bit better than I'd expected form the trailers.  The original movie had a little more heart to it and Murphy was more original.  In \"The Klumps\", the emphasis was much more on the family, and you knew all of the jokes either from the trailers, the previous movie, or your own sense of prediction.  Sure, there were some laughs, but they were immature (as expected) and a lot less original.  Eddie Murphy, however is a funny man, and his spontaneity puts some life into the roles of the Klumps (five of them!).  The movie was good for a light-hearted night, or maybe a kid's slumber party.",
            "review_date": "2000-08-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Nutty Professor was Brilliant! The Nutty Professor 2 is awful!",
            "content": "THE NUTTY PROFESSOR (1996) starring Eddie Murphy and Jada Pinkett was, and still is, one of my all-time favourite movies. But this is a huge dissapointment.The movie ut toilet gags and rambling. Yes OK  the SFX are still there but the director just exploits the SFX in this movie and the whole thing is completely overglossed and overdone! The scenes at the dinner table in the first movie (where Eddie plays the 5 characters) was hilirious and worked very well...in this movie it doesn't! The scenes in this movie are just so repetetive and un-inventive. The toilet humour is just pathetic. The writers must have been so low on ideas when they wrote this trash! WHAT A HUGE FAILURE COMPARED TO THE FIRST MOVIE! 2/10",
            "review_date": "2001-07-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superior sequel - but NOT for the kiddies!",
            "content": "My hubby wanted to see this so I tagged along, not exactly looking forward to the experience since I was NOT a fan of the Murphy version of \"The Nutty Professor\", a lousy remake/update if ever there was one (ditto for \"Doctor Doolittle\"): Murphy, a man I have never been particularly fond of, just tried WAY too hard and wasn't that funny, to be honest. Now, however, while at times he STILL has a tendency to overplay (a problem he shares with Robin Williams; both require a strong-handed director to guide them toward FULL AND SATISFYING performances), he is much more successful and so is the film, a fact also due to what can only be called an often hilarious, occasionally draggy, sometimes sentimental, usually raunchy - and I mean RAUNCHY! - screenplay. As another review here as said, in this film Sherman finds a way to 'remove' the lingering Buddy Love from his system, only to find out that Buddy just won't stay put; in fact, Buddy has designs on a fountain-of-youth formula that Sherman has developed and schemes to steal not only the formula but the glory - and triple-digit millions - too. That's the basic outline. Interspersed is more of the Klump family than previously seen (in more ways than one), and it is here that perhaps the movie is most rewarding: while Sherman is the gently-lovable center of the film, the bulk (for lack of a better term) of their scenes, deftly played for maximum laughs by Murphy and brilliantly edited for boffo impact, is provided by Mama & Papa Klump (touching and hysterical) and Granny, whose character neatly and efficiently steals every scene (particularly memorable is the portion of her Buddy Love dream sequence where she joyously frolics in a sea of wildflowers). Though given a few choice lines, the brother Klump character is pretty much relegated to the sidelines, while the grandson is silent and wasted (if you've seen the portion of the preview where he guzzles soft-serve ice cream straight from the spout, you've just seen the only substantial moment he has); as for the character of Buddy Love, it seems, wisely, that there have been considerable pains to make him a little toned-down and a bit more cartoonish; previously, he was simply too mean and it dragged down the movie, giving it a harsh edge it didn't need. That's changed, somewhat, though his - and, to a lesser degree, Larry Miller's - fat jokes and putdowns get rather tiresome. As a whole, the film succeeds, though, like \"Big Momma's House\" (a film it often resembles) it gets quite a bit funnier as it goes along (the beginning tends to drag here and there); unlike \"Big Momma's House\", however, this film is downright BAWDY and remarkably vulgar!!! (The transformation is similar to that of \"Austin Powers\" - cult-like original, down-and-dirty gross-out-giggly sequel.) I could see a mother in the audience visibly squirming every time one of the myriad references to sex acts was uttered and while they were indeed absolutely funny-as-hell, it must be said this ain't for kids. Be assured: THIS IS REALLY AN ADULT'S FILM IN DISGUISE! As for the performances, this is, naturally, Eddie Murphy's film and he is obviously having a ball; at slower points in the movie, one is able to take a breath and admire the man for what seems like boundless energy. His performances - eight, in all - are noteworthy, to say the very least, and he manages to even invest these characters with a most important trait: humanity. You really do believe these are people with honest-to-goodness feelings. As Sherman's love interest, Janet Jackson, looking stunning and photographed beautifully, gives a fine performance, and makes a warm presence, a total turnaround from her previous big-screen appearance in \"Poetic Justice\". Perhaps wisely, she is given NO comedic readings. (For proof that comedy should be left to comedians, just tune in to ANY episode of  \"Hollywood Squares.) In a repeat supporting performance, Larry Miller offers nothing new to his repertoire but is still a hoot (particularly following an incident involving a hamster). Other performances are OK with no standouts, though occasionally extras are woefully wooden. The look of the film is bright and cheery, like the original. Apparently, the director decided to give the reigns to Murphy, but still the movie moves along pretty briskly, for the most part. Overall, a darn funny film...just not for the kiddies.",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is the worst movie I've ever seen.",
            "content": "This is the worst movie I've ever seen. There was nothing good about it at all. It was entirely bad. I normally like Eddie Murphy in his other movies (Dr. Doolittle was cute, Trading Places was hilarious). This was just flat out awful, no way around it. The plot stunk. Eddie Murphy was too busy playing all the characters to make any of them good. Everything stunk. I'm done.",
            "review_date": "2001-09-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very funny sequel.",
            "content": "Nutty Professor II is a very funny sequel. Close to being as good as the original, but the original is a tad better. Some of the jokes in this movie are outrageous. Like the scene with the giant hamster. Eddie Murphy is as funny and likeable as ever as Sherman Klump. The Klumps are hilarious too. Overall not quite as good as the original, but close. *** (out of four)",
            "review_date": "2000-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fabehlous!",
            "content": "This movie is great! The movie pushes the limits of a PG-13 rating TOO FAR, but who cares. Here's a warning to parents, this is NOT a movie for small kids. They'll say, \"Mommy, what are they doing in the bed?\". I was shocked in my theater to see kids about 3 SEEING THE MOVIE! Anyway, good movie.**** out of ****",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's Not a Good Movie",
            "content": "Nutty Professor 2: The Klumps is sequel to the remade version of The Nutty Professor. The movie is about nice Sherman Klump who is about to be married to an entirely person from the first movie and tries to make his sleek and evil alter ego a separate person. He succeeds, but finds himself getting dumber and dumber just as he's about to make a presentation about a new thing he created, which ends up horribly inappropriate. The plot is remotely interesting, but ridiculous and meaningless. It's fine that if a sequel isn't as funny as its predecessor, but filling every scene with a forced sexual innuendo or a bathroom joke is not good, it's just wrong.The first movie had the same kind of material, but there were other jokes that were used. Just watch the first movie, the original Disney version, or even the classic Robert Louis Stevenson book \"Dr. Jeykll and Mr. Hyde.\" My Rating: */*****",
            "review_date": "2012-06-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not a comedy",
            "content": "Grossed-out comedy with an interesting plot that could have saved it. I suspect the movie would have been a lot better if it were made as a Sci-Fi or drama. The jokes were simply lame and over-cliched already. It's got some original ideas. Let's hope some other director/writer can come up with a better movie.",
            "review_date": "2001-02-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "2 out of 5 stars",
            "content": "Picking up where he left off in the original, Eddie Murphy is superb playing 8 different roles as Professor Sherman Klump and his hilariously raucous family, the Klumps.  But this one falls well short of the original because when the Klumps aren't on the screen there is little reason to watch. Director Segal forms a barebones script around Murphy's performances, and then decides to not give us as much of the Klumps as we desire (and deserve).  Two definite low points: Janet Jackson as a molecular scientist (yeah, right) and a brand of disgusting, lowest denominator humor more familiar coming the Farrely brothers.  After seeing a giant hamster shoot terds out of its rear-end and sexually assault Sherman's boss, I began to wonder about the PG-13 rating.  The makeup is incredible, once again, but Murphy deserves a better supporting case and script next time around (which will surely come soon).  Preceded by `The Nutty Professor.'",
            "review_date": "2002-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "How many fart jokes can one movie have?",
            "content": "If you like bathroom humor, you'll love this movie.  Murphy is a very talented man, as his multiple character portrayals reveals, all of which are very funny.  The addition of Grandma's lover is hilarious, and little brother, Hercules, is even fatter than in the first movie!  All in all, you should have quite a few laughs at this flick, even though you may be a little embarrassed that you're laughing.",
            "review_date": "2000-09-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Too much of a good thing..",
            "content": "How much can you really expect of a film containing giant hampsters, naked grannies and Eddie Murphy behaving like a dog (literally)? Unfortunately, most attempts at humour were crude to the point of evoking disgust, offence or substandard raunchiness, the combination of which isn't all that funny. The repeated heavy focus on Eddie Murphy meant it needed a remarkable solo effort to steal the show but 'The Klumps' was devoid of the charm and Murphy dazzle of its predecessor. The makeup remained the one admirable point. The more time the camera revolves around the rest of the Klumps has you appreciating the brilliance of the makeup, which adds to each character in its own individual way. The bantering and squabbling between the mother and father and even the grandma at times, overshadows the main relationship between Murphy and Janet Jackson's characters which is fraught with standardism and monotony. Though, on this occasion, grandma's mutterings don't hold as much value as they did in the first film and become hit and miss in the humour stakes at best. Apart from the odd brief section here and there, it was an asinine attempt at humour which bordered upon facetious at times.",
            "review_date": "2012-05-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eeeww",
            "content": "Congratulations: this is one of the three (3) movies in my life i went out from. And it was when the top of fun was a space movement based on farts (or so i believe, i was dozing anyways). Dull, obvious, un-funny, recycled, stale jokes. I am not against cheap, bodily humor - but even fart jokes can be funny or not. Those are not. A new standard in bad comedies.",
            "review_date": "2002-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Klumps+Plot=Shmaltz+Dirt",
            "content": "What they should have called this movie was \"Let's take the funniest parts of the first Nutty Professor, do them to death, and fill in the rest of the movie with...,\" I think you get the idea.  Unlike the 1996 edition of The Nutty Professor, I did not find the Klumps funny in the sequel.  Rather, they were crude and silly.  The plot was very unoriginal - except for the fact that Janet Jackson played the leading lady in this one rather than Jada Pinkett, it almost mirrored the first one.  And the jokes?  Also rude, crude, and disgusting.  Now let me get this perfectly clear.  I am not a prude.  I like dirty jokes, but they have to be good jokes, which these ones were not.  Perhaps the funniest line, I thought, was the one which Buddy Love compares the taste of some red punch to Mogen David wine.  Do I have anything good to say about the movie?  Yes.  Freda Payne played a great cameo, and I also enjoyed the excerpt of \"Cape Fear\" with Gregory Peck.  I think I'll pass on the next Nutty Professor sequel should they write another one.",
            "review_date": "2000-08-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fat Jokes Starting To Wear Thin",
            "content": "Starts out hilarious at first with the wedding sequence at the beginning which turns out to be a dream sequence in Sherman's mind, but one can only take so much of the toilet humor and ribbing about fatness and obesity after a while. Apart from the main characters Sherman and Buddy, Eddie Murphy reprises his multiple roles as each of the family members of the Klump family with the exception of the youngest son, and proves his versatility in playing different characters. A pity that there's more emphasis on the fart gags and sexual innuendo than in the actual plot of retrieving the scientific formula and banishing the obnoxious Buddy Love from Sherman's genetic existence. Eddie Murphy is a talented comedic actor, but I hope there is not going to be another sequel to this movie. Time to move on, Eddie.",
            "review_date": "2011-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You sure Eddie wasn't trying to make a Horror Movie?",
            "content": "Unlike most people who use different genres as a means of negatively bashing the movie. I mean this in the utmost respect. When you ignore the vulgarity and the other things, both Klumps and the first movie are famous for, you get a movie about two sides of one persona at war with each other and the other side pulling no stops to destroy each other. In the first movie, Buddy was just another part of Sherman's persona, but now that he's been unleashed into the world with none of Sherman's love and common sense to restrain him he becomes a deranged lunatic. He even gives De Niro a run for his money when parodying the Cape Fear Theater scene.",
            "review_date": "2015-04-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "After this, I never want to see Eddie Murphy again",
            "content": "Crude,tired humor; muddled plot; way--WAY--too long.  This movie is not worth the time spent seeing it.  Everything that was good and funny about the original has been wrung out in the sequel, and what we get instead is a series of disgusting, puerile attempts at slapstick, which come off as crude rather than funny.  You just want the whole thing to stop, but it goes on, and on, and on, and on . . . .",
            "review_date": "2000-07-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A punishment to watch",
            "content": "The acting is bad, the humour is tasteless and unfunny.",
            "review_date": "2019-09-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Terrible",
            "content": "A hopeless sequel that resorts to using fart gags and movie send-ups to pad out the story. The worst part was that given its PG rating here in Australia, I made the mistake of taking some young children with me. Because of some crude scenes, the film is not really suitable for kids.",
            "review_date": "2000-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Murphy gives 2000's best performance by a male actor so far",
            "content": "I've always liked Eddie Murphy, but I did expect more from the first Nutty Professor movie. Freed from the burden of living up to the 1963 film, Murphy built on the strengths of his original Nutty Professor movie. He gave another sensitive portrayal of Sherman Klump. We got to spend way more time with the family and he toned down Buddy Love's presence in this sequel, giving us no more Buddy than we needed. His acting ability has grown in leaps and bounds in recent years, to the point where his performances are superior to the movies they're in. That was the case with the first Nutty Professor and Metro. I thought his best work was in Bowfinger, but now I'm routing for him to get an Oscar nomination. I was stunned by his sensitive portrayal of Mama and Papa Klump and his handling of their marital problems. His performance likely won't be given the respect it deserves because of the crude humour involving hamster droppings and bodily functions, but I would like to see Eddie Murphy's achievement in this film properly acknowledged.",
            "review_date": "2000-07-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good sequel, but could've been better!",
            "content": "After having just sat through a rather interesting sequel, I thought I should give my two cents on it.  If you look at my voting on this, I gave it a 7 mainly due to special effects, along with strong performances from Janet Jackson, nice to see her on screen, as well as Eddie Murphy who played just about everyone.   However, it most certainly could've done better (overall I think it did a good job), but in all fairness, it had a lot of shoes to fill sort of speak because of the first Nutty Professor Movie, which I thought was just outright funny and gave a good spin on the Jerry Lewis classic.  This second run of the mill for Professor lacked the spontaneity and zest of the first film, where the feeling of \"been there done that\" more of less plagued me throughout the film.  Don't get me wrong though, it did have it moments to try and stay interesting and make up for the lags, not only from what I mentioned above, but three classic scenes in particular were: the opening dream sequence, the gerbil mishap at the presentation, and the final sequence with the Professor getting his revenge on Buddy.Overall if you're a fan of this Saturday Night veteran or a nutty professor fan, you're sure to like this movie.  I would most certainly look forward to a third Nutty Professor Film.Overall rating: 3.5 out of 5",
            "review_date": "2000-08-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Return of Fat Boy",
            "content": "ALL MY REVIEWS CONTAIN SPOILERS.  EVERY ONE OF THEM.\nEddie Murphy is a genius.  His rhythm, his timing and his performances in \"Nutty Professor 2: The Klumps\" are flawless.  Scenes involving him to play every single character at any given time are acts of brilliance.  One problem.  The movie sucks.I enjoyed the first Nutty, and up to about 30 minutes into the sequel, I was having a ball.  Eddie broke new grounds in the first, and he was taking it to an even further level in part 2.  While watching, I said to myself, \"Eddie, the master of disguise, has done it again.\"  Then, the actual movie kicked in.Unfortunately, Janet Jackson will probably always be a bad casting choice in any role, simply because she is Janet Jackson.  Her stardom is so huge, that whenever I see her on screen, all I can see is her, not her character.  I had the same problem with 1993's \"Poetic Justice.\"  That and the fact that that movie sucked, too.  And yeah, I know-- famous recording artists have made names for themselves in Hollywood (Madonna, Will Smith.)  But Janet seems so...\"Janet\" to me.  I dunno, maybe it's because she can't act.  At least, she can't act ANYMORE; we all felt for her as poor Penny, the burn victim from \"Good Times.\"  God, I wanted to beat her mamma's a**.Here, she plays Denise Gaines, Sherman Klump's fiance and fellow scientist. She is complete and utter eye candy, which I have no problem with.  As fine as she is, while watching the film, I was sooo full.  In the film, Sherman fights split personality Buddy Love, who is still trapped inside his DNA. Buddy lives within Sherman, and occasionally pops out of Sherman's personality without warning, making life for the fat man miserable. Sherman is forced to eventually make a genetic split, externalizing Buddy Love.\nThis is where the film sloooowws down, almost to a halt.  Things got so dull at one point, I began to daydream, looking around the theater for single women who may need some Rocky the Bear in their lives.  When the action finally picked back up in the end, things got so crazy, zany, and yes, I'm going to say it...NUTTY, that the film becomes everything but animated. At some points I felt the movie was targeted for kids, but then a d*ck joke, or a fart joke, or say, a SODOMIZING joke would change my mind, so I don't know WHO this film is aimed at.  2 stars, simply off of Eddie's brilliant performances as the Klump family alone.  * * out of 5.",
            "review_date": "2003-07-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hmmmmmm........",
            "content": "What the $%&#.....OK......Hmmmm..... Not funny, Not entertaining, Not worth the plastic it was encoded onto. GOD AWFUL!!!",
            "review_date": "2004-02-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bottom Line? A Funny Movie.",
            "content": "I understand that the AFI will not be putting this movie into the top 100 comedies of the 21st century, but the bottom line is that its funny and has many laugh out loud scenes in it. It is by far the funniest movie to come out this year. And why are people claiming there is no story line? The story line is that the Professor Klump has invented a youth serum and Buddy Love, the evil alter ego, is trying to steal it for his own. What more storyline does a comedy need? In addition there are many sub-plots: 1.The love story between Professor Klump and  Denise Gaines (Janet Jackson), 2.The impotency problem of Old Man Klump, 3.Professor Klump losing his intelligence, 4.The impending marriage between the Professor and Denise. This movie has a much better plot than either Me, Myself, and Irene and Scary Movie.Also, I think Eddie Murphy deserves a lot of credit for creating these multiple characters and giving each one of them a life of their own. Technologically, nothing like this has ever been done as well as it has here. (Multiplicity tried, but failed miserably). Sure this isn't Dr. Strangelove, but so what, it's funny.",
            "review_date": "2000-08-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better Than The Original",
            "content": "This movie is better than the original Nutty Professor with Eddie Murphy, but it is much nastier. This should've been given an R rating, but then again, R movies are getting a lot nastier every year it seems. Most of the funny parts come from the nastiness, but sometimes this movie can be quite charming. If you liked the original, then I reccomend going to see this movie. It's funny, but is directly aimed for adults, which is most obvious.",
            "review_date": "2000-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely Hysterical!",
            "content": "Reading all the negative reviews about this film I figured a nice positive one would help. I thought \"Nutty Professor II: The Klumps\" was hysterical. The first one was terrific, but I think this blows it away. Eddie Murphy really plays the whole Klump family, as Sherman develops a youth serum and asks his girlfriend Denise Gains (Janet Jackson) to marry him. Papa and Mama are having problems with their sex life, Ernie is just annoying and Grandma (who is the best character in this movie) is totally over-sexed. Buddy Love also emerges from Sherman's body and is now a separate person, wanting to get his hands on the youth serum to earn lots of money. I guess I'm a sucker for toilet humor and sex jokes! I thought Grandma was a riot, especially in the fantasy sequence with Buddy and the dinner scene in the restaurant was hysterical. I was almost on the floor rolling with laughter. I thought Sherman's dream sequence was dumb and they could have explained a little bit of what happened to Carla Purty (played by Jada Pinkett in the original). She's nowhere to be found here, except for a very brief mention of her. The film is definitely more raunchier than the original, but for some reason, I thought the jokes worked well. This is NOT a movie for young kids. Good sequel. Hope for \"Nutty Professor III\" in the future! Nice job Eddie!",
            "review_date": "2000-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Granny you are SOOOOOOO funny!!",
            "content": "Since the plot of this movie is not the reason to go see it, I won't even try to explain what the movie is about.  I'll just give the positive and negatives and let you decide for yourself.<u>Positives</u>1. The Granny character is hilarious.  The dream sequence of she and Buddy Love running in a field of flowers had me rolling.2. The dumb Uncle was an okay character but not really necessary.3. The clapping momma character was funny.4. The fat nephew wasn't necessary.  He didn't say one word throughout the movie; he did burp.5. Janet Jackson was good as Buddy's love interest but I thought her voice seemed a little too young for the character she was supposedly playing.6. The father character was funny.7. The nutty professor character and his assistant were necessary for the film.<u>Negatives</u>1. I don't like fart jokes and this movie had a lot of them.2. Sometimes nothing at all happened during the movie.3. Granny's boyfriend ate a choked up piece of meat and that was just GROSS\nOverall, the movie was very entertaining.",
            "review_date": "2000-08-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It Breaks My Heart To Rate This 2",
            "content": "I love almost all Eddie Murphy movies. I even enjoyed him in I Spy. I rented Pluto Nash on pay per view (watched it on my descrambler.) But this.... I saw this in the theater, and when I woke up and he was farting in space, I left the theater. That's all I have to say about that.",
            "review_date": "2019-07-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Good Sequel",
            "content": "The Nutty Professor was, in my opinion, the return of Eddie Murphy's greatness.  The best parts of that film were the dinner scenes with the Klumps.  So, naturally a sequel would be made that featured the family for the entire movie.  My first reaction to such a sequel was bad.  I thought that The Klumps would be a typical sequel in which the characters were milked for only their funny one-liners.  If you want to know what I'm talking about, watch Austin Powers 2 compared to the first.  I thought that The Klumps would be a detestable movie with no heart.  I thought wrong.It is true that since There's Something About Mary movies have gone that extra mile to make themselves grosser.  However, the one thing that movie had above those since, was a heart.  That heart was what made you endure the sickness that ensued.  The Klumps has a lot of crude jokes, including a rather unsavory segment with a giant hamster.  But the film's large (pun intended), heart was what made it memorable.  Janet Jackson does a very good job as Sherman Klump's fiance, giving him a much more meaningful relationship than in the first film.  Sherman is still the star, but the other characters get their valuable screen time.  In the first film, the Klumps were nothing more than a joke.  In this one, they each have meaningful characterization.  That is what makes The Klumps much better than it first appears.If The Klumps has one flaw, it is the pacing.  The movie starts out so fast that you barely have time to comprehend everything.  However, this is corrected as the film progresses.Besides being the funniest movie of the year so far, The Klumps is a story of love, marriage, and family.  It is one of those movies that makes you smile.  It leaves you with that warm, fuzzy feeling in your stomach, and unlike most comedy sequels, it isn't rising vomit.",
            "review_date": "2000-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Most Average Movie I Have Ever Seen!",
            "content": "Some movies are good. This is good. Some movies are bad. This is bad, but can sometimes be good. And then there are movies that are okay. Nutty Professor II: The Klumps is okay. And by okay, I mean the most mundane, middle-of-the-road average movie I've seen.  It's neither bad nor good.  I watched it and was left feeling neither pleased or displeased. It is simply filler.  The occasional extremely gross gag is put in to trick you into thinking you're watching something other than a simply okay movie.  If this review seems vague, that's because that's how this movie made me feel. I don't like it or hate it, I just know that I have seen it, and it hasn't affected me in any way.  So if you just want to see something that will kill 90 minutes, you could do no better or worse than to see Nutty Professor II: The Klumps.",
            "review_date": "2003-07-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nutty but lacks a story.",
            "content": "Nutty Professor II: The Klumps (2000)Starring: Eddie Murphy, Eddie Murphy, Eddie Murphy and Eddie MurphyPlot: The entire Klump family returns as Sherman develops another body altering potion. Quick Take: Definitely `nutty' but lacking much of a story.2 out of 5In Eddie Murphy's first Nutty Professor remake, the Klump family dinner was one of the most entertaining segments in the film. So its no surprise that he decided to create an entire film around this oddball group of characters and `technically' the film is a success.  In some scenes, you have no choice but to believe that Eddie Murphy has been cloned six times in order to create the illusion you're seeing.  In addition, the makeup guru of Hollywood, Rick Baker, has once again outdone himself with his near flawless creations.But the flaws in the story are not so easily hidden.  Sherman Klump along with the professor he has fallen in love with (Janet Jackson), have developed a new potion that will make its user young again.  But his alter ego, Buddy Love (Murphy's most annoying character), decides to steal it for himself creating problems for Sherman and the entire Klump family. Predictable and tiresome, the script ends up becoming just another vehicle for Murphy and his creative characters.Without an interesting story the characters have nowhere to go and we're left with a film full of bathroom humor and slapstick comedy which becomes old fast and too often skirts the line of its PG-13 rating.2 out of 5",
            "review_date": "2000-07-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful",
            "content": "A lazy sequel to the quite funny original film from 96,Feels like a bunch of sketches stitched together avoid at all costs.",
            "review_date": "2021-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Really Disappointing and Unfunny!",
            "content": "**********NUTTY PROFESSOR II**********The Plot: Professor Sherman Klump (Eddie Murphy) is living unhappily as a scientist genius at a university. He is unhappy because he still has a part of the evil Buddy Love (Eddie Murphy) inside him. When Sherman proposes to scientist sweetheart Denise Gaines (Janet Jackson) he gets Buddy Love's genes out of him so he can be perfect. Yet does Klump know that he will be worse without Buddy in him\u0085 60%The Acting: Eddie Murphy is simply amazing. He plays all of the 7 Klumps plus Buddy Love and Lance Perkins, if only he had chosen to play 7 characters in better film! Anyway, Jackson is also quite impressive as Professor Denise Gaines. 75%The Screenplay/Directing: Just why did we need another Nutty Professor? The first film had an original screenplay, this screenplay is just another silly try at been a good sequel. The directing is equally terrible. Perhaps if as much effort when into the make-up as went into the script, we would have been onto a winner. 28%Other: The make-up in awesome, it is an effective turn on the film. But the jokes are largely unfunny and pointless. From the very start, you can tell there is not going to be anything special about Nutty Professor II: The Klumps. 60%Overall: This is a really poor sequel. It is not one of those movies that is so bad you have to see it, it is just a pointless waste of time. 43%**********NUTTY PROFESSOR II 43%**********",
            "review_date": "2000-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a great disappointment",
            "content": "What a great disappointment! This film is much much worse than \"The nutty professor I\", although the trailer was very good.Unlike in the first movie, the plot here is absolutely moronic and mostly non-existent. It would be hard  to come up with a worse script! There are a few good jokes with nothing to fill the space between them. I don't mind low-brow humor, but most jokes here do not qualify as \"humor\", just \"low-brow\" and indeed degenerate.Eddie Murphy does an excellent job playing several characters at the same time, but it is not enough to salvage this pathetic excuse for a movie.",
            "review_date": "2000-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "There are no words to explain how truly stupid it is!",
            "content": "Absolutely nothing in this movie made laugh, actually I felt more like crying when watching it. Yes, It´s really that bad... and what a waste of time!!!!!! Eddie Murphy is so primitive....or maybe I just haven´t got a sense of humor??",
            "review_date": "2004-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst sequel ever made!!!",
            "content": "What is up with Eddie Murphy?  He's been making a lot of bad choices. Examples include Life, Holy Man, Bowfinger (I'm sorry but that movie wasn't that funny_.  Maybe Eddie needs to figure out what a bad script is because this movie was just that.  The original was plain hilarious non stop.  This sequel is the total opposite with unfunny jokes.  I'll admit that the sick humor was funny but there wasn't that many like the previews claimed there would be.  It was just one of those movies that care about getting more money then caring for how good the movie is. \tI'm very disappointed with Eddie and the director Peter Segal.  Segal was on a great roll with movies (Naked Gun 3, Tommy Boy, and My Fellow Americans) and then he picks the first flop.  And why they put Janet (Made of Plastic) Jackson as the love interest is beyond me.  She can't act worth s***!! \tIf you think this movie will be funny by what the previews show, don't go by the previews.  This is not a funny movie!",
            "review_date": "2001-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worthy sequel",
            "content": "It is EXTREMELY rare for a sequel to be as good as the original film...and \"Nutty Professor 2 : The Klumps\" is nowhere NEAR as good as the original. But then again, the first \"Nutty\" is a modern classic and one of the funniest films of the past ten years. \"Nutty 2,\" judged on it's own merits, is actually a very funny movie, too...movies rarely make me laugh out loud to begin with (and the ones that do usually aren't SUPPOSED to be comedies), so for that in itself \"Nutty 2\" deserves very high praise.Much criticism has been made about \"fart jokes,\" sexual innuendo and general \"sequel-itis\"....but why is there such a backlash against crude humor? ALL humor, whether it is at it's most high-brow or stuck squarely in the toilet, has its ups and downs. If it's funny, it's funny, and if it isn't, it isn't. It's that simple. And most of the humor in \"Nutty 2\" works quite nicely, thankyouverymuch. I never heard ONE criticism about \"There's Something About Mary,\" which took toilet humor to an all-time high and was very funny because of it. Sure, \"Nutty 2\" doesn't reach the same heights as \"Mary,\" but the criticism it has received for the kind of humor it displays is not only hypocritical, but completely pointless. The movie is funny. Why is that such a problem?Once again, Eddie Murphy's comedic genius is on full display here. Over the years, Murphy has basically coasted through his movies with a sickening lack of enthusiasm and drive...only with the first \"Nutty Professor\" and \"Bowfinger\" has he shown audiences the immense talent and ingenuity that was suggested at the beginning of his movie career. In \"Nutty 2,\" he once again plays several characters, each with their own personalities and voices, and the results are amazing. Yes, the make-up helps, but it is Murphy's job to truly pull off these roles, and he does so. Sherman Klump is as charming as ever, and Papa and Mama Klump provide laughs every time they are on screen...but the scene-stealer this time, as in the first \"Nutty Professor,\" is the feisty, sex-starved, and downright scary Granny Klump. Movies like \"Nutty 2\" generally don't offer much in impressing the Academy come \"Oscar\" time, but for someone like Eddie Murphy to pull off so many different characters so successfully and hysterically....well, the man deserves MAJOR kudos. An absolutely brilliant performance.Some other familiar faces from the first film emerge here too. Larry Miller and John Ales are back, as the dean and Jason, respectively. I was not expecting much from Janet Jackson....yes, I like her music, but her talents as an actress have always been questionable. I was also wishing Jada Pinkett would show up again. But Miss Jackson gives a surprisingly strong performance, and is quite in her element in this film; acting opposite a powerhouse like Eddie Murphy in itself would be pretty difficult, anyway.Overall, a thumbs up. Not as good as the original, but still a worthy sequel, and VERY funny. Murphy's performances alone are worth the price of admission. And the scene with the hamster is not to be missed!!!",
            "review_date": "2000-07-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Their Back!!!",
            "content": "The Klumps are back with the whole family and more funnier than ever.  When they find out about Sherman's discovery, it will have the whole family (The Klumps) going crazy.  A funny movie that will have you out of your seat.  I would watch the first one to laugh more,, but without, you will still be out of your seat.  They say the craziest things in the strangest ways and voices, and knowing Eddie Murphy is doing all of this is even more funny, especially as he plays Grandma.",
            "review_date": "2000-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not what I expected.",
            "content": "When I saw this film, I was a little disappointed. The film was rude, and disappointing. This film was, in a way, like \"Me Myself and Irene\" (2000). A guy with a split personality, fighting for one woman. They were both rude and disappointing. I say Eddie Murphy should forget about a N.P.3I give this movie a 5 out of 10. Rating: This film is okay.",
            "review_date": "2000-08-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A no-see for aesthetes",
            "content": "Another how-low-can-you-go Eddie Murphy vehicle, abundant as usual in both vocal and visual jokes related to sex, defecation and smuttiness in general. Definitely a no-see for sophisticated aesthetes of any kind although Janet Jackson herself was placed on top of the dunghill. But it works on its own terms. It IS funny and moves rapidly, too.OK family entertainment if you have the guts to explain your kids what is going on when a full-grown man is being sodomized by a giant mutant hamster.",
            "review_date": "2001-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funniest movie I've seen in a long time",
            "content": "I think a lot of the comments about this movie are unfair. This movie had me laughing so hard I couldn't breathe at times. Same was true of the other folks watching the movie.This movie greatly improves on the 1st one. It refines the rough edges on the characters and make the funny parts even funnier. While this movie has it's crass and rude moments it's definitely a modern classic.I'm not and Eddie Murphy fan, just a fan of good entertainment. Eddie Murphy should have won an Oscar for his performance in this movie. If Dustin Hoffman can win one for \"Rain Man\" then Eddie should have won for his roles in this movie.",
            "review_date": "2007-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Story lacking",
            "content": "This sequel puts style over substance.  Eddie Murphy plays the various members of the Klump family well, but this obviously proved to be a distraction.  In his zeal he forgot to include a decent story. Unfortunately the story is unconvincing even by \"Nutty\" standards.",
            "review_date": "2001-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eddie Murphy blazes the screen with comic genius",
            "content": "This is the sort of movie you can just sit back, sit forward and throw up all that popcorn, smarties and pepsi you've just inhaled. Without a doubt, Eddie Murphy's comic charisma and absolute genius ignite throughout the Nutty Professor 2. As a sequel, it tops many of the gags seen in the first installment including a bawdy moment with a hamster. The difference between this film and several other raunchy comedies we've seen in the past 2 years is it doesn't cross the line. It stays within its boundaries and is even more outrageous because of it. There's a reason why only Eddie Murphy can dawn 6 characters in a movie -- he's the only actor out there talented enough to do it.",
            "review_date": "2000-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Murphy is amazing, but film suffers from overdose of Klump",
            "content": "When a TV show has a popular supporting character, the networks will attempt to create an entire show based around this character.  These 'spinoffs' are often disappointing, perhaps due to the 'less is more' concept.  In 1996's \"The Nutty Professor\", the main character's family members stole every scene they were in.  So, the studio decided to make them the focus of the sequel. Unfortunately, I liked the Klump family better as supporting characters. \"The Klumps\" is funny and enjoyable, but not as much as it could have been.As if the plot is at all important, I'll give a quick synopsis.  Professor Sherman Klump (Eddie Murphy) is on the verge of an amazing scientific discovery--a youth serum.  But his life is complicated by recurring moments when alter-ego Buddy Love (Murphy) takes control of his body.  This is especially damaging to his relationship with lovely Professor Denise Gains (Janet Jackson).  Sherman regains control of his body, but ends up releasing Buddy.  He also begins to suffer some very dangerous side effects.  Buddy wants to sell the formula and make a fortune, and Sherman wants to stop the side effects, marry Denise, and retain the formula.  Through it all, the Klump family (Murphy x4) attempts to help him.First off, Eddie Murphy deserves to be nominated for an Oscar.  The Academy rarely recognizes comedic performances, and probably won't this time.  But Murphy plays 6 major characters in the film, and no other actor will have such a difficult task this year.  The amazing part is that you forget it's the same guy and stay focused on the 6 distinct characters.  You will be amazed at how they interact with each other in the group scenes when you stop and think that they were filmed one character at a time!  He certainly deserves major recognition.  And makeup guru Rick Baker deserves another nomination (he won the Oscar in 1996).  Jackson does fine (and looks great), though she's really not given too much to do.  Then again, staying in character alongside Murphy's various characters was probably difficult.  And she's accustomed to thankless roles--remember her work as Willis' girlfriend Charlene on \"Different Strokes\"?  Comedian Larry Miller returns as scheming Dean Richmond, and has a few funny moments.  But let's face it--this movie is all about Eddie.  And I can't say anything negative about his performances.There are many funny scenes, and the film is certainly entertaining summer moviegoing fare.  But I thought it suffered under the weight (no pun intended) of the Klump family.  Their increased role meant that Sherman and Buddy took a back seat, and they were characters I wanted to see more of, not less.  Similar to the first film, there are some poignant scenes: especially between Sherman and Denise or Mr. and Mrs. Klump.  But these few scenes are refreshing moments in the midst of too much juvenile humor. Maybe it's a sign of getting older, but there are only so many fart jokes and bathroom humor (literally, at one point) that I can take in one film. And \"The Klumps\" exceeds my limit.  There are also many off-color sexual references, but their impact is softened by the fact that 99% of them come from Grandma Klump.  She is an amazing combination of horny and ornery, but I would have enjoyed more of the ornery (her verbal battles with Mr. Klump are hysterical) and less of the horny.I was definitely entertained by this movie, and I should be thankful for that.  Most of the other comedies I've seen so far this year (\"Scary Movie\", \"Road Trip\", \"Me, Myself, and Irene\") have been very disappointing.  Eddie Murphy's incredible work makes it worth seeing, especially if you enjoyed the first film.  But I didn't enjoy it as much as I could have.  Limiting the family scenes in the first film increased their impact, but expanding (once again, no pun intended) their role in this film made me yearn for less.  OK, I admit it: that pun was intended.",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Unfunny Professor 2: The Waste of Money",
            "content": "I once considered Eddie the best comic around. Stand up and movies included. This really really was a bad movie. I cant believe it had such a large opening weekend. It sucked. It was not funny they tried to use gross out humor ala scary movie, something about mary but it didnt work. It was old very old... I just hope he doesnt make another one of these because i still like him and i dont want him to make a fool of himself again.",
            "review_date": "2000-08-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nowhere near as good as the '96 version",
            "content": "As much as I admired the talent Eddie Murphy put forth in acting in this movie, sadly it was not worth it.  The few funny moments of the film cannot withstand the utter boredom the rest of the movie creates.  And I can't even remember what was funny.  Maybe I was just laughing out of sleep-induced delirium.  Note to the screenwriters: I could have lived my whole life without seeing a man assaulted by a giant hamster and been perfectly happy. Just an example of the futile, desperate humor on display.",
            "review_date": "2000-08-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the most funniest films ever to exist.",
            "content": "I really loved this film a whole lot, it's extremely hilarious in many ways. The first film was funny too, but I watched the sequel more often every year. That's probably because I have it on a double feature VHS tape with the Grinch (the Jim Carrey one), which I always watched that every year on December before Christmas.And yeah, it's got a lot of funny scenes and quotes, such as Sherman Klump yelling \"I AM IN CHARGE!!!!\", and that always cracks me up. For whatever reason, I always thought Sherman Klump getting dumber and dumber and mumbles was more extremely funny to watch than saddnening. The way he talks when he became dumb makes me laugh a whole lot. Of course, there are a lot of sex jokes too, especially when Buddy.(who got de-aged into a baby) hugs the blonde womens breasts and rips of her shirt, and that just gives us real fanservice.Sure it may have some disturbing scenes (Granny stripping off her clothes comes to mind), but it's still a hilarious film nonetheless.",
            "review_date": "2021-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An absolutely shocking sequel.",
            "content": "Watched this years ago. Was on TV recently. I actually couldn't believe how bad it was. The first one was a good laugh. This one is terrible. It's not funny at all. I'm a big fan of Eddie Murphy's old stuff and he tries hard in this but it all falls flat. This was a quick cash in on the back of the first movie that fails in every way. At the end I just wondered who gave the go ahead to that script. Absolutely atrocious stuff.",
            "review_date": "2021-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eddie Murphy Does it again...",
            "content": "Eddie Murphy, starts along side Janet Jackson, Eddie Murphy, Eddie Murphy, Eddie Murphy, and Eddie Murphy.  It's a war out saying, but it's a great thing.  Murphy's characters, as always, are wonderful.  Once again Murphy delivers, even better than in the original `Nutty' film.  Better yet, this time we see more sides of Sherman Klump's clan.  Janet Jackson is wonderful, as Sherman's sweet, sweet wife to be.  Sherman, is well on his way to being one of the greatest scientists of all time, when Buddy love starts budding his way back into Sherman's life.  This causes much distress on Sherman, in the midst of marrying or losing  (Jackson) due to Buddy trying to come back out.  So, Sherman discovers a way to pull the gene out of his body, that \u0091is' Buddy Love. That's all I'm going to say about this wonderful comedy, from most of the original creators, which is a plus in this case, because sequels that tend to lean more on a break through character, or characters in a first installment, they lack story and structure, yet this film has more of that than the `Nutty Professor'.  It also has more gross-out jokes, which seem to fall flat on most occasions, leaving the best laughs to the Klumps personalities.  Murphy gives us the performance(s) that made us all fall in love with him.  He truly shows form here, an it would be something if he were nominated for best supporting actor as `Cletus Klump'.  He deserves something.  (9 out of 10)",
            "review_date": "2000-08-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nutty Professor 2: The Krap",
            "content": "There are so many problems with \"Nutty Professor 2\" that it pains me to even regurgitate them back to you.  Everything from a swiss cheese plot (again with the scientific formula and Buddy Love) and wasted characters (Janet Jackson) to pushing the bounds of good taste (How would you like your 37 fart jokes?) is packed into this comedy-drama that's neither funny enough to be a comedy and not touching enough to be a drama.Eddie Murphy got jipped when he was only paid once for this film as he DOES deserve credit for playing every other role but his fiancee (Janet Jackson) and young Jason Klump (John Ales).  Maybe he should have gotten the cash given the five screenwriters it took to come up with this c**p.  Five screenwriters and the best they could come up with was a seriously late \"Armageddon\" spoof, an oversized Dean raping hampster, and a repackaging of \"Nutty Professor 1\" but with more sex, more sex, and even more sex.  I think the film is inappropriate for the very immaturity it panders to and children under 13 shouldn't be allowed to watch it at all.Basically Universal Studios wasn't interested in making a good movie.  It was interested in was money. But that doesn't surprise me.  After all, this IS a sequel.Nutty Professor 2: The Klumps Grade: F+",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Alternate Tagline : \"The first movie was sexual and disgusting, so we gave the sequel ten times more!\"",
            "content": "* MAJOR SPOILERS IN THIS REVIEW *Huh? This movie's so-called \"humor\" is so raunchy that it looks like something out of the Comedy Central shows. This movie is most likely to appeal to people have a liking for any of the following : 1) Human-animal 'mating' / lust 2) Mockery of overweight people 3) Enough sexual jokes and scenes to prevent the movie from --(heavy sarcasm here) horror of horrors -- actually being decent or having a plot ...and guess what, those are the things about the film that are actually MENTIONABLE. Most of the stuff would be too inappropriate for me to actually REPEAT here.So anyways, here's the so-called plot : Sherman Klump has found a woman he loves, and she loves him, but his alter-ego Buddy Love hates the overweight Professor. When Buddy begins wreaking havoc on Sherman's relationship, he (Klump) uses a genetically-altering drug to remove the part of him which is Buddy Love. He holds the vindictive DNA in a test tube (Love is only a liquid chemical without a DNA or form to take on).When the chemical accidentally mixes with a dog's hair (who is a test subject for the professor's youth formula), the otherwise-harmless Buddy comes to life as his own entity. Learning that a major conglomerate will pay $150,000,000 for the youth formula, Sherman's maniacal alter-ego steals it. But since the Professor has removed part of his DNA, his mind is gradually being destroyed, and his great scientific mind is becoming a thing of the past. While his spiteful counterpart causes havoc amidst the Professor's already-dysfunctional family, Sherman searches for a solution to stop Buddy, get his wife-to-be back, and restore his mind. Because the dog's hair combined with Love's DNA, Buddy has a dog instinct to him. Sherman realizes that if he can get Buddy's DNA back into his body he'll be healed.\nThe weakened but resourceful Klump tricks Love into \"taking\" the antidote which will revert him to a chemical. Before Sherman can absorb Buddy, however, the chemical evaporates! The Professor, nearly completely destroyed in the mind, has little he's capable of. His fiancee, having realized Sherman's condition, rushes to his side upon finding him.\nRealizing the extent to which his mind has been wrecked, she sobs. Her tears bring back the remnants of Buddy and, after drinking almost an entire fountain, Sherman's life is saved.All in all, there's a passable plot, but the movie is so horribly raunchy, scatological, and sexually disgusting that the plot gets buried. Do I recommend the movie? You get three guesses, and the first two don't count.",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Comedy of the Summer!",
            "content": "Very funny...better than original...Eddie Murphy shows how talented he is by expanding on the multiple characters he played in the first movie...What is impressive is how smoothly he performed multiple characters on screen at the same time throughout the whole movie...his performance was incredible",
            "review_date": "2000-07-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "More Genius From Murphy",
            "content": "Murphy's first effort in \"Nutty Professor\" elicited from me three of the most difficult words to say \"I was wrong\". I had long considered Murphy to be merely a trash-mouth, toilet humor comedian with little true talent. I'll say it again...I was wrong! The Nutty Professor proved that the man is an absolute comedic genius, belonging to the ranks of the highest and most talented funnymen (Jerry Lewis, John Belushi, Ernie Kovacs...et.al) \"Nutty II\" was more rollicking, rolling, slap your leg and put your elbow in your partner's ribs, bodacious humor. I laughed till I hurt! The Klumps, who were introduced to my experience in Nutty I, became a part of my life in Nutty II. It was chock full of quotables (I'm still regularly quoting Grandma from Nutty I). It's vulgar, it's nasty, it's irreverent; so what's your point?  It's Eddie Murphy doing what he does best...causing you to laugh till you hurt. He's never going to make you think...but Murphy will take you to the very depths of belly laughter. And it is a medicine. Long live the Klump Family! I can't WAIT to hear from them again! Grandma and her sexual prowess will live forever. C'mon Cletus, C'mon...!",
            "review_date": "2000-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply not suitable for children...embarassing in general.",
            "content": "After recently viewing Nutty Professor the Klumps my main goal is to warn as many as possible to \"not\" take their children, pre-teens or even teens to see this film. The over the top sexual suggestions, and specific gross strong sexual content depicted in the film where enough to make me (a forty year old adult) blush--and gag. Most disturbing where the sexual scenes involving the grandmother. Some visual restraint might have helped, I could have passed on the morbid undressing visuals and slime/ goo kissing scenes. Many in the audience around me where repulsed by distasteful imagery  -- some involving various bodily functions and appearances.\nIt would be enough if the rating of this film where R or X so that discerning adults could pass on viewing. However, the very promotion and targeting of this film IS geared \"specifically\" to children. What fun!--to explain to a child just what \"grandma\" was doing under water to make Buddy Love so happy (the oral sex scene). Yet how disturbing to leave the inappropriateness of such a view to your child \"not\" discussed and explained. Any laughter or comedy found in the movie is lost in the sadness of knowing that children are part of the audience sharing the negative graphic sexual gore with you. Embarrassing in general for young and adult.",
            "review_date": "2001-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful Sequel",
            "content": "The movies jokes were poorly timed and most of them not even funny.  I really disliked the stupid giant hamster scene.  The movies story was badly thought out.  Not even Eddie Murphy saved this movie from being awful. Many of the scenes were pointless and extremely stupid.  The youth potion was a stupid thing to put in this movie. I liked the first movie, but I was very disappointed with Nutty Professor II. My verdict is a 2 out of 10",
            "review_date": "2000-08-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worthless,disappointing sequel.",
            "content": "I watched this film the other night on video wondering beforehand if it would live up to the previous \"Nutty Professor\" film which I think is Eddie Murphy best film since the underrated \"Coming to America\".Boy was I disappointed to see that this lame sequel is pretty much more of the same from the previous film.Nothing but toilet humor throughout and it adds nothing original as far as humor whatsoever.I realize that low brow humor is \"in\" nowadays thanks to films likes \"There's Something About Mary\" and \"American Pie\"(both superior films),but if it is'nt funny or clever it just sits there like a lump with nothing but the sounds of crickets in the background.With sucsess of this film there will certianly be another sequal made. Hopefully someone will put together a better script that does'nt depend so much on the constant toilet humor that marred this film...yea,right.",
            "review_date": "2001-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You'll like it... you'll definitely like it",
            "content": "This wonderful film featuring the hilarious-loving comedian Eddie Murphy playing the whole Klump family, and nice-looking, great-sounding Janet Jackson as Sherman Klump's new girlfriend.  After working on a DNA extraction plan, the theoretical advancement of science that would remove unwanted genes in a person's body, in Sherman's body to get his arch-nemesis, skinny vision of himself, Buddy Love out of his body once and for all.  He tries a procedure and slowly finds out it reverses his memory, and he has only a couple days to find Buddy and get him back in his system. It's a race against the clock, and who will win, Sherman or Buddy?  Hey, couch potato, get up, drive to the video store, rent it, watch it, and tomorrow, go to Wal-Mart and buy the hilarious movie.",
            "review_date": "2003-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Oh dear!",
            "content": "Thought it'd be fun, but a bit disappointed.  It displayed some skilled technical stuff and Eddie Murphy's abilities as a character actor, but (for a UK audience) the unintelligible dialogue and crude humour all got a bit much for us thirty-somethings; my two friends fell asleep, but explaining the bit they missed didn't exactly take long.I guess it's aimed at a younger audience, and I enjoyed the star wars parody, but it's one of those films I'll try to avoid seeing again!",
            "review_date": "2001-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie doesn't quite cut the mustard. Sorry, Sherman.",
            "content": "This sequel has lost the warmth and charm of the original (1996 version) and replaced those endearing qualities with endless gags about obesity, sex and age. What a disappointment! Not for kids. Eddie Murphy does a great job with the makeup, but there are too many story lines going on and the main plot of Buddy Love coming back to taunt Sherman is all together 'thin'!",
            "review_date": "2000-07-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Kaboom!",
            "content": "Kaboom goes the dynamite! This movie exploded all over itself. I'm telling you, in all truthfulness, it was horrible. I used to like Eddie Murphy, and i believe I've seen every one of his movies. But gee, they're getting harder and harder to watch. And that long, loud, full open mouth screaming laughter that only Eddie does makes me want to shoot myself.Janet Jackson now takes the part previously played by Jada Pinkett (Smith), but wow, she couldn't act her way out of a paper bag (bless her heart). She had like ZERO character development. They wasted her.The story is hugely mediocre but somewhat enduring, but only *somewhat* enduring. I'd still watch this disaster just for fun, but you'll likely find it hugely cringe-inducing.But it's the relentless, unfunny toilet humor that I found so incredibly boring. Maybe, just maybe, 6th grade boys will find it hilarious, but i guarantee you that you won't!",
            "review_date": "2023-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wacky, Funny and totally Eddie Murphy.",
            "content": "This is a real Eddie Murphy film. It has the wacky plot, the wild effects and the crude jokes. But does it match up to the first film? Well, the answer is it does! I saw this film when I was on holiday in the US and I have a feeling it will do very well in the UK. 10/10",
            "review_date": "2000-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Parents Beware",
            "content": "Before you moms and dads decide to take your child to see this movie I'm going to strongly slap on a parental advisory. This movie is so full of sexual innuendos to the point where you won't be able to put off explaining the birds and the bees to your child. If you're an adolescent or an adult, sure you'll enjoy the raunchy comedy that Nutty Professor 2 provides. But if we're talking about the majority of the people who will want to see this movie (kids), let's just say they'll get an eyeful. How this movie got a PG-13 rating is beyond me. But if you don't believe me check out the movie yourself...just without the kids.",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The funniest movie of the year!",
            "content": "I was a little reluctant about going to see the movie because a lot of times the sequel does not live up to the original and I hate being disappointed. But I was totally wrong!  If you loved the original Nutty Professor you will love the sequel. Although some will disagree with me, I believe that Janet Jackson did a great acting job and she still looks good.  Eddie Murphy did an excellent job at all of his roles and is still one of the funniest people alive. 9.75 out of 10!!!!",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better than the first",
            "content": "This one is much better than the first.  The way that all of Eddie Murphy's characters interact with one another in the All-you-can-eat-buffet is spectacular.  I mean the make-up is good but passing around things, and having 5 different conversations all at the same time (like a real family) is great.  When Eddie can open up and do comedy almost like in his Saturday Night Live days, he out shines any comedian.  The story is a little dumb, and Janet Jackson does an O.K. job but Larry Miller is good (and boy can he sing a note).  There are just to many \"passing gas\" jokes.  Hollywood needs to make the jokes more interesting than just passing gas to get a laugh.  Overall it is a funny movie and will be enjoyed.  I wouldn't take anyone under 10 years to see this movie though.  Some sexual things but no nudity in it.",
            "review_date": "2000-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Disappointing Sequel But Still Good",
            "content": "RATING: *** (out of ****)\nI really enjoyed 1996's \"The Nutty Professor\", probably the best comedy of that year. Eddie Murphy was brilliant as the role of the Klump family. Now he's back and reprises his role as the Klump family in \"Nutty Professor II: The Klumps\". Well it may not be as good as the first one but still entertaining.Professor Sherman Klump has a lot on his hands: a beautiful girlfriend named Denise Gaines (Janet Jackson) and he has just discovered the \"fountain of youth\" which is a formula that can turn a dog into a puppy and so on. But Sherman is still haunted by the fact that Buddy Love is inside him and he makes Sherman do things he wouldn't normally do.So Sherman decides to get rid of Buddy once for all and he does get rid of him and now Buddy is just a bunch of blue goop. But when a little dog hair touches it, Buddy comes to life and starts to cause trouble with everyone.And now since Sherman got rid of Buddy in his body, his intelligence starts to drop dramatically and he has to now find out how he's going to go through with a speech about his youth formula that could earn him 150,000,000 and stop Buddy from causing any more trouble.The movie has a couple of funny moments but I just didn't laugh as much as I did in the first \"Nutty Professor\". Eddie Murphy is a real treat as usual and Janet Kackson is pretty good as Sherman's girlfriend.So the film's main problems is lack of really funny scenes and it sometimes doesn't know where to go. The film also tries to be a spoof of \"Armageddon\" and \"Star Wars\" and it works somewhat. But most of the problems is made up by Eddie Murphy and so \"Nutty Professor II: The Klumps\" is an entertaining but disappointing sequel. Also, watch for the funny outakes at the end.",
            "review_date": "2000-08-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A third \"Nutty Professor\" would be great!",
            "content": "\"The Nutty Professor II: The Klumps\" was an excellent movie that had me and my friends laughing for weeks. (\"Look mommy, there goes the hamster's B***H!\") The only thing I could find wrong with the movie was that John Ales (Jason) should have had a bigger part. In the first movie, he was on the screen a lot more. Overall, this was an completely hysterical movie, and I would recommend for anyone except little kids. ~Kim Frank Oh, and any fans of John Ales, email me!",
            "review_date": "2002-07-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing acting, amazing film technically, and very funny",
            "content": "Eddie Murphy deserves 6 oscars for this film. Every character he acts is completely believable, moving, empathy-inducing, and it's simply jaw-dropping that he could produce all of them. The film's scenes in which multiple characters kiss each other (with drool!), dance with each other, pass food to each other, are technically jaw-dropping too. And there are great jokes throughout too.",
            "review_date": "2001-06-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good!",
            "content": "Frustrated by erratic and uncontrollable behavior at the hands of his troublesome alter ego, Professor Sherman Klump undergoes an experiment that separates his personality and allows the suave Buddy Love to become his own person. This time around they're battling each other for possession of invaluable scientific research which only further complicates matters in Sherman's personal life with colleague Jackson. Murphy, who's clearly having fun in his pull-out-all-the-stops portrayal of a horny grandmother, is as likable and energetic as he's ever been, but the script is awfully slim and throws out only a few genuinely funny ideas. A disappointment considering the impact of its predecessor. **",
            "review_date": "2017-09-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing! Eddie and Janet make a great team!",
            "content": "Calling Eddie Murphy a comedic genius is an understatement. Likewise, calling Janet Jackson a singing superstar is also an understatement. Now where would you find these two names together I hear you say? Well in the sequel to one of the funniest films ever made in recent years of course. Unless you've been hiding for the last 2 months or just never ever listen to the radio, you won't have missed the new Janet Jackson song that goes round and round in your head forever. The catchy summer tune is one of the songs that although annoying, it's kind of catchy. Well `Doesn't Really Matter' is the theme tune to the new Eddie Murphy movie - Nutty Professor 2: The Klumps. But Ms Jackson doesn't just appear on the soundtrack; she's in the movie as well! In the movie, we see the lovable 28-stone Sherman Klump return with the rest of his family entail. If you think your way back to the 1996 re-make of the Jerry Lewis Nutty Professor, then you'll remember Buddy Love, Sherman's alter-ego. Just as Professor Klump thought he'd got rid of him for good, Buddy pops up again - but not without a plan. He breaks free of Sherman's body for good and is determined to ruin his plans to we his colleague Denise Gaines played by the illustrious Janet Jackson. Sherman's new youth formula has fallen into Buddy's hands, and it looks like Klump is losing his intelligence - for good! From the beginning I knew that it was going to be a laughter packed movie because judging by the first scene, Eddie's performances as Sherman, Mama, Papa, Ernie and last but not least Grandma Klump are so believable, that it is as if they are five different people. The second most important Klump character in the film is Granny Klumps whose sexual appetite knows no bounds, and as she spots Buddy sneaking around the Klump family home, she has only one thing on her mind! As a singer, people don't realise that Janet has a long history of acting. As a child, she starred in many American sitcoms including Fame and Good Times and went on to star in the 1993 John Singleton (Shaft, Boyz N The Hood) film `Poetic Justice' alongside the late Tupac (Shakur). `I've never stopped receiving scripts since Poetic Justice,' Janet said, `but there was either a scheduling conflict, the script was too similar to Poetic Justice or I didn't really like it. But when Nutty came along, I jumped at the chance. I mean, who wouldn't want to work with Eddie?' Although as a Janet fan, you may say I'm being biased, Janet really does a good job acting here. `I really wanted people to think of me as Denise. I hope that people will be able to separate Denise from Janet.' And one genuinely can. However, the movie isn't 100% perfect. Where it faulters is in terms of a decent storyline. It felt like a bit of a re-trip to the first movie with a similar plot. The film, though, is hilarious and will have you repeating lines for days after it, but my only recommendation is that you see it twice. The first time round, you are getting to grips with the storyline, and I have to admit, because I didn't catch all the jokes, I didn't find it that funny. But when you go back a second time, as you know the basic storyline (which is there - despite what I said earlier), you can listen in for the jokes, as they are quite hard to catch sometimes. Altogether, Nutty Professor 2: The Klumps is very good - in fact it is one of the best sequels (save M:I2) that I have seen. It was always going to be difficult to follow up the success of The Nutty Professor, but seeing that it took over $45 million in its first weekend at the US Box Office, this is sure to be a hit in the UK as well.",
            "review_date": "2000-09-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not as funny as the first but it is still a great movie",
            "content": "I saw this movie the first day it came out, and i must say for most of the movie my side was hurting from laughing so hard and so much.  The reason i said it is not as good as the first there is only one Klump Family dinner and don't get me wrong it is very funny but i felt they should have had another one.  It's the funniest movie i have seen this summer and I'm telling you now go see it but it is not as good as the first  one so don't get your hopes up to laugh as hard as you did at the first one, but you will still laugh at loud!!",
            "review_date": "2000-07-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eddie Murphy does it again",
            "content": "I went to see this movie hoping to see more of what i saw in the first Nutty Professor.  And while it did have alot of the same elements.   (Special Effects, Comedy, Toilet Humor) I left feeling that alot more could have been done.  And i didnt really care for Buddy Love being mixed with a dog. The only thing i thought was funny about Buddy being part dog was when he urinated on the newspaper in the mens bathroom. I still liked the movie.  But the original was much better. I'd say go see it if you really liked the first one. If not it could wait until the Video Release or Cable TV even",
            "review_date": "2000-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why all the flatulence, why all the fuss??",
            "content": "It should have been obvious to anyone who saw the first movie that the Klump family has some table manner issues.  Loud, irreverent, arguing filled most of the 10 minutes of screen time they got, and in a lot of cases, left viewers wanting more.  But Nutty II doesn't quite deliver the goods that fans of the Klumps are desiring.  You can only make farting so funny before it starts to stink.  And with an extremely week plot line lingering somewhere beneath the tiresome 80 year old sex jokes, the film just winds up going nowhere.  The hamster scene is ridiculous (though I will say that the jokes that are derived from it come off pretty well) and the space scene...well, who's bright idea was that??  I think the movie would have been better if it all took place in the restaurant and just showed 90 minutes of the Klumps joking back and forth with each other.  Throw 1, maybe 2, farts into the picture, let Eddie Murphy do some writing and actually expand the characters a little bit, and I think you'd have a funny movie. But bowling ball size turds shooting out of giant hamster just wind up making a pile of poop.mikey",
            "review_date": "2000-08-11",
            "lang": "en",
            "source": "imdb"
        }
    ]
}