{
    "rating": 9.2,
    "release_date": "1961-10-16",
    "num_reviews": 110,
    "genres": [
        "Swedish"
    ],
    "summary": "Karin (Harriet Andersson) hopes to recover from her recent stay at a mental hospital by spending the summer at her family's cottage on a tiny island. Her husband, Martin (Max von Sydow), cares for her but is frustrated by her physical withdrawal. Her younger bother, Minus (Lars Passgård), is confused by Karin's vulnerability and his own budding sexuality. Their father, David (Gunnar Björnstrand), cannot overcome his haughty remoteness. Beset by visions, Karin descends further into madness.",
    "reviews": [
        {
            "content": "Typically poetic direction from Ingmar Bergman creates a haunting study of mental illness and how loved ones react to it.",
            "review_date": "2022-05-17",
            "source": "rt"
        },
        {
            "content": "Um filme nada fácil, mas a fotografia e umas atuações pontuais são fantásticas.\nEsse é pra ver com calma e de novo e de novo.....",
            "review_date": "2022-02-20",
            "source": "rt"
        },
        {
            "content": "Cinema as art is difficult to make, perhaps that is why few film-makers attempt it, that and the fact the masses would not pay for it, indeed many would not recognise it. There are so many things that must be considered - a piece of art cinema must have dialogue and eventfulness like a play, characters that are at once representative of 'life' and larger than it, musicianship of a score or soundtrack, the ideas of philosophy, the plot and depth of literature, the feeling of poetry and the aesthetic of a painting or visual art. On top of all that are the pragmatic challenges of what can actually be done and the fact that a film maker must rely on a whole retinue of actors and off camera teams - in contract to the artist or poet who must rely nearly exclusively on his own skills with a brush or ink in the pen and if it can be imagined it can be created. However, for me Through a Glass Darkly was film as art. I am quite happy, actually, not to analyse this film too much but just to have enjoyed it, partly it is because it is just nice to do that - as one may read a poem or look at a painting and just enjoy it without anything more - and partly because I am not really able to analyse; as I may read great literature and philosophy and enjoy it, learn from it but not really fully understand or be able to critique it. So it is nice to read the words of others as one may sometimes read a commentary on great works. That being said I will comment that it does have the typical Bergman probing into emotion (and emotionlessness), raising the ideas of humanity and the human condition and indeed reality itself and perhaps most importantly the questioning and ambiguity of the human mind. For many and me included Bergman is one of the top three filmakers of all time and this is as good as anything I've seen by him, a rather reserved 9/10.",
            "review_date": "2021-11-13",
            "source": "rt"
        },
        {
            "content": "Another Bergman drama bursting at the seams with things to unpick, Through a Glass Darkly is one of the most beautiful looking, poetic films I've ever seen. Sven Nykvist's cinematography is absolutely breathtaking. It's a film with an incredible richness in symbolism that could be interpreted in a number of different ways, but for me what stood out is less the \"silence of God\" theme claimed by others that runs through many a Bergman film, but the inability of people to truly understand one another, and the cruelty they can inflict without knowing it.",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "In its depiction of mental illness, Through a Glass Darkly was certainly an innovative piece of work, a far cry from the treatment that the subject had received before - treating conditions as generic 'hysteria' or more often simply ignoring or suppressing their existence. However, it does wear a bit of age on its sleeve when you consider the many decades of evolution, reassessment, and even excessive romanticization that mental illness has been treated to using film as a medium (retreating to a desolte room with peeling wallpaper to commune with the voices in your head seems almost like parody by today's standards). \n\nWhere the film shines instead is within its more universal domestic themes, tight-knit charaters, and its visual composition; few films can lay as valid a claim to the adherence of the 'every frame a painting' standard. Within every scene is this incredible conflict of love placed under stress, as characters are forced to rectify their affection with a series of more painful realities (for instance, the feelings that Björnstrand's David, as a father, is supposed to have for his children, but instead places on his literature, and the subsequent revelation by his daughter, Andersson's Karin, that he intends to use her suffering to overcome his writer's block, and that's not even considering the reflection on the role and poor character of the obsessed artist that Bergman is attempting to make a statement on); it's a marvelous bit of bleak existentialism told through towering performances, particularly that of Andersson. The mental illness is really only a vehicle for a probing of more commonplace, subdued, but influential tensions in everyday relationships.\n\nWith the exception of Hour of the Wolf, perhaps among the most disturbing of Bergman's films, though it doesn't need surrealism to accomplish its ends. (4.5/5)",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "That looks beautiful wherever that is, probably Norway or Sweden. The way he films his movies in B&W makes everything look even starker, the contrasts are more noticeable. That's the same girl who was in ‘Sawdust and Tinsel'. Man, she's dynamite. She's really pretty. Her lips are so plump, very uhh kissable. I think she thought God was going to come out of the door but instead it was the devil or a demon, something evil that made her mad. Actually it was a spider. \n\nI think what makes Bergman's movies stand apart from everyone else is the way he presents real life sadness in kind of a beautiful way. It's almost like him letting us know that it's ok to be sad or to cry or to go through dark moments in life whether if it's with family or friends or a loved one. These are very human feelings and reactions that we should come to terms with and not neglect or swat away. But damn does this movie get depressing. This movie almost plays out like a suspense horror movie. The way Bergman tackled mental illness really highlighted how terrifying it could be for not only the person struggling with it, but also the people around them. Kind of a disorienting film. I didn't really enjoy it as much as other Bergman movies, I didn't find it as entertaining. I felt like it was a very subtle movie about God and faith in a way.",
            "review_date": "2020-12-12",
            "source": "rt"
        },
        {
            "content": "Andersson does a fantastic job with her acting as she descends into madness.  From her physicality to her vocal range she makes her fragile character look poetic and beautiful in tragedy",
            "review_date": "2020-05-12",
            "source": "rt"
        },
        {
            "content": "This film had a deep impact on me. Bergman is at his best with this one. I relate to each of the four characters in some way, I enjoy picking apart all the hidden themes of the film and enjoy that 3 and 4 hour youtube reviews exist trying to pick this film apart. This is a work of art and transcends filmmaking. A top 5 film for me, if not top 3. Love it.",
            "review_date": "2020-02-17",
            "source": "rt"
        },
        {
            "content": "The first part in a debated trilogy, , I saw \"Silence\" first a few years back, but they are not that connected if you don't think of the God theme.\n\n\"Karin\" is vacationing at an island with her brother, her father and her husband. She has been treated for mental illness lately, something she has been stugling with all her life. She seem fresh, but when she thinks she can speak with God we know that things are not as good as everyone hoped for.\n\nThis is well acted and especially Harriet Andersson as \"Karin\" is great. Playing a scitzofrenic is not an easy task. It's cool to see Max von Sydow here as well. In total we see only four people here, by the way. It's a typical Bergman flick. Poetic and dark. Families struggling. Some very nice dialogue and it looks crisp and fresh.\n\nI liked it, with it's vague symbolism and it's approach of slowly opening up doors to show the struggles within relationships that can look so from deilightful the outside. I waited a long time to give it a go. Mostly because the cover has a freaking spider on it. It's not included in the film. At least not visually.\n\n8 out of 10 Tuborgs.",
            "review_date": "2019-01-19",
            "source": "rt"
        },
        {
            "content": "Mesmerizing movie, a short, bleak, emotionally and psychologically complex drama from one of the greatest directors, with tremendous cast. Cinematography had always been one of the most strong sides of Bergman's film-making: his ability to make of simple landscapes, still shots such profound philosophical images is indeed unique. The story becomes more and more captivating as the illness of Karin unfolds in front of our eyes, and we see the powerlessness of Martin who loves her, the torments of her father, who is breaking apart because of his callousness and his guilt, and the confusion of her brother, who is pitying her and loves her, but has his own problems. Indeed a great cinema.",
            "review_date": "2018-10-02",
            "source": "rt"
        },
        {
            "content": "An (unsurprisingly) excellent film from the master that is Ingmar Bergman, Through a Glass Darkly highlights Bergman's impeccable writing talent and serves as a rewarding and introspective viewing experience.",
            "review_date": "2018-08-09",
            "source": "rt"
        },
        {
            "content": "Um filme intimista e ao mesmo tempo imenso e perturbador, sobre incompreensão, amor e a visão de Deus.",
            "review_date": "2018-07-15",
            "source": "rt"
        },
        {
            "content": "Struggled with this one! Beautifully shot, but felt repetitive and a labour to watch!",
            "review_date": "2018-02-09",
            "source": "rt"
        },
        {
            "content": "Like with many classics, it is the ending that truly sounds the horror and the triumph of a great work.",
            "review_date": "2017-12-22",
            "source": "rt"
        },
        {
            "content": "4.4/5\n\nThe characters and their relationships are pretty much masterful, as they unfold a deeply melancholic story that is as strange as it is captivating.",
            "review_date": "2017-07-05",
            "source": "rt"
        },
        {
            "content": "Harriett Andersson really shows her range as an actress in this film from Director Ingmar Bergman, playing a young woman recently released from a mental institution, and suffering from schizophrenia.  She seems so natural and effortless as she toys with her younger brother (Lars Passgård), poignant as she rues what she's done to her husband (Max von Sydow), and explosive in front of him and her father (Gunnar Björnstrand) as she breaks down.   It's a fantastic performance.  Those are the only four actors in the film, which is stark and minimalistic, set on an island vacation home and taking place over a single day.  It's a quiet, thoughtful movie, where each scene and each shot seem like a work of art.  \n\nThere are frustrations all around: Björnstrand is an author who struggles to the point of despair with writing something that is good artistically, and also with ensuring he spends enough time with his family, unfortunately erring too much on the side of his writing instead.  Passgård feels this acutely, yearning for his father's attention, and also having difficulty with his emerging sexual desires.  von Sydow has the frustration of losing his partner, as her sanity and her affection have faded, and he knows he is powerless to help against a condition which will never improve.  He continues to love her anyway.   The main axes of the movie have Andersson (schizophrenic) inflicting pain on von Sydow (her husband); Björnstrand (callous and selfish) inflicting pain on Passgård (his son).  \n\nIt's telling that Andersson has her breaks with reality in a dilapidated old room, and then later in a ship that's wrecked along the shore as water pours in.  There is a sexual element here: she denies her husband, and later suggests that this is because she must choose \"one side or the other\", seeming to have opted for the crazy and unreal side of her psyche, having some sort of sexual encounter in her mind in the room before he wakes up, later seducing her brother, and finally sees God as a spider intent on penetrating her.  \n\nAmidst of their frustrations, the characters struggle to find meaning.  As with other Bergman movies, the deeper questions about life and God are present.  It's amazing that he packs this all into such a tight and lean story, with four characters over a single day.  He makes use of reflections and light more effectively than anyone - watch for this throughout the movie.  The opening and ending scenes are especially meaningful in light of its themes - inner reflection on one's demons, what the people around us mean to us, and whether God exists.  There is no easy answer to that last one.  von Sydow is cynical and Andersson has a sort of mystical faith until it's disillusioned by the spider imagery.  In a beautiful scene at the end, however, Björnstrand says it may exist in the love people show for one another.  At the very least, he knows that love exists, and that it helps us in our difficult, meaningless lives.  Through all the darkness and difficulty, and though we cannot perceive meaning, looking as we do, \"through the glass darkly\", there is hope in love.  Great film.",
            "review_date": "2017-04-01",
            "source": "rt"
        },
        {
            "content": "A deep & psychological journey of a young woman that has recently been discharged from a mental hospital that struggles with Multiple Personalities & is trying to settle in with her emotionally disconnected family.\n\nShot on the Faro Island where Ingmar Bergman himself lived & shot in stunning B&W with some unforgettable lighting & performances.\n\nSome sequences are a little confusing but I guess that demonstrates her state of mind. A rather bleak film but an interesting one.",
            "review_date": "2017-03-12",
            "source": "rt"
        },
        {
            "content": "This isn't an enjoyable film, but it is an absorbing one for its artistic and thematic value.  There's a lot going on - It's about art, family, mental illness, the sexes, reality and fantasy, and spirituality.  Opposites are used throughout, whether visually or thematically.  It's like watching a piece of paper being folded perfectly in half, only to be folded perfectly in half again.  The symmetry between characters, dialogue, shots and themes is unbelievably sophisticated.   Definitely worth more than one viewing - Its impact continues to resonate a day later.",
            "review_date": "2017-03-01",
            "source": "rt"
        },
        {
            "content": "Bergman depicted a four-person drama residing in an island of light and shadows. Is there God?  Karin caught in the world of the real and the unreal while her husband, father and brother trying to reach to her in different ways.  In the end, Karin's god is a monster while other put their hope to love, variety of love that is either the evidence of God or God himself.   This is a very theological piece.",
            "review_date": "2016-12-20",
            "source": "rt"
        },
        {
            "content": "A masterpiece - there's simply no other word for it - that retains its ability to shock and unsettle. Bergman at his \"Bergmanesque\" zenith.",
            "review_date": "2016-12-17",
            "source": "rt"
        },
        {
            "content": "The central character in this Ingmar Bergman masterpiece is a schizophrenic woman who was recently released from a mental hospital and is seemingly doing better, but she starts to unravel during a family vacation.  the other characters are her husband, her brother, and her absentee father.  The films tackles several complex issues including mental illness, religion, and family relationships and how they shape a person's character.  It is a challenging film and Bergman leaves  a lot for the viewer to interpret, but that makes it all the more rewarding.  The performances are all outstanding, per usual with Bergman films.  one of the absolute highlights is the stunning B&W cinematography from Sven Nykvist which effectively makes every frame of this film look gorgeous.  This film won the Foreign Language Oscar, and it's easy to see why.  Highly recommended!",
            "review_date": "2016-10-14",
            "source": "rt"
        },
        {
            "content": "Visceral and multilayered in a transparent yet beautifully realised manner.",
            "review_date": "2016-09-11",
            "source": "rt"
        },
        {
            "content": "Through a Glass Darkly is such an overrated movie that is one of the weakest efforts from Ingmar Bergman. It is admittedly solid, competently made and well acted, but it is never great, never memorable and it is structurally uneven and also honestly very boring and too slow paced.",
            "review_date": "2016-08-11",
            "source": "rt"
        },
        {
            "content": "Ingmar Bergman masterfully adresses complex issues such as mental illness, the existence of a God and love in this psychological drama fueled by powerful performances.",
            "review_date": "2016-06-23",
            "source": "rt"
        },
        {
            "content": "Hermosa fotografía. Andersson es increíble. Sombría como el golpe de la realidad.",
            "review_date": "2015-11-27",
            "source": "rt"
        },
        {
            "content": "Another terrific Ingmar Bergman movie. This one is heavy-it's about mental illness. I never get tired of Bergman's work.",
            "review_date": "2015-11-07",
            "source": "rt"
        },
        {
            "content": "Delving once again into the idea of perception and reality, Bergman utilizes the effects of psychological illness as a means of separating the characters from the universal idea of consciousness to something less concrete. Karen hears whispers in the walls, incessant boat horns, and the cries of far-off animals, her illness giving way to existential dreams and fantasies about God. She embodies the idea of struggling with instability and uneasiness in reality, while her father attempts to use her periods of \"insight\" for his own gain, a character Bergman indicts as he creates \"art\" without reflecting on his inner truths. Filtering all of these themes through the concept of love and the idea of what it represents, Bergman presents Through a Glass Darkly as a case for this love, calling for its use as a means of providing insight into the self and that of others, as this is the only way those aware of the fragility of consciousness can bear to exist without falling apart.",
            "review_date": "2015-09-21",
            "source": "rt"
        },
        {
            "content": "Belo drama psicológico sobre a degradação de uma família em muitos aspectos.",
            "review_date": "2015-07-18",
            "source": "rt"
        },
        {
            "content": "I think this film is slightly better than The Silence from the faith trilogy, but I compare it to films like Cries & Whispers or Wild Strawberries, and the emotional impact of the film doesn't even compare. The situation is obviously tragic, but as far as character empathy to most I felt was pity towards the father. The acting was overall decent except for Lars Passgard who wasn't all too convincing and had an annoying whiny character. The cinematography is stunning, and it's masterfully directed but it left craving a more powerful Bergman, might just finish the trilogy off tonight with Winter Light",
            "review_date": "2015-07-14",
            "source": "rt"
        },
        {
            "content": "A heady, heavy, and altogether brilliant film that asks no easy questions and gives no easy answers. Bergman's themes of god's absence and existential dread are present but they serve the story incredibly well and are more potent than his other films. I was floored by the film's aesthetic and the not-holds-barred performance from Harriest Andersson who makes her character wholly believable and sympathetic,  even in the face of extreme mental illness. All of the men in her life have failed her not by trying to help her or change her, which they do, but because they don't attempt to understand her. Karin eventually, finally, sees the face of god but, in a horrific, compelling scene, she doesn't like at all what she sees.",
            "review_date": "2015-05-01",
            "source": "rt"
        },
        {
            "content": "A shocking and cryptic tale of mental illness, spirituality and love, \"Through a Glass Darkly\" touches on a variety of subjects spiritual and temporal: art, morality, familial relationships, mental illness, the existence and nature of God. Uniquely structured, Bergman's film feels reminiscent of a highly intelligent version of many psychological thrillers and horror stories. The sense of despair and questioning permeates this picture, and though it might occasionally be a bit too dense for its own good, it certainly is a film which will leave a mark on the viewer with remarkable visual and lyrical poetry.",
            "review_date": "2015-04-24",
            "source": "rt"
        },
        {
            "content": "Immaculately wrought and virtually unmatched by any of Bergman's other films in sheer intensity, Sasom I En Spegel is a tremendously powerful work that examines human fragility in ways few other films can fathom.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "The first in his \"Silence of God Trilogy,\" Bergman's Through a Glass Darkly poetically weaves a bleak yet affectionate portrait of human anguish. Set on a remote island, Bergman reunites on vacation a troubled family of four: a schizophrenic sister slowly succumbing to her illness, her emotionally and socially isolated brother, their distant father unable to connect with his children, and her anxious husband coming to the realization of his wife's inevitable decay. Bergman's longtime collaborator and DP, Sven Nykvist, produces stunning visuals, from sweeping isolating longshots to intimate, detailed close-ups. Darkly lit interiors represent states of inner turmoil. Regarding spiritual matters, Bergman remains a skeptic. As with Antonius Block, the main character of Bergman's The Seventh Seal, the characters in Through a Glass Darkly adopt pessimistic hope in the face of the unknowable. They can't say for sure that God exists, but they want to believe. Death, misery, and frailty permeate much of Bergman's filmography, and it makes sense for his characters to search for the existence of an antithesis.",
            "review_date": "2015-03-19",
            "source": "rt"
        },
        {
            "content": "A fascinating look into the mind of a schizophrenic. The film is beautifully shot, brilliantly acted, and is a must-see for anyone interested in psychology.",
            "review_date": "2015-03-10",
            "source": "rt"
        },
        {
            "content": "A stunning atmospheric film which is haunting and uncomfortable viewing, yet it is also perversely beautiful. The first Bergman movie to really stir my soul.",
            "review_date": "2015-01-06",
            "source": "rt"
        },
        {
            "content": "A family of four is on vacation on an idyllic island, but the young woman has schizophrenia and it gets much worse as she feels increasingly distant from her relatives. She has a breakdown and famously \"sees\" God in the form of an attacking spider. Disturbing and difficult  film should not be the first Bergman film you'll see. It takes an appreciation of this director's films to understand this film. Part one of an infamous Bergman trilogy.",
            "review_date": "2014-12-16",
            "source": "rt"
        },
        {
            "content": "Claustrophobic character study, with hints of a horror flick that never quite materialize.",
            "review_date": "2014-12-15",
            "source": "rt"
        },
        {
            "content": "Complex and slow, that is until the climax. A bit odd, but certainly an intense drama. Well made and acted, just not my kind of plot. Discouraging and futile. 1001 movies to see before you die.",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "A Bergman classic! Splendid performances in front of a harmonic context and at the same time dark conducted by an incomparable genius of cinema, Ingmar Bergman. The film chronicles the journey of a small family that is seen collapsing in a delicate situation: crisis of madness of Karen, the wife of the doctor Martin. With philosophical dialogues and moments of tension, Ingmar Bergman directs and writes a splendidly wonderful family drama, in one of his best masterpieces!",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "I think Pola?ski making better movies about mental ilness. Bergmans story is deeper but getting sharper late in second act. We are attacked by directors vision from nowhere.",
            "review_date": "2014-08-16",
            "source": "rt"
        },
        {
            "content": "Cloaked in Bergman's signature contemplative gloom, Through the Glass Darkly has a confessional quality that makes it one of his strongest features.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "A Bergman classic! Splendid performances in front of a harmonic context and at the same time dark conducted by an incomparable genius of cinema, Ingmar Bergman. The film chronicles the journey of a small family that is seen collapsing in a delicate situation: crisis of madness of Karen, the wife of the doctor Martin. With philosophical dialogues and moments of tension, Ingmar Bergman directs and writes a splendidly wonderful family drama, in one of his best masterpieces!",
            "review_date": "2014-06-20",
            "source": "rt"
        },
        {
            "content": "Through a glass darkly is the first film of Ingmar bergman's trilogy of God,human condition,loss and hopeless desires (the trilogy never had a tittle like other series or a term put by Bergman, he just called his 'trylogy\", the trilogy of god because in all the three films :Through a glass drakly,Winter light and The silence the presence of god is always missing and desire by the characters). If there was a poll about the best performances in world cinema Harriet andersson would be on top of the list, her performance is so compromised,sincere and so moving that it seems she is really beging for God's help, the best performance in cinema history. Bergman's directing,the script, and the very well performances make of this masterpiece one of the most important films that came from europe on the 60's. Long time favorite actor Max von sydow appears in this movie.",
            "review_date": "2014-04-17",
            "source": "rt"
        },
        {
            "content": "A self-absorbed man reunites with his teenage son, his schizophrenic daughter, & her doting doctor husband on a swedish isle after finishing his novel in switzerland. After the daughter reads her father's diary & finds out her torment is fueling his writing, she spirals deeper into madness, barely escaping a hallucinogenic spider-god's rape advances, & finely, reluctantly commits herself. Afterwards the father & son bond over the absence of god, the emptiness of life, & the power of love.",
            "review_date": "2014-01-13",
            "source": "rt"
        },
        {
            "content": "Bergman once again deals openly with his reflections on the theme of religion with this haunting story of a woman recently released from a mental institution whose stay in her father's secluded island with her father, brother and husband looking after her makes her conditions works, as she hallucinates about envisioning God as a giant spider. Haunting vision told through intellectual dialogue and conventional directing, this film is one of Bergman's most representational works - also because here the story and the approach employed to bring it to the big screen is very insular and even a little alienated, which makes it seem all the more intimate and I a result of the Swedish filmmaker's way of working in an almost totally independent way. The acting is excellent.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "A convincing, haunting, beautiful masterpiece that is a magnificent beginning to Bergman's unofficial trilogy. Karen's freak out is one of Bergman's most clever and memorable scenes.",
            "review_date": "2013-12-13",
            "source": "rt"
        },
        {
            "content": "As usual, a masterpiece from Director, Bergman...  Highly recommended!",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "One of Bergman's most intimate and personal films, Through A Glass Darkly plays out similar to a play in terms of merely having a few players in each scene, the film consisting of 4 characters in total. The themes tackled here are familiar with those of other Bergman pieces which include religion and relationships among humans in a deeply intimate understanding.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "A great family drama in Ingmar Bergman's \"Spiritual Trilogy\" I really just loved this film. It's one of my favorites.",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "An intriguing story, not my favorite Bergman film, but a really strong start to the trilogy.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "Not a pleasant film, it is a great one.",
            "review_date": "2013-03-20",
            "source": "rt"
        },
        {
            "content": "perfect bergman, cathartic story, flawless actors. And very effective camera work.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "Fantastic; it's so well pieced together and acted.  Definitely one of my favourite Bergman films.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "Bergman always has had a talent for the play of light and shadow in his black and white works, which makes them interesting to watch, visually. He also seems to like using characters who are sick (mentally or physically), and this film is no different.",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "As is always the case with Bergman, this film is utterly devastating. If you have watched a loved one fall apart and suffer through a mental breakdown then this work will resonate deeply, as it did with me. Harriet Andersson is perfect as the tormented Karin, at once appearing 'normal' until night falls- and the dread approaches. She speaks of voices, and God and of existing in two realities. This is what happens- I know, I've seen it. This alone is convincing, but what makes the film perfect for me is the rest of the cast. Sydow is heatbreaking as her tortured but devoted husband; Passgard affecting as her desperately confused brother; and foremost of all is Bjornstrand's guilty father. It is in him we see the real-life reflection of Karin's delusions. For he has faith, but his is based upon his own miserable experience. Karin's faith falls apart in the maelstrom of her madness, his is strengthened by it.\n\nBut just when you have lost all hope, we have the final monologue. I can't say more because I'll spoil the plot. If you don't mind having your reality broken for 85 minutes (and beyond, I'll wager), watch this film. Outstanding.",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "A fascinating, yet difficult watch. Beautifully written and wonderfully performed.",
            "review_date": "2012-12-08",
            "source": "rt"
        },
        {
            "content": "Con una atmósfera que recuerda al clásico \"Otra vuelta de tuerca\", una maravillosa historia, bien contada y bien llevada a cabo. La obra de un genio que jamás te deja indiferente.",
            "review_date": "2012-11-17",
            "source": "rt"
        },
        {
            "content": "Ingmar Bergman, bar none one of the best filmmakers who have ever lived, has just proved here in \"Through a Glass Darkly\" that one does not need a complex set-up to convey something powerfully meditative. Merely utilizing the sterile landscapes of the island of Faro in Sweden, he, with the aid of the more than able hands of legendary cinematographer and frequent collaborator Sven Nykvist, has made a film that deeply questions religion yet also explores the painful beauty (yes, you read that right) of insanity. \n     \nIf John Cassavetes' 1974 film \"A Woman Under the Influence\" has presented insanity as something akin to a suburban necessity by showing how it can keep a family together in the most trying of times, \"Through a Glass Darkly\" depicts it as something that seems to border on the artistic. Bergman, by equal amounts probing and observant in his approach, portrays insanity not as a terrible mental disease but as a symphonic descent into the unknown. This, I think, is the only film that I have seen concerning mental illness in which I do not really pity the character's psychological condition but instead, in a strangely perverse way, envies it. What is she seeing that we don't? \n     \nThe film, a true landmark in simple yet reflective storytelling, is about a small family living on a quiet island and how their lives and own states of mind are being drastically affected by the only woman in the family's troubling mental health.  Her name is Karin (Harriet Andersson), daughter to Martin (Gunnar Björnstrand), sister to Minus (Lars Passgård) and wife to Martin (Max Von Sydow). At times a seemingly naïve lass but more often a behaviorally mercurial woman who, as if summoned by a mysterious voice, waits so eagerly for the arrival of what he thinks is 'God' himself, her unpredictability causes general alarm to the family members. What is it that she is waiting for that they are all oblivious about? \n     \nThrough this simple dichotomy of insanity and the otherwise, Bergman is able to construct, in true auteur fashion, a philosophical statement about both the futility of religion and the intrinsic role of love in human existence. \n     \n\"Through a Glass Darkly\", though not necessarily a film that's conspicuous in its optimism, still offers a subtly positive outlook. Despite of the film's increasingly despairing situation as Karin careens into psychological oblivion and as she finally finds out the true, beastly nature of the 'God' whose arrival she so patiently awaits, \"Through a Glass Darkly\" was still able to find light by utilizing some logical fallacies that solidifies Bergman's faith in human faith itself. \n     \nThere's this scene in the end where Minus and his father David, while contemplating Karin's fate, unexpectedly swerves into a melancholic conversation about the true connection between 'God' and 'love'. David, the classic image of a jaded yet hopeful human being, blurts out his belief that God and love is the same thing, and being equipped with that comforting idea makes him feel less empty inside. \n     \nBut with that, Minus, on the other hand the classic image of a naïvely confused young man, asks his father back that if God is love, then Karin, his mentally unstable sister, is surrounded by God because they all love her so much. With that thought, Minus then asks his father: \"Can that help her?\" (pertaining to Karin's condition) \n     \nBergman, at that moment the classic representation of an artist questioning the extent of God's power, initially may have intended to leave some of the film's doors relatively open. It could have ended right at that very moment but Bergman, immediately shifting gears from skepticism to enlightened assurance, made the father answer his son with the line \"I believe so\". \n     \nWith that dialogue, Bergman seems to put his own way of religious thinking in perspective. Not that sure, not that certain, but definitely adhering to some kind of light and hope, that line highlights what \"Through a Glass Darkly\", at least for me, is all about. Despite of Karin's description of the 'God' that she has seen as something akin to a monstrous spider, David, with his final answer to Minus' inquiry about the whole 'God is love' thing, is a testament of faith, however futile, amid weighing questions. \"Through a Glass Darkly\", religious-wise, is a film that raises doubts yet also enlightens. Only a few filmmakers can do that. Well, maybe only Ingmar Bergman can.",
            "review_date": "2012-09-24",
            "source": "rt"
        },
        {
            "content": "Hauntingly beautiful. I was amazed when I was watching it. Bergman is one of the best directors ever.",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "\" AtravÃ (C)s do Espelho\" Ã (C) um complexo estudo de personagem que nÃ£o teme explorar temas difÃ­ceis como a natureza da fÃ (C) .",
            "review_date": "2012-09-06",
            "source": "rt"
        },
        {
            "content": "Karin: \"Lilla Kajsa. Det säger du alltid. Lilla Kajsa. Är jag så liten eller är det sjukdomen som gjort mig till ett barn?\"",
            "review_date": "2012-07-19",
            "source": "rt"
        },
        {
            "content": "It's an almost forensic dissection of Bergman's own faith, a chamber play in which the players are an unbelieving husband, an oblivious little brother, and a noncommittal father taking care of a mentally unstable girl whose malady is belief. The cold, spartan setting is harsh and simple, an ideal location for a chamber piece and a mirror of the characters' bare interactions with one another, and the film's double entendre develops gradually through the film until language and symbols become explicit in the end.",
            "review_date": "2012-06-09",
            "source": "rt"
        },
        {
            "content": "An interesting portrait of mental illness. Some fine performances and an intimate setting make it all feel very cozy, in kind of a cold way. It'a small movie about big themes and for all it does well, doesn't really leave a real lasting impact on the viewer. It's also tryingly slow, even at just under an hour and a half. Anyone familiar with Bergman's pacing will know what to expect in that regard though. It is one of a trilogy, perhaps it needs to be taken in as one third to be more effective overall.",
            "review_date": "2012-05-23",
            "source": "rt"
        },
        {
            "content": "Some interesting themes in the first entry of Bergman's so called 'Trilogy of Faith.' Gunnar Bjorstrand is always good.",
            "review_date": "2012-04-20",
            "source": "rt"
        },
        {
            "content": "A tour de force of existential angst!  Another Bergman great.  A young woman's re-descent into madness amid complicated inter-relationships in her family.  As usual, Berman explores religious themes as a part of dysfunction.  Harriet Andersson gives an amazing performance.",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "Another masterpiece from Director Bergman, I think that this film is the most psicological of his oeuvre.",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "The first of Bergman's trilogy about the absence of God, and maybe its best.  The disintegration of a woman's mind and the family's collapse make great drama and provide a potent setting for Bergman's thoughts.  Andersson's performance is one of his best.",
            "review_date": "2012-03-21",
            "source": "rt"
        },
        {
            "content": "The slow beginning of Through a Glass Darkly is quite deceiving. I was just beginning to think the film wasn't really up to much when matters started to darken and a great performance from Harriet Andersson began to emerge. It's just the type of turn that would be a shoe-in for an Oscar these days. Her descent into insanity is especially jarring considering how mundane everything seems beforehand. As usual Gunnar Bjornstrand and Max von Sydow add a lot to every film of Bergman's in which they appear, and here Bjornstrand in particular gives quite a layered portrayal of a self-involved writer suffering great guilt at his own cowardice in life.",
            "review_date": "2012-02-23",
            "source": "rt"
        },
        {
            "content": "Through a Glass Darkly is simply a technical tour de force and a masterpiece.",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "Quite simply stunning. I've started calling this film, along with winter light and the silence, the spider trilogy. The lighting is wonderful, the acting gripping (again using his reliable troupe of actors) and really blew my brain out. To think people were making dramas this good when Hollywood was making piffle, boggles the mind.as for the plot? You're better not knowing before you watch it.",
            "review_date": "2012-01-10",
            "source": "rt"
        },
        {
            "content": "One of the tougher films to sit through in Bergman's library. The inability of these four characters to somewhat connect with one another is displayed so well, almost too well. Gorgeous Sven Nykvist cinematography. The framing and lighting might be the best of any Bergman film. So much subtle symbolism in the way faces and bodies are framed. The four actors are fantastic but Harriet Andersson shines brightest.",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "A difficult watch, but it is beautifully shot and rife with symbolism and philosophy, as with most Bergman films.",
            "review_date": "2011-12-12",
            "source": "rt"
        },
        {
            "content": "somehow the black and white fit so perfectly for this film, and so does the title' Through a glass\". This theme is persistent throughout the movie. must watch.",
            "review_date": "2011-11-20",
            "source": "rt"
        },
        {
            "content": "Karin (Andersson) has just gotten back from a mental hospital and is vacationing with her husband (Sydow), her father (Björnstrand), and her brother (Passgard) on a remote island somewhere in Sweden. For a short amount of time, the break goes well, but when Karin finds out that her disease in incurable, she begins to hear voices again. Personally, \"Through a Glass Darkly\" isn't really one of my favorite Bergman films because it relies so heavily on symbolism that instead of making the message obvious like in some of Bergman's other films, you really have to rack your brain. But I did so, and the film became a wonderful experience. \"Through a Glass Darkly\" is the beginning of the famous \"Trilogy of Faith\" which also consists of 1962's \"Winter Light\" and 1963's \"The Silence\" and the messages of all three have to do with one of Bergman's most popular topics: religion, which is some pretty heavy stuff. The film doesn't deal with it as blatantly as \"Winter Light\" but instead it reflects on the topic either metaphorically or literally as one of the topic's (the voice Karin hears is supposedly God) so most of the time, the movie seems to be more of a mental illness film than anything. If you look at it that way it's still good, but if you really focus on the topics it deals with, you'll be in for a philosophical treat. There's still another few side notes: the film features Sven Nyqvist's cinematography at the beginning of his and Bergman's collaborations, it's the last to feature Harriet Andersson as a hot young thing, and it was the second time Bergman won a Best Foreign Language Film Oscar. All in all, \"Through a Glass Darkly\" is like many of other Bergman films in that it has gorgeous cinematography and excellent acting from the entire cast, but it still has perks that you'll have to see for yourself.",
            "review_date": "2011-11-17",
            "source": "rt"
        },
        {
            "content": "It is a pity this movie is in black and white. The scenario and the landscape must have been wonderful. The light is already amazing as it is, I can't guess how it was looking like in reality. In this background, just few actors are making a drama taking place. I am always surprised how good the actors are in Bergman's movies and the roles they take on are nothing but simple, where a lot is expressed not through the words but through the face expressions. The film is digging, through the disease of Karin, the truth about different worlds, love, the presence of God and comes, in my opinion, to a decent compromise where it is possible to find some relief and gladness in all the misery. However, I find the movie a bit hard to understand without a proper background and that takes away some charm.",
            "review_date": "2011-11-17",
            "source": "rt"
        },
        {
            "content": "Through a Glass Darkly is simply a technical tour de force and a masterpiece.",
            "review_date": "2011-09-23",
            "source": "rt"
        },
        {
            "content": "bergman rocks!  naturally.",
            "review_date": "2011-09-10",
            "source": "rt"
        },
        {
            "content": "I didn't care for this. It was very odd and disturbing at one particular point. I was looking forward to seeing it because I enjoy movies about mental illnesses and disorders, but I really wasn't a fan of this.",
            "review_date": "2011-09-10",
            "source": "rt"
        },
        {
            "content": "What I really admired in this film was the use of light by cinematographer Sven Nykvist. One shot I loved was of the sea through the window. Andersson's gives a courageous performance. A great one, even though it is not one of Bergman's giant films.",
            "review_date": "2011-08-29",
            "source": "rt"
        },
        {
            "content": "A genuine Bergman classic",
            "review_date": "2011-08-28",
            "source": "rt"
        },
        {
            "content": "A beautiful movie with a superbly acted, moving story.  A young woman gradually slides into insanity and impacts the lives of her family.  Her stark moments of clarity amidst her madness lend an interesting and profound perspective to how precious sanity is.  Her condition consumes the thoughts of her loved ones, showing the dark side of selfishness, love, and innocence.",
            "review_date": "2011-08-20",
            "source": "rt"
        },
        {
            "content": "A great date film - grab a glass of wine and drift into the idyllic world of the Swedish family vacation with outdoor meals, amateur dramatics, writing journals and novels,  endless games of hide and seek, full on depression, fishing, incest, swimming and sunshine. Like God, appearing here as a rapist spider, who wouldn't want to join in? Genius.",
            "review_date": "2011-07-31",
            "source": "rt"
        },
        {
            "content": "the first part of the silence trilogy by Ingmar Bergman..and the trilogy started on a fantastic note..the black and white cinematography throughout the movie was very impressive..with precise camera movements and brilliant lighting it was a treat to the eyes..the ending dialogue between father and son was noteworthy and somehow expresses bergman's views on love and god !",
            "review_date": "2011-07-30",
            "source": "rt"
        },
        {
            "content": "\"Reality burst open.\" This stark and deeply disturbing film was the first in Ingmar Bergman's trilogy on faith, and it kicks open the doors to his impressive sixties movement, one which is filled with expressively grim dramas. After a successful decade filled with some of his most imaginative work, Bergman decided to come face to face with a subject he had grappled with his entire life (and would continue to do so). This film doesn't so much go searching for God but instead searches for reasons to search for him, and though it is remembered for its depressing main storyline it actually contains moments of hope and modesty. While it is Harriet Andersson who gives the film its terrifying and heartbreaking center, it is Lars PassgÃ¥rd who lends it its lingering effect. The last sequence, in which he finally engages his father in a conversation which carries weight for him, is the film's most powerful if also its quietest. Bergman's recently acquired partnership with cinematographer Sven Nykvist results in some truly haunting photography, and it is his knack for natural light and isolating compositions which gives this chamber piece its visual punch.",
            "review_date": "2011-07-18",
            "source": "rt"
        },
        {
            "content": "Sweden's enigmatic Ingmar Bergman wrote and directed this piece of melancholia concerning a young woman, just out of the mental hospital, who retreats to her isolated island home along with her sad, frustrated father, her alienated husband, and her deeply disturbed brother. Beautiful cinematography by Sven Nykvist adds dimension to Bergman's story, but the meanings are either scattered or obtuse. The movie is appropriately moody and despairing, but doesn't seem to be directed or acted with much conviction. Bergman isn't at all interested in getting this material through to us, and audience alienation isn't good for any movie-maker. Still, it won the Oscar for Best Foreign Film and has a good cast, including Harriet Andersson and Max von Sydow",
            "review_date": "2011-07-14",
            "source": "rt"
        },
        {
            "content": "It takes until the third act for anything to really happen, but I would be willing to watch it again.",
            "review_date": "2011-07-07",
            "source": "rt"
        },
        {
            "content": "Whilst not perfect or consistant, it's remarkable in most senses and the themes and story stay with you long after the film finishes. Not one for modern audiences, as it requires you to think.",
            "review_date": "2011-07-04",
            "source": "rt"
        },
        {
            "content": "In a time so inundated with cinematic gimmickry, a filmmaker such as Ingmar Bergman would never succeed. Rather than fancy camera work, he relies on powerful framing and the story itself to move viewers.\nThe first film in his faith trilogy is starkly austere. Bergman's characters emerge from the water and enter a world of isolation. Not only isolated on an island that is surrounded by the silence and the serene, but emotionally isolated as well. Gunnar Bjornstrand plays the career obsessed patriarch whose forced  and shallow attempts at reaching out to his family are obvious to all . Max Von Sydow is the husband who goes through all the right motions, but seems rather emotionless toward the wife he claims to love. Finally there is Karin, played wonderfully by Harriet Anderson. Karin is deemed mentally I'll, but her real suffering comes from the lack of God's presence. This yearning, this malady, she is conscious of, which makes God's silence all the more unbearable. What makes things worse is that those closest to her are unable and/or unwilling to understand her.\nThere aren't any major twists and turns, just an sincere look at the existence of a loving God.\nIn doing so, Bergman conjures not only powerful imagery, but also almighty observations about human existence.\nWe are so adroit at refining our lives and suppressing what we really feel, that we believe our lies to be truth. These aren't easy observations to swallow, but it is refreshing to know that a gifted storyteller like Bergman has tried. \nIt may be a bleak glimpse of humanity but I'll be damned if I ever find a film more honest than this.",
            "review_date": "2011-06-23",
            "source": "rt"
        },
        {
            "content": "The first of the trilogy (together with Winter Light and The Silence), the film is a pendulum to find the hidden treasure one would see in cinema. The isolated environment, the suspenseful relationship, the lonesome feelings; these are benefactors to the characters who try to reconcile with each other. Its minimalistic structure, shown in the music department and mise-en-scene, provides a subtle ride for the audience to enjoy its metaphysical journey, which I think is still unclear and probably inexplicable, yet is always interesting. A film from Ingmar Bergman, my first viewing of the director's work, a memorable gift to my cinematic inquiries.",
            "review_date": "2011-06-22",
            "source": "rt"
        },
        {
            "content": "Another unsual film from the Swedish director Ingmar Bergmann and the first of three of his early 1960's trilogies. The plot is not what I thought. Four characters vacation on a lonely island (I assume off the coast of Sweden). However, the daughter (Harriet Anderson), who was recently released from a mental institution, suffers szhizophrenia and her husband (Max Von Sydow) fears that her disease is incurable. The main story of the film does concern the daughter's mental issues, but a minor storyline also concerns a man (Lars Passgard) who wants to have a real conversation with his father (Gunner Bjornstrand). Though it does start to bog down on the storyline of the disturbed daughter a bit much, this is still a very good film. It is compelling, interesting, and beautifully filmed. The lighting is really, really well done. Now onto \"Winter Light!\"",
            "review_date": "2011-06-06",
            "source": "rt"
        },
        {
            "content": "\"David: We draw a magic circle and shut out everything that doesn't agree with our secret games. Each time life breaks the circle, the games turn grey and ridiculous. Then we draw a new circle and build a new defense.\nKarin: Poor little daddy.\nDavid: Yes, poor little daddy, forced to live in reality. \"",
            "review_date": "2011-05-28",
            "source": "rt"
        },
        {
            "content": "I was expecting this movie not to have a plot, but it did.  It made perfect sense to me in that regard.  I can't figure out where incest was part of the movie too.  There are some really great lines that were already pointed out in previous reviews.",
            "review_date": "2011-04-21",
            "source": "rt"
        },
        {
            "content": "I watched this last night and was amazed by it. I found it to be starkly beautiful and haunting. The acting was wonderful. And the way it addressed deeply human and spiritual questions kept me awake too long.",
            "review_date": "2011-04-14",
            "source": "rt"
        },
        {
            "content": "Ingmar Bergman's 1961 film SASOM I EN SPEGEL (Through a Glass Darkly) was the first of his \"chamber films\" of the early '60s. These form a trilogy, all of intimate plots involving a minimum of characters and concerned with the \"silence of God\", Man's burden of surviving in life on his own with no clear direction from above. They intensify even further the existential angst of the late '50s films (DET SJUNDE INSEGLET, JUNGFRUKALLAN) but introduce the interpersonal themes that were to preoccupy Bergman for the rest of his career.\n\nAs the film opens, we see four people coming in from a swim in the cold Baltic Sea. The novelist David (Gunnar Bjornstrand) has returned home after a sabbatical in a distant country, reuniting at their summer home with his son Minus (Lars Passgard), daughter Karin (Harriet Andersson) and her husband Martin (Max von Sydow). Karin has suffered from some time from schizophrenia, though she had regained lucidity to a degree. Four characters is all it takes. The plot is driven through Karin's illness, Minus' awkward budding manhood, and David's self-centeredness and uninterest in his family's plight. Though wracked by delusions, Karin ultimately provides a key insight about Man's place in the world.\n\nThe superb quality of Andersson's acting can be judged by how uncomfortably close to home it hits this viewer, who had a loved one suffering from schizophrenia. This was the first Bergman film where Sven Nykvist was principal cinematographer, and there's a certain purity to the shots, as if they were sculpted from marble, compared to his later work. All in all, this is a powerful effort, though my favourite of the chamber trilogy is NATTVARDSGASTERNA (Winter Light).\n\nWhile the film is available on a standalone DVD in many markets, I'd recommend getting the film as part of the Criterion Collection box of the \"chamber trilogy\".",
            "review_date": "2011-04-13",
            "source": "rt"
        },
        {
            "content": "Ingmar Bergman's Through A Glass Darkly is a wonderfull movie where the whole picture is once again carried away only by the great acting preformances in this case Harriet Andersson in her most superb preformance ever.",
            "review_date": "2011-04-09",
            "source": "rt"
        },
        {
            "content": "I'm looking forward to watching the rest of the trilogy.\n\nI always have more to say about the poppier movies I see, probably because I usually don't want to actually give a serious review and it seems a little silly to be all \"LOL spiders!\" here. It will definitely take a second viewing, probably after I've seen the others, to form a full opinion. For now, let's just say spare but intense.",
            "review_date": "2011-03-08",
            "source": "rt"
        },
        {
            "content": "A very good film apart of the works of the greatest Swedish filmmaker in history, Ingmar Bergman.",
            "review_date": "2011-03-06",
            "source": "rt"
        },
        {
            "content": "Great movie from the Faith Trilogy.",
            "review_date": "2011-03-02",
            "source": "rt"
        },
        {
            "content": "I love Bergman's touch. His movies are made in such a way that I would never refer to as \"entertaining\", but nonetheless unforgettable. There is no gore, no explosions, no graphic sexuality...just a message hidden in obscurity. And for those who can understand the message, it stays with them.",
            "review_date": "2011-02-18",
            "source": "rt"
        },
        {
            "content": "what a script! what characters! stunning.",
            "review_date": "2011-02-10",
            "source": "rt"
        },
        {
            "content": "B = Well above average",
            "review_date": "2011-01-29",
            "source": "rt"
        },
        {
            "content": "When I watch Bergman's films, the time passes so fast...",
            "review_date": "2011-01-27",
            "source": "rt"
        },
        {
            "content": "I think initially this film struck me as powerful, horrifying, intriguing and disturbing. The viewer is as hypnotized by Karin's(Harriet Andersson) decent into madness as her family is. We are just spectators in this horrible transformation. Perhaps it is like looking through a glass darkly. Through those ancient mirrors made of metal, we all are darker when we truly see ourselves. But the film is even deeper than madness. It's hard for me to put into words what it is. \r\n\r\nIt's seems an affront on god, but what Bergman film isn't (or at least question what people think god is). This one especially painted a grim picture of god. When Karin finally seems him, she retreats in screams and horror. Bergman asserting god isn't what he/she's made out to be, perhaps it's even a monster. Perhaps it's chaos. Obviously Karin was lost, between two worlds as she says. Her spiritual world, behind the wallpaper is one of visceral warmth and sensuality....I don't know why. She seems to orgasm at one point while in this world waiting for god. \r\n\r\nShe also seduces her own brother resulting in the infamous \"incestuous clinch\" read into it however you want. I'm not sure why Bergman so desires to dabble in the taboo. The scene did prove how deeply disturbed Karin was and how it affected the people around her...but perhaps that could have been done another way.  There was so much going on for a film with basically little as far as plot is concerned. \r\n\r\nI loved the play the Karin and Minus put on for their father. It mirrored the story and alluded to what was to come. It felt foreign and genuine to me. Bergman was also amazing at capturing Karin's dementia in a truly terrifying yet simple way. The camera work was especially great, amazing close ups, great lighting, and some awesome shots were the camera lingered as characters moved in and out of the frame (I think he had a new cinematographer in this one). \r\n\r\nMy qualms with the film were with some of the relationships. The brother/sister relationship that he painted felt very much like a boyfriend/ girlfriend relationship. There was all to much sexual frustration and flirtations between the two ( and even allusions like the spilled milk scene). Minus was illustrated as basically the object of her seduction, too full of lust and angst to resist his sisters temptations. And as good as Bjornstrand is, the father didn't seem too believable. But perhaps that was because he truly was estranged from his family. \r\n\r\nAll in all, you will not soon forget this film, and with it's flaws it is still a very good film. It will be burned in your cranium like a water mark on your brain. In the least for how truly disturbing it is. Once it gets going you will be enthralled by it, waiting to see what happens next and just how far Karin will descend. Oh...and god is love.",
            "review_date": "2011-01-27",
            "source": "rt"
        },
        {
            "content": "\"a poet with no poems, a painter with no pictures, a musician with no music. I despise ready... made art, the banal result of vulgar effort. My life is my work and dedicated to my love for you.\"\r\n\r\nRecently released from a mental institution, Karin is on holiday with her family. But their inability to give her love and support causes a mental breakdown that leads to a hallucinogenic episode during which Karin envisions God as a spider.\r\n\r\nThe film is absolutely gorgeous, I mean this not in the sense of script or direction. It's beautiful in the simple shallow sense of it being a treat for the eyes. The art direction is eye popping, the cinematography is smashing,  and classical artist Johann Sebastian Bach's Sarabande from Suite No. 2 in D minor is such a pleasantly haunting tune to the ears.\r\n\r\nAs far as script and direction is concerned, the film is high-brow in the purest sense. Excellently acted and intensely engaging. Required viewing for fans of cinema.",
            "review_date": "2011-01-07",
            "source": "rt"
        },
        {
            "content": "this movie sucked soooo much never ever EVER watch it!!!",
            "review_date": "2011-01-04",
            "source": "rt"
        },
        {
            "content": "My favorite Bergman movie is every single fucking one.",
            "review_date": "2011-01-04",
            "source": "rt"
        },
        {
            "content": "Hmmm. Very odd. 71/100\r\n\r\nMore at: http://thegreatestreview.blogspot.com/2010/12/through-glass-darkly-sasom-i-en-spegel.html",
            "review_date": "2010-12-29",
            "source": "rt"
        },
        {
            "content": "Perhaps not my favorite film from Bergman's filmography but still you feel awe by watching this battle of the characters with their fears in an isolated place where everyone is trying to find God with mostly destructive consequences...",
            "review_date": "2010-11-18",
            "source": "rt"
        },
        {
            "content": "Great cinematography is not the only necessary element for me to embrace a movie. 1 'Silence of God' film down, 2 more to go this week...\nI just hope each film is better than the previous one, like in Yasujiro Ozu's 'Noriko trilogy' (though in the case of the 3 Ozu films, all 3 of them made my top 500).",
            "review_date": "2010-11-11",
            "source": "rt"
        },
        {
            "content": "Ingmar Bergman's first masterpiece of his chamber films (tho he denies it being a trilogy) includes some of Bergman's finest moments. No director has displayed psychosis as accurately and imaginative as Bergman's masterful scene with Karin gone crazy and slipping into the disease rapidly she has to, in a very avant-garde fashion, essentially fight a giant spider.\nKarin's madness is enough to recommend this movie but then there's the great acting from everyone, Max Von Sydow, but mainly Gunnar Bjornstrand who gives another riveting performance as a writer going through an existential and family crisis. It's hard to take your eyes off 'Through A Glass Darkly' for its magnetic magic, acting, an unnerving tone. Nykvist once again plays with light and darkness brilliantly and the overall gothic tone and textures make the movie one of Nykvist's finest photography creations.\nThe one qualm I have, that isn't big enough to spoil the movie, is that the film picks up in its final moments and gives a very brief window to the next film in the trilogy, 'Winter Light', then it suddenly ends.\nWorking with the finest actors and the greatest cinematographer, Bergman's - always - brilliant script is turned into a phantasmagoric horror show.",
            "review_date": "2010-10-07",
            "source": "rt"
        }
    ]
}