{
  "title": "Black Christmas",
  "rating": 4.7,
  "release_date": "2006-12-25",
  "genre": [
    "Thriller",
    "Horror"
  ],
  "summary": "The remake of the classic 1974 horror thriller in which a sorority house is terrorized by a killer who makes frightening telephone calls before murdering the sorority sisters during the Christmas break. (Dimension Films)",
  "critic_reviews": [
    "The flashbacks are wittily gothic, and the present-day murder scenes have the absurdist, chain-reaction intricacy of the \"Final Destination\" deaths.",
    "This film is an evocative, effective entry into the holiday blood-spray subgenre in its own right. And if it doesn't make your skin crawl ... you probably ate too much Christmas dinner.",
    "Silly, obvious, clumsy, and just gruesome enough to keep jaded genre fans from angrily throwing popcorn at the screen.",
    "Morgan borrows Christmas-specific nastiness from a wide range of fright flicks, but the result is less than the sum of its parts.",
    "Where the first film was a seminal forerunner of early stalker classics like \"Halloween,\" this version feels as stale as old gingerbread.",
    "Like an ugly tie or a pair of slipper socks, Black Christmas is destined to be forgotten the instant it's unwrapped, gathering dust until the season rolls around again.",
    "There are a couple clever touches here and there, including one sequence in which the end of a candy cane has been carefully licked into a highly lethal weapon, but for the most part the accompanying histrionics feel more regressive than retro.",
    "It exchanges the police subplot that gave the earlier film its steady pace for a lot of pointless backstory about the mother-fixated stalker.",
    "Lazy, perfunctory and free of tension, the new version will satisfy neither the admirers of the original nor anyone looking for a gory respite from seasonal good cheer.",
    "Props to the Weinstein Brothers for having the guts to release a slasher film on Christmas Day. Too bad this one is the cinematic equivalent of tryptophan.",
    "Twice as many accidental laughs as scares.",
    "Seems to go out of its way to obliterate all the elements that made the original so special.",
    "Bad film fans will think Christmas has come early, everyone else should ask for the receipt.",
    "With a peephole-riddled set and a flashback-heavy screenplay, Black Christmas smothers terror beneath a blanket of unnecessary information, revealing too much and teasing too little.",
    "It's debatable whether the original 1974 \"Black Christmas\" is, as its most rabid fans claim, the mother of all slasher movies. But there can be no argument regarding the scant merits of its slapdash, soporifically routine remake, suitable only for the least discriminating of gore hounds.",
    "The remake neither pays perceptive tribute to the original nor updates it in anything but hackneyed form.",
    "The product itself isn't so much afterthought as afterbirth -- a bloody mess to be dumped discreetly."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I was pleasantly surprised by this movie, I expected a total ripoff of the original but found a more extended background for the Christmas Killer. Found myself saying more than a few times \"nasty\", is the way people where killed off. To Glen I was pleasantly surprised by this movie, I expected a total ripoff of the original but found a more extended background for the Christmas Killer. Found myself saying more than a few times \"nasty\", is the way people where killed off. To Glen Morgan I would like to say that I've gone from Renting this DVD to Buying it, it is a good companion to my original, thank you for a new Christmas Slasher movie.",
      "review_date": "2007-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A surprisingly large amount of fun packaged into what could be viewed as a very mediocre set of decorations on a rotten Christmas ham. One of the better horror remakes of recent times, made all the better by it's lack of morality. A surprisingly large amount of fun packaged into what could be viewed as a very mediocre set of decorations on a rotten Christmas ham. One of the better horror remakes of recent times, made all the better by it's lack of morality. Certainly better than the recent The Hills Have Eyes II.",
      "review_date": "2007-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I loved the sense of violent tension.",
      "review_date": "2007-09-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent acting! suspense was good, there was alot of gore and some disturbing parts but overall i really like this movie!",
      "review_date": "2006-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Far more fun than I was expecting.",
      "review_date": "2006-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I've heard the US version got butchered by the studio, but the EU version I watched was great. Can't wait for the DVD which hopefully should include at least all the deleted scenes, and at best a director's cut complete with I've heard the US version got butchered by the studio, but the EU version I watched was great. Can't wait for the DVD which hopefully should include at least all the deleted scenes, and at best a director's cut complete with Morgan's commentary.",
      "review_date": "2006-12-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hilariously Dimension films thought that this film would market better by having Christmas related death scenes added to the trailer, of which none appear in the actual film. This should have been the first indication that maybe the movieHilariously Dimension films thought that this film would market better by having Christmas related death scenes added to the trailer, of which none appear in the actual film. This should have been the first indication that maybe the movie needed to be tweaked. Far too much in your face and not enough suspense.",
      "review_date": "2014-06-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's the worst argument in the history of cinema! Besides the argument is so typical and repeated ... The only thing I liked was that in the film are very good and famous actresses. Gore, pointless and nasty!",
      "review_date": "2012-09-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When this movie ended i felt that it missed something on its way, but nonetherless the girls acting were good especially Mary Elizabeth Winsted, Cristal Lowe and Michelle Trachtenberg",
      "review_date": "2011-04-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Really, really good. The best slasher i have seen in years, all the actors were fine (especially Michelle Tratchtenberg, and she has the best scene in the movie as well). The mix of black comedy and gore really worked.",
      "review_date": "2006-12-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Truly terrible. Completely disappointing. Even actors such as Lacy Chabert who is brilliant in Mean Girls can't lift the completely predictable and boring plot. Yes, it is gory but the film feels so cheap and sleazy--complete waste of Truly terrible. Completely disappointing. Even actors such as Lacy Chabert who is brilliant in Mean Girls can't lift the completely predictable and boring plot. Yes, it is gory but the film feels so cheap and sleazy--complete waste of money. The idea of a scary Christmas film was different...but this film is just a rip off of films like Final Destination with the characters being killed off one by one. I almost left early.",
      "review_date": "2007-01-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is a poor versoin of the original, baring the same name. No film of last year was great, but this film was just awful. Everything about this movie is just terrible.",
      "review_date": "2007-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "So stale. Nowadays the horror film doesn't consist of tactics to scare the audience, but instead we're treated to good looking women who are killed by random people with no story and all in the same exact way. I'm not kidding. So stale. Nowadays the horror film doesn't consist of tactics to scare the audience, but instead we're treated to good looking women who are killed by random people with no story and all in the same exact way. I'm not kidding. Every single person in this movie other than the killers and one woman are stabbed to death. One person's stabbed with a pen, another with a candy cane, and ice skate, a FREAKING unicorn decoration, an icicle magically falls through a woman's face. It's ridiculous.",
      "review_date": "2008-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Duhh, it was great!!! random violence with no story is what makes film great! this is NOTHING like every single other 'teens running around getting stabbed and mutilated' movie out there, because movies like this are changing the Duhh, it was great!!! random violence with no story is what makes film great! this is NOTHING like every single other 'teens running around getting stabbed and mutilated' movie out there, because movies like this are changing the game. these idiots are just rating it low because they don't understand how amazing and innovate teens running around screaming and dying is! this is a completely original formula! i'm fifteen and i've seen three movies in my entire life!!",
      "review_date": "2006-12-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bad movie. Lots of gore, but a stupid story line. Not worth the money.",
      "review_date": "2006-12-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm saying a 5 because they finally got it half right... the part that was half right was the gore. Finally a horror/slasher film, that ISN'T rated pg13. The other half was awful, the plot and characters felt thrown together.",
      "review_date": "2007-01-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A clumsy remake that did much more to buitcher the plot and dark ending of its namesake than it did to butcher utterly forgettable sorority girls.",
      "review_date": "2007-12-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Worst movie I've seen in a long time. Putrid and shameful attempt to cash in on the success of horror remakes. Insulting to the viewer.",
      "review_date": "2007-03-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Probably one of the worst movies I have ever seen. Acting is terrible, story sucks...everything about this movie is horrible.",
      "review_date": "2008-04-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was so very disappointed to find that this flick, which I was hoping would fall into the \"unintentionally comic\" horror sub-genre, did not bolster my customary anti-Christmas spirit in the least. Although I did get one good laugh; my I was so very disappointed to find that this flick, which I was hoping would fall into the \"unintentionally comic\" horror sub-genre, did not bolster my customary anti-Christmas spirit in the least. Although I did get one good laugh; my husband leaned over and whispered, in a tone of utter astonishment, \"Is that Agnes chick played by Pauly Shore in a blonde wig?! He must've had a really tough time of it since Biodome...\".",
      "review_date": "2007-01-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As Jennifer Hudson proves to be one of the best actresses and best singers of our generation, Beyonce and Sharon Leal prove to be equally outstanding. I have never seen such a Oscar-worthy masterpiece filled with so many Oscar-worthy parts. As Jennifer Hudson proves to be one of the best actresses and best singers of our generation, Beyonce and Sharon Leal prove to be equally outstanding. I have never seen such a Oscar-worthy masterpiece filled with so many Oscar-worthy parts. Eddie Murphy may have erased his career mistakes and declared his best performance ever. A Oscar nomination in his spot would be more than appropriate. He showed tremendous talent in his singing and powerful acting. Jamie Foxx and his outstanding show could bring him another Oscar, this time as best supporting actor. Danny Glover and Anika Noni Rose, in smaller Parts are also outstanding. The movie is undeniably powerful and totally unforgettable. See it and cherish the memories weeks after, because this one will stick with you for life. It is life-changing and it is worth a 2000 dollar ticket if you ask me! It is a privilege to see a movie this amazing. A Genius Masterpiece.",
      "review_date": "2006-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Complete garbage. This film can't decide whether it's playing it straight or for laughs, and therefore, it fails at both. Miserably. For the first 20 minutes, characters walk on screen simply to be slaughtered immediately. When we Complete garbage. This film can't decide whether it's playing it straight or for laughs, and therefore, it fails at both. Miserably. For the first 20 minutes, characters walk on screen simply to be slaughtered immediately. When we finally meet the major characters, they are the stupidest bunch of horror movie characters ever, making bizarre decisions that no one in their situation would. The hospital ending is just ludicrous. The audience booed long and long at the screening I attended. And I couldn't agree more.",
      "review_date": "2006-12-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBlack Christmas, the latest entry in a long thread of horror remakes, is no different than any other. Pointless and unnecessary, Black Christmas follows the plot of the original, without maintaing any sense of spook or scare which the first one offered (the longest chase scene displayed here was somewhere along 20 seconds).Initially, the film seemed like a decent slasher film without many deficiencies. But after multiple viewings, and watching Bob Clark's stunningly macabre original take on the film, the reverence wears off, and the flaws start surfacing all but too blatantly obvious.For one, the backstory and insight offered to the audience regarding our killer, Billy, had gallingly sunk the level of enigma and mystique surrounding the character so low until the antagonist had become nothing but a one-dimensional killer whose inevitable fall you would be awaiting ever so restlessly as the minutes crawl by. Though certainly, he could not have been any worse than the boneheaded stick figures Morgan had standing around like dishes in an all-eyeballs-you-can-eat buffet whose actions scream, \"Kill me now!\".The exasperatingly predictable ending was so used and recycled over and over again that you'd be daft not to see the killer's encore in one brutal mortuary scene. I mean, come on, Hollywood! Spring for a new climax every once in a while.Moving on, performances by the band of ogle-able eye candies were stodgy at times, although a few of the leads did not do all that badly as relative newcomers standing so close to the spotlight. Katie Cassidy and Crystal Lowe did good jobs, seeing as how this is the first time they possess screen times greater than 15 minutes. Although we've seen better from Michelle Trachtenberg and Mary Elizabeth Winstead, they're not to be blamed completely. On a second thought, all of them performed ably, considering the poorly-written screenplay they were forced to reenact.However, not all is completely bad with the film. I, for one, remarkably found Black Christmas to be visually stunning and optically magnifect. It's a treat to the eyes, though not to the ears, as Shirley Walker's final score composition is not nearly as decent as could be, with the cues taking sharp turns up and down at supposedly \"boo\" moments (plus, one or two of them sounded like direct rip-offs from GarageBand). Nevetheless, the disorienting angles set up by Morgan is a job well done, as it gives the film a wonderful sense of eeriness and discomfort it would alternatively lack.Black Christmas's entertaining use of over-the-top gory spectacle also ends up in favor with the film, as it provides a sort of \"campy\" style one might find difficult to see in slashers nowadays since most of them would prefer to obtain a PG-13 rating rather than give viewers their money's worth. Despite that, the film's just one more eyeball-pop away from being labelled \"torture-porn\". Therefore, Morgan has found just the right equilibrium that keeps the film's gore at hand. Additionally, there are quite a number of decent and memorable kills here. And on that note, I'd also like to direct my sincerest kudos to Morgan for an eerily horrifying flashback sequence, concerning a rolling pin, a cookie cutter and fresh milk.The set and production designs were top-notch. They did a wonderful job in assuring that they get the feel and the look right. Although present sorority house may look comfy and cheerful, there's a hidden disquieting note, dubiously emphasized by excellent use of lightings. One more asset worthy to note is the film's short duration. Those not a fan of gore will only have to sustain 80 minutes of this film before the credits roll over. But then again, if you're not a gorehound, why even bother?Verdict:Despite Morgan's well intentions to recreate a strong slasher film from the 1970s, his visage of this re-imagination never succeeds to strike the right note. Regardless of some high points, Black Christmas is better off skipped, especially if you're not exactly a fan of carnage.",
      "review_date": "2010-08-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There's been a lot of negativity about this movie, I never saw the original but I did think this film looked interesting after watching the trailer. Basically, this film is pure fun, it won't win any awards but it is enjoyable. It isn't scaryThere's been a lot of negativity about this movie, I never saw the original but I did think this film looked interesting after watching the trailer. Basically, this film is pure fun, it won't win any awards but it is enjoyable. It isn't scary but the over the top kills and gore make this film enjoyable to watch with friends. The acting is pretty good and the film tries it's best to establish each character before the main bloodshed begins. I'd say my favourite characters were Melissa and Lauren, I like Melissa because of her loyalty and i liked Lauren because she had cracking lines. One of the bad things about this film is the slightly repetitive kills, OKAY! we get you like eyeballs!!!!! but i won't go to much detail here. One of the things the film did well was making you grow somewhat attached to the characters (apart from Kelli, she was just bland). Overall I'd say, go to this film if you like slasher films but don't go expecting a masterpiece. But for what it is, i thought it was a blast to watch, especially with a group of friends.",
      "review_date": "2011-05-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very Scary... To Scary For Me :)The Plot Is Very Stupid, And Useless! I Do Like Two Of The Cast Members-Michelle Trachtenberg, And Lacy Chabert...Acting Is Pretty Bad But Its Fun, But Bad Fun :)",
      "review_date": "2011-02-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A decent, simple horror flick, though not as good as the original by any stretch of the imagination, i'm sure young adults will love this, specifically those that enjoyed sorority row.",
      "review_date": "2012-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "bloody-disgusting made a good point, a horror film should be judged on it's own, not compared to the original, this film isn't great, but today, where everything else is either too gory, too sexual, or too moderated, this film kind of gets itbloody-disgusting made a good point, a horror film should be judged on it's own, not compared to the original, this film isn't great, but today, where everything else is either too gory, too sexual, or too moderated, this film kind of gets it right, and that's why it gets 10/10 - samarathenymph xoxo",
      "review_date": "2012-09-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Artsy camera work, heavily suspenseful, old-school slasher flick. The story is a bit scrambled, the ending a bit silly, but overall better than most of what's being passed off as \"horror\" these days.",
      "review_date": "2006-12-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The 2006 remake of BLACK CHRISTMAS was doomed to fail from the very beginning, and yet it is surprisingly one of the most entertaining entries the Slasher genre has seen in years! Glen Morgan never attempts to recreate the suspense andThe 2006 remake of BLACK CHRISTMAS was doomed to fail from the very beginning, and yet it is surprisingly one of the most entertaining entries the Slasher genre has seen in years! Glen Morgan never attempts to recreate the suspense and mystery of the original, and instead delivers an absurdly hilarious and over-the-top gorefest to bring some holiday cheer to Horror fans. Once again, the Delta Alpha Kappa house is receiving intimidating phone calls on Christmas Eve, the same night when a deranged psychopath killed his family at that very house years earlier. What they don't know is that Billy has escaped from the mental institute and returned home for the holidays! From the very beginning, we are introduced to both villains, which destroys the ambiguity of the original story. In doing so, however, we get to see the makings of these two insane killers in a series of twisted flashbacks. It is no wonder Billy turned into such a model citizen given his pathetic childhood and abusive mother. Back on the loose, he and his inbred daughter wreak terror on the dopey sorority sisters in an eye-popping extravaganza of bloody mayhem! Literally, eye-popping, eye-eating, eye-stabbing... Morgan has found more ways to gouge out people's eyes than anyone ever thought possible! All the while, the onslaught of violence is set to the ironic \"Dance of the Sugar Plum Fairy\" as one idiot character is mercilessly killed after another. Robert Mann's infuriated performance as Billy earns some great laughs as he sets up the character's building rage, but thankfully the mindless sorority girls are quickly dispatched. A guilty pleasure to be sure, BLACK CHRISTMAS is too much fun to be tossed away with the other garbage Slasher remakes like SORORITY ROW or APRIL FOOL'S DAY. -Carl Manes\rI Like Horror Movies",
      "review_date": "2013-02-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love this film. No matter what people say. People who don't enjoy this film are obviously taking themselves too serious and can't sit down and enjoy a movie.",
      "review_date": "2012-04-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The CAST IS NOT THE ISSUE!\rThe Writing Is Creative Buy Sadly Does Not Get The Job 100% Done..\rLacey Chabert And Michelle Trachtenberg Do An Amazing Job!",
      "review_date": "2012-06-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Is a movie with many violent deaths that leave you in suspense. The performances were good although the original had more suspense, but this movie makes up for it with blood and more action.",
      "review_date": "2013-06-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another needless 2006 horror remake noone wanted or asked for, this movie is so absurdly bad its almost trying.",
      "review_date": "2020-01-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The holiday season turns deadly for a group of sorority sisters (Katie Cassidy, Mary Elizabeth Winstead, Lacey Chabert, Michelle Trachtenberg) who are stranded at their campus house during a snowstorm. These coeds better watch out, for aThe holiday season turns deadly for a group of sorority sisters (Katie Cassidy, Mary Elizabeth Winstead, Lacey Chabert, Michelle Trachtenberg) who are stranded at their campus house during a snowstorm. These coeds better watch out, for a vicious killer is on the loose, and he will not care if they are naughty or nice. A gratuitous remake of the 1974 slasher, Black Christmas pumps out the gore and blood with zero creativity, humor, or visual flair. Final Grade is a D.",
      "review_date": "2018-05-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A severely under-appreciated holiday horror. Definitely one I'll be revisiting every Christmas. No, it's not as good as the original 1974 classic, but what is? Just forget about that film and enjoy this for what it is.",
      "review_date": "2021-12-29",
      "source": "metacritic"
    }
  ],
  "num_reviews": 52
}