{
  "title": "BloodRayne",
  "rating": 7.5,
  "release_date": "2006-01-06",
  "genre": [
    "Action",
    "Adventure",
    "Fantasy",
    "Horror",
    "Comedy"
  ],
  "summary": "BloodRayne takes you to another place and time to experience a world where good and evil battle it out -- with mankind as the very prize.  (Romar Entertainment)",
  "critic_reviews": [
    "There are all sorts of noteworthy people in this silly vampire epic, including acting greats Sir Ben Kingsley and Geraldine Chaplin, but the only artist this critic wants to heap praise upon is the regrettably unidentified Supervisor of Blood Splatter: Nice work, dude.",
    "The only thing left unsliced is the ham in BloodRayne, yet another video game adaptation by German genre specialist Uwe Boll and a movie with more fading - or faded - talent than an Italian basketball team.",
    "With minimal flare and maximal gore, Boll simply delivers the turgid drama and incompetently staged action sequences that have made him the unstoppable Big Boss of the gaming community.",
    "Attention, Ben Kingsley (I mean, Sir Ben Kingsley): It's officially time to turn in your Oscar.",
    "Our blood-smacking antiheroine, Rayne (Kristanna Loken), isn't a vampire; she's a dhampir, a half-human, half-vampire cross-fiend who's as anguished, strange, and sloppy as mercenaries, or movies, get.",
    "Just when you thought camp was dead, along comes this bizarre cross between a Tarantino knockoff and a Hammer horror film.",
    "Yet another ill-conceived big screen videogame adaptation.",
    "Why do moviegoers and gamers keep going to see video-game-based movies when neither group is ever happy with the results?",
    "While there's no fun in mediocrity, ludicrousness is another matter. Boll is the best at what he does, and what he does is make truly terrible films.",
    "Semicoherent.",
    "Anemic action-fantasy.",
    "Maybe everyone involved was hoping that no one would see this movie, but Madsen is the only one who should fear anyone seeing his work.",
    "Ghastly-bad."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "It seems like Bloodrayne has just fizzled out. The games were good, but too seldom do games go to movies that turn out even half decent. This movie has once again demonstrated that games-to-movies just doesn't work most of the time. It seems like Bloodrayne has just fizzled out. The games were good, but too seldom do games go to movies that turn out even half decent. This movie has once again demonstrated that games-to-movies just doesn't work most of the time. Forget Rayne, and forget vampires.",
      "review_date": "2006-04-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie didn't really fulfill what was needed to fulfill and do the game justice. Of course, the movie basically put me to sleep on most parts. Sure, some scenes were OK and other scenes where there was actually some action into it, it wasThis movie didn't really fulfill what was needed to fulfill and do the game justice. Of course, the movie basically put me to sleep on most parts. Sure, some scenes were OK and other scenes where there was actually some action into it, it was good, yeah, but it wasn't \"great.\"",
      "review_date": "2011-03-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Omg!! What a load of rubbish. Again! How is he getting proper actors to star in his movies!?",
      "review_date": "2006-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The only reason this gets a 1 is Kristana Loken's bare breasts and the way they got worked over by what's-his-name. A-Mazing. The people saying \"good action\" and \"good sword fights\" probably wouldn't see any difference between The only reason this gets a 1 is Kristana Loken's bare breasts and the way they got worked over by what's-his-name. A-Mazing. The people saying \"good action\" and \"good sword fights\" probably wouldn't see any difference between Plan 9 From Outer Space and Forbidden Planet. Both Sci Fi, both old, heck, same movie, right? Not. These 10's are obviously trolls with the futile agenda of making someone think it's worth spending money on. \"The first great vampire masterpiece\"? Words fail me. \"sat riveted from start to wonderful finish\"? Maybe this person had an exciting dream when they dozed off during Madsen's dead-pan. And what was with the stilted attempt at old-world dialect suddenly interrupted with phrases like \"pee on\"? Was I halucinating or did Loken slip into a fake British accent at the end? Unintentionally hillarious from start to finish. The \"blood splatter effect guy\" had a bigger budget than the writers.",
      "review_date": "2006-07-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best unintentional comedy in years! Uwe Boll is truly one of the worst directors ever to live...too bad the twelve-year-olds giving this film high scores are missing all of the fun!",
      "review_date": "2006-06-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "For some reason, I don't care about those crappy video game movies that Uwe Boil directs. I only just want a reboot of the franchise, but not the game series. I love BloodRayne, a great phenomenal and fun game. However, I agree with theFor some reason, I don't care about those crappy video game movies that Uwe Boil directs. I only just want a reboot of the franchise, but not the game series. I love BloodRayne, a great phenomenal and fun game. However, I agree with the critics reaction and that's why there's poor acting, useless action, and wasteless material that makes BloodRayne one of the worst mediocre video game movies of all time.",
      "review_date": "2011-09-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "All of the low ratings are very suspicious. I am flabbergasted and appalled that viewers standards and comprehension of brilliance have fallen to such low thresholds. This film puts even the classics like Maltese Falcon and Mr Smith Goes to All of the low ratings are very suspicious. I am flabbergasted and appalled that viewers standards and comprehension of brilliance have fallen to such low thresholds. This film puts even the classics like Maltese Falcon and Mr Smith Goes to Washington to shame. The cinematography, direction, acting, effects and philosophical meaning best every performance ever, from Humphrey Bogart to Christian Bale. After you see this movie, kill yourself, because you've already achieved the pinnacle of your life. From here on out, all that remains is a slippery precipice of failure.",
      "review_date": "2008-12-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well what can I say about this film. The effects were excellent and the gory fights were very fun to watch as well. Also alot of the acting was very good as well. On top of this was a good plot which makes this an A+ grade film!",
      "review_date": "2006-04-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quite possibly the greatest cinematic achivement ever. If God were given instructions on how to screenwrite and film, even he wouldnt be able to live up to the standards set by the master that is Uwe Boll. This is something we dream of. The Quite possibly the greatest cinematic achivement ever. If God were given instructions on how to screenwrite and film, even he wouldnt be able to live up to the standards set by the master that is Uwe Boll. This is something we dream of. The kind of film that comes by once in a lifetime. The kind of movie that moves you, makes you want to live. Something of art. Make your children see this film.",
      "review_date": "2006-05-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first great vampire masterpiece. With stunning performances by an allstar cast. The blood rains in Blood Rayne, but that's not the only thing. The fun is raining too. an unparalleled visually kaleidoscopic experience.",
      "review_date": "2006-06-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best film I have ever seen, excellent chromotography and acting. Although the plot was a bit thin it was made up by the gory action. A+",
      "review_date": "2007-03-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you like fantasy-horror movies, this is a great one! I don't understand the bad reviews at all! It's very engaging and holds your attention - yeah, some of the editing and dialogue are choppy - but for an intriguing story with If you like fantasy-horror movies, this is a great one! I don't understand the bad reviews at all! It's very engaging and holds your attention - yeah, some of the editing and dialogue are choppy - but for an intriguing story with atmosphere, it's good. You'll enjoy it!! Doesn't deserve all the panning it got - they just don't understand the genre. (I will admit I laughed out loud at Meat Loaf's scene (bad casting/bad acting) but that can be overlooked. Will probably have a large fan base as time goes on!",
      "review_date": "2007-05-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent film, very good plot and action! Everybody who says this film is crap is wrong",
      "review_date": "2006-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What a film. Sat riveted from start to wonderful finish. The directors vision, masterfully brought to life by a cast of wonderful actors. Ben Kingsley's best role ever. Better than Ghandi and Sexy Beast and Turtle Diaries and Species. What a film. Sat riveted from start to wonderful finish. The directors vision, masterfully brought to life by a cast of wonderful actors. Ben Kingsley's best role ever. Better than Ghandi and Sexy Beast and Turtle Diaries and Species. He may be little and bald, but he is also frank and bald and if you're frank and bald (even if you are also little) than you are probably a brilliant actor.",
      "review_date": "2006-01-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best film of the year,",
      "review_date": "2006-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Terrible. Incoherent. A waste of good talent. But, ah, heck, at least it's not as bad as its sequel (who on earth besides Uwe Boll thought THAT was a good idea)?",
      "review_date": "2009-06-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Man, this movie is just horrible. All these high ratings are pretty suspicious, I wouldn't be surprised if someone were boosting up the score, because there is no way that so many people could enjoy such an utter waste of film.",
      "review_date": "2006-01-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Is there anything less than zero? No plot, no acting performances -- shame Ben Kingsley and you too Michael Madsen -- to speak of, no coherent editing. This isn't the worst film of the year, it's the worst of a lifetime. Somebody, Is there anything less than zero? No plot, no acting performances -- shame Ben Kingsley and you too Michael Madsen -- to speak of, no coherent editing. This isn't the worst film of the year, it's the worst of a lifetime. Somebody, please, stop Uwe Boll before he films again.",
      "review_date": "2006-01-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Pure unadultered bull.",
      "review_date": "2006-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Agreed, worst movie I've ever seen. A long time ago I swore an allegance to Ben Kingsley. Sexy Beast, House of Sand and Fog... great performances. Heck I even enjoyed Suspect Zero where nobody else seemed to. But this is pure rubbish. I Agreed, worst movie I've ever seen. A long time ago I swore an allegance to Ben Kingsley. Sexy Beast, House of Sand and Fog... great performances. Heck I even enjoyed Suspect Zero where nobody else seemed to. But this is pure rubbish. I give it A for casting and special effects, straight F's on acting, editing, music and any other categories. Kingsley still shines bright but there is no support. How Michael Madsen could have said his lines with such vapidity is BEYOND comprehension.",
      "review_date": "2006-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Uwe boll is the absolute worst director out there. bloodrayne proves that house of the dead and alone in the dark were not flukes. however, i do like to read interviews with him where he tries to explain why the critics hate him andUwe boll is the absolute worst director out there. bloodrayne proves that house of the dead and alone in the dark were not flukes. however, i do like to read interviews with him where he tries to explain why the critics hate him and can't handle his films.",
      "review_date": "2006-03-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Basically this movie is a mess from every perspective: editing, story, acting and directing. Ben Kingsley",
      "review_date": "2006-09-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This quasi-vampire train wreck sucked out all of the goodwill and patience in me. This is, hands down, the worst motion picture I laid my unfortunate eyes on. I haven't seen Alone in the Dark . . . and I am afraid to. We finally found This quasi-vampire train wreck sucked out all of the goodwill and patience in me. This is, hands down, the worst motion picture I laid my unfortunate eyes on. I haven't seen Alone in the Dark . . . and I am afraid to. We finally found someone who is a worse director than Ed Wood.",
      "review_date": "2007-03-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Incredible. I've never seen such an amateurish, half-assed film containing names I recognise. Epic fail.",
      "review_date": "2008-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is without a doubt, one of the worst movies ever; though it competes mightily with Alone in the Dark. Bottom Line unless you are a hormonal male teen with repressed sexual or violent tendencies or a very lonely 30+ year old virgin, This is without a doubt, one of the worst movies ever; though it competes mightily with Alone in the Dark. Bottom Line unless you are a hormonal male teen with repressed sexual or violent tendencies or a very lonely 30+ year old virgin, there are no redeeming qualities to this film, which makes it an amazing achievement in badness. Many films might have bad acting or bad directing, but only one has accomplished the complete awfulness that is BloodRayne. Bad Acting, Bad Directing, Bad Script, Bad Special Effects ... the badness just doesn't quit. When Uwe Boll reads this he can use my comments above on the marketing piece as: \"... doesn",
      "review_date": "2006-10-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Once upon a time Ben Kingsley was an esteemed actor. He was riveting in the incredibly good movies Schndler's List and House of Sand and Fog. But alas Kingsley's career steadily going down. Since House of Sand and Fog he has done Once upon a time Ben Kingsley was an esteemed actor. He was riveting in the incredibly good movies Schndler's List and House of Sand and Fog. But alas Kingsley's career steadily going down. Since House of Sand and Fog he has done two average movies (Thunderbirds and Suspect Zero), but now his career has hit a new low. One week into 2006 and we most likely have the worst movie of the year. Uwe Bowl is simply put a terrible director that should never make a movie agian.",
      "review_date": "2006-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Aw COME ON!! Has a proud Gamer Girl and an horror movie fanatic. WTF MATE!? They have killed Blood Rayne! She's a Dhampir,not a vampire for god's sake!! She hired by the Brimstone Society,she loves gory stuff but still!! This movie Aw COME ON!! Has a proud Gamer Girl and an horror movie fanatic. WTF MATE!? They have killed Blood Rayne! She's a Dhampir,not a vampire for god's sake!! She hired by the Brimstone Society,she loves gory stuff but still!! This movie sucked ... like any other movie Uwe has mad!!",
      "review_date": "2006-06-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Utter trash. And this comes from a dude who played the videogame and enjoyed it. Save your money and buy the videogame, it'll be infinitely more better than this load of crap. What I dread most is the thought of Uwe Boll possibly Utter trash. And this comes from a dude who played the videogame and enjoyed it. Save your money and buy the videogame, it'll be infinitely more better than this load of crap. What I dread most is the thought of Uwe Boll possibly getting his hands on Civilization IV, Warcraft or Worms and adapting them to screen.",
      "review_date": "2006-08-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It actually hurt to watch this movie. Soon after its release there was an actual petition to get the director to stop making movies. It passed but he is still going to make them.",
      "review_date": "2008-07-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "They must have convened a Council of Morons to write the script for this movie. And then they selected the actors from a League of Idiots. Once the Team of Fools put the whole thing together, they had a \"movie.\" And the human race is the They must have convened a Council of Morons to write the script for this movie. And then they selected the actors from a League of Idiots. Once the Team of Fools put the whole thing together, they had a \"movie.\" And the human race is the worse for it.",
      "review_date": "2009-01-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Uwe boll, the director, is a total crackpot, this is his third film based on a video game, he has slapped my culture and industry in the face for a third time. He is a very, very bad director. On the upside, he never really got the rights to Uwe boll, the director, is a total crackpot, this is his third film based on a video game, he has slapped my culture and industry in the face for a third time. He is a very, very bad director. On the upside, he never really got the rights to make a movie out of a good game.",
      "review_date": "2006-01-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm going too have to give this a two. Its horrid. This movie is th reason Boll has earned himself the nickname \"the blitzkrieg of bad\". Its awfulness is actually a miracle, due to the talent he has on board. Ben Kingsly, Micheal I'm going too have to give this a two. Its horrid. This movie is th reason Boll has earned himself the nickname \"the blitzkrieg of bad\". Its awfulness is actually a miracle, due to the talent he has on board. Ben Kingsly, Micheal madson, hell, even meatloaf all put on terrible performances, despite thier obvious talents. Billy Zane's character seems pointless, and you'll wonder why hes even in the movie. However, if you want something thats so bad its good, download the hell out of this. Just dont buy it. Lord knows we dont want to fund another Boll movie.",
      "review_date": "2009-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bloodrayne is tied with House of the Dead for worst movie of all time. I was physically angry at this film. Had less depth in story than a porno. This film will be declared as a catastrophic event. Uwe Boll does not deserve life as well as Bloodrayne is tied with House of the Dead for worst movie of all time. I was physically angry at this film. Had less depth in story than a porno. This film will be declared as a catastrophic event. Uwe Boll does not deserve life as well as his fans. I envy the people in the holocaust because they would not have to suffer through this crap. This is another reason why Uwe Boll should not make another film again.",
      "review_date": "2006-11-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Huge fan of Bloodrayne 1 & 2 games. Didn't know who Uwe Boll was before this movie. This was literally the worst movie I've ever seen. PLEASE Boll - never make another movie.",
      "review_date": "2006-11-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best way to watch this movie is to be doing something else while watching, because odds are you'll have more fun doing whatever else you can think of than watching this sack of homogenized **** In fact, just do anything else. Please. IThe best way to watch this movie is to be doing something else while watching, because odds are you'll have more fun doing whatever else you can think of than watching this sack of homogenized **** In fact, just do anything else. Please. I don't know what else to say other than \"why, Ben Kingsley, why?\"",
      "review_date": "2010-08-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I've never played the video games so I can't comparisons between this movie and the games, but I can tell you this movie is freaking terrible. Honestly I have no idea why this was allowed to be made. The plot, acting, writing, setting, andI've never played the video games so I can't comparisons between this movie and the games, but I can tell you this movie is freaking terrible. Honestly I have no idea why this was allowed to be made. The plot, acting, writing, setting, and special effects are all terrible. This is one of the worst movies ever created. Now I know Uwe Boll movies have a reputation of being horrible, but I found enjoyment in his movies House of the Dead and In the Name of the king: A Dungeon Siege Tale, just because they had a so bad it's good quality to them. And I was hoping to find that same enjoyment here, but as you can tell I didn't. In case you can't tell I strongly recommend you avoid this movie at any and all costs. It's horrible and 95 minutes of your life you wont get back.",
      "review_date": "2012-07-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is no good at all. The plot is awful, if you can even call it a plot and the acting is terrible too. The premises is just stupid and it focuses more on inappropriate aspects than an actual story. I understand why critics calledThis movie is no good at all. The plot is awful, if you can even call it a plot and the acting is terrible too. The premises is just stupid and it focuses more on inappropriate aspects than an actual story. I understand why critics called this movie a FAILURE and if I had been weary of this awful movie I would have watched it, ugh! this movie's awful! This reinforces my point about movie-adaptions of games. You cannot adapt a game into a movie without it sucking and you cannot adapt a movie into a game without the game sucking. In my opinion, leave a video game a video game and leave a movie a movie. And to this movie...the reason why this movie is probably so bad is because there was no effort in making this movie I mean...how do you make a bad movie when you try? The director probably threw this train wreck together as a way to make quick cash well if you don't try then don't expect your movie or game to get money or good reviews. Try, and your product will get glory. Overall, Bloodrayne was a terrible movie that shouldn't be watched at all. My advice: Stay away from the movie! The games were decent (from critic reviews I've heard so, after this movie I don't plan to play the games, well I don't have an interest for them) but the point is don't watch it, I did and I regretted it. Bloodrayne is a forgettable movie that is best forgotten.",
      "review_date": "2011-10-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wait, what??? Uwe Boll is the most deservedly lambasted, god-awful director since Ed Wood and \"Bloodrayne\" is only surpassed by \"Alone in the Dark\" in it's trogloditic badness... and it gets a Metacritic user score of 8.0???  Please tell meWait, what??? Uwe Boll is the most deservedly lambasted, god-awful director since Ed Wood and \"Bloodrayne\" is only surpassed by \"Alone in the Dark\" in it's trogloditic badness... and it gets a Metacritic user score of 8.0???  Please tell me there's a whole mess of comedians out there, like review writer ChipG... PLEASE!",
      "review_date": "2012-02-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I have no words to express the mind-numbing horribleness of this film. The 'plot' is inconsistent and barely holds to that of the video game it is based on, the 'acting' is terrible, and the character's are awful. The heaven's sake, theI have no words to express the mind-numbing horribleness of this film. The 'plot' is inconsistent and barely holds to that of the video game it is based on, the 'acting' is terrible, and the character's are awful. The heaven's sake, the Director hired actual prostitutes to play prostitutes in the film instead of hiring actresses! Who does that? Did he send out letters asking for actresses and they all replied with, \"No, your films are crap\"?\rDo NOT see this film, under any circumstances.",
      "review_date": "2013-02-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Kristanna Loken's boobs. Yep that is the ONLY thing(s) that I can say positive about this movie.\r Even with some top tier celebrities, the acting is really sub par, even Kingsly.\r\n\r\nEffects are dumb, action scenes are poorly executed andKristanna Loken's boobs. Yep that is the ONLY thing(s) that I can say positive about this movie.\r Even with some top tier celebrities, the acting is really sub par, even Kingsly.\r Effects are dumb, action scenes are poorly executed and did anyone in production on this movie play the game? Yet another terrible video game movie that spits in the face of its source material.\r Side Note to Uwe Boll:\rSTOP MAKING VIDEO GAME MOVIE ADAPTATIONS!! Please, gamers everywhere are begging you!",
      "review_date": "2014-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "BloodRayne: 7 out of 10: Uwe Boll is not the next Ed Wood, Not even close. (To every person who blithely claims this is the worst film ever I recommend Raptor Island on the Sci-fi network as a primer on how bad genre films can actual be orBloodRayne: 7 out of 10: Uwe Boll is not the next Ed Wood, Not even close. (To every person who blithely claims this is the worst film ever I recommend Raptor Island on the Sci-fi network as a primer on how bad genre films can actual be or perhaps a made for PAX disaster film such as the obviously titled Killer Flood: The Day the Dam Broke.) Yes Uwe's House of the Dead was a particularity stupid film. I hated it too. But Uwe knows how to point his camera in the general direction of the action and keep the action at a pace that holds ones interest.\r BloodRayne is a surprisingly enjoyable genre romp. Yes all the individual criticisms at the film from the bizarre choices in hair pieces and costumes to the silly dialogue are true. But c'mon it's a video game/vampire movie. Really how high are ones expectations going in? For a video game movie it isn't half bad. (Its tons better than say Doom, not as tightly put together as say Resident Evil) Uwe brings a refreshing European sensibility to sex and violence in the movie (In other words plenty of gratuitous nudity and violence). He also makes good use of the Romanian landscape bringing an almost Peter Jackson feel to the proceedings.\r Also in campy side of things it's always fun watching Hollywood professionals ruin careers for the sake of a paycheck. (The way Madsen looks and acts in this movie I wouldn't hire him to do my lawn and Kingsley acts as if he is auditioning for the Mr. Burns role in an upcoming live action Simpson's movie) So Uwe Boll isn't the next Ed Wood more a talentless Paul Verhoeven. Hey at least his films are getting better and BloodRayne is a surprising fun film for those with a less discriminating taste.",
      "review_date": "2014-07-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Uwe bowl is known for making the worst video games adaptation ever seen ... That movie is not an exception!\rActing is ridiculous, post production is laughable, .. ETC  ETC ...\rHowever, this movie is so bad it becomes funny!! (like every uweUwe bowl is known for making the worst video games adaptation ever seen ... That movie is not an exception!\rActing is ridiculous, post production is laughable, .. ETC  ETC ...\rHowever, this movie is so bad it becomes funny!! (like every uwe bowl's movies that's why a lot of people enjoy watching these sh*ts...)",
      "review_date": "2014-09-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another movie from Uwe Boll. Again it is a videogame adaptation and hilariously bad. It is for you to decide if it is entertainingly bad or just awfully bad. Just for reference: Uwe Boll is a legendary director. He is famous for making someAnother movie from Uwe Boll. Again it is a videogame adaptation and hilariously bad. It is for you to decide if it is entertainingly bad or just awfully bad. Just for reference: Uwe Boll is a legendary director. He is famous for making some of the worst movies in recent history and using a German tax shelter to fiance his movies (German stupid money was the applied term). It is the (origin) story of Rayne who is a Dhampir (Half-Vampire) and her struggles with her heritage, life and Vampire father. As you can already see by the ratings the movie is bad. This includes the acting, (out of character) decisions and story. I must admit that it is entertainingly bad and I had a lot of fun. I know that this is unitentionally and I should rate this lower but it is my honest opinion and why should I lie here. Overall a guilty pleasures of a hilariously bad but entertaining movie. You will either enjoy it because of this or hate it with passion.",
      "review_date": "2020-06-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "if you ever wanted proof that Uwe bowl doesn't care when he makes movies this is the proof. with some of the worst acting, effects, action sequences and dialogue that i have ever experienced.  the plot is so bad I swear it must be the firstif you ever wanted proof that Uwe bowl doesn't care when he makes movies this is the proof. with some of the worst acting, effects, action sequences and dialogue that i have ever experienced.  the plot is so bad I swear it must be the first draft rather than the final product and what Ben Kingsley was on when he said yes to this baffles me",
      "review_date": "2014-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Saw 'Bloodrayne' and its two sequels out of curiosity to see if they were as bad as their terrible reputation. As well as seeing whether one of the worst directors of all time Uwe Boll was capable of making a good film. On top of that, likeSaw 'Bloodrayne' and its two sequels out of curiosity to see if they were as bad as their terrible reputation. As well as seeing whether one of the worst directors of all time Uwe Boll was capable of making a good film. On top of that, like Ben Kingsley a lot as an actor and he is reason enough to see anything he's involved in. Did not have my hopes up, because even looking at the advertising and trailers 'Bloodrayne' looked awful.The terrible reputation and dubious advertising do not lie. 'Bloodrayne' to me and many others really is that bad, bad actually is an understatement. Have come to the conclusion that Boll is incapable of making a halfway decent film, have not seen everything of his but all that has been seen has been terrible and as bad as their reputation. As someone who is usually very generous rating and reviewing films, 'Bloodrayne' does stand out as one of the worst films seen recently and actually full stop. Everything is abysmally executed and there are no redeeming qualities at all, have said that about very few films seen recently.'Bloodrayne' couldn't be more inept visually. Photography that is both chaotic and static, bacon-slicer-like editing, drab costumes that don't fit the setting, continuity errors galore (more than anybody can count), afterthought-like visual effects, lighting completely lacking in atmosphere, those can all be found. The music sounds cheap and is never dynamic with anything on screen, often working against it and like it belonged in another film entirely.Writing is horrendously stilted and cheesy, enough to make one want to vomit and the unintentional camp later on becomes exhausting. The action has no momentum or excitement whatsoever, is chaotically edited, under-rehearsed choreographically and a lot of it is incomprehensible. It really takes ineptitude to a whole new level. As is the story, it never comes to life and is not easy to follow often. Boll's direction is typically non-existent and cold, comparing him to Ed Wood is rather insulting when although Wood's films were the complete opposite of fine heart one could see that he had his heart in the right place (something that has never been the case with Boll). The characters are walking cliches that are neither interesting or worth rooting for, instead bland and irritating.You know something is wrong when the best performance comes from an angry-looking Michelle Rodriguez. Elsewhere there is an emotionless lead, Meat Loaf's uncomfortable cameo and Michael Madsen and Billy Zane going through the motions. Worst of it is Kingsley in his worst ever performance, taking hamminess and chewing-scenery-to-pieces to mind-boggling extremes.Summarising, completely bloodless and appallingly awful. 1/10 Bethany Cox",
      "review_date": "2022-03-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first movie was actually quite likable. It had a hot-red haired actress as the main character and the role fit her quite well. It's the closest to the game's story and for a low-budget it performed greatly at the time. I'm comparing itThe first movie was actually quite likable. It had a hot-red haired actress as the main character and the role fit her quite well. It's the closest to the game's story and for a low-budget it performed greatly at the time. I'm comparing it with current gen films like \"Nocturna\". Ugggh, I don't want to remember I saw that. Compared to the latter, this movie is 100 out of 10.",
      "review_date": "2015-10-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good, just good.A faithful adaptation to the video game while being in an original setting that is not part of it's original source material.",
      "review_date": "2021-11-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Yhea this one was not it. It doesn´t have the same flavor alone in the dark and House of the dead have.",
      "review_date": "2021-11-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "1/10 * Schwacher Film. Nicht gut umgesetzt. Zu viel gelabber!! Hab den Film schnell beendet.",
      "review_date": "2020-04-17",
      "source": "metacritic"
    }
  ],
  "num_reviews": 62
}