{
  "title": "Evil",
  "rating": 7.5,
  "release_date": "2006-03-10",
  "genre": [
    "Drama",
    "Sport"
  ],
  "summary": "A coming-of –age drama, Evil is a story of cruelty and the way through it -- but also about genuine friendship and the beginnings of love.  (Magnolia Pictures)",
  "critic_reviews": [
    "This suspenseful, beautifully acted Dickensian drama forces us to confront our own bloodlust: do we root for the teen to win a moral victory or to beat the bad guy to a pulp?",
    "Director Mikael Hafstrom - the gentleman responsible for last year's Jennifer Aniston bomb \"Derailed\" - keeps us guessing as he confidently builds suspense.",
    "A gripping story of one teen's rebellion against his peers' sadistic abuse.",
    "Evil is not, as the title would suggest, a horror film, at least not a conventional one. Based on the autobiographical novel by Jan Guillou and set in the mid-1950s, the film relates the experiences of a troubled young man who's enrolled into a hidebound private school.",
    "Although Evil eventually suffers from its heavy-handed treatment of its subject, it is a well-made and engrossing melodrama.",
    "Håfström doesn't soft-pedal the abuse meted out by either his antihero or his nemeses, which will disturb audience members who want a clean demarcation between good guys and bad.",
    "It's more about giving rich bullies the same comeuppance afforded to sneering wardens with bullwhips, and on those superficial grounds, it's reasonably gripping.",
    "This didactic drama is set safely in the past and says nothing about the culture of conformity at all costs that hasn't been said before.",
    "Bullying is not easy to watch on screen, even--or perhaps especially--if the viewer had the fortune to avoid either side of the bully/bullied equation.",
    "Extremely watchable, even if it never goes as deep as it should.",
    "The movie is as blunt as its title. It portrays such behavior as \"evil\" without offering any deep insights or revelations, beyond handing out the plot equivalent of a lollipop at the end of the movie as compensation for the vicarious anguish.",
    "Is this an allegory against blind deference to fascism? It might be, but the root-for-the-Aryan-jock dramatics seem mildly fascist themselves.",
    "Hafstrom never finds the shades in his morality tale, so while Wilson is an intensely charismatic actor, all he can do is respond to relentless, escalating tortures. It's immensely unpleasant for him, and, frankly, not a whole lot better for us.",
    "Director Mikael Hafström's dramatic sense is so pedestrian and snail's-pace obvious -- since this 2003 feature, he's made the leap to Hollywood with the plodding thriller \"Derailed\" -- one starts biding time for the inevitable retributive smackdown that will save our hero from the gantlet of draggy high-mindedness about counteracting fascism with stony resolve."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "When a human stands up for basic rights and decency in a fascistic society, it is seen as rebellion. This is the story of one such \"rebel.\" Well-acted story that does a good job of falling into the standard formula.",
      "review_date": "2006-07-13"
    },
    {
      "review_title": null,
      "content": "Excellent look into a gruelling and harassed existence at a corrupt bording school.",
      "review_date": "2006-04-07"
    },
    {
      "review_title": null,
      "content": "I absolutely loved this movie. The director is marvelous, as are the cast and screenplay. Little wonder it was nominated for an Academy Award in 2004 for best Best Foreign Language Film. Rent it soon.",
      "review_date": "2006-07-31"
    },
    {
      "review_title": null,
      "content": "La encontre una pelicula increible, muy buena historia y con personajes muy interesantes, recomendada para aquellos que quieran apreciar una linda historia de superacion.",
      "review_date": "2011-12-09"
    },
    {
      "review_title": null,
      "content": "This is just to note my score for this movie which I watched long time ago and totally forgot the details.",
      "review_date": "2019-01-05"
    }
  ],
  "num_reviews": 19
}