{
  "title": "Lucky Number Slevin",
  "rating": 8.5,
  "release_date": "2006-04-07",
  "genre": [
    "Thriller",
    "Crime"
  ],
  "summary": "Lucky Number Slevin is a thriller that twists and turns its way through an underworld of crime and revenge. Set in New York City, a case of mistaken identity lands Slevin (Hartnett) into the middle of a war being plotted by two of the city's most rival crime bosses.  (The Weinstein Company)",
  "critic_reviews": [
    "Hartnett has been stuck in the young-adult heartthrob mode for some time now, but this comic thriller may launch him into meatier fare.",
    "Some of what occurs in Lucky Number Slevin is done with a wink and a nod, although McGuinan (á là Tarantino) doesn't skimp on the gore.",
    "The talk is witty, the twists are ingenious, the look and the mood are drop-dead.",
    "This pop-culture-infused mistaken-identity thriller ultimately grabs hold and beguiles, though its convoluted plot takes a while to get going.",
    "Smilovic's rapid-fire, Tarantino-esque dialogue is consistently razor-sharp, and the elaborate set design - which leans heavily towards shiny, riotously patterned wallpaper - is an eyeball-jangling blast.",
    "Lucky Number Slevin would be too clever for its own good if it weren't so ... darn clever.\r\nThis violent flick is not in the same league as \"The Sting,\" which has my vote for the cleverest winding road toward a happy ending in screenwriting history, but it contains nearly as deft a con job as that 1973 film.",
    "For the most part, though, it works as a clever thriller that entertains through purposeful misdirection.",
    "The film is stylish as hell with sharp dialogue, a tongue-in-cheek plot and visual and editing razzle-dazzle.",
    "The story never runs completely off the rails and is, in any event, just a pretext for a lot of very sharp badinage by Jason Smilovic--a screenwriter who would have been at home writing for Cary Grant--for yards of terrific movie acting and for some well-timed direction by Paul McGuigan.",
    "A thriller that holds less interest - and less water - the more it reveals about what's actually going on.",
    "They almost got it really right with Lucky Number Slevin, but they also almost got it horribly wrong.",
    "The most original thing about Lucky Number Slevin is that it lets Lucy Liu play a screwball heroine.",
    "Thoroughly -- and sometimes justifiably -- infatuated with its own cleverness, this mistaken-identity thriller delights in narrative complication and Tarantino-esque self-awareness.",
    "Unfortunately, director Paul McGuigan tries to make it all serious at the end, and this isn't the kind of story that should be taken seriously.",
    "From its sly, amused performances to its surreal comic book gloss to its artfully nervous camerawork, Lucky Number Slevin sustains the blasé tone and look of a smart-aleck thriller that buries its heart under layers of attitude.",
    "With its diabolical ending, this is the movie equivalent of a crossword puzzle: fun, clever, and disposable.",
    "It's all superficially enjoyable, right up to the point where the big picture starts coming into focus and it's not worth looking anymore.",
    "It's the soulless quality of so many films that value devious plots, smug deception and quirky personality traits over actual story and character.",
    "Features lots of cool dialogue but doesn't provide much of a movie in which to showcase it.",
    "If \"Pulp Fiction\" impregnated \"The Usual Suspects,\" the spawn would look a lot like Lucky Number Slevin. Great genes, but you keep wondering when the kid is going to grow up and find an identity of his own.",
    "Lucky Number Slevin is a bag of nerves. Everything here is too much. The older the actors, the saltier the ham of their performances.",
    "Cursed--but ironically!--with stomach-churning '60s decor, Slevin might round off in Park Chanwook country, but the lingering sense of it is as an amusement park for the actors, who are as infectiously overjoyed for the bouncy badinage as preschoolers on Christmas morning. Like tired parents, our enjoyment is primarily vicarious.",
    "Danny Aiello and Robert Forster also turn up in tiny roles that further serve to distract attention from the real business at hand.",
    "There's just too much death, it comes too quickly, it has no moral import, it becomes ultimately meaningless. It's not that hyper-violent movies are axiomatically a bad thing, it's just that this particular example is so laden with shootings that it becomes somehow tedious.",
    "Too clever by half. It's the worst kind of con: It tells us it's a con, so we don't even have the consolation of being led down the garden path.",
    "Comes packed with so many plot twists and reversals, there's barely any room left over for a story: The movie is all clever gotchas and hoodwinks, without any substance to go along with them.",
    "A smug, deliberately convoluted mix tape of Tarantino, the Coen brothers, Guy Ritchie and Hitchcock with (mostly) a cast to die for, Lucky Number Slevin is great fun for, say, 20 minutes.",
    "Lucky Number Slevin is an attempted cinematic sleight-of-hand that has its moments, but is finally just plain annoying, wearing its influences too broadly on its sleeve.",
    "Overwritten, over-designed, and too clever by 200 percent, the film does offer the pleasure of actors enjoying themselves.",
    "With its wiry twists and turns, ends up buckling under the weight of its own cleverness.",
    "The proverbial seems awfully pale here. Fans of Q.T. will find it patently derivative. Fans of Elmore will find it, well, El-less.",
    "The pretzeled syntax is fun for a while. But as the holes are filled in, the film stands revealed as just another vacuous revenge picture. It shrinks your perception of what movies can do.",
    "Another drearily sadistic and pointless crime thriller.",
    "Is Josh Hartnett attracted to cinematic bombs, or do movies merely self-destruct once he signs on as the leading man?",
    "Weinstein Co. honchos Bob and Harvey are chasing some of the old \"Pulp Fiction\" magic--and failing not only miserably, but kind of disgustingly."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I don't know what the official \"critics\" where smoking when they gave this film a worse rating than something like 300 or Disturbia, but I guess the intellect required to understand these texts is on par with the intellect required to I don't know what the official \"critics\" where smoking when they gave this film a worse rating than something like 300 or Disturbia, but I guess the intellect required to understand these texts is on par with the intellect required to be a \"Professional Film Critic.\" I'm actually astounded some of the lower ratings this film has been given aren't accompanied by reviews resembling \"it sucked lots.\"",
      "review_date": "2007-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Lucky Number Slevin was a lot of fun, and a great movie.",
      "review_date": "2006-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In a word, excellent. Acting, directing, dialogue, story, all come together beautifully. Definately one of the best movies of the year.",
      "review_date": "2006-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Keeps you in the dark till the end, then wraps it all up terrifically!",
      "review_date": "2006-04-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Brilliant, twist laden screenplay with witty dialogue. It's a shame that scripts like this do not win the awards they deserve. Whip crack direction maximizes impact, speed, humor, deception, and ultimate clarity. Every aspect of story Brilliant, twist laden screenplay with witty dialogue. It's a shame that scripts like this do not win the awards they deserve. Whip crack direction maximizes impact, speed, humor, deception, and ultimate clarity. Every aspect of story is wrapped up satisfyingly. Great cast plays it to the hilt.",
      "review_date": "2008-05-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely awesome movie. The film makes you connect and believe one thing and then the next minute everything is actually totally different. Then the same thing will occur again. [***SPOILERS***] It confuses the viewer, but in the end all Absolutely awesome movie. The film makes you connect and believe one thing and then the next minute everything is actually totally different. Then the same thing will occur again. [***SPOILERS***] It confuses the viewer, but in the end all is good for the good guys. Great movie keeps you thinking and involved with the movie, which makes great films.",
      "review_date": "2006-10-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent. Clever, witty, with brilliant acting. I loved it!",
      "review_date": "2006-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie! Very enjoybale and very clever. The acting was great, I especially enjoyed Lucy Liu. It's sooooo hard to hate Morgan Freeman, even when he plays a bad guy!",
      "review_date": "2006-04-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Haven't had this much fun at the movies in a while. I loved it...",
      "review_date": "2006-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I dont know what the deal is with these reviews. these guys dont know what the f..k they are talking about, this is an awesome awesome movie. lucky lui and josh hartnett play way against type a nd do a fantastic job, the comedy is clever, asI dont know what the deal is with these reviews. these guys dont know what the f..k they are talking about, this is an awesome awesome movie. lucky lui and josh hartnett play way against type a nd do a fantastic job, the comedy is clever, as is the story, editing, cinemetography, everything in this movie kicks ass. so dont trust the reviews, see for yourself.",
      "review_date": "2006-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A sharp thriller that uses wit and language to keep the viewers connected to the interesting characters and events.",
      "review_date": "2006-04-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Awesome. I need to see this again. I feel like there was a ton of subtle stuff that would have allowed me to see what is coming had I of been aware of it... I need the DVD, it is now in my 'Saved' queue on Netflix.",
      "review_date": "2006-04-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ok i think the majority of these critics watched a different movie..i was expecting to be entertained by this ... i loved it, a fantastic funny movie with plot twists that even though i guessed a few of before the end, still left me with aOk i think the majority of these critics watched a different movie..i was expecting to be entertained by this ... i loved it, a fantastic funny movie with plot twists that even though i guessed a few of before the end, still left me with a huge smile.",
      "review_date": "2006-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The witty dialogue in this movie is addicting, and the characters are very well defined. The art design and visual themes are brilliant and unique. One of the greatest things about this movie is how re-watchable it is.",
      "review_date": "2009-05-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Yes, the critics indeed missed the boat on this one. Oustanding movie, for what it was - and that's a sleeper. I don't want to spoil anything, so just do yourself a favor and see it.",
      "review_date": "2006-04-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie, certainly not what I expected.",
      "review_date": "2006-04-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't understand why the critics don't seem to like this movie more. It is well acted by all involved and we actually see emotional depth from Hartnett in the closing third of film, which is something audiences haven't I don't understand why the critics don't seem to like this movie more. It is well acted by all involved and we actually see emotional depth from Hartnett in the closing third of film, which is something audiences haven't really seen too much of from this teenie-bop actor. He surprised me by pulling his weight in a cast with several acclaimed actors (keep in mind he pulls his weight while being the lead, which has the most weight to pull in an ensemble cast), and actually showed he is capable of taking his craft somewhat seriously. Although the supporting performances are very good from all involved, this movie would simply not be the same without Hartnett's influence through his character. After all, the movie is about him, as you'll see. It's tough to talk any more about the movie without disclosing its secrets. Simply put, Slevin's plot and dialogue are a bit scatterbrained in the beginning, but stay with this movie. It will reward you at the end.",
      "review_date": "2006-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Lucky Number Slevin is a clever little crime thriller that really does a good job hooking you in and keeping you guessing. It ties everything together quite nicely and is a really, really tight film. The acting from Josh Hartnett, MorganLucky Number Slevin is a clever little crime thriller that really does a good job hooking you in and keeping you guessing. It ties everything together quite nicely and is a really, really tight film. The acting from Josh Hartnett, Morgan Freeman, Bruce Willis, Ben Kingsley, Lucy Liu, and Stanley Tucci, are all solid. Additionally, the writing is quite good for the most part. The characters and their place in this neo-noir type film are all quite clear and compelling. However, the undoing of Lucky Number Slevin is two-fold: one, exposition. Nobody needs this much exposition. Christopher Nolan would leave this film thinking, \"Wow that was a lot of exposition\". That is how much of this stuff there is. While needed, obviously, it is not needed to the level found here. Additionally, the film literally walks you through the plot at the end. Any audience is not that stupid. Here, it has to be explained to you because the film did not think you could handle it without having it spoon fed to you. Thus, this is the first time you are seeing most of it. Even worse though, this piece of the film practically undoes the characterizations of the prior 3/4ths of the film. The audience is smarter than this film wants to admit. Though I said it is two-fold, I am reminded of a few more problems that are inherent here, namely how homophobic it is. Holy cow I have not seen a film this homophobic in a while. That said, it is quite entertaining and is a well made crime thriller, both of which help elevate it (slightly) above its faults.",
      "review_date": "2016-04-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Pro tip: when it takes the last half-hour of your movie to explain the first 80 minutes of your movie, you're trying too hard. You see this kind of mistake in other Tarantino copycat films like \"Smokin' Aces,\" \"Suicide Kings\" and even \"ThePro tip: when it takes the last half-hour of your movie to explain the first 80 minutes of your movie, you're trying too hard. You see this kind of mistake in other Tarantino copycat films like \"Smokin' Aces,\" \"Suicide Kings\" and even \"The Boondock Saints\" to some extent. Screenwriters trying to not only outsmart the audience, but themselves. It really doesn't impress. You see the twists and turns coming from a mile away and when they eventually land, you lament the fact that the filmmakers still find the need to explain how we got here. There's some charm and personality on display here and there, but I couldn't help but notice the \"everyone thinks that Quentin Tarantino is the best at writing dialogue? Well, I'll show them!\" sort of aspect to it all. You'd think that Tarantino alums like Willis and Liu would get wise to the knockoffs and counterfeiting, but here we are. I do miss Josh Hartnett, though. Remember when him and Lucy Liu were big draws at the theater? Also, remember theaters?",
      "review_date": "2020-10-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "'Lucky Number Slevin' is a sleek pace movie with a solid cast who all do good work. As the movie goes along, it keeps you guessing.However, I feel like the tone and style of the movie is very messy. The movie starts off bleak, but then'Lucky Number Slevin' is a sleek pace movie with a solid cast who all do good work. As the movie goes along, it keeps you guessing.However, I feel like the tone and style of the movie is very messy. The movie starts off bleak, but then turns quirky and funny - with characters plucked out of a Guy Ritchie movie, and dialogue from a Tarantino movie. Later towards the end it turns into a hard hitting drama.Flawed, but enjoyable.",
      "review_date": "2020-07-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A View to Many Kills.\r If you're feeling depravity-deprived, if you haven't seen enough violent death in the past few weeks -- after all, it's been over a month since \"The Hills Have Eyes\" was released! -- relief is finally in sight.A View to Many Kills.\r If you're feeling depravity-deprived, if you haven't seen enough violent death in the past few weeks -- after all, it's been over a month since \"The Hills Have Eyes\" was released! -- relief is finally in sight.\r That's Paul McGuigan's \"Lucky Number Slevin,\" which despite its nonsensical title turns out to be a slaughterfest dedicated to the proposition that killing the old way is best. It still kills that old way, via pistol, over and over and over and over. It may be the bloodiest film since \"Sin City,\" and it's so bloody that eight people are graphically murdered before the star even appears.\r That star is the scrawny, cute, innocent Josh Hartnett, as one poor schlemiel called Slevin, who appears a typical twenty-something failed-to-launch slacker in baggy T-shirt and raggedy pants, wool cap pulled low over eyes and ears. Is he a punk musician or a computer nerd-genius?\r Well, actually neither: He's a guy who shows up in a buddy's New York apartment, which is the wrong place at exactly the wrong time. Suddenly two very violent gangstas arrive, beat the pep out of him and haul him before The Boss, played by the magisterial Morgan Freeman. Although Slevin protests, the boss isn't too interested in these protests and insists that he, amateur Slevin, is Nick, the actual renter of the apartment. And that since Nick owes him money, he, Slevin, must either pay it back (clearly impossible) or earn his way out of penury by performing a service. That service is a murder that is an act of retribution in the service of a larger tribal battle between The Boss and The Rabbi (Ben Kingsley).\r Before this comes the movie's bloody preamble, which seems to have nothing to do with anything. It's the story, set 20 years in the past, of a young man who tried to hustle the mob by betting on a fixed horse race. For his hubris, he was paid in death, as were his wife and child (all three extinctions clinically documented). From that story, narrated at an airport by a crippled Bruce Willis to a completely different young man, the movie then leaps into the present, where we watch this morning's extinctions, also clinically documented, of a man getting into a car in a parking lot and a bookie and his henchmen being wiped out by an unseen expert in improvised weaponry (including a baseball!). Meanwhile, back at the airport, Willis snaps the neck of the boy he's been talking to like it's a swizzle stick in a slightly used martini glass. That extinction -- in fact, all of them -- are played as punch lines to a joke that everyone but the victim gets.\r The movie has a jaunty, even merry tone for something so blood-soaked. It takes its editing rhythms from the clever Guy Ritchie of \"Snatch\" and \"Lock, Stock and Two Smoking Barrels\" fame (and not \"Swept Away,\" with wifey Madonna, infamy). Like Ritchie's far superior works, it plays a lot of tricks with chronology, with point of view, with concealment and revelation.\r It also bears a more than casual connection to \"Wicker Park,\" which was also directed by McGuigan and also starred Hartnett. Many of the same mechanisms are deployed, so much so that this film could be called \"Wicker Park With Berettas.\" That movie, if you are not among the seven or nine who saw it, was a contempo romance set in Chicago, where Hartnett played a young businessman who falls in love with a girl who then vanishes almost instantly, a mystery that becomes an obsession for him to solve.\r Both films are built around the same structure, which begins with a cleverly filmed scenario in which we watch this and that happen, and take for granted we understand what we've seen. But that scenario is kind of the Rosetta stone of the story, and it is returned to over and over, and with each revisit it becomes more complex. Looking at it from other vantage points, we learn that what seemed innocent and spontaneous was neither; relationships emerge, coalitions are revealed, perpetrators, barely glimpsed in the original, are identified. In \"Wicker Park\" the cleverness and the gamesmanship were fun. Here they're only almost fun.\r There's just too much death, it comes too quickly, it has no moral import, it becomes ultimately meaningless. It's not that hyper-violent movies are axiomatically a bad thing -- \"The Wild Bunch,\" \"The Godfather,\" \"The Seven Samurai,\" even \"Hamlet\" and Orson Welles's \"Macbeth\" show the foolishness of that assertion. It's just that this particular example is so laden with shootings -- rarely gunfights, I should add; mostly quick executions of unarmed people who simply keel over when popped -- that it becomes somehow tedious. The young director is intoxicated with them, but out in the audience, we're beginning to squirm. Let's see some contests, some fights, some skill: No, we're just watching an execution-o-rama.\r The saving grace is both Freeman and Kingsley are charismatic performers, each the master of a posse that reflects a specific ethnic heritage.",
      "review_date": "2016-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "At first it seems like a black comedy. Then it seems like you 're watching a comedy of absurd, then you realize that you have a class B movie with Hollywood actors in front of you. The story turn does not cause any feelings at all, becauseAt first it seems like a black comedy. Then it seems like you 're watching a comedy of absurd, then you realize that you have a class B movie with Hollywood actors in front of you. The story turn does not cause any feelings at all, because any viewer will read it if at least a little follows what is happening on the screen. It is not possible to hide it pseudo conflict of two mafia bosses. The only thing that turned out in the film - dialogues, they are not poorly prescribed and on comedy live.",
      "review_date": "2019-10-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Lucky # Slevin is one of the funner movies I have seen in a long time. The action is great and the plot twists are unexpected. The star power alone is a reason to watch it. Freeman and Kingsley play great crime bosses. Willis and HartnettLucky # Slevin is one of the funner movies I have seen in a long time. The action is great and the plot twists are unexpected. The star power alone is a reason to watch it. Freeman and Kingsley play great crime bosses. Willis and Hartnett play their roles to perfection and even Liu sells her role. All in all this movie is a must see.",
      "review_date": "2011-01-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In comparison with e.g. the new Skyfall-Bond, a ultra-high-budget-production with ultra-high-expectations, this genius thriller is head and shoulders better both concerning story and cast. The outline is brilliant, the actors, includingIn comparison with e.g. the new Skyfall-Bond, a ultra-high-budget-production with ultra-high-expectations, this genius thriller is head and shoulders better both concerning story and cast. The outline is brilliant, the actors, including Oscar-winners Morgan Freeman and Sir Ben Kingsley as well as Josh Hartnett and Bruce Willis, are at their personal best and even an accurate portion of humour was not missed by the fantastic screenwriters and at last Paul McGuigan, the divine director of this great masterpiece of modern cinema.",
      "review_date": "2012-11-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Man gets caught up with gangsters in a case of mistaken identity & has to pay off his friends gambling debts. Twists & turns galore.Very slick indeed & certainly slightly Guy Ritchie-esque in parts but without the Cockney Geezas.Very goodMan gets caught up with gangsters in a case of mistaken identity & has to pay off his friends gambling debts. Twists & turns galore.Very slick indeed & certainly slightly Guy Ritchie-esque in parts but without the Cockney Geezas.Very good cast & very enjoyable to watch.",
      "review_date": "2010-08-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "For me, one of the outstanding crime films of recent years. The incredibly convoluted plot keeps you guessing for most of the film...you believe Slevin is the innocent man mistaken for Nick, and as Goodkat appears in the rival camps, youFor me, one of the outstanding crime films of recent years. The incredibly convoluted plot keeps you guessing for most of the film...you believe Slevin is the innocent man mistaken for Nick, and as Goodkat appears in the rival camps, you wonder who the hell he really works for. The plot threads are neatly tied up in a satisfactory conclusion.  I've never been a Tarantino fan, but he could learn from watching this! I give it a maximum rating.",
      "review_date": "2011-10-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I really do not understand, why this movie got so much bad critics. This movie is just wonderful. Bruce Willis and Josh Harnett aren't the best actors on the planet, but they are doing their job in this movie very good. Sir Ben Kingsley andI really do not understand, why this movie got so much bad critics. This movie is just wonderful. Bruce Willis and Josh Harnett aren't the best actors on the planet, but they are doing their job in this movie very good. Sir Ben Kingsley and Morgan Freeman are always good, so there is no need to talk about them! But not only the actors are good, I find the story just brilliant. It is suspenseful, you never really know who is who, and all this is mixed up with some jokes. It's just great! I've seen this movie numerous times now, and I always wish to see it again for the first time! This most definitely is one of my favourite Films! It really is to be recommended for everyone. Great movie!",
      "review_date": "2012-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wow!!! What a movie. Actors dialogs and story are great. And also a great twist not one of the cheap twists like in other movies, this one here is nice thats how twist meant to be in my opinion. I wonder why the metascore is so low from theWow!!! What a movie. Actors dialogs and story are great. And also a great twist not one of the cheap twists like in other movies, this one here is nice thats how twist meant to be in my opinion. I wonder why the metascore is so low from the magazines.. I dont really understand and i also dont know why this movie was not in the cinema. Its not perfect but a 9/10!",
      "review_date": "2013-10-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A very almost dark comedy that keeps its cards hidden while being thoroughly entertaining and an ending payoff that truly makes you re evaluate every character. topped off with an amazing visual aesthetic that's quirky enough to avoidA very almost dark comedy that keeps its cards hidden while being thoroughly entertaining and an ending payoff that truly makes you re evaluate every character. topped off with an amazing visual aesthetic that's quirky enough to avoid Tarentino comparisons",
      "review_date": "2013-11-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What the hell? Why such low scores from the critics? This movie was absolutely great! Great ideas, interesting characters and thrilling story! Watch it without any doubt!",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I want to be as cool as Pulp Fiction !\rCome on, the main character walking around only with an towel for 20 min. That's so crazy!!\r And we have Bruce Willis who was also in Pulp Fiction so..",
      "review_date": "2015-06-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of my favorite movies. The dialogue is snappy and clever. The story is intelligent and presented in such a fashion as to keep the viewer guessing up to the final reveal. The characters, despite having star actors playing them, areThis is one of my favorite movies. The dialogue is snappy and clever. The story is intelligent and presented in such a fashion as to keep the viewer guessing up to the final reveal. The characters, despite having star actors playing them, are memorable. Quite frankly, I'm surprised that the critics hated it so much, rating it just a couple points higher than sequels to successful sequels made purely to be cash cows (Pirates of the Caribbean sequels anyone?) Compared to the cash cows that receive these low scores (and deservedly so), Lucky # Slevin is funny, well thought out, well paced, and interlaced with enough memorable characters to warrant seeing several times.\r I should add now that I have no interest in movie stars and never see films just because so and so actor is in it. Often, the movies are made simply to cash in on the presence of that actor and little thought is given to much else. This is not one of those movies.",
      "review_date": "2014-09-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The critics are right: This flick isn't anywhere near as smart as it thinks it is. (The \"BIG TWIST\" is one of THE most predictable of any film i've seen of this type), but the cast is still having alot of fun, and so you will you. The critics are right: This flick isn't anywhere near as smart as it thinks it is. (The \"BIG TWIST\" is one of THE most predictable of any film i've seen of this type), but the cast is still having alot of fun, and so you will you. Enough here to make the film worth at least a look.",
      "review_date": "2006-04-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Boring, hyper-violent, a movie that can't seem to find an identity. Josh Harnett spends two full scenes in a bath towel and doesn't come close to pulling it off.",
      "review_date": "2006-04-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Should be shown in screenwriting classes: How NOT to write a movie.",
      "review_date": "2006-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "worst dialogue ever!!!! overtly homophobic. ntl Josh Hartnet held his own w/ a great group of actors who must have been bribed w/ a large movie budget.",
      "review_date": "2008-02-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I only went to see this movie because Morgan Freeman and Lucy Liu were in it. I was extremely disappointed. Josh may be dating hottie Scarlett Johanssen, but he can't carry a movie to save his life!",
      "review_date": "2006-04-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Regardless of subject matter, style or quirky flourishes, the ONLY characteristic that should place a movie in the far-overused category of \"Tarantinoesque\" is that Quentin Tarantino himself wrote and directed it. That didn't stop far Regardless of subject matter, style or quirky flourishes, the ONLY characteristic that should place a movie in the far-overused category of \"Tarantinoesque\" is that Quentin Tarantino himself wrote and directed it. That didn't stop far too many hacks over the past 12 years from watching Pulp Fiction (some more than once) and chirping, \"Hey, I can do this, too!\" Even though such resultant efforts as Things To Do In Denver When You're Dead and The Last Days of Frankie the Fly should've consigned this genre to the same receptacle as the calypso movies of the late 1950s and the lambada movies of the early 1990s, Lucky Number Slevin proves that some dead things just won't stay buried. In telling the story of a luckless kid who becomes entangled in a deadly underworld Hatfield-and-McCoy feud, writer Jason Smilovic and director Paul McGuigan throw in all the expected ingredients: a tricky, flashback-heavy structure, a cast of (mostly) criminals, some bursts of violence and gore that the filmmakers think are too offbeat to be offensive, dialogue that nobody speaks in real life unless they're trying too hard to imitate Tarantino characters, and frequent instances where two or more people pause to have a conversation about some thirty-year-old Top 40 hit or TV show or action movie (in Tarantino's films, these little digressions are often major highlights; in his imitations they just grind the action down to a complete halt). In David Cronenberg's The Fly, scientist Seth Brundle teleported a steak only to find, when applying the taste test, that it wasn't a real steak, and therefore was inedible. Same here: Smilovic and McGuigan do everything that Tarantino does but are missing two essential ingredients: the heart and soul. Go back to David Carradine's self-defining speech about Superman and Clark Kent in Kill Bill Volume 2, or Sam Jackson's surprisingly moving one near the end/beginning of Pulp Fiction about how hard he's trying to be the shepherd, and you'll see that QT has very few modern equals when it comes to revealing character through dialogue. No such luck in Slevin: it's all surface and gimmicks, with obnoxiously baroque look-at-me set design that brought back childhood memories of my sister eating too many Pixy Stix and throwing them all up, a so-called \"surprise ending\" that I guessed almost from minute one (not that predictability is necessarily a fatal flaw, but having nothing else up your sleeve is), and a truly repugnant mingling of bloodshed and sentimentality. Among the large cast, only Bruce Willis and Robert Forster bring something resembling originality or energy (perhaps because they've worked with Tarantino in the past and know the drill)...but this is the first time that the great Morgan Freeman has ever slummed, and as for Ben Kingsley as his rival, \"The Rabbi\", his accent brought none-too-welcome memories of Laurence Olivier's \"I hef no son!\" bit in Neil Diamond's version of The Jazz Singer. (Is the reason he insisted on billing himself as \"Sir Ben\" here that, after doing this and the Uwe Boll vampire movie Bloodrayne in the same year, he felt the need to overcompensate?) And why does Josh Hartnett continue to get steady work, anyway? Inoffensive at best in ensemble movies like Black Hawk Down, Pearl Harbor and Sin City where the special effects and action sequences are the real stars, when he's given leads in things like 40 Days and 40 Nights or Hollywood Homicide or McGuigan's Wicker Park, Hartnett displays terminal blandness of a sort that hasn't been seen or heard onscreen since the last straight-to-video release starring \"the two Coreys\" hit the cutout bin. In all fairness and with due respect, I DO have close friends who DID enjoy this movie (largely because they didn't guess the ending), so in the interest of equal time let me present the op-ed view: Lucky Number Slevin is every bit as clever, witty and well-conceived as its title.",
      "review_date": "2006-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A truly awful movie with no redeeming value which does nothing but glorify violence and sadism. It's all style with no substance.",
      "review_date": "2006-09-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What a poor imitation of 'Usual Suspects'! For some of the e mailers who said this was an intelligent film have insulted intelligence itself. There were several plot flaws which were unforgivable. Like Willis allowing Harnett to What a poor imitation of 'Usual Suspects'! For some of the e mailers who said this was an intelligent film have insulted intelligence itself. There were several plot flaws which were unforgivable. Like Willis allowing Harnett to live when Willis was supposed to be a international killer was BS! Then the obvious clues that Harnett was out for revenge not being noticed by anyone is bollocks. Lastly the acting was as wooden as a forest, all round. Read a paper for intellect, not watch this!",
      "review_date": "2007-06-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It wasn't too bad, but I was bored at times. If you are a mature movie watcher, then I think you will find that you've seen this plot many times before. Usually when you see a good movie, when you get out of the theater, you can It wasn't too bad, but I was bored at times. If you are a mature movie watcher, then I think you will find that you've seen this plot many times before. Usually when you see a good movie, when you get out of the theater, you can discuss what you liked, what you didn't like, what you thought was a good idea. With this movie... nothing. Very shallow and dry.",
      "review_date": "2006-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Completely derivative. Desperately trying to be as intelligent and surprising as The Usual Suspects and as artsy and intriguing as Pulp Fiction, this film fails on all counts. Enjoyable if you haven't seen the movies whose shoulders Completely derivative. Desperately trying to be as intelligent and surprising as The Usual Suspects and as artsy and intriguing as Pulp Fiction, this film fails on all counts. Enjoyable if you haven't seen the movies whose shoulders this film stands or don't mind the cartoonish cast of characters.",
      "review_date": "2008-11-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Funny and well constructed dialogs. This film seems to be a comedy at the beginning - and honestly, a comedy it should have been. The revelations at the end are a little bit confusing, otherwise a good film.",
      "review_date": "2011-06-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's maybe just a case that Lucky Number Slevin was too clever, swapping what could have been a very coherent story of revenge with visual flash and quick cuts, but its still an enjoyable film.\rThe big cast includes Bruce Willis, MorganIt's maybe just a case that Lucky Number Slevin was too clever, swapping what could have been a very coherent story of revenge with visual flash and quick cuts, but its still an enjoyable film.\rThe big cast includes Bruce Willis, Morgan Freeman, Ben Kingsley and Josh Hartnett, with Lucy Liu being the sole female lead in the film. We open a range of ways in this film, with various characters being thrown at us from the beginning, and dialogue perhaps too elegant to fit the plot, but certainly something thought-provoking.\rWe eventually run into Slevin (Hartnett) who is occupying his friends apartment, but is then accused of being said friend, who owes a lot of money to The Boss (Freeman) and The Rabbi (Kingsley), two rival gangsters, who live literally across the road from each other in two identical towers, but a past altercation leaves them almost fearful of the other.\rSmith (Willis) is a master assassin who seems to be whispering in the ear of both gangsters, with the overall goal of keeping the right people quiet. Lucy Liu plays Nick's neighbour Lindsey, who grows increasingly unsure of Slevins role in everything. A  big cast like this does indeed lead to some underlying problems. perhaps the pacing of the story.\rThe plot moves at a very erratic and sometimes confusing motion. Certain cuts and extras seem unnecessary and I was baffled as to why they were in fact there.  At times it is very easy to question the relevance of the whole thing, simply because at times the backdrop is used for a comic effect rather than focusing on what could have been a straightforward and engaging story had it been done a different way. The realisation of Slevin was a nice twist, but only eventually, as director Peter McGuigan took too long to follow up his major twist with the ultimate one.\rLucky Number Slevin is still an enjoyable piece, the acting is excellent from the heavy-hitting cast, all delivering memorable performances and engaging characters, and the story itself, stripping away the visuals and deliberate confusion, is in fact quite good as the climax creeps up.\rThe idea of creating visual standouts just seemed unnecessary, but the acting and decent plot of the film did save it from going too far down.",
      "review_date": "2013-04-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Loved the plot, The clever dialogue that was made even better by the stellar cast attached to it. Slevin is one of the most underrated on Metacritic imo. Take the time to watch it, It's not just your typical action flick.",
      "review_date": "2016-12-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good movie. Not simply because how hot Josh Hartnett is, but how suitable he is for his role. Very good story line because it's unpredictable. Good ending too. Script in some scenes can be too long, but still acceptable. Quite violent but notGood movie. Not simply because how hot Josh Hartnett is, but how suitable he is for his role. Very good story line because it's unpredictable. Good ending too. Script in some scenes can be too long, but still acceptable. Quite violent but not extremely. I just love how brilliant and smart both Josh Harnett & Bruce Willis planned their assassinations. I can watch this over and over again!  I thought Lucy Liu & Harnett were pretty cute too.",
      "review_date": "2012-05-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Intelligent script with a lot of twists, so you need to focus to follow the story. There are a lot of popular actors, I only didnt like Josh Hartnett, he looks too young for his role for example.",
      "review_date": "2022-01-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie is obviously tarantino inspired and i think it reaches up to a great level especially in the clever dialogues , i don't see why the critics characterize this a failure",
      "review_date": "2016-01-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "- What's a Kansas City Shuffle? - A Kansas City Shuffle is when everybody looks right, you go left. That's actually all you need to know about this movie. :)",
      "review_date": "2016-12-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Loved twist plot. Impressively cast, well acted, funny and cleverly written dark comedy that is definitely worth a look.",
      "review_date": "2018-12-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "hkjvycgufyyfguihihhiihojiytrwetfyguhihigyftdtfugihhjjiif⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙☆☆☆☆☆☆::::::::$$$$$$$$$$$$$$$$",
      "review_date": "2021-06-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"\".\".\".\".\".\".\".\".\".\".\".\"",
      "review_date": "2021-06-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Brilliant! Excellent dialogue, direction, acting. Terrible wallpaper. What were they thinking?",
      "review_date": "2006-04-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Pretty good and interesting movie. I agree with someone that said above, don't read the critic reviews. If you want a movie with a twist and some humor, then this movie wont disappoint you.",
      "review_date": "2006-04-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Lotta similiarities to the Kill Bill films. Kudos to the director for \"connecting all the dots\" at the end.",
      "review_date": "2006-04-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quality Acting, Quality Directing, Original Storyline. However, it was extremely boring at times. The movie was also a bit predictable.",
      "review_date": "2006-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie kept me wondering till the end. Unlike most movies you can figure them out in the first 30 minutes.",
      "review_date": "2006-09-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Witty and bloody just how I like it",
      "review_date": "2006-09-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I wouldn't have expected this movie to be so good. But I really regret that I've seen it on DVD and not in the cinema. I've enjoyed watching nevertheless. Definitely, some references to films like \"Pulp Fiction\" or \"Usual I wouldn't have expected this movie to be so good. But I really regret that I've seen it on DVD and not in the cinema. I've enjoyed watching nevertheless. Definitely, some references to films like \"Pulp Fiction\" or \"Usual Suspects\" were used. But the main thing taken from \"PF\" is the unchronological proceedings. And for me, this is not a reason to criticise a movie, unless it's 'stolen' even more ideas. No doubt: \"PF\" is - a lot - better than \"L#S\", but in my view, Josh Hartnett has shot his best film next to \"Black Hawk Down\"",
      "review_date": "2007-12-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Critics got it totally wrong. This was a very good film for a thriller, crime drama. Hartnett is a bit stiff but the rest of the cast is top notch and well acted. Whether or not you figured it out by the end is immaterial to a very nice Critics got it totally wrong. This was a very good film for a thriller, crime drama. Hartnett is a bit stiff but the rest of the cast is top notch and well acted. Whether or not you figured it out by the end is immaterial to a very nice ride. I think critics hate a movie that they THINK they figured out when they get it wrong.",
      "review_date": "2007-01-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantasic movie! Seemed to move along slowly at first, but when it picked up speed, boy did it PICK UP SPEED! Totally recommend this movie. Would love to see it again some day, or possibly purchase it on DVD.",
      "review_date": "2006-10-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I thought this movie was very well done and I thoroughly enjoyed the twisted plot. I positively detest Tarantino films and yet adored this one due its slight influence.",
      "review_date": "2006-10-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Clever!!! Exellent cast!! Must see!",
      "review_date": "2006-04-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was absolutely fabulous. It had a distinct style without going overboard. Dialogue was witty and entertaining. Plot though slightly predictable was not enough so to dislike it for. Go see it. It was a lot of fun.",
      "review_date": "2006-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A good movie that uses misdirection to good effect. The set design detracted from the movie but overall much better than the critics think.",
      "review_date": "2006-04-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a smart movie, period. If you're like me, you'll go to a movie that entertains you, that makes you laugh, or even maybe just to spend quality time with friends. Howerver, very infrequently does one have the ability to not This is a smart movie, period. If you're like me, you'll go to a movie that entertains you, that makes you laugh, or even maybe just to spend quality time with friends. Howerver, very infrequently does one have the ability to not only make you laugh (well, maybe just once or twice with this movie) but actually make you think. This is an extremely well-written movie that has you guessing up until the end and has you trying to piece it together the entire time. I saw \"Inside Man\" a few weeks back, being that its one of the top rated movies on this site, and enjoyed it, but this one I think did just as good a job at being smart. This is definitly a movie worth seeing.",
      "review_date": "2006-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Okay, it's not an Oscar contender but witty dialogue and an appealing cast make this movie a great choice for an entertaining evening.",
      "review_date": "2006-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Really neat movie with a great twist. I was not disappointed.",
      "review_date": "2006-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was an entertaining movie, plot twists could have been figured out since the clue's were all there. Still a good time and critics were wrong.",
      "review_date": "2006-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well done thriller. Excellent cast. Gripping tale. Loved it.",
      "review_date": "2006-04-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Loved It! this movie was so amazing and kept me on my toes. very clever. I had no idea.",
      "review_date": "2006-05-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't know what is wrong with the Critics but the people have spoken and this movie rocks!",
      "review_date": "2007-12-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A perfect movie which contains everything: adventure fun and a lot of surprises! I think that critics where unfair!!!!",
      "review_date": "2007-04-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Loved it! No wonder such a fabulous cast signed on to do it! Thoroughly enjoyed the twists and the dialogue! Great script!",
      "review_date": "2006-11-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of those movies that is a benchmark for how clueless reviewers can be.",
      "review_date": "2006-12-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "All you have to know is that the professional critics are wrong and this is a movie fans movie. Great cast. Go and enjoy!",
      "review_date": "2006-04-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Utterly predictable and gratuitous. Nonetheless fun and engaging. Relax and go along for the ride.",
      "review_date": "2006-04-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Finally, a movie in 2006 that I can recommend to everyone to go see! A great opening hook that pulls you into a world of suspects and villians and spins them into a very entertaining two hours that has you leaving saying \"oh yea\" and not Finally, a movie in 2006 that I can recommend to everyone to go see! A great opening hook that pulls you into a world of suspects and villians and spins them into a very entertaining two hours that has you leaving saying \"oh yea\" and not \"what?\". And besides, how can you go wrong with a movie with Morgan Freeman and Ben Kingsley as waring mob bosses. The best Pulp Fiction knock off since The Usual Suspects.",
      "review_date": "2006-04-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie completely caught me off guard... it was one of those days were you go to the movies without the slightest idea of what you really want to see... and most of the time with least expectations-it turns out to be an interesting and This movie completely caught me off guard... it was one of those days were you go to the movies without the slightest idea of what you really want to see... and most of the time with least expectations-it turns out to be an interesting and entertaining film. Initially the film starts a bit slow, but with reason as the movie progresses into its storyline. I found quite enjoyable and I do recommend this film.",
      "review_date": "2006-04-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The critics don't like it because they can't grab some popcorn, snooze, wake up, and get the message. It's a very complicated mess that you might in fact need to see twice to get. In the world of true films (films that are The critics don't like it because they can't grab some popcorn, snooze, wake up, and get the message. It's a very complicated mess that you might in fact need to see twice to get. In the world of true films (films that are truly worth watching), you never only see a movie once. (Think Fellini.) This film is loaded with extratextual, intratextual, and intertextual references that make it deep and intelligent. I almost never rate a film above an 8 because I want to leave room for better films. So, a 9 it is.",
      "review_date": "2006-04-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I think this movie is great!!! It twist and turns and gets you thinking, hard to figure out until the end- which keeps you watching. The best movie I have seen in a long time!!!!",
      "review_date": "2006-09-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie suffered from having a terrible name, but really, it is quite a good film with several interesting plot twists and outstanding performances from a stellar cast that includes Josh Hartnett, Lucy Liu, Bruce Willis, Morgan Freeman, This movie suffered from having a terrible name, but really, it is quite a good film with several interesting plot twists and outstanding performances from a stellar cast that includes Josh Hartnett, Lucy Liu, Bruce Willis, Morgan Freeman, and Ben Kingsley.",
      "review_date": "2007-01-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm not sure why the critics were so harsh about this movie. For the average movie-goer, this is a solid film, which i enjoyed immensely.",
      "review_date": "2007-05-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Don't trust movie critics! Great writing &plot, great acting, great art direction. The problem with movie critics is that they're in love with Quentin Tarantino and normal people thing he's good, but so pretentious, it's Don't trust movie critics! Great writing &plot, great acting, great art direction. The problem with movie critics is that they're in love with Quentin Tarantino and normal people thing he's good, but so pretentious, it's distracting and makes you want to hurl. So when a movie looks like it's remotely Tarantinesque, the critics who couldn't be directors come to the rescue of their idol and kill Slevin.",
      "review_date": "2008-02-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Lucky number slevin is an outstanding film full of action and twist that will have you wondering what just happend. If you liked movies such as \"the prestige\", \"the departed\", or \"reservoir dogs\" you will love this movie from start to Lucky number slevin is an outstanding film full of action and twist that will have you wondering what just happend. If you liked movies such as \"the prestige\", \"the departed\", or \"reservoir dogs\" you will love this movie from start to finish. The only negative thing i could say about this movie is that i did not like lucy lu in it.",
      "review_date": "2008-08-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I liked this one, the story was interesting, the acting was good, overall well produced. But afterall the whole movie felt a bit too \"constructed\" and made up. I didn't really got the reason why Goodcat helps his adopted son so much inI liked this one, the story was interesting, the acting was good, overall well produced. But afterall the whole movie felt a bit too \"constructed\" and made up. I didn't really got the reason why Goodcat helps his adopted son so much in killing his former clients. He killed many and then he helps for revenge, idk..",
      "review_date": "2022-11-18",
      "source": "metacritic"
    }
  ],
  "num_reviews": 121
}