{
  "title": "Material Girls",
  "rating": 4.3,
  "release_date": "2006-08-18",
  "genre": [
    "Comedy",
    "Romance",
    "Family"
  ],
  "summary": "A comedy that takes you from the penthouse to the poorhouse and back again, along with  Ava and Tanzie Marchetta (the Duff sisters) as celebutantes who realize that potential they never knew they had.  (MGM)",
  "critic_reviews": [
    "The Duffs are certainly cute together, but not even their natural chemistry can enliven all the preachy bits about hard work and the meaning of happiness.",
    "Isn't as witty, stylish, or sophisticated as the similarly themed \"The Devil Wears Prada.\" Material Girls is pitched to the Seventeen crowd, and it succeeds on its own terms. These days, even pre teens live in a material world.",
    "It's less substantial than cotton candy, but Material Girls is as slickly produced as one of the Marchetta TV spots.",
    "A superficial tween comedy that mocks celebutantes like the Olsen twins while simultaneously pushing stars Hilary and Haylie Duff as their replacements.",
    "The Duffs don't even fully commit to their characters here -- they’'e seemingly undecided about whether they can get away with being shallow and bratty without ruining their family-friendly images.",
    "The real-life sisters Hilary and Haylie Duff star in this incompetent spin on the poor-little-rich-girl story.",
    "The most shocking moment comes during the closing credits, when it's revealed that not one, not two, but three screenwriters were responsible for a plot that someone seems to have hastily slapped together after taking a walk around a Sephora outlet while listening to \"Beat Of My Heart\" on loop.",
    "It's not \"Clueless,\" just clueless.",
    "Painfully unfunny comedy.",
    "There is plenty of blame to go around for this laughless mess.",
    "Even by the low standards of the genre it represents, this female teen comedy represents a new nadir.",
    "Mainly offers fodder for tweens who fantasize about glamorous Los Angeles lifestyles where everyone is skinny, rich, and on Prozac. It's a film where gays and minorities not only fit into stereotypes, but embrace them."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This movie is not what i hoped it would be, but very close.  After reading bad reviews I was convinced that it bombed but what people did not see was how two once rich girls make the best of a garbage dump of a situation and turn their livesThis movie is not what i hoped it would be, but very close.  After reading bad reviews I was convinced that it bombed but what people did not see was how two once rich girls make the best of a garbage dump of a situation and turn their lives around...Good movie",
      "review_date": "2010-09-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bad movie. Bad plot, bad acting, bad characters, bad dialogue... Hell, everything is bad. The only actor who does a better job than the rest is A. Huston.",
      "review_date": "2006-09-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bad Movie in nearly every way. Hillary Duff is annoying and the movie looks like it was shot and directed by a drunk and bored three-year old.",
      "review_date": "2006-08-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "No plot. No laughs. Very bad acting. Very annoying sisters to begin with. The movie should have never been released. No one laughed throughout the entire movie and there was a line at the refunds table. Need I say more?",
      "review_date": "2006-09-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What could I do to have my 97 minutes back???",
      "review_date": "2006-08-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this has to be the most horrible excuse for a movie I have ever seen. I've always hated Hilary Duff, and I also hate how many little sisters are famous off their big sisters (Jamie Lynne Spears, Ashlee Simpson), and this movie had both! this has to be the most horrible excuse for a movie I have ever seen. I've always hated Hilary Duff, and I also hate how many little sisters are famous off their big sisters (Jamie Lynne Spears, Ashlee Simpson), and this movie had both! It was a two-for-one. The acting was horrible, the plot was bland. The only thing I wanted was a refund for my money, and a time reimbursement for the hour and a half I spent there. I feel bad for anyone whose mind even flits accross the vague notion of seeing this film.",
      "review_date": "2006-08-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Career advice for the Duff sisters: Hilary - Make 3 more Lizzie McGuire Movies. \"Lizzie goes to college/Lizzie get's married/Lizzie has a baby\" and call it a day! Haylie- Borrow some college money from Hilary, get a degree; and move on Career advice for the Duff sisters: Hilary - Make 3 more Lizzie McGuire Movies. \"Lizzie goes to college/Lizzie get's married/Lizzie has a baby\" and call it a day! Haylie- Borrow some college money from Hilary, get a degree; and move on down the line!",
      "review_date": "2006-08-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the worst Hilary Duff movie yet! She still cannot act. Her sister is better, but not anything to write home about. And the writing of this movie is very weak.",
      "review_date": "2006-08-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the worst movies I've seen this year. I laughed at the ridiculousness of it all, which seemed to help somewhat...Good luck, parents.",
      "review_date": "2006-08-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I really wanted to enjoy this film. But it's so bad, the acting is just horrible, i feel sorry for Angelica Houston thought, in every scene that she appears we can see on her face an expression like : \"Get me out of here, i'm just I really wanted to enjoy this film. But it's so bad, the acting is just horrible, i feel sorry for Angelica Houston thought, in every scene that she appears we can see on her face an expression like : \"Get me out of here, i'm just doing this piece of c** because of the paycheck\". And adding to this, the film is still racist!! Haylie is not the worst, but just because she have Hillary to be compared.",
      "review_date": "2006-08-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "i tried to enjoy this movie, and i sorta enjoyed it... well making fun of how terrible it is. it was a terrible movie, with no storyline, and bad acting. it seems as though, it would be better spent giving a lecture, cause it was a lecture i tried to enjoy this movie, and i sorta enjoyed it... well making fun of how terrible it is. it was a terrible movie, with no storyline, and bad acting. it seems as though, it would be better spent giving a lecture, cause it was a lecture in the form of bad acting.",
      "review_date": "2006-08-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWorst movie ever. I envy anyone who didn't see this. The entire movie is painful to sit through.",
      "review_date": "2019-06-15",
      "source": "metacritic"
    }
  ],
  "num_reviews": 24
}