{
  "title": "The Wicker Man",
  "rating": 2.2,
  "release_date": "2006-09-01",
  "genre": [
    "Mystery",
    "Thriller",
    "Horror"
  ],
  "summary": "In Neil LaBute's remake of the 1973 horror classic, Nicolas Cage stars as a sheriff investigating a young girl's disappearance from an isolated, mysterious island.",
  "critic_reviews": [
    "Profoundly disturbing, blood-chilling suspenser.",
    "Despite its logy, red-herring structure, the film has enough enigma and weirdness that it gradually stirs to life.",
    "As it is, LaBute has cleverly repurposed his creepy source material. This Wicker Man, which wasn't screened for critics, is a nutty atonement for the gender assaults of his filmmaking and playwriting past, including \"In the Company of Men,\" \"Your Friends & Neighbors,\" and \"The Shape of Things.\"",
    "In the end, LaBute's remake is an interesting idea that never transforms into a particularly satisfying movie.",
    "Well intentioned, but only occasionally creepy.",
    "For this remake writer-director Neil LaBute has moved the action from Scotland to Washington State, added enough scares for Warner Brothers to market the movie as horror, and turned the story into an almost comically Wagnerian expression of the castration anxiety that snakes through his original screenplays.",
    "The Wicker Man is too loony to be a drama, too earnest to be a comedy, too predictable to be a horror film.",
    "The Wicker Man isn't all that bad a movie; it's visually striking and ambitious in some ways. It just fails to bring enough to the table to fully distance itself from the original.",
    "This wasn't a horror film the first time around, and LaBute makes sorry feints at effective creepiness, letting the story roam in circles just like Cage.",
    "Unlikely to inspire a passionate following similar to the original, the film, which opened Friday without being screened for the press, ultimately induces more titters than dread.",
    "Any provocative questions LaBute might have wanted to raise are totally obscured as the rising tide of absurdity gradually overwhelms the entire enterprise.",
    "In an era of careful cost accountancy and focus-group testing, it's remarkable that a movie as truly, deeply, madly foolish as The Wicker Man escaped the asylum. But we must be grateful for the endless guffaws and gasps and outright stunned silences it unleashes on lucky audiences.",
    "There may be a way to remake 1973's cult thriller The Wicker Man, in which a deeply Christian cop has his religious convictions shaken to the core as he investigates the disappearance of a child from within a cheerfully pagan community, but Neil LaBute didn't find it.",
    "As an allegory of religious conflict, the '73 film is brilliantly constructed and ends with a punctuation mark that was shocking in its day. LaBute's movie attempts to shock, as well, and does: Given the names involved and the casting of Cage, it is shockingly bad.",
    "LaBute has transformed the eerie, disturbing psychological thriller into an unintentional comedy. At times, The Wicker Man is hilariously bad.",
    "Turns a cultishly creepy classic into a dull and windy farce.",
    "A movie like this can survive an absurd premise but not incompetent execution. And Mr. LaBute, never much of an artist with the camera, proves almost comically inept as a horror-movie technician...It's neither haunting nor amusing; just boring.",
    "The Wicker Man is one of those \"what were they thinking?\" movies.",
    "Do yourself a favor: Go rent Hardy's original film, watch it, and then try and get it out of your head. You never, ever will."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Worst movie I have ever seen, not called \"Be Cool\". A total disappointment. A sorry attempt at scary...more like hysterically bad. Cage did well with the script that he was given....no plot or character development.",
      "review_date": "2006-09-01"
    },
    {
      "review_title": null,
      "content": "This was a good time, a failed horror, a mediocre mystery, but a hilarious possibly unintentional comedy. It was a fun movie.",
      "review_date": "2006-09-02"
    },
    {
      "review_title": null,
      "content": "The funniest film you'll ever see.",
      "review_date": "2007-08-21"
    },
    {
      "review_title": null,
      "content": "People are unjustly attacking a decent film.",
      "review_date": "2006-09-11"
    },
    {
      "review_title": null,
      "content": "without doubt one of the worst films i've had the misfortune to sit through; it doesn't look good on paper and the reality is even worse. [***SPOILERS***] The most interesting thing about it is Nicolas Cage's without doubt one of the worst films i've had the misfortune to sit through; it doesn't look good on paper and the reality is even worse. [***SPOILERS***] The most interesting thing about it is Nicolas Cage's 'interesting' hair styles. Contrived and awkward from the off, excluding the thoroughly unnecessary embellishments to Cage's character - oh how coincidental he has anaphalptic shock and they have lots of bees. . ., the film starts poorly and never recovers. The use of symbolism and imagery is atrocious with the director going to painful lenghts to signpost the, ratehr obvious, imagery of the film. Despite the interest in imagery the removal of all sexual tension is confusing and weakens the alleged motives behind Cage's actions, which are never fully explained. we get various shots of him walking around, doing things, going somewhere else in such a disjointed and episodic manner that it appears to have little or no connection to the plot. A couple of scenes were so shockingly bad - the bear suit and burnt doll that people in the audience laughed, before they began leaving in droves. Arguably the worst film you will see this year, and that is not judging harshly on the original, this fim tries to adapt the story and in doing so deserves to be at least congratulated for being awful entirely on its own terms.",
      "review_date": "2006-09-01"
    },
    {
      "review_title": null,
      "content": "I started watching \"The Wicker Man\" because it is \"the worst movie with Nicolas Cage\". That got me curious. And I was very surprised that I liked it and I would like to explain why. This is a true horror movie for grown-ups. You see, childrenI started watching \"The Wicker Man\" because it is \"the worst movie with Nicolas Cage\". That got me curious. And I was very surprised that I liked it and I would like to explain why. This is a true horror movie for grown-ups. You see, children are afraid of Freddy, of ghosts, zombies and all kinds of magical monsters that presumably live under their bed. But as we grow up we tend to understand that such monsters do not exist in real life. In Wicker Man we are presented with real monsters, horrible beings that are much scarier to me than any life-leaching ghoul or vurdalak. And the scariest part is that these beings really DO exist in the world, perhaps in a slightly different form. These monsters are...women... oops! Just joking here. Religious fanatics. Some people are so mentally handicapped that they believe that killing someone will make a better harvest. This is what happens when you let all kinds of **** persist in the air. And, frankly speaking, this part of humanity scares the **** out of me. So I wouldn't say it's the best movie, but it has a believable plot, with just a few minor flaws and decent acting. And even if this is the worst movie with Nicolas Cage, It's still a good movie which is damn impressive!",
      "review_date": "2014-10-07"
    },
    {
      "review_title": null,
      "content": "Stunning. Courageous. A feast for the eyes and ears. These are but some of my reactions to Nicolas Cage's (in my opinion BAFTA winning performance) in The Wicker Man. He manages to suprise audiences time and time again with depth ofStunning. Courageous. A feast for the eyes and ears. These are but some of my reactions to Nicolas Cage's (in my opinion BAFTA winning performance) in The Wicker Man. He manages to suprise audiences time and time again with depth of characters that only he can bring forth to the acting table. Quality, not quantity has always been my motto and i think this film can be beautifully summed up by one shortt, crisp and well executed line that fits so perfectly with the running themes of despair and fear: \"What's in the bag, a shark or something?\" .... A must see.",
      "review_date": "2012-12-14"
    },
    {
      "review_title": null,
      "content": "This movie is a wild, wild ride. It's one of the worst, un-scary, most un-intentionally hilarious comedies I have ever seen. Truly Nicolas Cage's best work.",
      "review_date": "2019-09-23"
    },
    {
      "review_title": null,
      "content": "A reclusive lawman (Nicolas Cage) travels to a secluded island to search for a girl who has gone missing. Once there, he discovers sinister forces at work among the island's secretive residents, including strange sexual rituals, a harvestA reclusive lawman (Nicolas Cage) travels to a secluded island to search for a girl who has gone missing. Once there, he discovers sinister forces at work among the island's secretive residents, including strange sexual rituals, a harvest festival and possible human sacrifice. Puzzlingly misguided, Neil LaBute's update The Wicker Man struggles against unintentional comedy and fails. Final Grade is a D-.",
      "review_date": "2018-05-19"
    },
    {
      "review_title": null,
      "content": "What's in the bag, a shark or something?\rThis movie is undoubtedly the greatest achievement in cinema history. Nicolas \"Not The Bees\" Cage plays a troubled detective- but that doesn't really matter. The true achievement is not in the story,What's in the bag, a shark or something?\rThis movie is undoubtedly the greatest achievement in cinema history. Nicolas \"Not The Bees\" Cage plays a troubled detective- but that doesn't really matter. The true achievement is not in the story, but in the acting and the writing- oh god, the writing. With such memorable lines as \"Killing me won't bring back your goddamn honey\" and \"Step away from the bike\".\rBut seriously, if you go into this with the intent of laughing, you will.",
      "review_date": "2013-04-11"
    },
    {
      "review_title": null,
      "content": "This movie was so much better than the original. Move with the times everyone, lame folk music and slow slow SLOW plots are not interesting to the modern audience. The original was alright, but the 2006 one was SO much slicker, had better This movie was so much better than the original. Move with the times everyone, lame folk music and slow slow SLOW plots are not interesting to the modern audience. The original was alright, but the 2006 one was SO much slicker, had better symbolism and imagery. Nic Cage was amazing, and so were the rest of the cast. This is one of my favourite films. The only reason people gave it such a bagging was because they are stuck in the past and can't accept modern ideas and that movie making has changed in the past thirty years. It is definitely a 10. Well done Nic Cage.",
      "review_date": "2007-10-20"
    },
    {
      "review_title": null,
      "content": "Honestly, the best movie I have ever seen in my entire life. Cage's acting really brings it home. When he's screaming \"THE BEES THE BEES\" there is really this scene of truth and pain to the character. Spectacular. An absolute masterpiece.",
      "review_date": "2011-02-13"
    },
    {
      "review_title": null,
      "content": "I laughed out loud in theaters multiple times. This movie is full of those moments where the film making is so poor that it's easy to laugh. Nick Cage is awful in this role too, playing pretty much every other character he has played in hisI laughed out loud in theaters multiple times. This movie is full of those moments where the film making is so poor that it's easy to laugh. Nick Cage is awful in this role too, playing pretty much every other character he has played in his life. Serious guy, would be an in depth analysis of the bonehead that Cage is trying to portray. Oh, and he hits women. Multiple times...",
      "review_date": "2012-11-19"
    },
    {
      "review_title": null,
      "content": "Oh... my... god... I'm still trying to catch my breath after the Leelee Sobieski fight scene, the nonsensical dialogue, and the ridiculous bee symbolism. Fuckin' funniest piece of trash I've ever beheld; this here flick is a Oh... my... god... I'm still trying to catch my breath after the Leelee Sobieski fight scene, the nonsensical dialogue, and the ridiculous bee symbolism. Fuckin' funniest piece of trash I've ever beheld; this here flick is a veritable how-to of bad movie-making (or remaking, in this case). The hilarity comes to an irresistibly laugh-out-loud head when Cage is dragged half-naked by feminists to his own personal burning man. Trust me, don't watch this one alone OR sober. Friends and booze are required to fully experience the grandeur.",
      "review_date": "2009-10-17"
    },
    {
      "review_title": null,
      "content": "Wanted more laughs out of this craptastic movie then I got. Totally the worst remake in the history of remakes. Best and only good part was when he was in the bear costume and decked that woman. Who wants to see Nicholas Cage ride back and Wanted more laughs out of this craptastic movie then I got. Totally the worst remake in the history of remakes. Best and only good part was when he was in the bear costume and decked that woman. Who wants to see Nicholas Cage ride back and forth on an island on a lame ass bicycle for two hours, posing as an angry cop? Thankfully it was a library rental.",
      "review_date": "2007-12-07"
    },
    {
      "review_title": null,
      "content": "One of the worst movies I've ever seen. Nicholas Cage has shown himself to be a good actor in the past but he has GOT to pick his movies better. Surprisingly, this isn't just something he jumped onto in order to make a quick buck, One of the worst movies I've ever seen. Nicholas Cage has shown himself to be a good actor in the past but he has GOT to pick his movies better. Surprisingly, this isn't just something he jumped onto in order to make a quick buck, he was actually a producer for this film, and apparently was heavily involved in getting it made....wow. Just...horrible. A complete waste of time. Not scary whatsoever.",
      "review_date": "2007-08-03"
    },
    {
      "review_title": null,
      "content": "Because this is a remake, it was actually wise to alter some of the circumstances which led to the same horrific ending - the film begins by suggesting that Cage might save the girl and flee with his ex-fiancée - but I'm glad to Because this is a remake, it was actually wise to alter some of the circumstances which led to the same horrific ending - the film begins by suggesting that Cage might save the girl and flee with his ex-fiancée - but I'm glad to say It was as much a nightmare as we all hoped. Having said that... The film has none of the dignity or plausibility of the original, and not merely because of it's lack of lore or history to substantiate either the warped paganism (who in this film are murderous beyond reason), or the location. Unfortunately the script is.. just not how humans behave (perhaps Americans?). Cage, as the typical all-American hero punches and kicks various women, and everyone shouts obscenely at each other without restraint. But Kit is correct - the film does lend itself to comedy moments (search Youtube for 'Wicker Man Comedy Trailer'). And presumably it has done a service to the excellent original by drawing attention to it. But the film is dumbed down, plot very simplified, drowned by endless 'suspense' music, all the disturbing sexual elements are removed and replaced with violence (which is much more acceptable, of course) and 'you know where you are' when a film begins with a tremendous car crash and explosion - the body-count is four times the original, yet the nightmarish quality is absent - it is far closer an island of freaks and psychos than it is an island of 'innocent' people twisted by religious doctrine, and therefore misses the point. Not for the intelligent, but a curious homage, highlighting much of what has gone wrong with film-making.",
      "review_date": "2008-11-22"
    },
    {
      "review_title": null,
      "content": "Hilarious. The dialogue was so goddamn bad that I laughed like a moron. Why can't Nicholas Cage make bad movies that are funny? As far as I'm concerned, this is easier to get through than Bangkok Dangerous. Or whatever the hell he does now.",
      "review_date": "2011-03-28"
    },
    {
      "review_title": null,
      "content": "Horribly written movie which builds to one of the worst climaxes I have ever seen in all my days of filmgoing.",
      "review_date": "2012-11-28"
    },
    {
      "review_title": null,
      "content": "A lot of criticism has been given to this movie especially because Nicolas Cage doesn't give proper treatment to his role but in general I thought that this was an interesting and yet really weird movie at the same time. I guess I'm sayingA lot of criticism has been given to this movie especially because Nicolas Cage doesn't give proper treatment to his role but in general I thought that this was an interesting and yet really weird movie at the same time. I guess I'm saying i've seen worst.",
      "review_date": "2013-03-24"
    },
    {
      "review_title": null,
      "content": "nunca fui fanático de la original pero esta nueva adaptación es un lento pero seguro paso a un nuevo genero de películas de suspenso dramático lento y aunque este nuevo genero no le gustara a muchos a los otros les parecerá una evolución ennunca fui fanático de la original pero esta nueva adaptación es un lento pero seguro paso a un nuevo genero de películas de suspenso dramático lento y aunque este nuevo genero no le gustara a muchos a los otros les parecerá una evolución en el suspenso",
      "review_date": "2013-05-02"
    },
    {
      "review_title": null,
      "content": "This is undeniably terrible movie, but with one redeeming factor in the form of Nicolas Cage. The movie starts off slow and boring but eventually more and more insane stuff starts too happen. Highlights include: Nic Cage punching a women, nicThis is undeniably terrible movie, but with one redeeming factor in the form of Nicolas Cage. The movie starts off slow and boring but eventually more and more insane stuff starts too happen. Highlights include: Nic Cage punching a women, nic cage running around in a bear suit, nic cage punching women in a bear suit, HOW'D IT GET BURNED! and of course NOT THE BEES!\r This is one of the most unintentionally hilarious movies ever and if you get a few friends together (or buy the rifftrax commentary) then you will undoubtedly have a good time!\r As a horror movie this is a 2 or 3 out of 10, but as a comedy this is hilarious and a sure fire 8.",
      "review_date": "2014-05-27"
    },
    {
      "review_title": null,
      "content": "I gave it a 10 for picking a good movie to start with. But I had to minus 9 points for remaking that movie so poorly. I hate it when people remake a solid film an either a) can't improve upon it what so ever or b), screw it up totally.",
      "review_date": "2006-10-03"
    },
    {
      "review_title": null,
      "content": "I couldn't believe Nick Cage or Ellen Burstyn would be caught dead in such a dog. Bad script, and even the normally good Cage's acting didn't connect with a shred of reality. Fellow movie goers hooted and jeered on their way I couldn't believe Nick Cage or Ellen Burstyn would be caught dead in such a dog. Bad script, and even the normally good Cage's acting didn't connect with a shred of reality. Fellow movie goers hooted and jeered on their way out of the theatre.",
      "review_date": "2006-09-01"
    },
    {
      "review_title": null,
      "content": "A phenomenal achievement in awfulness. It's actually hilariously awful. First off...Nicholas Cage must now have made it to the finals in the Over-Emoting Category in his acting class. Wearing new hair plugs and with a face that has been A phenomenal achievement in awfulness. It's actually hilariously awful. First off...Nicholas Cage must now have made it to the finals in the Over-Emoting Category in his acting class. Wearing new hair plugs and with a face that has been lifted so many times his pinned back ears seem to be straining to touch in the back he oozes not only a sick smarmiess but creates a \"hero\" character that you have no vested interest in.  I've enjoyed LaBute's early films and a few of his plays...but it's a strange fascination he has. I'd give this film a 2 out of 10 solely based on Ellen Burstyn's performance.[***SPOILERS***]  By the time she finally makes her appearance (bravely soldiering through her scenes with her wig line clearly visible on her forehead) it seems like all hope may be lost. She deserves an Oscar right here and now for saying her lines with a straight face and when she appears wearing a white mumu and blue, white, and gold face paint booming about The Wicker Man you know that working with Scorcese and Friedkin really prepped her for this role dang well. This movie is so wrong-headed and cuckoo that is has to be seen to be believed. Highlights include: Nicholas Cage running away from a swarm of bees and then falling down a hill. Nicholas Cage stealing a bicycle and looking like Ms. Gulch from The Wizard of Oz riding around on it. Nicholas Cage running around the island kicking down doors looking for the missing girl. Leelee Sobieski PLUMMETING from a once-promising acting career in a \"brawl\" with Cage. Ellen Burstyn dancing around in a said while mumu. Nicholas Cage screaming \"Who burned it? Who burned it? Who burned it?Who burned it?Who burned it?Who burned it?\" for no reason. Nicholas Cage in a bear costume (I'm not kidding) running through the woods, taking off the costume (but leaving the bear feet on) and then doing some karate moves to some villains. And you haven't lived until you have seen the final 15 minutes of the movie and its dreadful epilogue that looked like it was shot yesterday in your cousin's basement. Needless to say, if you can make it through this film without laughing out loud then you deserve a medal. There was actually a point in the movie where I stopped snickering to wonder if maybe this wasn't an elaborate send-up of \"hysteria\" films...only to be reminded when Cage would scream/shout/whisper his dialogue that he really was taking himself quite seriously. I think this one is destined to be a cult film all over again...just because it's so dreadful.",
      "review_date": "2006-09-02"
    },
    {
      "review_title": null,
      "content": "LaBute sends Cage's character into an alternate reality that consists of some of the same structures that order human life, but the substance of those structures is so surreal they are unbelievable. Horror only works when the audience LaBute sends Cage's character into an alternate reality that consists of some of the same structures that order human life, but the substance of those structures is so surreal they are unbelievable. Horror only works when the audience can identify with the characters and events on the screen. These characters and events do not have to be void of exaggeration or imagination. Yet, they must not be so disconnected from the human experience that we witness a \"campfire scary story.\" All of the ingredients were there for LaBute to terrify us: isolationism, brain-washed conformity, rejection of individualism, and a schizophrenic religious world. Yet, in the end the actual wicker man is a metaphor for the movie; the structure is there for horror with no real substance.",
      "review_date": "2006-09-05"
    },
    {
      "review_title": null,
      "content": "The original 1973 version was a suspenseful and chilling horror movie. This version was apparently made as a comedy. However, Nicholas Cage is miscast as the hapless cop unintentionally helping to bring in the harvest. Adam Sandler The original 1973 version was a suspenseful and chilling horror movie. This version was apparently made as a comedy. However, Nicholas Cage is miscast as the hapless cop unintentionally helping to bring in the harvest. Adam Sandler would've been better.",
      "review_date": "2006-09-01"
    },
    {
      "review_title": null,
      "content": "The original was campy and has some appeal. This sexless \"retelling\" of a fertility festival is like a bad blind date with a girl that won't shut up.",
      "review_date": "2006-09-01"
    },
    {
      "review_title": null,
      "content": "This is one of the worst movies I have ever seen. I am a big Nicolas Cage fan and think he is one of the best actors today, but I am so confused as to why he would ever choose to do such a terrible film. Ellen Burstyn must have been This is one of the worst movies I have ever seen. I am a big Nicolas Cage fan and think he is one of the best actors today, but I am so confused as to why he would ever choose to do such a terrible film. Ellen Burstyn must have been absolutely desperate in agreeing to a part. It was litereally two hours of zero suspense, zero intrigue and the characters spent the entire film being so dauntingly vague about the \"missing girl\" that it became frustrating to watch. How can crap like this ever be sold to an audience? Shame Shame Shame!",
      "review_date": "2006-09-02"
    },
    {
      "review_title": null,
      "content": "For those of us who have always wondered if Nicolas Cage would ever star in a movie so poorly made that even his marvelous presence and personality could not save it - now we know.",
      "review_date": "2007-02-04"
    },
    {
      "review_title": null,
      "content": "Awful film - watch the original instead. Cage is a terrible actor imo! Boringgggggggggggg!!!",
      "review_date": "2007-04-01"
    },
    {
      "review_title": null,
      "content": "What a sad day for Nick Cage fans...Dude, what were you thinking when you read this script?! How did your cell phone suddenly get a signal? And the bear suit...I don''t think the writers were expecting laughs from the veiwers, but What a sad day for Nick Cage fans...Dude, what were you thinking when you read this script?! How did your cell phone suddenly get a signal? And the bear suit...I don''t think the writers were expecting laughs from the veiwers, but the theater I was in was in stitches. I look forward to World Trade Center for a real Nick Cage fix. This was truly a bad movie.",
      "review_date": "2006-09-01"
    },
    {
      "review_title": null,
      "content": "I simply love this film, because it is sooo hilarious. I spent the last half hour laughing out-loud, almost non-stop, till I was tearing! It's probably the funniest film I've seen all year. Oh ... you mean it's a horror movie?",
      "review_date": "2006-09-02"
    },
    {
      "review_title": null,
      "content": "Starts off promising, but spirals into more of a comedy then a horror movie in the end. [***SPOILERS***] Cage says some lines that make you laugh when they aren't supposed to. An example \"Killing me won't bring you anymore honey\", Starts off promising, but spirals into more of a comedy then a horror movie in the end. [***SPOILERS***] Cage says some lines that make you laugh when they aren't supposed to. An example \"Killing me won't bring you anymore honey\", also Cage is seen running around in a bear suit punching women in animal masks, all this made the movie seem very corny and everyone in the audience was laughing.",
      "review_date": "2006-09-02"
    },
    {
      "review_title": null,
      "content": "If this were on free TV I would change the channel as that is how awful it is. Avoid.",
      "review_date": "2006-09-26"
    },
    {
      "review_title": null,
      "content": "I'd rather be thrown into the burning Wicker Man than have to sit through this utter tripe again. Buy the original instead.",
      "review_date": "2006-09-06"
    },
    {
      "review_title": null,
      "content": "Seriously, it was not that bad, people need to stop being drama queens, the ending was lame, but the acting was decent and the vacancy of the notable female characters was enough to bring about the creepy feel average horror flicks need",
      "review_date": "2007-01-07"
    },
    {
      "review_title": null,
      "content": "Picking Nicholas Cage to star in this movie was the only good decision the director made. The movie was terrible but give Cage credit for the work that he did in it.",
      "review_date": "2007-02-05"
    },
    {
      "review_title": null,
      "content": "I love Nick Cage; I talked 2 other people into going to this joke; and I seriously mean I hope the whole thing was an expensive Hollywood joke. It wa the worst movie, worst plot, worst acting I am sure I have ever experienced. Nick, Babe; I love Nick Cage; I talked 2 other people into going to this joke; and I seriously mean I hope the whole thing was an expensive Hollywood joke. It wa the worst movie, worst plot, worst acting I am sure I have ever experienced. Nick, Babe; what the hell were you thinkin? Tell me this was all for fun!",
      "review_date": "2006-09-01"
    },
    {
      "review_title": null,
      "content": "Waste of time and not even worth Netflix ... I excepted more from the actors, however, I guess they prove that at a certain point actors have the ability to bring in money despite the lack of a plot or anything else even a",
      "review_date": "2006-09-10"
    },
    {
      "review_title": null,
      "content": "The funniest movie you will see all year. It's up there with Showgirls as far as unintentional humour is concerned.",
      "review_date": "2006-09-18"
    },
    {
      "review_title": null,
      "content": "This movie goes down in flames. The central motivation for the main characters emotional instability was wiped from the remake and thus makes the floundering of Cage's Malus without reason.",
      "review_date": "2006-09-02"
    },
    {
      "review_title": null,
      "content": "Save your money, save your time, save everything and skip this hunk of shiate of a movie. Cage has another terrible role in a sleeper of a film. Cage plays a police officer investigating a girls dissapperence on an island with an island that Save your money, save your time, save everything and skip this hunk of shiate of a movie. Cage has another terrible role in a sleeper of a film. Cage plays a police officer investigating a girls dissapperence on an island with an island that has something similar to a cult. The ending is the worst part. HORRIBLE. The New York Post should be banned for giving movie reviews if they gave this a 75. \"A blood chilling suspsenser\"? What movie was he watching? This was a blood warming snoozer!",
      "review_date": "2006-09-26"
    },
    {
      "review_title": null,
      "content": "[***SPOILERS***] An utterly dreadful contemporary Hollywood defiling of a British classic. Gone is the compelling character of the devoutly Christian cop Sgt. Howie from the original. Gone is the ideal sacrifice who is a virgin, a man who[***SPOILERS***] An utterly dreadful contemporary Hollywood defiling of a British classic. Gone is the compelling character of the devoutly Christian cop Sgt. Howie from the original. Gone is the ideal sacrifice who is a virgin, a man who represents the law and is King for Day, replaced with an aimless, pill popping dolt of a cop from California named Ed Malus, played by an overacting Nicolas Cage. Yes, the film is so bad it makes you laugh, but this is hardly a credit to the makers of the film. It's not categorized as a comedy and yet viewers are counting the ways it made them laugh. Some are arguing that it should be a comedy, and they've got a point. It just doesn't raise my opinion of the film. The sacrifice of Sgt. Howie at the end of the original is a chilling homage to Christian martyrs of the past, and the viewer doesn't doubt for a second that he is a martyr who dies for his religious beliefs. In the remake you can only laugh when Malus is told that he is dying a martyr's death. Martyr for what? Popping pills all day? Overall, a dreary moment in film history I regret having seen.",
      "review_date": "2006-09-05"
    },
    {
      "review_title": null,
      "content": "Not a great movie, but at least it was better than The Village.",
      "review_date": "2006-09-06"
    },
    {
      "review_title": null,
      "content": "This IS the worst movie I have ever seen. The entire premise of the film ties your brain into knots with a plot twist (so to speak) and themes (so to speak) that would be better put to use...Now come to think of it, nothing could save this This IS the worst movie I have ever seen. The entire premise of the film ties your brain into knots with a plot twist (so to speak) and themes (so to speak) that would be better put to use...Now come to think of it, nothing could save this fiilm. The Wicker Man is just another film that should have been left in the past and the money wasted on this wretched remake could have used to help starving children or something. To be frank using the money as toilet paper would have been more practical. My apologies to Nicholas Cage, who I actually like... well sometimes.",
      "review_date": "2007-01-29"
    },
    {
      "review_title": null,
      "content": "I am shocked at the hatred towards this film. I found it to be very interesting.",
      "review_date": "2007-02-28"
    },
    {
      "review_title": null,
      "content": "A dreadful mess of a movie. Will someone please ask second rate directors to stop attempting remakes of classic movies which dont need to be remade. Please.",
      "review_date": "2007-04-28"
    },
    {
      "review_title": null,
      "content": "This movie is not good, although the \"did-I-just-see-that?\" spectacle of a bear-suited Cage punching a woman in the face makes it worth a cheap rental. Also: \"NOT THE BEES!!! NO!!! and \"Give me the bike!\" and \"HOW'D IT GET BURNED? This movie is not good, although the \"did-I-just-see-that?\" spectacle of a bear-suited Cage punching a woman in the face makes it worth a cheap rental. Also: \"NOT THE BEES!!! NO!!! and \"Give me the bike!\" and \"HOW'D IT GET BURNED? HOWDITGETBURNEDHOWDITGETBURNED??!?! and \"BITCHES!!\" Actually, this might be an unsung masterpiece of comedy. So I'll compromise and give it a 5.",
      "review_date": "2007-05-02"
    },
    {
      "review_title": null,
      "content": "Such a lame ending to this not so thriller/suspence of a movie that you would think M. Night Shamalon made it.",
      "review_date": "2006-11-01"
    },
    {
      "review_title": null,
      "content": "This has got to be one of the worst films ever made. It leaves me lost and disappointed. Forced storyline with no sense of purpose/meaning. The only good thing about this movie was Nick's acting.",
      "review_date": "2006-12-26"
    },
    {
      "review_title": null,
      "content": "The PG-13 rating is a curse. The latest exhibit: Neil LaBute's \"The Wicker Man\", a movie that obviously should've delved deeper into the concept of men as breeders, and maximize its flipside of Margaret Atwood's \"The The PG-13 rating is a curse. The latest exhibit: Neil LaBute's \"The Wicker Man\", a movie that obviously should've delved deeper into the concept of men as breeders, and maximize its flipside of Margaret Atwood's \"The Handmaid's Tale\"-potential. What dooms \"The Wicker Man\" from the outset, however, is the truly wretched performance given by Kate Beahan(as Sister Willow). In a matriarchal society that devalues men, diminshing Nicolas Cage as an actor by his pairing up with either catatonic, or crazy women(only Molly Parker finds the right notes), is an unintended nice touch. \"The Wicker Man\" isn't without the occasional striking visual, but it should be clear to anyone familiar with \"In the Company of Men\" and \"Nurse Betty\", that this filmmaker's attempts at eclecticism(an adaptation of A.S. Byatt's \"Possession\" was his other crash-and-burn) doesn't quite reach Soderbergh-like heights.",
      "review_date": "2006-10-29"
    },
    {
      "review_title": null,
      "content": "a terrible yet promising film that shows us only good acting and a couple screams but leaves us dissapointed and empty. A day later you will forget what you saw and then remember \"Oh yeah, that movie was wack\"",
      "review_date": "2006-08-31"
    },
    {
      "review_title": null,
      "content": "Pluck it, stuff it, and eat it for Thanksgiving because this one's a turkey. I've lost two hours that I can't get back.",
      "review_date": "2006-09-15"
    },
    {
      "review_title": null,
      "content": "An average thriller that I enjoyed",
      "review_date": "2006-09-22"
    },
    {
      "review_title": null,
      "content": "I enjoyed the movie and Nicholas Cage's character well enough, even with having heard other people say that it was silly etc in these other reviews.  But I was still impressed with his detective skills, etc. but was very disgusted with theI enjoyed the movie and Nicholas Cage's character well enough, even with having heard other people say that it was silly etc in these other reviews.  But I was still impressed with his detective skills, etc. but was very disgusted with the ending which was so disappointing after all that we go through in this story that I'm giving the movie a 1 out of 10.",
      "review_date": "2013-02-19"
    },
    {
      "review_title": null,
      "content": "Nicholas Cage punching a woman whilst wearing bear costume. This movie has it all. A welcome addition to the exclusive so-bad-it-is-good movie club. What a hoot.",
      "review_date": "2012-11-14"
    },
    {
      "review_title": null,
      "content": "NOT THE BEES!!! NOT THE BEES!!! NOT THE BEES!!! NOT THE BEES!!! NOT THE BEES!!! NOT THE BEES!!! NOT THE BEES!!! NOT THE BEES!!! NOT THE BEES!!! NOT THE BEEs!!!",
      "review_date": "2014-01-16"
    },
    {
      "review_title": null,
      "content": "This is one of the funniest movies I've ever seen, from “Not The Bees!!!\", to Nicholas Cage in a bear suit punching a woman, to Sister **** and Ellen Burstyn painted like Braveheart, yes this movie brings me a lot of joy, except for being aThis is one of the funniest movies I've ever seen, from “Not The Bees!!!\", to Nicholas Cage in a bear suit punching a woman, to Sister **** and Ellen Burstyn painted like Braveheart, yes this movie brings me a lot of joy, except for being a remake of a great classic, but this is still comic gold, and it is my joy.",
      "review_date": "2014-02-14"
    },
    {
      "review_title": null,
      "content": "The Wicker Man is not the best written movie, nor does it all make sense. But The Wicker Man is a cult classic, and I can understand why; it is so bad and dumb that it is almost entertaining!",
      "review_date": "2014-07-16"
    },
    {
      "review_title": null,
      "content": "The Wicker Man remake is one the worst  remake and worst acting of Nicolas Cage but it is better than Carrie 2013,  but i prefer watching  The Wicker Man (2006) 100 times  than  Carrie 2013 it wasn't scary it is a funny movie  ,and Wicker ManThe Wicker Man remake is one the worst  remake and worst acting of Nicolas Cage but it is better than Carrie 2013,  but i prefer watching  The Wicker Man (2006) 100 times  than  Carrie 2013 it wasn't scary it is a funny movie  ,and Wicker Man (2006) is a funny movie too , OH, NO! NOT THE BEES! NOT THE BEES! AAAAAHHHHH! OH, THEY'RE IN MY EYES! MY EYES! AAAAHHHHH! AAAAAGGHHH!",
      "review_date": "2014-07-07"
    },
    {
      "review_title": null,
      "content": "One of the worst movies I've ever seen, and it's a huge guilty pleasure of mine. It'll make you laugh more than most intentional comedies that are put out these days.",
      "review_date": "2014-12-20"
    },
    {
      "review_title": null,
      "content": "The Wicker Man is one of the most hilarious non-comedies ever created. It is the epitome of \"so bad it's good\". I have thoroughly enjoyed every single viewing of this masterpiece of stupid. Nicholas Cage delivers some of the best lines he'sThe Wicker Man is one of the most hilarious non-comedies ever created. It is the epitome of \"so bad it's good\". I have thoroughly enjoyed every single viewing of this masterpiece of stupid. Nicholas Cage delivers some of the best lines he's ever had in any movie ever. This movie is why he is the star he is. He's just so awesome. The story makes no sense at all, it contradicts itself, and is just plain laughable. I recommend watching this movie with friends, with the intention to make fun of it while watching it. I love this movie.",
      "review_date": "2016-01-14"
    },
    {
      "review_title": null,
      "content": "Nicholas Cage did a good job keeping me plugged in;  Still, the story line was too depressing.  What kind of universe do you want evil to succeed.  I get a bit pissed with the \"intellectual film critic\" who seek to depress the rest of us withNicholas Cage did a good job keeping me plugged in;  Still, the story line was too depressing.  What kind of universe do you want evil to succeed.  I get a bit pissed with the \"intellectual film critic\" who seek to depress the rest of us with this tripe, calling it art and giving accolades for intellectual tripe.",
      "review_date": "2016-09-02"
    },
    {
      "review_title": null,
      "content": "This movie as a horror movie is not even close to being in anyway a logical, concise or even a remotely frightening experience. But as an unintentional comedy, it is glorious. Loved every moment of Nick Cage not being able to have a decentThis movie as a horror movie is not even close to being in anyway a logical, concise or even a remotely frightening experience. But as an unintentional comedy, it is glorious. Loved every moment of Nick Cage not being able to have a decent conversation with any of the towns women. Especially any conversation with the young housemaid or Sister Willow. Hilarious.",
      "review_date": "2016-10-22"
    },
    {
      "review_title": null,
      "content": "NOT THE BEES!The Wicker Man is horrendously awful, But that’s what makes it so entertaining.",
      "review_date": "2019-12-22"
    },
    {
      "review_title": null,
      "content": "It seemed rather sterile, I think is the best term to use. The characters in terms of the inhabitants of this small, isolated from the 'real world' island seemed pretty stale. Yes they were a bit creepy I suppose but I never felt all thatIt seemed rather sterile, I think is the best term to use. The characters in terms of the inhabitants of this small, isolated from the 'real world' island seemed pretty stale. Yes they were a bit creepy I suppose but I never felt all that scared by or, to be honest, particularly intrigued about what was going on. Kate, Edwards ex-fiancee, I thought was actually about the creepiest character in the movie, her whiny, pouty face gave me the creeps somehow lol. It did seem a little strange that Edward had been with Kate, I suppose she had a different demeanour when they had been together before splitting up, it just seemed a litte off somehow, with Edward as the city dweller placed in this quiet and peculiar pagan community. All that seemed to happen for the majority of the movie was Edward running around and shouting at the inhabitants. I was aware of the original movie but I haven't seen it. Knowing that the original cult classic is/was quite a graphic movie I believe and that this has a lower 15 rating, I admit I preferred to watch this version. I had a rough idea of the story and didn't think I could much stomach the ending of the original movie and having not seen the original, I thought that perhaps I might enjoy this newer remake more, not being able to compare the two movies but I would have to agree with at least some of the other critical reviews about this movie as to me it seemed very much lacking in atmosphere I suppose. It didn't seem so much like it was a regular community hiding a deep dark secret sort of underworld, it was more like a peculiar amish type community thats discovered and its hardly surprising when the ending arrives, given the more than somewhat obvious clues to the ending thats scattered throughout the earlier plot, I felt. It didn't seem very thrilling or suspenseful, whereas if it had been done right then perhaps it would have, I can only presume that was the genre that was aimed at. I'm a bit of a wuss when it comes to horror or gore though I do like a decent psychological thriller but I didn't feel particularly like I was on the edge of my seat at any time in this movie really, it just seemed a bit flat and obvious. Yes I was roughly aware of the story before watching it but all the same, it just didn't really seem to work for me somehow. Like other movies I might know the story of before watching it but still enjoy watching it if its an absorbing movie but this really didn't seem to be one of those.Nicolas Cage does ok in his role but this is certainly not one of my favourite Cage movies, put it that way. There wasn't a great deal of scope for his character given the script I think.No I wouldn't recommend this film. Its hard to explain in much detail precisely why it didn't work but it just didn't, somehow. The plot moved a bit too slowly and the characters seemed more annoying than overly sinsister in my opinion. If your interested in the movie, its been shown on terrestrial TV recently so if its on again then by all means check it out if your keen to but I wouldn't recommend paying anything to watch it really but thats just my opinion. Oh and by the way I've got a head cold at the moment so I hope my review has made sense and isn't too bad, I'm not thinking overly clearly but all the same, this is what I've come up with this morning.",
      "review_date": "2021-11-28"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nNicholas Cage tries to find a missing child amongst a cult but gets stung by bees and burnt alive instead.",
      "review_date": "2020-09-23"
    },
    {
      "review_title": null,
      "content": "igor here igor like the cage boy cagey boy is bear foght for rights to touch peepee anytime moobie take place in 1048 where cops rode cycles that fly by power of friendship but cagey the bear boy have no friends so y he rode cycle that y igorigor here igor like the cage boy cagey boy is bear foght for rights to touch peepee anytime moobie take place in 1048 where cops rode cycles that fly by power of friendship but cagey the bear boy have no friends so y he rode cycle that y igor put 9 cuz stoll good moobie",
      "review_date": "2022-12-26"
    }
  ],
  "num_reviews": 88
}