{
  "title": "The Return",
  "rating": 7.5,
  "release_date": "2006-11-10",
  "summary": "Sarah Michelle Gellar stars as Joanna Mills, a tough young Midwesterner determined to learn the truth behind the increasingly terrifying supernatural visions that have been haunting her.  (Rogue Pictures)",
  "critic_reviews": [
    "It's more haunting than it has any right to be, thanks to its love of long, lonesome highways and the way the violence of the past bleeds into the present.",
    "The minimalist style keeps the suspense warm. The movie is unusual among teen horror flicks in that it largely avoids the usual cheap thrills and bursts of scare music. Instead, it carefully repeats isolated images and sound bites until they take on a shivery power.",
    "As for Gellar, she seems game but glum, treading water in a role that represses her comic talents and leaves her little to do but suffer in silence.",
    "London-born director Asif Kapadia's second feature, following 2001's critically acclaimed \"The Warrior,\"  is a slow, low-key supernatural thriller whose story is too slender to justify its feature-length running time.",
    "Mellow -- nay, snoozy -- atmospherics trump actual scares, and it makes almost zero sense.",
    "You may see scarier movies this year, but none so redolent of decomposition.",
    "While Adam Sussman's screenplay can be admired for its emphasis on subtle atmospherics rather than cheap scares, it is a gimmicky slog of an affair that lacks narrative coherence or strong focus.",
    "A welcome antidote to most of the crap that for passes today for horror and other supernaturally themed movies.",
    "Forgettable PG-13 pic will particularly strike fans of harder-edged recent horror pix as much ado about not much.",
    "A large step backwards for a promising director and far from the return we'd been hoping for.",
    "As B-level suspensers go, though, The Return isn't actively awful -- just slow and cursed with a lead who acts with her t-shirt.",
    "Sarah Michelle Gellar is not faring well as a horror-movie scream queen. Gone are the attitude, wit and verve she used to routinely display in the title role of TV's \"Buffy the Vampire Slayer.\"",
    "Since Adam Sussman's script is as lazy as Asif Kapadia's direction is disjointed, nothing ever makes sense, even after the anticlimatic explanation is revealed.",
    "A soporific ghost story.",
    "The Return gets this year's award for most misleading poster, with its image of an empty-eyed, gray-skinned zombie/ghost that appears nowhere in the movie. You might, however, feel a little empty-eyed and zombie-like yourself after emerging from this languid story.",
    "At the heart of The Return is a murder that even the most bumbling homicide investigator could have solved in about 12 seconds."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "What A Great Psychological Thriller!!The Whole Cast Is Great, The Music Is Very Good, And The Plot Is Very Fun To Follow!Sarah Michelle Gellar Show's Us She CAN Act! :)",
      "review_date": "2011-02-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first half is like a rejected draft of a Silent Hill movie, while the second is a disappointingly illogical explanation for the first. Even the soundtrack wants more action out of the characters than they are willing to provide, and the The first half is like a rejected draft of a Silent Hill movie, while the second is a disappointingly illogical explanation for the first. Even the soundtrack wants more action out of the characters than they are willing to provide, and the acting is far too dull for all the shadows and shaky camera tricks to hide. The lack of thrills and content isn't made up for by the languishing suspense and bursts of ill-fitting violence. The Return is only recommended to horror/thriller lovers who want another odd plot to unravel in their spare time.",
      "review_date": "2007-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "an absolute mess. striving to be this eerie, psychological thriller, the film instead winds up being a dull, vague disaster. one day, i hope Sarah Michelle Gellar will make a movie worthy of her talents. but with this and the grudge 2, just an absolute mess. striving to be this eerie, psychological thriller, the film instead winds up being a dull, vague disaster. one day, i hope Sarah Michelle Gellar will make a movie worthy of her talents. but with this and the grudge 2, just now it looks like she'll be the first one to sign up for the Buffy: 10 Years On tv series if it ever materialized.",
      "review_date": "2007-06-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Has EVERYTHING a horror movie should have. Great music, great plot, great acting, great characters, great suspence, great twits. Literally I could not have asked for more. I promise you will walk out with the same bone chilling joy that i Has EVERYTHING a horror movie should have. Great music, great plot, great acting, great characters, great suspence, great twits. Literally I could not have asked for more. I promise you will walk out with the same bone chilling joy that i did. The satisfaction after the conclusion is very strong and very obvious amoung the audience.",
      "review_date": "2006-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Return is aimless, muddled and honestly lacking of any kind of scare or suspense. On top of that, the twist is too hard to grasp, not to mention uninspired and it regrettably features one of the most demented and forgettable performancesThe Return is aimless, muddled and honestly lacking of any kind of scare or suspense. On top of that, the twist is too hard to grasp, not to mention uninspired and it regrettably features one of the most demented and forgettable performances by horror queen Gellar. Youâ",
      "review_date": "2010-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A promising beginning hour and a twisted movie in all. Shows potential to have a horror genre impact but instead falls short with a predictable and meaningless ending. Still, in general, a spooky and well made horror movie. Sarah Michelle A promising beginning hour and a twisted movie in all. Shows potential to have a horror genre impact but instead falls short with a predictable and meaningless ending. Still, in general, a spooky and well made horror movie. Sarah Michelle Gellar is better than thing that she was in The Grudge and The Grudge 2.",
      "review_date": "2006-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A promising beginning hour and a twisted movie in all. Shows potential to have a horror genre impact but instead falls short with a predictable and meaningless ending. Still, in general, a spooky and well made horror movie. Sarah Michelle A promising beginning hour and a twisted movie in all. Shows potential to have a horror genre impact but instead falls short with a predictable and meaningless ending. Still, in general, a spooky and well made horror movie. Sarah Michelle Gellar is better than thing that she was in The Grudge and The Grudge 2.",
      "review_date": "2006-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Better than most horror films. Starts out amazing and finished a bit weak. The plot twitst and spooky scares make this a partically over exageratted bone chilling PG 13 flick. Most PG 13 horror movies are not this good. The ending however, Better than most horror films. Starts out amazing and finished a bit weak. The plot twitst and spooky scares make this a partically over exageratted bone chilling PG 13 flick. Most PG 13 horror movies are not this good. The ending however, keeps it from making the impact of a classic.",
      "review_date": "2006-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Better than most horror films. Starts out amazing and finished a bit weak. The plot twitst and spooky scares make this a partically over exageratted bone chilling PG 13 flick. Most PG 13 horror movies are not this good. The ending however, Better than most horror films. Starts out amazing and finished a bit weak. The plot twitst and spooky scares make this a partically over exageratted bone chilling PG 13 flick. Most PG 13 horror movies are not this good. The ending however, keeps it from making the impact of a classic.",
      "review_date": "2006-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was actually suprised because this movie really scared me. I did not know that it would be so terrifying and jolting. I was very impressed by the acting and would advise you to put it near the top of your much watch list. Good, Clean, I was actually suprised because this movie really scared me. I did not know that it would be so terrifying and jolting. I was very impressed by the acting and would advise you to put it near the top of your much watch list. Good, Clean, almost-R fun. Not just another teen thriller. A overall impressing horror film, leaving a serious imprint on the director's carrer.",
      "review_date": "2006-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nDull, slow-moving film where an assault victim is involved in a car crash that kills her and her soul goes into the body of the young girl in the other car, who grows up to have visions of the victim's assault.",
      "review_date": "2020-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ugly horror film, not scary and with a stupidly and unnecessarily intricate plot where you get lost because probably not even the writers knew where to go. The film is not entertaining and bored and fails to give anything that one shouldUgly horror film, not scary and with a stupidly and unnecessarily intricate plot where you get lost because probably not even the writers knew where to go. The film is not entertaining and bored and fails to give anything that one should finish it for.",
      "review_date": "2022-10-03",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 28,
  "genres": [
    "Drama",
    "Mystery",
    "Thriller",
    "Horror"
  ]
}