{
    "title": "United 93",
    "rating": 7.5,
    "release_date": "2006-04-28",
    "genre": [
        "Drama",
        "History",
        "Crime"
    ],
    "summary": "Acclaimed filmmaker Paul Greengrass writes and directs an unflinching drama that tells the story of the passengers and crew, their families on the ground and the flight controllers who watched in dawning horror as United Flight 93 became the fourth hijacked plane on the day of the worst terrorist attacks on American soil: September 11,Acclaimed filmmaker Paul Greengrass writes and directs an unflinching drama that tells the story of the passengers and crew, their families on the ground and the flight controllers who watched in dawning horror as United Flight 93 became the fourth hijacked plane on the day of the worst terrorist attacks on American soil: September 11, 2001.  (Universal Pictures)… Expand",
    "critic_reviews": [
        "Greengrass has made not only a thoroughly fact-checked film but a film that uncontrovertibly comes from the heart.",
        "Brilliant, tightly focused, and momentous.",
        "Greengrass’s movie is tightly wrapped, minutely drawn, and, no matter how frightening, superbly precise.",
        "United 93 is powerful not only in the way it provides hope through the actions of a few unlikely heroes, but in its ability to take us back through time to a day many of us would prefer not to remember, but will never forget.",
        "An unflinching, powerfully visceral and haunting portrait of the tragic events aboard one of the terrorist-commandeered flights on the fateful morning of Sept. 11, 2001.",
        "May be the most wrenching, profound and perfectly made movie nobody wants to see.",
        "It is the highest compliment I can pay Greengrass to say that he is a master of the mundane, the routine and the everyday.",
        "Far from being exploitive, the effect is inspiring: This is the best of us.",
        "The controversial film that is unbearable--and unmissable.",
        "What United 93 demonstrates, as if we needed proof, is that it is too soon - it may always be too soon - to sort out the feelings from that day.",
        "You’re unlikely to come across a more powerful film this year.",
        "One of the most harrowing, viscerally upsetting films ever made.",
        "The superb United 93, from the British writer-director Paul Greengrass, does not waste time defining the undefinable. Nor does it strain for poetry when, with this story, prose is enough.",
        "It's Greengrass' way of asking a question that looms large in these post-9/11 days: Are we all praying to the same God, or is one man's God better than another, and one man's God vastly more terrifying?",
        "This is a masterful and heartbreaking film, and it does honor to the memory of the victims.",
        "There's no cheap uplift to their victory, no pop catharsis. What's great about United 93 is that you never feel it's just a movie - even though, as a movie, it's terrific.",
        "I am here to tell you that Greengrass has fashioned one of the most powerful films I have ever seen, and that watching it makes you value your loved ones and your privileges more, perhaps, than you ever have. He has made a film that makes you feel, makes you think and makes you want to connect. And that, finally, might be the greatest thing that art can do.",
        "Impossible to recommend as a great Friday night out, yet agonisingly vital as thought-urging cinema.",
        "Paul Greengrass and his cinematographer Barry Ackroyd have created an intestinally powerful and magnificent memorial to the passengers of that doomed flight. It is the film of the year. I needed to lie down in a darkened room afterwards. So will you.",
        "Pulling the bandage of sentiment cleanly away from oozing concepts like ''heroism'' and ''our nation's war on terror'' in the aftermath of recent wounds, here's a drama about the most politically charged crisis of our time that grants the dignity of autonomy to every soul involved.",
        "A respectful, accomplished, non-exploitative piece of historical filmmaking and -- for audiences -- a gripping white-knuckle ride all the way.",
        "The result is a tense, documentary-style drama that methodically builds a sense of dread despite the preordained outcome.",
        "United 93 unfolds with the terrible inevitability of a modern-day \"Battle of Algiers,\" with Greengrass exerting superb control of tone, structure and pace...United 93 may be the best movie I ever hated.",
        "Instead of using actors, Greengrass employed many of the actual air traffic controllers and military commanders who were on the ground that day. Also aiding his film's universality is Greengrass' use of little known actors in the central roles, preventing stardom from affecting our ideas about heroism and patriotism.",
        "It's a long, brutal and honest look at a shattering event some Americans would apparently prefer not to see depicted - but also a respectful, inspiring one that's in no way exploitative or emotionally manipulative.",
        "I wouldn't recommend the movie to anyone, but if the families of the victims take something positive from it, as their cooperation with Greengrass suggests they do, that's justification enough.",
        "The movie is hard going, not least in the sense of powerlessness it leaves in an audience that knows exactly what will happen. And yet you come out feeling that the filmmakers have done the right thing by these people, and by this day.",
        "There's nothing about United 93 that qualifies as entertainment in the traditional sense: It is an unpleasant, wrenching experience, which is just as it should be.",
        "Best understood as a memorial…Like most memorials, it is respectful, premised on competing obligations to the dead and the living, and eager to stress that the deaths were not in vain. It not only tells us we should never forget but also illustrates how we should remember.",
        "This is first-rate, visceral filmmaking, no question: taut, watchful, free of false histrionics, as observant of the fear in the young terrorists' eyes as the hysteria in the passenger cabin, and smart enough to know this material doesn't need to be sensationalized or sentimentalized.",
        "It's an expertly made picture that I wish I could stamp out of my mind. What's the value of artistry that sucks the life out of you?",
        "It’s a mark of Greengrass’ unequaled gift for believably re-creating reality that, once seen, it’s impossible to get United 93 out of your mind, no matter how much you may want to.",
        "Greengrass takes pains to keep events believable and relatively unrhetorical, rejecting entertainment for the sake of sober reflection, though one has to ask how edifying this is apart from its reduction of the standard myths.",
        "We all lived through this not so long ago; it's an odd thing to make a film whose most striking effect is its ability to bring the feelings of Sept. 11 flooding back, then close on a profoundly disturbing note. A crasser film would have been easier to digest and dismiss. It's hard to do either with United 93, and that's either its genius or its folly.",
        "There's just nothing artful about it, and it's Greengrass who deserves the credit. These nonactors don't act the way most people do when playing themselves. They act the way people do when they're being themselves.",
        "Greengrass's reluctance to unduly demonize the villains or overly sentimentalize the victims is commendable on the surface, but it tends to blur the two sides and to mask the gulf that separates them.",
        "Its focus is purposely narrow. But that narrow focus, along with the lack of fully realized characters, and the absence of any historical or political context, raises the question of why, notwithstanding the usual (if shaky) commercial imperative, this particular movie was made.",
        "To see the flight captain and co-pilot checking the plane before takeoff, to watch the varied passengers settling into their seats, is more agonizing than watching passengers board the ship in all those \"Titanic\" films. With United 93 we see these people unknowingly stepping into a history that is still in terrible process. But as a work in (let's call it) the Akhmatova mode, it does not and could not succeed.",
        "United 93, as grueling as it was to sit through, left me feeling curiously unmoved and even slightly resentful."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Paul Greengrass, acclaimed director of 'Bloody Sunday' and 'The Bourne Supremacy,' provides this film with intensity beyond climax; tautly and intoxicating retelling the events of the ill-fated journey of United Airlines Paul Greengrass, acclaimed director of 'Bloody Sunday' and 'The Bourne Supremacy,' provides this film with intensity beyond climax; tautly and intoxicating retelling the events of the ill-fated journey of United Airlines flight 93, which would cease its travel in a field near Shanksville, Pennsylvania. Breaching my personal list of the \"100 Greatest Movies Ever Made,\" Greengrass' '93' is easily the most emotionally strenuous film in a decade, leaving its viewers shocked and still and utterly silenced in horror by its conclusion, which, despite being a film of unparalleled quality, couldn",
            "review_date": "2007-06-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is ok. When the film goes to the people in the United 93 airplane is really good. But when it shows what happens down it's really boring and it ruins the whole movie. In the ground the story is solid and seriously when the eventsThis movie is ok. When the film goes to the people in the United 93 airplane is really good. But when it shows what happens down it's really boring and it ruins the whole movie. In the ground the story is solid and seriously when the events happened it's like nobody really cared. But when we see the characters in the plane there is action and suspense",
            "review_date": "2013-08-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film deserves to be seen. and i can't imagine it being executed any better than it was. it's both beautiful and important.",
            "review_date": "2006-04-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I just saw the movie. I doubt that a \" box office smash hit\" was the producer's primary motive for making the film. If it was to be a money maker he would have appealed to the larger audience and given them what they wanted; whatever I just saw the movie. I doubt that a \" box office smash hit\" was the producer's primary motive for making the film. If it was to be a money maker he would have appealed to the larger audience and given them what they wanted; whatever that exaggeration may have been. Also, 10% of the ticket price is going to the families of UAL93 till today ( at least in this area). I heard one of the family members on the radio this morning and they were very pleased with how accurate and respectful the movie was to the subject. It was more a documentary than a movie. There was no need to dramatize this subject. It was a look into how the events of 9/11 as well as UAL 93, threw the passengers, the crew, the Air Traffic Control, and the military, (and much the world) into shock, confusion, fear, anger and action. It gave a perspective of those involved. It showed how we were unprepared for such an attack. We have hopefully learned and will not let something like this happen again. I found the Documentary by the two French Brothers \"9/11\" to be much more \"disturbing\" since it was all real footage of the event... I'm glad though that the producer did ask many of the families their opinion about making this movie. What I found beneficial about this movie was that it has (will) give an opportunity for those who want to know, the probable story that unfolded relative to flight 93. I know that I always think of the twin towers and the pentagon but not UAL 93. I won't over look it any more. Who knows what may have happened if this aircraft completed its goal? There are those who want to remember and those that do not. People will remember in their own ways. I personally am glad I saw this movie. I feel we are letting down our guard when we become complacent. We are foolishly opening ourselves up for another strike. I want to make them work very hard for their next one. And I do believe it is coming. Maybe that is the question. Who believes the threat of 9/11 still remains? Are those the people who are going to see this movie? I know we all wish it was a simple situation and had a even more simple solution: But it does not. We are at war. I feel for the families and passangers of UAL 93. This movie honors them well.",
            "review_date": "2006-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Unbelievable. No film has nailed me to my seat for five minutes after the end credits started rolling. I didn't think it was possible to make movies like this.",
            "review_date": "2006-06-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Alan P. gave it a2:\rA film I left with the feeling I had been cheated. There could be no involvement with any character, the situation or activity. A film made to cash in on the desire for emotional self flagellation over an event few reallyAlan P. gave it a2:\rA film I left with the feeling I had been cheated. There could be no involvement with any character, the situation or activity. A film made to cash in on the desire for emotional self flagellation over an event few really understand or comprehend. I was was left with the question why bother making such a film.\r Whoever wrote this is a frickin idiot.  I know that sounds harsh, but it's the truth.  No character development...I wonder why...maybe because that was the point!\r Here's a message for you Alan P., When you're giving a film a 2 and you're surrounded by 9s and 10s, either you've proved hundreds of people wrong or you're too intellectually shallow to comprehend even a minute of this masterpiece.",
            "review_date": "2006-09-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Paul Greengrass does it again with the most powerful, gutwrenching film I've ever seen! The film was incredibly realistic and brilliant. It leaves you thinking about the hurt and the paim caused by Sept. 11 for weeks after you see it. Paul Greengrass does it again with the most powerful, gutwrenching film I've ever seen! The film was incredibly realistic and brilliant. It leaves you thinking about the hurt and the paim caused by Sept. 11 for weeks after you see it. One of the things so impressive about it was how he portrayed the terrorists. He didn't create them to be evil goons who were out to destroy the world; he showed how emotional they became and also showed how they prayed and conversed with their Muslim Gods. They strongly believed that they were doing the right thing. It was a mentally draining film, but one of the greatest triumphs in movie-making history.",
            "review_date": "2006-06-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An inspiring and beautiful film, a moving tribute to the victims of 9/11. I was really surprised how interesting this film was.",
            "review_date": "2006-10-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An amazing movie. Difficult to describe, everyone should see this masterpiece.",
            "review_date": "2006-04-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "United 93 recreates the events of 9/11 in a movie that is marked by seriousness and sincerity. Even when the outcome is already known,  it is still extremely tense and emotionally wrenching. Kudos to the actors/actresses too.",
            "review_date": "2013-12-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Oh please! NO one survived! How does anyone really know what happened or what was said? Sure let's make believe but no one actually knows! Right down to the hair and makeup? Really? This was factual?  NOPE!",
            "review_date": "2011-08-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie should have been a tribute to the heroes who gave their lives to save so many others on 9/11. Instead, they are portrayed as vigilantes who killed themselves. All they had to go on was the black boxes and the phone calls made fromThis movie should have been a tribute to the heroes who gave their lives to save so many others on 9/11. Instead, they are portrayed as vigilantes who killed themselves. All they had to go on was the black boxes and the phone calls made from the plane, the rest is conjecture and, in my humble opinion, complete and absolute bull  Nothing like this happened on that plane. They took a tragic story and hollywoodized it until it became a mockery. I was not impressed.",
            "review_date": "2013-02-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "First off i would like to point out that i mean no disrespect to anyone in this review, because i'm here to review the movie not the events that it based on.\rthe movie isn't about the united airline 93 until 55 long minutes, the movie isFirst off i would like to point out that i mean no disrespect to anyone in this review, because i'm here to review the movie not the events that it based on.\rthe movie isn't about the united airline 93 until 55 long minutes, the movie is loud and the camera work was down right terrible and that's coming from the director of the wonderful captain Phillips and the Bourne trilogy, and i do realize it should be a movie inside an airplane, but i felt dizzy watching this.\rand the movie isn't informative at all, i've seen a documentary called \"ZERO An Investigation Into 9-11\" that almost as long as this movie and it explained everything that happened that day.\rfor instance, the whole air traffic noise and buzz was absolutely useless, all what we learned is that the guys were doing their job, the president is the only person who can issue a military strike on possible hijacked airplanes and the military didn't do anything even after the president gave it a GO.\rfor me i would like to see the details including the fact that every airplane was forced to land immediately and how they closed their air space without any accidents, but i didn't get to see that.\ralso the movie did so little on characters, it's not memorable at all, and the only reason that it is critically acclaimed is the fact that it remind us of a tragedy, but the movie was terrible and could have been way better than this.",
            "review_date": "2014-02-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I watched this one last night and I wasn't impressed. What's the point of the film? What is the message of the film? Perhaps the point is to be a historical document in which case a message isn't necessarily appropriate. But I watched this one last night and I wasn't impressed. What's the point of the film? What is the message of the film? Perhaps the point is to be a historical document in which case a message isn't necessarily appropriate. But if it's a historical document, (and I found myself thinking this during it) how much of it is actually historical? Was hot water really used as a weapon? Why, in a film supposedly about Flight 93, does more than half of it deal with the WTC? If the writer had simply accepted that his movie was not a documentary, he might've felt more liberated to engage in exploration of the some the rivettingly interesting dynamics that another director (like Oliver Stone) would be glad to have the opportunity to use to say something. As it is, we are left with a film that has either a completely distinct location from any film ever shot or a film with no location at all. Frankly, after watching it, I don't care which. I remember 9/11 and it hurt me. Watching this film at times allowed me to remember that pain, but not to deal with it, not to understand it in a different way, and not to feel it more deeply than I originally had, so I say phooey. Well, now we know that tragedy plus time plus a bad writer/director equals boring.",
            "review_date": "2006-07-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Faux News...\r \"Riveting propaganda at its finest...\" - Time\r\n\r\n\"4 Stars....\" - Newsweek\r\n\r\n\"This type of propaganda shouldn't be shown on the big screen, but should be shown on the lawn of the whitehouse\"\r\n\r\n- Entertainment WeeklyFaux News...\r \"Riveting propaganda at its finest...\" - Time\r \"4 Stars....\" - Newsweek\r \"This type of propaganda shouldn't be shown on the big screen, but should be shown on the lawn of the whitehouse\"\r - Entertainment Weekly\r \"\"Explosive. Almost like a missle just blew it out of the sky...\"   \r- Variety \r\r\"You would laugh if it were true... \" - The New York Times",
            "review_date": "2006-09-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Propaganda at its best, compelling but so full of bull it make Bush look intelligent! I reckon most of the 10/10 posters are the same people who cheered on CBS midweek, when they showed pictures of dead muslims. Its so sad that so many peoplePropaganda at its best, compelling but so full of bull it make Bush look intelligent! I reckon most of the 10/10 posters are the same people who cheered on CBS midweek, when they showed pictures of dead muslims. Its so sad that so many people are so brain dead/washed, that they only see the world from an Western view point. Next time you fill up your GMC, ask yourself how many Eastern people died just to get your gas in that tank? And I bet many of you don't care, as American blood is worth more than the world put together! You, are truly the oppressed ones!",
            "review_date": "2007-10-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie left me with the feeling that America does anything for cash, a media whore who will take advantage of ANY situation for money. The acting and script left me with an empty feeling since the exact events are not known and to fill This movie left me with the feeling that America does anything for cash, a media whore who will take advantage of ANY situation for money. The acting and script left me with an empty feeling since the exact events are not known and to fill in the gaps to make money seems so Hollywood. I went into it will a bad feeling and tried to make the best of it but it was just a bad movie that was made way too soon. After watching the movie and seeing all the 100s in the scrore it leads me to believe that less than half of the reviewers were unbiased. Maybe a rental or better yet wait for regular cable.",
            "review_date": "2006-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "More Hollywood propaganda to keep the lies alive. This plane was shot out of the air with a missile, the debris was scattered over several miles which is not conducive in the slightest to a plane crashing in one place. Watch this film if youMore Hollywood propaganda to keep the lies alive. This plane was shot out of the air with a missile, the debris was scattered over several miles which is not conducive in the slightest to a plane crashing in one place. Watch this film if you want to continue to be duped into believing that there are hairy terrorists out to get us all, rather than our own government. This movie has been 'okayed' by all the agitprop govt dept's so watch at your own risk.",
            "review_date": "2006-04-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I just saw a press screening of this movie. I didn't like it at all. It plays off the emotions of the day and you see everything from an American piont of view. It never gets into why the event actually took place or why the terroristsI just saw a press screening of this movie. I didn't like it at all. It plays off the emotions of the day and you see everything from an American piont of view. It never gets into why the event actually took place or why the terrorists were doing what they were doing. It brings nothing to society, it just takes us deeper into the Arab-American-hating hole. Terrible.",
            "review_date": "2006-04-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Give me a break!  This pathetic attempt at government propaganda was just stomach-churning for those of us who know what REALLY happened that day.....that plane was shot down, which is why there were pieces of the plane up to 8 MILES from theGive me a break!  This pathetic attempt at government propaganda was just stomach-churning for those of us who know what REALLY happened that day.....that plane was shot down, which is why there were pieces of the plane up to 8 MILES from the crash site.  This flight, and the rest of the flights, were CONTROLLED BY REMOTE BEACON, NOT HI-JACKED by \"Muslims\" (why are 8 of the 19 \"hi-jackers\" STILL ALIVE, and why are their names NOT on the final flight compliments of any of the airliners?  Hmmmm?).  They're trying to convince you that the people's cellphones actually WORKED at that altitude?  Pleeeease.  Oh, and a bunch of passengers charged the \"Muslim Hi-jackers\" with \"box-cutters\"?  Riiiiiiiight.  This movie was so factually inaccurate it was almost hilarious.  Many will scream that I am \"dishonoring the memories of the victims\" by writing this.  On the contrary, I'm honoring them by asking some very disturbing questions and seeking answers.  \"United 93\" is a LIE, people.  Get the facts before you make an emotional judgement.",
            "review_date": "2006-05-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Very \"respectful\", but ultimately I don't know what this movie accomplished. Rhetorically, it seems it has nothing to say. No viewpoint, no politics, no real moral. Artistically, it also accomplished very little. Yes, it was directed Very \"respectful\", but ultimately I don't know what this movie accomplished. Rhetorically, it seems it has nothing to say. No viewpoint, no politics, no real moral. Artistically, it also accomplished very little. Yes, it was directed with a great deal of research and skill, but the final product feels more like the work of a great recreatist or archivist, not an artist and certainly not an entertainer. I left feeling like the movie was exactly what I expected, yet also realizing that MetaCritic scores made me think what I expected would be worth seeing. I can't say I would recommend this to anyone, even if I respect the craft Paul Greengrass used to bring it to fruition.",
            "review_date": "2006-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the most powerful movie I have ever seen.  It kept me fidgeting and on the edge of my seat the whole movie.  I appreciate the fact that it was not politically driven.  I felt more knowledgable about 911 after seeing this film.  IThis is the most powerful movie I have ever seen.  It kept me fidgeting and on the edge of my seat the whole movie.  I appreciate the fact that it was not politically driven.  I felt more knowledgable about 911 after seeing this film.  I highly recomend it.\r THIS MOVIE SHOULD BE SHOWN IN ALL HISTORY CLASSES IN PUBLIC SCHOOLS FROM NOW UNTIL THE END OF TIME.",
            "review_date": "2006-06-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I don't know if official raters were scared of giving a bad rating in case of being shunned by the public. Don't get me wrong i still think that 911 was a terrible tragedy, but hollywood have exploited this fear and turned it into aI don't know if official raters were scared of giving a bad rating in case of being shunned by the public. Don't get me wrong i still think that 911 was a terrible tragedy, but hollywood have exploited this fear and turned it into a film that in no way corresponds with what actually happened. They never made it into the cockpit, There was one less terroist. They insult muslims and turn them into a sterotype of lunatics who want to kill americans. I live in Dubai and all muslims are kind and just want peace . No offence to any families but they make these guys heros. They make the guys heros. All they did was try and save themselves. This movie was made to make money, upset people and generally give a bad name to muslims. Why the two, the scenes were realisic enough and some details were correct.",
            "review_date": "2007-10-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolutely Boring the first 60 minutes of the film. The last 30 minutes make up for most of the film.",
            "review_date": "2007-08-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolutely brilliant movie. Greengrass made all the right choices, I think, from the documentary feel to the casting of unknowns (not allowing us the comfort of \"make believe\" that stars might have provided). Besides the subject matter, the Absolutely brilliant movie. Greengrass made all the right choices, I think, from the documentary feel to the casting of unknowns (not allowing us the comfort of \"make believe\" that stars might have provided). Besides the subject matter, the movie is so disturbing because it feels so raw and real, a power that may have been drained if Greengrass had gone for the more traditional Hollywood storytelling ideas like \"character development,\" which for me is a dicey term anyway. And the movie's final image is so haunting I still can't shake it. The rare movie that is both smart and tremendously moving without trying too hard to be either one.",
            "review_date": "2006-12-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A film I left with the feeling I had been cheated. There could be no involvement with any character, the situation or activity. A film made to cash in on the desire for emotional self flagellation over an event few really understand or A film I left with the feeling I had been cheated. There could be no involvement with any character, the situation or activity. A film made to cash in on the desire for emotional self flagellation over an event few really understand or comprehend. I was was left with the question why bother making such a film.",
            "review_date": "2006-08-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the most terrifying movies I've ever seen, but also one of the best...not easy to watch, but an absolute must-see nonetheless.",
            "review_date": "2006-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I think it is a great movie. It is also a great tribute. I don't care if the events on the actual flight a fictionalized. As told in the movie, they represented how I feel about the people on board. I agree with the viewer who states I think it is a great movie. It is also a great tribute. I don't care if the events on the actual flight a fictionalized. As told in the movie, they represented how I feel about the people on board. I agree with the viewer who states that if the producers made this movie with hope of raking in the dough they who have made a completely different movie. For those who don't like this movie only because it is too soon, I really have no doubt if they view this same movie 10 years from now, they will discover a new appreciation for it.",
            "review_date": "2006-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What's especially painful about \"United 93\" is the optimism that the passengers manage to convey in the midst of such dire circumstances. If the mutiny was a successful one, we learn, \"United 93\" could've turned into the best What's especially painful about \"United 93\" is the optimism that the passengers manage to convey in the midst of such dire circumstances. If the mutiny was a successful one, we learn, \"United 93\" could've turned into the best \"Airport\" movie ever. Of course, there was no Hollywood ending, and the filmmaker knows this, which is best exemplified by not overselling the \"let's roll\" utterance into a sort of Arnold-ism. The highlight of \"United 93\" is when events are at an obvious impasse and both sides engage in duelin' prayers. Personally, I felt a little less ultra-liberal walking out of the theater.",
            "review_date": "2006-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not like the TV A & E movie-- better for the families to watch this one....and a lot was about the Air Traffic controllers and no names were really mentioned on the plane of who was who- but you know them if you've followed the story. I Not like the TV A & E movie-- better for the families to watch this one....and a lot was about the Air Traffic controllers and no names were really mentioned on the plane of who was who- but you know them if you've followed the story. I did not cry at this but did on Flight 93.  Very respectful movie.",
            "review_date": "2006-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An absolutely riveting, involving film. No other motion picture I have seen this year is as strong as this one. Even-handed to the end, it will raise strong emotions that you cannot surpress.",
            "review_date": "2006-07-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is NOT a Hollywood-like production. Weather fact or fiction, this movie portrays a very real, life or death struggle between men. United 93 demonstrates the crude, human emotion that drives us to live",
            "review_date": "2006-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Best of the year, no lie. i can't believe others rated it lower. What do you think is good? Pirates of the Caribbean?",
            "review_date": "2006-11-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I give it a 4 for it's portrayl of humanity.  However, the facts are so unclear of what actually happened that I consider this an irresponsible film for anyone to make.  An event of this magnitude and relevance to the world should onlyI give it a 4 for it's portrayl of humanity.  However, the facts are so unclear of what actually happened that I consider this an irresponsible film for anyone to make.  An event of this magnitude and relevance to the world should only be made into a documentary at most, otherwise it could be looked back upon in the future as propoganda or careless film making.  If you haven't seen \"Loose Change\" you should, to get hard facts that support a very different, but at least equally plausible portrayl of what happened to this flight.",
            "review_date": "2006-10-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "No character development, and key elements of plot development for a well-told story are also lacking. But it's not a documentary either. It's more like a scene from a play where the viewer provides what came before and after. But No character development, and key elements of plot development for a well-told story are also lacking. But it's not a documentary either. It's more like a scene from a play where the viewer provides what came before and after. But it must rate well from an emotional viewpoint. It puts us dead center in the eye of the storm where we have no idea what is happening or will happen next. And for that, though the film proceeds more & more into conjecture, is probably as close to the truth as we are likely to see captured on film. It honors the dead by totally refraining from the melodramatic elements of their situations, so the movie is more about them than what the film makers would like us to feel about them.",
            "review_date": "2006-10-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic and real.",
            "review_date": "2006-12-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "You know.. I wasn't about this film..\rI really was not sure.\r\r\nGreengrass has always been on my radar, his 'Bloody Sunday' was one of the most powerful films I've ever sat through. It was the definition of riviting..You know.. I wasn't about this film..\rI really was not sure.\r Greengrass has always been on my radar, his 'Bloody Sunday' was one of the most powerful films I've ever sat through. It was the definition of riviting.. \r\rThis film is no different. There's so much respect and care. This isn't a patriotic RAH-RAH american crap-fest. This is truely one emotional event and realistically portrayed in every way possible.\r Greengrass might be one of the most intelligent film directors out there. He doesn't sugarcoat things, and presents them intelligently; and very emotionally.\r For those of you who are screaming 'too soon!'\rThen, it's you're choice not to see it. But I will say, this is powerful filmmaking. It can't be denied.\r 10/10",
            "review_date": "2006-04-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Very good film. Solid acting from unknowns. Very intense and emotional. It also shows what it was actually like on Sept-11 watching the News and not knowning what had happened. Nice attention to detail in scenes. But a few complaints - theVery good film. Solid acting from unknowns. Very intense and emotional. It also shows what it was actually like on Sept-11 watching the News and not knowning what had happened. Nice attention to detail in scenes. But a few complaints - the continual \"call you back\" and phone conversations get repetitous, and why do the terrorists just let them all talk amongst themselves at the back? Why do there need to be 3 guys in the cockpit? Otherwise very good.",
            "review_date": "2006-04-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Apparently, the movie-going public is not as in need of coddling as some had declared. This is an important film, and while painful to watch, it reminds us that freedom is never free.",
            "review_date": "2006-04-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "MS. S. is an unsympathetic scumbag cuz its not just a movie u clown and it is good because it is based on true events. If u knew anything about film u would know how well made this movie is and it is never boring. How could u say this movieMS. S. is an unsympathetic scumbag cuz its not just a movie u clown and it is good because it is based on true events. If u knew anything about film u would know how well made this movie is and it is never boring. How could u say this movie was boring I was on the edge of my seat throughout. Keep your comments to yourself if that's what u were going to say.",
            "review_date": "2006-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm sorry, but good intentions doth not a good movie make. Leaning so far backward to be unexploitive, this movie is virtually without dramatic value other than being a true story we're all close to. And, hey, acting is a I'm sorry, but good intentions doth not a good movie make. Leaning so far backward to be unexploitive, this movie is virtually without dramatic value other than being a true story we're all close to. And, hey, acting is a profession for a reason. Not just anybody can do it. Apart from reliving the events of that day, watching the real life people from the control room improvise their own dialog is downright grim.",
            "review_date": "2006-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Considering that there were only scraps of information available regarding the innocent passengers and the venemous islamo-fascist killers, the movie turned out to be very well made.  I recommend it highly to anyone unclear about the eventsConsidering that there were only scraps of information available regarding the innocent passengers and the venemous islamo-fascist killers, the movie turned out to be very well made.  I recommend it highly to anyone unclear about the events of 9/11, or anyone who needs a refresher about the kind of scum that hates America.  Tasteful, powerful.",
            "review_date": "2006-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie sucks!! I mean I feel for what happened on Sept 11 but that doesnt make for good entertainment....The camera was so shaky it made me sick, I was so bored throughout the whole thing....I hope this movie bombs....Its already heading This movie sucks!! I mean I feel for what happened on Sept 11 but that doesnt make for good entertainment....The camera was so shaky it made me sick, I was so bored throughout the whole thing....I hope this movie bombs....Its already heading in that direction, at the multiplex where I went to see it (on the first Sat it came out) it was showing at the way back of the theater...Which is usually reserved for garbage or for movies that have been out for weeks .There were less then ten people in the theater!!! I only went to see it bcuz it was my girlfriends choice...Although I hated it I could see why it was made and why it will affect people the way it does...Trust me watch it on dvd and save your money for popcorn movies like mission impossible or the davinci code.",
            "review_date": "2006-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I read Ms. S review and respectfully agree to disagree with her. Unfortunately, we all the know the horror and tragic ending before we enter the theater. Ms. S decided not to allow herself to be seated on that plane as most of us do whenever I read Ms. S review and respectfully agree to disagree with her. Unfortunately, we all the know the horror and tragic ending before we enter the theater. Ms. S decided not to allow herself to be seated on that plane as most of us do whenever we watch a movie. If she wasn't herself in that seat then she could sit back disinterested and tear the movie apart as she has done. It's very easy to be a critic when you can become dispassionate about what you are watching because the subject matter is too painful to watch. The truth be told from the director to all the actors you feel their raw emotions as well as the realization as to what must be done at the point of no return. It is simply masterful and captivating. Kudo's to all those involved for making such a great film. And yes, Ms. S as American's we should never forget the events of 9-11 nor should we bury our heads in the sand in the hope that it never happens again. God Bless America!",
            "review_date": "2006-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Omg this movie was one of the best movies i have seen.. it touched me ... it made me think a lot diffrent about 9-11 too.. i never really got it till i saw this movie.. it was really good.",
            "review_date": "2006-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm awarding this film a 10. Not a 10 in the sense that 'it was entertaining and I want to watch it over and over', but a 10 for what was simply a job well done. I think the subject matter was extremely difficult to tackle I'm awarding this film a 10. Not a 10 in the sense that 'it was entertaining and I want to watch it over and over', but a 10 for what was simply a job well done. I think the subject matter was extremely difficult to tackle without cliches and 'drama for drama's sake' creeping in, and despite the challenges, the cast and crew succeeded admirably in this endeavor. I found the film endlessly taut and gripping, yet respectful and profound throughout its execution. My hat's off to Greengrass and crew for doing things right without resorting to the tired trappings of Hollywood. Utilizing a cast with little to no name equity was precisely the right thing to do. As I said, this is not a film I feel compelled to watch over and over again, as that implies being entertained...and entertainment was not my reason for going in the first place. I went to remember...and remember I did. I could tell this film connected with me personally after leaving the theater because it's been a very long time since I felt the numbness of 9/11. In witnessing this film's non-manipulative handling of that fateful day, much of that numbness returned to me, and I think that more than anything else indicates this film was a moving and worthy effort.",
            "review_date": "2006-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I left outragged at the lack of coordination and decision making of everyone except the head traffic control leader. Where were all of the military aircraft? Where were our leaders when we needed a fast decision? I expected the ending I left outragged at the lack of coordination and decision making of everyone except the head traffic control leader. Where were all of the military aircraft? Where were our leaders when we needed a fast decision? I expected the ending verbage to say \"we have fixed our system of command and control so this won't happen again\"",
            "review_date": "2006-05-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Outstanding movie on a difficult topic. One can't exactly have a happy ending. Also, all the main characters, of course, die. This was a movie about the heroism of the passengers on one flight. Some of them were more important than Outstanding movie on a difficult topic. One can't exactly have a happy ending. Also, all the main characters, of course, die. This was a movie about the heroism of the passengers on one flight. Some of them were more important than others in the action, but nothing was contrived, nobody was larger than life. Even the sound track was good, as were the special effects (though this was not a \"special effects movie\"). Signficantly, a number of the participants on the ground acted their real-life parts.",
            "review_date": "2006-05-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was the most powerful movie i have ever seen very good and is going to win movie of the year never forget the bravery of flight United 93.",
            "review_date": "2006-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I think this is one of the most profound movies I have ever seen. It has the authenticity that viewers deserve as well as the victims of that horrible action. In my opinion, the movie is a true masterpiece and fits in with the likes of I think this is one of the most profound movies I have ever seen. It has the authenticity that viewers deserve as well as the victims of that horrible action. In my opinion, the movie is a true masterpiece and fits in with the likes of masterpieces from John Ford and Frank Capra.",
            "review_date": "2006-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Incredibly powerful and moving. Will go down as one of the finest films ever produced.",
            "review_date": "2006-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Way overrated! Dramatic and well directed, but, honestly, there was nothing new or worthwhile here for anyone who knows what happened (which is everyone) on Flight 93 on 9/11. The acting was good, except for the air traffic controller who Way overrated! Dramatic and well directed, but, honestly, there was nothing new or worthwhile here for anyone who knows what happened (which is everyone) on Flight 93 on 9/11. The acting was good, except for the air traffic controller who played himself. I've seen better acting in my kids school play. Enough is enough on 9/11. Let's get on with life.",
            "review_date": "2006-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you think you can take it, please see it. To miss \"United 93\" is to miss the best film of the year so far. There's not a false moment in this awesome piece of work. On every level, what we have here is inspired filmmaking. But If you think you can take it, please see it. To miss \"United 93\" is to miss the best film of the year so far. There's not a false moment in this awesome piece of work. On every level, what we have here is inspired filmmaking. But remember that after you see it, it won't go away.",
            "review_date": "2006-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Before watching this movie you should do a google video search for a movie called Loose Change and watch that. It pretty much proves that (among other things) flight 93 never crashed. I'm not rating this on entertainment value orBefore watching this movie you should do a google video search for a movie called Loose Change and watch that. It pretty much proves that (among other things) flight 93 never crashed. I'm not rating this on entertainment value or anything, I just don't think a movie should have a crazy high score like this when its just feeding off peoples false conceptions about what happened on september 11, 2001.",
            "review_date": "2006-05-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "im giving this a 0 on the grounds that the hollywood have now gone to the lowest of lows. with hollywood running out of material to make films with. this all started at the \"lets make a sequel and maybe part 3 part 4 and so on, then theyim giving this a 0 on the grounds that the hollywood have now gone to the lowest of lows. with hollywood running out of material to make films with. this all started at the \"lets make a sequel and maybe part 3 part 4 and so on, then they moved into the lets do movies about all the super hero comics then they moved to the lets make a remake of all those old films that made money mabe if we re do them we can fleese Jo Public, then as they thought that they had ripped off everthing some bright spark thought \"hey lets make movies about computer games\". now that they have done all of the above lets make a movie about 9/11 hey no one has done that. maybe we could do a sequel to it aswell like the bombing of some mountains and the ousting of the taliban so they can make some oil pie run through it to saddams palace.",
            "review_date": "2006-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Yes it's gripping. yes it's tense. yes, it even brings tears to your eyes and leaves you feeling completely helpless, but then, why would'nt it, it's about the most horrorfying nightmare that everyone on the planet sharesYes it's gripping. yes it's tense. yes, it even brings tears to your eyes and leaves you feeling completely helpless, but then, why would'nt it, it's about the most horrorfying nightmare that everyone on the planet shares and it puts you right back smack down in the middle of it. But, it is a nightmare that most people have already come to grips with in their own personal way and watching this movie is like seeing Hollywood trying to be first to cash in on an event that changed the world and I for one, am sorry I fell into the whole \"unmissable\" promotion by paying 10 bucks to see something I relive on a daily basis anyway.",
            "review_date": "2006-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie was very powerful. There is really nothing more you could say about it. It does what it is suppose to do. shed some light. At Least that is what i want to say but however. This movie did not answer any questions. This movie just The movie was very powerful. There is really nothing more you could say about it. It does what it is suppose to do. shed some light. At Least that is what i want to say but however. This movie did not answer any questions. This movie just reanacted what some people consider to be a lie. Greengrass did what he does best. create an action movie. People have asked if this is the right time for a 9/11 movie. Sure, As long as it tells the truth. And again. Stop with the shaking of the camera!! If I have offended anybody. I greatly apologize. That is just how I feel.",
            "review_date": "2006-05-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wonderful telling of a story we all know but need to remember. The notion that it has no overt moral to my mind is a tribute to the moviemakers. We don't need to be preached at. It simply shows the truth.",
            "review_date": "2006-05-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Grenngrass knows how to get the most out of his actors - using real world air traffic controllers and military personnel has added a depth to the dimension of the tragedy that day.",
            "review_date": "2006-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "~Quite a powerful film, although i think the ending should have been filmed more conclusively. Thought the head boss in the Boston avaiation centre was great. A lot of what happened in the plane was speculation but you have to piece things ~Quite a powerful film, although i think the ending should have been filmed more conclusively. Thought the head boss in the Boston avaiation centre was great. A lot of what happened in the plane was speculation but you have to piece things together from somewhere.",
            "review_date": "2006-06-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was a little too real. It felt more like a historical document than a movie. Maybe it IS too soon, for me, anyway. I've never felt such sadness, frustration and anger watching a movie before. But in a good way. I should rate it It was a little too real. It felt more like a historical document than a movie. Maybe it IS too soon, for me, anyway. I've never felt such sadness, frustration and anger watching a movie before. But in a good way. I should rate it higher, but United 93 was the opposite of escapism. If anything, it woke me up even further into stark reality. I don't need that right now.",
            "review_date": "2006-06-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The best film since 'Crash'. Simply a must-see. Will grab you by the heart and hold on 'til the very end.",
            "review_date": "2006-06-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "sorry guys. the worst kind of propaganda. very slick. but let us not forget that what is being presented in an emotionally masterfully manipulating manner as hard historical fact is at best speculative storytelling. however, it is fullysorry guys. the worst kind of propaganda. very slick. but let us not forget that what is being presented in an emotionally masterfully manipulating manner as hard historical fact is at best speculative storytelling. however, it is fully understandable that people want to believe this tragic and heroic version of the story.",
            "review_date": "2006-07-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I have not spoken to anyone (who actually saw the movie) that did not truly admire the film. the different angles the film is viewed from, along with the gripping performances made me proud to honor these victims and their families. Put yourI have not spoken to anyone (who actually saw the movie) that did not truly admire the film. the different angles the film is viewed from, along with the gripping performances made me proud to honor these victims and their families. Put your thoughts of how \"wrong\" you think the idea of profiting from this tragedy is and go see this movie with an open mind. You will be blown away and awarded with an amazing experience.",
            "review_date": "2006-08-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The best film of the year!. United 93 deliver us a powerful testament of survival that haunts and leave you stunned and breathless for several minutes after the film ends.",
            "review_date": "2006-08-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best. Really engaged.",
            "review_date": "2006-08-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was an amazing film. Paul Greengrass created a brilliant movie without using human interest as motivation. This movie was made to reflect life at that exact time, even though we all know how it will end, you are still on the edge of This was an amazing film. Paul Greengrass created a brilliant movie without using human interest as motivation. This movie was made to reflect life at that exact time, even though we all know how it will end, you are still on the edge of your seat as if it were happening for the first time. I dreaded seeing this movie for obvious reasons, but I am very glad that I did!",
            "review_date": "2006-09-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fan-freaking-tastic. After watching this movie I almost went to sign up for the Marine Corps...but I",
            "review_date": "2006-09-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film is ridiculously good. It's so well made, thought provoking, and tear-wrenching. Although people may not like the fact that a movie was made about 9/11, this is the best one that possibly could have been made.",
            "review_date": "2006-09-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Brilliantly executed, thoroughly engrossing and chilling as it builds to its inevitable conclusion. A film that looks at the chaos of the day without slipping into a political agenda or an exploitative tug at the heartstrings.",
            "review_date": "2006-09-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The most important and, quite possibly, the very best film of the year.",
            "review_date": "2007-03-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Probably the most terrifying film ever made and certainly the best film of 2006. The pacing here is nothing short of demonic, but what elevates this film to the level of \"masterpiece\" is that it contains a stunning veracity that is as Probably the most terrifying film ever made and certainly the best film of 2006. The pacing here is nothing short of demonic, but what elevates this film to the level of \"masterpiece\" is that it contains a stunning veracity that is as lyrical as it is painstakingly real. By not sensationalizing, by refusing to exploit, it stands in direct opposition to the glorified manipulations of the post-9/11 experience. This is a truly great film.",
            "review_date": "2007-05-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "United 93 was an incredible movie from start to finish. Many people are saying its too early for this kind of movie, and that Hollywood wants money off a horrible disaster. Well, those people have wrapped themselves into that protective United 93 was an incredible movie from start to finish. Many people are saying its too early for this kind of movie, and that Hollywood wants money off a horrible disaster. Well, those people have wrapped themselves into that protective cocoon that we had done to ourselves before 9/11. And who cares if some guys acting is bad? In real life people aren't acting. The flight controller didn't act on 9/11! This movie was well made, and very scary, but I didn't freak out that it showed the Towers getting hit. That actually happened people. Don't act like it didn't. Over all, everyone over the age of 15 should watch this movie so they can really understand what really happened. Incredible movie.",
            "review_date": "2006-12-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A brilliant film that I could not give a 10, because it is painful to watch at times, as it probably should be. The film unfolds in almost real-time, focusing only on the events over US airspace on that morning. The first half of the movie A brilliant film that I could not give a 10, because it is painful to watch at times, as it probably should be. The film unfolds in almost real-time, focusing only on the events over US airspace on that morning. The first half of the movie mostly deals with the frenzied disbelief of those controlling and protecting the airspace, and gradually works it way down to the mesmerizing, and painful final 30 minutes on board flight 93. It is a small movie about a huge event, and that's what makes it work. It is a well-crafted, and tightly knit thriller, with excellent pacing, and, even though you know what will happen, you'll still watch with both anticipation and horror. Other reviews complain about a lack of context and character development, but, I think we all have a context for these events, and the whole point of the film is that these were just people doing what they needed to do. The smattering of personal information is still enough, that when the passengers make those final cell-phone calls to their families, it remains gut-wrenching. Their final decision to storm the terrorists is a simple one, made from circumstance, and highlights the fact that heroic actions are not those of grand plans and designs, but of necessity, to prevent harm to others. If you are not ready to re-live that day from another perspective, then don't see this film, but if you are, you will likely experience some painful emotions, but you may well be rewarded with some greater understanding.",
            "review_date": "2006-10-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A tour de force of modern American docudrama. Many people claiming it as exploitative are missing the point. This movie is one which Hollywood does not usually make, and that it precisely what makes it so haunting.",
            "review_date": "2006-12-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Try and read a little bit about this one before going to see it.  Greengrass and the actors all did thorough research and the film was certainly cast and shot in a non-traditional way.  I found it to be a tremendously well-made film and feltTry and read a little bit about this one before going to see it.  Greengrass and the actors all did thorough research and the film was certainly cast and shot in a non-traditional way.  I found it to be a tremendously well-made film and felt like I learned a lot more about a subject that the media covered ad nauseum.  The movie does not attempt to cash in on the tragedy, nor does it attempt to raise any sort of patriotism out of its viewers.  It is simply a minute by minute account of pretty much the entire morning of 9/11/01 and what might have happened aboard United Flight 93.",
            "review_date": "2006-04-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I think a movie made to rehearse 9/11 is a load of garbage and displays absolute disrespect to the families who lost loved ones. I don't care how good it might be, but anyone who is patriotic and has any respect for that day in AmericanI think a movie made to rehearse 9/11 is a load of garbage and displays absolute disrespect to the families who lost loved ones. I don't care how good it might be, but anyone who is patriotic and has any respect for that day in American history shouldn't see it.",
            "review_date": "2006-04-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "To be honest I felt a little nervous while spilling my opinions into this review. One reason is because I am aware of how terrible this event was and I am aware that many people feel strongly about it. I do not mean to offend any of the otherTo be honest I felt a little nervous while spilling my opinions into this review. One reason is because I am aware of how terrible this event was and I am aware that many people feel strongly about it. I do not mean to offend any of the other reviewers here. Just to get that out of the way. As a story goes, this would have been uneventful and generic had it not been based on actual events. I get what the film maker is doing here...replicating fear, drama, and all the other things you need in a highjacking movie. I was awed by the performances, however, despite how this movie would be nothing without the tragedy it refers to. It must have been hard for some of them to act out things like this, and I respect that. But a lousy film is a lousy film. I felt no sense of true sympathy, enthrallment, sadness, or any emotion for that matter. It was sort of a heoic film that came across as more of a \"Just so you know, these people risked their lives and yada yada yada...\" no. When I see a film I don't like to feel as if someone is trying to prove that an event was great. The event stands on its own. It's only five years old. Which might be why some of the kick is gone because it will never forget 9/11. Some might say I'm unpatriotic for not being entertained or enlightened by a film that is so obviously going to have impact...I'm sorry but we don't need a reminder as to how terrible 9/11 was and we don't need another plane movie. It's just a movie to me...a very boring and a very strained movie.",
            "review_date": "2006-04-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The momentum is unearthly: a synergy between kinetic suspense and heartbreaking reality that I don't recall witnessing before in real life, let alone a movie. I can understand why people aren't ready to see it. Yet for the rest of The momentum is unearthly: a synergy between kinetic suspense and heartbreaking reality that I don't recall witnessing before in real life, let alone a movie. I can understand why people aren't ready to see it. Yet for the rest of us, it's about time something other than cheesy Photoshop-filtered web art and political arguments about foreing policy shakes us into understanding the phrase, \"never forget.\"",
            "review_date": "2006-04-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Scary as hell, but thats what makes it a thrilling movie.",
            "review_date": "2006-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I found the movie to be a masterful creation, emotionally honest and lacking in histrionics. I give it an '8' rather than a '10' because it refused to acknowledge all the evidence (Namely: debris field scattered overI found the movie to be a masterful creation, emotionally honest and lacking in histrionics. I give it an '8' rather than a '10' because it refused to acknowledge all the evidence (Namely: debris field scattered over miles; eye-witness reports of a trailing jet; phone calls from the plane that end with the sound of rushing wind; phone call just before the crash that refers to smoke in the plane). Not that any of this PROVES the plane was shot down, but to pretend it doesn't exist points to a cover-up.",
            "review_date": "2006-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Unsentimentally evokes the emotion of compassion more powerfully than any movie in memory. Well honed paced and crafted. The mechanics of air traffic control on 9/11 and the internal havoc the hijackings caused that day are intensely Unsentimentally evokes the emotion of compassion more powerfully than any movie in memory. Well honed paced and crafted. The mechanics of air traffic control on 9/11 and the internal havoc the hijackings caused that day are intensely represented in riveting sequence after riveting sequence. The final scenes and those where incomplete information exists might leave some viewers wishing for more but the film has many qualities beyond that to offer and is thought provoking on many levels. Recommended.",
            "review_date": "2006-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Without a doubt the best movie I have seen this year!!! Being prepared with a box of kleenex was simply not enough. I simply could not anticipate the pit in my stomach. It was amazing how real this was and how it triggered the emotions of Without a doubt the best movie I have seen this year!!! Being prepared with a box of kleenex was simply not enough. I simply could not anticipate the pit in my stomach. It was amazing how real this was and how it triggered the emotions of that very day. The cast of unknowns was phenonmenal and direction was brillant. This truly speaks to the heroism the country witnessed during and following this tragedy.",
            "review_date": "2006-05-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Excellent movie. Terrifying and disturbing this movie needs to be seen by all and especially those who have forgotten.",
            "review_date": "2006-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was not impressed. Very messy direction, bad acting, and I even found the writing (was it mostly improvised?) to be shoddy. It just didn't resonate with me emotionally. I would say that Slate's critic is the only one that has the I was not impressed. Very messy direction, bad acting, and I even found the writing (was it mostly improvised?) to be shoddy. It just didn't resonate with me emotionally. I would say that Slate's critic is the only one that has the balls to be honest and admit that this movie kind of sucked. All of the other critics just don't want to put down a movie about 9/11.",
            "review_date": "2006-05-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great!",
            "review_date": "2006-05-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The most intense movie going experience for me. This re-creation might have worked as a stand-alone thriller, but we know it's more than that. It's a tribute to those heroes who prevented what might have been the worst disaster on The most intense movie going experience for me. This re-creation might have worked as a stand-alone thriller, but we know it's more than that. It's a tribute to those heroes who prevented what might have been the worst disaster on that day.",
            "review_date": "2006-05-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "First of all, I want to first mention that any criticism towards the movie is not suposed to be meant negatively as I realize the events actually happened and it is a very serious matter. I'm trying to analyze the movie for that - just First of all, I want to first mention that any criticism towards the movie is not suposed to be meant negatively as I realize the events actually happened and it is a very serious matter. I'm trying to analyze the movie for that - just a movie- nothing more. It's hard to criticize movies like this because they are not really meant to entertain - how can someone be entertained by terroism? They are more ment to inform, to make us remember. First off I saw the rave reviews and thought \"I gatta see that!\" I even had to do some convincing with a friend for a week or so before she agreed to go with me. Well, to sum it up, I was very disappointed. The first hour plus was extremely borning (on an entertainment level) with people in command centers calling one another, and a whole lot of people pointing to small little X's on screens going \"Possible hijack! Possible hijack!\" I probably heard that phrase 100 times in that hour, no joke. Well, maybe a little exaduration. Anyhow, the good part was when the people actually overtook the plane and made it crash. Well, not good that it crashed, just that was the exciting and thrilling part. Let's just say I didn't leave the movie with joy in my heart, but It did make me remember what our country has gone through and ALMOST make my cry (no movie has ever made me cry). If you want to leave a movie sad, be reminded of terrorism, but at the same time pay your tribute to those who gave yoru lives, see this movie. If you want to go to a movie for entertainment, to go with your girl, to leave happy, to feel entertained, etc, go see something else and wait until maybe 9/11/06 and watch it in a dark room with some kleenex as you remember those who lost their lives.",
            "review_date": "2006-05-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the most intensely powerful and moving films I have ever seen. Hands down this is the best film of the decade to date.",
            "review_date": "2006-05-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What a powerful movie! My only complaint is why remove the children passengers? Why make the youngest passengers in their 20s? I felt this was a little whitewashing. Still a great movie. Extremely realistic.",
            "review_date": "2006-05-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Missing from all but one review is the subtle, recurring religious undertone of four men apparently driven by their need to appease their God and seek  heavenly reward by the brutal, suicidal killing of innocent civilians, contrasted byMissing from all but one review is the subtle, recurring religious undertone of four men apparently driven by their need to appease their God and seek  heavenly reward by the brutal, suicidal killing of innocent civilians, contrasted by  Christian victims praying to a God who chose to be the  sacrifice Himself thru His son.  We have seen the very basic, frontline elements of jihad at its rawest.   Although there was great fear, bravery, confusinon and sadness there was also an awakening to a new type of war in which the enemy become the weapons.  The only heros are dead heros.",
            "review_date": "2006-05-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's more of a memorial than a movie. I felt the same as I did that day so it is not a pleasant experience, but you really can't miss it.",
            "review_date": "2006-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Expertly made. Not for everyone, but defenitely worth a look.",
            "review_date": "2006-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the most powerful films I have ever seen. If you are ready to relive these events, you should absolutely see it.",
            "review_date": "2006-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Incredible. Thought provoking. One of the best this year.",
            "review_date": "2006-05-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A movie that should be seen by every one. Expertly done, and as for timing not to soon.",
            "review_date": "2006-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An excellent, restrained, intelligent improvisation -- crafted together from the cell phone transcripts, operator notes, cockpit tapes, FAA snippets, surviving sponse interviews who listened on the other end of the tense phone line. I loved An excellent, restrained, intelligent improvisation -- crafted together from the cell phone transcripts, operator notes, cockpit tapes, FAA snippets, surviving sponse interviews who listened on the other end of the tense phone line. I loved that there was little or no \"mood music\", no sentimental speeches... and the hand held shots gave me the feeling of witnessing the ordinary becoming extraordinary. It is a subtling chilling film about such a sensitive event. Breath deep and be brave and just watch the morning on Flight 93 unfold. As for all the negative \"2\" votes by John B and JJ and John L... (maybe all the same guy?) Perhaps the Johns of this world shouldn't see it. But if your name is anything else... don't miss it!",
            "review_date": "2006-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "WARNING: Not for the faint of heart. This just may be the best movie of the year...why? Because a lot of people that I know who have seen the film, including myself, experienced actual pysical pain afterwards. The movie is so well-made and WARNING: Not for the faint of heart. This just may be the best movie of the year...why? Because a lot of people that I know who have seen the film, including myself, experienced actual pysical pain afterwards. The movie is so well-made and so intense it is as if you had 3-D glasses on and experienced every single emotion that the passengers on the fateful flight had. I left with my hands shaking and stifness slowly moving up my spine. One of the most intense and taut films that I have seen in my 15 years of life. Oh...and that ending... *shivers*",
            "review_date": "2006-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A flawless representation of reality. Movies based on the event were inevitable. We couldn't have possibly hoped for something better that this film. It manages to avoid exploitation of the subject entirely. The best movie of the year so far.",
            "review_date": "2006-05-04",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 139
}