{
  "title": "V for Vendetta",
  "rating": 7.8,
  "release_date": "2006-03-17",
  "summary": "Set against the futuristic landscape of totalitarian Britain, V for Vendetta tells the story of a mild-mannered young woman named Evey (Portman) who is rescued from a life-and-death situation by a masked man (Weaving) known only as \"V.\" Incomparably charismatic and ferociously skilled in the art of combat and deception, V ignites aSet against the futuristic landscape of totalitarian Britain, V for Vendetta tells the story of a mild-mannered young woman named Evey (Portman) who is rescued from a life-and-death situation by a masked man (Weaving) known only as \"V.\" Incomparably charismatic and ferociously skilled in the art of combat and deception, V ignites a revolution when he urges his fellow citizens to rise up against tyranny and oppression. As Evey uncovers the truth about V's mysterious background, she also discovers the truth about herself -- and emerges as his unlikely ally in the culmination of his plan to bring freedom and justice back to a society fraught with cruelty and corruption.  (Warner Bros.)… Expand",
  "critic_reviews": [
    "A compelling, rousing and at times strangely moving entertainment.",
    "Richly satisfying entertainment the way movies are at their best, when they prod you to think.",
    "V for Vendetta puts its ideological intent first, and happens to provide smashing entertainment only as a vehicle for delivering its message.",
    "It's a terrific movie. I love the look and the verve of the thing, the confidence of its epic design, its smart use of half a dozen noted British thesps, lending weight and wit to the supporting roles.",
    "The explosive V for Vendetta is powered by ideas that are not computer-generated. It's something rare in Teflon Hollywood: a movie that sticks with you.",
    "V for Vendetta represents 2006's first memorable motion picture - a visually sumptuous concoction that combines political allegory, bloody action, and a few stunning cinematic moments into a solid piece of entertainment.",
    "An entertaining piece of pulp fiction.",
    "Visually exhilarating, provocative and disturbing.",
    "Portman doesn't catch fire until the second half, then heaves herself into emotional action; this suits her initially passive, mostly unthinking character. Weaving, who acts entirely with his voice, is V's ideal embodiment: witty, rueful, pitiless, visionary and mad.",
    "The Wachowski Brothers once again they prove themselves our reigning masters of murk.",
    "Setting out more to challenge us with its ideas than make us whoop at the action, Vendetta can be clumsy, but there are enough impressive flourishes to make up for its stumblings.",
    "It's the perfect moment for the ridiculous but riotously enjoyable revolutionary comic-book thriller V for Vendetta-which will doubtless outrage conservatives and unnerve fuddy-duddys but liberate the rest of us with its magisterial irresponsibility.",
    "One of the most eloquent tales in ages of dysfunctional love – between a man and his ideals, between a country and its government, and, in the end, between Evey and V.",
    "Mostly, it's content to remain a compelling, visually striking political mystery with some big ideas woven into it--subversive notions about integrity, liberty, and political change.",
    "As a fix of pop iconography, V for Vendetta is eyeball grabbing, even if it lacks the relentless videogame bravura that sold the Matrix films. As a movie, however, it's merely okay, with a pivotal dramatic weakness: Evey, for all the attentions of her revolutionary Svengali, remains, in essence, a bystander, and Portman, her head shaved, plays her like Joan of Arc as a tremulous Girl Scout.",
    "With most action thrillers based on graphic novels, we simply watch the sound and light show. V for Vendetta, directed by James McTeigue, almost always has something going on that is actually interesting, inviting us to decode the character and plot and apply the message where we will.",
    "Brutally gorgeous and seething with incendiary images.",
    "A lot of dark, Orwellian fun.",
    "Even if V for Vendetta isn't nearly as incendiary as it's been made out to be by some alarmist critics, there's still something enjoyably subversive about it, beginning with the way it tramples over the conventions of the contemporary action film.",
    "First-time director James McTeigue's big, bold imagery, with slashing reds and blacks, is a close approximation of the novel's look and feel.",
    "Hugo Weaving, weaving deftly beneath a fixed plastic grin and Prince Valiant wig as the mysterious avenger in V for Vendetta, both chills and amuses throughout this enjoyable - if occasionally irresponsible - comic-book thriller.",
    "Viewers expecting a thrill ride might be disappointed. V engages in a couple of satisfying crime-fighting set pieces, but the story is more occupied with mystery and intrigue. Happily, it almost is entirely free of the hollow pomposity that marred the Wachowskis' last two \"Matrix\" films.",
    "From a fan's perspective, though, one might wish for a smaller budget and a truly uncompromising vision.",
    "The swashbuckling first hour is superior to the second, which bursts at the seams with backstory, but a rousing climax makes this the most potent piece of agitpop in years.",
    "With its emphasis on dialogue and political machinations over explosions and kung fu fighting, it remains to be see whether or not V for Vendetta will actually find one (a wider audience).",
    "It's the strangest comic-book superhero movie you're likely to see this year. For anyone looking for something totally different in this most overworked of Hollywood genres, this is it.",
    "V for very, very ordinary.",
    "The real villain is a cowed and lazy citizenry. Meaning all of us. Disappointingly, V for Vendetta makes this point early and moves on, at some point turning as shallow as what it protests against.",
    "Suffers from many of same problems as last two installments of producers Andy and Larry Wachowski's \"Matrix\" franchise: indigestible dialogue, pacing difficulties and too much pseudo-philosophical info.",
    "Absorbing even in its incoherence,V for Vendetta manages to make an old popular mythology new. Impossible not to break into a grin: It's the thought that counts.",
    "Finally, a film to unite movie-mad members of Al Qaeda with your neighbor's kid, the one with the crush on Natalie Portman.",
    "By the time you've gotten through it, you feel spent, loaded down and more than a little disoriented. Part of the problem is that the movie's big concepts - violence begets violence, absolute power corrupts absolutely, everything is connected, my terrorist is your freedom fighter, etc. - are pithy, brief and irrefutable enough to embroider on throw pillows.",
    "The movie plays like a clumsy assault on post-9/11 paranoia. It references \"America's war,\" uses imagery direct from Abu Ghraib and contains dialogue likely to offend anyone who's not, say, a suicide bomber.",
    "The more valid question is how anyone who isn't 14 or under could possibly mistake a corporate bread-and-circus entertainment like this for something subversive. You want radical? Wait for the next Claire Denis film.",
    "Both oversimplifies and overcomplicates Moore's and Lloyd's vision, but it never cuts to the bone. It's a movie drawn with big, bold strokes and very little feeling -- a tracing-paper exercise masquerading as a masterpiece.",
    "The quarter-century-old disgruntled fantasies of two English comic-book artists, amplified by a powerful movie company, and ambushed by history, wind up yielding a disastrous muddle.",
    "V for Vendetta is a dud - far too long at nearly two and a half hours, with flat, grungy visuals, choppy editing and no sense of urgency. But as a political work, it's something else -  heavy-handed, reactionary and flat-out stupid. (For the record, Moore has publicly distanced himself from the film, saying it bears precious little resemblance to his original creation.)",
    "A piece of pulp claptrap; it has no insights whatsoever into totalitarian psychology and always settles for the cheesiest kinds of demagoguery and harangue as its emblems of evil. They say they want a revolution? Then give us a revolution, one that's believable, frightening, heroic, coherent and not a teenagers' freaky power trip."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "V for Vendetta feels like a personal vendetta against today's government but one can not help admire its deeply thought characters, great visuals and intriguing storyline & premise.",
      "review_date": "2014-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best films ive seen in a ong time, the Guy Fawkes mask surprisingly never gets old throughout the movie, V's character is original even though he echoes many characters throughout history, very fun to imagine and not hard to One of the best films ive seen in a ong time, the Guy Fawkes mask surprisingly never gets old throughout the movie, V's character is original even though he echoes many characters throughout history, very fun to imagine and not hard to believe, gets a 10 without a doubt.",
      "review_date": "2006-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this is a great movie to see.",
      "review_date": "2006-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is by far the most down to the point movie I have watched.",
      "review_date": "2008-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a readlly good movie! i recommend it to everyone!",
      "review_date": "2008-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Acting, plot, and story are excellent. Ending tops it off perfectly. Couldn't have asked for more...",
      "review_date": "2008-04-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "You people are crazy. Whether some people believe it or not, movies affect and move people. When I get done watching what I believe to be a great movie, I get a great feeling after watching it. And that's what I felt after this one. One You people are crazy. Whether some people believe it or not, movies affect and move people. When I get done watching what I believe to be a great movie, I get a great feeling after watching it. And that's what I felt after this one. One of the best stories I've seen out of Hollywood so far. LOVE IT!",
      "review_date": "2008-06-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The language that V employs in the movie alone makes it worth the watch. It is definently one of the best movies I have seen made in a long while.",
      "review_date": "2006-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love it. I love all of you. I wonder what is it people go for in movies anymore. We complain about acting, about facts, about realism. Then we complain this or that is not true, or this and that is ripped off that guy's book. HEY. Let I love it. I love all of you. I wonder what is it people go for in movies anymore. We complain about acting, about facts, about realism. Then we complain this or that is not true, or this and that is ripped off that guy's book. HEY. Let me remind you something real quick, boys. A movie isn't reality. V for Vendetta is an attempt at reproducing a book's story into visual interest. Had they actually made the entire book into a movie, you'd not have two hours on your hands, but perhaps SIX full hours. [***SPOILERS***] Many of the events were crossed out to squeeze the movie into something as short as possible, while remaining entertaining. What REALLY MATTERED about this movie's success, was that it STAYED loyal to its origins. Not that it entered the norms of literacy and whatever other crap some of you may complain about. In terms of cinematography, this movie blends in together theatrical pleasure and drama perfectly well. You might as well feel that most scenes are shot much like a Shakespearian play. (I'm gonna get flamed for this one in the future) You may be called simplistic by some pseudo-intellectual people for liking this movie. But what counts is not the quantity of references you may attach to it. It's the quality of them. The movie stayed true to the book in many facts, aside that it replaced the past of the book with today. Instead of the Cold War ending with general nuclear warfare, it was America's war on Iraq which spread out too much for its own good. It's not very likely to happen, but the movie reflects \"what ifs\". Other people may even complain about not understanding a thing that is said. Those people just are looking for a typical action movie, where nearly no acting is given and more gunning and killing occurs. V justified every fighting sequence, and made them count into the storyline. Now, remember dear children of cinematography: You're not looking for pure masterpieces when watching a movie. You're looking for entertainment and something of VISUAL and AUDITIVE quality. You may discuss politics when watching the news, otherwise you are just messing with the useless.",
      "review_date": "2006-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't know the original graphic novel so I can't determine how faithful the adaptation is. As a genre film, with a certain 1984 flavor, it works quietly and well, although not to be kept in memory forever.",
      "review_date": "2020-12-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is not just an action movie, it is a part of history.One of the things that I love about this movie is the script, the characters interacts perfectly with each other and everything that V says it's poetry.\n\nIt's sad to say this, butThis is not just an action movie, it is a part of history.One of the things that I love about this movie is the script, the characters interacts perfectly with each other and everything that V says it's poetry.It's sad to say this, but even in 2020, people should watch and understand, movies like this one to really understand what is like living in that kind of situations, and to not make totalitarianism live again.",
      "review_date": "2020-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent throughout every showing. I have seen this movie five times in the years since its release, and each and every time I've taken something new away from it. Extremely well done.",
      "review_date": "2020-11-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Incredible. Moving, and sticks with you. Crazy how relevant this is with today’s American politics. A must see for sure!",
      "review_date": "2020-11-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very beautiful movie withUnique characterizations.I fell in love with this.\nA complete political and very clever film with a story full of excitement.\nI enjoyed every moment of the movie and all the scenes in this movie.\nThe character 《V》A very beautiful movie withUnique characterizations.I fell in love with this.A complete political and very clever film with a story full of excitement.I enjoyed every moment of the movie and all the scenes in this movie.The character 《V》 of each of his words and each of his sentences is an extraordinary fact.The dialogues of all the characters are greatBelieve me, I can not talk much about it. If you do not see it, believe me, you have lost a great pleasure.-VPeople should not be afraid of their government, government should be afraid of their people",
      "review_date": "2022-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent Movie, Best message and a peak of what may be a visible future for America. Watch it twice.",
      "review_date": "2009-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Now, \"V for Vendetta\" here is a great example of how graphic novel-based books should be when made into a movie. The story is deeply involved into the movie as well as the characters and their significance. Natalie Portman especially does aNow, \"V for Vendetta\" here is a great example of how graphic novel-based books should be when made into a movie. The story is deeply involved into the movie as well as the characters and their significance. Natalie Portman especially does a exceptional, outstanding performance as V's girlfriend (?). Must watch!!!",
      "review_date": "2011-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Remember The 5th Of NovemberThis Film Pretty Much Is A Masterpiece From Beginning To End.",
      "review_date": "2018-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This blast of subversive pop cinema is a thrill ride from beginning to end, and probably stands as the best film adaptation of all Alan Moore's work. However, the production is both propelled and impaired by the Wachowski Brothers' influenceThis blast of subversive pop cinema is a thrill ride from beginning to end, and probably stands as the best film adaptation of all Alan Moore's work. However, the production is both propelled and impaired by the Wachowski Brothers' influence - the stylized violence is bound to be campy in a few years' time and the dramatic storyline is carried too much by actors with the same serious deadpan British accent (hearing just audio, I doubt I'd be able to differentiate the voices.) Still, in the end, the movie gives us exactly what we want - controversy, an awesome antihero, and a huge, giant explosion.",
      "review_date": "2010-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Superb acting, really awesome lines, great action, and an effective political message. what more can you ask for?? This was really well done and there were scenes when i was like \"yes!\"",
      "review_date": "2010-11-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "V for Vendetta I would describe as 'The best F*** the government' film. It was not another fantasy-super hero movie with super predictable storyline - saving everybody, while a great love flares and of course - happy ending. Decent movie.",
      "review_date": "2018-06-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this film is really underrated. the best comic book movie of 2006 and one of the best film in 2006",
      "review_date": "2020-12-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought this film was fantastic.I think that the way Hugo Weaving portrayed V without ever showing his face was a great testament to his ability as actor and Natalie Portman was great as well.The tone and setting is great as well and as aI thought this film was fantastic.I think that the way Hugo Weaving portrayed V without ever showing his face was a great testament to his ability as actor and Natalie Portman was great as well.The tone and setting is great as well and as a fan of dystopian film and literature, this film hooked me straight away.",
      "review_date": "2010-11-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An all-around dreadful film. Terrible dialogue, subpar acting, wrapped in a story filled with absurd, juvenile politics with obvious and obligatory nods to the present-day \"War on Terror\" for easily amused critics to fawn over. Provoked noAn all-around dreadful film. Terrible dialogue, subpar acting, wrapped in a story filled with absurd, juvenile politics with obvious and obligatory nods to the present-day \"War on Terror\" for easily amused critics to fawn over. Provoked no emotional or visceral reaction from me, other than laughter at its banality, and when it ended, astonishment at how such garbage could be so widely praised. If you're out of high school, and like good films, pass on this.",
      "review_date": "2008-10-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A waste of time. Tries too many directions at once: arthouse, action entertainment, and moral message. Without any clear direction it failed to make sense or even entertain. I can give up the money for a rental, but I felt robbed of my time.",
      "review_date": "2008-04-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "V for Very Very Bad Film - As a fan of the comic, my opinion might be considered biased, but the FIVE people I took with me to the cinema had never heard of Alan Moore or V for Vendetta and we all roundly thought that this film was utterly V for Very Very Bad Film - As a fan of the comic, my opinion might be considered biased, but the FIVE people I took with me to the cinema had never heard of Alan Moore or V for Vendetta and we all roundly thought that this film was utterly rubbish. Don't be fooled by the trailer, there isn't enough action to provide half-decent entertainment. Instead the Wachowski Boys are trying their damnedest to be intelligent and they just make everybody sound stupid. There is a fine line between poking fun at the British and being completely patronizing. Maybe that can explain the good reviews of this film over on that side of the Atlantic, but I can't explain the good reviews of it that we've had over here. There is nothing to recommend this film apart from a mildly amusing Benny Hill type sketch in the middle. Utterly cringeworthy. I was embarrassed that I had recommended going to see it.",
      "review_date": "2006-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This has to be one of the best movies I\"ve seen this year [so far]. It's great when an action movie, well, doesn't use action to move the story. Hugo Weaving once again amazes me at his ability to act any part, and he made V a very This has to be one of the best movies I\"ve seen this year [so far]. It's great when an action movie, well, doesn't use action to move the story. Hugo Weaving once again amazes me at his ability to act any part, and he made V a very likeable character. Natalie Portman was pretty good, I guess. But as I mentioned earlier about an action movie that doesn't use action to move the plot, V for Vendetta ending action was executed perfectly. It also showed that V isn't perfect. I always love when a movie gives me the shivers. And that makes a great movie.",
      "review_date": "2006-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very dissapointed, most of the Anti-Bush down with America crowd will resonate with it and give it high marks, I personally thought it was rubbish, I was nodding off. One or two CGI scenes that were done well, the rest was just pretty poor. Very dissapointed, most of the Anti-Bush down with America crowd will resonate with it and give it high marks, I personally thought it was rubbish, I was nodding off. One or two CGI scenes that were done well, the rest was just pretty poor. Too bad, I was hoping it would be much better.",
      "review_date": "2006-03-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought the movie was a little bland. It had an interesting story and some cool ideas, but I thought the execution was off. Still worth seeing though.",
      "review_date": "2006-08-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Blimey, there's some scathing comments there. I really enjoyed this film, maybe more so because I treated it as a work of fiction and didn't draw comparisons between it and the real world. A good storyline, decent enough acting,Blimey, there's some scathing comments there. I really enjoyed this film, maybe more so because I treated it as a work of fiction and didn't draw comparisons between it and the real world. A good storyline, decent enough acting, some fine visuals and some good plot twists made good viewing.",
      "review_date": "2009-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not bad, not good. I appreciate that the filmmakers tried to tackle some social/political points, but they focus on ideas that have been studied for many years. The plot, action and subtext are derivative of other films and books. V is an Not bad, not good. I appreciate that the filmmakers tried to tackle some social/political points, but they focus on ideas that have been studied for many years. The plot, action and subtext are derivative of other films and books. V is an interesting character, though I don't know why he has to carve his initials like some others I've seen before...maybe we should call him Voro. Also, sort of boring for an action movie. Nice try though.",
      "review_date": "2006-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Decent movie, but it's slow pace will mean many might not like it!",
      "review_date": "2006-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best film since Forty Year Old Virgin.",
      "review_date": "2006-03-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Politics really shouldn't even come into the equation. This is about rating a film. Was it well made? And the measure of that is whether people are entertained. Obviously, many people were, and a few were not. I enjoyed certain parts of Politics really shouldn't even come into the equation. This is about rating a film. Was it well made? And the measure of that is whether people are entertained. Obviously, many people were, and a few were not. I enjoyed certain parts of the film, excited to see the characters and events from one of my favorite books. I try to distance myself from the source material when I see an adaptation, but I couldn't help thinking all the way through the film that it would've been so much better if they'd left a lot of things as they were. I agree that this was billed too much as an action film, and its really not. And that's not a bad thing. But to me, knowing the original text, I was dissapointed in the actual content and dialogue of the film. The \"message\" is not delivered in anywhere near as intelligent a fashion as done by Alan Moore. Few can match his talent. I tried to view the film as a piece by itself, but while it wasn't neccesarily a bad film, it just didn't do it for me. The only acting that really bothered me was John Hurt, chewing the misc en scenery. For the record, this is the director's first film. Someone on here called it his worst film yet. How can that be if its the first one he's made? I also agree with the comment that some scenes were \"Matrixy.\" If you were at all moved by this film, I urge you to go read the original graphic novel, and see how much more intense and meaningfull it is. All that being said, and while I hesitate to bring up the political aspect, it must be addressed. I felt it was a little too obvious that they were trying to make references to our current political atmosphere. And that cheapens the original story. I know very little about Margaret Thatcher, but I don't believe that Alan Moore shoved any references down people's throats. This movie also might've been much better if it had been made pre-9/11, or much further in the future. Nothing that comes out these days can speak about the government or terrorists without being labeled as a statement on politics. Lastly, why are there so many comments from the editor being stuck into our own reviews? They seem to be conveying the editor's own opinion of our reviews, when this is supposed to be our way of openly expressing our opinion. Just edit. Don't give us your opinion on our thoughts. Thank you. [Ed: Well said.]",
      "review_date": "2006-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Boring, long, and yet again proof that the Wachowski's are terrible writters who somehow fluked into the first Matrix movie. If you like little to no action, and dialog that is all exposition then this... still would be a bad movie.",
      "review_date": "2006-03-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I totally enjoyed this movie. Also frightened me as it should frighten everyone. I see evidence every day of our society moving closer and closer to this very situation. Too real. I think this movie accomplished what it set out to do.",
      "review_date": "2006-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I give it credit for expressing its own art. Nonetheless it remains a political thriller without all that stressful intrigue and zing.",
      "review_date": "2006-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The film won",
      "review_date": "2009-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An enjoyable popcorn movie with a very weak, sad, and ultimately unfulfilling story. This is a movie that cant be deemed important or deeper than it claims to be unless you are 15 or younger. Some good acting from Portman and a very suttle An enjoyable popcorn movie with a very weak, sad, and ultimately unfulfilling story. This is a movie that cant be deemed important or deeper than it claims to be unless you are 15 or younger. Some good acting from Portman and a very suttle Stphen Rea. John Hurt is over the top creepy. Weaving is dashing although you never get to see him, but I couldnt help feeling that this movie was trying to make a statement. I ssues about the Koran and repression of gays, etc.. But how do they answer these problems? By blowing up buildings and killing people! Not only that but once the biuldings are blown up and people are killed(many through out the film) where do they go from there? A question this movie fails to answer and chooses to ignore. I couldnt help thinking how Osama bin Laden would love this movie's dim message and how Ghandi and Martin Luther King Jr. would be rolling in their graves. Go see it if you want to have to be entertained for a think free price, but if you are looking for a moral lesson on violence while be engaged visually, check out Munich or A History of Violence.",
      "review_date": "2006-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just got back from V for Vendetta. Bad bad acting (Portman's pretentious accent sucked) or the boring buildup; the really dull action scenes or the one sided cliched dialogue. And it ran for like three hours. Not to mention HUGE plot Just got back from V for Vendetta. Bad bad acting (Portman's pretentious accent sucked) or the boring buildup; the really dull action scenes or the one sided cliched dialogue. And it ran for like three hours. Not to mention HUGE plot holes. At the end of it all I was completely disoriented. What's with the Tchaikovsky music, or the TV infatuation? Or the overuse of 'bollocks' ? If there was *any* pseudo philosophical symbolism hidden in the movie someplace, they did not make an effort to get the message out.",
      "review_date": "2006-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The worst thing about this film is that it makes the ideals of Anarchism and the Libertarian-Left sound completely stupid.",
      "review_date": "2006-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Argh! Forget the politics! This simply isn't a very good film!",
      "review_date": "2006-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I feel this movie skimmed the surface of several American political issues without explanation or justification of any of them. I perceived blame being assigned to the US for terrorism and tyranny. Had this movie's political agenda been I feel this movie skimmed the surface of several American political issues without explanation or justification of any of them. I perceived blame being assigned to the US for terrorism and tyranny. Had this movie's political agenda been properly billed I would have never given my money for such psycho babble politics. One of the \"good guys\" had a nazi flag with the Koran in his secret room. This movie was pure garbage!",
      "review_date": "2006-03-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Makes christians look like crazy right wing fundlementalists. Christians have been repressed to. Sure they don't agree with some of the things in this world but they're not as narrow minded as portrayed.",
      "review_date": "2006-03-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Entertaining? Yes. Smart? No. I was hoping that this movie would mix the two, but alas, it didn't. I'm glad I saw it, because it was a feast for the eyes. But not for the brain. It's thoughts are actually quite shallow, though Entertaining? Yes. Smart? No. I was hoping that this movie would mix the two, but alas, it didn't. I'm glad I saw it, because it was a feast for the eyes. But not for the brain. It's thoughts are actually quite shallow, though at times exciting. If you want to see it, watch it in the theatre, but I wouldn't waste the time renting it unless you have a really sweet sound system and TV.",
      "review_date": "2006-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm dumber for having seen this movie. Incoherent, lacking in style, over-wrought pretentious dialogue. Like a pissed off teenager who can't get laid wrote it. Geez.",
      "review_date": "2006-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Look. Alan Moore had his name taken off the credits for a reason. The original comic is a magnificent piece of subversive, political and social commentary; this film is cynical action fodder, pandering to the feeble idea that we the public Look. Alan Moore had his name taken off the credits for a reason. The original comic is a magnificent piece of subversive, political and social commentary; this film is cynical action fodder, pandering to the feeble idea that we the public are all 'good people' who rise up when oppressed by the forces of evil. Give me a break. Moore tackled issues of complicity and how fascism can be taken as a viable system of government. He created a piece of work that demmands introspection from its audience. This film removes any value from its original source and replaces it with another empty piece of 'entertainment', peddling the usual nonsense that 'good people' (us) only let bad, destructive people into power when they have been tricked. This film is a cop out on every level.",
      "review_date": "2006-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "a quixotic piece of orwellian gargage. watching this movie is like eating bananas without peeling them.",
      "review_date": "2006-06-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a simple movie for children, posing as \"art\". It takes more than a 130 minute running time to make a movie compelling. You'd have thought that after the dreadful Matrix sequels, the Wachowski brothers would have realised that.",
      "review_date": "2006-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Decent acting. Sophomoric attempt at political philosophy. Actually, just plain stupid when all said and done.",
      "review_date": "2006-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was expecting a lot better, maybe. It turned out to be a liberal, leftist propaganda vehicle first, story second. The only good press it got was from mainly liberal publications. Go figure. Beyond my disagreement with the beliefs I was expecting a lot better, maybe. It turned out to be a liberal, leftist propaganda vehicle first, story second. The only good press it got was from mainly liberal publications. Go figure. Beyond my disagreement with the beliefs expressed, this could've been made so much better, as the concept could've been riveting. Instead it was boring as all hell and preachy to boot.",
      "review_date": "2007-07-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A completely farcical take on Orwell's 1984 with one of the worst 'acting performances' by Natalie Portman to date. Superficiality of characters, plot and politics and not even in a entertaining way. Special mention must go to A completely farcical take on Orwell's 1984 with one of the worst 'acting performances' by Natalie Portman to date. Superficiality of characters, plot and politics and not even in a entertaining way. Special mention must go to the cringe worthy script with a fetish for sophomore-level alliteration starting with the letter 'v'. In short, the perfect film for a general acclaim and fit to shelve next to other recent entries in the IMDb top250 such as Million Dollar Baby, Children of Men and Labirinto del Fauno which most dreadfully shows the abysmal decline in good taste and cinematic appreciation which is sweeping the Earth like a virus.",
      "review_date": "2008-02-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Horrible movie. One of the worst from McTrigue yet!!",
      "review_date": "2006-03-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Boring. Unengaging. While watching the film, I found I couldn't care less about the characters -- no pathos. Don't waste your time.",
      "review_date": "2006-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "movie was awful. If you have people you cant stand, suggest this movie to them. The only part i enjoyed were the end credits!",
      "review_date": "2006-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Rolling Stone hypes up the film and poor me, I see the damned thing. This film is The Political Matrix. There's an attempt at making it seem like this will happen to the world in the next couple of years and that we will have to blow up Rolling Stone hypes up the film and poor me, I see the damned thing. This film is The Political Matrix. There's an attempt at making it seem like this will happen to the world in the next couple of years and that we will have to blow up government to make it better. Natalie Portman even has a Keanu Reeves moment in the train, when she just stares. Guns are better, and so was the Matrix. F... this movie.",
      "review_date": "2006-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Turd on a stick. If you're interested in the drama side of this story, read 1984. If you're interested in the action side, rent Demolition Man.",
      "review_date": "2006-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The whole point about fascism is that it's driven by nihilism. I don't like George Bush either, but maybe if the Wachowski brothers understood this, they wouldn't have spent quite so much time fetishizing Nazi aesthetics and The whole point about fascism is that it's driven by nihilism. I don't like George Bush either, but maybe if the Wachowski brothers understood this, they wouldn't have spent quite so much time fetishizing Nazi aesthetics and celebrating senseless violence for its own sake.",
      "review_date": "2006-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was just bored out of my mind by this movie. And did anyone else think the finale was reminiscent of the end of \"Caddyshack\", when Carl blows up the golf course? It was funny! I don't think that's what the director was going for.",
      "review_date": "2006-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Visually seductive, this movie is about sending you the \"other\" message. Very 70's ish to me. Funny how Rolling Stone, Portland, and San Francisco newspapers all rate this so high...this is a movie for WTO rioters. The movie is not bad, Visually seductive, this movie is about sending you the \"other\" message. Very 70's ish to me. Funny how Rolling Stone, Portland, and San Francisco newspapers all rate this so high...this is a movie for WTO rioters. The movie is not bad, but it lacks examination of why those in power fear those they enslave. And why those who live and let live fail to maintain organized and safe societies. Why do people want tyrants, they obviously provide something and then degrade into something else. Hippies had their day and it didn't work. Life is a balance like the left and right hemispheres of the brain. People need to stop fighting other people as much as they need to start discipling themselves. This movie throws out a grand statement and then fails to get to the root of the truth...it blames others. Yawn. Still if you are smart enough to take a spoonful of what is said and displayed and realize this is just a graphic novel that requires large egos and bizarre material to keep you entertained then you can enjoy some of it. To me this is kind of a weak Stanley Kubrick movie that tries to sell a bit of nonsense as truth.",
      "review_date": "2006-03-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Marxists and anarchists will love this movie. The basic theme? Christians are fascists who seek to round up all the gays and Muslims, USA and UK \"Coalition of the willing\" are nazis who kill their own people with bio weapons to create a Marxists and anarchists will love this movie. The basic theme? Christians are fascists who seek to round up all the gays and Muslims, USA and UK \"Coalition of the willing\" are nazis who kill their own people with bio weapons to create a police state. The looney left's beliefs brought to the big screen at last!",
      "review_date": "2006-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I cant believe there are people that actually admire this movie. Its the same people that probably never took a political science class or read a book about history of politics. It over simplifies a totalitarian regime and makes a terrorist I cant believe there are people that actually admire this movie. Its the same people that probably never took a political science class or read a book about history of politics. It over simplifies a totalitarian regime and makes a terrorist look like a hero. If you can make money with such crap..says a lot about the majority of people.",
      "review_date": "2006-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I didnt know what to expect with this film, i did not however expect to see a terrible film...which is exactly what i got. boring. pure boredom is what i got out of this movie.",
      "review_date": "2006-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "WARNING: This movie is a diabolically conceived slew of hate propoganda, don't be fooled. Does terrorism seem cool to you? Yet, we see the ultra left, the so called champions of peace, poison the minds of young americans (who is the WARNING: This movie is a diabolically conceived slew of hate propoganda, don't be fooled. Does terrorism seem cool to you? Yet, we see the ultra left, the so called champions of peace, poison the minds of young americans (who is the target audience) with this tripe, glorifying evil.",
      "review_date": "2006-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Governments should be afraid of their people\"? Hmmm. Yeah, maybe in Saudi Arabia, North Korea, Cuba, etc. But in the US & the UK, the government IS the people. You don't like the government? vote them out. No need to blow up the \"Governments should be afraid of their people\"? Hmmm. Yeah, maybe in Saudi Arabia, North Korea, Cuba, etc. But in the US & the UK, the government IS the people. You don't like the government? vote them out. No need to blow up the Capitol Building or Parliament. Just go freakin' vote, you idots!! This movie should have been set in Saudi Arabia or a country that truly puts down its people. But the UK and the US??? What next, update \"Mommie Dearest\" with Mother Teresa in the lead role?? It didn't make logical sense to me.",
      "review_date": "2006-03-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Horrible, horrible movie. Everything in it seemed to be so poorly executed it was quite embarrassing and cringe worthy to witness. It wasn't even engaging enough to be a brainless entertainment flick, just boring pacing, plot, direction Horrible, horrible movie. Everything in it seemed to be so poorly executed it was quite embarrassing and cringe worthy to witness. It wasn't even engaging enough to be a brainless entertainment flick, just boring pacing, plot, direction and acting. The good responses this film has gotten astounds and confuses me.",
      "review_date": "2006-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was very disappointed. They try to make it seem relevent to world events today, and that's its downfall. It does it so badly.",
      "review_date": "2006-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Im not saying Hugo Weaving didn't do a good V or that Natalie Portman cant act all those features were what might this movie okay instead of lying in a gutter what i'm concerned about is the story. what were they thinking what kind Im not saying Hugo Weaving didn't do a good V or that Natalie Portman cant act all those features were what might this movie okay instead of lying in a gutter what i'm concerned about is the story. what were they thinking what kind of government what do that besides comunists and who does V think he is blowing up random monuments to show he means business I'm sorry but it's a load of worthless action... NOTE: do not see this movie unless you enjoy raw action then go ahead.",
      "review_date": "2006-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Repetitive, slow, incoherent...I wanted go to sleep or better read a book.",
      "review_date": "2006-03-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"V\" is unsatisfying as an action flick and laughably facile as a \"thought-provoker\". All the cleverness here is placed in the margins -- the details of V's art collection, the mentioned-in-passing political backstory -- leaving the \"V\" is unsatisfying as an action flick and laughably facile as a \"thought-provoker\". All the cleverness here is placed in the margins -- the details of V's art collection, the mentioned-in-passing political backstory -- leaving the central plot to flounder with \"philosophical\" dialog between V and Portman's Evey that seems like a rehash of every late-night dorm-room bull session you've ever had. The intended \"controversy\" over the fact that V is a \"justified terrorist\" who blows things up to make a point is lost as V's escapades are somehow bloodless towards civilians while the authorities manage to kill dozens of innocents trying to stop him. Portman seems lost here while Weaving is wasted behind the mask; Stephen Rea's standout performance is nearly ruined by the weirdly-anticlimactic ending.",
      "review_date": "2006-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a disappointment! Part rambling, babbling political rally drivel, mixed with Natalie Portman dealing with the affections of older men (yuck). Earth to Wachowski brothers!: if you're going to have a man with a British accent, What a disappointment! Part rambling, babbling political rally drivel, mixed with Natalie Portman dealing with the affections of older men (yuck). Earth to Wachowski brothers!: if you're going to have a man with a British accent, wearing a mask, give numerous monologues, please tone down the background music so we might be able to make it all out.",
      "review_date": "2006-04-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Somewhat better than run-of-the-mill comic book action, somewhat worse than Sin City and even X-Men, this is a pastiche of explicitly borrowed elements -- as though some writer thought it would be real cool to insert The Crow into Somewhat better than run-of-the-mill comic book action, somewhat worse than Sin City and even X-Men, this is a pastiche of explicitly borrowed elements -- as though some writer thought it would be real cool to insert The Crow into Orwell's 1984, with a sprinkle of post-modernity -- no wonder the Wachowskis drooled over it. Unoriginal and shallow but mildly pretentioous, with great camera work and editing, just like the Matrix. Whomever this \"resonates\" with, they're sorely simplistic.",
      "review_date": "2006-05-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie started out badly and it ended even worse!! An intresting idea, but badly excuted.",
      "review_date": "2006-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hard to imagine why all of the good grades here for V. Must be an age gap, because I cant think of any reason why anyone over 21 would like this movie. At least Natalie Portman is in it, but then they cut her hair and ruin that too. Very Hard to imagine why all of the good grades here for V. Must be an age gap, because I cant think of any reason why anyone over 21 would like this movie. At least Natalie Portman is in it, but then they cut her hair and ruin that too. Very shallow, undeveloped plot that takes to long to go nowhere.",
      "review_date": "2006-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Catholic fascists take over England, put up big black and red crosses, repress gays, execute people for possessing the Koran, and rule by fear. Only a masked wierdo can save them. He does this by--well, that would ruin it. Suffice it to say, Catholic fascists take over England, put up big black and red crosses, repress gays, execute people for possessing the Koran, and rule by fear. Only a masked wierdo can save them. He does this by--well, that would ruin it. Suffice it to say, the ending is absurd. Written by the Wachowski brothers and produced by Joel Silver.",
      "review_date": "2006-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Over the top trash unbelievable trash. Revolution? I'd like to see what happens next... It's tried to be too clever. Theres nothing to tell us why the government has seemingly gone crazy and decided to shout at everyone... Over the top trash unbelievable trash. Revolution? I'd like to see what happens next... It's tried to be too clever. Theres nothing to tell us why the government has seemingly gone crazy and decided to shout at everyone... ;Portman's performance is awful, not sure anyone who has reviewed this is English but to me its pretty blatant from the start her voice is dodgy . Silly action sequences where V can withstand 5 billion bullets. Doesn't make you think. Sound is bland. Anything else? Oh yes, its all very well blowing buildings up but it really won't sort anything out. I can see that humankind is supposed to be united under tragedies like oppression but this just wouldn't happen. Not even in a world where people where gimpy masks. There is a reason for law! Anarchy in the UK? No thanks. It's more of a personal thing to express oneself in a rebellious and sometimes stupid way but this film captures what the UK would be like if everyone had taken crack and then decided to terrorize parliament. Ridiculous! Probably the worst film I have seen since Revolver! 1 star because the DVD didn't break.",
      "review_date": "2007-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Scarcely a single redeeming quality. Managed to see that other piece-of-shit juvenile myopic lefty vision of a future fascist dystopia Britain Children of Men for I saw this (for the record, I'm left-wing too), but this one, although tooScarcely a single redeeming quality. Managed to see that other piece-of-shit juvenile myopic lefty vision of a future fascist dystopia Britain Children of Men for I saw this (for the record, I'm left-wing too), but this one, although too calamitously silly to be as bland as the aforementioned film, takes biscuit in the laughable stakes. Jurn Hurt LITERALLY has the same expression on his face every time we see him (while he's alive). Portman spends the film sitting in people's living rooms and being tortured and generally struggling to conjure up an convincing facial expression (why is this woman allowed to work in film?), Weaving talks in awkward, pretentious riddles, and stabs people.\r It didn't seem possible that the Wachowski Bros could something more cringemakingly awful than the Matrix Revolutions, but it appears they have truely outdone themselves.",
      "review_date": "2007-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was really looking forward to seeing this movie but when I saw it, I found it lacking in my expectations. It was hyped as an action movie, but focused more on the dectective story element. Several decent stories were lumped together and I was really looking forward to seeing this movie but when I saw it, I found it lacking in my expectations. It was hyped as an action movie, but focused more on the dectective story element. Several decent stories were lumped together and the ending seemed rushed and rather anticlimatic. The jury's still out for me, but I felt sorely disappointed when I came out of the theater, thanks to false advertisment.",
      "review_date": "2006-03-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "V is for very tedious and tiresome. Totally derivative crap.",
      "review_date": "2006-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have to agree with the user who stated that the best part of the film is the ending credits. Seriously, \"Street Fighting Man\" by the Stones and the artwork accompanying it were brilliant.  But seriously, people, admit that you had toI have to agree with the user who stated that the best part of the film is the ending credits. Seriously, \"Street Fighting Man\" by the Stones and the artwork accompanying it were brilliant.  But seriously, people, admit that you had to struggle a little to like this movie.  It has MAJOR pacing problems.  At least 7 or 8 times I looked at my friend and said, \"Damn!  They're got to keep this thing moving!\"  And I loved the subtle propaganda of such items as the poster that read \"Coalition of the Willing\" - which featured the American Flag & British Union Jack superimposed with the Swastika.  Yeah, attemped to remove a dictator and free 30 million people to create democracy, and you're compared to a regime that exterminated 5 million jews in concentration camps.  That's reality.  Folks, if the US and the UK are the biggest enemies in the world, the rest of the globe must be a utopia.",
      "review_date": "2006-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I cannot believe the good reviews this movie has gotten. It ignores the interesting characters (the bad guys) and never tells us how in the world V does everything he does. That would have been more interesting. Poor Natalie Portman, either I cannot believe the good reviews this movie has gotten. It ignores the interesting characters (the bad guys) and never tells us how in the world V does everything he does. That would have been more interesting. Poor Natalie Portman, either looking scared or lost. Stating the obvious in line after line. We spend much time on back stories of people we do not care about - their fate is sealed.",
      "review_date": "2006-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is pedantic and takes itself way too seriously and the effect was to make it unintentionally humorous. The writers thought the audience would be too stupid to see the self-inherent evils of a fascist regime, so they needed to This film is pedantic and takes itself way too seriously and the effect was to make it unintentionally humorous. The writers thought the audience would be too stupid to see the self-inherent evils of a fascist regime, so they needed to manipulate us by portraying them as ugly, shifty-eyed rapists. It would have been more thought provoking and real had they been portrayed as charasmatic or, better yet, like your co-worker or next door neighbor, the average Joe. What a cliche that the antagonists were motivated, really, by power and not their ideology. True Belivers are always the most freightening. The writing was hackneyed and overly Verbose in an apparent attempt to give the film some sort of legitimacy through seeming literary. Thick melodrama made it impossible to empathize with the characters or care what happened to them. Five minutes into the film I had a vision of the writers hunched over the 'V' section of Webster's frantically trying to shoehorn every word into a coherent sentence. What exactly is the film's message supposed to be? Buildings can be blown up without killing innocents but instead be capped with an uplifting fireworks finale? Replacing the devastation caused by blowing up a building with a tame 4th of July display is a bone chilling piece of apologist propaganda. Anyone who thinks this film blurs the line between terrorists and 'freedom fighters' is a few cards short of a full deck. The fact that the writers needed to portray England as some sort of cartoonish neo-Nazi dictatorship to gride their political ax proves the lameness of their position. However, Natalie Portman does a nice job despite the poor script. Stephen Rea was the highlight of the film.",
      "review_date": "2006-03-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I do not want to sound over the top and completely slag this film off but it is officially the third time I walked out of a film because it got embarassing to watch (the last was AI). I thought it would be interesting because I quite enjoyed I do not want to sound over the top and completely slag this film off but it is officially the third time I walked out of a film because it got embarassing to watch (the last was AI). I thought it would be interesting because I quite enjoyed books such as '1984', 'Clockwork Orange' and 'Brave New World', all set in dystopian sociaties, but thought this was a really dumb effort, and it's almost laughable that people can even respond to the message that the film conveys when it is done by such silly means. Perhaps then I can enjoy the action, acting, settings etc instead. Well no actually. The action scenes were just as ridiculous as 'The Matrix' which is partly why I cannot take it seriously. And the acting was some of the worst I have ever seen. I appreciate when people hate a film and write a review they tend to say the acting is bad even if it isn't because they're in rant mode. But here it really is. English people really don't talk like that - i.e. they don't all sound like snobs. The way English accents are done in Hollywood films can be terrible. It was just all very unconvincing and cringeworthy at parts. So not only is the message ruined by how unrealistic it all is, it is difficult to enjoy the story when you are constantly reminded that the characters are all just actors trying to put on a silly accent. Seriously, the British accents here are almost suitable for a comedy. To mention a few postives. There were the odd funny moments - it was not taking itself to seriously thank god. Some of the visuals were also quite impressive. And, in fairness, maybe the actors were not actually that bad and it was just the rubbish dialogue that made them seem like they were. It is a dumb film that wants to be clever but not everyone is like me and enjoys dumb clever films anyway.",
      "review_date": "2006-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Entirely self-contraticting, whoever came up with this movie and wrote the script simply wanted to make themselves seem smart by stealing real ideas from people like Orwell, but they werent smart enough to know what to do with those ideas, soEntirely self-contraticting, whoever came up with this movie and wrote the script simply wanted to make themselves seem smart by stealing real ideas from people like Orwell, but they werent smart enough to know what to do with those ideas, so they just used a bunch of verbage to make it sound like they knew what they were talking about. It was hard for me to sit through this movie without tearing its \"ideas\" apart, and the write snuck in a couple social commentaries that had nothing to do with anything. If you think this is thought-provoking and smart, read Orwell's 1984 to find out what those words really mean.",
      "review_date": "2006-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fantastic, extremely well written, and the performances by the cast are outstanding, truly a must see, it causes you to think, will stick with you long after watching it, and conveys a message, a message that should be taught, believed in,Fantastic, extremely well written, and the performances by the cast are outstanding, truly a must see, it causes you to think, will stick with you long after watching it, and conveys a message, a message that should be taught, believed in, and acted upon, and that message is \"People shouldn't fear the Government, the Government should fear the people\".",
      "review_date": "2012-04-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The politicians should fear of their 'subjects' - and not the other way around. Next step: Agorism?",
      "review_date": "2020-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "V for Vendetta is one of my favorite films of all time.  I believe it is the best DC Comics movie.",
      "review_date": "2020-06-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I gave 9 because movie kind of boring but the subject makes lots of sense. Great movie!",
      "review_date": "2020-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "First-time director James McTeigue’s big, bold imagery, with slashing reds and",
      "review_date": "2021-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow, just wow. This piece of firery entetainment did the impossible and gave a rousing action story, deep and meaningful characters and a point to their message, all in two hours. This movie grabs it's story with both hands, and never Wow, just wow. This piece of firery entetainment did the impossible and gave a rousing action story, deep and meaningful characters and a point to their message, all in two hours. This movie grabs it's story with both hands, and never lets back. Although the performances are not outstanding, the directors have created a well following plot that gives justice to the original, yet still packs a punch. V for Vendetta is relevant today as it has always been, and V's monologues are humourous if not disconcerning. The detective work was also done to prefection, making the reach to the bottom of the truth so satisfying and entertaining. I ask the people moaning about this movie: What is there to complain about? This are ideas that PRECEDE 9/11 but still resonate today. If you went here seeking an action movie or a love scene, you are at the wrong place, instead you saw an inspired action piece with some political messages we should all hear. One tip: Watch and read the original first.",
      "review_date": "2006-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a great movie. Lots of symbology used in it. Though sadly a lot of the symbolism will go over most peoples heads. Lots of good references to todays world as well. Though be warned it doesn't take too kindly to religious This was a great movie. Lots of symbology used in it. Though sadly a lot of the symbolism will go over most peoples heads. Lots of good references to todays world as well. Though be warned it doesn't take too kindly to religious extremes, especially Christian.",
      "review_date": "2006-04-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really liked this movie--despite myself. I expected a dumbed down comic book adaptation (I'm so sick of comic book adaptations--is this the best Hollywood can come up with?) and was treated to a surprisingly thought-provoking and I really liked this movie--despite myself. I expected a dumbed down comic book adaptation (I'm so sick of comic book adaptations--is this the best Hollywood can come up with?) and was treated to a surprisingly thought-provoking and amazingy topical politcal tale. Great perfromances all around; Natalie Portman proves her multi-leveled \"Closer\" performance wasn't a fluke (and erases her cardboard \"Star Wars\" acting from memory once and for all). Critics may call the message of this film simplistic--but I'm thrilled to see a film aimed at a young demographic with any message at all besides \"wow, aren't these effects awesome?\". There's enough action to interest the MTV attention span generation, enough pyrotechnics to thrill the techno geeks, and most important, enough cautionary tale to resonate with those who actually have a brain in their head. A neat film with a wonderful mantra: People shouldn't fear their Government, the Government should fear the people.",
      "review_date": "2006-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Probably the greatest movie of the year thus far...even though not much has been released. A great film that goes a different route than what would be thought by the brothers who brought The Matrix Series. Good acting, good script. A fun and Probably the greatest movie of the year thus far...even though not much has been released. A great film that goes a different route than what would be thought by the brothers who brought The Matrix Series. Good acting, good script. A fun and intelligent hero movie which doesn't involve super powers. A must see!!!",
      "review_date": "2006-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I found it interesting and and although I am a lefty, I didn't actually agree with all the politics side. I felt the ideas were made with rather broad strokes. However policital fiction has always taken the situation to the extreme as a I found it interesting and and although I am a lefty, I didn't actually agree with all the politics side. I felt the ideas were made with rather broad strokes. However policital fiction has always taken the situation to the extreme as a method of analysing them - Animal Farm, 1984,Gulliver's travels, Swift's modest proposal for dealing with the Irish famine. I think maybe this should be a double billing with Ghandi just to balance things out a bit. Anyone who feels that TV had to much of a prevelance should watch/read Noam Chomsky's manufacturing consent, before deciding how much our lives are dictated by the media. It was billed too much as a thriller and I hate the fact they showed Big Ben blowing up in the trailer talk about giving the ending away!",
      "review_date": "2006-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great movie, for people who didn't read the novel, and amazing visuals for those who did. Gritty & good.",
      "review_date": "2006-04-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Truly brilliant. Great acting, a superb story and themes.",
      "review_date": "2006-04-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its the first of its kind. I gave it a 9 because i was moved by it. Not because i thought any of this could become a reality, but simply V himself and his enigmatic history, and the power and intellect he posseses. V is not a servant of the Its the first of its kind. I gave it a 9 because i was moved by it. Not because i thought any of this could become a reality, but simply V himself and his enigmatic history, and the power and intellect he posseses. V is not a servant of the people like other heroes, he is one driven by a vendetta hence creating a highly unique movie.",
      "review_date": "2006-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a good comic book film with good plot and, unusually for such films, an intelligible script. But why do people want serious political messages from such a genre? Some have compared it with 1984 and Brave New World. This is just sad. This was a good comic book film with good plot and, unusually for such films, an intelligible script. But why do people want serious political messages from such a genre? Some have compared it with 1984 and Brave New World. This is just sad. Obviously it could be better (so could everything) but there are some good touches: the use of a 16/17th century Catholic terrorist as a symbol of modern freedom was nicely ironic, whilst the vision of thousands of Guy Fawkes attending the destruction of the Houses of Parliament was very good indeed (I am English by the way).",
      "review_date": "2006-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An intriguing political thriller, with a touch of Matrix gloss. I miss the Matrix trilogy's action, but this movie has a greater focus on its moral and societal ideals, a focus so great that the whole movie just encapsulates you. MakesAn intriguing political thriller, with a touch of Matrix gloss. I miss the Matrix trilogy's action, but this movie has a greater focus on its moral and societal ideals, a focus so great that the whole movie just encapsulates you. Makes you think we REALLY need a hero like V, with a revolt to match.\r A few problems, though:\r1) V using torture to covert Portman? Feels a bit morally incoherent and pro-totalitarian, contradictory to the movie's goal. Offended me a little.\r2) Action a bit light in supply, probably due to a constrained $50 million dollar budget, where as the Matrix reloaded had $127 million at its disposal. They do the best with what they have, though. And it's unlikely that rich studio execs would heap $120+ million on a film that preaches politics that threaten to cut their wealth, anyway.",
      "review_date": "2006-08-06",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 138,
  "genres": [
    "Action",
    "Sci-Fi",
    "Thriller"
  ]
}