{
    "rating": 3.5,
    "release_date": "2014-02-18",
    "num_reviews": 69,
    "genres": [
        "Adventure",
        "Comedy",
        "Fantasy"
    ],
    "summary": null,
    "reviews": [
        {
            "review_title": "About what you expect from this sort of 'comedy'....in other words, hardly a laugh in the entire film.",
            "content": "There is only one reason I watched \"The Hungover Games\"....it just appeared on IMDB's infamous Bottom 100 List today. This is a list of the 100 lowest rated major release films....and I am a major glutton for punishment, as I've seen 95 of the 100 movies on the list.It's not at all surprising that \"The Hungover Games\" is on the Bottom 100. After all, MANY similar brainless spoofs are on the list, such as \"Disaster Movie\", \"Epic Movie\", \"Date Movie\" and \"The Starving Games\"--and they are more or less the same. This is NOT a compliment. Each tends to have a lot of very crude and juvenile humor and they are anything but subtle or intellectual...or entertaining. And, like these other films, the mashups simply make no sense...such as merging \"The Hangover\" with \"The Hunger Games\", \"Lord of the Rings\", \"Avatar\" and \"Snowpiercer\". The film abounds with sex toys, crude humor that falls flat and...well,...that's about it.The biggest problem with this film and other similar stupid parodies is that they are way too broad. First, they are very broadly written--with little subtlety and with an emphasis on crude instear of being funny. Second, they are too broad in their focus and would be MUCH better sticking with ONE film or one style of film instead of parodying EVERYTHING...which is often illogical and frequently mindless.So is this one any better than the rest of these Bottom 100 parodies? Well, there is a lot of gratuitous nudity. This isn't necessarily good....but at least it distracts from the 'humor'. In fact ANYTHING that tries to distract from the dopey jokes is a major plus. Heck, having Pauley Shore come out and juggle or read from the Yellow Pages would be a welcome distraction from the 'humor'! In fact, as I watched \"The Hungover Games\", I cannot recall laughing even once and it's no funnier than the other unfunny parodies on the Bottom 100. A worthless film in pretty much every way that was probably written by chipmunks...really, really DUMB chipmunks.",
            "review_date": "2019-11-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Hangover: Frat Bros Edition",
            "content": "This movie is dumb. Just look at the name. Yeah, I know it's not supposed to be smart but it is supposed to be funny, and unfortunately this is not. I will say that it is better than abominations like The Starving Games, Vampires Suck, Scary Movie 5 and Disaster Movie, but that's like saying dog p*ss is better than cat sh*t. They're both awful and both leave a bad taste in your mouth. This movie gets an extra point for potential. It's refreshing to see a spoof movie that isn't by the two that shall not be named, and some ideas in the movie do work. There's a plot this time: We follow the three Hangover guys (who bare a striking resemblance to their respective actors) on their Hunger Games adventure. I also like how the spoofs are limited to a certain character or group participating in \"The Hungover Games\", such as The Real House Wives, Ted, Thor, and a group of every Johnny Depp character of the past few years. Some of them are funny - I really wanted more of the Johnny Depps - but some just don't work. A team for gratuitous sex? I know it's making fun of the fact that a lot of movies have gratuitous sex for the sake of it but that's exactly what it's doing here, so it's like a spoof that's spoofing itself... and it's not nearly as deep as it sounds. I smiled a few times in this movie. The main cast was fine (the supporting cast had some horrendous actors though), and I like how the movie actually has a story and an attempt at coherency. But the number one thing I look for in a comedy are laughs, and The Hungover Games did not provide any. If you're smashed and with your friends and want to see a really dumb movie for some cheap laughs for an hour and a half then yeah you might enjoy The Hungover Games, but for anyone else, I implore you, don't watch this movie.",
            "review_date": "2015-05-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A non-funny parody movie",
            "content": "I can enjoy parody movies, even had a laugh or two at Movie 42 and Disaster Movie. This is not one of those. There is not even a 'slight chuckle'. Take a pass",
            "review_date": "2020-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tit-le",
            "content": "Very funny I know - almost as funny as the movie ... maybe a bit funnier. Kidding aside and boy you will have to search hard to find kidding here, the best thing about this, is the title. I watched the unrated version, so no idea what the other version looks like, but I got the whole package, all the swear words, all the nudity and whatnot.Now this is combining Hangover and the Hunger Games, but it has many other characters from other movies. Be it Carrie, Ted, every other character portrayed by Johnny Depp and so much more. Now if that alone leaves you chuckling ... well you will have fun with it. Whatever the case and a Jamie Kennedy that is annoying multiple times (as in more than one character portrayed), if you watch it, endure the end credits and get a bonus scene that will either infuriate you or make you laugh out loud. It depends on your ... humor I would like to say, rather than anything else ...",
            "review_date": "2020-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful just Awful",
            "content": "This will probably be the worst movie I have had the misfortune to watch but thankfully it only took me 30 minutes to gather my senses and switch it off.At no level was this funny or interesting and the actors must be biting their bottom lips by agreeing to take part in such an awful production.1/10 stars is generous and I find the high scores laughable and wondering if it might have been a better watch with my eyes closed.BIG miss if you can tempt your way to something remotely watchable.",
            "review_date": "2021-03-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Trash",
            "content": "30 minutes in and I couldn't take it anymore. Some people will enjoy this movie, because it's comedy. But in my opinion the comedy was terrible. But if you are somewhat bored give it a go, good luck...",
            "review_date": "2021-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not even when hungover would this be a great movie...",
            "content": "\"The Hungover Games\" is one of those type of spoofs that mean well and tries really hard, but ultimately fail to deliver. Now, I am not saying that the movie is bad, it just really wasn't as funny as it was supposed to be. I can honestly say that I didn't laugh a single time throughout the entire movie.For a movie of this type, then \"The Hungover Games\" takes on a variety of other movies, such as \"Ted\", \"The Hunger Games\" (obviously), \"Pirates of the Caribean\", \"Avatar\", \"The Hangover\", \"Charlie and the Chocolate Factory\", \"The Human Centipede\", \"The Lone Ranger\", and so forth. It is meant well, I am sure of it, but the comedy just slipped through every crack possible.The acting in the movie was adequate, and people were doing fair jobs with their given roles, they just didn't have too much of a script to work with.I used to love spoofs, such as \"Hot Shots\", \"Scary Movie\" and the like. Whether it is because I outgrew the genre, or because the spoof movies today are lacking what they did back in the 1990's, I do not know.\"The Hungover Games\" is good enough entertainment if you have absolutely nothing else to watch.",
            "review_date": "2014-03-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Hungover Games",
            "content": "Ok this Film was Not that Bad. It was pretty funny it had a good Cast. The 4 Young Men they used Played the Original Cast Pretty well. Not 💯 PERCENT but they did a pretty good Job.the Film was kind of Cool. I liked how they took a few Film's and mixed them all up. Added some really dorky characters. They just made the Film Fun to Watch. Hot Chicks, Muppets, Boobs, Crazy Men with Badly Dressed. It had me in Stitches I kind of liked the Film. It was worth the WATCH. I am a Film LOVER sometimes you just need a Goofy, Nutty, Film to Watch. That makes NO SENCE AND WHAT THE HELL AM I WATCHING LOL.",
            "review_date": "2021-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is a movie found from the garbage landfill.",
            "content": "This is movie that should have never been made to be released to the public because of how AWFUL it is.",
            "review_date": "2019-07-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why?",
            "content": "Why did they make this?\nWhy did I watch it?\nDon't be asking yourself these questions, do yourself a favour and give it a miss.",
            "review_date": "2020-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I've seen worse",
            "content": "Going into any parody movie you really shouldn't expect anything. With the bar set low, it's a little less bad.I laughed a handful of times but definitely lost interest before the movie ended. A few good gags but they're lost in an underwhelming parody. If you're really bored and out of things to watch I guess it might be okay? Wouldn't watch it again.",
            "review_date": "2021-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eh, not as bad as those awful Seltzerberg films, but still kinda lame",
            "content": "I saw this for free on IMDb's Freedrive and it was \"meh\". I did laugh at a few scenes, but that was it. While this film was still a letdown, I will say this; It wasn't insultingly unfunny like, say Epic Movie or Disaster Movie. There was a least some attempts at humor and they actually tried to make an actual parody film that wasn't full of irrelevant pop culture references that weren't funny (well, sorta), but compared to anything Setlzerberg has made, I give this an E for effort. It doesn't help that like Epic Movie, this film also features cameos from Willy Wonka (Johnny Depp version) and Captain Jack Sparrow and those were even still dated, back when Epic Movie was in theaters, back in early 2007. If want to watch this on Freedrive, I'd say go ahead, just don't expect anything like Airplane or Scary Movie.",
            "review_date": "2019-03-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I feel numb.",
            "content": "Like...reference humor isn't funny. At all.The movie was bland and doing Inception as a middle finger at the end was dumb.",
            "review_date": "2019-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Happy new year.",
            "content": "I hope this will be the worst thing I wasted twenty minutes on this year.\nI rated 4421movies og series. This is my 12' \"one star\".",
            "review_date": "2021-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Much better than its rating would suggest.",
            "content": "I've been watching movies of all genres since the 1940's. So what is so wrong with this movie that it warrants such a low rating and so many negative comments? In my humble opinion absolutely nothing's 'wrong' with it, in fact I thoroughly enjoyed viewing it. The plot doesn't offend (it is what it has to be as a parody - KISS simple), the scriptwriting is excellent, the camera work/lighting is professionally done and the actors all do their part well. There was a synergism between the principal actors and they worked together really well. I can understand that the movie will not be to everyone's taste: the humor certainly is a little raspy-raw toilet humor at times but that certainly did not define the humorous content of the movie as a whole and there's an unashamed borrowing of ideas and more from other movies: but it works and works amazingly well! After reading other reviewers comments I didn't expect much from this movie but kept an open mind and I'm glad I did otherwise I'd have missed out on a very enjoyable movie experience.If I had to pick the most notable actor in this movie it would have to be the guy with the beard for his extraordinary portrayal of 'the other' guy with the beard in 'the other' movie. I also have to admit that I'm a fan of the beautifully sexy Rita Volk and she didn't disappoint. In summary then, nicely controlled tongue in cheek performances from the entire cast make for a very good laugh out loud piece of film entertainment. I rate it 6.5.",
            "review_date": "2014-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Eh",
            "content": "Not a strong parody movie. Some of the jokes are just awful and it's a little sad to see some name/recognisable actors in this.Zach (Alan) was reasonably funny and I saw flashes of Ed (Stu) and Bradley (Phil) but there was barely enough in here to elicit a chuckle.Bonus points for Katnip's breasts.",
            "review_date": "2020-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "10/10 for effort but 0/10 for overall result",
            "content": "I'm sat here writing this review and trying to work out which is the better spoof movie - \"The Starving Games\" or \"The Hungover Games\". It's a difficult choice. It's kind of like offering me the choice of taking a bullet to the brain or a bullet to the heart. Neither film will ever be classed as a cinematic masterpiece.I do get the feeling though that the makers of \"The Hungover Games\" are actually trying. They've tried to write a good script, they've tried to give it decent production values and even the actors seem to be trying. It's a little more than can be said of the stuff that Freidberg & Seltzer keep pumping out. It's perhaps a little disappointing then that none of the jokes in the film really seem to deliver and it all seems to land off-target. I didn't laugh once.I was sober when I watched this. Maybe to enjoy it the most you do actually need to be hungover! That's the only time I'd probably find some of this movie actually funny. A-plus for effort but C-minus for execution. Not great.",
            "review_date": "2015-01-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie sucked",
            "content": "This was the worst spoof movie I have ever seen I would not watch it ever agian",
            "review_date": "2019-07-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "STOP WITH PARODY MOVIES",
            "content": "NOT EVEN 1 STAR WORTH AND ITS NOT FUNNY. SCENARIO IS GARBAGE, AND ACTORS DOENST LOOK LIKE THE HUNGER GAMES.",
            "review_date": "2020-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mediocre rip off",
            "content": "This spoof relies heavily on other movies and shows for plot and content, there is no originality in this movie and while the acting is funny at times most of it is a rip off of The Hangover and the Hunger games, so much so that it lacks its own identity and seems more like a rip off and a waste of time than a solid movie experience.I wouldn't call this movie much of an experience, it was difficult to enjoy the story and the jokes.",
            "review_date": "2020-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Entering The Hunger Games Would Be More Enjoyable",
            "content": "Spoof films are extremely hard to pull off. The key is to be subtle, yet not so much so otherwise the audience will not understand the joke. It is imperative though to not make the gags brash and obvious. This is where the alleged comedy 'The Hungover Games' fails.This parody stars lookalikes of The Hangover series and is supposed to be a follow on from 'The Hangover Part II'. The creators of The Hangover series had no part in this spoof and if they did, there would at the very least be something to laugh about. All you can find funny here is the incompetence of the Director and writers.In the film the Wolf Pack or the lookalikes of them get drunk again the night before Doug's wedding. Unfortunately for themselves they are entered into the Hungover Games and must fight to the death against other celebrities and film characters to survive.The only positive for 'The Hungover Games' is that in the opening text it informs us that this deathly tradition came about because of \"Hollywood's lack of creativity\". Now that I can agree with. Yet why mock the lack of creativity when the film you have possesses the same quality? It makes no logical sense but perhaps that is the point. As the film has no logic to call its own.The many negatives for 'The Hungover Games' can be collated into a list, thus outlined below. Pop culture references are only funny if done in a tasteful manner or with some notable skill. I know it's exceedingly odd to compare this film to a Disney one and yet Hercules knew how to handle pop culture references and still achieve the key for a comedy – laughs.Other jokes are either scatological, racist, homophobic, sexist or all of the above. 'The Hungover Games' never knows when to stop in terms of the excessive nature of the gags and its relatively short run time still manages to feel far too stretched for its own good.It's especially bothersome to watch when this comedy has less jokes than 2012's 'The Hunger Games'. I'm not sure how this was managed but its an impressive achievement none the less.Even the shots in the film are sickening to look at, filmed poorly and cheaply. People who took issue with the presence of shaky camera in the first Hunger Games film had better close their eyes promptly as well as covering their ears.I could go on and on about this films problems but I really do not wish to. In fact I would rather go and watch a comedy that makes me laugh to my heart's content. With every film I see, I feel that every single one deserves a chance. With Stolberg's 'The Hungover Games' I plead you to steer clear and not give it the benefit of the doubt. Film making this shallow does not deserve to be viewed by anyone of any age.",
            "review_date": "2015-10-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Couldn't Get Past One Glaring Issue",
            "content": "I couldn't get past they billed Bruce Jenner as Caitlyn Jenner when the film came out in 2014 and Bruce/Caitlyn came out the following year. Because of this one issue I couldn't even watch the rest of the film after Bruce's character arrived on screen.",
            "review_date": "2020-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Terrible, not funny, bad actors, stupid story!",
            "content": "Unbelievable that this can be found on Netflix! Absolute stupid movie! Not funny! Actors completely suck! Story is bad! So sorry I wüssten almost 45 minutes before I complete gave up! Zero star review is appropriate!",
            "review_date": "2020-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This parody of movies movie is really worth your time.",
            "content": "There has not been a good parody movie in quite a few years, the scary movies are about all we have left, and they have just gotten strange. So here we have the second The Hunger Games parody, in less than 6 months, and you could only be wondering one thing. Yes it is funny. Not rolling around on your back, or tears streaking your cheeks funny, but this is a good parody. There are a lot of exceptional cameos, and the main cast of Hangover guys are all better than you would expect. I liked the touch of having the character names in this movie be the names of the actors, it added that extra layer of unreality. There are terrible jokes in here, and lots of terrible acting to go along with those jokes, but and I'm no fan of Jamie Kennedy he was one hard working producer in this. I really did Enjoy this movie, and was totally surprised that I did. From the start though you can feel that this is a bit better than most of the crap they have been doling out for the past few years, and only barely, but because of that I do recommend this to most people. There is a whole district dedicated to gratuitous nudity, so you can expect some of that, and lots of very simulated violence, but the language is really quite tame. If you love it, or hate it though, stay to the end, the party snaps in the credits are beyond explanation, and after the credits is the biggest laugh of the movie, don't miss it.",
            "review_date": "2014-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No Hangover Cure",
            "content": "The Hungover Games is the latest sluggish addition to the \"Let's parody anything that might be remotely funny\" category of film, lampooning The Hunger Games (duh), Ted, The Hangover series, Carrie, Django Unchained and others.This film steals so much from its peers, while at the same time lacking so many of its own original ideas that our main characters are actually taken directly from The Hangover. And for the most part, the storyline, or at least the first fifthteen minutes is also exactly the same as the 2009 Vegas Comedy. Just like in those movies, the fourth friend of the group is misplaced, leaving the first three to try and remember all the terrible things that they did the night before, in an attempt to rediscover him. I know this is a parody, but really? Word-for-word lines from The Hangover have been pilfered as their own. It's astonishing the true lack of any creativity that The Hungover Games possesses, whereas other awful spoof movies such as, say, Scary/Epic Movie seem to have some (very few) of their own ideas, here, \"writers\" Kyle Barnett Anderson et al, make it feel like they've photocopied Todd Philips' screenplay badly and then taken it for themselves. But it turns out our three buddies have been transported to Hunger Games Land where they have to fight to the death with all the other favourable movies of the last seven years or so. This takes all those films you may have possibly enjoyed over the past few years and throws them in to one terrible mush: watch as the Ted bear has a penis, Katniss Everdeen has had her name changed to \"Katnip\" (HA!), and Willy Wonka is a homosexual. Add to that pops at race, some Human Centipede \"jokes\", underage sex gags and just a little bit of necrophilia and you experience an hour and a half of pure film diabolica. And for the people who defend the jokes for being jokes, perhaps if they were funny, fine, but otherwise it just comes off as offensive and downright lazy. The brow for this movie is so low that it's scraping along the ground.I'll end on the only two positives: The people who play the Hangover team are very convincing, and the film itself is shot quite nicely. Otherwise, please, do not go and see this movie. I would rather have been dispatched by a Hunger Games arrow to the face then to have seen this film. Run – sprint, even – away if someone suggests watching this piece of garbage. @JonnyJonJon1",
            "review_date": "2014-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst of the Drunken Machismo Flunks",
            "content": "If you like hyper-fake-machismo, watch this. If you like drunkards and their destructive misbehavior, watch this. If you want to have a look at what supposed guys, straight and white, in fraternities do instead of higher education academic work, watch this.Oh for certain, for a great shot of what's wrong with males in the US, watch this. Want to know where your money goes into Pell Grants? If you're getting solid scholarship for your bucks, look no further than this flop of a film.",
            "review_date": "2021-05-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste of time",
            "content": "Only thing worth while seeing in this movie is Rita Volk's boobs, the rest is a colossal waste of time! Really I can't even see the need to write more about this movie, but since IMDb is forcing me to, I'll just tell you that if you even consider watching this movie you should just not do it. If you can't bother to write more then one line about the movie and have to go on babbling like a idiot for the rest of the review you know that watching this movie would only be a waste of time. Really I would highly recommend choosing any other movie to see. I only saw this one because of Rita Volk being in it and here's to hoping she will never ever act in anything as bad ever again, so I don't have to see it. To sum up don't watch the movie unless you are brain dead.",
            "review_date": "2015-08-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Relax people it's a spoof.",
            "content": "One of the best spoof movies ever. It's called irony folks! So good.",
            "review_date": "2021-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "BOOOOOORINGGGG",
            "content": "Absloute rubbish i did not laugh at a single scence in the film, dull as dishwater turned it off half way through",
            "review_date": "2019-11-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yet another spoof movie done poorly",
            "content": "The Hungover Games takes the known and loved characters from The Hangover and places them in a world similar to The Hunger Games. In the process, it attempts to criticize Hollywood for a lack of originality. This is perhaps the only funny joke in the movie, seeing as it is itself completely without original thought.It doesn't make fun of the Hungover characters, it just copies them and reenacts their mannerisms in the Hunger Games world. In the process, it also includes various other token characters from pop culture. However, these tertiary characters are fitted with poorly done costumes and for the most part equally poor actors.I must however admit, that many of the actors in the movie are above average for the genre. The story and whole setup is extremely lazy however. I have a hard time imagining anyone being particularly proud of this movie.The movie leaves a lot to be desired, but I suppose it could be watched during a severe case of hangover.",
            "review_date": "2014-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just STOP!!! Dear lord please!!",
            "content": "It's simple, if your names are David Zucker, Jim Abrahams or Jerry Zucker, you shouldn't be making slapstick comedies. This is just another pathetic effort. Maybe you just need to be super high to muster a laugh. Avoid this crap, it's 1 hours whatever of your life you'll never get back. And lying on your death bed years from now wish for just 1 chance, 1 CHANCE !!! To go back to this day and wish you'd listened to me.",
            "review_date": "2019-09-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Some Decent Comedy Sequence",
            "content": "The Hungover Games (2014), people of the vast majority will be put away by blatant attempts at spoof films. However this film does not take itself serious, neither do the characters or the jokes. The film is predictable but that is besides the viewing enjoyment. The film does offer plenty of typical juvenile jokes but it also does contain some clever and witty humorous jokes as well. The lead actors spoofing the lead cast of the Hangover characters are well done, as they portray the characters brilliantly, specifically the actor playing Ed Helms, and Zach Galifianakis. The film isn't great but comparing it to earlier spoof parody films such as Epic Movie, Disaster Movie or Date movie, this film succeeds as it is more enjoyable and has better character development as well as funnier scenes. The R rating is what makes the film better, as we see the film come fold as one.",
            "review_date": "2015-03-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dumb and funny parody movie like the good old days",
            "content": "I remember Meet The Spartans, Scary Movie and all the other parody movies of the early 2000s and this feels like a good one of those from more recent years. Because it is.Gotta admit, the first time I saw this I hadn't seen The Hunger Games so I was lost, but if you're someone who's in touch with pop culture and popular movies and you have a sense of humor, and most importantly - you know that this is a PARODY movie and nothing more or less - you can have a good time.I really hope parody movies don't die. Everything is cringey \"dark\" cancer and rehashes nowadays, taking itself way too seriously. At least parody movies like this is honest about rehashing things, and does a good job at being funny and easy to watch. Just have a beer.",
            "review_date": "2021-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's pretty funny.",
            "content": "The cast do a pretty good job at ripping off the original hangover boys, it's almost too good but it starts to get a little weird when the hunger games cast are introduced. Bruce Jenner and Hank Baskett's appearance is possibility the most awkward thing of the whole movie. They are super creepy and are the worst so-called actors I have ever seen. The rest of the cast are fine, not great but they generate some laughs.Overall the movie really is pretty funny. It's a solid parody and it's nice to see something that isn't too vulgar and obscene; that was left till the credits. I understand that this movie is not everybody's cup of tea but it deserves a higher rating than it currently has. Just don't take it too seriously.",
            "review_date": "2014-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is off-the-hook hilarious, and I am not one for spoofs!",
            "content": "Each of the players are instantly recognizable or just brilliantly written and cast add-ons.It's a weird movie crossover comedy with big boobs, Bruce Jenner still as Bruce Jenner but with blue lipstick, and the bear Ted, is life-sized, and is equipped with a penis and testicles.The whole thing is a riot from start to finish!",
            "review_date": "2021-09-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best parody films in years...",
            "content": "It's really good. The Hungover Games is a fun movie to be sure with many jokes to keep you laughing. Sometimes the film drags on a joke but mostly the jokes are funny. The story consists of 4 guys who go on a stag party and wake up the next day in a dystopia future. In which they have become Tribute for The Hungover Games with people like. Teddy, Scarrie, Django, Thor, The Real Housewives of District 8 and Katnip. It also features references to Jonny Depp being in heaps of films, The Human Centipede sand Avatar.The story can be funny and can keep emotional resonance with the characters and also create a mystery reminiscent of Hangover Part II. Warning: Unlike other parodies made recently this film contains a bit of drug use, lots of nudity, violence and swearing. If you like parodies like Airplane and Loaded Weapon 1, this will surely impress.",
            "review_date": "2014-04-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Doesn't work...",
            "content": "Had a couple of good initial concepts, and some of the cast and acting was actually OK, however, the plot / writing was just terrible. Seemed to have very low budget / production values. It even had some decent special effects in places, which they should have just saved the money on and spent it on the writing.Nothing could save this film once the writing and plot went downhill. Lots of hard cuts between, or during unfunny scenes.Many, many, many very unfunny jokes and scenes. Even the music is strange. It also failed to do much of a parody number on its namesake. Seems to think it's Family Guy with all the pop-culture references that will date immediately.I tried hard to come up with other nice things to say, but I can't. I could not sit through it.Cannot recommend.",
            "review_date": "2014-11-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Actually Funny!",
            "content": "In a world where an entire generation of young people are unable to identify a spoof movie that isn't crap. It is 2014 humans lived with Scary Movie 2 being the last time a decent spoof hit the silver screen. Many have tried. More have failed. One production company stood up. One group of weird people said enough. There have been too many hammy, crappy, unfunny spoofs feeding on the scraps of potheads with a Netflix account. It was time change came to That film was \"The Hungover Games\" and it is a damn good effort to put an end to a decade of utterly unwatchable spoofs. Characters convincingly lifted from other films, to be exaggerated, not imitated. Special effects made by professionals exceeding their limitations, and a teddy bear tea-bagging an escaped slave.This film is non-stop laughter. I was expecting to give up after 5 minutes, but I gave it a chance and regret nothing. This is a brilliant addition to the spoof genre and I hope to see more like it in future.",
            "review_date": "2014-03-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The hunger / hungover games",
            "content": "I think this movie combined two movies into one, and it was better than the two movies it combined! Condensed and saved time, watch this instead of The Hunger games and the Hangover to save time! ;)",
            "review_date": "2020-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Boring",
            "content": "A spoof movie doesn't have to do much to get it right so the fact it failed in every way is kind of an accomplishment. Scary Movie 2 and 3 and Epic Movie had me in fits so I don't think you can argue that I just don't like spoof movies but this one... It was lame. A spoof film doesn't have to be tasteful or clever. It doesn't need good acting. It doesn't even have to make sense, it just has to be funny. But this is just boring. It felt like everything that COULD have been funny just ended up being stupid in- your-face nudity. Relying on dildos, curse words, pee, poo and breasts to make a scene funny just seems lazy. A lot of people are going \"But dude, it has BOOBS in it!\" Guys...if you think boobs make a movie good, you need to find a way around your parents' Safe Search.I'd rather go watch Sex in the City. And I HATE Sex in the City.",
            "review_date": "2015-04-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "GAME SET MATCH",
            "content": "Our Hangover spoof gang enter an alternative universe thanks to Zach (Herbert Russell). They find themselves as participants in the Hunger Games against various cult movie/TV characters including Carrie, Hunger Games, Thor, Johnny Depp characters, puppets, and gratuitous nudity.The humor and satire was second rate. I had a few times when I smiled. No laugh out loud moments. I enjoyed \"The Starving Games\" parody far more than this one which was missing its edge.Parental Guide: F-bomb, nudity (porn stars Sophie Dee, Kayden Kross, Ania Spiering, Rita Volk body double)",
            "review_date": "2019-06-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Couldn't even finish it",
            "content": "I got about 20 minutes before I pulled the plug. There are funny spoof movies out there, like Scary Movie, Naked Gun... and then there's this movie. While it is aesthetically done well, the jokes are lame. There is no real LOL moment. The Hangover was a great comedy. This is just riding on the success of the movie it's spoofing.",
            "review_date": "2022-05-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Solid 5 or 6 - I really enjoyed it. And it's on Netflix",
            "content": "Its all too easy to give this movie a low rating, but I say ask yourself, is it really that bad or are you just a little dead inside? I admit I didn't expect to actually watch all of this originally, but here I am writing a review about it.This movie has some genuine laughs. I laughed out loud a couple of times. All the lead actors do a great job taking off their respective parody. And you'll probably recognise a lot of the other actors ... although you may not remember from where. The production is also good, with the budget for dildos alone likely in the thousands. There's boobs? Who doesn't like some boobs?!This movie never intended to be an Oscar contender, but you never know...",
            "review_date": "2015-09-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Laughed Twice, Stopped Midway",
            "content": "Boring, half-baked, stupid, these are just a few words that come to mind when thinking of this film. I don't know if the people behind this thought they were making some clever satirical look at the Hollywood blockbuster movie industry but what they end up making feels like a 2012 YouTube sketch. I watched a bit of this film, about half, and I did laugh a couple times but in the end I was just bored and uninterested, I highly doubt there is an audience for this kind of film but who know maybe someone out there will enjoy it.",
            "review_date": "2021-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Butt-le Royale! Do you get it?!",
            "content": "I do not think this deserves to be considered among the 100 worst movies ever.I'm the first to admit that these parody movies can be terrible. I actually love the idea of them, they're just lazily made.This is no masterpiece and a lot of the time I'm watching this and thinking \"I could have come up with a better line for that moment\", but it's better than a lot of the worst ones like Epic Movie or Meet the Spartans though it's not quite the quality of Date Movie or Scary Movie 5.It's sort of like the Parody movie's parody movie, the subgenre finally holding its hands up and finally laughing at its own shortcomings.We actually have a pretty cool and solid plot where the many factions of modern popular culture battle to the death and the whole develops in a fairly interesting, linear fashion with some fun gags (\"this is a bad pillow\" had me laugh out loud) and we get a fairly satisfying conclusion even if it doesn't quite make sense.What did annoy me is how prudish they are about human sexuality. 17 is legal in the Majority of US states people! And this is after the ostensibly satirical \"gratuitous nudity\".It ticks the box for something fun and crass that you won't need to think too hard through.",
            "review_date": "2020-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A laff riot unless you are a stuffy shirt!",
            "content": "I love this spoof of The Hangover movies, Hunger Games, Thor etc...so frigging funny. I can see, however, that this is not everyone's cup of tea. Very creative writing with dialogue and bits that made me laugh. Its cheesy but hey life isn't always Grade A movies. I also like the actors the actors are portraying. The mannerisms and attitudes are spot on especially the hangover guys. And using the real names of the actors that the actors are spoofing is fun.If you are not looking for something to change the world and just want to have fun why not. Of course if you don't enjoy spoofs don't bother watching. Those of you that do will have a blast. Have I used my 10 lines yet?",
            "review_date": "2015-06-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jesus wept!",
            "content": "I could only watch 20 minutes and had to concede defeat.Absolutely NOTHING to like about this film to keep me interested...horrible characters, horrible acting, horrible cinematography...just cringe in every area.I have no problem with spoof movies...some are brilliant. Scary Movie 1, 2 and 3 for example.This is just the type of film that tries way too hard...and fails as a result.All involved should be ashamed.",
            "review_date": "2022-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Xa Xa",
            "content": "I enjoyed watching the movie, but it is obvious from its name and poster that it is a terrible movie. I don't regret watching :)",
            "review_date": "2021-08-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Student perfection :)",
            "content": "No reason to go into details. These are all students at the start or end of there student time. And they made it work :) I laughed my ass off even while noticing how crappy some shots and things are. They put a lot of effort in it and I am amazed I can find this movie @ Netflix. This should be a drinking game for fraturn- and sororities :) Love it! Cheers to everyone trying their best here :)",
            "review_date": "2021-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Think of Scary Movie. It's a farce people",
            "content": "Meant to make fun of itself, and it does the trick. Definitely not meant to be a hangover sequel, calm down people",
            "review_date": "2021-02-07",
            "lang": "en",
            "source": "imdb"
        }
    ]
}