{
    "title": "The Broken Circle Breakdown",
    "rating": 7.7,
    "release_date": "2012-10-10",
    "num_reviews": 77,
    "genres": [
        "Drama",
        "Music",
        "Romance"
    ],
    "summary": null,
    "reviews": [
        {
            "review_title": "Voyaging into Love's Danger Zones",
            "content": "There are few films which depict raw emotions as powerfully as 'The Broken Circle Breakdown'. Set in Belgium, and somewhat reminiscent of 'Betty Blue', it tells of the love affair between Didier and Elise - a bluegrass musician and a tattoo artist. The story begins with the couple attending to their young daughter's needs in a cancer ward as she battles for her life against the disease. Flashback sequences portray the couple's initial meeting, Elise's incorporation into Didier's band as a vocalist, the mad passion of their early romance and the arrival of daughter Maybelle in their lives.Back at the hospital seven years later, the child endures the toxic effects of chemotherapy, her health alternately improving and deteriorating, while the parents accompany her on this agonizing roller-coaster ride. Fracture lines appear in the couple's deep bond as atheist Didier rails against a god that could have inflicted such a cruel destiny upon the girl, while Elise struggles to hold onto hope. Somehow their epic odyssey into the deepest regions of pain is neither pessimistic nor depressing, and their story communicates profound insights about the need for love, forgiveness and understanding in extreme circumstances. By contrast, it makes most Hollywood productions look like trite insults to human intelligence. Perhaps they are - and maybe audiences should look elsewhere for authentic artistic expression. This film suggests Belgian cinema might be somewhere to start the search.",
            "review_date": "2013-10-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Broken Circle Breakdown brings so much to the American audience about blue grass music, about love, and about film.",
            "content": "Who would have thought that a Flemish movie could bring Blue Grass music to mainstream America? I have to start the review of Broken Circle Breakdown with the music. It was illuminating. A whole new music for me to love. Right under our American snob-ridden noses. Harmony from Heaven and a Capella perfection seemingly from under the arches of Princeton. And the lesson in banjo history delivered right from the movie's start by the actor extraordinaire, Johan Heldenbergh, gave new meaning to the poor cousin of the violin, Mr. Banjo. Did I mention the director placing that banjo intro right after one fabulous, sensuous love scene making the banjo, the man, and the woman a threesome with perfect harmony? Mostly though, the music for me made a sad, tragic tale palatable. Without it, I couldn't have stayed.The story is not a happy one. It's about a young, innocent child dying of cancer. It's about the flame of a perfect love unable to withstand the harsh winds of life outside the circle of their love. And, it's about choices during life that are made by each of us, by ourselves, and for ourselves. Add it all up, and it's a tough movie to take without the music.All the actors are marvelous. I am sure that had it been cast in the U.S., Harry Connick Jr. would have played Didier and Reese Witherspoon, Elise. Trust me on this, which is why foreign films are inevitably better than American films for very serious stories needing to be told. Veerle (Elise) and Johan are not perfect specimens of the human race, and their faulty teeth and imperfect thighs bring the realism to the screen that is always missing in U.S. dramas. Interestingly enough, the sex scenes are more sexy by the imperfections and their immersion in the roles far beyond what the Academy rewards here.The movie is being submitted by Belgium for an Academy Award as Best Foreign Language Film. I nominate it now for best screenplay as well. Every word in the dialog belongs there, like a set that has nothing in it for show. And, while we are piling on nominations, how about Best Direction? The direction is steady and sure, with timing that shows it's not just comedy that needs to have a steady rhythm. Broken Circle Breakdown has perfect dramatic timing.There is a God theme in Broken Circle Breakdown where Elise is a believer and Didier is not. It's the age old fight in us all that wants to believe but needs the proof that is never really to be found. I see it woven in, but for me, it's not what the film is about. It's about life while you are here, not about life after you are gone.There is a moment when Elise says she should have known that love couldn't really be that generous. What a thought. That the cocoon of a perfect love cannot last because love just can't be that generous. First time I've heard love had the power to be generous and it will be with me for a long time to come. It's the stuff poems are made from.As an American, this is the first film I can recall where I can see the outside world's version of my country, and, its fall from grace as our underbelly of political posturing sets aside that in us that could be greater still. At this particular moment in time, it makes a girl pause for a moment and lament our leaders and my poor voting record in electing them. Had to say it. Enough about politics.I have to stick just a short sentence in here about the tattoos. Makes you want to go out and get one. According to the credits, the movie was based on the play \"The Broken Circle Breakdown Featuring the Cover-Ups of Alabama\". But don't think Elise used her tattoos to hide from her real self. Instead, they were adjectives in the story, side bars that showed us how she got there. They are beautiful, and I might just go out and get one that says, Be generous with my love.Great pick Hamptons Film Festival. It was one of the first movies shown, and that's a high bar to set.",
            "review_date": "2013-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A snowflake from the Sahara",
            "content": "A bluegrass film from Belgium? That sounds like a snowflake from the Sahara, a kangaroo from Mongolia, a coconut from Siberia: something completely out of place. But in fact it works out really nicely. This is not a film about bluegrass, but a film in which bluegrass plays an important part: it supports the story. Just like in 'Oh brother where art thou', the only other film I know with a bluegrass soundtrack. 'The Broken Circle Breakdown' is about the young couple Didier and Elize. Didier seems to be an American born on the wrong continent: he drives a pick-up truck, sleeps in a trailer and considers Bill Monroe the greatest musician ever. Elize works in a tattoo parlour and looks the part. She doesn't know who Bill Monroe is, but she wins Didier's heart by draping her tattooed body, clad in a stars and stripes-bikini, over the hood of his truck. The young lovers are happy and carefree, even when Elize gets pregnant. They call their daughter Maybelle (after Maybelle Carter) and move from the trailer to an old farmhouse. But then disaster hits and their lives are changed dramatically. Director Felix Van Groeningen tells the story in many flash backs and flash forwards, but succeeds in not confusing the audience. In spite of the sometimes very dramatic developments and some emotional scenes the film contains many lighthearted and even funny moments. The bluegrass music blends in naturally: Didier is a bluegrass musician and Elize joins the band as the singer. The use of bluegrass music was an idea from actor Johan Heldenbergh, who plays Didier. This well-known Flemish actor is very involved in all things American. He has even made a 'Flemish western', a no-budget film which involved all inhabitants of the village he lived in at the time. When asked by Elize what he really cares about, Didier answers: 'America. That's a country of dreamers'. But later on in the film he despises George W. Bush's decision not to allow stem cell therapy. American politics is not the only theme the director cleverly includes in the story about Didier and Elize. Another one is religion. Didier is not religious, and cannot understand why others are. At one point, he confronts the startled audience of a bluegrass concert with his views about a supreme being. Scenes like these are a little bit over the top, but then again Didier is not an average person. 'The Broken Circle Breakdown' is a very original, heartfelt movie about exceptional people and beautiful music. Worth seeing, even if you don't know who Bill Monroe is.",
            "review_date": "2012-10-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "deep touched",
            "content": "today i saw this little masterpiece about love & death at the berlinale filmfest. at the huge friedrichstadtpalast with 1500 people inside, many of them were crying. it was such a great trip the whole movie. at the end there were 10min standing ovations for the filmmakers. everyone was deep touched by the story, great acting and such good music. the music is full of pain, you could cry the whole day. camerwork is well balanced and the picture quality is really good. the editing was a big surprise. it jumps between past and present without confusing the audience. it generates many dramatic moments. chapeau felix van groeningen & team.",
            "review_date": "2013-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Refreshingly Different",
            "content": "This is definitely one of those films that is best seen with as little prior knowledge as possible. I saw The Broken Circle Breakdown at a small cinema in Plymouth with only a vague idea that it had something to do with bluegrass music, of which I knew hardly anything. The music was actually very good but the film is far from a story about Belgian musicians playing American music. In fact, this is a fairly simple tale and, although told in a interesting way, there isn't an awful lot going on. However, what this delightful film manages to do brilliantly is throw up some big questions on topics such as love, life & belief that really get you thinking. The past-present-future style works well to gradually unfold the details of what is happening. I found that this added very much to the tension and emotion of the film, not unlike Incendies (2010) which, although very different in subject matter, had a similar feel. Broken Circle is not as 'heavy' as Incendies and even has several smile-worthy moments to balance out the intensity. I can see why some people might be upset by certain anti-religious aspects of the film but I thinks it's healthy for beliefs to be challenged. Similarly, some people seem to have been annoyed by the time-line jumping about but I think this actually works to great effect, especially if you don't know anything about the story beforehand. Overall, I would highly recommend Broken Circle; it's refreshing to see something genuinely different that generates real feelings for the characters and stays with you for more than ten minutes after the ending! 8/10",
            "review_date": "2013-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A masterpiece.",
            "content": "The bittersweet story of Didier and Elise, their child Maybelle and the blue grass music. Seeing this movie at the Berlin Film Festival I didn't expect anything in particular. What I saw was an emotional roller-coaster of a movie, beautifully cinematography, a great book, wonderful music. And oh those actors, bringing these written lines to life. It will bring even the most hard boiled audience to tears. But you will leave the cinema after that with a smile and be grateful for having witnessed the magic of movie making at it's best. Director Felix van Groeningen has made his masterpiece, I don't know how he can top that one. I am sure you will love that movie as much as I do.",
            "review_date": "2013-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Film seems chronologically challenged, but works out very well after all and offers perfect drama",
            "content": "This was the openingsfilm of the Ghent filmfestival 2012. Director Felix van Groeningen is born (1977) in the city of Ghent, and still lives there as far as I know (also has, see IMDb trivia, a heavy Ghentian local accent). Please do not construe this to be the sole reason for programming this film on the prestigious opening night, since he has an ample track record to warrant it.The announcement text as published by the festival draws our special attention to the considerable portion of bluegrass music in the film. It made me hesitate a little when booking tickets, due to my association with country&western music that I don't like very much (maybe too \"American life style\" for me). But my prejudice proved very wrong, and the music score offered much more than I imagined. It is not a musical, however, where the music scenes carry the story line. Instead, the music appears on logical moments and does not come in the way of the drama.An interview with the film director preceded the screening. Apart from the usual exchange of facts about how the film was made and how it relates to predecessors from the same director, I noted an important observation made by the interviewer (Patrick Duynslaegher, artistic director of the festival). He mentioned that the scene ordering was not the one he would have chosen. It proved to be a useful hint. If I had not known this before, I would have been left confused, and I certainly would have failed to appreciate the film. Now I satisfy myself with calling it \"chronologically challenged\", hopefully serving as a heads up for subsequent viewers. The only switch back in time shown explicitly is after the initial scene around the child's hospital bed. We see \"7 years earlier\" displayed announcing a backflash to the time before the parents were married. All later time switches back and forth (be prepared for many of those), have to be derived from the context. It needs some getting used to, but it works out very well, after all, to get the dramatic development across.The bare story can be told in a few lines, but doesn't do the film justice. Two very different people get to know each other by chance, find a common ground in their love for bluegrass music, the woman gets pregnant unexpectedly, they get married, and raise the child that is born. The drama starts when the child has an incurable disease at the age of six, gets hospitalized for a long time, and undergoes some fruitless therapies. Finally, stem cell therapy seemed to offer the last straw, but after a hopeful start proved nevertheless too experimental to yield a positive end result.Throughout the film we see significant events in the form of flashbacks. These events are taken from the healthy years of the child, and seem almost trivial at first. Two examples: the bird that flies against the veranda glass and dies, and the stories told about the many years that light from the stars is underway before it reaches earth. These are just examples, but have in common that they become more important later on, either as happy memories or as mishaps to hold against each other.In the aftermath of their child's death we clearly see that they grow apart more and more. The only occasions where they still see each other, are the continued bluegrass concerts they give together with their band.The very different reactions to their child's death is best illustrated by what follows after a TV speech by George W Bush, when he vetoes stem cell therapy research as against the will of God. In the middle of a concert, the man bursts out in a long speech. He states that stem cell therapy might have rescued their child when medical science had been given the chance for more field research, and not being hindered by people who put their beliefs above progress. She does not take it very well, retreats to the tattoo shop she owns (the place where they initially met, by the way), and she barricades herself. There is no spoiler danger ahead when I tell that this cannot lead to a happy ending.All in all, given the heads up from the initial interview about the non-standard scene sequencing, I was very happy with the end result. The casting and acting added positively to the total experience, as was the case with the bluegrass music. The latter is still not my favorite, but it blended in very well with the proceedings, and thus formed an integral part of the story line and the decor. My conclusion after all is that telling the story this way, is the only logical way that really works.",
            "review_date": "2012-10-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Makes you dissolve in thought!",
            "content": "Powerful depiction of a dissimilar couple who faces softest and hardest moments of life. The little effect that leaves-by everyday when one's heart don't gets what is needed is counted on in the viewers' mind, culminating up to the extreme levels which require a faintest of pokes to fell down.Everything in this movie is a piece of art. It will make you laugh as well as sob if you're alone. For drama lovers, it's a masterpiece; just pick it if you liked Paris, Texas or The English Patient, Bonnie and Clyde or Wild at Heart..An Oscar deserving film, cleverly edited, acted and directed.",
            "review_date": "2013-11-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very powerful film but also a heartbreaker!",
            "content": "'THE BROKEN CIRCLE BREAKDOWN': Four and a Half Stars (Out of Five)Critically acclaimed Belgian drama film based on the play 'The Broken Circle Breakdown Featuring the Cover-Ups of Alabama' by Johan Heldenbergh and Mieke Dobbels. It tells the story of two bluegrass musicians who fall in love, have a child and have to cope with that child's battle against cancer (at the age of just 6). Heldenbergh co-stars in the movie with singer/actress Veerle Baetens. It was directed by Felix Van Groeningen, who also co-wrote the screenplay (with Carl Joos and Charlotte Vandermeersch). The film has been nominated for 'Best Foreign Language Film' at the 2014 Academy Awards and I think it deserves all the acclaim and award recognition it's been getting. It is a really hard movie to watch though.Heldenbergh plays Didier Bontinck, a singer and banjo player of a popular local bluegrass band (in Ghent, Belgium). Baetens plays Elise Vandevelde, a tattoo shop owner who's also a very talented singer. They meet and fall in love instantly. She later joins his band. The two are very happy together and things continue to go well even through an unexpected pregnancy. But when their daughter, Maybelle (Nell Cattrysse), develops cancer at age 6 they're perfect life comes crashing down. The story is told mostly in flashbacks and Bontinck's atheist beliefs also play a huge part in how he deals with the drama.The movie reminded me a lot of the great 2010 film 'BLUE VALENTINE'. It's not quite as memorable but it is reminiscent in style and feeling. This flick also has some beautiful bluegrass music though (all American songs performed in English), which is one of it's highlights. It's very emotional; uplifting and romantic at times but mostly extremely depressing. There are very strong words against religion (and how it ruins the lives of everyone) throughout the movie. Being a very spiritual person I can't say I agree with this message but I think the character is justified in feeling that way. It's definitely a very powerful film but it's also a heartbreaker.Watch our movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=jTUUB4nMD6M",
            "review_date": "2014-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Belgians, Beards, Bluegrass and Death",
            "content": "Belgians, Bluegrass, Beards, Tattoos, Child Cancer, Marriage, Death, Birth, Life, Sex, Religion, Science, Politics, America, Birds, Stars and Suicide. The Broken Circle Breakdown is about all this and more. It's a phenomenal, brilliant, difficult, depressing, heart warming and joyously musical movie from Belgium by writer/director Felix Van Groeningen starring the supremely talented Johan Heldenbergh and Veerle Baetens. Johan Heldenbergh was also a co-writer of and performer in the original stage play and even learned to play guitar, mandolin and banjo to perform the lead role of Didier who is fascinated by America and bluegrass music.The film tells the tragic story of Didier, the bearded bluegrass fanatic and passionate atheist, Elise/Alabama the head strong, mysterious, confused, emotional, sexy and lost tattoo shop owner and Maybelle their doomed daughter. The film chronicles their lives together, through the good and the bad, in a nonlinear narrative. The emotions involved and the relevant life moments, though, flow in a perfectly understandable and pleasing way. It's not unlike someone, sat round a table, telling you their life story. It wouldn't go from start to finish, there would be moments where they'd have to go back and fill in the blanks for you, that's the nature of this film. The characters meet, fall in love, find joy, get pregnant, face that hurdle, have a child, suffer that child getting leukemia and passing away and then the rest of the film shows how both Didier and Elise handle that while also taking time to cover the religious, spiritual, political and scientific ramifications of that. Didier is thrown more passionately into his steadfast belief in science and the political, religious fundamentalists who would block its exploration, while also desperately, emotionally and lovingly trying to keep his marriage and music together and Elise begins to find beauty and solace in notions of re-incarnation or the spiritual realm but also retreats from a situation she sees no remedy to and slowly, tragically abandons everything. Interspersed through all this tough life stuff is some of the most exquisite live performance of bluegrass, country and Americana roots music by a brilliant team of bearded Belgians. It's one of the best movie soundtracks of this kind, in my humble opinion, this side of O Brother, Where Art Thou? The music, overseen and, very often, written originally by Bjorn Eriksson is most definitely the soul of this film and where it really hits its stride in terms of displaying truth, beauty and raw emotion. The whole film could've been dialogue free and told in just that incredible series of performances such is the skill of the actors and musicians. It helps immensely that the two leads perform the songs themselves and so can imbue them with the emotional journey their character is taking. During the rendition of 'Will the Circle Be Unbroken' We see attraction, amazement and the first flickers of love in Elise's face from the audience. During \"Cowboy\" Didier connects with Elise, shows off, struts, feels confident and she responds with excitement, awe and lust. During \"Boy Who Wouldn't Hoe Corn\", shown in a fantastic montage that goes from Didier practicing in the caravan, passed a beautifully photographed, fireside hoedown and up to the point when Elise finally joins her man on stage, you see her blossom and Didier unable to believe his luck. You even see the band buoyed and pushed forward by the way everything is gelling. Elise's solo performance of \"Wayfaring Stranger\" is so powerful and perfect that it doesn't really need the intercut images of poor Maybelle's fate, as everything is on Veerle Baetens' face and in the words of the song. This continues throughout the film with everyone hitting the right note so as to make the emotions utterly raw and believable in a way that only the combination of great direction, editing, performance, music and film can. In what might be one of the most beautiful performances of the entire film, Elise joins Didier and the band on stage one last time to perform a duet version of \"If I needed You\". It is the point where everything shifts and the two lovers are moving apart, Didier reaching out and Elise retreating. It's so sad, awkward and stunningly simplistic.These musical interludes and their deep, clever, subtle storytelling are not, in any way, too obvious, mawkish, sentimental, over wrought or manipulative. They are woven so perfectly into the broken narrative that they enhance the journey you're on with the cast. It helps, of course, that I am already a fan of this music and it helps too that the film is photographed, directed and edited in such a wonderful way as to make even the slightest nod of a head, or the move of a hand poetic and rich. The colours, the grain, the lighting, the sound and the shots are so full of detail, texture, shadow as to both be seemingly realistic, you can feel the warm fire in a cold farm house, and utterly artistic, vibrant and clearly a movie.Is it a tough watch, a tad depressing and definitely melodramatic? yes. It wasn't the love story I was expecting by a long shot but whereas other films I have seen are just relentlessly dreary, depressing, slow and devoid of ideas and emotions, Broken Circle Breakdown can be watched over and over again for the depth, detail, performances and ideology it has. I took from the film that life is meant to be held on to and fought for, not given up on or run away from and while finding solace in the religious or spiritual is all very well, there is more than enough beauty, mystery, music and reason to keep living, as much as you can, day by day, on earth, no matter how hard it gets. You never know, one day you might be surrounded by awesomely talented, bearded Belgians singing bluegrass... we can all dream, right?",
            "review_date": "2013-10-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gripping, full of emotions, a Belgian gem",
            "content": "Drama, Music, Romance, those are the genres this movie is categorized in, not really the genres I'm looking for when searching for a good movie. But I'm a Belgian and a movie buff so it's only logical that I started watching this movie from my home country. The result is a beautiful movie, full of emotions, different emotions as everybody copes with death in different ways. Veerle Baetens did an amazing job playing her character and Johan Heldenbergh was just stunning if not exceptional. Both leading characters showed different ways to cope with grief, one with hope, one with anger. It's something we all could relate to. The Flemish language, not the easiest to learn or understand, is not even an issue, it's not a surprise this movie got nominated for an Oscar for best foreign motion picture. It's certainly not a surprise it won so many awards in different countries as this story is just gripping and won't let anybody indifferent, even a childless guy like me that doesn't really like kids. The acting is of superior level, far away from the usual romantic Hollywood scenes, it's raw and untouched. As for the music, normally I hate it when they start singing in a movie, and Country is really not my kind of music, but in this case the Bluegrass and the sweet sound of the banjo combined with some good lyrics and voices just added something special to The Broken Circle Breakdown. It's one of the better Belgian movies. For a small country like Belgium it's nice to see we can make some poignant interesting movies.",
            "review_date": "2019-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "infinite sadness...",
            "content": "I saw this movie yesterday, and must say that it's the first time that I'm really really impressed by a Belgian movie. If I had to compare it with another movie, I would say Into the Wild. Both movies are about passion, beauty and sadness. Whereas ItW has a lot more focus on beauty and passion (the sadness didn't really reach me), this one also has a lot of beauty (never knew I liked bluegrass music so much) and passion, but the sadness... oh the sadness... Half the movie you will be trying to hold in your tears. So don't expect a big story with plot twists and murder weapons; expect a story about real people, that puts your feet on the ground, and that shows you how little it would take for you yourself to end up like this. Now excuse me while I go and look for some Bill Monroe music...",
            "review_date": "2012-10-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Worthy Oscar Contender",
            "content": "I watched this The Broken Circle Breakdown (BCB) immediately after viewing American Hustle AH), which is a Best Picture nominee, and while I enjoyed the latter, what struck me about it, even while I watched the movie, is that it tried too hard. The scenes seemed crafted for Academy voters. This feeling was solidified as I watched BCB, which, on the other hand, is a movie in which the emotions feel real and the acting appears genuine rather than forced.Avid moviegoers are familiar with the happy-family-torn-apart-by-illness theme, but the marriage of that theme with American bluegrass music in a Belgian setting is novel. I have not seen any of the other Foreign Film contenders, but this one is more than worthy when juxtaposed against AH.",
            "review_date": "2014-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Full of touching scenes, striking images and wonderful music, with characters we would want to care about.",
            "content": "'The Broken Circle Breakdown' is director Felix Van Groeningen's new Belgian film, following a young married couple comprised of Didier (Johan Heldenbergh), a bluegrass banjo player, and Elise (Veerle Baetens), a free-spirited tattoo artist who joins Didier's band.Their relationship changes dramatically with a death in the family, forcing both to reconsider everything. Didier is mad about all things American, but takes a dim view of the then-president George W. Bush's Christian beliefs on stem-cell research. Elise, surprisingly, has always been religious. With her eyes always in the sky, she sees the dead reincarnated in animal form, much to Didier's annoyance.As much in love with his music as he is with his wife, Didier can't fathom the connection between Elise's religious beliefs and the often devotional bluegrass songs they play. Any spiritual beliefs Didier has lie in the music, which strengthens their bond when they perform together. This powerful film is occasionally heavy-handed in its use of metaphors, the bluegrass music elevates this often troubling and emotional film into an uplifting experience. It is a subtle but very effective driver throughout the film, where both the pleasure and the pain of bluegrass is woven into the fabric of their relationship.The central performances of Heldenbergh and Baetens have much to admire, especially the latter, in a stirring relationship full of intensity. 'The Broken Circle Breakdown' is full of touching scenes, striking images and wonderful music, with characters we would want to care about. It reminds us that we are a strange species, where anything can be interpreted differently by various people for their own needs, where rationale plays second fiddle to belief. For many, such things help us to function in our daily lives, guiding us through situations we otherwise wouldn't be able to understand. For others, belief is just not enough.",
            "review_date": "2015-03-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bluegrass,tattoos,stem-cells and euthanasia. Somehow it makes for one of the best movies of the year.",
            "content": "Oh and did I mention it's a foreign film? I simply cannot say how much I loved this movie. It's the story of Didier, a bluegrass singer, and Elise, a tattoo artist who fall in love. The film chronicles their lives over a period of approximately 7 years. The highs and the lows. The joy and the pain. The movie captures your attention from go, with the great music and locks you in for the journey with their fast moving romance and the family tragedy that they go through and how they both deal with it. I was moved to tears on more than one occasion with this movie. The story goes back and forth in time with a subtlety that would impress Tarantino or Nolan. The directing is inspired and the cinematography fits the mood of the movie. You forget your reading subtitles quickly and immerse yourself in their odyssey. This is definitely one of the best movies of the year and it is a shame that it is only up for Best foreign film. It could give the big dogs a run for their money this year, if it had a chance.",
            "review_date": "2014-02-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very beautiful Belgian drama",
            "content": "Yesterday i saw this beautiful movie about life, love and death. After half an hour i had the feeling i was looking to a amazingly well balanced and touching film. Every scene, switches in time, music and countryside setting, the actors, the Flemish language ... it all seems to fit together. All credits for that, because the content is rather heavy: the life of the the two leading persons turns completely upside down when their child becomes very ill. The good thing is that - despite the dramatic events - the film doesn't become sentimental at all. The enormous grief is shown beautiful in small details like a bent hand (in the song if i needed you) or the facial expressions of the main actors. Amazing (and yet, easy to believe) how two people can react so different on a tragic event like losing your child.",
            "review_date": "2012-12-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "In spite of the bleak premise the film isn't an emotional force",
            "content": "The Belgian feature The Broken Circle Breakdown has a booming political voice and a pair of committed performances but as a film it does not work. It is apparent that the narrative was moulded heavily for the screen but without fully embracing and adapting to the filmic medium. The story is about a couple named Didier (Johan Heldenbergh) and Elise (Veerle Baetens). They have been a couple for seven years and sing together in a bluegrass band. Didier wants to live like a cowboy because he loves American country music and Elise, while covered in her own tattoos that detail her previous relationships, is running a tattoo parlour. The couple is told their five year old daughter Maybelle (Nell Cattrysse) has been diagnosed with cancer. Using a non-linear structure, the director Felix van Groeningen cuts between this present day crisis and then back to when the couple first met. He also flashes forward to a pivotal future moment when Elise herself is being rushed to hospital. The shape of the narrative is a stylistic choice rather than a psychological one because the time shifts do not enrich the depth or meaning of the lives of the characters. The lead work by Johan Heldenbergh (Didier) and Veerle Baetens (Elise) is adequate and the music is cheerful but in spite of the bleak premise the film isn't an emotional force.The fate of a child and the subsequent breakdown of the family unit isn't a new idea either because there have been an immeasurable number of films depicting this tragedy. Lars von Trier's Antichrist (2009) is one of the recent and grimmer examples. For Groeningen the adaptation process is a far greater problem than originality. The script he and Carl Joos have written is from the play \"The Broken Circle Breakdown Featuring Cover-Ups of Alabama\", by Heldenbergh himself and Mieke Dobbels. One of the difficulties with translating a play to a film is the contrasting forms of the two mediums. A play is almost entirely dialogue driven, while cinema is largely a visual medium, relying heavily on images to tell a story. The play apparently featured a number of monologues that Groeningen admits would not have been cinematic if they were included in the film. Consequently, some of the characterisation has been lost and the two characters seem rather flimsy. Groeningen has also said that he has not plotted the film through story but emotion, which accounts for why it isn't very eventful till late in the piece and why it lacks a strong through-line. Similarly, Maybelle's sickness forces the two adult characters to be reactionary and express themselves largely from their emotions and dialogue, like a play, rather than providing them with something to act upon. The music performances are injected to redeem this problem and to provide more \"action\". They are a pleasant diversion, even though the instruments are sometimes too loud for the singing voices. The bumps in the script must have been visible to Groeningen because he tries hiding them within the non-linear storytelling. He admitted that the structure was developed in the film's editing process. For a little while the dual timelines dissolve the story's dramatic simplicity. A slick overlap between the timelines contrasts Didier and Elise building a home for their child and then cuts to the present as they bring Maybelle back to the finished property from the hospital. However, the structure is largely window-dressing, covering for what is mostly a simple melodrama with loud political ideas. Didier and Elise exist to verbalise an ideological and social debate. When tragedy strikes, Didier blames the Bush administration for fighting against stem cell research, while Elise is driven by her faith and the possibility of spiritual healing. The director offers no subtlety in expressing Didier's atheist viewpoint. He zooms in on footage of George W. Bush speaking on television and allows Didier to yell at an audience, in monologue style, about the failures of the US government and religious conformity. The play originally came out in 2008, just a year after the Bush administration was replaced. The scientific debate would have been timelier several years ago. Once the tragedy unfolds and the flashy narrative structure is pared back, the film's verbal friction takes over and the parents blame each other for the grief in their lives. But everything is pitched at such an overly melodramatic level that I found myself resisting the film rather than being moved by it.",
            "review_date": "2014-05-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Felix van Groenigen's Belgium Love Letter to Bluegrass",
            "content": "While De Helaasheid de Dingen (The Misfortunates) was more a coming of age story, one focused on loss, adolescence and redemption, Felix van Groeningen's follow-up has a deeper and more tragic message.In the film we follow in non-linear fashion the lives of Didier and Elise as they meet, fall in love, perform together, have a baby and grapple with their daughter's cancer. Didier is in love with America and American bluegrass and he speaks tenderly of the music. Once a punk rocker he now plays the banjo in a bluegrass band. Elise is a tattoo-artist, free-spirited in her own way, and by mid-way through the film we see as her more religious than her husband. She becomes a member of Didier's band.What I like best about this film is the seamless way in which the past and present are woven together. Though the film jumps back and forth, the viewer is never lost. Felix van Groeningen has sculpted a movie so intuitively that the audience feels as if they are travelling back and forth, experiencing the highs with the lows and knowing they are part and parcel of life and love. How a moment in the present woefully contrasts a tender episode in the distant past belong to this film's masterful sweep and handling of events.Moreover, both Johann Heldenbergh (also of The Misfortunates) and Veerle Baetens (Loft) are intoxicating in their performances. Every time I found the film harder to watch, I couldn't stop watching them. We feel grounded in their lives, their passion for each other despite the eventual pain of burying their daughter. We also feel the relationship splintering and understand how Didier and Elise react. While Elise consoles herself with religion, Didier directs his anger at the country of America.Also, having grown up in a household of Emmylou Harris, Johnny Cash, Linda Ronstadt and classic country, I loved the music. The performances invoke joy and feet-stomping happiness that too is intoxicating.I suppose my only criticism and it is both major and minor is that the film seems to lose itself in the maudlin after the midway point. I kept comparing the film to The Misfortunates in its ability to balance the tragic with the light-hearted. I also found myself thinking of the Irish film, Once by writer/director John Carney which also featured a musician couple. Though the latter film dealt more with love frustrated by time and circumstance and not tragedy, I felt it was resolved with a realist touch. It is difficult to both love a movie and see its flaws and herein lies my main qualm with The Broken Circle Breakdown: it gets caught up in the pain and loses the balance and ultimately the realism. The audience has already succumbed to the death of Didier and Elise's charismatic daughter (played by newcomer Nell Cattrysse)and towards the end must then accept Elise's overdose.I can even pinpoint the scene where the film roughly goes off course. Following a performance of 'If I needed You', Didier rants to his audience about God and religion and the banality of belief, especially when it stands in the way of stem-cell research. It is in this moment he loses Elise (having at this point re-christened herself Alabama). I know the director based his film on the play written by his lead and Miekke Dobbels but it's at this point where nuance and subtlety is suddenly exchanged for a hammer blow and what was once hinted at and discussed with metaphor and poetry becomes polemic. Knowing musicians and performers, Didier's anti-religious outburst felt out of character and explicit. It is recognizable that grief can be untamed, that angry and fear make up a large part of the pain but that's what art is for. Music, I would argue is the channel for suffering to be healed and Didier's opportunity to broadcast himself to an audience felt out of touch and forced. This soap box moment took me out of the film and the fact that his band members didn't try to stop him or at least calm him on stage proved also unrealistic. And that the diatribe was used to blatantly inspire Elise/Alabama's suicide attempt made it seem all the more ridiculous and immature. Maybe one has to be true to the source material (both the original play and the tragic nature of bluegrass songs) but the maudlin sours the film's ending. Which is a little unfair for an audience already swept along by a troubled and bittersweet current of grief and love. Instead of providing mature (though at times immature), three-dimensional characters with a suitable conclusion, the movie devolves into soap opera theatrics. Humor is lost along with hope which the film carried so well. This film is excellent (and flawed) and was nominated for an academy award for a reason but also didn't win, perhaps because of the movie's bitter, hopeless and cheap resolve.",
            "review_date": "2014-03-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Old contents, but in a new and awesome look",
            "content": "The 86th academy award is ruled by the European nominees in the foreign movie category. The movie took the advantage of nonlinear storytelling. From present to past to future. Frequently everything keeps delivering the surprises. If you arrange all the story together properly, you would find a typical thematic. I must say the editing was what made the movie a better product. I think the best one I have seen from the recent on the editing perspective. Sadly, it was snubbed, in that category for 2014 Oscar. This cancer theme movie is well deserved a place in the shortlist for foreign the foreign movie category.What I found short in the movie was the emotions. They had sufficient, but did not convince me all along. I usually wet my eye for the cancer theme when a character dies of it. But in this movie I grieved along the other character, but could not find a drop. All I was interested in fascinating characters. It was over a 100 minute movie, but I felt the pace was in a hurry. The transformation of a scene to another had broad skip in the timeline. When you watch the kid being treated for her ill in the first phase, in the next scene you would find her in a critical stage. Like that, it was racing towards the next stage of story development.It was kind nice to see two different characters falling in love and have a baby without knowing the consequences. They face it only when it begins to happen. So the story being told in that context in many pieces of flashbacks. The country musics and songs were good. The performances were also very natural from both the leads. It was well made from the directional viewpoint because of the well known contents to make it believable. In one word, it is well adapted stage play into a full length feature.",
            "review_date": "2014-02-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A moving drama with some great music to boot",
            "content": "Uniquely combining bluegrass music classics, family drama and relationship studies into one Belgian infused heavy hitter, Felix van Groeningen's Oscar nominated The Broken Circle Breakdown isn't by any means an easy watch but it's a film that offers up many moments of joy, many moments of heartache and features some outstanding acting turns and musical renditions in a familiar like tale that would be nigh on impossible not to respect.Groeningen delivers his film in a way that may be off-putting to some and it's right to say that at times his structure of flashbacks, flash-forwards and present time scenes combine to create a somewhat disjointed feel to proceedings that weaken emotional ties to what is occurring due to a lack of audience engagement, but when Groeningen nails his scenes, there a sight to behold. Scenes centred around couple Didier and Elise and there young daughter Maybelle are fantastically well played, Didier and Elise's bands musically staged scenes are often highly entertaining and at one pivotal stage moment, incredibly moving and interplay between actors Johan Heldenbergh and Veerle Baetens delivers some of the best one/two double acts by male and female actors of recent memories.Creating a couple that throughout remains empathetic, relatable and likable, leads Baetens and Heldenbergh (who also co-wrote the screenplay) are wholeheartedly in tune with their characters and their ability to not only act but to sing is an incredibly feat of acting. Both Baetens and Heldenbergh are tasked with many a varied range of emotions, from lofty heights to lowly lows and whether it's at the peak of happiness or the despair of unhappiness, Elise and Didier feel real thanks to these two actors. Didier and Elise's love story in many ways reminds one of Blue Valentine, an intimate and raw love that overtime has been torn at by the harsh twists of life and the structure to Broken Circle Breakdown does feel reminiscent of Derek Cianfrance's tale as previously mentioned in its flash forwards, flashbacks and present day scenes.An occasionally joyous, often sombre and sometimes beautifully moving, The Broken Circle Breakdown absolutely deserved the critical and award plaudits it received the world over thanks to its fine movie making, high calibre acting and perfectly constructed soundtrack. A tale not to uplift but to in its unique way inspire, this is a film all lovers of classy dramas, world cinema and connoisseurs of toe tapping bluegrass should track down at the next available opportunity.4 and a half terandas out of 5 For more movie reviews and opinions check out - www.jordanandeddie.wordpress.com",
            "review_date": "2014-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Belgian masterpiece!",
            "content": "Few minutes after i started watching the movie, i realized that i am about to watch something unique . The movie will hit you with drama , you will cry ,you will laugh and you will fly with the human emotions. And yes, it's a pure melodrama that will continue to stir your brain till the up limits.Not only the emotions part, but also the movie will make you question about god, morality and related stuff. The husband is an atheist and he had gone mad by the idea the scientific researches with stem cells are pending because of religious matters .The film will never stop entertaining you , you will hear a nice music by the band that include the leading characters of the film. I should tell you that the movie run back and forth so many times ,so you have to focus with every piece to get the idea and never get lost. ENJOY!!",
            "review_date": "2014-03-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bluegrass, That Is Country Music In Its Purest Form.",
            "content": "The Broken Circle Breakdown is an intensely moving cinema about passion, love, loss & sadness and paints a very touching portrait of two people who fall madly in love, start a family & pursue their passions together but when an unexpected tragedy hits their young daughter, their relationship, love for each other & everything they believe in is put on a test while also setting in motion a chain of events that end up truly devastating for each one of them.A very nicely written story that is even more beautifully invigorated on the screen by the director and with the help of strong performances from the cast & exceptional use of music, it brings alive a grounded life of two very different people trying to live their life together. The experience of watching this film is going to be sad, there is no doubt about it, but it doesn't mean the movie is all gloomy because there are some moments in the film that'll have you humming with its tune without you being aware of it.The performances by Johan Heldenbergh & Veerle Baetens as Dieter & Elise, respectively, is absolutely riveting. Elise is a religious realist who works as a tattoo artist. Dieter is a romantic atheist who is a banjo player in his bluegrass band. The film makes use of flashbacks to tell how these two people with vastly different views find love for each other while the present time of their lives show a depressing moment in their lives where each of them is going through a very tough time due to their daughter's illness. Since they dominate the screen throughout the film, the chemistry between the two actors needed to click & it turned out to be very good indeed as both have done a fabulous job at it.On an overall scale, The Broken Circle Breakdown is a wonderful film to come out from Belgium and is one of that nation's finest film in years. The issues it deals with, including the little conflicts between religion & science, are pretty universal and easy to connect with. Plus, the entire plot is so efficiently propelled by its remarkable music that it's arguably the finest use of country songs in a film. The scene ordering is messy & poorly done and might become challenging for its viewers, but all in all, The Broken Circle Breakdown is a really good film that fared much better than what I was expecting from it and is definitely worth a watch.",
            "review_date": "2014-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Romance that even a single can feel for",
            "content": "The movie is beautifully done. Every emotion comes naturally nothing is forced. You appreciate the subtle script lines. There is enough conflict, passion, and love for you to move with the characters through the plot. *******************************************Spoiler****************** **********The ending is not your conventional love story ending. However, it is original and authentic. I will not guarantee that you will love it but you will be moved one way or another. The tragedy builds up the character and eventually the plot. Action is character. *******************************************Spoiler****************** ********** It will make you appreciate BlueGrass Music. It is quite underrated for how powerful the movie is. It's a movie that progresses without any of the characters saying \"I love you\". It's spoken in action and stares. Action is character. For every fallout they have in words there actions are always 'speaking their true intentions'The title is The broken Circle Breakdown which sounds redundant but it describes the movies chronological order. We cycle through the events. We go back then forward then back. The cycle is broken until it breaks down. If you let it be, this movie could redefine your enjoyment for the subtle things",
            "review_date": "2017-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good Music and Sad Story",
            "content": "To appreciate this film, you will need to have a liking of bluegrass music, because it used frequently throughout the entire movie. The back story is extremely depressing, as it deals with a seven year old girl with cancer. Mom is a tattoo artist with plenty of ink covering most of her body. Dad is a banjo player and singer with a band performing American bluegrass music in English. The dialogue is completely in French because the film is from Belgium. The soundtrack is excellent, but the trials of Job visited upon the mother and father are overwhelming. I felt a similar emotional reaction recently while watching 12 Years a Slave. While both are worth watching, just be prepared to emotionally exhausted by the time the closing credits roll. A solid 8/10.",
            "review_date": "2014-04-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A sure bet to receive an Oscar nomination for Best Foreign Film",
            "content": "¨Bluegrass, that is Country in its purest form.¨Your musical taste for Bluegrass Country music could affect how much you enjoy this Belgian melodrama, and for me it worked really well because every time the narrative structure began feeling a bit forced the soundtrack saved the moment. Perhaps I would've enjoyed this more if I hadn't seen Blue Valentine, but so many elements from that movie seemed borrowed here by Belgian director Felix Van Groeningen. It has a similar narrative as the story is told in non-linear fashion focusing on a couple falling in and out of love. What did work really well here were the two lead performances who made every dramatic moment seem very real and authentic. They shared an incredible on screen chemistry without ever overdramatizing their scenes. They also did their own singing, and they have incredible voices so that drew me in as well. Some of the dramatic scenes were really sad and the film also touches on some very heavy handed themes, but they work thanks to the performances as well. It is a touching film that will pull on your emotional chords and it can be a bit too preachy at times, but I still enjoyed this film despite its flaws. By the way, The Broken Circle Breakdown is Belgium's official submission to the 2014 Oscars for the best foreign language film category. It has a shot at being nominated, but I don't think it will win. I think the two lead actors deserve more recognition than the movie itself. The plot centers on the relationship between Didier (Johan Heldenbergh), a cowboy banjo player for a bluegrass country band, and Elise (Veerle Baetens) a tattoo artist who has her own shop. The two meet and quickly fall in love, but the film cuts back and forth between their relationship when they first met and then seven years into their relationship as they deal with their daughter's (Nell Cattrysse) illness. Both deal with this tragedy in different ways, which eventually begins to shake their apparently steady and strong relationship. The story jumps back and forth as we see the couple falling in and out of love. The entire film centers on this couple and everyone else around them is barely significant to the story.Veerle Baetens and Johan Heldenbergh give very good dramatic performances and their characters are given much substance. They carry this film and keep our attention even through some forced moments where the story seems to lose its balance. Didier is an atheist, but he loves America and is obsessed with bluegrass music. He finds it silly and offensive to think that people actually believe in religion, but at the same time he sings gospel songs like Over in the Gloryland and Where the Soul of a Man Never Dies. Then all of a sudden after he experiences some deep tragedy he begins to rant on how stupid people are for having faith. This isn't a complaint I have with the movie, as much as I do with his character, but I just don't understand why people wait for some personal tragedy to hit them to then all of a sudden begin caring for something. It just shows how selfish we really are because until it hits home we didn't even think about it. Now all of a sudden, the culture he has always loved is full of people he hates because their faith hasn't allowed stem research to develop as quickly as he would've liked. The way Didier deals with grief just made me dislike his character, but I guess the writers wanted to include this to make this some sort of science versus religion story. I thought it just became a little too heavy handed and preachy when it could have focused more on the soundtrack and let the music touch these characters since it was such an important part of their lives. In my opinion the performances and the music saved this film and got it through some of those difficult and clichéd scenes. The Broken Circle Breakdown is still a very good dramatic film and one I recommend.",
            "review_date": "2013-12-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Utter sadness...",
            "content": "This is a movie about complete and utter sadness, but still so beautiful. It made me sad, it made me want to listen more to the music (I don't even like bluegrass) and it made me think about it afterwards. It's a movie about a love story, a unbearable sorrow and life. Music guides us thru it all. Too sad but still very much a movie worth the time. Movies from Belgium never reaches my view but this one did, and I'm glad.",
            "review_date": "2017-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lump in my throat",
            "content": "No spoilers here! Please go watch this beautiful Flemish masterpiece without learning anything about it's plot beforehand. The Broken Circle Breakdown is a very realistic, vulnerable and heartbreaking movie. The acting is second to none and I was completely overwhelmed by the convincing story. I don't think that even the most emotionally blocked person would not feel a lump in his or her throat at any time during this movie. I couldn't stop myself from shedding some tears, nor did I want to.Warning: I had a pretty big dislike for Bluegrass music before watching the Broken Circle Breakdown. This movie completely turned that around!",
            "review_date": "2013-03-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Memories Dwelt On",
            "content": "Two bluegrass musicians meet, fall in love and wrestle with their emotions as their daughter is diagnosed with cancer in this compelling drama from Belgium. Johan Heldenbergh is excellent throughout as the very emotionally torn husband and the film utilises music interludes very well, but it is the non-linear structure of the film that stands up best as the film plays out a more a stream of consciousness tale than a traditional narrative, as if the whole film is Heldenbergh's own personal reflections on his life. The ups and downs of his tale also benefit from the film taking place out of order; they are more enthralling and tragic knowing what is to come. The politics of the film are, however, very heavy-handed, and with quite a bit of speechmaking and angry rants on Heldenbergh's behalf, his grief is sometimes uncomfortably pushed into the backdrop. While hardly the happiest film ever made, it should perhaps be noted that 'The Broken Circle Breakdown' is not quite as bleak as all that. There is ample time spent on his happy moments to the point that one can see the film about cherishing good memories and trying to not let bad memories overpower them. The film finds an excellent child performance in Nell Cattrysse too. The scene in which she refuses to let go of a dead bird, realising that it could very well be her, is absolutely heartbreaking.",
            "review_date": "2017-04-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Powerful Drama With Beautiful Country Music",
            "content": "The film feels like jumbling through shuffled photographs that hold bittersweet memories. Non-linear narrative has become more recognized device to sketch a contrast change in a relationship. It's an effective device which makes it easy to tell a story with a sense of tragic irony. A film that followed this style in my recent memory is 'Blue Valentine'. 'The Broken Circle Breakdown' tells a story of a couple trying to deal with the sickness tragedy of their leukemic child while jumbling through their past. The scenes with this sweet child girl feel most honest, and hence deeply moving. It has one of the most hard-hitting and realistic scenes of post-traumatic stress in a relationship I've seen in films. The film is helped by some fine performances by its leads, and country music is a driving vector of this story. But the film is at its disadvantage because of distracting, and sometimes incoherent, editing. You're shifting from a moment to another moment. Some stick with you, and some don't.",
            "review_date": "2013-09-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My rating: 8",
            "content": "Bravo on European cinema. It showed its look over the things in life, the actual ones, bioethical ones. This rating is probably too high but what - stimulus should be given continuously. We stimulate impulses that make pulsations and life.My overall impression is that I am a bit confused of all the themes that were in the scenario. A movie that my mother no doubtfully will like because it is deep enough and shows one possible life scene. But we have seen the theme about the jinxed love before. The protagonist tell his story so well that he tired her. I doubt that one knows how he will react if something like this happen to him which I do not wish even to my enemies.Modernly pictured. Aahm, good play. Of, I guess, not that well known actors. However, one of the three finalists of the European Parliament.In some tribes in Brazil people still believe that if you want to make nature more like human, meaning its conquering, one has to have a tattoo. This is the way of becoming your own master and later you give back to nature something more good. I am not agree. For the level of thinking is completely understandable, that is why I am skeptical to drawing your body.http://vihrenmitevmovies.blogspot.com/",
            "review_date": "2014-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A powerhouse of a film",
            "content": "A movie like this just makes you say wow. This movie was made with so much heart, so much passion, this movie was like watching a chapter out of somebody's life.It was so realistic and so true to life, on so many levels, you just don't see movies like this very often. Granted, this was not an easy movie, it was very, very strong and a very difficult story, but the music kept the movie alive. The music was the heart and soul of the movie and the music was gorgeous, uplifting and fantastic, and this is coming from somebody who is not a Bluegrass fan.Regardless, I could appreciate the beauty of the music and the beauty of this film. It is a stunning piece of work, and I highly recommended it.Hollywood is incapable of creating this kind of reality. Not enough courage.",
            "review_date": "2021-08-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Deep Paradox",
            "content": "There's a paradox or dissonance that lies at the core of this film: on the one hand, Didier is passionately in love with America's bluegrass music; but, on the other, that very same music is imbued with a religious fervor and vision of the world that he rejects equally passionately. Throughout the film we see him refusing to accept any interpretation of the happenings in the natural world (whether coming from his wife or his daughter) that has the odor of religiosity--only a non-sentimental, scientific explanation will satisfy him. And at the same time we see him singing with soulfulness the lyrics of songs sung by Bill Monroe and the Carter family, all of whom were deeply religious folks and whose songs expressed that religious devotion. It's no coincidence that this dissonance is framed by a story of great personal loss and tragedy. The explanation given by science for why we suffer such loss is pale and offers little-to-no solace to the bereaved. This doesn't mean we must accept the tales religion tells us about such loss: \"Such is God's inscrutable will and we can look forward to a day when we will be reunited again\" (the family circle will be unbroken again). When people are \"wild with grief\" and hunger emotionally for the kind of comfort only \"the eternal\" can bring (Thornton Wilder), our vocabulary shifts from rational, scientific discourse to the holy, a discourse better suited to what is ineffable in the human experience. And so we see Didier turn to the religious vocabulary of discourse found in bluegrass lyrics as a kind of salve for his afflicted spirit--without, for all that, the suggestion that he has laid aside modern science.",
            "review_date": "2014-04-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My One Problem With This Movie",
            "content": "I don't want to say this is a terrible movie, because it isn't. It's heartbreakingly sad & the beautiful music - apparently really performed by the actors - was great to watch.After the big crisis in the film, the two leads suffer, & there's supposed to be dramatic tension because the male, Didier, is a \"romantic atheist,\" while the female, Elise, is a \"religious realist.\" (These are not my terms, they're from the summary - Elise doesn't appear to me to be terribly realistic, nor does Didier seem all that romantic.) Neither apparently communicates too well - Didier seems to wait until he's pent up to express himself, while Elise is - well, we just get a handed-down family heirloom crucifix necklace to establish her religiosity, but it's not entirely Christian, because she apparently believes the human soul can transmigrate into a bird. Didier has one scene where he yells at an audience about Christian fundamentalism that's the biggest reveal we have about his anger toward people of that faith.Except. The title of the movie is \"The Broken Circle Breakdown.\" From the old folk song which insists \"there's a better world awaiting in the sky.\" Didier is apparently steeped in bluegrass music, which, like country, has deep roots in American Christianity. I've known folks whose interest in the music has led them to reconnect with their faith. It's that powerful. & for many, it's the passion of the faith - certainly it's there in Bill Monroe, Didier's idol - that shines through the music. Are we supposed to believe that Didier has either missed this, or ignores it, to such an extent that songs about faith & the afterlife don't anger him the way George Bush's fundamentalism does?It's baffling. & it's something that surely he would have noticed in the course of his obsession with bluegrass.Because it seems impossible to me that someone so immersed in the music wouldn't at least have to discuss - at least with him or herself - the religious themes present in so many of the songs they're going to listen to or perform. That the movie seems unconcerned with this is a great fault, & one that kept me from thinking that the characters were truly three- dimensional.",
            "review_date": "2014-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "True worthy of an Oscar nomination",
            "content": "A Belgian masterpiece___Depressing depiction of a broken family circle. Everything around a sweet, happy family, that comprises a country band member, a tattoo girl and their little daughter, is suddenly quaked when the daughter falls into fatal cancer. Consequently their relation, their love, their happiness, their belief become endangered. Concrete acting from both protagonists. Heartfelt country music soothes everyone.Kudos to the director. This movie is true worthy of an Oscar nomination which they earned.",
            "review_date": "2014-06-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tragic story told superbly through musical beauty",
            "content": "There are basically two sides of this story that blend perfectly to make this a fantastic movie. First and foremost, the musical theme that shadows the whole movie was the highlight and produced, by far, the scenes that had me more excited. Then there is an emotional power behind these characters that not only elevate the contradictions, but also the reasons that led to their love. Everything about the movie is closely connected to America and its musical culture, namely Blue Grass music. Ranging from the beautiful and melodic voices to the lively instruments, the songs are an integral part of the plot, as they not only are in tune with the characters, but also provide a sort of break after a more serious scene. Drama is also an element that is certainly not forgotten and all the moral complications that the film shows leave you wondering and questioning your own point of view. The Broken Circle Breakdown is a picture that had me nearly sobbing at some scenes, while maintaining a light sensation that in the end left me with a smile. Criticise if you want, but the only movie I can think that is similar in this aspect is Forrest Gump. A mixture of Drama and some happy musical numbers is always welcome in my book, and this movie was a refreshing way to experience this.Rating 7,5/10",
            "review_date": "2014-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brutally Heartbreaking",
            "content": "Sometimes foreign language films can be surprisingly moving because you're forced to engage more with the facial expressions and unspoken acting than you would with your native language based films. The Broken Circle Breakdown is exactly that. Heartbreaking, relentlessly emotional, and undeniably honest, you never feel comfortable watching this film and are constantly challenged to feel some sort of happiness with the dread that's happening on screen. Although all these things are true, I do feel like there wasn't enough explanation of what the point of all this was. Or just simply, what the film was trying to say. Is it just telling us that amidst all that's good and lovely with the world is an insane amount of sadness and despair. And I guess that's fine, but I could have used a bit more depth.7.5/10",
            "review_date": "2018-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Touching nerves",
            "content": "The movie is a drama, that depicts love, life and illness. It's not an easy view overall, the drama is heavy, but there are more than a handful uplifting moments. What is either attracting or distracting though, is not the music (which you'll either love or hate I guess), but the time-line construction of the movie. So while a \"movie of the week\" would go traditionally about this and tell everything in a fine structure, with beginning, middle and end, but this movie mixes it up. Something to keep in mind.The movie does have nudity and intercourse, but before you go shouting and yelling about it, there is a reason behind this, which enhances the drama and is telling a story. The structure might not be your thing, but it helps elevate the movie beyond your usual drama. The actors are really good. Depending on your mood, this is something you might wanna give a try",
            "review_date": "2014-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Love, Loss and Bluegrass",
            "content": "It may have taken a while for The Broken Circle Breakdown to reach Australian cinema screens, but it was most certainly worth the wait. This Belgian film is a powerful warts-and-all treatise on the power of love, both as a force of great joy and as the catalyst for the events in our lives that cause us the most pain. Following a slew of award wins at festivals around the world, the film was nominated for the Best Foreign Language Film at the 2013 Academy Awards (where it somehow lost to The Great Beauty) and it is easy to see why this story has found so much favour with festival audiences and critics alike. This is the heartbreaking love story of Didier (Johan Heldenbergh), a banjo player in a bluegrass band, and Elise (Veerle Baetens), the sexy, vivacious tattoo artist for whom he falls head over heels.Our couple settle into a life of domestic bliss in a ramshackle caravan situated in rural environs somewhere near the Flemish city of Ghent; a picturesque setting in which chickens wander aimlessly around the yard. Soon enough, daughter Maybelle is born and the relationship between Didier and Elise only seems to strengthen as they embrace parenthood and set forth on repairing the dilapidated house that Didier has neglected for too long. However, happy families and home renovations do not an engaging drama make and when Maybelle is diagnosed with cancer, the relationship between Didier and Elise becomes strained. The tension in the story escalates but, despite claims to the contrary by some, it never drifts excessively into the melodrama realm because nothing seems exaggerated and the characters are far from stereotypical. Most movies that deal with cancer are sickly sweet and overly simplistic in their handling of such scenarios, but not on this occasion. Superb performances, particularly from Baetens and the young Nell Cattrysse as Maybelle, imbue the film with a sense of realism that makes you forget these are just characters; you feel as though you are watching real people. Director Felix van Groeningen has created an intimate world in which our connection with the family is palpable. Heldenbergh, who co-wrote the play from which the film is adapted, plays Didier as a stoic, quietly spoken musician whose personality is at odds with the much more outgoing Elise, her body adorned with tattoos that symbolise her life thus far. Despite their differences, the relationship works and Elise soon finds herself part of the band, bringing a new dimension to their concerts.The film opens at the hospital when Elise and Didier learn that Maybelle has cancer. Next, we are privy to the moment when Didier first takes Elise home to his country compound and, from this point, the story continues to skip around in time, jumping forward and backwards to slowly reveal the full sequence of events. The decision to present the narrative in a non-linear style is a challenge at times, with fantastic editing seamlessly melding one scene into the next, even though they may be set months, or years, apart. In the end though, it all comes together beautifully. Set in the early years of the 21st century, we see the twin towers attacked on television at one point and it is George W. Bush's decision to prohibit stem cell research - which we also see via a television broadcast - that sends Didier into fits of rage that serve as a renouncement of his love affair with America. The bluegrass music, presented via a series of terrific concert sequences, is fantastic. Although the songs – all of which are performed in English - may reflect upon the sorrows and hardships of life, they never feel depressing or downbeat in the hands of this motley group of musicians.It is rare to find a film that is dramatically, politically, emotionally and musically rich, but The Broken Circle Breakdown delivers on all fronts. Whereas Joel and Ethan Coen preferred to parody such musical styles and sensibilities with O Brother Where art Thou?, this film takes a much more reverent approach. This is a soul-stirring drama rich in heartache that never tries to accommodate genre tropes or audience expectations. This is a film about love but it is also a film about faith, with Didier particularly strident in his beliefs regarding god and religion. Whilst this is that very rarest of beasts in that it is a love story worth watching, it is much more than that. The Broken Circle Breakdown is just a fabulous film in every respect.",
            "review_date": "2014-05-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sexy Drama",
            "content": "This is a very expressive but believable sexy drama that attracts you from the beginning. The language in which feelings and emotions are exposed is rich as well as effective: the movie gets to you in many different ways. Its musicality makes it a very vivid film.\nThe plot is about a passionate relationship in an environment in which the cult of beauty and pleasure is professed. The charm of the main characters, the lifestyle of a couple who have it all worked out, who are happy, seduce you from the first minute.\nBut as the movie goes on the vertigo seizes you as much as them; the feeling that things can break down at any moment, that they can only get worse, that glory is not forever, increasingly cause a lump in your throat.\nThe movie follows an almost-circular narrative structure, placing the sacrifice in the middle of the footage.\nAfter enjoying so much passion and beauty the tragedy hurts more.\nThat's when catharsis happens: A sea of tears with bluegrass playing in the back.\nThank you for such a beautiful and pleasant drama.",
            "review_date": "2018-02-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Highly overrated, deeply disappointing",
            "content": "So many things wrong with this film. Where to start? The script is weak to begin with and I'm surprised that so many people worked on something that resulted in this mess. Maybe too many cooks? Perhaps. When you see the director writing the script, you start to wonder a little, but when the lead actor has a hand in the script, it's a serious red flag.For one, they could've cut it better. The story does not need to be linear. For example, they could've shown a flashback of Elise moving furniture out, making us think that she's moving out, only to reveal that she's making room for the baby's room. Then show us the current time of Elise really moving out. Smart editing tricks like that. Events that trigger flashbacks and past-present parallels.Then there are inexplicable things in this film. Didier rants about the US cutting spending on stem-cell research. Elise should've just told him that the US is not obligated to save a Belgian baby or spend money on cancer research. It is their country and their money. It doesn't matter what their reasoning is, whether it is Jesus or Santa. Europe is not a third world backwater. Elise should've told Didier that if he wants to research stem cells, he should perhaps study science rather than play in a band.The child's battle with cancer is not explored. The child faced a dead-end with treatment. We could've seen something like this:It would be better for the film to show something like this: Child: \"I'm done. I want out. I can't take this anymore.. I won't get better.\" Dad: \"How do you know you won't get better? You don't know that.\" Child: \"The same way you know there is no God. I just do.\"Didier wants his child to keep on believing and hoping when there is no doubt that death was imminent. Show him as a hypocrite who wants the child to believe in an unrealistic and impossible future but not an afterlife. If the child shouldn't believe in a life after death then how would she believe in ever seeing an 18th birthday when science says that won't happen? Didier's hypocrisy is never explored.The parents' blame game was not explained. When Elise screams at Didier for his family having cancer genes he says nothing. He doesn't tell her \"I told you I didn't want a baby. You insisted.\" This is all true, so why didn't he say it? She wanted a baby with a man with cancer genes. He told her he didn't want one. How can she yell at him for the child getting cancer?Elise, the mother, drank and smoked while she was pregnant. Didier started drinking heavily near the end of the pregnancy and when Elise was in labor. Why not show these things? Why do we get this information through dialogue?The news shown in the background could've been handled much better. In this film we first see news of 9/11 and the war on terror, which Didier ignored. Then we see the ban on stem-cell research which incensed Didier. It's too contrived. Didier's kid gets cancer, there's no hope but stem-cell research, then he turns on the TV and guess what? Bush banned stem-cell research. What are the chances?A better way of showing all these things is to simply rearrange them. We see the war on terror and Didier is indifferent because it doesn't affect him. We then see Bush ban stem-cell research on the news and Didier is indifferent again because his kid doesn't have cancer and this means nothing to him. Then he hears of stem- cell research and discovers that it has been halted. Then he gets angry. Then subsequent news about the war in Afghanistan or Iraq would incense him even more, than money goes to death rather than saving lives. Make him a hypocrite, make him flawed. He didn't care about the halting of stem-cell research or the wars before, now it's all he talks about. The rearrangement would've told a better story without adding anything new.But the film is clearly on the side of Didier, rather than a neutral look at the situation. The conflict between secularism and atheism in this film is not linear. Didier is angry at the Catholic church and certain American denominations (condoms, abortion, stem-cell research) but takes out his anger at his wife who believes in her own religion of reincarnation (her child could come back as a bird or star). He groups all faiths together, but that makes no sense. People that believe in reincarnation of children as birds are not the ones who halted stem-cell research. Ranting at Belgians for the actions of Americans is like screaming at Indians for Japan's actions in WWII, or ranting at a Muslim belly dancer because of the Taliban's dress code or ranting at a Belgian director about this year's Oscars. Belgians, Christians or not, had nothing to do with the election of Bush or stem-cell research. Didier is in an imaginary war against all faiths because his daughter died and the film presents him as somewhat reasonable by not having anyone challenge his beliefs or arguments. They are presented as valid. Some religious folks in one particular country stopped stem-cell research. Other religious folks in the US did not. The rest of the world had nothing to do with it either way, especially ones that believe in reincarnation-as-birds whose religion has nothing to say about any kind of research whatsoever. China, Japan and India are also religious and have non- rational belief systems. They're still doing lots of research. Why can't he see that? Oh, because it's not relevant to the plot.A highly-contrived religion vs secularism story filled with massive grouping of unrelated groups together, false equivalence, collective responsibility, etc.",
            "review_date": "2017-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rage against the \"Deus Ex Machina\" . . .",
            "content": ". . . for NOT showing up--twice! Belgium blue grass singer \"Didier,\" the main character of BROKEN CIRCLE BREAKDOWN, has his heart in the right place. On first meeting the tattoo artist who will become his wife, he bubbles, \"I've been crazy about America all my life; it's the greatest place on Earth!\" It turns out there is one fly in America's ointment for Didier and wife Elise: George W. Bush. \"Mr. 9-11\" (CNN clips are shown of GWB \"conquering\" his rubble pile) uses extremist religious dogma to sabotage medical research, which Didier feels causes the death of a loved one. (The Belgiumers should consider requiring concrete cemetery vaults--as most of the U.S. does--since it's not only unsanitary, but also depressing to be shoveling mud onto a virginal white casket during a graveside memorial service.) However, instead of railing against Bush by name during his band's big break in a cavernous concert hall (following the lead of Michael Moore collecting his Oscar for Fahrenheit 9-11), Didier slams God for 10 times as long as Moore was allowed to rant against Junior. (Didier can do this since Belgium concert goers are much more polite than geriatric rich Red Staters.) Didier's misdirected anger results in the remainder of his \"circle\" breaking. Though film experts NOMINATE the \"best\" foreign films, most of the voters are wealthy elderly conservatives. No wonder there was a breakdown in BROKEN CIRCLE's final Oscars tally.",
            "review_date": "2014-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Roller coaster of emotions",
            "content": "It starts in June 2006 Ghent, Belgium. Elise Vandevelde (Veerle Baetens) and Didier Bontinck (Johan Heldenbergh) have little daughter named Maybelle suffering from deadly cancer. Seven years previously, they start a relationship. She has lots of tattoos and a tattoo studio. He loves American bluegrass and plays the banjo in a bluegrass band. The audience watches the relationship develop as it goes back and forth between the two time periods. Then it is rocked to its core.I see that some people object to the turn with him railing against US stem cell politics and religion. I'm not a fanatic against controversial subject matter but I understand other people's objection. Others may also be thrown off by the sharp turn of subject matter. Personally, I saw it as the anger stage in his grief. His rants are just his uncontrolled anger. The only thing that truly caused me problem was the 9-11 on the TV. It's been done before and only gave people who are offended by the later anti-Bush rants a place to cling to. They should have cut out those 2 seconds.It's a roller coaster of emotions as tragedy strikes the family and also the nature of the back and forth structure. The leads have a compelling chemistry. He's got his beard and she's got her tats. I think they could have more screen time with the kid. This is an interesting European film about lost and relationship. It's a little film that's worth watching.",
            "review_date": "2014-06-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Warning!",
            "content": "This is not a \"date movie\". This is a movie you should see alone.The title of the movie hints at something being \"broken\". The \"circle\" is a symbol of infinity; it is also a symbol of a wedding ring. A \"broken circle\" is a broken wedding ring; a broken love affair. (2) and, a \"Circle of Friends\". Thus, when a friend dies, \"The circle is broken\" when the friend \"departs\". The writer is clever to use this symbol which in turn comes from a famous blue grass tune name: \"May The Circle Be Unbroken.\" The \"Breakdown\" part comes from another Blue Grass tune, \"Foggy Mountain Breakdown\". But \"breakdown\" could be applied to their relationship, too.The blue grass music is good, but don't expect the movie to be uplifting. Blue Grass songs often have references to \"The Lord\". They are like hymns. Conversely, this movie trashes references to \"The Lord\", magical thinking, or a spiritual relationship to a higher order. Yet, the movie uses the blue grass music as a replacement for a spiritual presence. The political message in the film is conveyed by yelling and ranting out a list of complaints against religion. This is a cheap, unsophisticated way to write a movie script, but it gets the job done in the same way that a sledgehammer \"gets the job done\".This movie will be therefore appreciated by people who are Atheists.American religious people will have problems agreeing with the political messages in it. Some reviews say this is a \"beautiful movie\". But these people show themselves in unromantic sex scenes which are soft porn: up and down and with her toes in the air! Lust; but where is the love? Where is the beauty, the magnetism? Do we really need to see everything? And this appeals to whom? The body tattoos shown are ugly; no beauty there; more tasteful, flowing tattoos on women I have seen. The bearded man appears more \"bohemian\" than \"country\" in appearance. I cannot help but see a \"Charles Manson\" in his appearance; and this is disturbing. The use of an American truck, and a stars and strips bikini does not validate this couple as \"American style country\"; a confusing use of symbolism for the viewer. Maybe he hoped to lure $$$ from the USA. But it didn't work. Total USA receipts were $7,000 according to IMDb. It was shown in San Francisco where we have all kinds of definitions (smile) of what is \"Country\".So the beauty may be in their relationship to their family. You decide if this is a 'beautiful family.' I say the use of the word \"beauty\" is misapplied.The best review by Meta Critic is by the San Francisco Chronicle author who gives this movie a \"50\". He says the movie changes from using dramatic movie scenes then \"loses its way\" and ends with a spiral down to ranting anger. The ranting and complaining is a cheap way of 'getting the message out there' without using longer dramatic scenes to explain this dated political viewpoint which would cost more film expense. I was hoping this movie might pull me through a sad voyage; and then it would lift me up in triumph at the end. No, not this movie. It dumped me down with a sad worthless, helpless ending.I should have walked out when the projectionist of the theater personally stood before the audience and warned the audience that \"the movie is really sad\" before he projected it. Boy, was he right. There were only 3 people in the audience he was speaking to.So, in short, you have Blue Grass Music; and Country symbolism from the U.S.A., Pain, Death, Failure, Anger, and accusations of trickery and helplessness at the end. This movie wrecked my whole day.If you are rich and this is how you experience sadness and tragedy through attending movies, then you can go see it. You can brush off the movie as another experience; and you can go back to your wealth and separation from the masses. But if you are not happy, and having some problems in your life, this movie will dump your sensitive spirits on the ground and it will trample any reserved, beautiful, spiritual feelings you might have for a higher being or Savior or \"magical leader\" or method.I gave this movie a lower rating because I wanted to warn others of the negativity of this movie. The poster represents \"sex affair\". But this movie is really about \"death by cancer\" and \"who is to blame.\" The Blue Grass music is just a device to try to entertain the viewer while tragic events unfold; and those events are all a spiral downward. You should also know that in San Francisco, there are new facilities for stem cell research built as of 2014.One person in the audience, of only 3 persons in total, said he really liked this movie. He was smiling. Now how could you be smiling after a movie like this. I believe that the angry message directed towards religions is what made this man smile. He's happy that \"someone had to say it\" I believe. So, he was likely feeling triumphant. But I didn't have an ax to grind towards religions on a Holiday. I wanted to feel better after seeing a movie, not feel worse for it. You have been warned. Make your decision. And have a nice day!",
            "review_date": "2013-11-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sad and very touching",
            "content": "If you are America fan or not, if you like tattoos or banjo play or not....that does not matter for liking or disliking this movie. Those are just the surroundings. What it is about is true love and how beautiful everything can be...till..life is showing it's dark and sinister side. And then, most important, how to live your life from now on...is it even possible to go on ? If out there is only darkness, if there is only tears and sadness, if I needed you.... would you come to me ? It's one beautiful movie, amazing soundtrack and some very touching acting combined in a story where I would say that only life can write it like this. I give it 9 points out of 10 but beware...it is really a sad movie, beautiful somehow, but sad.",
            "review_date": "2014-05-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant filmmaking but over hysterical tone",
            "content": "Flemish films are rarely seen outside Belgian Flanders, Brussels or the Netherlands. So when the opportunity arises to see one, what other choice is there but to jump at the chance? As you can imagine, I heeded the call and what happened...: I found myself torn by the pangs of split personality! In other words, \"Alabama Monroe\" made me at once discover a director I liked and be... repelled by the product of his efforts. Paradoxical indeed! Not that I totally rejected the film. Particularly not in its lively first part...but, let us get things in the right order. What struck me first is how gifted the filmmaker, Felix Van Groeningen (\"La merditude des choses\"), actually is. Among his qualities, let me mention his brilliant camera work (always close to the characters), the peerless actor's director he proves to be, the very effective use he makes of the bluegrass music (played live and subtly punctuating the action), as well as his impressive mastery of editing (with startling time warps in the past and even in a near future). No doubt about that : Van Groeningen is a master in every department of his art. He must also be credited for his ability to cast the right people in the right place, particularly the ones embodying the lead couple : you can be sure about one thing, no one else could have been a better Didier than the wonderfully cool Johan Heldenbergh, or a more irresistible Elise than Verle Baeten, in turns the most sensual of lovers and the most pathetic of grieving mothers. Both give their all to their role and as if that was not enough, they sing and play music beautifully.This said, how come my impression on \"Abama Monroe\" is negative? Well, to be fair, I did not dislike the WHOLE thing. I can even say I adored its first part. The potent mutual attraction of the two characters, their shared fiery passion, their common love of music and all things unconventional is really infectious and did carry me away. The trouble is that when misfortune rains down on them, it is not by halves! Granted, what happened to them is far from rosy, Maybelle, the fruit of their love being affected by cancer, but making the second half an uninterrupted spectacle of Elise and Johan's terrible suffering, bitter disagreement, heated arguments and final estrangement is a disputable choice. For now the film has become indulgent, dwelling exclusively on the centrifugal force that violently pulls the couple apart. And three words come to me: Enough is enough! As a matter of fact, Van Groeningen seems to have forgotten that to really move the viewer, there is nothing like modulating the tone. It is a known fact that remaining on a single note rather generates annoyance than emotional appeal, which someone like Valérie Donzelli has perfectly understood. Unlike \"Alabama Monroe\", her \"La guerre est déclarée\", the film she made on a similar subject (a loving couple put to the test by their child's cancer), managed to remain in constant balance. Cruelty, suffering, outcry there was naturally, but also a touch of surprise, of humour and even of incongruousness. French director-actress deftly avoided bathos by refusing to add misery to misery, pain to pain, yelling to yelling. In the second part of Alabama Monroe\", it is just the contrary, so much so that, two-thirds through Van Groeningen (otherwise excellent) film, I couldn't stand it any more and begged for mercy!All in all, it is this final bad impression that actually accounts for the paradoxical statement I made at the beginning of this commentary. And I repeat it: \"Alabama Monroe is a good film I dislike\". Which will not prevent me from viewing other works by its talented director. In a more mellow tone, with a more balanced approach, I may even think another of his films is a masterpiece.",
            "review_date": "2016-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "European directors get it!",
            "content": "Merging of photography, sound mixing, and film editing have rarely been done as well as in this film. Even Tarkovsky would admire the ultra-slow close-ups. Audiences would never suspect they occurred. Film students should consider this movie as Lesson No. 1. They will likely never know how it was done, but it's goals they should be shooting for. Why was this submitted as \"best foreign language film\" for an Academy Award? It deserved submission for \"Best Picture\".Directors Wim Wenders, David Mackenzie, John Maclean - and now young Felix van Groeningen - have nailed the persona of the non-urban United States with rare insight and talent seldom seen from American directors. Ancestors of those European directors did settle the regions of America, that their heirs are now brilliantly depicting on the big screen. They reveal warts and all, often with humor, satire, and lush visuals.Cinematographer Ruben Impens presents unique images with camera angles, movement, and timing that stick in our memory. If this movie reflects current Belgian cinema, we're all in for some special entertainment in the years ahead.",
            "review_date": "2019-05-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Difficult to not be deeply touched",
            "content": "Something this movie was criticized for is the fact that there is tragedy after tragedy and that the suicide is the tragedy that is just to much . But i think people criticizing this movie , totally miss the point. The incredible think the director and the actors achieve is that even though there is so much tragedy in the movie , it is not a negative movie, on the contrary it shows how love can be , and i got a feeling of happiness of being alive and able to live. Even though there is so much death here , in my opinion it shows the beauty of life and how to live it as you want to live it. And the music fits so perfectly it gives the whole movie something positive , i got the feeling that the music always goes on , and that it can be optimistic , even considering bad circumstances",
            "review_date": "2014-02-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Total Eclipse Of The Heart ..",
            "content": "Like \" Silver Linings Playbook \" , \" Blue Valentine \" , \" Eternal Sunshine Of The Spotless Mind \" .. etc, this belongs to one of the most rare genres of movies that a few appreciate .. This is true love ,life,loss,regret,emotional disturbance, choices, pain, reality, stereotyping and decisions with their deepest core explored:1- Love is much more than what we hear about and fantasize.2- Loss is unimaginable, especially the loss of a child who you saw with your own eyes going through a lot of pain. Life between people after loss, even the ones with the most romantic stories ever, is really challenging, and we can imagine the \" loss \" theme here as anything, maybe it's the death of a child, maybe a mental illness, maybe a disability or an accident. Choosing to go on is never easy and requires a lot of patience and strong will. 3- We can see in the movie how life throws you in all this, and it would be really sad and depressing if you throw more at yourself and choose not to fight back.4- Acceptance and all the feelings coming with that. 5- Exploring the \" beliefs \" theme. What stands out is that it doesn't try to manipulate you into thinking that something is right or wrong, it just takes you to the most profound questions a lot of people have wondered about, sincerely and without alterations. 6- Applause to a movie that finally, could show the American policy - policy and not society or people- for what it really is: \" Technology for killing people knows no bounds, but technology for curing people is a different story\". It might be the land of freedom for a lot of people, but this story has a couple of neglected sides. The Republicans' history, the crimes in the middle-east and a lot of stupid laws passed are a live witness on what the American policy has helped the world to reach.7- The reality factor was so strong, raw and gripping and this is something rarely depicted in American movies. I've seen a lot of American movies with nudity and profanity, but never have I seen one that showed a chubby woman or a man with broken teeth or anything nearly like that, because they are so obsessed withe the \" perfectness \" of everything, which is basically an illusion, because nothing's perfect and beauty is in the eye of the beholder !!I would do a strange thing and recommend this to anyone who has ever thought about committing suicide or knows someone who has suicidal thoughts .. Yes, it's too much to handle on the emotional level, but it gives you so much to fight for when you see giving up and suicide from an outsider's viewpoint .. There's still too much beauty to let go ..This movie could be about so much things, the director and the writer could have made it about religion or differences or thinking, but they chose the right decision, which is only use a glimpse of each and how they would affect the main storyline .. Unbelievable performances from the actor, marvelous direction, amazing editing and great music. Thanks to everyone who participated in this. The movie is Belgian, it was nominated for an American award and I'm an Egyptian, and it somehow could touch us all and play at the most delicate heart strings ..",
            "review_date": "2014-03-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A great (and musical) story about difficulties of life.",
            "content": "I really liked this one. The movie does a great job developing (and executing) its own plot in a very interesting way. Now, let's get one thing out of the way first: YES, there are quite a few songs in this movie, but don't worry, this isn't like Moulin Rouge where the songs are piled up one after the other without coherence, this songs are GOOD, both well played and well blended within the plot (with the exception maybe of a single scene towards the end of the movie that I though was a little out of place). Being an atheist myself, I went to see this movie MAINLY because I read it was about how religious and non-religious people cope with certain problems. While that is true to some extent, the movie itself is about relationships, family, how people (religious or not) deal with certain things and the consequences their actions have. Sure, it has some scenes regarding faith and god (especially a certain speech) but the real focus is in another place.",
            "review_date": "2014-01-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "That Circle Is Universal. ♦ 73%",
            "content": "The underlying message on religion involved in the happenings in the plot of this film is a strong factor. The breakdown sequences & chemistry are stronger. But the country music is strongest.The tale has been told before on how cancer can affect lives. But, with a non-linear screenplay, the makers take it to new level. It is more like a montage of two things: filmed sequences & band performances. The latter is as powerful & message-driven as the former. While the former is drama, the latter is pure music.The performances are great & I believe the cast is perfect, too. How religion also plays (still a lot) a role in our decisions (which reminds me of Ireland's anti-abortion laws) is the main theme in the second part. The screenplay, I say again, is very good. With fine direction & camera work, TBCB is a sure winner. Indigenous. But Oscar looks hard.It concentrates on the emotions when maladies attack and how breakdown is an option. The ideologies involved are food for thought.BOTTOM LINE: A very fine film which is both calm & chaotic at the same time. Recommended! Give it a go!Can be watched with a typical Indian family? NO (Sex/Nudity)Profanity: Mild | Vulgarity: No | Sex: Very Critical | Nudity: Very Strong | Porn/Violence: No | Gore: Mediocre | Smoking/Alcohol/Drugs: Mild",
            "review_date": "2013-12-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great family drama",
            "content": "This Belgian production, nominated for Best Foreign Language Film Oscar, is one of those great human dramas, the kind that believes in scenes tragedies (separation, accident, illness) and greater representation of human depth. The story revolves around Elise (Veerle Baetens) and Didier (Johan Heldenbergh), he is a romantic musician and she is a owner of a tattoo parlor. Despite the differences, the relationship works well and they have a daughter, Maybelle (Nell Cattrysse). At six the girl is seriously ill and the family is destabilized. Both Bohemians do what they can, but the child's situation is very serious.",
            "review_date": "2016-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Romance Meets Reality",
            "content": "The new Felix Van Groeningen's film, \"The Broken Circle Breakdown \"\" is a touching love story set in 2006. The story takes place in Belgium where our star crossed lovers are coming together to build up their family nest replete with Bluegrass music and wine.Elise ( Veerle Baetens), a tattoo artist, lives with her bearded partner Didier (Johan Heldenberg) a bluegrass musician and their young daughter Maybelle (Nell Cattrysse). Elise is also a singer with the bluegrass band in which Didier plays banjo, allowing the couple to harmonize musically as well as romantically.This is the good life – or is it? Beneath the surface, tensions are simmering. When Elise falls pregnant, Didier freaks out, never having wanted to take responsibility for a child. But he soon accepts the unplanned surprise, and starts bricking up to turn a garden to a place for the family. a garden filled with roasters running after chickens, a place. which symbolizes their wild love turning in to a close family unit.The slide show of heavenly life doesn't last long as Maybelle becomes terminally ill and the life of romance and passion turns into blistering rows and recriminations and demons of the past seven years come out to dance. What the film conveys so potently is the scene-by-scene, almost moment-by-moment uncertainty of what will happen to the couple next.Their love has always seemed a passionate but fragile bond, and the way they stare at a slow-sinking Maybelle towards the end casts an ambiguous haze .It is hard to think of a pair of lovers in current cinema, expending less effort trying to charm their dying daughter. All of their attention is focused on her, with the rest of us as intimate witnesses, laughing and crying as they tack from coy evasion to vicious honesty and back. Van Groeningen ably uses songs to move the plot along or shape the emotional mood of a scene. There's a long and brilliant scene on the music stage, plotted like great theater, in which playing music gets interrupted by Juan's break down, sarcasm becomes a full- on domestic row, and soon we're traveling in ignorance of history, feeling the same pain as Juan felt. He makes a speech and points to his daughters death, leading to the wealthy American melting pot of religions whom blocked the medical practice of stem cell therapy.Although there are a few mentions of September 11, but displaying this tragedy in order to build up the time frame or make the movie calendar accurate wasn't necessary. Men and women trampling on each other's dreams when it fails is a brave subject for this movie to pick up on. And despite different religious beliefs and when it comes to facing the dark holes of life, can Elise and Juan ever make it?That kind of uncertainty is a scary fact of life, something most movies avoid. We prefer the magical thinking of neat endings, tidy plots and clear character arcs. \"Broken Circle Breakdown\" is a wonderful paradox: a movie passionately committed to the ideal of imperfection.",
            "review_date": "2014-03-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Effective",
            "content": "Definitely reminds me a lot of Blue Valentine, even if not as refined. By that, I mean that it feels like the story is thinner and that it seems to have less of a goal. The circumstances are even more tragic though, involving the two leads' daughter. This isn't an easy film to watch at times, but the music and the performances really elevate the thin screenplay. Some of the music here is glorious, and the two leads give some pretty strong work that is bound to bring tears to many people's eyes. The cinematography is also really beautiful, highlighting the right colors as to give emphasis to the emotions the leads are feeling. Overall, definitely recommended.",
            "review_date": "2014-08-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So much potential, but ..",
            "content": "The film tries to be a powerful emotional drama, brightened by beautiful bluegrass music. For the most part, the film really delivers on its emotional promise. Unfortunately, some of the most emotional scenes seemed to be out of the lead actors' emotional ranges. This results in an unnatural, woody feel to some of the scenes, which is more reminiscent of a high school play than an Oscar nominee.The support characters (with the notable exception of the bluegrass band) delivered bland and unnatural performances. Especially the medical and paramedical staff. This doesn't necessarily detract from the story, but it does make it harder to get emotionally involved with the film.The last negative point is that the film contains several scenes that really should have been dropped on the editing room floor, but sadly weren't. GW Bush delivering his 9/11 speech on TV is a prime example. It detracts from the emotional drama that the film tries to be.In spite of these negative points, it is a really good film. The music alone makes it worth while. Some of the cinematography is truly beautiful. And the drama, if you can get it in to, is powerful and painful.Consider yourself blessed if you don't speak Dutch -- watching the movie with subtitles will at least cover up some of the woodier line deliveries.",
            "review_date": "2014-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A good Belgian Movie",
            "content": "Hello everyone, I have just seen The Broken Circle Breakdown, a Belgian and Dutch movie from 2012. It is a drama and there are two leading actors : Johan Heldenbergh as Didier and Veerle Baetens as Elise.Didier is a musician, he plays the banjo and he is in a bluegrass group, he sleeps in a caravan close to his old farm. Elise has her own tattoo shop. He is atheist and she has a tattoo of a big cross in her neck. But in spite of their differences, they loved each other as soon as they met for the first time. Elise can sing pretty well so she joins the group. When Elise announces to Didier that she is pregnant, he is surprised but they are both delighted. Didier repairs his old farm to welcome the newborn child. Maybelle is born, we can see how they take care of her and how happy they are. But when she turns 6 or 7, Maybelle becomes seriously ill and she finally passes away. After this tragedy, Didier and Elise react completely differently. Will their relationship survive even if they are going on different paths ?I really enjoyed watching this movie. It is rare that I watch a movie from my country and after having seen this one, I will maybe change this bad habit. The actors are really talented and it's about a story that can happen to all of us. This movie was really moving and gripping and the music was well-chosen and beautiful.In conclusion, I can only recommend it to all of you but be careful, you will need tissues!",
            "review_date": "2014-10-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It has it all\u0085!! GrEaT!",
            "content": "What a movie\u0085.excellent on every level\u0085it really had a big impact, even after a few days now. Great cast and is best proof that Belgium is a main source of high quality movies.This movie made us think again about life in many aspects.Hope this movie gets the awards, this is the current update: From here, the nine films still in the running will be watched by selected committees in New York and Los Angeles the week preceding the nominations announcement on January 16.The nine films still in contention are:Belgium, \"The Broken Circle Breakdown,\" Felix van Groeningen, director;Bosnia and Herzegovina, \"An Episode in the Life of an Iron Picker,\" Danis Tanovic, director;Cambodia, \"The Missing Picture,\" Rithy Panh, director;Denmark, \"The Hunt,\" Thomas Vinterberg, director;Germany, \"Two Lives,\" Georg Maas, director;Hong Kong, \"The Grandmaster,\" Wong Kar-wai, director;Hungary, \"The Notebook,\" Janos Szasz, director;Italy, \"The Great Beauty,\" Paolo Sorrentino, director;Palestine, \"Omar,\" Hany Abu-Assad, director.The music is unbelievable, one of the best Bluegrass of this planet and not from US continent, congrats!!This is a must see!! Enjoy & think & feel it\u0085! 10/10",
            "review_date": "2013-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Movie!",
            "content": "Amazing drama movie. Top-notch acting and songs makes it even more beautiful. Different religious beliefs of the parents perfectly shown on the movie. Beautiful cinematography. Despite its (comparatively)avarage parts, the last scene where you see Elise(alabama) made tattoo of her husband's name even though she wants to be death and part of her hates him, was one of the most touching ending that i have ever seen. For Drama lovers i totally recommend.",
            "review_date": "2017-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A mixed bag but quite good overall",
            "content": "This film centres around a couple living in rural Belgium who are part of a group that sings American bluegrass music. Their lives are significantly changed once a major difficulty affects a loved one. The film is in the Flemish language.\"The Broken Circle Breakdown\" is much like \"Black Swan\" in its effect. Both films have moments of brilliance but also some major flaws while averaging out to a respectable rating.There are many jumps among time periods within this movie. In the first half, it is tolerable though occasionally confusing. In the second half, it is irritable. There are also major family events where the woman's family is absent and not even mentioned. Some scenes involving atheistic, anti-religious rants go way over the top despite being well performed.This brings us to the film's greatest graces: the lead performances of Veerle Baetens and Johan Heldenbergh. In all the stages of the highs and lows of their relationship and life itself, these performers are courageous and intense. Their performances contribute highly to the overall emotion of a climactic scene in the middle of the film - a scene which can be credited for creating genuine tears.",
            "review_date": "2019-10-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Melodrama and Pornography",
            "content": "This movie is not beautiful or touching. Rather, it is unsubtle melodrama -- a child with cancer -- interspersed with pornographic sex scenes. Yes, the music is good, but as a movie, this is not worth the price of admission, even when it's free. To fill out ten lines, I suppose I have to write some more, but the movie itself is not worth more.Since the review app is forcing me to write more, I may as well suggest some often-overlooked movies that are worth seeing: Breaker Morant (1980); Zulu (1964); In Harm's Way (1965).",
            "review_date": "2014-03-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Can life be generous at all?",
            "content": "This is my first review on IMDb. And The Broken Circle Breakdown is, quite possibly, the best movie I have seen. Ever.There is not a single scene in the movie that is redundant or out of place. The directing is superb. Acting is fantastic. The story is heartbreaking and mind-blowing. And the music...I think I know why this move didn't win an Oscar (not that I feel bad about it - IMHO it's better it didn't). All of the protagonists are genuinely good and generous people, yet they all suffer a great deal. The only evil things portrayed in the movie are - sickness (cancer) and G.W. Bush (another form of cancer) representing all of the stupid arrogance and wretchedness of the NWO.I sincerely hope that one day America will once again become the heaven of blue grass and freedom for all people, like it was not so long ago.",
            "review_date": "2014-03-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Spiritualism is important to face adversity",
            "content": "Didier and Elise love each other very much. Didier's mind is mainly committed with rationalism while Elise's is more committed with spiritualism. Their life is quite happy since they met and have a baby a little after. Yet, The fatal illness of their daughter is a dramatic ordeal for their relationship, in a first moment, and for their existence, in a second moment. Didier insists keeping his rationalist attitude against Elise spiritualist attitude. Their relationship and marriage are torn apart, Elise commits suicide and die. Yet, Didier and Elise never stopped to love each other. The last scene, when the apparatus that keeps Elise in vegetative life are turned off and when Didier and his band play a music, seems to say that Didier started to put some spiritualism in his existence; sadly it's too late. I see two messages in this story. The first one is: certain ordeals can be overcome only with spirituality. The second, which derive from the first is: a marriage is much better if the couple share spirituality. The film is moving, the actors are convincing, and the sound track is nice.",
            "review_date": "2014-06-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "To have and to hold until...",
            "content": "A unique musical love story. Their love is sung throughout with bluegrass songs. She joins his Bluegrass band. The main dispute arises in his lack of faith in an afterlife. He preaches his atheistic philosophy at a concert. \"I am a monkey.\" He says. She can't take the pain and.. Then alone he watches the chickens. \"SAY HELLO TO MAYBELLE FOR ME!\" Are his parting words.\nNothing else is like this film.",
            "review_date": "2020-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece",
            "content": "Don't want to spoil anything. But don't watch this movie if you feel low. It's very dramatic movie that is extremely well acted. At the end of the movie many will have to fight to keep their tears in.",
            "review_date": "2022-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Movie",
            "content": "Saw this last night on Netflix. Great movie. Characters are fully developed and believable. Dialogue is powerful. Story is heartbreaking. If you are tired of the \"Hollywood\" produced crap that always ends in a happy ending and is mainly superficial, then this is a movie for you. Real life seldom ends happy, and sometimes you need to find your own happiness. Must see.",
            "review_date": "2017-11-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "bluegrass and heartbreak from across the sea",
            "content": "A belgian film that weaves american bluegrass music into the telling of a love story and it's spirit as a metaphor for life's heartbreak.",
            "review_date": "2021-05-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I don't understand the commotion about this movie in Belgium",
            "content": "Is this just me, because actually, I found this movie to be slow and a little bit boring. Every new scene you'll have to figure out where to place it in the time-frame. The lighting is occasionally bad, but this could be done on purpose? (filming against the light, in shadows without extra light, etc).What absolutely is missing, is the spark between Baetens and Heldenbergh, even in the more sexual scenes. I hoped to see something like Joaquin Phoenix and Reese Witherspoon in 'Walk the Line', particularly in the music scenes, but alas. Maybe therefore I didn't found it to be emotional at all. Furthermore, I didn't find the blue-grass music scenes a surplus to the movie. I couldn't get the idea out of my head that the storyline was secondary to the music(scenes).The religious outbreak of Heldenbergh is one for the deleted scenes. Sadly, this could have been so much more. A missed opportunity.",
            "review_date": "2013-07-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Life Doesn't Have to Be Hard",
            "content": "\"Broken Circle Breakdown,\" (2012). Starring Veerle Baetents and John Heldenbergh. Directed by Felix van Groeningen. This is one of those wonderful, hidden gems, full of surprises: the acting, directing, screenplay, and all elements that brought this story into being. As you might have guessed, it is a Belgian film and is about as sad and heart wrenching as you will ever find. Not only does Didier and Elise's child die from cancer, but we also watch the breakdown of their marriage. If two people who are so right for each other in so many ways cannot sustain their marriage, we wonder why it doesn't survive. Didier believes that he alone sees through the sham of Christianity. He's a realist. And he is a hard man. He will not accept that he is wrong. Or even accept her though she might be wrong. Elise must cope with life's hardships with the salve of Christianity. Belief that life is eternal. But it is not life which is ungenerous, as Elise determines. Didier does not even yield\nwhen his child who is dying, looks to her father for comfort. Like many men, Didier in fact has his own fantasies. He wants his woman to be exactly like his ideal of her is. He cannot accept her for who she is and love her anyway. She was lucky he wanted a Cinderella or Princess who would fulfill his desired fantasy. Elise fought hard for her own identity. Deleted his name from her tatoos. Changed her name. She claimed her right to believe what she wanted and removed herself from his presence. He never accepted that he could not control her. She killed herself believing that they could reunite in the afterlife as Alabama and Monroe, a new start for eternity.. So the hard man was left with his rigid, lonely, loveless life. A hard lesson, to be sure.\nThe score in this film is bluegrass music. If Didier and Else's music ideal, Bill Monroe, had sounded as good as The Broken Circle bluegrass music, I might have like bluegrass music.\nGet out your hankie! I give this film 5 of 5 stars. Enjoy!",
            "review_date": "2021-03-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb",
            "content": "Moving, touching, beautiful, profound and marvelously acted. If you don't like it, you have no heart.",
            "review_date": "2019-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Truly beautiful and truly heartbreaking",
            "content": "This emotional lovestory is so full og everything you hope for in a lovelife and so full of everything that would be your worst nightmare . The characters are so full of life and nerve and they move your heart deep inside. The actors are so good it is hard to remember they are acting.The Music is just right to set the mood for the engaging lovestory.. and there are so many scenes that fills the heart with joy... your heart will break though and I did cry I must admit.I shouldnt say more.",
            "review_date": "2022-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great film but too many flashbacks!",
            "content": "I found this movie very moving. All the actors including the young girl were very unforgettable. However, I was confused with all the flashbacks, too many of it. The most confusing flashback was about the ambulance etc., which was introduced way too early into the film. I simply got lost there. However, will look forward to watching more Belgian films.Krishna",
            "review_date": "2017-10-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very sorry; but I hate, hate, hated this flick",
            "content": "I regret seeing (for 5 bux) this movie, about 2 awful and truly horrible people. People who chose to live together (the plot gives no clues about whether they chose to marry one another) and procreate.To nobody's surprise, their procreation grows up to be a curious and cute 5 or 6 year old girl, with all kinds of questions about spirituality, mortality, and the meaning of life. Because her horrible, reprehensible parents have lived their entire life as hedonists, they have no meaningful answers for their daughter's questions. They spout meaningless crap, which confuses the daughter.A good percentage of the flick is about the selfish and boorish parents' time commitment to performing American style bluegrass music. In other words, they perform music from the 1920s and 1930s. And this is apparently shared by 5 or 6 bandmates, who do the 'music' portion of their musical act.The Belgian movie is in either Belgian, French, or Flemish. With English subtitles, in its American presentation. The sad and cruel truth of this subtitling is that the conversation and endless arguing between the aforementioned hedonist idiots is all subtitled (which is just about enough to give most persons a headache). However, the mildly spiritual, and sometimes deep, bluegrass lyrics, in English, are *NOT* subtitled at all. Thus I missed 80% of the song lyrics and their meanings.I have heard from other viewers that the song lyrics, when superimposed upon the plot mechanics, are quite meaningful. But I am never to learn firsthand about this, because some idiot technical translator on the post-production team decided that English song lyrics don't deserve their own subtitles. W T F, indeed.Sorry that I do not have a better, or nicer review on this thing. I simply felt that it displayed awful people acting awful toward one another.Recent foreign-language titles which I found worthwhile (from the same time era) include \"The German Doctor\" from Argentina, \"Wadjda\" from Saudi Arabia, and \"Metro Manila\" which is apparently a British production of action in the Phillipines.",
            "review_date": "2015-06-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "nice film......just one question......",
            "content": "Okay, I enjoyed this Belgian take on Bluegrass and familial tragedy...however I am left with one major question about it....Didier meets Elise.....she is a tattoo artist....but then suddenly she has become an amazingly talented singer...has anyone else questioned this?.....I waited for a flashback (as is the entire film's style) to verify the point at which Elise validated her vocalist talents....but nothing....we are supposed to simply understand that she joined the band and became their very fine female vocalist.... Didier's singing talents are part of the story and are understood.....but Elise's?! Otherwise, quite a refreshing piece of work by Van Groinengen....but this MAJOR storyline discrepancy has downgraded it for me from a 5-star to a 4-star....there's only so much a director can expect his audience to accept!",
            "review_date": "2014-06-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very slow movie, Not worth the money or time.",
            "content": "Very slow movie, they seemly added some items as the American flag bikini and the news about the terrorist attack of the twin towers, to get a nice quote of American viewers. But in the end it is just a slow (not to say boring) movie, hard to look it until the end. Some good pieces of music. Not worth the money or time of watching it. It's situated in Belgium, but they drive in rare American Pickups\u0085 and only real weirdoes have a beard like that and the girl with all the tattoos is not the average normal European women either. It feels more as a therapy for a family that has went through a cancer with children, and for those this movie might appeal\u0085 Well it will fit in the typical Belgium movie productions, it has a naked guy and a naked women in the story. A real good Belgium movie is more something like 'de zaak Alzheimer' . that was a movie with Emmy values.",
            "review_date": "2013-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A realistic movie about... stuff",
            "content": "Why about... stuff? Well this is one of the movies that you think you have it figured out, then the topic ends, and the movie continues. And in the end you can't pick one single thing the movie was about; it was about a lot of things. That brings to the first part. In most cases this and the non-linear narrative would make the movie hard to focus and less personal; here it makes the movie realistic. Because life isn't about something particular either.The movie is realistic to the point you get to know the characters, argue with their decisions, share what they feel and then even love some of them.The problem was, the film lacked in cinematography. Maybe I've been pampered by films like \"Don't Come Knocking\", but I like when the visuals are on par with the plot, and participate in the storytelling. It felt like the film's visuals had a lot more potential. There could have been a more unique style, and more scale. In terms of scale, I know it usually comes with experience. But this movie was... claustrophobic.Hence the rating. It was realistic, enjoyable, if a painful movie can be one, had its weak points - but overall, it was a worthy movie and I didn't regret a moment of watching it.",
            "review_date": "2015-02-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hands down, best movie I've ever seen!",
            "content": "I don't have anything sophisticated to write here. I bought this movie and watch it at least once a month and still cry like a baby. I ain't gonna lie, I would do exactly what Alabama does if I lost a child.",
            "review_date": "2020-07-26",
            "lang": "en",
            "source": "imdb"
        }
    ],
    "vibes": [
        "handed",
        "central",
        "daily",
        "devotional",
        "dim",
        "stirring",
        "troubling",
        "genuine",
        "rural",
        "eternal",
        "average",
        "twin",
        "boring",
        "bland",
        "notable",
        "prime",
        "concrete",
        "natural",
        "nonlinear",
        "easy",
        "unexpected",
        "marvelous",
        "live",
        "gripping",
        "lead",
        "sentimental",
        "critical",
        "involved",
        "tough",
        "exceptional",
        "accurate",
        "ambiguous",
        "brave",
        "clear",
        "coy",
        "fragile",
        "heavenly",
        "neat",
        "necessary",
        "replete",
        "scary",
        "tidy",
        "unplanned",
        "vicious",
        "linear",
        "available",
        "classy",
        "disjointed",
        "double",
        "entertaining",
        "joyous",
        "likable",
        "lofty",
        "lowly",
        "male",
        "outstanding",
        "relatable",
        "sombre",
        "varied",
        "cowboy",
        "offensive",
        "official",
        "preachy",
        "silly",
        "anti",
        "faulty",
        "imperfect",
        "innocent",
        "outside",
        "palatable",
        "sensuous",
        "religious",
        "rare"
    ]
}