{
    "title": "Wolf Children",
    "rating": 8.1,
    "release_date": "2012-07-21",
    "num_reviews": 130,
    "genres": [
        "Animation",
        "Drama",
        "Family"
    ],
    "summary": null,
    "reviews": [
        {
            "review_title": "Wonderfully affecting",
            "content": "Even though this is a fantasy movie, it is notable for how real it feels. The fantasy elements inform the plot, but it is the very real human emotions and connections that fuel the movie. This feels more like a thinly veiled version of real life than something fanciful.The movie is constantly moving, but in a quiet way. It touches your heart, not with big moments, but with small ones. It is a movie about love of all kinds, and while it is admittedly an idealized version of love, a story of the sort of unselfish, uncomplicated love that only exists consistently in movies, it is truly lovely.It is also often quite funny, well paced, and thoroughly entertaining.Having seen Mamoru Hosada's previous films Summer Wars and The Girl Who Leapt Through Time, I see him as the successor to Hadeo Miyazaki, who (alas) cannot live forever. Hosada is a very different filmmaker, but he has the same ability to make fantasy real and human, and to make me happy.Watch this movie.",
            "review_date": "2013-09-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Nutshell Review: Wolf Children",
            "content": "If you'd ever need to know why 2D animation is still relevant, or why the slew of 3D animated films can't seem to dent and push the former out of fashion, then perhaps Wolf Children encapsulates all the reasons why this is so. There's a lack of charm with the very clinical approach to animated films, especially with loads of images created digitally, and now for the 3D format, and this charm is always ever present in the traditional art form for the big screen. And don't forget that story remains king.Director Mamoru Hosoda continues on his roll with a brand of animated films that are extremely well received, because not only are they drawn to perfection in anime style, but also his films touches the emotional core on humanity, and this will inevitably move you with his style and delivery of such strong stories, whether written by someone else, as a film adaptation of novels such as The Girl Who Leapt Through Time, or like in Summer Wars and Wolf Children, stem from his own imagination. And what a fantastic reservoir of imagination he's tapping from as well, either telling stories with relevance to a digital age, or as in this case, a fairy tale like allure that is deceptively simple, yet concealing a very strong ode to motherhood.Yes that's right. For the most parts throughout this film, I thought it also resembled Yoji Yamada's Kabei: Our Mother, in the sense that this film takes on story proportions centered around a mother's unconditional love for her children, and the continuous strive to make ends meet and bring up her children to the best of her ability, inculcating a value system into her young ones. And the episodes the mothers encounter strengthen their resolve and determination, just goes to show the lengths they will go to in ensuring proper upbringing filled with love, care and concern. This simple narrative will undoubtedly move, only if it's done right, which Wolf Children did, complete with a fantastical element which provides a refreshing examination looking in, with a little bit of grotesque morbidity if one cannot look away from.I dislike to use this analogy, but perhaps it may strike an immediate chord with the current generation. Twilight has progressed and shown the decision Bella made to be with Edward, and in some ways, Wolf Children is like a what if to that scenario had she decided to be with Jacob. Hana (voiced by Aoi Miyazaki) meets up with a tall, handsome stranger in class (Takao Osawa), and before you can say Twilight, they fall in love, and it is revealed that her lover is a Wolfman. Undeterred, they begin a family, and soon Hana gives birth to the titular daughter Yuki and son Ame, before tragedy strikes and the family becomes a dysfunctional one without a father figure.Fearing that her children may be discovered to be wolf-human hybrids, with a number of scenes showing the challenges she faces such as their tantrums and uncontrollable changes, or the dilemma faced when they fall sick, she decides to uproot and move into the countryside, where life is simpler, neighbours are far away from one another, and there is room to, well, let her young ones roam in the vast grasslands and mountain sides. A new life beckons, and the film begins its homage to all moms having to struggle to bring up their children in unfamiliar surroundings, with little assistance, and plenty of inexperience.As a storyteller, Mamoru Hosoda excelled in character development, as we journey together with Hana in her upbringing, with the children endearing themselves to you in double quick time. They are adorably designed, drawn and brought to life, whether in their human form, or in animal form. We identify with everyone easily because of the inherent humanity Hosoda gives them, whether or not we are already a mom, or reflect that onto the challenges faced by our own mom's upbringing of ourselves. And both Yuki and Ame, besides their gender, have very contrasting qualities, from young to their teens, a tale told to just about the time where teenage rebellion and the need to forge their own independence take centerstage.There are plenty of episodes in Wolf Children that covers a spectrum of emotions, from comedy to those that will set heaviness in your heart. The innocence of the children will not get lost on you, and in fact will rub off you, while the pains of growing up will also touch a raw nerve, as Hosoda clearly knows which moments in one's teenage life to translate his story for the screen, bringing relevance the forgetting that the children were in fact more than meets the eye. And the animation is clearly Hosoda's vision in having details balanced with the occasional need for scarcity, which nailed it especially when the narrative calls for some distance either physically, or emotionally, and it's a stylistic choice that's already seen in a number of his films.Mamoru Hosoda set up his Studio Chizu with this production, and I'm really looking forward to more stories in the coming years. Meanwhile, Wolf Children is a must watch, and a clear favourite for the year. A little pity that it's not opening on more screens, but make your way to the Filmgarde cineplexes as this remains an exclusive to the chain. Meanwhile, I'm going to look back at Hosoda's filmography on DVD/Blu!",
            "review_date": "2012-09-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another Superb Effort from Mamoru Hosada.",
            "content": "As part of Madman Entertainment's Reel Anime Festival that now come very two years since 2008. Its aim is to showcase some of the freshest and new Anime films that have been recently released in Japan to the rest for Australian and New Zealand for a limited time only. I managed to catch two films during its run; Berserk: Egg of the King and Wolf Children. I can only hope I see the other two From Poppy on a Hill and Children Who Chase Lost Voices when they come out on DVD.Here's my review of Wolf Children: Mamoru Hosada could be one anime Director who could rival the international reputation of his former employers; Studio Ghibli.\"Wolf Children\" is his third feature after the successes of \"The Girl Who Leaped Through Time\" and \"Summer Wars\".The Stoy follows Hana; a young University Student who falls in love with a strange young man. It soon turns out he's a mysterious Half-Wolf-Half-Man descendant. Things start to take a more drastic turn when He dies leaving Hana alone to raise her two Children they bore.The rest of the film follows the children as they grow up and how Hana manages to raise them and deal with their gift, habits, situations and morals.The central action takes place in their new country home surrounded by wilderness and their interactions with the town folks and wild life.Like Hosada's previous works, this film has fantastic and unique character designs; that aim more to realism and art-house scene than traditional anime designs.The story is very heartwarming and cute as time goes on, there are some dark parts that become very heart wrenching. There's some very distinctive Ghibli influence in this piece of work, But I'm glad Hosada takes to his own territory.To some viewers it maybe a little too long running at almost at 2 hours. But overall its a superb anime film even if your familiar with Hosada's other films or not Wolf Children is great and must be seen, I highly recommended it for a heartwarming journey of endurance, love, coming of age and prosperity.",
            "review_date": "2012-09-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic film about growing up and living between two worlds",
            "content": "Wolf Children tells the tale of two children, who have been born to a normal university female student and to a werewolf man. From their father they inherit the ability to turn into wolves, which manifests almost immediately after their birth. Unfortunately their father dies and it quickly becomes apparent that werewolf children just cannot be brought up in the city. At least not alone. Thus their mother does the sensible, but also risky, thing and moves to the countryside to farm the land and to raise her children in peace.From that intriguing beginning we get a beautiful film about the problems of growing up while straddling two heritages. Yuki, the older of the two children, is much more outgoing and brave, and she's at first much more comfortable with her wolf blood than her brother Ame, who's more cautious about the wolf within, but also understands it on a level that Yuki can never reach. It's a very fitting allegory and the film takes full advantage of the possibilities offered. Especially near the end the film has some absolutely beautiful and thoughtful moments when the children, now young teenagers, finally have to start making decision about which of the worlds they want to belong to.I also have to praise the character of the mother, Hana. She's so often clearly way in over her head, but her stubbornness and constant cheerful outlook on life carry her through even the hardest periods. She's very human in how she struggles, but in the best possible way, because it's exactly her humanity that gives her strength.Studio Madhouse's animation style is still very smooth and fluid, though I do find that their character models are a bit simplistic when you put them against lush nature backgrounds. Not really a problem, but personally I would have preferred a bit more naturalistic approach to the designs.Wold Children is a fantastic film for all fans of anime and for those that are interested in the dichotomy between the world of beast and the world of man.",
            "review_date": "2015-07-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just an awesome anime in every aspect.",
            "content": "Probably the best anime I have seen recently. From the director of 'The Girl Who Leapt Through Time' gives us this wonderful fantasy-drama. This movie is kinda resembling Miyazaki's 'My Neighbour Totoro', only the place it takes place and a bit with the characters. Other than that it is an awesome movie with a totally fresh concept as per my knowledge.All the three main characters, a mother and her two kids were lovable. Aoi Miyazaki never stops impressing me where she appears here as a mother. Her roles from various movies are always coming with a surprise who peaking high and higher, she really rocks. The two kids' characters as well very adorable. Like the two sisters in 'My Neighbour Totoro' these two made the movie look great. Actually it was a tale about a mother who raises two wolf children. As a single parent, her hard work and dedication to the kids to grow up having a normal and happy childhood she must sacrifice her life.When her husband dies, Hana must take care of the kids where she lacks the knowledge of their kind to give support. She finds difficulties in city to raise them so she decides to move to a rural where she can cut the communications with the other humans. Growing her own vegetables in the backyard, facing the different seasons and going through all the ups and down in life she almost achieves her ambition.It did not look like an anime movie, it looked almost a real one with many cool and colourful frames. The story commenced with a nice love story with a little heartbreak. Then the most enjoyable parts begin with lots of laughs until the approach of the end where it brings lots of emotions before concluding with a powerful howl. It had very nice background score in all the crucial portion of the tale. In other word to say, the movie was just like what I expected and more than that. I felt the movie was short and was not ready to accept the end. You know, it is better being short and sweet than with unnecessary drag in a tale. This is a movie that everyone will love, especially kids and families. Like I said if you are a die hard 'My Neighbour Totoro' movie fan then you must not miss it. So highly recommended by me.",
            "review_date": "2014-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This Movie Deserves a Standing Howl!",
            "content": "Many anime works, including the likes of Ghibli's pieces, suffered from a few things: i) imbalance flow of plot, where certain stages/ arc of the storyline were memorable but the rest of the story fail to make an impact that they were expected to ; ii) actions taken by the characters that appear irrational or falling into the cliché category.In my opinion, I am glad to see that this film did not become a victim to such traps. The characters, even if they are not necessarily pure human beings, are the most down-to-earth anime characters I have seen in recent times. The movie made a good decision to focus rather on the story of how the mother cope on her own, taking care of her two growing-up children under such conditions where she cannot simply request for anyone's help.In my opinion, Ame to Yuki carved its brand in creating such an incredible plot, when there are already tons of other movies or series that famously exhibited vampires/ wolverines, and yet probably a very few pieces out there took the opportunity to explore the possible life situations that could materialize if a human were to commingle with a non-human character, at least not to such a degree Ame and Yuki did.Of course, I am aware that the movie chose to take on a very optimistic approach, which could otherwise complicate things substantially. The mother was a very open-minded person; she made a few life-changing decisions that I believe not many mothers will be willing to commit to the same. How she eventually settled down in a village environment where the village neighbours seem to choose to be oblivious to her background was deemed very lucky in my opinion. How the daughter managed to get the trust of a close classmate was also very optimistic.Overall, this is a down-to-earth gem that would be highly recommended, especially to anyone who likes cute wolves.",
            "review_date": "2013-04-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Almost as good as the best of Studio Ghibli",
            "content": "That does sound like a bold statement to make, but, while some of the first part of the film is rather rushed and the ending is inconclusive and literally begging for a few minutes longer, Wolf Children is as good a film as that. The best assets were the animation and the way the story is handled. The animation is absolutely fantastic, always have liked the anime style and Wolf Children is one of the best recent examples. The colours are both atmospheric and beautifully gentle, never bold or in your face but intimate-looking without being too twee-looking, while the backgrounds are exquisitely detailed and the characters move expressively.The story may sound simple and twee reading the plot-line but is actually none of those things. It fills the running time almost perfectly and uses some very mature and relatable themes dealing with them in a way that's sensitive and beyond its years while also making it accessible for a wider audience(a quite difficult thing to do and Wolf Children does this better than most animated films). Not only this, but it is very emotionally powerful as well, plenty of scenes are cute but a lot of it is either charming or heart-wrenching without making it too dark. The script is pretty much the same, it doesn't ever sound childish nor does it sound over-complicated or preachy(considering the themes tackled these were and are very easy traps), none of it is enough to completely go over children's heads neither is any of it dumbed-down-sounding to adults.I always look out for good music in a film, as a very keen musician and as someone studying classical singing. Wolf Children does have a good music score, no, a great music score, gentle and ethereal mostly but also with some rhythmically driven parts too, matching what's going on nuance for nuance. The characters are adorable but not in a sickly way while also engaging and distinct in personality, they are flawed but also easy to identify with. The voice work is beautifully delivered too and fit the characters and their personalities very well. Overall, a beautiful film that is almost as good as the best of Studio Ghibli. 9/10 Bethany Cox",
            "review_date": "2014-11-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A metaphor for raising children",
            "content": "In a Japan that closely scrutinizes people's behavior and wants to make everyone the same, a woman moves in the countryside to raise her two children. The wolf thing is a metaphor for how different people need to live their lives according to their own beliefs and feelings. The animation is very nice and the story has many great moments, however the pace is very very slow. Other than the mother raising her children by herself and the things the children do, nothing much happens, but it's a beautiful movie.",
            "review_date": "2019-10-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Incredibly cute and touching drama of everyday life",
            "content": "In the vein of films like Totoro, and in contrast to Mamoru Hosoda's previous Summer Wars, this film glides along without an epic struggle driving the story. Rather, the greatest moments are the depictions of family life and the picturesque sketches of Tokyo and the Japanese countryside.The story begins with the start of the eponymous wolf children's parents' love, and progresses through births, deaths, moves, the first day of school, and their growth into adults. The story is almost too ordinary, but in its normality, its moments are universal. One can't help but stare in awe at the beauty of life as it happens, and be reminded of the beauty of one's own mundane yet special lives.The art is also quite something. Tokyo's bustling life is reduced to warm glows of winter, and the Japanese farms and countryside is rendered beautifully whether it be in rain, sun, or snow.Watch it. It's not of the same scale as Hosoda's previous Summer Wars or The Girl Who Leapt through Time, but it packs an emotional punch that surpasses either of them. You'll shed a few tears, and marvel at the beauty of the world and our lives.",
            "review_date": "2012-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hands down one of the best movies ever.",
            "content": "Wolf Children, or Ōkami Kodomo no Ame to Yuki (Wolf Children: Ame and Yuki) as its called in Japan, is hands down one of the best movies I have ever seen. Not even counting its ranking among the anime category, Wolf Children takes place in my own personal hall of fame movies. In this movie, director Mamoru Hosoda completely blows away all expectations with a film that will really touch you. Wolf Children is a story of trials, perseverance, and the love of a family. For parents, you have nothing to worry about, the full extent of violence being very little. However, it is best to watch with your children, as there are a few amazingly sad moments. Wolf Children can be seen alone, or in a group with equally satisfying results. If there is one negative point I could make on this movie, it would be the first 5-10 minutes being slow, but after the first 5 minutes or so, you become completely entranced and will wish it were longer. If you come to love this movie as I do, watch \"Summer Wars\" by the same director, another movie both adults and children can love.",
            "review_date": "2013-05-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just outstanding",
            "content": "This film was excellent, may I even say better than spirited away? Possibly. The Wolf Children was much(for lack of a better word)better than I had expected. I simply astonished me. The animation was fantastic the background was exquisite, and the storyline was moving. Mamoru Hosoda has not failed again, if you liked this I would suggest you watch \"Summer Wars\" or \"The Girl Who Leaped Through Time\". Wolf Children is massively underrated in my opinion. Though there is no spoiler here, I would like to say one thing about the ending, the ending is not conclusive, it is quite open, though still powerful. So because of this, some people may not like the ending, at first it had me in tears because of its beauty, but also had me angry because of the ending. But still a fantastic film.Ratings:Animation: 9.5/10Storyline: 9.8/10Background scenery: 10/10 (Amazing background scenery, greatly drawn)Character personality: 10/10Overall: 10/10Thanks for reading.Nik",
            "review_date": "2013-12-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you didn't believe in Mamoru Hosuda after Summer Wars . . .",
            "content": "You will after seeing the beautiful animation, and emotional purity of this film. This is a somber look at the struggles of a single mother completely out of her element, and fighting for each and every inch of ground in unfamiliar territory. While the comparison to Hayao Miyazaki is both inevitable, and present, Hosuda has established a unique style of story-telling that will help distinguish him from other animators, and hopefully bring him some much needed attention from international audiences. Never one to shy away from tear-jerking, Hosuda spins a somber tale of an unconventional family with unique challenges, and yet still makes it nearly universally relatable. While this film is technically in the fantasy genre, it is easily recommendable to fans of all film styles and all ages, with only some slight warnings for tasteful, completely non-sexual nudity.",
            "review_date": "2013-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Call of the Wild",
            "content": "Mamoru Hosoda directs \"Wolf Children\". His most conventional feature, the film begins as a hormonal fantasy in which 19 year old Hana meets, falls in love with and is impregnated by a young man who also happens to be a wolf. After some casual bestiality, and the death of her furry lover, the film develops into a interesting family drama. Here Hana, now a single mom, struggles to raise her two half-breed children.For all its fantastical elements, \"Wolf Children\" is a fairly dour and depressing drama. Themes of acceptance, letting go and peer pressure come and go, but mostly Hosoda seems interested in sketching the troubles of a young widower; he accomplishes this well. At times beautifully animated, the film's opening act is rushed, and overloads on narration and montages.7.9/10 – Worth one viewing.",
            "review_date": "2014-05-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazingly well done movie.",
            "content": "This movie was incredibly well done. In my opinion, aside from the supernatural aspects of the characters themselves, this is a very real and down to earth story about a mother trying to raise two children who are different and the struggles she has to go through alone. I find the characters in this movie to be incredibly realistic and relatable. The music is great and it does not overtake any scene, but rather it adds to the mood of the scene it is required to enhance. As someone who, along with my sister was brought up practically alone by my mother, I feel that this movie also reminded me of her day to day struggle as well in terms of raising two energetic children without any outside help whatsoever. The animation is very crisp and beautiful as well. If you haven't seen this movie yet, go see it, and if you have any reservations (just as I did) you should go see it anyway. This movie was one of a kind.",
            "review_date": "2014-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Raising Children Is No Walk In The Park",
            "content": "Addressing the difficulty of raising children and the frustrating process of coming to terms with one's identity, Wolf Children is brought to life with nuance and also benefits from its sumptuous animation. A story of family, responsibility, parenting & finding one's path in life, the film has flashes of brilliance but is never engaging throughout.Co-written & directed by Mamoru Hosoda (The Girl Who Leap Through Time & Mirai), the plot does manage to create intrigue at first but the longer it goes on, the less captivating it becomes. There isn't much wrong with how all the events play out but the drama never captivates like the finest examples of its genre are capable of.The first half expertly demonstrates how exhausting it is to raise kids, even more so when they are half-human, half-wolf and their identity needs to be protected. The later half shifts tone and focuses on the kids' problems as they struggle with new challenges growing up which is where it lost me as the former plot was way more interesting.Overall, Wolf Children is a well crafted & finely narrated family drama that packs a strong emotional punch in its richly layered drama, and has a number of things working in its favour but it still leaves behind an underwhelming feeling of sorts. What stands out best is Hosoda's painstaking attention to detail as evident in the film's lush visuals & succinct animation. And for that alone, it is worth a shot.",
            "review_date": "2020-02-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Being independent in familial love and extending own culture",
            "content": "This is a story about love – accepting the person as he/she is, regardless of his background and build a life with him/her. Hana (Aoi Miyazaki) loves her boyfriend even though he is different from other boys. Both loners, he tells Hana it would be nice to have a family – to be welcomed when coming home, to prepare meals together and just share daily lives. Sometimes we are so absorbed in work/other priorities in life that we almost forget what the basics in life are. Braving possible societal prejudice, the young lovers have two children – Yuki and Ame. Unfortunately Hana has to raise them all by herself. Being a single mother is tough enough, let alone raising two special kids who are so different from others.The same predicament might exist for parents from different cultures, or different religions: into which culture or which religion should the child be raised? Hana did not impose her opinion on them, she just wants them to be happy and have lots of space to develop into their own self. I love the huge old house they grew up in and the way they grow their own food. But it must be very difficult as Hana did not know anything before. Perhaps the film is paying tribute to the female gender: so many Japanese mothers raise their kids by themselves even though they are married, as their husband work very long hours. To stay away from societal pressure, Hana works hard alone and learns to raise two special kids all by herself. She even drew her own picture books! A very tough, very strong and very loving woman. She never gives up and always wears a smile. It may be an animation on wolf children but its theme extends far beyond that: in the end, what kind of life do we want to lead? As wolf or as human being? Why are wolf terrible? Can I be a wolf that is not terrible? Shall we choose a path where we feel loved/desired/ respected (like Yuki), or one that contributes to the betterment of our kind (like Ame)? Neither route is mutually exclusive, though. Hana let them live their own life. Perhaps that's eventually what parents will and should do: step aside and watch their children grow up, but help them whenever the need arises. The artwork is excellent. Sometimes I wonder if I was looking at a photo or a video because they look so real. The voices over are super cute. The naughty scenes make you laugh; the sad scenes of Yuki and Hana make you cry and make your heart ache.This is a movie suitable for all ages as we all have been children at one time and maybe parent at other times. It just urges us to treasure our family more.",
            "review_date": "2012-08-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good enough",
            "content": "At first, honestly, I thought that this one would be a weird, boring movie. However, the story improved gradually. The bond between the mother and her children, as well as their relationship with society and the environment were presented beautifully. I loved the way the scenes in the forest were shown, just like in real life 3D movies and not an animation, like when the kids were running in the snow or when the rain was dropping on the screen. Also, the story explores themes like being different and hiding it so you can be accepted, finding yourself and breaking away to be free. Okay, sure, the mother's relationship with the wolf was a bit creepy, but as an anime I don't know if it would have been suitable for kids, but the older audience would be more understandable. So, 7 out of 10.",
            "review_date": "2017-03-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Interesting Remix of the Raised-by-Wolves Myth",
            "content": "Sienna's Rating: 8 Stars\nSebastian's Rating: 8 Stars\nPaul's Rating: 8 StarsWatched July 2020.",
            "review_date": "2020-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Making your own luck.",
            "content": "Disclaimer: I'm not very familiar with anime or Japanese movies.During the movie I had a hard time understanding how the whole \"werewolf\"-part of the movie was helping it. It adds an unneeded layer, that feels tacked on to appeal to young adults in the post-twilight world. The movie is a nice story about a woman in a difficult situation working hard - making her own luck - to keep her family safe and happy. The mother is an inspiring figure, and the children are cute, and you can clearly see the love between them. The struggles the children face are similar to what many children does, and so I'm sure people of all ages can relate to (parts of) this movie. But then there's the wolves.I'm not saying that movies in general should strive to be realistic, and using wolves to represent a part of human nature is bad. I'm just saying that I didn't feel it added anything to this story, and it could have been told just as well without it. At the same time: if I had enjoyed the werewolf \"mythos\" more, then I might have gotten even more out this movie (and story) than I did.The animation is very well done, and there are several beautiful shots in this movie. I liked the soundtrack as well.",
            "review_date": "2015-11-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great film",
            "content": "During the course of taking a flight from Japan to the States, I wanted to watch a movie to pass some of the time. Luckily enough, I chose this awesome film JAL had in their catalog.There is so many great things to say about this film that it is hard for me to even start. The story is wonderful as it is about a young mother trying to take care of her two children on her own. Did I mention her children have the ability to turn into wolfs on a whim? A lot of the plot centers on their family. Adapting to new environments, places, people and the whole process of growing up. Despite being in the realm of fantasy, it touches on a lot of human emotion and interaction and has top-notch voice acting.The art, animation and score are great and really just compliment an already solid film. I hope to find this on DVD sometime in the future to watch again but cannot recommend this more highly. It would be an especially good film for children. Even though there may be some darker scenes, none are too over-the-top and done in a very mature and thought-provoking fashion.",
            "review_date": "2013-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Modern Fairytale",
            "content": "Mamoru Hosoda has three times dazzled me with his films and has caught me in ways that other brilliant directors like him have beautiful but simple and heartfelt stories with a simple animation style that could easily rival the best CGI film out there and Wolf Children proves to be all of these and more. The simple little tale of an unusual family of a human mother with two half-wolf-children finding their way in the world and coming to terms with their nature in their own ways. The first part of the film tells us the heartwarming tale of the woman who fell for a man she loved only to tragically lose him an accident and now having to figure out how to make due by her self and not let the world know their secret. With the first act told very simply as a love story it captivates the adult audience and sets the stage for the rest of the story to come.As the years go buy the children grow older and start to discover more about their own selves and start to change from their early childhood selves. The once aggressive and spunky Yuki takes on a more mature and graceful persona to better fit into human society but her brother Ame who started out as a timid and resentful child grows to be more in tune with nature. The two parallel stories that take an opposite turn which makes for an unexpected change in tone but a brilliant piece of storytelling.I watched the film English dubbed from FUNimation which brings out an amazing cast including Colleen Clinkenbeard as Hana who nails her role and gives off an Oscar worthy performance. Playing the at times frustrated, panicked and love struck character of Hana she shows her incredible range of acting abilities. They also followed the Japanese casting choices by getting separate actors for the older and younger versions of Ame and Yuki. The entire cast could also be spoken for as they all give wonderful performances and I'm sure the same could be said for the Japanese cast.As to be expected Hosoda gives a brilliant visual spectacle with the animation combining the old traditional hand techniques with new CGI and even motion capture techniques. The simple use of transformations for the young children over a morphing animation I thought was effective and simple be it for artistic or economic and practicality reasons. Yoshiyuki Sadamoto once again gives Hosoda his simple but effective character designs.I found my self glued to the two hour film and constantly reminiscing on it and wanting to watch it again and again. While I loved Hosoda's Summer Wars and The Girl Who Leapt Through Time they didn't quite captivate me like Wolf Children did. It's a sweet and endearing film with a lot of heart the same charm of Steven Spielberg's early films and it's sure to tug on your heart strings quite a bit. It's a shame FUNimation didn't submit this for Oscar consideration because I'm sure it would have been a contender. A beautiful family film though may be a bit on the slow side for some children. Simple flaws maybe but easily overlooked when you get into the experience.",
            "review_date": "2013-11-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "WOLF CHILDREN is a gorgeous tribute to single parents.",
            "content": "Wolf Children is the latest theatrical outing by director Mamoru Hosoda, the talented filmmaker behind 2006′s THE GIRL WHO LEAPT THROUGH TIME adaptation and 2009′s SUMMER WARS. It follows the character Hana from the time she is a 19-year-old university student over the course of a decade or so.While in university, Hana meets a young man with whom she begins a relationship. One night while taking a walk, the young man reveals to her that he can become a wolf at will. He proves his claim on the spot in a sequence that is a refreshing departure from the bone-cracking, brutally painful event that AN American WEREWOLF IN London so effectively popularized in werewolf fiction. His fingers and face quietly elongate, and his hair ever-so-gently grows until his metamorphosis comes to rest as a bipedal, anthropomorphic wolf, somewhere between man and beast.The sex scene that follows is implied, but as the two naked silhouettes come together for a kiss and slowly descend onto the bed, you can't help but wonder why the werewolf hasn't transformed back into a human. The movie insinuates that this is the first time these two have engaged in intercourse with one another, and what it says about Hana's character (i.e. that she prefers it this way) feels unintentional and all for the sake of a little furry fan service. Whether or not this is the goal, as someone who doesn't find animals sexy, it's an uncomfortable moment to watch and feels wholly out of place in this story.The products of their repeated love-making become the titular wolf children, a girl named Yuki and her baby brother Ame. After a tragic hunting accident claims the life of the children's father, Hana is stuck trying to raise these kids, or perhaps tame these wild animals, alone. The father's driver's license is Hana's lone reminder of the life she once had.WOLF CHILDREN is entirely about the difficulties and triumphs of raising children, specifically through the experience of a single mother. The genre fiction elements serve only to enhance the drama of such highs and lows. When the rambunctious Yuki throws a temper tantrum, her wolf side takes over, allowing the destructive potential of her feral characteristics to match the emotional instability of the toddler she is. When she gets into a pack of silica gel and becomes very ill, Hana struggles with whether to take her to the hospital or the veterinary clinic. Although this particular scene plays out with a bit of a dramatic contrivance (the two medical facilities are conveniently right across the street from each other), it does a good job of illustrating the difficult decisions that single parents must make for their children when they don't have a partner to consult with. It's a lonely kind of desperation, and WOLF CHILDREN knows how to hit those chords in a thoughtful and effective way.Hats off to Hosoda and his co-writer Satoko Okudera for not falling into the trap of having Hana need someone to help her raise the kids. At a turning point in the film, she decides that moving out to the countryside will be safer for everyone as the threat of Yuki and Ame's strange abilities being discovered is much more severe in the city where they were living. At this point, Hana blossoms into the strong independent character she is meant to become — cleaning up an old house, learning to farm and grow food for her and her children, and doing it all without the need for a father figure. When a local patriarch teaches her how to make the most of her food garden, it only strengthens her resolve to raise these kids on her own. She may not know how to sow or reap, but she knows how to be a mother.We are treated to a lovely montage of passing years and growing children. The once rambunctious Yuki has become somewhat of a serious student, preferring human interaction to catching snakes and myriad wildlife. The far more reserved infant Ame has become an adult — an adult wolf, that is. He's 10 years old now and ready to go out on his own and explore his savage alter ego in the wooded mountains near his home. Hana has issues with this, as any parent would, but the film uses this to paint a very apt analogy between Hana and real-world parents who have trouble coping with the decisions of their adult children. Hana must learn to let him go, and when she does, she becomes stronger, which is maintained as a constant theme for her character.The animation is absolutely stunning. Some of the backgrounds, especially in the city, are so impressively detailed that you wonder if they weren't painted over photographs. The simplicity of the character designs and animations almost makes them feel out of place in such a meticulously crafted world — almost. Ultimately, everything fits together so beautifully that you hardly care when some third-act CGI threatens to visually derail the whole thing. Don't worry; it doesn't.What feels like mostly two to three piece arrangements fill Takagi Masakatsu's score with a simple, beautiful canvas for the narrative to be painted upon. The few moments of action or tension allow for brief but refreshing swells in the musical backdrop. It's a lovely soundtrack, and compliments the visuals well.To read the rest of this review, please visit: http://tinyurl.com/qhd76xf",
            "review_date": "2013-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "He could have just ordered pizza.......",
            "content": "(sigh) this movie. oh boy. this movie. I really don't want to go on a giant rant so I'm going to keep this as simple and short as I can.Okay so a woman falls in love with a wolf...man...shafeshifting...thing. yeah I didn't really understand the lore with this one. Okay fine. Whatever. She gets knocked up twice with wolf pup human hybrids and then he goes out in his wolf form to get food and gets hit by a truck and dies. Awesome. Everyone I was watching this with found this really sad. I just thought it was really stupid as I was thinking 'she's a human. The hell are you going to bring her back as a wolf? Like... a dead rabbit? oh that's nice.' He had a human job. How about he just...ordered a pizza or something? Nope gotta go out as a wolf, die and leave a widow with 2 kids. Awesome.So the next hour and a half is just the kids growing up. The girl wanting to be more human and the boy wanting to be more like wolves. That's really about it. It is exactly as boring as it sounds. Everyone acts like it's this big sad story when in actuality the boy is just being a rebellious 'you don't understand mom. I'm a wolf! No one gets me!' and the girl's all 'I have boy troubles!' and the wife is sad and doesn't want to lose her son to....the forest? I am rarely so bored during a movie as I was during this one. This movie had the amazing ability to make almost 2 hours be filled with absolutely nothing. Watching this movie is like somebody making a very pretty castle out of white bread and then after it is done telling you to eat it and then crying when you do. I know that's a strange analogy but....that pretty much sums up this film. It is pretty, sad, white bread. It's not bad...it's not good. It's just....there. I didn't hate it, I didn't love it, I was just straight up bored. 4/10",
            "review_date": "2016-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wolf Children",
            "content": "A1|10/10|**** I have not watched many Japanese animated films; I've seen three Ghibli films (I loved \"Grave of the Fireflies\"), and that's it. I just never had much incentive to seek out Japanese animation, which is odd for one who adores the medium. Despite this, I wanted to check out \"Wolf Children.\" I watch my animated films on Kiss Cartoon (unless I own a physical copy), so I headed over to its anime equivalent, and found a version with subtitles, since I always try and watch films in their native tongue. I could barely keep my eyes off the screen, for what I saw was a wonderfully simple film of what is something so complex and bizarre. Its design is so quaint, yet so artistic. Much like Brad Bird did with \"Ratatouille,\" Momaru Hosoda manages to take a very odd concept, and transform it into an involving, moving and ironically real experience.\"Wolf Children\" tells the story of Hana, a nineteen year old college student, who falls quickly in love with a man, who harbours a personal secret. The unnamed man, who I will refer to as Wolf Man, has the ability to transform into a full wolf at will. He has found an accepting person in Hana, who loves him and his lupine ways, and the two move into a small flat, and have two children; Yuki, born on a snowy day, and Ame, born on a rainy day. Together, the quiet, loyal Wolf Man and peppy Hana raise their two children, but struggle to make ends meet; Wolf Man, who works as a moving man, hearkens to the wolfish instinct of hunting for his mate and cubs. While doing so, he dies in an unfortunate accident, when in wolf form, in a heartbreaking scene where a devastated Hana falls to her knees as she sees her husband being thrown in the back of a garbage truck. Hana is forced to drop out of college and quit her job, as she makes use of the Wolf Man's savings to help raise their two kids, who, like their father, can change into wolves at will.We watch Hana struggle even more without her lover, as she is not only raising two young children, but wolf cubs, who chew on her belongings and cause chaos, especially the hyperactive Yuki. Hana is at a loss of how to care for them, as is shown in a darkly humorous scene where Yuki falls ill, and she is not sure whether to bring her to the vets or to a doctor. She studies parenting books and books on raising puppies and wolf behaviour, exhausting herself so she can raise her children to be happy and healthy. Obstacles are inevitable, for Hana cannot bring her children to hospitals for checkups and vaccinations due to their condition, and, in order to keep them hers and to avoid prying eyes, she moves to a large house in the country.For such a strange set up, Hosoda managed to produce a moving feature full or reliability and heart. It seems rather simple, and in a way it is, but complexities lurk under this wolf's skin; here we have a story of a devoted mother and wife, who refuses to give up on her family, no matter how tiring the circumstances may be. We see Hana farm fields of potatoes, only to fail time after time, until help comes when she least expects it. She ends up making unlikely friends, despite the difficulties of keeping her children's secret hidden, and trying to protect them from the world. As time goes on, we see Hana come to terms with the fact, that the wolf ages faster than the child, and even though they may be ten years old as children, they are fully grown wolves, who need to find their own paths. For Yuki and Ame, we see two children trapped between two worlds, who are unsure of whether to follow the call of the wild, act more human, or try and balance on the edge between man and beast. What we have is a multi faceted story, about motherhood, family and love. We have three people facing the trials of adolescence and childhood all at once, of dealing with disability and how others may perceive them. Here we have three individuals, who struggle with who they are and who they may become, with the only person who can understand dead and gone.So many beautiful themes, all handled so delicately and with great care. Such likable characters, such a pleasant, homely tone. The animation is lovely, and reminded me so much of these story books I had as a child, which happened to be translated from Japanese into English. So in watching this film, I had a sense of nostalgia I was not expecting. There are no scenes of epic triumph, but moments of life and joy and glorious happiness, of crippling sadness. We see privilege, prejudice, acceptance and passion. With Hana, Yuki and Ame, we see life in a way we have never seen it before; through the eyes of both man and beast. There's no magic, or ultimatums or deadlines. \"Wolf Children\" is complex in its simplicity, and simple in its complexity; it's refreshing and engrossing to the last second.All the pure loveliness and heart of this wonderful film shine in not only the relationships between the characters, but in two scenes; one that is before the climax, and another in the snow, with Tagaki Masakatsu's score accenting the simple joy and pure emotion of what dances before us on screen A must see.",
            "review_date": "2016-08-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "M.O.T.H.E.R",
            "content": "This is a film that make you cry without any sorrow. The Film is itself enough to express the mother's Love and Affection. Such a soothing Anime. If you had a Headache, I prescribe this anime than other medicines. It will light up your body.",
            "review_date": "2018-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Ôkami kodomo no Ame to Yuki\": A Heartwarming Story of Love, Family and Identity.",
            "content": "\"Ôkami kodomo no Ame to Yuki\" (Wolf Children) tells the story of Hana, a young woman who falls in love with a mysterious man who turns out to be a werewolf. The film follows Hana as she raises her two children, Ame and Yuki, who have inherited their father's ability to transform into wolves.The animation in this film is absolutely stunning, with lush, detailed backgrounds and expressive character designs. The story is heartwarming and emotional, exploring themes of love, family, and self-discovery. The score is also a standout, with beautiful, ethereal music that perfectly complements the film's visuals.One of the most striking aspects of \"Ôkami kodomo no Ame to Yuki\" is how it portrays the struggles of single parenthood, showing the realistic and difficult aspects of raising children on one's own. It also explores the idea of nature vs nurture and how it shapes a person's identity.Overall, \"Ôkami kodomo no Ame to Yuki\" is a visually stunning and emotionally powerful film that will leave a lasting impression on viewers of all ages.",
            "review_date": "2023-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A great potential but the story doesn't find the way to draw kids into caring for these wolf-children...",
            "content": "And I speak from experience as we took three sixth-grade classes to \"The Wolf Children\" and well, if not the plot, the title sounded interesting. In hindsight, I'm realizing how naïve we were. This is a very well-made Anime but not quite suitable for children, except the really mature ones.To their defense though, when you have a shot that consists on a woman and a wolf-headed man with bare shoulders, kissing and followed by a discretion shot implying they're in a bed, stoicism isn't exactly boys' strongest suit and some were already starting to heckle the show (that it wasn't dubbed added to their ordeal).I must admit that the whole first act consisting of a narrator telling her mother's romance was awkward. It is played like the most banal romance with the only redeeming value in the reveal of the man's secret identity: half-man and half-wolf, that and a mesmerizing animation, but one wouldn't expect that from an anime?As much as I loved the character of Hana as the student-who-falls-in-love, her Romeo was the kind of living fantasy that quickly turns out to be a bore, all attitude and nothing remotely \"lively\" about him. Having the romantic girl fall in love with the dark, tall and mysterious stranger had me yawn and it was not until little Yuki comes in the screen that the film started to gain some colors.But before, we had to endure a life-montage à la \"Up\" and I was over the edge of my seat fearing another flash of nudity during or after the pregnancy. If you show the film to your kids, do expect a few yawning from that part and a few 'gross' reactions to some graphic moments (some include vomiting and breastfeeding).But there's a beautiful middle-section about Hana's struggles to raise her children. Beautiful and unexpected: once we get the supernatural element, everything is handled in a realistic way, complaints from tenants about the noises and constant howling the \"kids\" make, the pressure from Childhood Protection and a very meaningful moment where little Yuke swallows gel and Hana is wondering whether to go to a doctor or a vet.Hana is the Mama Bear figure movies love today, she resorted to natural birth out of fear to deliver wolves in a hospital and realizing an urban life wouldn't fit them, decides to move on to the mountain and live on gardening. Once there, in a sequence that reminds of \"Totoro\", the two children react to wilderness according to their personalities, Yuke is excited and express her wolf-life nature to the fullest while little Ame is the momma's boy who want to go home.I'm not sure about the idea of not including fantastic elements but it was strange to have that film with such a fascinating premise stick up obstinately to realism. I guess the idea to show this film to children is to teach them the value of solidarity between people and how to adapt to a different environment where you have a second culture. But are children sophisticated enough to grab it? I think so, but it all depends on the effort to draw them into the story.The way \"Wolf Children\" is made, it can appeal to a mature audience. The character of Yuki is integral to the film's appeal to kids but she slowly starts to grow up to fit in school. At that point, she stops being interesting. The problem is that the boy doesn't grow into a much interesting character either, the rule of Generation Xerox is respected and quickly, the wolf side takes the upper hand and he becomes as taciturn as his father.So it comes to a point where the film glides into the drama genre and never tries to conceal it with a few thrills. I'm not saying a film with a children audience shouldn't be introspective but when a climax is supposed to be set during a storm, there's more to expect than false alarms and some Oscar bait melodrama. Yes, they all work, but when one thinks of wolves, there's a whole imagery that goes with, that Mamoro Hosado, the director, could have explored.I respect the choice of not venturing into the realms of werewolves and all that stuff but there had to be some sense of danger, perhaps one last episode encouraging one to definitely opt for the human side and the other for the wolf world, in fact, twenty minutes before the end, much of the story was resolved and nothing was left for suspense. I guess it's deliberate because the film was made with Hana as the central character, and maybe that's a mistake.I feel quite superficial and guilty because the film was enjoyable and deep; but it feels like a few opportunities have been missed, when you collect so many talents in the writing and design department when you have such a dazzling animated cinematography and so well-established characters, you just wait before 'maturing them'.There is such a nice middle section but the characters' arcs seem to close without having us involved, we're supposed to cheer for our three protagonists at the end just because our empathy was efficiently engaged before. A pity, really. On a side note, I liked it better in the dubbed version, it might feel blasphemous to say so, but non Japanese speakers can have a problem with the original version for two reasons.Indeed, apart from a few words, Japanese is not the most accessible foreign language and one is forced to rely on subtitles, some are white in a white screen and impossible to read. And since it's a film that depends a lot on narration, dubbed version would suit better.I would also encourage anyone to read the Parents Guide before deciding. It's good, it has good lessons about life but while a childhood-themed film, it's definitely adult-oriented.",
            "review_date": "2018-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A dedicated storytelling director",
            "content": "Some have grown into wolves, some have evolved into better people, some have entered marriage, and some have lived in eternity, there is no right or wrong, this is our destiny, but also our sorrow and joy. People always find a way to survive.",
            "review_date": "2020-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful movie",
            "content": "An amazing movie with a heart-touching story. A movie that will make you appreciate the outstanding job mothers do and how willing they are to do the impossible for the sake of their kids",
            "review_date": "2018-09-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "As magical as Ghibli, but not the same",
            "content": "A lot of people compare this director to Miyazaki, but I think he has a different, but still poignant style that is deserving of comparison, but is its own thing and not Ghibli.That being said, this movie is great and deserving of the attention it has gotten. The story is great, but not too impressive. The animation is crisp and beautiful, but again not that impressive. I've seen better and the people who put this movie up on a pedastool have too, but just won't say it.",
            "review_date": "2019-07-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What do children mean to their mother",
            "content": "It's another heartwarming animation directed by Mamoru Hosoda, who is famous for \"Summer Wars\" and \"The Girl Who Leapt Through Time.\"I tend to choose a film based on its trailer and rating on IMDb or other film sites, so this film is also no exception: I thought it would be a heartwarming human drama depicting wolf children. However, this is more than just a wolf children's story, assumed that wolf children might be trouble living their life along with human.It's a story about a mother and her children, and independence of their parent. The story focuses on how the mother struggles with raising her half-wolf children without their father, and the children choosing their life as either a wolf or a human through adolescence.Although it describes how the mother got to know the wolf man and her financial background such as where her money comes from without job, it's not so important to the story. It shows how hard child rearing is, yet how enjoyable and proud it is as a mother to see children grow- up. I realize again that a mother is strong.One of the striking scenes was that Yuki cries a lot in a car because she can't keep a promise to her mother, and lets her appear as a wolf in front of a boy at school. Going to school has a profound effect on Yuki as a human, so she apologizes to her mother. The mother never scolds Yuki and Ame. I was touched by her attitude that she accepts anything from her children, and she tries so hard in order to bring up them.This film was awarded an Academy Award for the best animation. I like the film deserves the award. I recommend this film to girls, boys, mothers, and people who are struggling in their life.",
            "review_date": "2015-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A gorgeous, flawless experience",
            "content": "Watch this movie with your family, it'll be one of the most emotionally heavy experiences you'll ever have. If you don't tear up, or even your eyes don't water atleast once in this movie... Then that'd be a little scary ig :). Because this movie shows these powerful, almost heart wrenching images during so many emotional scenes, and at the same time, it's hopeful and gorgeous.I try to watch many movies. And after every 25 movies or so, there comes one, that hits all the right notes and absolutely blows me away. This is that movie. Mamoru Hosoda has written as well as directed this movie and it's one of the best movies I've ever seen. I love every second of this experience.The story is about the character of Hana, who due to some circumstances i won't spoil, gives birth to 2 \"wolf children\" who are part wolf, part human, and she has to raise them all on her own. The plot seems weird? It did to me too but watch the movie and you'll understand how real it feels. I can't even describe how well the film shows the troubles she faces to raise these children, keep them happy, and protect them. And how much you care about her character. It explores so much about being a parent.Firstly, the main character, Hana, is one of the strongest characters I've ever seen. I'll explain with an example. She has a belief, that she should always keep smiling no matter what \"even when it's forced\", she will then overcome things. Now, there are so many scenes, she reaches the lowest point, when nothing is going her way, and while crying (almost trembling) she just smiles in the end, and believes she can overcome this. I mean... I felt her pain and optimism at the same time. This movie is filled with emotionally powerful scenes like these, that just hit me. I had my jaw dropped for 50% of this movie because of how emotionally invested i was. I was almost praying in some scenes for these characters. This is brilliant writing.The movie is 2 hours long, it never felt that long. Not one shot, subplot or dialogue feels unnecessary. The animation as always is beautiful.This is a 5/5 movie for me. Just, hats off to everyone involved with this movie.",
            "review_date": "2022-04-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Beautiful Experience",
            "content": "While I know Japanese animation more from Hayao Miyazaki and the Toei Company robot fighting machines, it was indeed so good for me to watch and enjoy \"Wolf Children\" by Mamoru Hosoda.Hana meets a quiet loner in the university and they fall in love. He reveals that he is half-Wolf, but she accepts him anyway. They have two children together -- the spirited girl Yuki and the serious boy Ame. But as tragedy struck, Hana had overcome great odds to move to the remote countryside and raise their two kids by herself, just as they were both already showing their human-wolf duality. The animation is really a thing of beauty with its fine lines and gentle details. The dialogues were very well-written and were delivered with much distinct personality by the voice actors. Hosoda told his story of maternal sacrifice in a very slow and moving way, as only Japanese can do so well. It was able to establish an emotional connection with the audience from beginning to end. Watching this film is a beautiful and gratifying experience.",
            "review_date": "2014-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Can't say enough good things about this film",
            "content": "I absolutely loved this film, and will definitely be watching it again and again. Beautifully animated, gorgeous settings, and a really sad but sweet story. Heartbreaking in places, and utterly charming and adorable in others. The stunning visuals are the perfect backdrop to such an emotionally evocative story. There is something so memorable about the way this story is presented, and it's the sort of thing audiences of all ages and backgrounds could enjoy. It has an understated humanity that shines through in every scene. The characters have so much personality and their connections are so believable, it's easy to get very absorbed in their experiences. Highly recommended.",
            "review_date": "2016-07-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The very best of Mamoru Hosada",
            "content": "This movie is the best animated movie I have ever seen, and that comes from someone who has seen Spirited Away ( and almost every Ghibli/Miyazaki movie), Your Name, A Silent Voice, Akira, Ghost in the Shell and many more. Mamoru Hosada took the tale of the mother overcoming all odds to raise her children and gave it a couple of twists that made in so much more impactful and painful. This movie was very hard to watch because of all the hardships that the mother has to overcome. The movie spends a lot of time in showing us all the things that Hana has to do, from the hardest things because of her unique situation, to normal activities like farming and for that reason, some people might see this as a very slow movie, but those \"slow\" scenes contribute in showing us one of the themes of this film which is to witness just how much is a mother willing to go to raise and protect her children. \nBut this movie is also about finding one's path in life, about finding out who you really are and embrace your true self with all your strength. While the first theme is perfectly and brutally represented by Hana and every action she takes since becoming a single mother, the other theme is perfectly represented by Yuki and Ame as they grow up and begin discovering what they want to do.\nIn terms of the story that this movie wanted to tell, it is perfect. In terms of the character development and progression of Hana and her kids, this movie is magnificent. And when it comes to the themes and the message that this movie wanted to get across, this movie delivered. In terms of the emotions that this movie makes you feel, it will make you sad and desperate (you could cry), but it will sometimes make you feel happy and even hopeful which is what this movie made me feel like. The feel of happiness and achievement that this movie gave me is very similar to the one that the Shawshank Redemption gave me.\nBoth the soundtrack and the art for this movie are incredible, I was also very impressed with the sound of the wind, the animals, the weather and the nature in general.\nOverall, this movie was absolutely outstanding, the very best of Mamoru Hosada and is going to be very hard for him to top this but if their is anybody that can do it, is him.",
            "review_date": "2018-09-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unbelievable review score.",
            "content": "This was mediocre at it's best and outright boring and annoying at its worst. As a 41 year old I find Panda Go Panda way more enjoyable than this and that is totally aimed at kids.In fact playing the Panda Go Panda theme song for 90 mins would be much more enjoyable than this film.Any other mainstream anime film from Japan would likely be better. Princess Mononoke smashes this film and that is scored only 0.3 higher than this. The two films aren't even in the same league. I think we are now in a time period where reviews are totally pointless, so you might as well forget you read this.",
            "review_date": "2021-07-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Easily one of the best animated movies to have graced the screen. Director Hosoda's magnum opus is an ineffable joy to watch.",
            "content": "First let me address those who thought this movie was trying too hard or are writing it off as a cheap attempt to imitate the works of director Hayao Miyazaki. For those who worship Miyazaki, it is unfair to always compare other great Japanese directors with him because their work is different but also praiseworthy. Wolf Children was a heartfelt experience that made you feel as if you were part of the movie. The narration was executed beautifully and you could really relate to the characters and empathise with them. The conscious desire to live one's life to the fullest is shared by all intelligent beings that posses free will. Sometimes we have to make decisions - some which are immensely difficult - in order to set on the path that we chose to travel. This movie captures this message beautifully as we witness the werewolf children grow up and explore the life of wolf and man. It is fascinating to see the development of the child protagonists and the difficulty the mother encounters in raising them up safely in a critical human world. There is a lot of depth to many of the characters in this animation and the main characters are developed with great emotional complexity. Furthermore, the level of artistic detail in the animation is exceptional. In addition to this,enchanting music is used in various scenes (appropriately) to emphasise the feelings of characters or to accompany great visuals. I must say, the music was superb and evoked lachrymose or happy feelings. You can find as much depth and intricacy behind the motives of each character as you want. Some critics seem to say this movie is a mishmash of various movies that the director wanted to copy but I must disagree. Each of the outcomes that happened in this movie were just as likely as any other reasonable outcome. It was not clichéd. Think about it logically. For instance (SPOILER STARTS) Ame's decision to become the new Master of the forest was noble in the absence of the previous \"Master wolf\". He was always fascinated by wolves as was evident when he constantly read children stories about them. He wondered why humans seemed to dislike wolves and felt compassionate towards his animal counterpart. Ame's answer to adopt his animal side was probably because he felt a greater purpose and universal acceptance in the wild - something which was amiss in the human world where prejudice was the norm. In the wild he could coexist in harmony with other animals. He made a decision and for this he had to leave his mother and sister behind. It was a heartbreaking decision but his mother acknowledged his wish and was able to experience vicarious happiness by seeing her child grow up and live a fulfilled life. (SPOILER END)Animation, characters, plot, music, story novelty, emotional engagement... you name it, it is there. Rarely have I seen any animation or movie in general, to have delicately combined these elements to deliver a powerful message. I am certain that I will view this movie a few times again in the future. Well done to the director. I am sure he will create many great animations and hopefully people will stop comparing directors to Miyazaki and labelling them as copies. Everyone deserves a chance for recognition. Everyone has their own touch of creativeness. This movie was immensely enjoyable.",
            "review_date": "2014-08-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing",
            "content": "The movie follows a single mother whose husband dies and she has to raise her wolf children alone.She's forced to move out into the wilderness so her can children can have the freedom to change into wolves whenever they went. As they grow up the siblings want to go on different paths. The girl wants to go to school and learn to integrate with society. The boy wants to embrace his inner animal and stay in the wild.The story shows the efforts of a single mother and we feel for her. She gets help from the community to help her settle down. Lovely animation with a good soundtrack and some cute moments. Definitely worth viewing.",
            "review_date": "2022-10-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I Could Always Re-watch It!",
            "content": "When I first about to watch it, I thought this will be just another animation movie about werewolf's love with a human. However, I was wrong... it turned out to be far far better than just that.I didn't expect to enjoy it that much though, but it gets to me. This isn't some dramatique, cheesy, tear-jerking movie. I consider this as a heartbreaking yet lovely adaptation of a single parent daily life with her children.I won't say that she's in a special condition because her children are actually wolf's descendant because every child is unique and troubling in his/her own way, right?When I'm watching it, I feel so warm inside because I'd feel the love in this movie. The love from a mom, from a dad, from a son, from a daughter, from neighborhood... it's just beautiful.I could always re-watch it and still enjoy almost every single story it has in it. Anyway, I'm really expecting for a sequel! I'd totally watch it...! :D",
            "review_date": "2014-11-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The weight of life, the pain of growth",
            "content": "It's not just a story about a struggling mother, Tamori wants to highlight the experiences of growing up as a mother and child. Throughout the film, mixed feelings. I felt not only the mother's love, but also the vicissitudes of time, the perseverance of women, the sufferings of life, the joy and pain of growing up, the warmth and bondage of family, the insecurities and choices about the future, of course, there are also flowers that optimistic attitude towards life. Staff subtitles, the end of the film is very quiet and very warm, but the mood is still a long time can not be calmed, has been waiting for the end of the film after the song, slowly get up and leave the theater.\nAfter a few days of watching the movie repeatedly listening to the original sound, again and again by the clear and warm music moved, melting, my mind from time to time to emerge a family of good life, tears are about to flow out.",
            "review_date": "2020-03-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "THIS MOVIE IS AMAZING.",
            "content": "This is a beautifully animated movie that is worth watching by pretty much anyone. The story is told so well that I actually cried during the emotional ending, something that very few movies have done to me. The voice acting is really good, and the story is solid. Despite how emotional this movie can get, the overall tone is light. I don't see the point in continuing this review as it would just be an endless rant about how this movie does everything perfectly. Now stop reading this and go watch the movie.",
            "review_date": "2018-04-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Visually and musically impressive, but ultimately mediocre.",
            "content": "I'm just gonna say up front. I am not a fan of anime. I know it's become a popular genre over the past decade and has caused a lot of Japanese animated films to become mainstream, such as the Studio Ghibli collection and Ghost In The Shell (1995). I do like Ghost In The Shell and a few of the Ghibli movies, but this film just isn't my type of film. If anything it felt like two movies spliced into one, one about a woman falling in love and getting pregnant and the second about the same woman raising her children. It easily could have been a two part OVA premiering on a Anime based TV channel and I believe it would've benefited from said format. By only 30 minutes in I was checking the clock and sighing \"we still have an hour and 20 minutes left.\" My sister said that the film was written the way it was by Director Mamoru Hosda to emulate the feeling of watching these children grow up to the point of leaving. To which the film has done rather well, besides it being really boring. The concept while being inventively placed over a relate able story, really grabbed me when I was told about it but the execution is, dare I say, sloppy. There are better ways of telling this story. It probably would've made a better book than film. I think that Hosoda wants you to feel what the mother is feeling, but all I could think about was why can't the children just be mostly human and spend some time as a wolf just like their father? The film tries to justify the different paths Ame and Yuki take, but it all boils down to one wants to fit in and one wants to follow in their father's footsteps. This conflict should be interesting but It's only addressed in one scene. In a scene around an hour in Ame is crying because he wants to know why the humans hate the wolf. This makes me wonder why he stayed a wolf when he was older. If anything his fear would push him into his sister's position. The film feels confused whether it wants to be a character study of a mother letting go of her children or a film about choosing between who you are and who others expect you to be. I'll give Hosoda props for trying but this film just feels like a drink that wasn't mixed properly, the individual pieces are there but the overall piece is mediocre.Final Verdict: 5/10 Boasting some impressive visuals and a lovely score. This film had promise to be great but falls short. It's worth a watch, but don't expect anything amazing.",
            "review_date": "2014-08-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Devastating Beauty of Motherhood",
            "content": "After watching Wolf Children for the first time (in English), I cried for three days straight. Never before had I seen a film that truly gave me an emotional understanding of the sacrifices that mothers make for their kids. Selfless love doesn't even describe it. Everything about this film, from the lush landscapes of Tohoku to the divine score by Takagi Masakatsu, demonstrates an inimitable humanity that Mamoru Hosoda fosters for his characters. While all of his films since The Girl Who Leapt Through Time have explored themes of family and growing up, Wolf Children is surely his masterpiece.",
            "review_date": "2018-06-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Expecting Much Less but This was Perfect",
            "content": "I really like anime and anime movies always have great story to tell but for watching anime movies I need a certain mood , this one released 10 years ago but I only got to watched it today.They make this a perfect movie, It has beautiful animation,heartwarming music,amazing direction and all off them getting together in harmony.It's best anime movie I've watched for a while, I can describe this as Boyhood mixed with My Neighbour Totoro.There's no negative comment I really think of there's those very rare times that something clicks with you I hope it clicks with you too, don't wait to watch it like me.",
            "review_date": "2022-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Movie I've watched this Year",
            "content": "I'm a librarian, so as the only animefan librarian in the library I work at, I'm basically in charge of watching the movies and categorizing the movies after. I was surprised that I actually extremely enjoyed this movie. I laughed, I cried, and it gave me a warm-fuzzy feeling that good movies should! Before this movie, I was only into Studio Ghibli anime movies, but this movie has encouraged me to \"spread my wings\" and diversify my chose in movies. Before this movie, I didn't . care much for wolves, but after watching it, I actually want to go out and protect wolves. It's also nice to be inspired by a movie!My only problem with this movie was the rating. It was classified as \"PG\" when it should have been \"PG-13\". There were a few \"damn\"s and an S-bomb. On top of that, a STRONGLY implied sex scene and lots of implied nakedness. Plus, there's breastfeeding (I don't have a problem with it, but I can understand the sensitivity of it to others). Some scenes were extremely intense, which could easily distress a young child. I also enjoyed that only 1 of the 4 main characters did not vomit somewhere throughout this movie. In conclusion, if you want to watch a \"feel good\" movie about finding your calling and being true to yourself that will make your emotions shake and leave you inspired, I HIGHLY suggest you watch this movie.",
            "review_date": "2014-06-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ignorant crappy movie, crap plot, crap characters",
            "content": "Only watched it because it had really good reviews, I was expecting it to be wholesome, cute, and sad but it was just pathetic and ignorant. The ending was terrible, characters were terrible (except for the mother), and there was zero character development. Do not read ahead if you don't want to know how the movie generally goes**GENERAL PLOT SYNOPSIS**: It's a movie about a mom who sacrifices everything for her children only for them to make her life worse throughout the movie and eventually abandon her.",
            "review_date": "2020-08-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Japanese animation",
            "content": "Hana is a student living alone in the big city. She falls for a tall handsome stranger who turns out to be a werewolf. They have two children together. The older daughter is called Yuki and the younger son is called Ame.The romance is sweet but the couple needs a cuter meet-cute. The little kids are adorable. The mother's struggles are compelling. There are some heart strings being pulled in this movie and it's a terribly bitter sweet time.",
            "review_date": "2020-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I can't help but think it would have been better without the wolves",
            "content": "If the story were about a single mother raising two children after the father dies in a mugging, car accident, or cancer, I think the story would have been infinitely better. Take Usagi Drop, for example, nothing supernatural, just a man raising a little girl, and all the hardships that comes with that scenario. Here's what I would have done. Had the father die from cancer. Give him a military background. The son grows up wanting to be a soldier, just like his dad. He runs away, not to become a wolf, but to join the army. Nothing mom can do to stop him once he's 18. As for the daughter, she has all these big aspirations and a promising career...then ends up being a homemaker by choice. That's how I would have done the story. But Japan HAS to have a lot of supernatural stuff. As it is, the movie is nearly perfect. I just can't help but see the potential if the movie went full slice of life.",
            "review_date": "2017-10-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A brilliant story that makes me cry every time I watch it",
            "content": "This movie is amazing. Every time I watch I end up crying. It's a beautiful, on par with Spirited Away. This story follows Hana, a young college age girl who falls in love with a half man, half wolf. They have children, but shortly after the Wolfman suddenly dies. The film follows Hana as she raises her children, uncertain of what the future might bring. Lots of people brush this movie off as just some anime flick, but it's so much more than that. The story evokes so many life questions like, \"What kind of life do we want to live?\" and \"Am I being a good parent?\" I didn't expect to love this film as much as I did going into it, but it was so worth the 2 hours.Not only is the story wonderful, the animation is brilliant as is the voice acting. Personally I prefer the Japanese voices to the English ones, just makes this story seem even more emotional. It's highly recommended by me, and probably most anyone who watches this film.",
            "review_date": "2014-01-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very special film",
            "content": "It was very sad and truly to think the father died and Hana having to look after their wolf children. It really did hit hard on the family. I think the reason why the wolf man was killed because either someone shot him, hypothermia or a heart attack. Regardless of any of those, it was very realistic and truly upsetting. I would give Hana a pat on the back for all her hard work in rising those children into becoming independent adults. However I hated the fact that A me left his family so suddenly like Jesus that scene made me nearly teary!An absolute pleasure to have seen this film and I definitely rate this 10/10!",
            "review_date": "2015-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sweet tale of different siblings",
            "content": "This film covers some very different siblings as they grow up with werewolf blood. We see a lot of both dramatic and comedic moments as their werewolf nature can get the better of them. It is even more poignant since they are just children and this is portrayed well. It is interesting to see that the siblings have different relationships with nature as they grow up.",
            "review_date": "2020-06-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very sweet tale of very different siblings",
            "content": "This film covers some very different siblings as they grow up with werewolf blood. We see a lot of both dramatic and comedic moments as their werewolf nature can get the better of them. It is even more poignant since they are just children. As they become teenagers, they approach their relationship with nature and their animality in very different ways.",
            "review_date": "2020-06-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful Masterpiece",
            "content": "Wolf Children is brilliant. It is cute, funny, deadly charming, sad, dramatic and it manages to create that rare emotional connection with the viewer. The film is a timeless masterpiece and i am not just talking anime but film making in general. It is that good.The characters are extremely likable. The animation and outdoor scenes are breathtakingly beautiful. And although it's a hand drawn piece for the most part everything seems so real and vivid. Wolf Children proves one more time and with authority, that Japan is the most charming film land in the world.Easily 10 out of 10, and easily the single best film i have seen this year.",
            "review_date": "2015-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Company of Wolves",
            "content": "Having married a werewolf, a young Japanese woman struggles to raise her two werewolf children on her own when her husband dies in this unusual spin on the popular horror subgenre. 'Wolf Children' is such an offbeat take, in fact, that it hardly qualifies as horror movie with the human/wolf metamorphosis more of a metaphor for kids growing and changing and ultimately having to make decisions of what they want in life. The animation is spectacular, and so much so that it is doubtful whether the film would have worked half as well as live action. There is an amazing fluidity to the way the son and daughter change with a superb sequence in which the daughter runs off a porch and momentarily disappears, emerging as a wolf - an act that oblivious onlookers mistake for the girl hiding and a dog appearing. The great animation extends to snow, rainfall and flowing water too, all of which looks incredibly realistic. The film loses something though in the decision to have events narrated retrospectively by the daughter as an adult; the narration takes away from the first-hand experience of two children wrestling with their own identity and the narrative itself focuses a lot on the mother when the two children are far more interesting with their dual identities; the girl in particular is absolutely adorable. Never to mind, the film manages to spin an engaging story as it is. Especially remarkable is how well werewolf mythology is intertwined with coming-of-age drama and how werewolves are presented here as normal human beings, far from the monsters of traditional horror lore.",
            "review_date": "2016-02-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Possibly the most beautiful family drama there is.",
            "content": "This film is soul touching. It has one of the best female protagonists ever, it feels natural and not forced unlike what we see in propoganda feminist movies nowadays. The plot is very harsh and sad. This movie does no play around, it's a very heartbreaking story with interpretational quite ambiguous finale. Masterpiece.",
            "review_date": "2021-01-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome animated movie with a well executed message!",
            "content": "I've seen this movie 4 times now and every time, I've sympathized with the characters. When I watched Wolf Children for the first time, I wasn't expecting the amount of feelings that happened, even in the beginning. A story of a single mother raising two children that also happen to be part wolf is shown super well in this film! I would recommend this to anyone that likes animated movies with a solid story line.",
            "review_date": "2019-02-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "disgusting anime...",
            "content": "This is one of the worst animated movie that I've seen...the story pass too much fast and at the end that is terrible... they just made waste!",
            "review_date": "2020-11-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Family story",
            "content": "Very long and epic story about raising children with animal super powers of wolves. Lyrical tone. Long. About right. Some straying moments. A crazy story that comes out quite good for the family, I think.",
            "review_date": "2018-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A beautiful and tearful movie",
            "content": "This was such a beautiful animal. I always enjoy the way they are drawn and the powerful emotions expressed. Hana is just a normal university student, that is untill she fulls in love with a mysterious man. Once she finds out his secret that fall in love and children are soon to follow. Hana decides to move to the country side and here we have even more beautiful sights. Its a powerful story that at the same time is tragic. But the beautiful animation and voice cast make it all the more great. I liked how the names represented the decision the children choose in how they want to persue life. Overall a great movie and I look forword to seeing more from mamoru hosuda.",
            "review_date": "2022-08-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wolf Children",
            "content": "Absolutely gorgeous. This gives me hope that 2D will never die.",
            "review_date": "2019-09-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gorgeous, but sentimental",
            "content": "Wolf Children is a gorgeous film to watch, and there are some brilliant moments of filmmaking and cinematography. For me personally, I found Wolf Children to be too sentimental for my tastes, with the main character, Hana, the mother to Yuki and Ame, impeccably perfect and (as the film describes her) \"always smiling\". I would have liked some deeper themes to be explored in the story.",
            "review_date": "2022-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of My Favorite Movies",
            "content": "I'm gonna go out on a limb and say that a lot of people have probably never heard of this movie. But more people should be made aware of Wolf Children because it is one of the best movies out there. Not only is it one of my favorite animated films, it's one of my favorite films period.The plot revolves around Hana, who falls in love with a Wolf Man and has children with him. However, they harnessed the Wolf Man's traits and abilities as well. Suddenly when the Wolf Man passes away, Hana vows to take care of his children by moving to the countryside where we witness the two children grow up and take different paths in a 12 year time span.I could go on forever about this movie, but I'll try to shorten it. I'll try to keep this review under a year long, but I'm not making any promises. What makes this movie so great is the character development of Hana and her children. Throughout the movie, you feel like you're best friends with some of these characters which allows you to feel sorrow, pride, or sympathy for them. Another great thing about the film is the pacing. They spend a fair amount of time in each stage of the kids' childhoods which allows you to notice how they change as they grow up. Another great thing about the movie is the amount of maturity it has despite the fact that its technically a kid's film. I'll try not to spoil it for you, but it's pretty easy to spot. This film also has a great atmosphere, powerful character drama, unique animation, etc. Like I said, I could go on forever about this movie but I'm eventually going to hit the maximum amount of words that IMDb will allow.If you haven't seen this film, drop whatever you're doing and watch it right now because it's a very touching, cute, and heartwarming film that I believe is truly a gem.",
            "review_date": "2014-07-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Slow paced and boring.",
            "content": "Illustrations are similar to Ghibli films, with a warm atmosphere. When Wolf Man was working for a moving company, the license plate on his car was \"Tama\". It resembles Ghibli. Later, two children were born with Wolf's blood in them. In fact, there are many children in Japan who have the movements of wild animals. The scene where they found the old house also resembles \"My Neighbor Totoro\". I thought a lot of scenes were similar to Ghibli. The son went back to the forest because his blood was thick with wolf blood. Overall, the slow pace of the movie made me bored.",
            "review_date": "2021-12-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My favorite Anime Movie PERIOD",
            "content": "I think this is the thing that started me on the Mamoru Hosoda journey. The guy definitely has a \"THING\" for the duality of man. Every movie he does is about that. NOTHING wrong with it, and as a first movie to watch of his, it's one of his best. Ghibli is cute and all, but sometimes you want to see what else is out there. He isn't and this isn't Ghibli, nor should it be compared to it.The story is great, and makes sense if you brush up on some basic SHINTO stories. Only for the explanation and justification of why a wolf transforms into a man. It's a love story then it becomes a story about raising two \"alien\" children that share their father's wolf blood. And it does what I LOVE MOST in these 'fables\", doesn't answer anything. You're there for the journey, and that's it. There isn't a right or wrong answer, and he does a great job arguing both sides equally and unbiased.The only issue is, the animation isn't great. IT'S HYPER STYLIZED, with very beautiful backgrounds but the humans and main characters are all drawn questionably and kind of sloppy. I'm an Anime nut, so I'm used to it, but if you're expecting defined bends for joints like you'd find in a Ghibli or Khon picture, this isn't the place to go. None of his films outside the Digimon one, will offer that to you. THINK more LUPIN the III characterization (without the lankiness) of humans. Where Chins and necks kind of merge into one. Can be off putting. I've tried to turn people on to anime and it's an uphill battle a lot of times. This isn't a good \"FIRST ANIME\" for that. Go with \"The Girl Who Lept Through Time\" for more traditional character models in anime look. Another great Hosoda work.As my first Hosoda, I loved it, and liked his other works. THOUGH, if you started with others from his catalog, then you might pick up on some patterns, since sad to say, he only has one story to tell and he tells it in different ways. Which can be annoying and will taint this experience for you. It's a great story, that's kind of older-kid (like 8+) friendly, with a great message too. It's a children's film that's not DISNEY HAPPY ENDING CRAP. It makes a point that the world isn't black and white.",
            "review_date": "2022-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The different ways.",
            "content": "In the first half, I watched only how handsome the father was. So I was very sad in a scene of a garbage truck.This movie was filled with gentleness. It depicted severe life of mother and children and their growing in detail. I liked the scene they cleaned their new house.\nEven if parents brought up their children equally, they don't have same views and feelings. Although they quarrel sometimes, the deep connection was made of a lot of memories of precious love.",
            "review_date": "2019-07-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I cried so hard",
            "content": "This movie is a very beautiful and touching anime movie Hana meets a man who is a wolf and they have two kids who are half human half wolf but then the father dies unexpectedly which made me cry so hard and the animation and story setting and plot are both wonderful and touching.",
            "review_date": "2022-07-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A mothers love will unite worlds",
            "content": "I'm actually not the kind of person who was ever crazy for Japanese animated movies. Sure, I've seen some of Miyazakis works, which are great, but nothing took me totally away. Well, until now.Wolf Children tells the story of Hana, an young woman who is, after the death of her husband, left alone to carry for their two small children. That already is not always easy, but because their father was a wolf man, Yuki and Ame are too part wolfs and constantly shift shapes. Hana realizes that it would be bather to rise her children in the country and starts a new life in an old house near the forest. While you may think its hard to make a two hours movie about a mother with two children, this movie will totally blow you away. Both Yuki and her brother Ame are adorable to watch when they are small and you feel for them while they grow up and go their ways. Hana is by far the strongest animated woman I've ever seen. The love between her and her husband is sincere, her energy to rise these two children, while there is nobody she could ask for advice or help is exemplary. Actually, I don't know how to describe all that love she has in her. And the animation is an masterpiece on its own.I warmly recommend you to see it, and I'm sure you will cry more than once",
            "review_date": "2015-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Above average anime although not spectacular",
            "content": "Compared to other anime, this is above average only. Its not very realistic story through out but still able to entertain with not too much illogic.Overall the story is just so so, nothing exciting nor stunning.",
            "review_date": "2022-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A heart-melting story",
            "content": "OVERALL: 9/10 STORY: 7/10 ANIMATION: 8/10 SOUND: 9/10 CHARACTER: 9/10 ENJOYMENT: 9/10This is my first review, I hope I don't mess things up. I kinda want to do reviews because it can help me in the future if I decide to re- watch it. So...THE GOODS: I think the story was pretty good and fairly original. But it's not the story who had a big impact on me, it's the characters. I can't even describe how much I loved the characters, especially Hana. I honestly can't recall, except Nagisa from Clannad, a more pure character. Like she is such a nice and kind-hearted person that it melted my hearth. It was so so overwhelming that from time to time I started crying. And there are her children who have a spectacular evolution through the whole movie. The sound and the art were also pretty good.THE BADS: I honestly can't recall anything bad. You will enjoy it from start to finish. It may be a little slow from some, but I think it has a good pacing.I don't give it a 10/10 because it doesn't have that *spark* that made me gave other anime or movies a 10/10. It doesn't mean it isn't perfect how it is.",
            "review_date": "2015-09-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Spectacular Story That Isn't Your Average Werewolf Tale.",
            "content": "I first heard of this anime film when I came across a preview of it featured on the Imagine-Nation segment of NHK World Programming on WLRN Learn/MHZ Networks less than a couple years back. From what I saw, it looked like it would be great, in fact, great enough to pique my interest. I don't know about anywhere else, but unfortunately, for some jacked up reason, it was somebody's dense-behind idea to drop it from airing in my area suddenly over a year ago and I haven't been able to see any shows nor movies on there since. Had I not seen coverage of this movie on that show, I probably would've never known about it or who knows how long it would've been before I found out some other way. Anyway, then I waited to see if there would be any advertisements of the film hitting theaters in this country, the U.S., and whether it would receive the English dub treatment or not. Never saw any ads for it playing in theaters here, so I presume it must've had a limited release, at least in the states. Several months later, I decided to search for a copy of this movie to watch and stream online, and discovered, just as I was hoping, yes, it's been dubbed into English. Took me a while to find the perfect site to view it and after finally bypassing a few problems, like malfunctions with a video copy, I eventually finished it a couple weeks ago. Had to see it online before deciding whether I should buy a copy of it on DVD. Now I, too, have to type a review and share my thoughts on it.I enjoyed this very much and once I viewed it, I knew I enjoyed it enough to want to buy this on DVD, which I plan to do later. One of the best from this decade, it's brilliant. What I love about it is that it's not like any other flick about werewolves or lycanthropes. This doesn't follow the same-old formula of the horror plots of the creatures depicted and portrayed as monsters as often is the case. A young woman and college student named Hana meets a young man known simply as The Wolfman. One night, he shares with her a secret about his transformation ability, but this doesn't faze her nor drive her away. Rather, she's in marvelousness of this. They marry later and have two children soon after, a daughter and a son, named Yuki and Ame, who inherit their dad's special ability. But one night, tragedy strikes when the Wolfman gets into an accident, leaving Hana widowed and the children fatherless. After the surviving family members move to the countryside, Hana struggles to try her best to keep her offspring from revealing their power to the rest of the world, as do the kids themselves, as they go about their daily lives and attempt to act, and look normal like everyone else. Possibly the most common theme is Yuki and Ame striving to fit in a world where everybody else is conventional. For if they revealed their alternate sides, forms, selves, or identities to others, they'll be treated as misfits and freaks. Things seem to be going mostly so far, so good during the kids' early childhood. A few years pass, Yuki and Ame are nearly junior high age by now. It's gotten harder for them to keep their lupine alter-egos hidden, especially for Yuki, when she has an incident that gets her into a predicament at school. The two, who aren't quite ordinary but instead extraordinary, gradually begin to drift apart. They have different ideas and opinions about where they should get their knowledge, as well as whether to embrace their wolf half, and don't see eye to eye with each other, and they get into it . As a result, they suffer from an identity crisis. Can they overcome their differences and see each other's perspective?I won't give away too much more of the film, but the theme I mentioned is basically what makes up the main point. Another is fear of being ostracized. It's great to see that the Japanese animation industry hasn't slacked up on using at least partly the 2D/traditionally hand-drawn style in their animated movies altogether, which is a breath of fresh air, unlike the American animation industry, as much as I really hate to say it, and I wish the cartoon industry here would follow suit in Japan's example. The overuse of the CGI format is overkill and the more it's used exclusively, the more I come to resent the heavy emphasis on it. The balance in the animation styles needs to be co-existent again. Wolf Children is another recommendation I give. It conveys a great message and is all-around spectacular, I loved it from beginning to end. I enjoyed the majority of it and I can't complain too much about it, except my only qualm is the ending or when it gets towards it. I thought it could've been better, it felt like it was lacking something. There are a few things I would've liked to have known more about which I won't reveal just what exactly. I hope to see more projects from the up-and-coming filmmaker in the future.",
            "review_date": "2014-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another masterpiece by Mamoru Hosoda",
            "content": "Konichiwa :3There's not words enough to describe how beautiful, original and amazing this movie is. Wolf Children is really underrated, and I wish more people would know of this movie. In fact, I will be forcing everyone I know to watch this right now so that they won't miss such a masterpiece like this. There's beautiful animation, an interesting concept, a storyline that's addicting, well written dialog, and all in all a great movie. People keep asking me why I prefer 2D animation, in this age we live in where the technology is present. Well, Wolf Children is a perfect example. This is why I love 2D animation. There's charm, there's emotion, there's something so unique that 3D animation just can't achieve. I just prefer the old ways of animating. It's a beautiful art form.Now to the movie itself, it's from the creators of the much beloved \"Summer Wars\", one of my favorite animés. However, this one just topped the list as the best movie I've ever watched, and not even counting in my top anime list, this is one of the best movies I've ever seen.There's the story, there's the emotions, there's the beautifully crafted animation. What more can you ask for? I promise you, that this movie will change your life. I mean, seriously. It's been two weeks since I first saw Wolf Children and all I can ever think of is Wolf Children. I just can't get it off my mind. In fact, I'll watch it for the 16th time. I never get tired of it. It's original - it's suitable for everyone. The whole family can watch it, both kids and adults.The ending left me wanting a sequel, and I really do hope they make one. I have a lot of ideas that could be cool. Oh well, while waiting I guess I'll write fan fiction of Wolf Children then. lolSeriously, though. Watch it. You won't regret it.SO KAWAII =3",
            "review_date": "2014-06-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm crying",
            "content": "Wolf Children is an incredebly cute and touching film.Although it is a fantasy anime it felt so real.I have rarely cried so much in a film.One of the best and most emotional animes I've seen in my life.",
            "review_date": "2021-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I should sue all the people here who said this was good!",
            "content": "If I could sue people here who assure that this was a good film, I WOULD. But I recognize the story line and graphics (landscape, etc) were good. But this movie is a total waste of time, specially if you like good endings (some good and others sad) but GOOD!! I couldn't be more disappointed than what I am, If i could say with words how awful it was, I would, but I'll try. Was beautiful how hard working the mother of the two kids was, but she lack many things, and the result of her lacking was what happened in the end. I don't understand why they had to decide what they wanted to be, if they were both things? They were humans and wolf at the same time, why did the boy leaves her mother to \"take care\" of the woods? and he was a disobedient kid, with no respect for her mother and her sister. The mother didn't know how to control, educate nor discipline her kids and in the end she just lost both, of course people here may say she was a good mother and the message was beautiful (decide who you want to be, be free) but people mistake this message and more than anything they were JUST KIDS is like asking a baby what does he want if coke or milk? I mean WHAT!!??? SERIOUSLY are you gonna ask a baby what does he wants to eat???? That's why our world is falling apart. Just please don't waste your time watching this movie as I did.",
            "review_date": "2016-02-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rain and snow",
            "content": "The movie starts with the loss of the wolf dad. The mother took her sister and brother away from the city, rented an old house in the country, cultivated fields to grow vegetables, and lived optimistically. Such a story may be bitter, but the audience is quickly replaced by the cute character set and beautiful mountain scenery. With a soft and unrestrained style, interesting stories for all ages, many details can't help but remind people of Hayao Miyazaki and his animation kingdom.It is no exaggeration to say that Hosoda made a cartoon into a live-action movie, not a toy for amusing children. He makes \"Wolf's Children Rain and Snow\" have a peculiar story charm. Even if there is a show of dazzling in the middle, the movie makes people believe that this animation does have a rare truth, goodness and beauty, and the director has Strong willingness, hope to pass on to the audience. At least in the soft pictures and on the vivid characters, we can deeply feel the sincere and delicate emotions. It is really not a distant fable fairy tale and has profound practical significance.",
            "review_date": "2020-04-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not as good as Summer Wars, but then what is?",
            "content": "Version I saw: UK DVD release (subtitled)Actors: 7/10Plot/script: 7/10Photography/visual style: 7/10Music/score: 7/10Overall: 7/10Wolf Children is the third film from director Mamoru Hosoda, after The Girl Who Leapt Through Time and Summer Wars. The latter is an incredibly difficult act to follow, and although Wolf Children does not quite come up to that standard, it gives it a damn good try and comes out with plenty of credit.It's a mythic story, drawing on Japanese folklore stories of wolves that could take on human appearance. This idea is transposed to modern Japan, where it is played out as a love story between a young university student and a mysterious man who turns out to be a wolf. They have children, and then he is forced away, leaving her to raise the children by herself.Family is a major theme of what follows, and as in Summer Wars, the family relationships really have the ring of truth about them, to me at least. This is clearly a strength of Hosoda's work, and that of writer Satoko Okudera. Interestingly, their perspective seems to have shifted between the two films, from that of the youths to that of the parents. Everyone grows up, I suppose.For my full review, see my independent film blog on Blogspot, Cinema Inferno: http://cinemainferno-blog.blogspot.co.uk",
            "review_date": "2014-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Made me into a train wreck",
            "content": "I'm just writing because I really need to tell other people about how powerful this film felt to me: not only is it full of beautiful shots of both static scenery and movements, it also made me cry. A lot. I have certain ideas as to why it made me cry so much, especially concerning the movie's main themes, but what I want to stress by mentioning that is simply that a fairly simple story has managed to provoke intense emotional reactions on me, which I find simply fantastic. The story works around the many problems and hardships first time parents go through, with the added bonuses of being solely a mother, the children being werewolves and Hana not being in a very good financial situation. Normally, those elements would make for a somewhat predictable, lackluster tale, but the mother's perseverance and refusal to give up or succumb to depression make the story heartwarming.It reminded me of Up! in certain ways, like how we are presented to a love story in the very beginning only to have it turned into a tragedy by the death of one of the loved ones, and yet there are also many differences, seeing as the movies have clearly different focuses. Up! seems to be centered around finding joy in life again and fulfilling dreams even if you can't share them with everyone you love, whereas Wolf Children is centered around a mother's love for her children and how far she'll go to see that they are happy. Definitely giving it a 10/10, particularly because of the insanely strong emotional response I had...Great film!",
            "review_date": "2015-02-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A beautiful film",
            "content": "Whilst the writing could be seen as a bit odd, I think the themes of family, the vibrant animation and the characters make up for it. I cry basically every time I see it and I think that shows how well it can effect people emotionally.",
            "review_date": "2020-07-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wolves! Wolves! Wolves!",
            "content": "I watched this a few years back because I saw \"wolf\", and remember loving every single moment in it, not just the wolf parts. It was beautiful, and I loved the characters and how they grew up and changed.I remember watching certain parts over and over again to relive the happy moments in their lives and skip over the sad ones, although they were just as important to the storyline.This movie was very important for me at the time. I felt very connected to it very deeply then, although I'm not sure exactly why looking back, which is why it's not a 10/10.I'll need to rewatch it again soon though.",
            "review_date": "2020-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful and touching.",
            "content": "I watched this years ago and remember not loving it, but upon this viewing I liked it a lot more. The mother takes a little while to get used to, and the changes in the children I thought were interesting. Conceptually I think this movie is great, but the odd human-ness the wolves have throws me off a little bit. Overall, a good watch if you can get through the awkward beginning. Best part for me was the mountain people and the beautiful illustrations of the wilderness, house, and farms.",
            "review_date": "2021-05-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hosoda really nailed it!",
            "content": "It always amazes me how Japanese animation depicts even wild creatures like wolves in this case, which apparently seem rather frightening and spooky at first sight. That's why I was so intrigued by this movie and got only one question: \"How is would be possible to transform them into positive and fascinating protagonists?\"In fact, this story was so emotional and tear-jerking. I actually couldn't repress my tears while watching some scenes. As a mother, I essentially realised how it was stressful and nerve racking to start everything from scratch and move forward. On top of that, there were various exemplary situations that supposedly almost everyone can relate to. Total misconception about raising kids, gruesome loss of a beloved one, tough survival of a single parent, adolescent puberty issues and choosing one's own path - these are the key factors represented in this film.I was sobbing when watching it! Highly recommended!",
            "review_date": "2021-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Okami - Wolf",
            "content": "The story delivers many beautiful messages, it shows how life can surprise you, in positives and negatives way. Wolves...they are such a majestic animals.\nThe animations are great, it shows the soul of an anime movie. Emotional and beautiful.",
            "review_date": "2021-01-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful",
            "content": "It is one of the best anime I have watched. The subject is extremely creative. The process of the film is progressing in an excellent way and at the same time as the events of the humorous show and the drama of the film, it gives an excellent process and curiosity to the audience and finally ends with a satisfactory and dramatic finale. In the second half of the film, there is a relaxing and quiet part that gives a person a sense of peace, which shows the calm before the storm and makes people attracted to nature and disgusted with the modern world.I recommend that you definitely watch it, simple illustration but very excellent and attractive subject that keeps the audience in front of the screen until the end of the movie.",
            "review_date": "2022-11-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Emotional.",
            "content": "I watched this whole movie and it went by really quickly. I don't know what to say except that this film conveys the growing up and what it means to be human. You will really feel it. This movie is so full of moments and you won't regret watching this. Highly recommended.",
            "review_date": "2019-06-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Piece of Art",
            "content": "This movie is a piece of art, it explores how much of a sacrifice a mother has endured in upbringing her kids. Truly a masterpiece.The story is about a hard-working college student who falls in love with a Werewolf, they have two children Yuki & Ame. After Werewolf's death, the mother and two children move to the countryside amid difficulties in city life. The struggles of single parenting and the emotional adventures of this little family compile this heartwarming story.The movie is just beautiful, the animation, story, pacing, and top-notch soundtracks make this a piece of art. Characters are realistic and the fantastical elements add even more of a compartment to it. I highly recommend watching this.",
            "review_date": "2020-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good, but not as good at all the hype.",
            "content": "Let me start off by saying this review will have some spoilers in it, so you have been warned.Wolf Children is the story of Hana, a college student who meets a werewolf and falls in love, has a whirlwind romance, gets pregnant, and ends up having to raise two werewolf children on her own. Hana deals with problems, some of which will be familiar to most parents, and others which will be familiar to most dog owners (such as chewing on furniture). All things considered, Wolf Children is a solidly good movie. However, it's not as good as the hype it's received.Let's break it down:Animation: 9.0 This is full of high quality visuals. Absolutely beautiful, especially the gorgeous scenery once Hana moves to the country! All the motion is smooth, the colors are outstanding and vivid, everything looks amazing. If there is any flaw, I would have to say the initial transformation of the father into a wolf was a bit of a letdown. It's pretty much just a slow morph from man to man-wolf, and it really could have been a lot better. This movie has little to offer in the way of effects, and this transformation was their chance to shine, and I feel it was a missed opportunity. But still, it's a small gripe. On a side note, I'm a bit confused as to why Wolf Daddy tells Hana not to watch him transform, and then proceeds to transform extremely slowly over a couple of minutes (which of course Hana sees), however it is clearly established later on that the transformation can be instant.Sound: 8.0 The voice acting was great. Very believable emotions, and the voices seemed to fit the characters very well. The music was good but not great. It was the typical orchestral background music which you would expect for a movie like this, and there really wasn't anything wrong with it. However, there wasn't anything which I could listen to by itself. To get a perfect ten in this category, I have to be looking for the music online after I finish watching the show, and that's not the case here.Story: 7 The story is good. We see approximately twelve years of Hana raising her two wolf children from infants to middle school. Each has to find their own way, human or wolf, and it is interesting to see how they make their choices and how they deal with their dual natures. This was a great concept, which you would expect from Mamoru Hosoda, who brought us Summer Wars and The Girl Who Leapt Through Time, but the concept wasn't masterfully executed. Actually, it did seem like the movie was trying too hard to be a Ghibli film at times, especially once they moved to the country. Specifically it was like watching Totoro, but with less magic and mystery. It had the look but not the feel. There are some scenes which are badly mishandled. (spoiler!)Toward the end, Ame, Hana's son, runs off into the woods during a typhoon. Mom, of course, runs after him nearly dying while trying to navigate the woods during the intense storm while searching for her son. Unfortunately, instead of playing this as an emotional farewell, it is played for unnecessary drama and excitement. Why? Because the show was nearing its end, and they needed a dramatic climax, that's why. It was fairly obvious and I was not impressed by it. Finally, the story lacks any real ending at all. We get to see that the children have decided which world they want to live in, but that's as close to a resolution as we are going to get. This is, after all, a slice of life film, and that's what we get. A slice.Characters: 7 Hana is the main character, and that may be one of the movie's biggest problems. Miyazaki's films had a sense of wonder, mostly because we experience the world through the eyes of very young characters. In this movie, we mostly experience it through the eyes of an adult going through difficult circumstances. The story is narrated by the daughter, but she is only a major character for the last half of the movie. The father is a real letdown. He is only in the movie very briefly, has only a few lines, and apparently passed on a genetic predisposition to run outside during horrible weather. In fact, we never even learn his name, which pretty much relegates him to the status of an extra. Overall: 7.75 I liked it. I would recommend it. However, there's nothing here that's going to bring you back for a re-watch. I should also point out that my wife and daughter actually got angry at me for not giving it a perfect 10 rating, so it apparently appeals more to female audiences. But I stand by my review.",
            "review_date": "2016-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good, emotional family movie",
            "content": "First let me say that if this movie was developed in the US it would be good enough for quite a lot of praise here in the States, and wouldn't be looked at as an oddity like Japanese animation almost always is around here. If Disney made this it would be as well-received as anything they've produced in the past 20 years.This is a good family movie about a mother caring for her children, who just so happen to be able to turn into wolves. This is not a fantasy story however. The shape-shifting element is used as a metaphor for children growing and changing as they grow, and how parents must eventually come to grips with what their child wants to be, even if it isn't what their parents hoped for. It's a great story-telling device that works well here. The movie is pleasant and also touching, especially at the end.My only complaints would be that the movie moves pretty slowly. It runs right under two hours but it felt like three. This is a movie adults can watch with their kids, but I'm not sure a kid wouldn't get disinterested somewhere in the middle. Also the ending, while touching as I mentioned, is a little disjointed in my opinion. It arrives not quite when you'd expect and then all of a sudden that's it. I thought it was a tad unceremonious, but other than those two things it's a really good movie that everyone can enjoy.",
            "review_date": "2014-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mother's love is the best thing that can ever happen in the world",
            "content": "The only word mother describes this movie. A wholesome one,sad but beautiful at the same time.i could give 10 to this movie but a felt sad about their mother. Her two children lived their own life what about her mother. Her life is as sad as ever with full of sorrow.she deserved a happy life more than anything. Without this i have no problem in this movie. A beautiful one.",
            "review_date": "2022-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't Need to say\"Must watch\" Because it is",
            "content": "This is story that I can never forget and would always be a great inspiration for me in life. I am completely mesmerized by Hana. When her husband dies and after which she faces many hardships raising her children I thought she would tell her kids to not become wolves for her sake but the way she raised her kids I could have never thought while I was watching the movie. The story has few more ironies which fits really well to the story. Yuki was very lively and loved being a wolf, whereas Ame was afraid because he thought that humans hated wolf but as the story progressed completely opposite happens. The manner in which this thing happen in the story can only be appreciated if people see this movie. I may write hundreds of words after falling madly in love with the story but these words of praise can only be appreciated once you see this. Believe me this story will make you regret your way of living life. To be honest I am already starting to feel the pressure whether I can really change my life but if I fail then what's the point of me writing all these words. Wolf children is certainly not the story to miss out. The story may not be complicated but it is a story that needs more than just applause. The character build up is fantastic. This is a story about motherhood and her unconditional love towards her children. Hana though being alone after the death of her husband kept on smiling for a very simple but heart touching reason that her name meant that she would always smile and never let her loved ones feel alone even in the toughest of times. Yuki her Daughter was also very lively and energetic, which really made me cry because I realized that I was also very similar to her as a child and how I have let myself down after growing up. The moment in the movie which really made started making feel \"Hang on I may have hit jackpot\" (not really correct choice of words but something even better than Jackpot) was when she says \"I don't know how to raise wolf children\" and the moments just after that, from there on It was just a masterpiece. I have seen \"girl who leapt through time\" which is also from the same Director which was quite emotional as well but in those terms this movie is even better than that. I cried for 3 days after finishing this movie (Of-course not continuously but whenever I was alone I would burst out and cried). The one other Anime which made me cry for this long was \"Your lie in April\" which is was also very emotionally intense. I have seen quite a lot of anime and also lot of non Anime movies and TV series and I just think that there is definitely something different in the way Japanese people think. Because If I have to give the names of few best movie or TV series in all the different genres or combined I would say that there would be Anime stories at the top of every list. This is something which I am actually very proud of because I have seen people neglect Anime just because they think that it's for Kids but let me tell you if there is really something worth watching, then these Japanese Anime would always be at the top and for this I don't need to tell anyone that please watch this, because if they don't then they don't deserve to watch these Japanese Masterpiece.",
            "review_date": "2016-04-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Paying for love",
            "content": "The movie is as beautiful as \"The secret of Kells\".It is beyond imaginations such a beautiful movie can be made out of animation laboratory. The movie is all about the pay for a true love to the eternity. In the contrary to \"Titanic \" the lady love here is an exemplary true lover .What sacrifice she made? Wonderful ,it is wonderful. I felt me and mother in it .Mother's sacrifice for her children.Chidren grow to adult and leave house but for mother they are always children in her heart. I am extremely thankful to Director: Mamoru Hosoda ,Writers: Mamoru Hosoda (story), Mamoru Hosoda (screenplay)and Stars: Aoi Miyazaki, Takao Ohsawa, Haru Kuroki. Everybody has done their beautiful part. A lady is all about sacrifice.The sacrifice of a lady as lover and role model as mother is marvellous .I could feel my mother .I was in bliss when watching .Thank you again script for your beautiful imagination .Thank you director ,translating the imagination into real touch by marvellous animation touch.",
            "review_date": "2015-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A beautiful story!",
            "content": "Well, it's a nice and beautiful story. You can watch it on a nice rainy day on TV seating on the couch. It has got a lovely and sweet script for sure.",
            "review_date": "2020-05-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sad but stunning",
            "content": "I found this film by accident, I love anime and it was on a list of anime to see this film is stunning in its story of children trying to fit in who hasn't had that problem, I won't give away the story but I will say that I cried many times, and I'm a hard but to crack. If you love anime give this a go you'll not be disappointed",
            "review_date": "2018-08-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "wonderful concept",
            "content": "This movie, moved me into the root of my heart. Japanese anime have such depth telling stories with connection to nature and relation between beings, both fantasy, animals and humans. The animations really brings out the beauty in all.Such a wonderful movie, i loved it.",
            "review_date": "2017-05-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bound to touch your heart",
            "content": "A masterpiece by Mamoru Hosoda, the acclaimed Japanese director. A widowed mother's struggle to raise her tabooed werewolf children has cast serious glimpses on many issues. The underrated details in the movie like the flora or the books or even the frosted window pane, sure add a life to the viewing experience. Being an animated movie it will put many of alike to shame. Such powerful compassion, human emotion and little of everything, is rarely possible in a mere 120 min long cinema. We think we are \"SO\" good at making animated movies. Well let me tell this- Krishna, My Friend Ganesha and a bunch of mythological mundane stories add nothing to our system of creativity. The Indian filmmakers should learn not just the basics, but EVERYTHING from this movie. What animation really mean, how compelling a story can be, what originality means; not the same old Ramayana and Mahabharata. Why should we must cling to age old things even through our advent into future? Wolf Children will compel you to think, realize and believe. It's bound to make you emotional. You wish there were more to this, but alas faint disappointments trod your mind. There could not be a better ending. I never imagined a Japanese animation movie will appeal to me so much. A powerful drama of love, struggle, compassion and adventure. Absolutely brilliant! I recommend and urge everybody who is capable of emotions to remove doubts and anime stereotypes from their mind and watch this one. P S- This is not a cartoon. This is not intended for children as some ignorant hobos would say. You may (not) watch the movie at your discretion. But if you say that only children watch such \"type\" of things, mock it while you engorge yourself in another Dhoom or Krrish or StepUp pandemonium pointing them as \"worthwhile watchable\", then take this as my short F You Note.",
            "review_date": "2014-05-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Try it.",
            "content": "It was pretty good anime and story was presented with a great way .",
            "review_date": "2021-09-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stunningly beautiful. A love story at its heart.",
            "content": "A breathtakingly beautiful movie, something you would expect from Miyazaki/Ghibli. Though I won't hesitate to say that it surpassed many of Miyazaki's films, at least for me. At its heart it is a love story. The character of Hana is so beautifully written that you really feel for her all the time. The hardships she has to go through to raise her extraordinary children is so effectively captured (or drawn). The wolf children, especially their younger versions are so adorable. For example, the way the little girl changes back and forth to wolf/human when demanding something from her mom was so cute. It's an almost 2 hours long film which comes as an advantage as every single detail has been given its due time. Animation is stunningly beautiful!, especially the nature/forest scenes, with a very impressive mixture of both 2D and 3D animation. I love nature and this film was full of it. Sitting here in Denmark, dark and cold winter, I really felt under shining sun while watching this film :-) One of my all time favorite animated movies. Period.",
            "review_date": "2015-02-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "For me, one of the best movie i have ever seen!",
            "content": "I have watched this movie over and over again for four times in just two days and i still crying, enjoying it everytimes like the first time, it's just that good. The characters are amazing, the amimation is stunning and if you've been raising by a single mother, this movie will definitely be your all time favorite.",
            "review_date": "2020-05-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Will not disappoint.",
            "content": "I just realised that Mamoru Hosada also directed summer wars, the girl who leapt through time and Mirai. I thought the animation style seemed familiar. The movies mentioned above were amazing but I feel like wolf children takes the cake. Truly unique and interesting throughout. I love that every choice and action is poignant and meaningful. Hana indeed raises her two wolf children to the best of her ability and that scene where she calls out to Ame at the end was heartbreaking to watch. Yes that one scene in the beginning treds the line of beastiality a little but all it is there to drive the plot forward.",
            "review_date": "2020-08-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mother's Love and Affection beats the circumstances of Life",
            "content": "At first I have to say this film is worth 8.2. The sweet flow of the anime is really great. Mother's affection, which is the main topic of this sector anime, is presented perfectly by Hosoda(Sir).... This is one of my favorite anime films of all time.I appreciate that it has no such sides which contains mystery, thrill, action, adventure (The things mankind prefer much nowadays) but the significance of Mother's Love can't be shown much greater than this film.Especially I have no intention to spoil the story, but i can't help mentioning the best line from the trailer- \"You can think this is a fairy tale but, to a mom it hadn't!\" My Review - \"You may feel that you are a complete misery to the world but don't think so.... because you will always be a same treasure to your mother even if the world is against you, she will always be at your side.\" and this is my thoughts that snatches me into the core of the film..really...really great film, just try to give it a run. It is a pure family anime, you can enjoy it with your family members.Thanks for paying your precious time to read this anime. I think you will appreciate my thoughts.",
            "review_date": "2017-09-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rated it 9 but i think its 10 ;) It will find something hiden in you.",
            "content": "What to say , family can watch this , and talk after about it for days. Kids will like it , adults will like it. So many questions will be raised.Its story about growing up and searching for YOUR place to be in the world. Your secret place.",
            "review_date": "2018-03-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you are a parent be ready to shed some tears",
            "content": "Do not be distracted by seeing wolf in name. This is a movie about family, parenthood and growing up.If you have children you will cry. If you are not parent still will feel the warmth of this movie.Truly unique and beautiful story.",
            "review_date": "2021-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "UNDERRATED",
            "content": "Just wow! already in my top 5 animes. simple yet heart touching story, decent animation, perfect characters. main focus is obviously on mother, who tries to raise her wolfy kids far away from humans societies, and how she suffers,(a perfect anime parent) i cried like 3 times watching this and i watched kimi no na wa with almost no tears at all, so you can tell what am i bringing here .. ..",
            "review_date": "2018-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing",
            "content": "I love this movie. I would like to see more of Hosoda's work, and while this movie is fine without a sequel, I want to know what it would be like. However, there are some things that keep me from rating it a 10/10. One reason is, while Yuki, Ame, and Sohei are supposedly preteens at the end of the movie, they look and sound like they are too old to be in that age group, they look/sound more like they're in their late teens or young adults. While the CGI is good, it can be distracting at times. Nevertheless, it's still pretty good.",
            "review_date": "2018-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why do people like this movie?",
            "content": "The pacing is terrible. The characters are un-likeable. The mother is okay. As for the children they are annoying. The brother is okay as a child. When he gets older he gets just completely changes for the worst. Yuki is so annoying. Literally abandoning his mother after everything she has done. She almost died looking for him. Yet he still left without a thank you, or anything. It was super selfish and the ending was so lame. Don't waste your time with this movie. Instead if you want a movie with wolves watch princess mononoke.",
            "review_date": "2021-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A story about a beautiful mother",
            "content": "Wolf Children is a story about a woman making the best out of what life is throwing at her. She'll do anything to protect her children but at the same time make enormous sacrifices to see them happy. The movie is also a wonderful coming of age story for Yuki, the daughter, who grows into a lovely young lady whose character has you caring for her every step of the way.",
            "review_date": "2021-09-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A movie which perfectly pictures the struggles of a single mother.",
            "content": "This movie is really a beautiful expression of how efforts does a single mother put in raising her childrens.",
            "review_date": "2021-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best modern Just animated movies",
            "content": "Wolf Children is a dumb name. When you stop to think about how is it without knowing anything about the project, probably you think in something like Alvin and the Chipmunks (2009) with wolfs instead, but don't worry! It's not lame, forced, manipulative, or cash grabbing like the Chipmunks movie. In fact, you can pretty much reverse everything I just said! It's well made, emotional and feels much more like a movie make for the art rather than the money. The writing is wonderful, with a simple but good premise! And the voices used to make those characters make most of them all the more real, combined with the animation and soundtrack and this feels like a documentary about a mom raising Children who can turn into wolfs rather than an animated feature. BUT I said almost for a reason, and that is that sometimes the mom can be to much happy to the point of annoying some people (at least that what happened to me). But again, it sometimes, not all or the majority. And when it happens it doesn't ruins the film, it just weakness it a little bit, and that's why I can't give it a 10/10. Still you should definitely check it out if you are a animation fan (specially Japanese)",
            "review_date": "2019-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "want to see a good anime about animals? watch the cat returns",
            "content": "oh my gosh where do i begin, oh hi! didn't see you there! this is my first review! let us see what i am reviewing! *looks at paper and burns it* NOPE NOPE NOPE I'M NOT DOING THIS *gets dragged back into studio* this is wolf children, just so you know there are spoilers so watch out the movie begins with someone talking about a dream or something, it then shows a school, a girl is having trouble with stuff or something (it has been a long time since i watched this) and sees a guy who it is obvious he gonna be a wolf or something and gonna marry her! after her chasing him they get married later and he can become a wolf (if this is like twilight although i haven't seen it get me out of here) they have 2 children then the dad dies (did Disney work on this?) and, wait, he was a wolf when he died and he was getting food, what was he gonna get her? you know what i don't want to know. after some troubles where she lives they move, one of the children wants to be a wolf and another accidentally cut someone's ear, after tons of boring stuff the children grow, they boy being a wolf to take the place of a dead fox, and the other grows up and probably gets married the mom lives on her own blah blah blah happy ending, this was just bad, i would watch Garfield's fun fest over this and that movie is terrible! in the end if you want to watch a movie about animals that is anime watch the cat returns, how do people like this and it got awards and stuff? i don't know to be honest.",
            "review_date": "2017-05-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful",
            "content": "I don't often write reviews to films that I watch off unless they are something special. Wolf Children is just that. I'm not going to include any spoilers in here, or go into analysis of the plot. However, let me tell you that this film will move you. Numerous times during my viewing I was taken aback at how emotionally powerful this film was. Countless times throughout I was astounded at the summation of the film's parts. Soundtrack, plot, animation, all of these working in perfect tangent to create something utterly spectacular. Watch this film .",
            "review_date": "2016-03-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heartfelt and winning, uplifting story",
            "content": "A simultaneously neo-Gothic and slice-of-life fairy tale about a single mother struggling to raise her two lycanthropic kids, Wolf Children is, in no unclear way, an unapologetically sentimental and heedlessly optimistic film. These sorts of affairs rarely go well. As serious movie watchers, we're tuned to appreciate explorations of misery and darkness - there's drama to be mined there, and psychological depths to be explored. Plus, bad things just seem more real. Usually when a film wears its smiling heart on its sleeve, its easily dismissed as too cute, too sappy, too naive. And oftentimes they are, - look no further than my About Time review - and deserve to be banished to the one-dimensional phantom zone of, oh I dunno, let's say the Hallmark Channel and movies that come out in February.That's why I so admire when fiction can be hopeful and escape the trappings of simplicity or silliness. The Friday Night Lights TV series is perhaps the pinnacle of this sort of storytelling, and it demonstrates that, in addition to many other things, naturalism and a generous heaping of hardship and tragedy are necessary to tell a believable, quality tale about good people triumphing through hard times. Wolf Children adheres to this sort of approach, serving up a strong backbone forged in pain and cruelty to temper the bright-eyed sweetness of mother Hana, keeping her buoyancy from turning the film into a mushy sack of pap. This results in each moment of unleashed glee, each bit of warmth, every small victory all feeling earned. Well, almost all. The film toes its line finely, and perhaps I was willing to overlook a few instances where it veered into mawkish territory simply because I was enjoying myself so much. Mileage will vary.The film itself is lushly animated, evoking Studio Ghibli's (most specifically My Neighbor Totoro) love of nature and aplomb at fading detail in and out of characters and scenes to great effect. I watched the film dubbed, as I usually don't have a problem doing so with anime films, and found the experience preferable to watching a few minutes with subtitles. Not only did the English voice-over seem more affecting, it has the most obvious benefit of allowing the viewer to focus on the rich and vibrant visuals without having to track words on the screen.Though Wolf Children could possibly be billed as a children's film, it's plenty mature, not only for the aforementioned darker moments, but also because so much of it feels like a novelistic exploration of growing up, of making a new home, of isolation and loneliness. It takes an impressively multi-faceted track to what could have been a fairly gimmicky concept - werewolves among us - and delivers a very organic, deeply human story. There are moments of melodrama, where the film takes advantage of certain leniencies afforded by its cartoon format to exaggerate emotions or compact moments that would otherwise need to breathe. It isn't, by far, a perfect film. It wears at the edges and can sometimes be too nice for its own good, and because it places such an emphasis on being able to tug at the viewer's heartstrings, each personal experience may be wildly different. But I found this one hitting in all the right places, and while a more professional reviewer might stick with a lower rating, I get to throw a little half star on top for my personal bias. It really is a lovely film.85/100",
            "review_date": "2014-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The world's a better place when we embrace individuality with acceptance and understanding.",
            "content": "We love our families. We cannot imagine our lives without our families. Parents make incredible sacrifices to ensure that their children are blessed with the best lives possible - that they enjoy their lives and don't feel left out while growing up. Parents face various hardships and challenges to take care of their offsprings. They go moon and back to ensure the safety and well-being of their children.Wolf Children, I feel, is a film about family, love, acceptance, understanding, unity & how to embrace being different. It teaches me what it means to be different, what it means to accept each other's uniqueness and flaws, how to accept everyone for who and what they are, how to carve your own niche while navigating through that uniqueness and, I dare say, how to use the uniqueness to your advantage in the world. The plot of the movie juggles atleast 5 genres simultaneously with spotless precision and quality: romance, drama, inspiration, feel-good and coming-of-age. I've never seen a movie quite like Wolf Children. That's why, it's one of the best and one of the most complete movies I've ever seen.After losing her husband and the father of her children, the way in which Hana gives her children the freedom to choose their own lives was very motivational. It must have been so difficult for her to deal with his death, then worry about the lives of her children and then make sensible decisions to make sure that her life and that of her kids was not in jeopardy. Moving from a city to go live in the countryside, to completely alter your lifestyle, might have been such a nerve-wracking experience. But the way in which she handled the situation & the transition was so beautiful to see. She started a new life, grew her own veggies to cut cost, worked hard tirelessly to make ends meet, again doing everything not for herself but for her children. She did have help along the way but by and large, she was successful in doing all of this alone.The film also tells me a lot about what it means to be a mother and, considering the bigger picture, what it means being a single parent raising kids. Being a mother is a thankless job and is sometimes taken for granted by some. I'm extremely thankful to our mothers for everything that they've done for our families. They're really the foundations upon which the structure of our lives rests.Throughout the movie, I always wondered how different their lives could've been if their father was still alive. The movie is a real tearjerker. The film has various moments that are so pure & emotional that they were difficult to watch. Having empathy for the characters as a viewer is tough sometimes.The end of the movie is pretty hard to watch. When the son chooses his own path to live as wolf in the mountains was the moment I felt that she did an excellent job raising her kids. She was a great mother who never imposed her decisions upon her kids. Her daughter wanted to live as a human and her son wanted to live as a wolf. She was an intelligent and inspirational mother. Her spirit was indomitable. Although it was hard at the beginning, she made peace with their choices eventually. She let them express their individuality without prejudice. Her objective was completed. Another scene at the end where the daughter reveals to her friend that she is a wolf felt like the circle of life was completed. Her own father revealed being a wolf to her mother and then she revealed being a wolf to her friend at school. But he knew, didn't he? He was always ready to accept her for who she was. That was very mature of him. That's why, I believe that the coming-of-age aspect of the movie is outstanding and one of the best things about it. They've shown and explained every perspective very nicely.Wolf Children taught me about acceptance, understanding & embracing the flaws & your own individuality. We are all different & we come from different places. The world can be a difficult place to coexist but with the help of our families, friends and most importantly, with our self-belief and faith, it is, by no means, an insurmountable challenge.",
            "review_date": "2020-09-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This review will not be long. Watch this film!",
            "content": "This review will not be long. I will simply say, because I must say this right now. I am coming of age; I have an infinitely loving mother and a highly absent father, though he lives and I get to see him everyday. This film tore me apart, and I desperately hope to show it to both of my parents, I hope and believe that it might help us all, my brother, too. Watch this film! Your review does not contain enough lines - the minimum length for reviews is 10 lines of text.Your review does not contain enough lines - the minimum length for reviews is 10 lines of text.Your review does not contain enough lines - the minimum length for reviews is 10 lines of text. Your review does not contain enough lines - the minimum length for reviews is 10 lines of text.",
            "review_date": "2016-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If I could rate this movie,then I really couldn't rate this movie.",
            "content": "I have seen so many 2D animation films,and no doubt this tops the list for now. With such a refreshing story. The characters were really attracting. I must say,there was no-nonsense in it. It reflects so many things,especially the love of parents,the over protectiveness Then the two children choosing their own different parts. The wolf and human part. Such a thing had to be handled delicately and that's just how it was done.The saddest part for me was the death of Ookami & seeing him being taken away. It hurt seeing them get separated. And when yuki got sick. Hana had to do all on her own.Seeing Hana raise Yuki and Ame was worth praise.Their lifestyle shift from the city to the country side. Keeping everything a secret. Then getting adapted to the country life. Growing their own food. And just when things looked gloomy. Help arrived from the other people.Everything was so so so real. It had so much feeling. And not one point in the movie did it feel like a drag. Every character's thoughts,way of thinking,life style were so real. At the beginning when Yuki said that the ones watching the movie will think its a made up story. But I thing if one watches this movie,then that line will seem sarcastic. I believe in this more than ever,that such things really did happen. In the end when Hana said she made the right decision after all,was a fitting way of ending the story. Her decision was true. And Ookami always watched over them.And If I COULD MEET Hana for real I kiss her hands. She is an epitome of an amazing daughter,lover,wife and mother. Ame too took a great responsibility of protecting the forest.",
            "review_date": "2014-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not as good as Summer Wars, but decent",
            "content": "Summer Wars was one of my favorite anime's ever so after getting to see a trailer for Wolf Children, I was pumped. I finally got the blu-ray and watched it. The good: - The art, design, and vision is fantasticThe emotional aspect is there, I felt tied to the mom and eventually the wolf-children (though the sister more than the brother by the end)Good pace. It's on the slower-side, but I think it shows the country life vs the city life (which had a faster pace at the beginning) by doing so.The so-so: - A few characters are introduced about 1/3 or 1/2 way through the movie that you think are going to develop into part of the main picture (grandpa farmer, the boy who gets attacked by Yuki, the fox elder), but are little-to-nothing in the scheme of the movie... which was disappointing to me cause some of them were very memorable.The idea of wolf people was kind of glossed over. I didn't necessarily mind not getting a scientific breakdown but when the rest of the world is normal yet we have a few wolf people, it draws me out of the movie more. The bad: - I think they started great with the stories of the family and how they grew together, and the class-room evolution/growth scene was fantastic. After that scene, though, when the siblings are more independent, I felt drawn away from both and felt like the attention wasn't distributed right. I think had they focused on the sister more and left the brother more a mystery, it would've worked better.The ending was pretty weak IMO. The reason being that, as mentioned before, they spent time developing minor characters with the expectation (for me at least) that it would impact the characters or you'd see why the movie showed them so often. For me, the ending kind of threw all of that out and said \"oh well here's what happened after the kids were done w/ elementary school.... see ya\". I didn't like it and it felt rushed / unfulfilled which for me dropped the movie from what would be an 8.5 or 9 out of 10 given the other points... to a 7/10.",
            "review_date": "2014-02-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best movies i've ever seen! So glad i bought it on a whim!",
            "content": "I just loved this movie! it was so sweet and charming. I cried a few times but that's because it was just so touching at many parts. I definitely recommend this movie to anyone who loves Studio Ghibli films. It's not made by the company, but it sure reminded me of them. That's why i bought the film on a whim in the first place. Well spent money!! I have watched it over a dozen times already and i've only recently bought it! It's so hard to find such beautifully made movies like this. I crave for more movies to be made like this one was. Overflowing with love and charm. Even though it is obviously fiction, it has so much real life hard-ships that are beautifully displayed that are very close to real life events. ( examples as a single mothers hardships of raising two young children all on her own, working hard for only the best for them!)This movie is now one of my all time favorites!",
            "review_date": "2015-08-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "it is so nice movie and sad its make me cry but the story it is so good i never seen like this befour",
            "content": "Hey i love this movie and its takes my heart !\ni like how the mother was stronge i was sad bc of the father when he died",
            "review_date": "2019-05-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thanks mom.",
            "content": "I watched this movie when I was 13 and at that time I was very confused about being a new teenager and growing up. My mother helped me through alot of it and I didn't know why she did that for me, I didn't understand what a bond between mother and child was really about until I watched this movie and I found a new appreciation for my mother and all that she's done for me. Love you mom.",
            "review_date": "2021-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Charming, Beautiful, Cute, And Full Of Heart",
            "content": "This is a film I highly recommend audiences check out. They'll likely get a different experience from it than me, but it's one of those films that you should see at one point in your life.Though I really enjoyed it, I liked some parts more than others. My favorite parts were always when the kids were around five, I was less of a fan of the scenes when they got older and the first 5-10 minutes of the film. As for the ending, people will have different reactions from it. I personally felt unsatisfied. This was a story that I didn't want to end.I have a few other criticisms, but they are all nitpicks that did not affect my overall enjoyment. This is a great film that I suggest you give a watch. My experience watching this film was unique, and yours probably will be as well. There is great storytelling, great moments, and great characters. Its a film that I have a hard time forgetting after I've seen it and it left me wanting more. There was definitely a lot of heart and effort put into this and it left me like no other film has done. Parts of it are slow, but this is an experience that you should not be left out of.",
            "review_date": "2016-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wolf children review",
            "content": "Great movie movie is emotional and show hard work of a mother you can watch this movie with family in censored version only one scene of 15 to 30 second.",
            "review_date": "2021-05-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "best philosophical",
            "content": "I love the current thoughts in this philosophical animation",
            "review_date": "2019-02-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Portrait of a mother's love, to its best possible way.",
            "content": "Visually astonishing, this amazing anime will make you cry while watching the most beautiful and out of this world depiction of a mother's love.\nNever felt so unconscious of how time passed as the film started, until it was almost over.\nEasily one of the best animes I've ever watched by today.\nThank you Mamoru Hosada!",
            "review_date": "2020-12-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent",
            "content": "Truly a wonderful movie if maybe a tad too long for its own good. The pacing is not always at its best cause of that.Oh and, dude, you really had to keep your wolf form for that kind of action? Not judging, just a bit surprised.But joke aside, really, top notch movie. Just watch it if you haven't yet. You aren't going to be disappointed.",
            "review_date": "2018-03-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Do watch",
            "content": "The very first line of the movie says that this is something strange that people would hardly believe but almost everything feels so lively and real that you may think for a second what if it is true. I binged on this movie without looking at it's ratings, summary or spoilers and trust me that's what made this movie mean so much more to me.\nFalling in love with someone and then losing that someone has been a common story but that someone is the one who means everything here. I have never thought of human and animal lives so much in unison, closely knitted with one another. This movie also has beautifully portrayed a mother's sacrifice to raise her children. I would have broken down had I been in her shoes. After all it's truly said the hand that rocks the cradle rules the world. Hana (mom of the wolf children) is someone to marvel at for the conviction in her love, her upbringing and her children. There are moments which bring tears to your eyes as it feels like reliving your own childhood and the efforts our parents put in to make our lives successful. The movie ends on very promising note making boundaries between human and animal habitats clear yet ensuring a peaceful coexistence.",
            "review_date": "2019-07-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An emotional story that will leave you filled with tears of happiness.",
            "content": "Wolf Children is a touching story about Hana, a single mother, raising two young children, Yuki and Ame. The story starts by showing Hana at Tokyo National University, where she meets the love of her life, which has a secret. He is a wolf-man. The last one to have both wolf and man in his blood, and is able to change between man and wolf at will. They have two children together, Yuki and Ame, and they live together in their apartment in Tokyo for a couple years, until the father unfortunately dies. Due to increasing pressure from her landlord, and Child Protective Services, Hana decides to move to the country, where she lets her children decide their own path. To grow up as normal human children, or to answer the call of the wild.I personally found this a fantastically well-told story with amazing animation. Wolf Children, I was entrapped at the first second, and the story left me hanging on until the credits were rolling. The characters are well developed, and the animation is really well drawn. I would rate this movie 8/10, and would recommend anyone who enjoys anime movies to watch this.",
            "review_date": "2014-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A beautiful fairy tale",
            "content": "Together with my 14-year old son I went to see an exhibition on the world of Manga in the ethnographic museum in Rotterdam (Wereldmuseum). An entire room was dedicated to the artwork of the internationally acclaimed anime Wolf Children Ame and Yuki from director Mamoru Hosoda. The beautiful original watercolours we saw there used as backgrounds inspired us to go see the movie. What an experience it was: the main character a student who is so open-minded that she marries a 'wolfman', the last surviving in Japan. Of course very interesting to see what happens when they get babies -half wolf half child- and how to raise them. The movie is at times sad and heart-breaking and at times very funny. But all the time very calm and zen and beautiful. Seldom I saw an animated movie with so much emotion in the movements of the characters. A beautiful fairy-tale!",
            "review_date": "2014-03-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The second best animated film i've seen, till the end of the year.",
            "content": "Man, when I first heard of this movie was a review for \"worst to best animated movies for 2014\" in 2015. It was rated number 1 on the video and I skipped it every time I saw the video besides the first part where Yuki transforms into a wolf and I found it cute but I wasn't interested in it. Two years later in 2017 I went on Gomovies, and I found this movie I remembered the review and I decided to give the film another shot. I saw it then it was boring until Yuki and Ami were born was when I started liking it and 5 minuets later. I was almost crying. When the wkolfman died I just wanted to know what was to happen next, I wanted to know if Hannah and her kids were going to be ok. I after the movie I almost cried.I sat on my bed quietly for a few seconds and said \"that was one of the best animated movies I have ever seen in my life.\" That's how much I liked this movie. I loved the characters especially Hannah and Yuki and how they progressed as people threw-out the film. I also liked how there was a change with the characterisation of Yuki and Ami, half way threw the movie. Thats what I love about this movie, and some I love to notice about this movie.10/10 in my book.",
            "review_date": "2017-12-12",
            "lang": "en",
            "source": "imdb"
        }
    ],
    "vibes": [
        "crucial",
        "lovable",
        "rural",
        "irrational",
        "lucky",
        "memorable",
        "personal",
        "recommendable",
        "sexual",
        "slight",
        "tasteful",
        "unconventional",
        "captivating",
        "exhausting",
        "later",
        "layered",
        "painstaking",
        "succinct",
        "sumptuous",
        "married",
        "naughty",
        "painful",
        "mixed",
        "sloppy",
        "beloved",
        "total",
        "afraid",
        "correct"
    ]
}