{
    "rating": 0.0,
    "release_date": "March 1992 (United",
    "num_reviews": 87,
    "genres": [
        "Drama"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Really, as beautiful as a film can be. As beautiful as art gets.",
            "content": "Words cannot describe Nostalghia, or, indeed, any Tarkovsky film. He is an artist who is completely unique - I can't think of any other auteur like him. I can't even think of any film that I've seen which tries to copy his style. It is inimitable. No one else is as patient. Tarkovsky's pans and zooms can take minutes. The penultimate sequence, where a man has to carry a candle for a certain distance without it going out, should be horribly boring. Any other director would have used a lot of cutting to produce suspense. Yet, with Tarkovsky's brilliant direction, without a single cut for nearly an entire reel, it becomes one of the most suspenseful and, yes, one of the very best scenes ever captured on film.In fact, the direction's almost too good. This isn't minimalist like some of his previous films such as Solaris and Stalker. It is more like Andrei Rublev: not a second goes by that is not stuffed to the brim, almost flowing over, with brilliant and poetic images. In a way, although in a good way, this distracts the viewer. I was so bowled over by the images of Nostalghia that I had to watch it twice to understand it (it was nearly as difficult the second time around not to be bowled over!). And I totally appreciate that. I was more than happy to explore this film more deeply on a second journey. Thank you Mr. Tarkovsky for making the films that you did. When you sought to fulfill your audiences' lives with your art, you came closer to succeeding than any artist could have. Of course, you couldn't have made life perfect, nor would you have wanted to. For, as you said, if life were perfect, art would be pointless. May my life always be imperfect.",
            "review_date": "2001-09-07"
        },
        {
            "review_title": "Beautiful, Strange, Powerful, Haunting Masterpiece",
            "content": "There are very few people worthy of the accolade of \"Genius\" but the late Russian film-maker Andrei Tarkovsky was definitely one of them.  In his film-making career he is responsible for some of the most beautiful images ever to be put on a cinema screen.\"Nostalghia\" deals with a Russian poet who is in Italy to research the life of a Russian composer, who died there.  Accompanied only by his female, Italian, interpretor, who is attracted to him, the poet feels strong feelings of home-sickness for Russia and he strongly misses his wife and child who stayed behind.This was Tarkovsky's first film made outside the Soviet Union (and his first in a language other than Russian), but it is still very obviously a Tarkovsky film, complete with many haunting images of water and fire.  in fact, instead of the beautiful, sun-drenched Italy we are used to seeing on film, here the country is grey, wet and shrouded in mist.  As usual in Tarkovsky's films there are many changes between colour footage and black-and-white (or sepia).  Here, the poet's memories of Russia are presented in monochrome.As with all Tarkovsky films, \"Nostalghia\" demands a great deal from the viewer.  It is very slow moving and requires a great deal of patience and concentration.  Also, be warned that Tarkovsky did not see cinema as \"entertainment\" but as an art form.  I would advise anyone to make the effort and stick with it, though.  It is a great work of art.",
            "review_date": "2004-04-18"
        },
        {
            "review_title": "Faith...",
            "content": "The nostalgia, in the film's title, isn't just the physical longing for something in the past, it's the spiritual longing that so many people strive for. This shouldn't surprise an student of Tarkovsky's work since no director, possibly with the exception of Ingmar Bergman, analyzed spirituality as Tarkovsky did.NOSTALGHIA follows the trekking of a Russian traveling through Italy along with his beautiful interpreter. His purpose for being there does not come to the viewer easily. Most of the scenes in the movie are filled with a lot of silence, and even the action that does take place, is minimal. Eventually, we come to understand that he is there to find some cultural reinforcement for his Russian background. As the film progresses, we seem to take on the role of the main character in the story, as an observer to events. Throughout his travels he becomes a witness to religious processions, theological discussions, and the rituals of a God-fearing lunatic. The lunatic, played masterfully by Erland Josephson, is looked down upon by a lot of local citizens. Apparently, in the past, he locked his family in his house for a long time, anticipating the end of the World. The movie documents his effect on the Russian traveler, and the traveler's longing to recapture his spirituality.A lot has been said of the ten-minute unbroken sequence where the lead protagonist attempts to carry a lighted candle from one end of a pool to the other. Some see it as utterly boring. Personally, I was fascinated. In it, we see how the protagonist finally attempts to do something in order to recapture his spirituality. For the entire length of the movie he has been an observer, now he is an active participant. To be fair, his action does take the form of a ritual, not the building of a church, or water immersion, but then again, so much of spirituality is ritual. Tarkovsky correctly identifies how it's the continuity that helps us get through life, knowing that some things will never change our strong religious convictions. That's when the protagonist finally comes to realize that action must take place. It's no coincidence that this scene takes place after a demonstration given by the Erland Josephson character. It's an amazing scene. In it he gives an intelligent speech about the desolation of art. It also imparts an important question to the viewer about those who truly make a difference in the world: the observers, or the \"insane\", who try to take positive action on the behalf of others.No praise of any Tarkovsky film is complete without talking about the technical angle of his work. In NOSTALGHIA Tarkovsky is proven again to be a master of beauty, carving out beautiful images into the Italian landscape. Even the indoor scenes are beautiful. NOSTALGIA is further evidence of Tarkovsky's desire to elevate film as an art. He paints well...",
            "review_date": "2001-09-21"
        },
        {
            "review_title": "Tarkovsky, drowning in nostalgia.",
            "content": "Nostalgia is essentially a dream play that opens with a hazy, monochromatic vision of tranquil reflection, which, not only establishes the core themes behind the film's title, but also, informs the key emotional sequences that are here revisited by the central character throughout. As a result of this, the film is as much about the feelings of loss and longing as it is about the lead character, the homesick Russian poet Andrei Gortchakov, who is exiled in Italy with his guide and translator Eugenia on a research mission into the life of a long-forgotten, 18th century composer. In the hands of any other filmmaker, this plot would give way to a series of grand adventures and curious revelations, but, as we've seen in other films, like the majestic Mirror and Andrei Rublev, Tarkovsky is a filmmaker unconcerned with the external world of the film, who, instead, turns his attentions inward, to chronicle the internal angst and emotions at the heart of these tortured, complicated souls.As is always the case with Tarkovsky's work, it could be argued that the film has further shades that somehow draw parallels with the filmmaker's own life and works; with the exiled main character here becoming the (cinematic) voice for Tarkovsky's own feelings of loss and nostalgia during the making of this film. Because of this, the cinematic depiction of the small Italian village where the film takes place is one of the gloomiest and most barren creations ever presented, especially in comparison to the kind of lush, summery vistas that we're used to seeing from this particular, geographic region. The locations used are desolate, dilapidated, over-run with moss and ivy, and swept in a constant haze of fine rain and morning fog, which allows the filmmaker to create a number of slow and haunting visual meditations that further the actual plot... but also help to visualise the inner-turmoil felt by Gortchakov at this difficult crossroad in his life. As is always the case with Tarkovsky, the visual design of the film is meticulously created and deeply hypnotic, with the production design creating an emotional labyrinth for the characters, which is then, rigorously explored by the camera.The use of cinematography is always an important factor is Tarkovsky's work, because it is so vital in creating and (then distinguishing between) these varying layers of reality, fantasy, memory and premonition - with the filmmaker employing a variety of techniques, from cross cutting between sepia-tone and defused colour, and the juxtaposition between regular speed and slow motion. The use of those slow, mesmerising zooms (bringing to mind Kubrick's masterpiece Barry Lyndon) and those complicated tracking shots only add to the lingering tension and escalating melancholy that is perfectly established throughout the film's lethargic first act. The film is deliberately slow, like the majority of this filmmaker's work, with the camera moving at it's own pace in order to linger and meditate on certain images and moments. The editing too is deliberate in it's pace, with a number of scenes unfolding with a minimum of two to three cuts per scene (Tarkovsky always allowing the slow movement of the camera to do much of the work normally covered by the editing), which can, on occasion (particularly the first viewing), become quite tiresome. It does, nonetheless, ultimately tie in with the inner feelings and emotions so synonymous with the title and, is integral to the inner pain felt by our central characters.Into the mix of things we also get a dose of the mystical, supplied here by the character of Domenico, another tortured soul who's back-story involves keeping his family hostage for a prolonged number of years under fear that the world would end. Domenico, like Gortchakov (and indeed, Tarkovsky), is another one of those haunted souls, inhabiting an earth they don't really understand, whilst questioning their place in the world and the world within the cosmos. Towards the end of the film, Domenico will rant atop a statue about all manner of deep theoretical issues, before Tarkovsky launches into two of the most astounding sequences he ever created. The first is a brutal and literally jaw-dropping act of emotional and physical catharsis (set to the strains of a distorted Beethoven), whilst the other is a long and slow meditation on fate (and probably the most iconic scene in this film), involving an empty pool, a lighted candle, and a weary, heartbroken Gortchakov.Nostalgia is a deep and thoughtful film, best suited to those viewers who are interested in spending some time with a film that takes a great deal of time to fully reveal it's self. Like the majority of Tarkovsky's films, it is bleak, dreamlike and hypnotic, in the way in which the images just linger on the screen, waiting to be decoded. Some might be frustrated by the slow pace and the reliance on character over narrative, however, if you are an admirer of Tarkovsky's best films, like Andrei Rublev, Mirror and The Sacrifice, then you'll be sure to find something of interest here.",
            "review_date": "2007-12-29"
        },
        {
            "review_title": "Masterpiece",
            "content": "Apparently even Tarkovsky described this film as 'tedious', so you can imagine what it's like to be on the receiving end. But for some reason I don't find it so, although there is the occasional longuer. It's one of the great films of cinema, although certainly rather odd. Once again it has an impossibly glamourous Russian wandering about looking moody, engrossed in the big issues. In fact, the female lead falls for him and is exasperated by his absurd interest in a local derelict. She flashes a tit in erotic frustration which is unusual for Tarkovsky, he seems unwilling to really engage in issues of sexuality, preferring them to be chaste in an almost victorian manner. Certainly there was some accusations of a reactionary attitude to women, for at the start of the film a priest tells the guide that she should sacrifice herself for the sake of raising children. She is made to look rather absurd in the film, but in truth, so do the male characters. Perhaps it was due to cultural traditions in Tarkovsky's background rather than deliberate misogyny.The Italians didn't take to this film as it did not film Italy in a vibrant manner, preferring to evocate the alienation and melancholia of it's Russian lead. Tarkovsky's brilliance as a director is well illustrated in the film where the Russian and the old man talk in a room. The camera seems to turn a full 360 degrees although you don't notice it. The way his characters and objects seem to float in and out of frame is amazing. It's strange, but nature seems to perform for Tarkovsky. Even the animals seem willing to be directed, a dog staring straight into the camera with an almost unearthly and uncanny presence and stillness. The scene where the Russian lies on his hotel bed and his nostalgia conjurs up his dog in a dream like but also tangibly real manner is powerful and haunting.The problem with this film is that the lead character was not really in exile and could go home anytime, unlike Tarkovsky himself, so why was he in so much pain? Is it mere homesickness as opposed to the real longing for one's homeland rightly belonging to the truly disenfranchised? But perhaps that is not the issue, more that when man finds himself and true wisdom, is it too late in the day for him to use what he has learned? The self sacrifice of the old man is a return to an old theme of Tarkovsky's that perhaps only shame can save mankind.There are many eccentric aspects to this film, for instance the Russian wandering around up to his waist in water. Also there is a brief and bizarre shot of an angel stomping around outside a house. As it's Tarkovsky you don't burst out laughing. Perhaps he reaches the parts other directors cannot reach.But there are also some vividly beautiful moments. The doves being released in the church, and the light filtering through a stream of water in a gutted house. Towards the end of his career, Tarkovsky began to question the rigid criteria he used in shooting a film in a way he felt won purity and aschewed the vulgar and trivial, but I think he got it right here. A marvelous film.",
            "review_date": "2000-02-02"
        },
        {
            "review_title": "Architectural Poetry: the Form of Angst",
            "content": "Spoilers herein.Writing IMDB comments is a true pleasure -- there is nothing else like it. We have the freedom to assume that you, dear reader, have already seen plenty of descriptions about the story, the beauty, the meditative nature, the ambiguous metaphors, the sculpting of sound, the nature of created memory versus the myth of place. Because IMDB is such a wonderful resource, you may even already know that Eugenia found her child in `The Vampire Chronicles' -- suggested by Pitt because of her role here.We can assume all that and go off on a single tangent of interest: I am fascinated by novel uses of architecture in film. Not just use of wonderful sets like Zeffirelli's `Hamlet.' Not just buildings as metaphor (`Life as a House') but as a character (`Liebestraum') or as the camera (Welle's `Othello'). Most impressive are when the whole world of vision, the entire conception of the film is architectural, forming the fundamental basis of all the concepts.`Belly of an Architect' is one approach. It's rather explicit and conflates the life, body and environment of a man into one construction. Clever idea, and in the hands of a master. But I think it still clumsy by Greenaway standards. Here we have another solution to the problem. A whole lot less explicit. Less baggage in working to make sense. More freedom in merging dreams with `reality.' But similarly set in a ruined Italy, here rural. Similarly motivated first by space. But where Greenaway's camera has a painterly-like static stance, Tarkovsky's drifts to explore the space but is similarly static in that it runs continuously from that moving perspective. (This is similar to the approach of memory invested in form in `Last Year at Marienbad.')And what drifts! Sometimes it seems like tens of minutes. Sometimes it dwells on marvelously poetic details. Sometimes the actors seem to be slowly animated frescoes on damaged walls, with their faded colors and edges as if they were painted by Rublev. Sometimes the space contains another space, either a landscape or a dream space. Sometimes the space contains, sometimes it releases. Sometimes it contains water, sometimes excluding it sometimes both. Sometimes after you feel you have explored a space thoroughly, he languidly reveals a whole new insight. Sometimes it produces spatial impossibilities. Always the notion of space pre-exists the conceptions we receive. Always, the poet's challenge is defined in terms of the elements of built form.I only know a few others of Tarkovsky's work so far but his breadth already amazes, though they appear superficially similar. I think I would recommend `Rublev' as a first. It makes the work less for a film like this, because you already know how he projects the creative angst of the artist from the character into the folds of your mind. How he invents an architectural eye by long continuous shots anchored to the earth (even when in a balloon), but freely fluid. Always curious, always searching.This is a life-altering work. I recommend it.Ted's Evaluation -- 4 of 4: Every visually literate person should experience this.",
            "review_date": "2002-11-25"
        },
        {
            "review_title": "Italy vs. Russia",
            "content": "Italy is a very attractive place for filmmakers, because of its art, architecture, the lighting, and also film history. Many filmmakers go to Italy and immerse themselves in the people and the culture, the light and the atmosphere. Tarkovsky goes to Italy and he makes it as dank, dark, and unpopulated as he makes Russia. And, while in Italy, he has a few things to say about Italians--to explain Russia.\"Then you can't understand Italy, because you're not Italian.\" A poet goes to Italy to research into the biography of a Russian composer who stayed there for two years, and his life parallels that of the composer. Just so, Tarkovsky's life parallels that of the main character, who is also called Andrei: left in Italy surrounded by so much \"beauty it's sickening\", he becomes haunted by flashbacks of his family in Russia. Trying unsuccessfully to communicate with his translator (get it?) and striking a metaphysical relationship with a local mystic, Andrei the character struggles with the typical Tarkovskian themes of faith, fire, personal loss, and water, among others.Tarkovsky is up to some well-rehearsed tricks here. Long takes with an impossibly smooth floating camera dedicate the viewer's eyes to the imagery. The weather is under the same amount of control. A character enters a new space (here it's Italy; in Stalker it's the Zone; in Solyaris it's the space station; in Andrei Rublev it's the society outside the church), and only through intense emotional and philosophical struggle can he prepare himself to return to where he's come from. Thresholds stand tantalizingly around, but don't often get passed (Andrei can walk through a door that leads nowhere with no problem, but can only cross a pool with a candle with immense physical struggle). Spaces are separated by black and white and sepia tones. God is always there but never for you.There's some new tricks, too. Tarkovsky plays with light a lot in this one, and frames that seem to sink into pure black suddenly illuminate hidden images and icons. A compelling sonic disturbance is created in flashbacks to Russia that sound like a table-saw grinding away at wood; \"The Music\" the mystic speaks of is warped and fragmented vinyl.Nostalghia, I feel, is not the Tarkovsky movie you want to see first. First see Stalker, or Solyaris, or Mirror. Nostalghia removes the transition from Russia to Italy and so the feeling of transition and change is a lot more dependent on the symbolic and abstract sensibilities, and previous knowledge of Tarkovsky's imagery will help to interpret it. For fans of Tarkovsky, however, Nostalghia is a sweet and personal return into his dense and foggy mind (or house, as Chris Marker calls it), the world that only he was able to fully explore.--PolarisDiB",
            "review_date": "2009-03-26"
        },
        {
            "review_title": "Beautiful, obscure, and challenging",
            "content": "Like a gallery of someone else's strong memories/obsessions, the luxurious images and painstaking movements attracted me with their clarity and disturbed me with their foreignness through the entire film.  The undeniable beauty of his visual compositions pulled me in like any flawless performance.  I felt no desire to visit his landmarks because they called to mind my own strong memories of similar grandeur.  It did not matter that these were his choices.  All that mattered was the complete realization of each spiritual personal epiphany.  The dialogues, monologues, and mini-plays, on the other hand, disturbed me by adding layers of interpretation that either had to be accepted and incorporated into a less pleasant solipsistic whole, or separately analyzed and digested for their complexities in search of a grander vision.  It was as if a famous artist began talking to you about the single meaning of each work of his as you observed them.  Does he intend to deny you the pleasure of finding your own answers, or is he simply adding a new layer to enliven your own search for meaning?  Accepting the latter explanation, has kept my mind busily turning for several days now.Regardless of whether you accept Tarkovsky as philosophically profound or wise, his work is complex and open to multiple interpretations like a well-written haiku.  Was Domenico deluded and tragicomic and the poet's torturous journey with the candle a sad joke?  Are our memories of the past so intimately woven into our perceptions of ourselves that we cannot avoid irrational acts that imperil our future?  Does strangeness or madness have a singular spiritual value all its own like an architectural ruin or a ravaged landscape?  Do we take ourselves too seriously or have we over-developed our social, political, and scientific infrastructure to the extent that we are blind to the real world and threaten its existence?   Are our poets and mystics spiritual resources or oversensitive fools, and does it matter? Perhaps Tarkovsky would disagree with every one of my questions.  I am certain that others will have different questions and answers.  However, for those that don't dismiss this film as self-indulgent and ponderous, Tarkovsky offers a rich composition that can support and survive several generations of critics and interpreters.A more traditional episodic film with a clearly defined story line and a swift movement between scenes would have less to hide behind that a film like \"Nostalghia,\" but there is no law that says a piece of art cannot be obscure. It comes down to a question of faith in the artist and whether it really matters how creative or insightful he was so long as you personally can find meaning in his work.",
            "review_date": "1999-08-02"
        },
        {
            "review_title": "A Near Masterpiece",
            "content": "There is a strange feeling that comes over me when I watch a Tarkovsky flick, like I'm seeing a puzzle come together to for a full picture, yet it is of something I cannot fully comprehend. I'm sure this has happened to numerous others while they watch a David Lynch film, or even one of the various mind-bogglers released this past year. But Tarkovsky comes to us with a different approach-an approach that I have not seen from any other director. It is an approach that reminds me of reading a poem. You read it once-you don't comprehend it. You read it again-it seems clearer. It may not be until that third reading that it finally clicks. Tarkovsky's images are not there to keep you puzzled, they all have a meaning and a purpose-you just need to find what that meaning is. It may seem like there is much work involved, and sometimes I would rather work for a film than be bowled over by its tepid scripting and mediocre direction. The one thing you would need, above all, would be patience, because it is not the kind of film to watch half-asleep. The story, at times, is hard to grasp, number one because it is in subtitles. It follows a Russian poet who is on a research mission in Italy with an Italian interpreter. There, he is haunted by his past: memories of his wife and children. One of the most amazing things I picked up was the subtle use of symbolism. You have to pick the film apart if you wanted to fully understand it, and that is something that I enjoy doing. Tarkovsky leaves much to the mind. Such as the dialogue which is subtle as well, and attention must be paid or you'll miss small but important details. It merely is there to move the story along softly scraping the surface. Otherwise, the images must be analyzed.The camera shots consist of many slow zooms, slow pans, numerous still shots, and semi-slow motion. Many instances, the camera reveals some amazing imagery that is so perfect, so beautiful that not only the most devout romanticist could appreciate. Actually, the entire film is a series of gorgeous cinematography, I couldn't tell you one shot I didn't like. The final shot of the film is incredible. Constructed both metaphorically and physically, it shows the poet lying sideways on the ground with the top half of his body propped up with an arm. His dog lies next to him with his head on the ground. The camera pulls back steadily slowly. A house is revealed in the background. The shot pulls out further and the house seems smaller than the poet. When the zoom stops is shows everyone surrounded by tall pillars, like the ruins of a temple. Then it begins to snow, just a little; that image holds for an entire minute, before `To the memory of my mother,' appears on the screen. Puzzling, exhausting, yet beautiful and exhilarating. The film, at many points touches religion and life, mostly without answers. Attempting to find those answers is a task well worth the trouble. ****1/2 out of *****",
            "review_date": "2002-08-19"
        },
        {
            "review_title": "I admit it is brilliant. I didn't like it.",
            "content": "It is beautifully photographed, and further established Tarkovsky as a genius with natural landscapes and settings. Aside from Orson Welles, Tarkovsky must be the king of atmosphere.Atmosphere alone does not make a great movie. This movie is unbearably pretentious and slow beyond words. In comparison to Tarkovsky, Ingmar Bergman is an MTV director.By this stage in his life, Tarkovsky was an acknowledged genius, and apparently nobody on this team ever dared to question his artistic decisions. He simply has no clue of when his point has been made and it's time to move on.Is he a fine poet? Yes, as great as his father in many ways. I also think he has a marvelous photographer's eye for images. But he really had a complete disdain for communication with the audience, and that aloofness makes this film so hard to watch. Of course, the fact that much of the movie exists in dim remembrances and dreams makes it even less accessible. I don't even know if this film had a script. Some of the actor's dialogue, especially Giordano's, seems unrelated to the scenes they are performing. The actors performed admirably.I watched it a second time with my fast-forward, and it was much better. He has a way of holding the camera on a still or barely-panning image for many, many seconds - with no sound either, except for his overused running or dripping water cliche. If you fast-forward all of those to the next scene, the movie flows much better.I consider this movie a disappointment. I always thought Tarkovsky would make a great movie when given Western budgets and technology, but he pretty much just remade his earlier movies on better film stock.He has a beautiful vision. I wish he had become a photographer instead of a filmmaker.",
            "review_date": "1999-02-16"
        },
        {
            "review_title": "You have to be even more insane than Erland's character to consider this dull drama a masterpiece.",
            "content": "First of all, please use this link: http:// www.criterionforum.org/forum/ viewtopic.php?p=142178&highlight=&sid= dd58cd36ffe474e7bd315c810cb708e6. It will lead you to a hilarious forum \"discussion\" about this very comment! I'll also use this opportunity to say \"thanks\" to Cold Bishop and the other morons for taking my texts so seriously - and making me laugh very loudly!Secondly, let me explain the high 7.9 rating on IMDb. Only around 2,000+ people voted, and they're mostly film students who FORCE themselves to like movies like this, and other pretentious boredom-seekers who find thrills in watching grass grow. \"Nostalghia\" is the IDEAL film to fall asleep to. I speak from experience.I absolutely loved \"Solaris\" and \"Stalker\", two brilliant, intelligent sci-fi dramas. On the other side of the Tarkovsky spectrum, I was utterly confused by \"The Mirror\" - which had zero story to tell (though occasionally visually very nice), I was mostly bored to tears by \"Andrey Rublev\" (nearly 4 hours!), but thought \"The Sacrifice\", his last movie, was okay (in spite of being in Swedish, an unpleasant language).Tarkovsky's two sci-fi films are based on (good) novels, and this may be the crucial point. It seems that he is pretty much lost when doing his own material. He gets bogged down in his dull poetry and philosophy, not bothering to inter-connect various parts of the two in a cohesive manner, failing to focus on the essentials. Hence all his other (non-sci-fi) movies are not much better than all the other pretentious European crap from various Godards, Bunuels, Bergmans, Triers, and other overrated, lazy \"geniuses\".\"Nostalghia\" is an overly pretentious non-story that is far too self-indulgent even for a European director. If you make movies just for your own \"artistic\" pleasure then why even bother releasing them? This two-hour snooze-fest could have been EASILY cut down to half that length - and it would still not be fascinating. Watching the main character walk around endlessly without saying or doing anything is just GARBAGE film-making. Lazy, and made/written by someone who overestimated himself a tad.The positive side to this movie - apart from the fact that it made me fall asleep - are some visually stunning scenes. Especially the long shots of water, which are pleasant, if a little sleep-inducing because they may be TOO pleasant. Tarkovsky seemed to have some kind of an almost-fetish for \"aqua\", because he filmed it in all its visual and audio glory in nearly ever movie he made.My advice to those who consider this a masterpiece is to stop lying to yourselves about your own intelligence, hence to quit being in denial about how you TRULY, honestly, perceive certain movies. Writing about a movie such as this being a \"stroke of genius\" is just one of many ways some people deal with an inferiority complex.Erland Josephson, as uncharismatic as he has been in all his Bergman movies, is a poor choice for the insane man. Besides, what was the point Tarkovsky was trying to make? That he is sane and the rest of us are the insane ones? What a cliché idea! So trite. And how about that last scene (a 250-minute scene, it seemed) of the Russian character carrying the candle for the insane man? Was this symbolic of something? Trying to save the world? The world needs saving from very pretentious, boring movies.Erland's character locked up his family for seven years. Hence he is not only insane, but should be put away for life. End of story. What can we possibly learn from Erland? His impassioned, idiotic left-wing \"back-to-the-caves\" speech was just dumb. It's something a 17 year-old manic-depressive idealist would write.Besides some nicely photographed scenes, there was a pleasant scene where the blonde actress bares one of her breasts.Tarkovsky portrays Italy as a gloomy, dark, depressing place. I have no idea why. If Italy looks like this, what should he do with Russia or Finnland??(Sick and tired of Euro-trash \"classics\", i.e. bad, overrated dramas? E-mail me if you want to read my totally altered subtitles of Ingmar Bergman's \"Autumn Sonata\", \"Cries & Whispers\", or \"Passion Of Anne\", but also the non-Bergman \"Der Untergang\".)",
            "review_date": "2007-09-19"
        },
        {
            "review_title": "difficult yes, but worth the effort",
            "content": "It's sometimes true that the most demanding movies can yield the most lasting rewards, and the penultimate film by the late Andrei Tarkovsky certainly puts the theory to the test. This was the first feature he directed outside the Soviet Union, and its protagonist is (like Tarkovsky himself was) a Russian artist exiled in Italy. But don't expect anything remotely plot-driven; like other Tarkovsky films it's a dense, challenging exploration of faith, madness and memory: beautiful, enigmatic, intellectual, and extremely slow moving. Many of the sequences are a labor to sit through, but the final shot, in which the director transplants a Russian cottage (complete with landscape) inside the massive walls of an ruined Gothic cathedral, is by itself compelling enough to erase the aftertaste of even the most tedious passages.",
            "review_date": "2010-12-21"
        },
        {
            "review_title": "Pure art house cinema",
            "content": "What a strange film, utterly lacking in narrative, self-indulgent, in a sense tedious, but I sat transfixed for two hours.  Someone once described cinema as 'painting with light' and there isn't a single shot in this movie you wouldn't have been proud to photograph.  It's utterly beautiful.  You don't engage with it as you would with a regular movie, you just sit back and let the images wash over you, frankly I could have watched with the sound off and the subtitles off.  I'm lying about the sound.  Tarkovsky is a genius for dripping water.  The switch between film stock is incredible, the sepia is some of the most breath-taking cinematography I have ever seen. This is pure art house cinema in all its gorgeous, pretentious grandeur.",
            "review_date": "2003-11-01"
        },
        {
            "review_title": "1+1=1 : or even a thousand raindrops makes ONE big pool, even inside the house",
            "content": "Tarkovsky keeps the emphasis on nostalghia and not on sentiment or melancholia.  Giuseppe Lanci's (Kaos '84, Caro Diario '94) beautiful colorful cinematography alternated with b/w footage, is reminiscent of Traffic (Soderbergh, 2000), although the content and the pace of that film is very different.  The point is, that different filming materials can emphasize different perspectives from different people or different periods in the life of the same person.  Luminous or dark.  Even a long and slow shot can tell a complete story in this film, as the actors seem to duplicate themselves or substitute others.  Miniature landscapes to create surprising visual perspectives are discovered at the ride-in and ride-out of the camera.  All those details couldn't be appreciated if the shots were any shorter or the pace any faster.  Nevertheless, there are instances where Tarkovsky doesn't seem to know what he wanted exactly and motives stay implicit unfortunately.  But that's poetry.  See the film again and discover new perspectives.  Anyway, there is a strong taste of longing for association of people in the present, in the future and even in the past throughout the film.Nostalghia is almost entirely (as far the dialogue part of the film goes) in Italian language and the music consists exclusively from legendary composers with some experimental touches here and there.  It is on the verge of being arthouse with its sometimes subtle and sometimes experimental light and sound FX.  Even the dog seems to have had acting classes.  Also I feel that what Godard tried so many times (le Mepris? Week End?) but utterly failed most consistently, Tarkovsky achieves gloriously, although the film shouldn't be much longer.10 points out of 10 :-)",
            "review_date": "2001-12-15"
        },
        {
            "review_title": "Not much here to offset the pretension",
            "content": "Tarkovsky being pretentious is like Lucas using CGI; but he is undoubtedly a genius - because of his other films. In Andrei Rublev, you can see his sheer hard work: events unfold before your eyes - the balloon, the clown, the orgy, the raid, the awesome bell - all these scenes are masterpieces. Solaris has the mood and sets done just right, which causes an overwhelming uneasiness in the viewer.Nostalghia has nothing of the sort. I actually didn't mind the last couple of scenes - the immolation and the candle. It was the rest of the movie that was - how shall I put it - duller. Tarkovsky is just being lazy here. Not only has he given up any attempt at hard work, he repeats and re-repeats himself - from his own other movies and then within this movie itself.The scenes of things under water - done in Andrei Rublev. The family life scenes (including ending) - same as Solaris. Rain inside house - cf snow inside church in Rublev. Philosophical conversations about the same old topics - done better in Rublev. Fog - done in Solaris. Unblinking closeup of painting - you get the idea. Even the immolation reminds of the cow being set on fire in Rublev. There is little that's original here - the baths, the candle scene. That's about it.If this is your first Tarkovsky you might like it better. But this is a pretentious, unoriginal, tired work with few redeeming qualities.",
            "review_date": "2012-03-24"
        },
        {
            "review_title": "No",
            "content": "Okay, here's the thing. And before judging me I encourage anyone to look at my profile to see wether my taste is poor or not.Andrei Tarkovsky made seven films, and I took the liberty to watch them all. I liked Solaris. I understood Ivan's Childhood. I was fairly bored by The Mirror and severely bored by Stalker. But they all had something this movie didn't.Nostalghia, his sixth feature film and the only one in Italy, is one of the worst films I've ever seen. Because it lacks the only thing that every other movie has: something. Nostalghia has nothing. It has no characters, it has no setting, it has no plot.It does \"have\" them in a technical sense. You can go on Wikipedia and read a summary, sure. Yet, the problem is Tarkovsky doesn't take notice of any of them. It's alledegly about a writer that tries to study a composer. It isn't about that. Not that it should, but it isn't about anything else, really. Tarkovsky just SHOWS you some images he likes and you're supposed to do all the thinking. I'm fine with some thinking, but after the first 20 minutes of nothing I started to suspect maybe it's not my fault, maybe I'm not dumb, maybe I'm not the problem.Because a film has to be balanced. It has to have some excuse, some distraction, to take you along its emotional or moral ride, it can't just be a speech about morality and a bunch of unrelated images. Nostalghia is that. Is the other end.The characters have no lines. I swear they don't. They have only monologues, only poetry. But it's not good poetry. It's that sketchy, meaningless poetry that you find on a depressed 80-year old's dusty unpublished diary. You could interchange any of the character's lines between them and you wouldn't notice the difference. In fact, you could put the whole movie backwards and it wouldn't matter either.Maybe is the fact that you could have some character interactions that are worth glancing act; maybe is the fact that you could have a sequence with multiple things happening at once to speed up the process. We are mistaking lazy with genius, and with enough steady camera anyone'll believe it. But no, the movie stuffs all of its characters with all the baggage of explaining the meaning of life every time they open their mouth, and then they stare at things for fifteen minutes. That is not what a good movie is made of.The scene with Domenico's speech is terrible, because it's again poetry, that could've been put anywhere else in the movie, or viceversa, and nobody would've noticed. The constant shots of the protagonist's wife, again, they serve no purpose, they just kind of exist, like everything in this film. They only represent a vague sense of sadness that doesn't move anything forward; it doesn't go anywhere. The scene of the candle. By God, how frustratingly unimportant that scene is, it is not an experience, it is torture, because the so-called \"build-up\" to it isn't a build-up, it's just random rambling about it as a concept, there isn't any purpose to it.He is trying too hard to depress you, make you feel like if he accomplishes it and taking credit for it as if that equals making a masterpiece.The word \"pretentious\" is thrown around a lot when it comes to a certain type of cinema. I've seen Fellini and Bergman films and they have their touches of pretention. It doesn't ruin their movies, mostly, as it coincides with their goals, how they manage to tell their stories. But there's an air of pretention to Nostalghia that I've never seen in full display quite like it. And that's the prolem with it. It is only that: every conventional cliché about avant-garde movies rolled into one.I don't care where you're from and how much of a mental disorder you might have, nobody talks or walks that slow. Life is not that slow. A good movie has to have both fast and slow moments to achieve a momentum that it can then submit to reflection. Tarkosvky films are generally pure reflection with none of the things that make storytelling interesting. A good script, a fleshed-out character, a mystery to be solved.I've seen it before, and many of his movies do this. But here, it is disrespectful to the viewer, I feel, to a point to which I cannot cut any slack. It is one of the most disrespectful movies I've ever seen. Because under this vail of slow-moving, big-brain lies, it shames the viewer into thinking there is something to it, when there absolutely isn't. It is an impossibly boring movie, with nothing to offer, that stretches out to two hours in length.",
            "review_date": "2018-06-19"
        },
        {
            "review_title": "Tarkovsky's first non-Soviet film does not disappoint",
            "content": "While I do rank Andrei Rublev(the greatest Soviet film ever made from personal view), Mirror(Tarkovsky's most personal) and Stalker above it, Nostalgia doesn't disappoint in any way; coming from a director who was one of the few who did not make a bad film, even my least favourite Ivan's Childhood was great and contains one of the best child performances ever.Nostalgia is not for everybody, despite being one of his shortest it is one of Tarkovsky's least accessible along with Solaris. People will be captivated by the photography, the symbolism and direction amongst other things while others will find the slow pacing too much for them, mightn't completely understand what's going on or maybe find it repetitive. As said already, this viewer is one of those people who considers it another Tarkovsky masterpiece. It's not a Tarkovsky film without beautiful visuals and imagery and great directing and Nostalgia absolutely has both. The mix of black and white and colour are truly striking while the photography(the most interesting being the lengthy but hypnotic lighted candle sequence) like all Tarkovsky films is some of the most stunning and arresting seen for any film. Tarkovsky's direction as ever is exemplary even late in his career, despite being his first Non-Soviet film Tarkovsky's unique style is unmistakable. The symbolism is fairly straightforward and still powerful.Nostalgia's music score is hauntingly melancholic and the dialogue is thoughtful and subtle, the desolation of art speech contains some of the most thought-provoking dialogue of any Tarkovsky film. With the story, the slow pacing did not bother me at all. Quite the opposite, because a lot of parts were so dream-like and mystical it was so easy to be captivated by it. The story itself is one of Tarkovsky's most personal(second only to Mirror) and has its fair share of emotional power, if not as much as Andrei Rublev and Solaris. The characters carry the film well and the performances are fine, Oleg Yankovsky is a compelling lead and Erland Josephson is appropriately distinguished and better than he is given credit for here. Overall, not one of Tarkovsky's best but doesn't disappoint at all. 10/10 Bethany Cox",
            "review_date": "2015-01-09"
        },
        {
            "review_title": "Disappointing",
            "content": "The great about Tarkovskij films is the poetry in the pictures, the melancholic beauty which is almost too hard to bear. A lot of it is in this one: the water, the garbage, strange, haunting sounds in the background, the dogs, the empty rooms with metal beds and rotten walls, the rain, the warmth of pure, shy love, the static, photography-like pictures (sometimes even filmed pictures), the poems, the philosophical discussions.The failure of \"Nostalghia\" shows the fragility by which these ingredients are held together in films like \"Solaris\" or \"Stalker\". The thin plot line is torn apart, there is no connection between the plots of exile (what a great plot for Tarkovskij this could have been!) and the plot of saving the world by sacrifying yourself. Domenico the lunatic is just not fascinating. You feel that Andrej cannot understand Eugenia, just as Andrej the director can't. The dialogues are awfully pseudo-intellectual, the fixation on Christian faith just penetrant (compare \"Stalker\" which is all about faith, but without the churches) - even God himself speaks. The story of carrying a burning candle through a pool and thereby saving the world can hardly be told without exposing it to ridiculousness. Andrej's death is hardly prepared, as young and healthy as he looks this just feels like a deus ex machina. In a word, \"Nostalghia\" is boring and self-indulgent. Maybe it is not a good idea to name your protagonist like yourself (although there was no problem in \"Andrej Rubljow\") and letting him read your brother's poems. What could have been great scenes in great films look here like mere self-plagiarisms. And there are scenes where Tarkovskij's genius rises: drinking wodka in the bath arches and talking to a child (one of the few scenes where Andrej comes to life); the final scene with the candle; the scene in Domenico's house. If you have never seen a film by Tarkovskij before, don't watch this - it might keep you from seeing his masterpieces. Three stars for a blundered film in respect of the artist.",
            "review_date": "2003-03-13"
        },
        {
            "review_title": "Typical of Tarkovsky",
            "content": "My Rating : 2/10Same old Tarkovsky-esque atmosphere used in his earlier brilliant work Stalker and Mirror, nothing new here. No story, horrible dialogues and completely boring.No. Just no. Skip this for the sake of your sanity.",
            "review_date": "2018-10-25"
        },
        {
            "review_title": "almost too obtuse with some of its poetry, but it's the work of a master nonetheless",
            "content": "Nostalghia, a film Andrei Tarkovsky directed while he was out of Russia and in Italy, is almost as personal, if not more-so, than his film the Mirror. The main character's first name is Andrei; there's mention of a poet named Tarkovsky (possibly Andrei's own father, if I'm not mistaken); the main character, while trying to do something else with his time (write a biography on a musician) is distracted by his personal turmoil over his family, who are back in his homeland, as was Tarkovsky to a degree (he might have been in exile, I'm not sure). And on top of this, we're given a substantial amount of black and white scenes, often either in slow-motion speed or directed by Tarkovsky to seem like such, from dreams and memories that call for a time and place that is specific but also ethereal, strange and probably symbolic.So why then does the film not work if the creator's soul was poured entirely into it? I think, perhaps, there is almost *too* much of a reliance on creating a mood of meditation, for there to be total concentration upon the atmosphere that Tarkovsky has created- as he has in all of his movies- upon which is a sort of world unto itself, seen through its filmmaker in a way no other can see it. This may be expected for one already familiar with the director's methods, but even still there's so many silent moments, so many long takes with the most slight of camera movements, so much contemplation in place of dialog (there's only a few scenes where we see characters communicate in that manner), that it takes a lot out of the viewer to stay with the ideal of spiritual redemption that Tarkovsky is after.Or is it redemption? Is it just simply a quest into oneself? Why does Andrei follow Domenico (brilliantly played in subtle/not-so-subtle form by Erland Josephsson), who cannot be really relied upon as a source of redemption or actual thought provocation? This is a man, after all, who yells out his speeches to bewildered crowds in a town square and then proceeds to go through a very severe act on himself (to Beethoven's 9th no less!) There's a lot of mystery to this character Andrei, and the actor portraying him, Oleg Jankovsky, is so subdued and detached at times that his female translator counterpart (possibly mad as well) can barely get a rise out of him save for the bloody nose. This strange sensation to seek in to a character that Tarkovsky leaves open to much interpretation, plus the procession of shots that seem to last for about as long as imaginable, makes it an uneasy viewing experience.But at the same time that there's this uneasiness, there's also a wonderment that is going on as well. I couldn't pull myself away even if a part of my mind screamed out \"where's the plot?\" There's such a strong sense of direction going on, the moods created in certain places (i.e. the fog over the hot springs at the Spa, the darkness in the bedrooms, the chilling sensibility to the flashbacks/dreams), almost in spite of the lack of a really solid story, as it becomes less about what happens than about what is in this character, the nature of this exile in Italy as it makes Andrei pull into his own existential finale of sorts. That finale, as some may have read, is extraordinary, maybe the whole reason, as with Sacrifice's fire finale, that Tarkovsky made the movie in the first place: the poet carries a candle, as suggested by Domenico, across a sacred pool, and when it goes out he goes back, and does this again, and again, until finally he makes it across. Never a cutaway, always intuitively shot by Tarkovsky's cameraman, and it brings on a whole other quality that crosses paths between what is fiction in the film and reality in front of the camera.While I praise the film, and recommend it, it's not the kind of work that someone who isn't familiar at all with Tarkovsky should see as an introduction. On the contrary, this might be more worthwhile as the final work in his (saddeningly) small body of work, as its pace and modus operandi can be further appreciated. Grade: A-",
            "review_date": "2008-05-26"
        },
        {
            "review_title": "Strange and disturbing",
            "content": "This wonderball film is the only one of Tarkovsky's works that somehow made me feel cheated for something. The beginning was utterly mystical and strange and attracted me to the film, but halfway through I had a hard time keeping up.Of course, there are scenes that were as stunning as anything Tarkovsky has done before, if not even more stunning. The church scene in the beginning of the movie is one. Then the bath place scene and the scene where the Russian talks with THE MAN in Josephson's interpretation. Yet by the end of it, I felt more sad, disturbed and hopeless than with any other of Tarkovsky's movies or any other movies in general. What is the message, the hidden message, behind this film? Why does THE MAN set fire to himself? And did the Russian really manage to \"save the human kind\"?It all left me more depressed than I've ever been, only \"Arlington Road\" and \"Donnie Darko\" made me feel the same. And in the end, between the strange dream sequences, Josephson's metaphysic theories and Yankovsky's grim performance, I came out feeling like I was cheated for THE THING. That thing that was there in \"Andrei Rublyov\", \"Solaris\" and \"Stalker\".Anyway, this is perhaps the most existentialistic of Tarkovsky's films, which should say something about it's nature and serve as a warning to those who intend to see it. It is a haunting, deeply personal and unreserved journey to redemption and knowing this was the director's last Soviet film, it adds a symbolical value to the film. Still, together with \"Zerkalo\", this is one of the few Tarkovsky's films which is impossible to enjoy as it is too dark and painful.9/10",
            "review_date": "2005-02-23"
        },
        {
            "review_title": "A poetic piece of magic realism",
            "content": "Previous critical comments about Nostalgia include 'the nearest to poetry that cinema can ever aspire'. There is nothing more one can add, this comment sums it up totally. I would say that this film is different every time I watch it, it's more than poetry, it's hypnotic to the state of Tarkovsky casting a spell on the viewer.",
            "review_date": "1998-11-08"
        },
        {
            "review_title": "A Beautiful Film, But...",
            "content": "Every scene is a painting, but as can often be the case, adding them together does not make make a satisfying film. I would recommend seeing it just for the visual artistry, but I don't claim that you'll feel like it was time well spent if you watch the whole thing.\nRegarding the almost non-existent story, I wanted to slap the main character and say, \"Hey, do you know what's a better thing to do than walking a lit candle across a thermal bath? ANYTHING!!!\"\nCircumstances may not be what he would wish, but you have to put on your big boy pants and move forward. You can't just sit around wallowing in your misery and trying to find meaning in the ramblings of a mentally disabled person. And don't expect me to think you're wise or insightful for doing so.\nWhen you've reached the other side of the bath with the candle, what have you gained other than muddy shoes? Go do something that matters.",
            "review_date": "2020-07-01"
        },
        {
            "review_title": "Go in with an open mind and the time and you might be pleasantly surprised.",
            "content": "You know what you're getting with a Tarkovsky movie and this is no exception: an aesthetic experience which really gives the time to just feel the moment and get lost in its hypnotic power as still (as often as cogent) as a painting.I would be lying if I said I really get this movie. A cursory glance at wikipedia tells me that the untranslatabillity of culture is an aspect though was more inclined to say it was about the desperate search for meaning in an ostensibly (and probably) meaningless world. Though that is a much easier interpretation...I don't the mainstream, quite the opposite. But it is often to brilliant to find a movie that really embraces the freedom film can give to an artist. What some people would call an \"art film\" but I don't like to say this because all movies are art. The carefully composed images, the apparently inconsequential conversations, the switch from color to black and white (I'm a real sucker for that when done well; Schindler's List handled poorly in my opinion), and the stangely stylised vision of the world where people just stand around posing as if for a painting. I also admire the use of long takes. Bare in mind I did watch this is several sittings.So as is usually the case with this writer-director, what we have is a slow, austere, strange, not particularly cogent but very satisfying experience that Chris Stuckman will probably never talk about.",
            "review_date": "2020-02-29"
        },
        {
            "review_title": "Miracles in an Empty Pool",
            "content": "This is probably Andrei Tarkovsky's most autobiographical film, which is saying something because Mirror is about his own childhood. Mirror was really about the environment that led to the creation of Tarkovsky himself, in a way, but Nostalghia seems to be much more about Tarkovsky in the moment. His main character (also named Andrei) is a Russian national in Italy on a project, yearning for home, and the making of this film was when Tarkovsky decided to enter exile away from his motherland, the catalyst being Mosfilm pulling funding for the film right before production while he was in Italy after years and years of dealing with the Soviet bureaucracy. All of Tarkovsky's films were personal to him, but this one just has that extra something there.Considered a minor work in a filmography of seven movies, Nostalghia tells the story of Andrei Gorchakov (Oleg Yankovsky) who is in Italy researching for a book about the Russian composer Pavel Sosnovsky with his attractive and young Italian translator Eugenia (Domiziana Giordano). They head to Bologna where Sosnovsky stayed for a time. They go to a remote church where a procession of women carry a statue of the Virgin in a ritual designed to pray to her for fertility, something Andrei made them go out of their way to see but doesn't even bother to go in to witness.Outside their hotel are some famous baths, mainly a large outdoor pool that a handful of people float in for restoration. Along this pool often walks the local crazy, Domenico (Erland Josephson). He locked his family up in his house for seven years, preparing for the Apocalypse which, of course, never came. His family fled after being rescued, and Domenico has quietly led a small life in Bologna ever since. This personality fascinates Andrei, and he wants to get to know him better despite Domenico having nothing to do with his research.There's an interesting moment before Andrei actually meets Domenico when he asks Eugenia the meaning of the Italian word \"fede\". It means \"faith\", but the way it's asked and answered implies Andrei's mental state rather perfectly. He has no faith behind the physical to the point where he doesn't even know what it is. Of course, he literally does know what it is (Eugenia just offers up the Russian word instead of a definition), but the implication is strong.Andrei meets Domenico at Domenico's home, a remote building that's falling apart with open sections in the roof that allow rain to fall down generously (a repeated image of The Room from Stalker), and Domenico reveals the depth of his faith that the world is in the process of ending. He also reveals that, in order to avert the Apocalypse, he must traverse the baths with a lighted candle, but he is constantly removed from the baths every time he tries. This is crazy talk on a literal level, but that's kind of the point. It doesn't take great faith to believe in something easy to digest. It takes great faith to believe in something outlandish.The center of Tarkovsky's films are always very small, the trials and tribulations of an individual against a larger context (Russian history in Andrei Rublev and Mirror, a thinking planet in Solaris, a room that grants innermost desires in Stalker, the Second World War in Ivan's Childhood). How much can one person affect the larger context? How can one maintain faith in the face of so much allayed against them? From a man who lived his life in the Soviet Union, it's an understandable point of view.The main focus of the film ties into the film's title. Nostalgia is rampant in the film as everyone yearns for a different time. Domenico rails against the modern world, the source of his Apocalyptic concerns. These words mean something to Andrei, who also yearns for his wife and children back home while feeling lost in the modern world at the same time. Even Eugenia thinks back to her time in Moscow and the other men she met there who might have made her happier than Andrei (she's frustrated that he won't sleep with her). How can everyone go back to the happier times of their memories?These ideas, faith in a time of crisis and yearning for a happier time in the past, coalesce in Andrei. Lost in Italy with little belief, he latches onto Domenico slightly. When he returns to Rome to wait for his flight back to Moscow, he discovers that Domenico has gone to Rome as well, standing atop the statue in the Piazza Vittorio Emmanuelle II and delivering long speeches (like Castro, Eugenia describes) about the evils of the modern world. It's obvious, though, that Domenico is being manipulated, and when he self-immolates the man who handed him the gas can mocks his pain.Faith must manifest in some way for the soul to find any kind of hope, it seems. Without faith, all that there remains is the material, and Andrei can't seem to accept that, so he takes the candle Domenico gave him, goes back to Bologna, and walks across the now empty pool. This scene, all shot in one take as Andrei tries three times before successfully making it across, is the kind of thing that Tarkovsky understood. Hitchcock proved that editing is key to tension in film, but Tarkovsky found a way to pull it off without editing. The single shot is the kind of moment where the audience ends up holding its breath as we see wind knock the tiny flame back and forth as Andrei tries to shield it with his hand, arm, and even his coat.Tarkovsky's later films really rely on their endings to wrap everything up. Drawing from the Aristotelian ideal of classical unity, in particular its concept of unity of action, everything in the films was designed to come down to a single idea. Every action, character, and location was meant to further the idea at the core, and endings can end up very important to that concept as they wrap up the action and provide the resolution to everything that had come before it. So it's interesting to watch the film with this in mind, certain that it will all come together, and it does. Andrei's walk across the pool is open to some level of interpretation (Andrei succumbing to madness, finding faith, or perhaps just simply desperate for some meaning in the world), but it gives meaning to the preceding two hours. That effort on his part gives explanation to his early meanderings, solace and completion of Domenico's own madness and faith, while also helping him come to terms with the absence of his own family.Tarkovsky movies aren't exactly what one would call fun, but they are engrossing if you let them. Nostalghia reminds me a bit of Terrence Malick's To the Wonder, a seemingly smaller film coming after something so much larger (Stalker for Tarkovsky and The Tree of Life for Malick), a supposed letdown of sorts from the previous work. However, I think both are really underappreciated considering their actual artistic merits. Nostlaghia represents a further refinement of Tarkovsky's style after the chaos of the previous production, completely freed from the constraints of the Soviet bureaucracy, and still yearning for meaning.",
            "review_date": "2021-10-15"
        },
        {
            "review_title": "Homesickness in three layers",
            "content": "Everybody who has seen some Tarkovsky movies knows that a thrilling plot is not to be expected. However with \"Nostalgia\" Tarkovsky seems to outperform himself in this respect. Maybe this is the reason that \"Nostalgia\" is the least viewed and least reviewed film of the Tarkovsky oeuvre. I saw some clips with an interpretation of the movie that had a longer running time than the film itself!The only thing that is petty clear is that \"Nostalgia\" is a film about homesickness. The film presents this in three layers. The main character Andrei (played by Oleg Yankovsky) is a Russian writer who does research in Italy about the 18th century Russian composer Pavel Sosnovksy (framed after the real composer Maksim Berezovsky) who was studying opera in Italy. Sosnovsky was homesick, as is Andrei a couple of century's later. The third layer is Tarkovsky himself. \"Nostalgia\" was his first film shot outside Russia, and he would not return to his home country. In this respect \"Nostalgia\" has a strong autobiographical element.The film has two other main characters, the translater Eugenia (Domiziana Giordana) and the eccentric Domenico (Erland Josephson). The clips I refered to above had al sorts of profound thoughts about their meaning, but for me it was not obvious at all. At one point in the dreams of Andrei Eugenia met with his Russian wife. This reminded me very much of \"Persona\" (1966, Ingmar Bergman). Domenico is the fool of the village, but is he real a fool? His character has some resemblance with the character of Johannes Borgen in \"Ordet\" (1955, Carl Theodor Dreyer). In general the function of the character of Johannes was more clear to me than that of Domenico. Nevertheless there is one wonderful scene with Domenico. Domenico has kept his family inside his house for seven years because he is expecting the end of the World. After they are freed by local police his young son runs away and Domenico runs after him. In the beginning of the scene it is obvious that Domenico is trying to catch the boy. After a while this hunt gradually evolves in accompanying the boy in his voyage of discovery. A very beautiful scene indeed.The way to appreciate \"Nostalgia\" may be to give up explaining and to start enjoying the beauty of the images. Images often with a lot of fog and certainly not the images you would find in a tourist travel guide of Tuscany, but beautiful all the same. Perhaps the most well known image is the one at the end of the film in which a wooden house Russian style turns out te be enclosed by the ruins of an Italian cathedral. An image also summing up the main theme of the film.",
            "review_date": "2021-01-16"
        },
        {
            "review_title": "Tarkovsky's subdued imagery-fuelled journey",
            "content": "Oddly, I found Tarkovsky's NOSTALGIA to be one of his more accessible movies despite the languid pacing and lack of 'meat' in the narrative structure. It's about a Russian poet touring Italy who ends up meeting a mentally ill fellow and becoming strangely drawn to him. It's the type of film that makes you question the notions of reality and fantasy, civilisation and chaos, and it has an effective dream-like atmosphere. I found the subdued performances rather uninteresting, but Tarkovsky's camera captures some unforgettable imagery, particularly at the climax.",
            "review_date": "2017-05-09"
        },
        {
            "review_title": "Every Tarkovsky film is a masterpiece. He didn't make a bad movie.",
            "content": "Very hard movie to watch but it is worth it. Cinematography is so gorgeous like in every film he made. You need to be fully concentrated to watch it and to understand what is all of that supossed to mean. Dialogue is so deep and meaningful. His movies are pure art.",
            "review_date": "2019-09-30"
        },
        {
            "review_title": "Has its moments, but glacially paced",
            "content": "Poetic and philosophical, but ponderous.The theme of the transplanted Russian longing to return home was obviously deeply personal to Tarkovsky, and there is a great heaviness to this film, shot in drab surroundings and craggy ruins. It's also the work of a man at a certain age in life when parents and friends are beginning to pass away, looking at life nostalgically but also with somber perspective. Throughout the film there are many doors and gateways, seeming to symbolize transitions in life, and there are also several mirrors, with the main characters sometimes surprised at the image they see reflected. Many of these shots are beautifully composed, which is not a surprise given the filmmaker's immense talent.Spoilers from here on.In the moments that stirred me most in the film, it seemed to ask, what can we do with this fragile life of ours, and symbolized it with fire. The man deemed insane has great insight when he says humanity must come together (\"We must listen to the voices that seem useless\"), chastises those who are well off (\"It is the healthy who have brought the world to the verge of ruin\"), and advocates for a simpler life (\"Just look at nature and you'll see that life is simple. We must go back to where we were, to the point where you took the wrong turn\"). He says all that, but then out of despair or perhaps as a way of trying to wake people up from their disinterest, incinerates himself.Meanwhile, the poet tries to keep his capering candlelight alive while crossing the water in the ruins of the old baths. You can see both great perseverance and ultimately great futility in this small task, attempted again and again, and there is something both triumphant and sad about it (something I also felt in the film's final image). Earlier on the poetry of Tarkovsky's father is quoted and we hear:\"I am a candle. I burned at the feast. Gather my wax when morning arrives so that this page will remind you how to be proud and how to weep, how to give away the last third of happiness, and how to die with ease - and beneath a temporary roof to burn posthumously, like a word.\"There is some really profound stuff here, and it's a film that oozes melancholy at a time that struck an emotional chord with me. It's interesting though - as in other Tarkovsky films, Pushkin is mentioned, and I only wish the director had some of that poet's talent for concision. Several scenes go on interminably, and while they're meant to increase the emotional weight, for me it had the opposite effect. I'm not sure about the translator character either; maybe she was meant to provide momentary lightness to offset all of the other heaviness, but I thought she could have been more effectively incorporated. It's a film that I'm glad I watched, but it's not one I would reach for again.",
            "review_date": "2020-12-14"
        },
        {
            "review_title": "The clichés of art houses coupled with enormous talent for cinema",
            "content": "Before making an art house film check the following ingredients:A lot of camera movements behind pillars, columns and walls Add a lot of fog and smoke to create a mystic mood During dialogue film the person speaking on his back or don't show people at all Don't forget a little bit of nudity from the leading female character but not too much to avoid vulgarity Make sure there is a plot but don't use it during the film And of course the madman who turns out to be the wisest man on earthNostalghia is the kind of film that uses this and other clichés of art house in such a way that the movie is boring as hell. The plot is about a Russian poet looking for traces of a Russian composer who lived in Italy some centuries before. We learn nothing specific about the poet and the composer except that they both suffer from homesickness. And of course the director projects his own longing for Russia on his protagonist and the object of his study. The only thing that saves the film is the talent of Tarkovsky to shoot beautiful scenes. There is a camera movement from an arcade to a healing pool that is absolutely breathtaking. The scene where the poet is in the house of the madman and the rain is pouring through the roof is gorgeously filmed. And I never will forget the scene where the madman is standing on the statue of a Roman emperor and his horse (sorry, I'm too lazy to look up the name of the emperor) and shouting his thoughts to an apathetic crowd. Those scenes are worth it to watch over and over again but you have to suffer all the other endless scenes with static camera where absolutely nothing happens or nothing interesting is said.One of the strangest incidents taking place is the suicide of the madman. I missed the clue why this should be in the script completely. Except for that Tarkovsky would show us how people are manipulated and used for other people's agenda. But it has nothing to do with the main theme which is the longing for your home ground. The final scenes where the poet is fulfilling a promise to the madman and finally collapse because of a failing heart are beautiful. A lot had been said about the final scenes were the poet is shown in front of his house in Russia which is placed in the ruin of an Italian cathedral. His love for both worlds are united here as he reached his heaven.Tarkovsky showed us a lot of things in this film what made him a unique director. For its screenplay (also by Tarkovsky) this movie is much less successful. I was left with the feeling that a chance of a masterpiece was missed here.",
            "review_date": "2014-04-01"
        },
        {
            "review_title": "sad worship of a misunderstood director",
            "content": "There's a reason most people don't know about this movie and that's because it's for film students and those who consider themselves in the hierarchy of the film community. Are people too in love with Tarkvosky to recognize this is a bad movie? Bad storytelling? It \"invents\" nothing. There are virtuous aspects; no doubt. We all know that they're technical. The acting, however, is misdirected. Great actors who have nothing interesting to say and walk around just speaking words. THey mean nothing. Tarkovsky's \"sculpting in time\" theory has not been closely followed for good reason: it makes for tedious, dull, and repetitive movies. His movies won't last.",
            "review_date": "2005-12-01"
        },
        {
            "review_title": "Tarkovsky's Nostalghia (1983)-A Fine Example Of Impressionistic Art.",
            "content": "Andrei Tarkovsky's Nostalghia (1983) is as great an example of Fine Art as I have ever seen in any medium, cinema or otherwise.The film as a whole can be considered to be a montage of scenes and images that are only very loosely, and at times not at all, connected to each other in a \"straight\", literal sense. True enough, there is an overarching general temporal sequence in the scenes of the film, but this temporal sequence does little to aid the viewer in a strictly rational answer to the seemingly simple query: \"What Is This Film All About?\" As a work of Fine Art, I would liken Nostalghia to the work of Impressionist painters such as Monet, Renoir, Degas, and Cezanne. The artistic motivation of these painters was not in any way to portray reality in photographic accuracy, as did painters of bygone eras. Indeed, the invention of the camera made such an artistic motivation superfluous for painters. What the Impressionist painters tried to do, with varying degrees of success, was to portray reality with less than photographic, literal accuracy in favor of a portrayal that has more of a non-rational \"impact\" on the viewer, on the intellectual and/or emotional and/or visceral levels of experience. As such, the Truth of Impressionist paintings as it is conveyed to the viewer is not an \"absolute truth\" but, instead, a contextual, even an interpretive truth.So too, the portrayal of reality, and the subsequent Truth of that portrayal in the viewer's experience of Tarkovsky's Nostalghia is on a non-rational, purely subjective, contextual, interpretive, and perhaps even intuitive level. This film offers a non-obvious mixture of sometimes disjointed dramatic scenes, sometimes deep philosophical dialogue, isolated imagery, sometimes admittedly strange symbolism, innovative cinematography, & sometimes radical editing in an attempt to deliver an \"impact\", an \"Impression\" on the viewer on the intellectual, emotional, and visceral planes of his viewing experience.The exact \"meaning\" or \"truth\" of that impact is decidedly intended by Tarkovsky to be unique to the individual viewer of the film, and is incumbent on the individual viewer to decide for himself.",
            "review_date": "2015-05-28"
        },
        {
            "review_title": "It is necessary to listen the voices that we find useless, because the problem of the world is that there is not more teachers.",
            "content": "\"Nostalghia\" is the first Tarkowsky's work that i have seen. At the first and poor look, the movie is one of the most boring and low movies that i have seen. But, if you really watch it... \"Nostalghia\" is a real masterpiece. The film is about a Russian writer that want finds in Italy about a famous musician of later centuries. But he founds more than he wants. \"Nostalghia\" is one of the best deep reflection of the human being in any movie that i have ever seen. If the movie is slow, is because there is no a different way to show the most deep of the soul of a human been. And this poetic representation is the why \"Nostalghia\" is a masterpiece,\"Nostalghia\" is more than anything, an spiritual film. A film that explores the contemporary culture since the point of an artist. Is too a reflection (and that is one of the most spectacular things that the film have) of the world and people that control it. Domenico's character, a man who has faith (Faith, look that important word, faith) that for the others, the man is crazy. The man is just any other waste of a group of crazy humans. And Domenico tell us that this world is controlled by people who proclaims it self like \"people that this well of the head\", and for that reason, the world is a \"wonderful\" one. And we see that the world is good, but too has wars, death and injustices.\"Nostalghia\" is that and much more. Is a lovely and philosophical travel nonpareil. See it... your soul going to live a rich experience by a teacher that much of us ignore. And you going to see that the voice of this one is more valuable than we think.*Sorry for the mistakes... well, if there any.",
            "review_date": "2007-01-03"
        },
        {
            "review_title": "Enigmatic Beauty",
            "content": "As puzzling as one has come to expect from Tarkovsky, the film still delivers with its deeply moving scenario eliciting subconscious emotional responses in the viewer. As in The Mirror, the film is deeply invested in the significance of the mother-son relationship (Tarkovsky dedicates the film to his mother) and the motherland-son relationship (reflecting Tarkovsky's fraught relationship with his beloved Russia).Many of the scenes are framed as beautifully as any classical Italian painting, and the usual Tarkovsky motifs are interwoven throughout the screenplay, particularly water, which again cascades through interior setting and in which the players are frequently immersed.If you find Tarkovsky's indirect approach irritating, the film will not please you. But if you appreciate his artistry and subtlety, you will be mesmerized by Nostalgia.",
            "review_date": "2021-04-27"
        },
        {
            "review_title": "At 1a.m., it all made sense",
            "content": "At one in the morning, I threw in Nostalghia and let myself become inundated with sparseness and visual poetry. People describe this film as poetic; I 'd go further and say its like music too. I sometimes put it on and just do my things, and come back to it. It's a work of immense beauty and transcends normal movie viewing practices. Try it one day and put it on late at night, with a glass of beer. You'll see what I mean.",
            "review_date": "2000-02-29"
        },
        {
            "review_title": "Pretty Pictures, Not Much Else",
            "content": "This is nowhere near the same level as Solaris or even the similarly plodding Stalker. It's pretty much a poster boy for pretentious cinema that your hillbilly friend mocks you for watching. For all that, it's not a total loss.The images are beautiful.But the characters bounce off of each other like pool balls instead of actually interacting. We never learn anything about them past superficiality. She hates him because he's not a real Russian. Or something. The New Age philosophizing would be embarrassed in the Barnes and Noble \"New Age\" section of books. (The only thing that saves it is the location among the ruins. Otherwise, just lock the loony up; he has nothing to offer.) We are beaten over the head repeatedly with imagery whose \"meaning\" we figured out 10 minutes in. Etc.I have a high tolerance for modern film; I love the \"nothing happening\" films of Antonioni, like L'Aventurra. But I have to agree with some others on here who were saying \"Only a film student could love this movie,\" and I'll wager that they are the ones keeping it so highly rated.",
            "review_date": "2017-11-26"
        },
        {
            "review_title": "Can the world be saved?",
            "content": "Visually beautiful film about alienation and faith. Slow paced, with the exquisite photography and unconcealed philosophical dimension that have become Tarkovski's trademark, \"Nostalghia\" demands attention and ultimately delivers. The famous \"candle scene\" is a poetic, striking and exasperating visual representation of faith, redemption and the artist's mission. \"1+1=1\", \"Ode to Joy\", the girl's speech, Domenico's plea- all these will remain with you for a long time.Tarkovski's movies don't seem biased; they don't make categorical statements, but raise questions that remain mostly unanswered. For Tarkovski, the movie is a search, a personal catharsis. It's true that Tarkovski speaks through all his characters, but what he has to say deserves attention. This won't be your typical \"entertainment\", but a thought-provoking and fascinating journey into the mind of a great film maker.",
            "review_date": "2012-01-31"
        },
        {
            "review_title": "\"Nostalghia\" is a masterpiece and a work of art",
            "content": "\"Nostalghia\" (1983) directed by Andrei Tarkovsky, and written by Tonino Guerra is Tarkovsky's sixth and pen-ultimate feature film (the first of the two he made outside the Soviet Union), and takes on themes of dreams, longing, loneliness, and naturally nostalgia, and includes the usual rich symbolic references that Tarkovsky was famous for.Tarkovsky is storytelling-wise at his most simple in \"Nostalghia\", but the film is still very complex and symbolic - a signature of Tarkovsky's direction and (co-)writing.I wouldn't want to spoil the film, but I can say that my impression of this film was that of reflecting on one's own life, through the observation of the past - as with Tarkovsky's other films, \"Nostalghia\" focuses on the aspect of time. The approach to this film is striking, as it basically lacks a narrative, apart from the fact that the protagonist, Andrei Gorchakov, is experiencing moments of nostalgia, in which his past intertwines with his present.It is very much a visual ride - full of beautiful images. Cinematographer Giuseppe Lanci does an incredible job here - with stunning use of different film stocks. Just like Vadim Yusov and Georgi Rerberg did before him as DPs, the imagery is fantastic - of course guided by Tarkovsky's genius vision.The editing is more dynamic in this than his other works, switching both between fast and slow takes. Some shots are less than a second - and several others upwards of five, even ten minutes. The contrasting nature of the editing really made an impression on the storytelling, when protagonist Andrei experienced his own nostalgia in his life.Tarkovsky did not perceive filmmaking as a means of entertainment, but as an artform. As with all of his other films, \"Nostalghia\" is a rare testament to this approach to filmmaking - and a true work of art.",
            "review_date": "2020-01-25"
        },
        {
            "review_title": "Neither Tarkovsky's best or worst, but perhaps his most unusual",
            "content": "\"Nostalghia\" is a Soviet/Italian co-production from 1983, so this one is over 35 years old now and despite this age one of the final works by writer and director Andrei Tarkovsky. You can see by the onclusion of another, an Italian, writer here that this film is not as Russian/Soviet as most of his other works, even if Russian is the dominant language. But there are also large parts in Italian and if you know Tarkovsky's poetic narration style at times, the wonderful Italian language can only work in his and the film's favor. I won't/can't say too much about the cast here. The lead actor is Oleg Yankovskiy and I don't know him. As for his female counterpart I am a bit surprised she really wasn't a prolific actress and Josephson from Sweden is an actor you also would not expect in a film like this, but it kinda fits as he worked with Bergman and Bergman and Tarkovsky do have parallels. But back to this film now. At slightly over two hours it is far from Tarkovsky's longest works. But there are other parallels, like that once again he mixes color scene with black-and-white. I was missing the dwarf here though. Or another parallel that you will hardly find any funny moments. My crows badly needed them as I saw from how they burst into laughter when this father goes up with his child to listen some music after the argument between the two lead characters.Still, Russian/Italian is a rare combination in moves really. I mean with the mob from both countries, you could probably make fantastic crime movies, but obviously this is not the genre to expect here with Tarkovsky. Instead we have an artist from Russia coming to Italy to explore the past of his subject. And with him he brings the woman he desires. Or does he? Does she? It is never completely clear what the relationship between the two is like in detail. But they both have their moments with how the characters are written and with that I am also referring to the female's job in translation. Actually it was a bit funny, more subtly funny, how Tarkovsky somewhat made fun of himself with how art is impossible to be translated without the artistic component getting lost and the writer he mentions there is even called Tarkovsky too. Aside from that, fire is a big recurring aspect in this film culminating in a character being burnt alive. The rain before the clothing credits felt almost a bit soothing I must say. The character up there screaming all these phrases in Italian was among the more memorable. So was the priest early on too with his old very traditional perception of the woman's role in relationships.Freude schöner Götterfunken I am always fond of certainly, but here it was obviously with how it ended used in a very destructive and sarcastic manner. It worked. I liked it. I liked this film overall thanks to individual scenes more than other stuff from Tarkovsky I have seen, probably also because it was shorter and less shallow and less pretentious. Still, story is key as always and even with good lead performances, I was just not won over in a way that U genuinely cared what would happen next. To them or in total. So this one is another thumbs-down for me. Tarkovsky is just not my thing, so it is difficult to understand the awards recognition, for this one here and in general. Watch something else instead.",
            "review_date": "2019-08-17"
        },
        {
            "review_title": "A Masterpiece Of Cinematic Boredom",
            "content": "Considered by many to be the most under-appreciated film of Andrei Tarkovsky's career, Nostalghia intertwines faith, art, culture, philosophy & spirituality through the wistful eyes of a Russian writer who visits Italy for research purposes but finds himself lost & longing for his homeland until he meets a strange local who shares his feeling of alienation.Co-written & directed by Tarkovsky (Solaris & Stalker), the story employs dreams & memories to explore the themes of nostalgia & homesickness and incorporates slices of the director's own voyage to Italy. Cinematography is a definite highlight, for the use of silent manoeuvres, steady zooms, sharp imagery, long takes & ideal lighting is as inspiring as it is breathtaking.But this isn't a film for all. The narrative is esoteric, pacing is lethargic, characters are distant, and it doesn't take long for the patience to run out. Nothing happens in it. From start to finish, its characters are lost in their own worlds and remain as alien to viewers as they are to their surroundings. And the glacial pace at which it all unfolds only makes the journey all the more frustrating.Overall, Nostalghia turned out to be an excruciatingly slow & downright tedious experience for me, and sitting through it was no less than a chore. The film isn't going to appease every palate nor is it meant to do that, but for those who find themselves intrigued by its premise and are invested in the proceedings and can patiently connect with it, Tarkovsky's penultimate feature might just deliver the desired goods.",
            "review_date": "2020-09-28"
        },
        {
            "review_title": "difficult to leave Tarkovsky with less than a feeling of awe",
            "content": "difficult to approach, or leave Tarkovsky with less than a feeling of awe. the work is of a kind impossible to achieve except by film - and yet that is not true, as a reader can put down a book, and muse, and be moved, and become more wise; which is what the viewer must do when presented with near stillness of image, and the suggestion of history, and brooding emotion, and depth.don't even think of seeing it if you ever wonder if you have the time.",
            "review_date": "1999-01-11"
        },
        {
            "review_title": "Can you get more cult than this?",
            "content": "No, you can't. Tarkovsky is the ultimate art filmmaker and he demonstrates it again in this great picture, I would say, his best picture that he made outside of Russia. The other one (The Sacrifice) is also great, but I would prefer this over The Sacrifice, which is a picture that sacrifices a bit too much of Tarkovsky trademarks such as being a picture driven by images, instead dialogue takes center stage. Here, by contrast, we have a picture that is driven mostly by images, hence, being a highly original and powerful exercise of film-making.The film also has a deeper plot than The Mirror, though it is still not a plot driven film like Solaris. It shows the influence of The Mirror on Tarkovsky films: before he made The Mirror, his films were still slightly more conventional but after they became much more avant garde and audacious.This film is essential for film buffs and I might say it is perhaps one of the top 100 greatest films ever made.",
            "review_date": "2012-12-02"
        },
        {
            "review_title": "Mythical, deep, and philosophical ...",
            "content": "This is one of the most beautiful movies I have ever seen. The main plot is about a Russian poet who comes to Italy to do some research on a composer. For those who love Action Thrillers: I have to say that this movie is probably not for you. This requires patience and a good deal of thinking. This isn't something you can watch with half your mind on what you're going to buy at the grocery store. What I love the most about this movie, is that you can see the characters thinking. What I find lacking in most movies, is the constant action, constant talking. In Nostalghia, you find yourself immersed in the character's thoughts. Tarkovsky uses a great deal of visual metaphores as well; you have to pay close attention to what you're watching. It could turn out to be something completely different from what you thought it was to be.All in all; this isn't something to be watched \"lightheartedly\". I recommend it to everyone. It truly is a work of art.",
            "review_date": "2007-03-11"
        },
        {
            "review_title": "Boring!!!",
            "content": "I have just watched this film and found it completely boring. The only reason I watched it in the first place was the fairly high rating and good reviews. After reading a little about the director and his previous films, I can understand the attraction that other viewers may of felt and the respect for the director (based on his previous films) that gave rise to the high rating and good reviews, but this is my first (and possibly last!) Tarkovsky film and as such I can only rate it on the past two hours - It was very, very boring! In my opinion the director had no regard whatsoever for the idea of an audience, the people who want to be entertained, and had made this film with only himself in mind. It should of stayed that way - a home movie for Tarkovskys use only!",
            "review_date": "2004-11-30"
        },
        {
            "review_title": "Nice contrast and light in photography",
            "content": "It is a continuous photography, beautiful lights and shadows, slow shooting shifts that are fine. Long times that enhance the change of light. Nice contrast between color shots and black and white shots. The protagonist recalls the character of Tarkovskij.",
            "review_date": "2020-01-18"
        },
        {
            "review_title": "Uneasy, hermetic",
            "content": "Very impenetrable sluggish Italian-Soviet (unintentionally?) autobiographical impressionist poetic film by Tarkovsky, often moving between main character's dreams, linear reality and the written testimonies by a Russian musician from middle ages. There are beautiful scenes and some nice dialogs, but it is not captivating, at least it was not for me. Indeed, the film is uncharismatic, cold and aparhetic just as the character it is about (for her Italian lover and translator's despair), what probably makes sense. Lots of water and ancient narrow stone streets, in black and white or colour, and enigmatic lines, spoken in Italian or Russian.",
            "review_date": "2021-10-17"
        },
        {
            "review_title": "similar to \"Sacrifice\"",
            "content": "Nostalghia was the first non sci-fi movie I saw from Tarkovskij (I though understanding the audio would make it better), and maybe that was a wrong decision. It would have been better to start with the earlier movies. Now that I saw his last work though, Sacrifice, and understood it as well, I could understand this movie better. Nostalghia has a similar anti-modernism like sacrifice, various themes, and despite it's just two hours long, it's one of the slowest Tarkovskij films. This and Sacrifice represent well the director's last years of filmmaking. Although Nostalghia wasn't my favourite Tarkovskij, I still consider a masterpiece, just as Sacrifice.",
            "review_date": "2016-01-07"
        },
        {
            "review_title": "Grass grows faster",
            "content": "It is a brilliant and poetic movie. At the same time, it is slow slow and self-indulgent that I kept wanting to prescribe Prozac for the director. Walking slowly back and forth in a beautiful emptied pool took the cake.",
            "review_date": "1999-12-25"
        },
        {
            "review_title": "Beautiful and interpretable for multiple meanings.",
            "content": "I must say that it has amazing, one of the best cinematographies I have ever seen. The storyline is very slow and subtle. Majority of film is left very ambiguous to viewer's interpretations. This film is very challenging to watch, it requires paying maximum attention to get all the details. I'll admit that at first viewing I did not like it, it was boring, but in my 2nd viewing I was blown away by the attention to detail and the interesting philosophy this film has to offer.",
            "review_date": "2020-05-12"
        },
        {
            "review_title": "Excellent cinematography yet exhausting narration",
            "content": "One of the most difficult movies of all time. Although there is a poetic expression and a philosophical dimension in the story, it was extremely hard to grasp what it tells exactly. I give it 7 because it was very impressive in terms of cinematography.",
            "review_date": "2021-02-10"
        },
        {
            "review_title": "An artistic statement of high caliber, but not for an unsophisticated audience",
            "content": "Tarkovsky: you either love him or hate him. It's imperative to understand that Tarkovsky is more about mood and imagery than strong driving narrative, although it's untrue that this film lacks narrative (unlike Mirror which is simply a collection of scenes). The story is there in Nostalgia: the characters are all real and fight for their needs and wants - there is conflict. But Tarkovsky is more interested in the feeling of the story rather than clearly communicating plot information and keeping you locked into classical narrative structure.VERY few filmmakers can do this well, and countless filmmakers try to imitate Tarkovsky and miserably fail, partly because they don't understand that there is a real story happening here - it's just presented in a way that is highly allegorical. This is definitely not 'lazy' filmmaking, or style covering for a lack of technique (Tarkovsky was a highly literate man who could run circles around most Hollywood scriptwriters, and he had the services of Antonioni's screenwriter for Nostalgia). He is simply one of the very few filmmakers who can make a good film without adhering to classical narrative film structure.As is traditional for Tarkovsky, the actors are all top notch, the cinematography is divine, the sound design is intentional and the music is very judiciously chosen. Nothing is left to chance. And yes, of course there is plenty of water, as with his other films! Would I have enjoyed a more traditional narrative format for a film like this? Yes, which is why I gave this film only seven stars. Tarkovsky could have done a bit more to keep us involved in the story without compromising the mood he was building. But I still gladly accept this film for what it is - it has some absolutely magical, brilliant moments that forever stay in your mind.If you're new to Tarkovsky, it's probably a better idea to start with some of his more accessible films, such as Ivan's Childhood and Solaris.",
            "review_date": "2017-05-22"
        },
        {
            "review_title": "Visually astonishing",
            "content": "\"Nostalghia\" could be considered as Tarkovsky's \"8 1/2\", just much more cryptic and with a far bleaker outcome. The director uses the main character to show us his own thoughts, memories, and obsessions in a stream of consciousness kind of way. The film is painfully slow and self-indulgently rehashes motifs already glimpsed in Tarkovsky's previous works, yet it is packed with memorable images and breathtakingly beautiful locations. Interesting how spaces are used to express the character's alienation and loneliness - we will rarely see two people in the same shot, and even in those rare times, they will always keep an unnatural distance. While I enjoyed the visuals, the script felt like the weak link in the chain, with bloated monologues and pseudo-intellectual conversations, even though t's also true that the wooden Italian dub didn't really help in that sense.",
            "review_date": "2021-08-14"
        },
        {
            "review_title": "Uncovering the reality within the dreamlike state",
            "content": "This is Andrei Tarkovsky's struggle to uncover and translate the sense of life of a particular time-space; and his optimal artistry transfers that sense, on a very spacious spectrum, with a very little loss of meaning.",
            "review_date": "2020-02-07"
        },
        {
            "review_title": "A sad indulgence",
            "content": "A Russian poet Gorchakov travels with an interpreter to Italy, to research the life of musician Pavel Sosnovsky. We spend most of our time in a small town by a spa believed to have healing powers, where they take interest in a lunatic who once kept his family locked inside for seven years. The only reason I made it to the end is because Tarkovsky has previously impressed me with Ivan's Childhood and Andrei Rublev, but where those two anchored his poetic images to interesting characters and story progression, this one leaves it all at sea, with mundane characters and empty interaction. Further, while shooting in colour was effective for differentiating between past and present, it did him no service artistically - the ugly off greens are not befitting of such a visual master.If the film is about anything, its loss and alienation. There are frequent flashbacks to his family left behind in Russia, he shows no interest in the attractive interpreter who openly courts him, and feels no comfort in Italy or God, whose presence he doesn't feel, though we are told is there (in voice over, by God himself, no less). The final shot places Gorchakov motionless in the snow, in front of his Russian home, planted inside a massive abandoned abbey. It is a stunning visual, his heart (Russia) joined together with his body (Italy), possible only in film. Unfortunately however we are given no reason to care for these bleak visual metaphors, and making it to that final shot with your eyes open is a real chore.The slow zoom is reminisce of Kubrick's Barry Lyndon, released some 8 years earlier, while the cutting back and forth from present to past is reminisce of Fellini's 8 1/2, both of which are much superior.",
            "review_date": "2019-09-07"
        },
        {
            "review_title": "Just look at nature and you i'll see that life is simple",
            "content": "As days are passing from watching Nostalghia for the first time, the movie is growing more and more on me, i can't stop thinking about it, and how Nostalghia is deep atmospheric beautiful experience that will change your perception of reality and your innerself. At first i was not so much amazed by the movie, and i was thinking that this will be the least favorite from Tarkovsky i have watched (i only didn't watched Andrei Rublev), but then the pictures and atmosphere from the movie were coming in my mind in waves and how i was wrong, for every Tarkovsky movie you need strong patience, every scene is full of symbols and different interpretations. You can see Nostalghia as a movie about loneliness and melancholy, as Tarkovsky autobiography and personal experience, as movie about dreams, as movie against postmodern world, as movie about death and loss. At the end you will conclude that Nostalghia is movie about everything i mentioned, it is at the moments so dark and melancholic but at the end of the tunnel there is a light and hope for your personal home and for the whole humanity. I must mentioned phenomenal Domenico speech near the end of the movie, it is one of the best monologues in the history of cinema and of the best speeches ever, it is deep, moving, touching and it is totally right, fantastic acting by Ingmar Bergman's veteran Erland Josephson. This movie is a must for all who are seeking answers and real art, and not just see cinema as a popcorn fun. Tarkovsky was definetely in a league of his own, one of the biggest aritst of 20th century for sure, his movies really changed me and opened many things in my own mind.",
            "review_date": "2018-12-10"
        },
        {
            "review_title": "Nostalghia is Tarkovsky's devotion to faith and spirituality made art.",
            "content": "Art might very well be untranslatable, but that doesn't mean it couldn't be experienced across boundaries of language and understanding. This movie is much like a painting; where each brush stroke is so meticulously detailed, we have to take our time to soak it in before Tarkovsky can move on to the next stroke. And by the end of it, while we are left with a painting that is so endearing, it's more about the journey from stroke one to stroke last, that we had to sit through, feel and connect with that solidifies this masterpiece.",
            "review_date": "2021-02-02"
        },
        {
            "review_title": "Nostalgia",
            "content": "A searing, heartbreaking love letter to Russia. This film should be seen; a film that reaches deep into your soul. It's pure, as Tarkovsky was. The images alone, with no words, can profusely affect me, and can leave you close to tears of beauty. Isn't this Tarkovsky at his most ethereal, and transcendent? The shots move ever so slowly, like waves, pulling in from the tide, slowly lapping on the shore...this is what it reminds me of. It feels very holy, and delicate; like a forbidden fruit; something that we should not be able to see, but, alas, we have had a chance to gaze upon it. It feels as if every slow step, and movement, is a painful and melancholy step into deep, lost memories. The language here, in this, is a rare moment in life, to witness such profundity; here, maybe one of Tarkovsky's Magnum Opus, we see him elevate to the highest transcending level, of language and alike; of one who understands the world deeply, and passionately. Surely, the opening scene is one of the most beautiful humanity has witnessed. Domiziana Giordano here externalizes beauty, almost like a goddess; ethereal. On the screen, we are witnessing paintings.. There's really no other film like Nostalgia. There are so many scenes here that are extraordinary. Words can't begin to describe the fire scene, juxtaposed with Beethoven; words can't capture the essence of this scene in the way Tarkovsky's images can. The candle scene may sear itself into your subconscious; slowly, but it will be there. Tarkovsky has the gift of bringing the beauty, from ordinary things; to make them beautiful, if not more than normally considered beautiful things; it shows he sees the world in a different way, a special way; someone who is truly alive. It truly is in another dimension. The romance, and relationship in the film is pure, powerful, and melancholic; it is awe-inspiring to watch these conversations; they are truthful, and can leave you gasping, as you have never seen emotions, quite portrayed in such a way. The film also brings into question human advancement; how we have come so far from our simple years, when we were merely in nature itself; humanity has changed, and with this, comes the many problems we have now; anxiety and worry plague many; alienation creeps on our minds; because life is so quick now, and everyone must become something important; the pressure is great; a far cry from our simpler days.",
            "review_date": "2017-04-08"
        },
        {
            "review_title": "Annotating, Amplifying, Extending",
            "content": "Tarkovsky's my first real love. This man's films felt as if they were drawn directly from my own soul, image form given to my own dreams. His camera-eye is marvelously free, even here where mostly it moves so geometrically to put Greena-way to shame, or then just observing, silently and without moving. This isn't like \"Andrei Rublev\" (1966), which deep down I still cherish more than anything, and where the eye moves much like Malick likes to move it nowadays: here there's apparent discipline, kind of theoretical rumination in all the eye does and perceives, but it's of such beauty I dare one to ignore it. One may see this in how he sees small, every day things either up close or far away — light paints and shadows frame the action, which usually consists of us gazing upon a scene far in the distance. Surely the poet mirrors Tarkovsky and what he does. It's Andrei (Gorchakov, the poet in the film) who carries the candle the distance but it's Andrei (Tarkovsky, the director) who carries it for us to see.The famous forced perspective shot in the end is worth its reputation, but for me the interiors are the most breathtaking shots. This is great to see before \"Offret\" (1986) but especially after \"Zerkalo\" (1975). The former has, over the years, been unable to elicit the kind of reaction Tarkovsky usually does (it's his most difficult film for me for that reason, by no means reduced in mastery) so this kindles its flame. The latter, however, is as perfect as it gets, and stretches out to this as well, annotating, amplifying, extending.",
            "review_date": "2013-11-26"
        },
        {
            "review_title": "man is not alone",
            "content": "Tarkovski's Nostalghia is the most stunning film, visually, emotionally, and intellectually that I have seen in recent years.  If you care about films as art, then it is a must see. Exploring faith, alienation, and exile, the film is a meditation on the state of modern man. Nostalghia transcends the barriers of cinema and projects itself into our own consciousness and world, in a way that film should, in order for viewers to weigh their actions and relate with the human community.",
            "review_date": "2000-05-21"
        },
        {
            "review_title": "If this doesn't change you, nothing will.",
            "content": "Definitely one of my all time favourites!The rating \"masterpiece\" doesn't do this movie justice. It's not a movie; it's an experience.Slowly Tarkovsky draws you into the magical world he created, plays with your emotions like Beethoven played the piano and whispers ideas into your mind which will start a cascading stream of your own thoughts and memories.I won't go into describing individual details of this movie, as that would be like trying to explain the brilliancy of nature by showing you the beauty and perfection of a single butterfly wing.If you haven't seen it yet you should, and let yourself be engulfed by the product of a brilliant mind.",
            "review_date": "2000-06-14"
        },
        {
            "review_title": "In search of faith",
            "content": "Together with the last The Sacrifice, this Nostalgia marks the final phase of Tarkovsky's work, filmed abroad, Nostalgia in Italy and The Sacrifice in Sweden, and also featuring non-Soviet actors, especially the Swedish Erland Josephson who assumes key mystical roles in both works. In Nostalgia the main role is still assumed however by a Russian actor, Oleg Yankovskiy.Tarkovsky had recently lost his wife Larissa as well as his friend and actor in several films Anatoly Solonitsyn to lung cancer, so it's no wonder that the work is impregnated with a deep search for faith and spirituality, which have always been present in the soviet director's work but acquired a special emphasis in these two final works, which can almost be revealed as mystical.With a screenplay written in collaboration with Tonino Guerra, who has written for directors as important as Fellini, Antonioni or Angelopoulos, and cinematography by the Greek Giorgos Arvanitis, a regular collaborator of Theo Angelopoulos, this film could not fail to be extraordinary.Faced with death Tarkovsky seeks hope from faith, contrary to his most basic rational instincts. The result is a beautiful film, deep, philosophical and a permanent challenge for the viewer.",
            "review_date": "2022-11-13"
        },
        {
            "review_title": "Poetic cinema",
            "content": "Tarkovsky breaks new ground in the cinema, using cinematography, sound, and temporal space to transport the viewer to his dream-like state. The result is meted out in stunning cinematography and an aural soundscape that reflects the inner turmoil of the protagonist - Tarkovsky's own persona, more or less, according to his diaries - struggling to integrate a past long gone with a present unfulfilled.A masterpiece (if you can get through it without falling into your own dream state!)",
            "review_date": "2001-11-26"
        },
        {
            "review_title": "Tarkovsky is a painter-poet's filmmaker",
            "content": "Tarkovsky is the greatest director who has ever lived, except for (the British) Hitchcock. The spiritual and religious questions are given to the audience like a one-on-one commentary while experiencing the journey of his quasi-plot.Russian cinema was so brilliant, all the way back to the theorist times of Eisenstein and his colleagues, that now I wonder why, with all that Putinesque oil money, they can't revive their cinema. Cinema was their art form. They were surely not that great at producing the visual arts, better yet at the theorizing. Despite their awful communism, the Russians were so much more advanced in cinema than Americans (who were so dependent on the theatrical story). The stumbling block was the aftermath of WWII. Should that be allowed to essentially destroy all solid cultural expression? Russians should be the leaders. (The Russians trained the Chinese and look how well they did. Why can't Russia do this for their own people?)Americans see Russians as a bunch of murderous thugs. That's what happens when you kill off journalist critics. Take a lesson from America and discredit them like they did to Dan Rather and others. Don't murder the opposition. But, of course, Tarkovsky had to even defect. As far as I know, no one defects now. Is that because there's no one left? Tarkovsky gave Russia and the world something to marvel at. Tarkovsky and the great Russian writers and composers are Russia, not just the economic warriors of late. Nostalghia is not my favorite Tarkovsky film. Still, it may contain the most relevant angst- filled situations common to modern day living. The famous candle scene is unforgettable. For the visually-minded, Tarkovsky films are not slow, just like abstract expressionism is not hard to understand. There's so much to see in his films. Whereas Hitchcock is a filmmaker's filmmaker, Tarkovsky is a painter-poet's filmmaker.",
            "review_date": "2007-10-15"
        },
        {
            "review_title": "\"Poetry is untranslatable, like the whole of art.\"",
            "content": "While seemingly pretentious and over-indulgent, it is easy to see how one may find boredom while trying to engage with Tarkovsky's work. In fact, Tarkovsky poses such questions himself regarding the meaning of art as a whole and what it also means on a personal level. Are artists mind-openers and world-alterers? Or are they really sappy, pretentious and over-indulgent fools?Nostalghia has all the Tarkovsky traits: long quiet takes that may go on for minutes, shots of water, the sounds of water dripping, and sometimes painfully slow-zooms and dollies. But this is Tarkovsky showing us yet another visual poem, and when we read a poem we generally don't understand the first time around or the second. It may take the third or fourth time around for everything to click and while we don't normally think in such a literary way when it comes to film as entertainment, we are aware it is a possibility and it isn't for everyone.The beauty of what the camera captures is magnificent, and almost seems fool-proof when Tarkovsky is behind the camera. He could film a dirty puddle filled with literal crap and human fluids and we'd still be inspired and amazed.Feelings unspoken are unforgettable.Nostalghia is so far Tarkovsky's greatest effort concerning faith and broader spirituality as we find the main character so reflective in his past as he is in another country looking for a composer. His remorse and longing for what was is harrowing and comes full circle by the end. While during the entire film he has been an observer (as we are given his perspective from the camera many times throughout) and in a sequence of something on its face does not seem special, he realizes he must take action to rekindle the faith he lost.The closing minutes are as picturesque as anything I have ever seen put to film.",
            "review_date": "2020-07-10"
        },
        {
            "review_title": "A feast for the mind and senses",
            "content": "\"Nostalghia\" has been famously (and justly) hailed as visual poetry. Allow me to introduce, humbly, another metaphor: the film unravels like a piece of fine classical music. The plot is, on the surface, as light and breezy as the feathers one sees falling upon lighted candles at the very beginning; yet slowly, gently, the film builds to a moving crescendo, possessing as its notes some of the most poignant, astonishingly and painfully beautiful images ever to be captured on film, that will have you experience an entire spectrum of emotions of which you never suspected yourself capable, in the course of one cinematic sitting - if ever at all.\"Nostalghia\" is pure magic, a work of true genius. Dream, memory, reality, interweave in a haunting, and unanswered, plea for a re-evaluation of humanity, or what it means to be \"human\".",
            "review_date": "2006-06-11"
        },
        {
            "review_title": "Forgive me",
            "content": "I tried but found it unwatchable. Persevered first about an hour, dozed most of it, then had to resort to the fast forward button.",
            "review_date": "2019-11-29"
        },
        {
            "review_title": "I now understand the purpose of film",
            "content": "Having seen thousands of films over more than 40 years, until I watched this film I didn't really understand. 15 minutes in I knew what I'd been searching for. Perhaps the most insightful, beautiful, meaningful film of all time. This film communicates more with any 3-5 minutes of near silence/virtual inaction than any dialog or action scene I've ever experienced. None of those scenes are boring or slow, just still and quiet. And very alive. It also includes the most amazing/revealing set in my history of film, and the most psyche bending use of sound queues in the entire \"art\" of cinema. In summary, less is more and more and more. Want to experience cinema as art? Go no further.",
            "review_date": "2006-11-14"
        },
        {
            "review_title": "1 of the 7 best movies of all times",
            "content": "One has to be very careful when reviewing this film. I think it would be arrogant on my behalf to say I have understood in all possible aspects and conceived all the meanings Tarkovsky was trying to deliver. And I really doubt anyone can, unless he's a genius as big as Tarkovsky. This movie talks about love, hate, art, faith, about everything, about life. It softens your heart and sharpens your brain leaving you with a deep sensation of having spent your time well and thinking about it is time well-spent as well. As for the artistic part, the way he chooses to depict his opinion, to pose his questions, to demonstrate his doubt and his emotions of hope or loss(especially his nostalgic feelings of his motherland Russia combined with his love for Italy his exile land) is far more than moving: it's flawless.",
            "review_date": "2009-04-27"
        },
        {
            "review_title": "Hollywood Skeleton with Unforgettable Sensations",
            "content": "HEAVY SPOILERS AHEADThe night I received my copy, I had some heavy homework to be finished, so I thought: \"Hmm, I will just take a slight glimspe at it... a glimpse.\" Time must have slipped away from me like milk in water. When I came to myself, I was looking at the menu with my mind full of Beethoven, candles, and images of water. Later I realized that I had been taken to another plane of existence, experiencing an epic journey through meditation, spirituality, and total beauty.I bought a box of emergency candles and a lighter the next day.This is exactly what would happen if you can fully appreciate Tarkovsky's masterful films. \"Nostalghia,\" however, has some elements from Hollywood movies. The most significant part, as anyone can notice, is near the end when the pool-cleaner runs across the dried pool, revealing a whole crowd of spectators. In addition, the whole plot resembles many other conventional films as well: The melancholy protagonist meets a crazy old fool and accepts him. The lunatic offers some kind of weird, spiritual redemption but the protagonist doesn't realize the significance. Naturally, some natural forces guide the tortured protagonist back to his ignored mission, ususally at the end. Such plot devices seem ubiquitous but with Tarkovsky's aestheticism, the emotional impacts are utterly unsurpassable by literally any existing filmmakers, not to mention the fascinating images like the flooded cathedral and the final showdown. Unlike other conventional films, such touching moments do not seem contrived or pretentious, and their purpose is not begging for audience's tears. The formularized plot is totally unrecognizable due to the unique sensations unforgettable scenes, and perfect acting.I try to do the same thing as Andrei, but I can't even light the candle.Please viddy this film, and you can feel the true charms of pure cinema. Your life may be different afterwards.Thank you!",
            "review_date": "2001-11-03"
        },
        {
            "review_title": "Would almost be enough to say it's a Tarkovsky movie.",
            "content": "This is not the deepest of the director's movies. Many of his pictures are much more dense when it comes to existential issues. It is easier than several others and less layered. But visually, it might just be his best. The photography is simply masterful. Every shot is a masterpiece. Every shot looks like it was composed by a master painter. Every image is constructed like the greatest art pictures ever. Watching this movie is like moving from one room to the next at Louvres museum. The rythm is slow but perfectly controlled. The acting is fantastic, sombre but measured and deep. Like \"Solaris\", \"Stalker\", \"Offret\" and \"The Mirror\", \"Nostalghia\" is simply one of the greatest movies ever made.",
            "review_date": "2018-12-22"
        },
        {
            "review_title": "great movie",
            "content": "Definitely worth seeing. However, you might feel a little depressed after watching it. The water is omnipresent in this movie. There are almost always water drops falling and making the characteristic sound. The final scene with the candle and the water basin is one of the best I've ever seen.",
            "review_date": "1999-09-25"
        },
        {
            "review_title": "Is it our nostalgia for oblivion this film awakes in us?",
            "content": "So personal and private as to be truly impenetrable in it's Truth. Watching it is like watching one of the clearly essential, important, deeply meaningful and spiritually satisfying ritual observances of some utterly strange and alien tribe. Curiosity curdles into ennui as Tarkovsky goes on his way - a Holy hermit and devotee of a clearly demanding and all-consuming faith. We may think him misguided, even mad. But those of us who cannot follow his obscure observance - such as I admit myself to be - can only respect what we cannot grasp ourselves.I have no way of entering into any communion with such an hermetic work, and so I will not attempt to judge it - and I cannot contemplate the awarding of marks out of ten: For what? For a truth that is so evidently entirely sufficient to itself?My view would not be important, even if I did have the understanding to take the measure of this utterly enigmatic work. It leaves me unenlightened; it's strange majesty leaves me feeling abandoned and bereft, and uncomfortably inadequate. The experience felt like pretentious trickery, and yet I'm left with a sad sense of revelation withheld, and a lurking dissatisfaction and resentment.But how can you quarrel with this Holy foolishness? It seems to offer so much, and now, lacking this indefinable something I feel that something that was mine is lost. The ghost of simple wonder, perhaps? And this uneasy ghost is reminiscent of all our most sacred absences and bereavements, that are quite beyond our desire or Love.Things pass before us like phantoms, and like dreams cannot be interrogated. The only answer is the silence of the Mystery. The annhilation of the personal which Tarkovsky produces in the watching sensibility is deeply horrible and disturbingly irresistible. Such a sense of the numinous is the ultimate vertigo, the enticing fear of the Abyss that draws us to it with great and repellent love, this yearning to be empty - to pass out into a life unknown and also just like the forgotten life that was before us.Such is the irrecoverable condition of our uncertain and precarious existence; such is the hopeless Hope of Nostalgia for all this life of loss to be over, and for the grieving Peace that passeth all understanding again to embrace us and keep us forever.The film is a torment of negative capability, of the unresolvable mystery of things. What can it be conveying but our nostalgia for oblivion?",
            "review_date": "2020-04-15"
        },
        {
            "review_title": "Get Enlightened - An Overwhelming Spiritual Experience.",
            "content": "Nostalgia:pure, sublime, seamlessly interwoven, poetry, invigorating, challenging, beautiful, the fire and candle scene is one of the most awe-inspiring      scenes I have ever seen on film...punctuated by the burst of Beethoven during Domenico's self-immolation...WOW",
            "review_date": "1999-01-25"
        },
        {
            "review_title": "Godly",
            "content": "Divine just might be the word for the film. It is an exploration into the varied personal beliefs of human. The film is so Godly that it takes you into another realm which you'll probably be confused with 'Heaven'.\nI've never quite experienced a film so tranquil other than of Tarkovsky's others. From questioning one's own beliefs to taking a walk in the shattered lanes of memory, this masterpiece has it all.\nThe direction is very much responsible for making a film powerful, from the screenplay to the dialogue delivery; this film is just the example of it. This piece of art gives you solidarity.\nI think Andrei Tarkovsky really loves the element of water & the same is just used very artistically in all his films, this being no exception! The closing scene is very beautiful which is a great thing for concluding a subject.\nAndrei Tarkovsky is indeed the GOAT!",
            "review_date": "2020-09-03"
        },
        {
            "review_title": "You won't know, what is cinematography at its best without seeing this film.",
            "content": "When You get into \"hardcore\", the serious cinematography and while on Your path You stumble across Tarkovsky, then this is the film, so to say, for beginners. Tarkovsky in his films is heavy on symbols. They are as important as characters played by actors. This film, as for me, is the easiest to understand by, let's say, Non-Soviet viewer, as the symbols here are clear and easy. The film is a recollection. Tarkovsky misses his motherland (he made the film while in immigration), his family. It is an explanation of his choice to immigrate. And all this through the symbols. One of most powerful symbols that I have encountered in Nostalghia is when the main character, a writer (Oleg Yankovsky), walks through the empty pool of high-sulphur (or something like it) water, with lit candle in his hands. I would hardly ever come up with such perfect idea to symbolize hardships of creative process while he lived in USSR. Yes, Tarkovsky always denied presence of symbols in his films (or so I have heard, don't take my word on it), but this film seems to be packed by them. Good luck in discovering the Masterpiece.",
            "review_date": "2004-05-18"
        }
    ]
}