{
  "title": "Rope",
  "rating": 8.4,
  "release_date": "1948-09-25",
  "genre": [
    "Drama",
    "Mystery",
    "Thriller",
    "Crime"
  ],
  "summary": "Two young men strangle their \"inferior\" classmate, hide his body in their apartment, and invite his friends and family to a dinner party as a means to challenge the \"perfection\" of their crime.",
  "critic_reviews": [
    "Rope is not merely a stunt that is justified by the extraordinary career that contains it, but one of the movies that makes that career extraordinary.",
    "One of the cinema's supreme, most outrageously eccentric and audacious technical experiments: the legendary single shot movie.",
    "A crime for most, a privilege for some is how Rupert classifies murder, but Hitchcock's eye-am-a-camera technique in Rope is after more than Nazi-superman residue still lurking after WWII.",
    "A strange foreboding of what was to come from the Hitch.",
    "Perverse, provocative entertainment.",
    "Hitchcock liked to pretend that the film was an empty technical exercise, but it introduces the principal themes and motifs of the major period that would begin with Rear Window.",
    "Hitchcock could have chosen a more entertaining subject with which to use the arresting camera and staging technique displayed in Rope. Theme is of a thrill murder, done for no reason but to satisfy a sadistical urge and intellectual vanity.",
    "Stewart seems uncomfortable playing an intellectual; his dull performance never displays the disturbance or authority that it needs.",
    "Alfred Hitchcock called Rope an “experiment that didn’t work out,” and he was happy to see it kept out of release for most of three decades. He was correct that it didn’t work out, but Rope remains one of the most interesting experiments ever attempted by a major director working with big box-office names.",
    "At all events, the picture takes on a dull tone as it goes and finally ends in a fizzle which is forecast almost from the start."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Thought the movie dragged a little bit early on but as time progressed, I couldn't help but get sucked into it as Stewart's character recognizes something is wrong but can't exactly put his finger on what. Speaking of Stewart, He is brilliantThought the movie dragged a little bit early on but as time progressed, I couldn't help but get sucked into it as Stewart's character recognizes something is wrong but can't exactly put his finger on what. Speaking of Stewart, He is brilliant as always and his performance really elevates the movie as a whole.",
      "review_date": "2021-02-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another great movie by Hitchcock. The story is very interesting, also the dialogues and the situations the movie created. Interesting also how much this movie keeps you watching, although it takes place only in an apartment.",
      "review_date": "2021-11-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Rope is a bittersweet experience, confined in its own loop, the tale never evolves nor has the maturity to question the existence and reason out of it.Rope\n\nHitchcock's breathtaking party unfortunately isn't able to keep up with theRope is a bittersweet experience, confined in its own loop, the tale never evolves nor has the maturity to question the existence and reason out of it.RopeHitchcock's breathtaking party unfortunately isn't able to keep up with the euphoric energy it starts with. And the energy wears off due to its inessential and frankly dull detour that it takes in order to fill the content up till the real times goes off that ticks on the back off the screen. And even though the ticking bomb goes off quite early to keep the audience tangled in its if-i-must \"rope\". But it still isn't out of its self-created damp surface. The concept itself is a double edge sword. Since both the crime and the investigation of it taken place on screen with live time screenplay the audience finds itself waiting for the writers to achieve their closure that starts to feel like a homework after a while.The adapted screenplay is from a play which explains the continuity and the flow of the film that is played smartly by the camera work and cinematography in here. The side characters are unfortunately undercooked and are explored only on surface only where the actors are handed over a post it note showing their characteristics which they have managed to hold on to throughout the course. The backstory of the professor and his students who throws the party does help a lot on connecting the dots.Stewart as the analyser and resolver of the drama is the best support that the two lead actors can aspire for. Grander gets a more unimpressive role to portray hence fails to overpower Dall on his scenes. Whilst Dall is the creator of all, the real convincer, the schemer that tries to bind it all no matter how much it scatters. Rope is a bittersweet experience, confined in its own loop, the tale never evolves nor has the maturity to question the existence and reason out of it.",
      "review_date": "2018-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Rope is astonishing. Not Hitchcock’s best but he delivers where he needs to in this. His ability to suck you into a story on the strength of his characters, instead of only the act they commit is unparalleled. 89/100",
      "review_date": "2018-11-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie made so much for the film history with such amazing performances and exciting moments.",
      "review_date": "2020-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There's a reason why Alfred Hitchcock is known as the master of suspense. Rope is a masterclass in tension, which is heightened by it's use of almost only long shots.I love how Jimmy Stewart's character is forced to actually think about howThere's a reason why Alfred Hitchcock is known as the master of suspense. Rope is a masterclass in tension, which is heightened by it's use of almost only long shots.I love how Jimmy Stewart's character is forced to actually think about how dangerous his philosophies really are once one of his students actually puts them into action. It's a great moment.Also, the gay subtext between the two killers is impossible to ignore. They might as well just say it in the film, but it was the 1940's so, no chance.",
      "review_date": "2020-09-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I have been watching Alfred Hitchcock's movie nowadays. His movies are so different and fun to watch. He made movies which were ahead of it's time including this one.This movie had everything a crime drama should have. It was nicely made.I have been watching Alfred Hitchcock's movie nowadays. His movies are so different and fun to watch. He made movies which were ahead of it's time including this one.This movie had everything a crime drama should have. It was nicely made. The direction and the performances by the actors were good. There is thrill and but no suspense till the end. The ending is little bit predictable but then also story is engaging.There were some things that I didn't like about the movie. First, movie started in uneven manner. It takes time to figure out what is happening. Second, the conclusion part was little bit underwhelming. Other than that it's a good watch.Overall, it is a good crime drama which will keep you bounded till the end.",
      "review_date": "2021-11-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The intensity in Rope just make this 1 hours and 20 minutes Hitchcock's movie feel so long but in the good way, the way Hitchcock's solve the case is always amazed me, again added with Jimmy Stewart powerful and great perfomance, Rope wasThe intensity in Rope just make this 1 hours and 20 minutes Hitchcock's movie feel so long but in the good way, the way Hitchcock's solve the case is always amazed me, again added with Jimmy Stewart powerful and great perfomance, Rope was intense, different, and original, Rope it's a pretty good choice to start and introduce your friend, your family, and everybody that you know to The Master Of Suspense himself, the great Alfred Hitchcock, i highly recommended.",
      "review_date": "2021-06-09",
      "source": "metacritic"
    }
  ],
  "num_reviews": 18
}