{
    "rating": 2.7,
    "release_date": "2008-10-01",
    "num_reviews": 490,
    "genres": [
        "English"
    ],
    "summary": "Townspeople fight back when a swarm of birds causes bloody mayhem.",
    "reviews": [
        {
            "content": "This is an amazing film! The opening shots of the California coast are awesome, and you can easily understand what the characters are saying most of the time. Plus, the bird attacks are super intense! I especially love how quickly characters die (especially Ramsey screw that guy). And let's not even begin to talk about the sex scenes. Absolute art I tell ya. The special effects might not be top-notch, but they still get the job done. I'd totally recommend it if you're into romantic-horror movies.",
            "review_date": "2023-04-26",
            "source": "rt"
        },
        {
            "content": "The birds were so realistic, made the whole movie a 10/10. The characters were really thought out and had wonderful development. The actors slayed their roles, they embodied their characters. The chemistry between the cast was amaizng, no awkward moments. They felt like a real found family. A must see!",
            "review_date": "2023-04-04",
            "source": "rt"
        },
        {
            "content": "A cultural reset. Don't expect a good movie, but expect a great time (watch with friends).",
            "review_date": "2023-04-04",
            "source": "rt"
        },
        {
            "content": "AMAZING MOVIE!!! Please watch as it changed my WHOLE outlook on life!! The ending made me cry real tears and I feel as if no movie will ever live up to it. Anyone who rates it under five stars is just a hater and has bad taste. I would give it 1 billion stars if I could!!",
            "review_date": "2023-03-14",
            "source": "rt"
        },
        {
            "content": "Absolutely amazing movie, great graphics and SFX! The acting was beautifully carried out. Will be watching this again.",
            "review_date": "2023-02-13",
            "source": "rt"
        },
        {
            "content": "This was the worst movie I have ever seen There is something wrong with the filming of this movie . Worst acting i have ever seen . The fakeness of this movie was surreal. It is almost like some little kid was trying to make a movie video for the the first time It was so bad.",
            "review_date": "2023-01-17",
            "source": "rt"
        },
        {
            "content": "0 Out of 5....Truly one of the worst things I've ever seen. Every single fundamental piece is broken beyond belief. And yet I would absolutely say everyone should see this once. Just because it gives you a greater appreciation for good films and shows you how to NOT act, do sound design, write a plot, direct...basically everything.",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "Absolutely fantastic movie. Immersive story building, great acting, and on top of all that stupendous CGI. Would not change a thing.",
            "review_date": "2023-01-14",
            "source": "rt"
        },
        {
            "content": "There seems to be a deliberate attempt at making this movie one of the worst motion pictures ever released. I was under the impression I was watching a spoof movie until I realized this movie is in a new category all in its own. That being said, this is a masterpiece.",
            "review_date": "2023-01-11",
            "source": "rt"
        },
        {
            "content": "this may be the movie of all time, I watched this : )",
            "review_date": "2022-12-22",
            "source": "rt"
        },
        {
            "content": "I want them to release a version without the poorly edited birds.",
            "review_date": "2022-12-14",
            "source": "rt"
        },
        {
            "content": "An absolute cinematic masterpiece.",
            "review_date": "2022-11-15",
            "source": "rt"
        },
        {
            "content": "This is the greatest movie I have ever seen. The birds looked really real, and I am sexually attracted to birds and this movie made me very hard. 10 out of 10, would reccomend if birds turn you on.",
            "review_date": "2022-10-23",
            "source": "rt"
        },
        {
            "content": "This movie is SO bad it's unwatchable.",
            "review_date": "2022-09-29",
            "source": "rt"
        },
        {
            "content": "Birdemic scared me so bad I am physically unable to move outside anymore. This has caused such a fear in me of birds that even the thought of them puts me in a paralysis state. The only way out of this endless tunnel of hell, if there ever is one, is to believe that birds are government spies. They have to be drones spying on me and all my movements because there is no way birds would attack like the way portrayed in this movie. THEY ARE SO RUDE AND SCARY AND I HATE THEM!!! Please tell me birds aren't real because I can't live through a BIRDEMIC!!!",
            "review_date": "2022-09-20",
            "source": "rt"
        },
        {
            "content": "Wow movie ever made. So as the birds are attacking there is heavy traffic and people swimming on the beach.\nIt might have been savable if the computerized birds more realistic..\nI really don't bought this was a comedy off of the birds. Alfred Hitchcock is rolling over in his grave knowing this is out there.",
            "review_date": "2022-08-31",
            "source": "rt"
        },
        {
            "content": "This film needs no explanation. It's reputation is deserved. The acting is laughably bad, the cinematography is equal to that of a 4-year-old, the plot at least has an environmentalist message, which is something I firmly believe in, hence why I'm being honest giving this a half star instead of zero like Jaws: The Revenge. You can watch countless YouTube videos that explain how terrible this film is, you wouldn't need me.",
            "review_date": "2022-05-29",
            "source": "rt"
        },
        {
            "content": "Birdemic is quite literally the most accidental hilarious movie I've seen. So awful that I cried laughing the entire movie. 10/10 movie",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "Truly a work of art, James Nguyen is a true artist with the filming, special effects, and picking the best actors for the job.",
            "review_date": "2022-05-02",
            "source": "rt"
        },
        {
            "content": "Simply amazing in every way.",
            "review_date": "2022-04-01",
            "source": "rt"
        },
        {
            "content": "James Nguyen makes Ed Wood look like Steven Spielberg. I spent the better part of an hour trying to convince my father that this wasn't a satire - he was never entirely convinced - but the result of quite breathtaking ineptitude and a lack of self-awareness that is perversely impressive. The only positive thing I can say about Birdemic is that it laid (sorry) the grounds for some truly memorable drinking games.",
            "review_date": "2022-03-21",
            "source": "rt"
        },
        {
            "content": "It's so dumb, it's hilarious.",
            "review_date": "2022-02-21",
            "source": "rt"
        },
        {
            "content": "This film made me absolutely speechless and I don't say this a lot but I highly recommend it. I'd put it on 2x speed it makes it increasingly better to watch. The acting was absolutely amazing, it's certainly on par with sharknado that's how good I think this film is. It's a film for all the family and on top of all this greatness, no stuntmen were needed. All the tricks were done by the actors themselves. The soundtrack was one of my favourite things about it along with the scene when they're attacking the birds with coathangers, they were so brave! It's a truly iconic film and James Nguyen has created a truly epic film that needs to be more widely recognised, what a legend!",
            "review_date": "2022-02-18",
            "source": "rt"
        },
        {
            "content": "This movie had me on the floor.\n\nSpectacular acting performance from our personal Ken doll, I only wish the actor toned down his emotions during the movie, I was about to get too intrigued.\nJennifer Cadro is the real MVP for the make-up in this movie. Good stuff.\nSome more character development would've been nice to see, I would like to get to the birds after the 1:00:00 mark. \n\n\"Drink when you see wonky VFX is a real killer\"",
            "review_date": "2022-01-27",
            "source": "rt"
        },
        {
            "content": "Use this in your film class as an example of how NOT to make a film. Alternatingly mind-numbingly boring and wooden character establishment and hilariously amateur and childish \"action\" sequences, everything, and I mean everything, is wrong with this movie. It has no redeeming qualities, except maybe that the eagle GIFs that they used to composite into the bird attack scenes were pretty high quality.",
            "review_date": "2022-01-17",
            "source": "rt"
        },
        {
            "content": "One of the most jaw dropping unintentionally hilarious bad movies ever made with horrific writing, awful acting, terrible sound and editing and it's one of the worst movies ever made for a reason",
            "review_date": "2021-12-11",
            "source": "rt"
        },
        {
            "content": "quite possibly the finest film ever committed to vhs tape",
            "review_date": "2021-10-17",
            "source": "rt"
        },
        {
            "content": "the birds in this movie are scarier 1000 times than ''The Exorcist''",
            "review_date": "2021-08-26",
            "source": "rt"
        },
        {
            "content": "this is simply art, perfetly shittty art",
            "review_date": "2021-08-20",
            "source": "rt"
        },
        {
            "content": "Until I saw this film, I thought Alien Siege was bad. This film redefines the meaning of bad. In fact this film is so bad that it is difficult to actually believe you are seeing what you are seeing.\nAnd for those who think there is art, or irony, or a challenge to accepted culture in this film, there isn't. It is just rubbish and all the deluded apologists in the world will not alter that one fact.",
            "review_date": "2021-06-30",
            "source": "rt"
        },
        {
            "content": "This film is captivating for its action-packed sequences and suspenseful plot, complemented by moving performances and stunning visual effects. Subtle environmental themes woven throughout the film make it thought-provoking as well.",
            "review_date": "2021-03-18",
            "source": "rt"
        },
        {
            "content": "I don't know if this is the worst movie ever, but it is the worst movie I have ever seen.  The weird dialogue, unamazing \"special effects\", and  \"action scenes\" are abysmal.  I don't know if the lead actor was under duress or just didn't give a...  Do not watch this alone, you have to laugh at that audacity of it with someone.",
            "review_date": "2021-02-13",
            "source": "rt"
        },
        {
            "content": "This film is captivating for its action-packed sequences and suspenseful plot, complemented by moving performances and stunning visual effects. Subtle environmental themes woven throughout the film make it thought-provoking as well.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "Honestly, the only good things about this movie are, the Jon Tron review on youtube (seriously the best thing about the movie, worth a watch!!) And the small documentsry about the creator.",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "I've seen a alot of good bad movies... And this is a high flyer! Special shout to Alan Bagh for giving a performance that only be rivaled by a tree.",
            "review_date": "2020-12-06",
            "source": "rt"
        },
        {
            "content": "HELLO! Birdemic is the BEST movie I have ever seen in my entire life! Definitely a great way to end 2020! Even though it was made in 2008, the CGI was phenomenal and WAY ahead of its time! The acting was fantastic and the video and sound quality were the best I have ever seen! It even provides facts about global warming! The birds looked so real and I was so scared! Directing by James Nguyen was amazing.. like seriously.. where's this mans Oscar like cmon!!?? And the actor who played Rod.. was just FANTASTIC! Why haven't more companies and directors reached out to him?? He was the best actor there! He knew all his lines and delivered them so well. I will definitely be watching this movie again. Maybe every Friday night;) *WARNING* DO NOT watch this movie alone OR at night!! You WILL get scared and you WILL get night mares! It is just so good that it feels real! It's so intense... it is rated R BUT it is a great movie for the whole family! You may have to skip over the steamy scenes if ya know what I mean..;) overall a great movie 10/10 and definitely recommend everyone watches it.. YOU WONT BE DISAPPOINTED",
            "review_date": "2020-12-06",
            "source": "rt"
        },
        {
            "content": "I cannot describe how horrible this movie is, so you'll just have to see. There is NO storyline, and the graphics are HORRIBLE. 🤣🤣",
            "review_date": "2020-12-05",
            "source": "rt"
        },
        {
            "content": "Birdemic Shock and Terror is a lazy excuse for a movie. With this movie having some terrible CGI which not only makes it look half done but makes it look like a 7 year old did it. The story itself makes no sense, and there are hardly any good characters. Back to the CGI, this movie came out in 2008. The Dark Knight came out that year and while it didn't use much CGI, when it did use CGI it look realistic. The story itself again is just terrible with it going all over the place. While watching it I could never understand what was happening. This movie could of been good if it didn't have to deal with birds killing people (That's right Birds), a better story, better characters, better CGI, and overall a better director. I would NOT recommend this film to anyone unless you hate someones gut",
            "review_date": "2020-12-01",
            "source": "rt"
        },
        {
            "content": "Shock and terror, yeah right. One of the worst CGI effects. It's a comedy without the birds appearing.",
            "review_date": "2020-11-24",
            "source": "rt"
        },
        {
            "content": "This movie has done so much raising awareness for climate change. Putting ice cubes in a glass? Move over Al Gore, there are sick birds that are trying to kill us! A wonderful story from start to finish that offers something for everyone",
            "review_date": "2020-11-07",
            "source": "rt"
        },
        {
            "content": "One of the best I've ever seen!",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "a silly and poorly edited film. Look at birdemic is one of the worst films in history",
            "review_date": "2020-10-12",
            "source": "rt"
        },
        {
            "content": "This was a terrible movie for sure. Long long long scenes of pointlessly driving around in cars or walking down the street. Any resemblance to plot therein is purely coincidental. It had not one redeeming feature other than, when viewed at a bad movie evening, as I did - it was consistently hilarious, with the audience quips making up for it's multitude deficiencies. Would watch again in such a setting for sure. The same can't be said for bigger budget disasters - I'm looking at you, Last Jedi.",
            "review_date": "2020-10-12",
            "source": "rt"
        },
        {
            "content": "It's a fantastic movie,  representing the problems in a modern society. The actors interesting portraiture of frustrated people in a dystopic future is shocking and exciting.",
            "review_date": "2020-10-06",
            "source": "rt"
        },
        {
            "content": "Omg we couldn't stomach watching the whole thing. We made it as far as the two couples in the parking lot at the hotel swatting at birds that aren't even there. I can officially say that was the worst 1/3 a movie I've ever seen!! Acting across the board is subpar at best. Ugh. Horrid movie. Whoever allowed this thing to be produced then aired should be water boarded. Horrible!!!",
            "review_date": "2020-09-23",
            "source": "rt"
        },
        {
            "content": "Unironically, this film is a masterpiece. The special effects are so realistic, you will believe birds are really attacking. The drama is fantastically written, and the actors are fantastic.",
            "review_date": "2020-09-08",
            "source": "rt"
        },
        {
            "content": "The worst film in the history of cinema, nothing is good in this film.",
            "review_date": "2020-08-18",
            "source": "rt"
        },
        {
            "content": "I loved it so much. Nothing made sense, the plot was weird, characters were weird and I have absolutely no idea wtf was happening. would watch again with frens.",
            "review_date": "2020-08-12",
            "source": "rt"
        },
        {
            "content": "My favorite \"so bad its good\" movie. It is literally shocking how terrible this film is, but it is entertaining due to this fact. Like just when you thought the movie was bad, it somehow gets worse and worse. I liked the message behind the film tho!",
            "review_date": "2020-07-16",
            "source": "rt"
        },
        {
            "content": "First of all, I would like to point out to everyone that, yes, I would rather watch Birdemic: Shock and Terror than Repo Man. Screen-saver birds aside, I feel like this film is still slightly less ‘mentally challenged' than Repo Man.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "It's like The Room for horror films.  This one however stumbles around for way to long before it gets to the ridiculousness of its premise.",
            "review_date": "2020-06-14",
            "source": "rt"
        },
        {
            "content": "This film fails so hard at everything, especially the editing, acting and cinematography, that it is a must see for everyone! You also have to applaud director James Nguyen for expressing his incredibly personal vision and having the perseverence to get this film made.",
            "review_date": "2020-06-12",
            "source": "rt"
        },
        {
            "content": "the graphics were glorious",
            "review_date": "2020-05-22",
            "source": "rt"
        },
        {
            "content": "so bad its... bad. it is bad",
            "review_date": "2020-05-17",
            "source": "rt"
        },
        {
            "content": "Birdemic: Shock and Terror, where to begin. This film is on a whole new level.  No one has ever attempted something so risky before, but the results are phenomenal.  Director James Nguyen mastered the art of a romantic horror movie.  I cried, I screamed, I hid under the covers, but I couldn't look away.  I have never seen something so beautiful in my life.  In this review I will break down every aspect of this barrier breaking film, so please join me on this journey through Birdemic: Shock and Terror.\nLet's start with the main part of every film, the acting.  It is the best acting I have ever seen in any film.  Rod (played by Alan Bagh) and Nathalie (Whitney Moore) had a real love connection in this film.  After the film ended I wiped the tears from my eyes and had to know if these two actors were married.  I was heartbroken when I found out they weren't truly together in real life.  They were perfect for each other and I was angry that the birds had to attack them and ruin these two who showed true emotions for one another.  I cannot even begin to fathom how much practice and skill all of the people in this film had.  They knew every line.  They spoke with confidence and pride.  The phone scene for example, these actors showed how much they were interested in each other's lives.  You could learn a thing or two from Rod and Nathalie's relationship.  And the basketball scene too.  The NBA better get to Rod before he gets too involved in acting because he has some great skills on the court.  But emotions were another big part of this movie.  (!SPOILER ALERT!) When Becky (Catherine Batcha) was killed by an eagle I collapsed onto the floor.  I felt the world crumbling down around me.  I felt like I knew Becky on a personal level and it was like one of my closest friends getting killed by an eagle.  But it doesn't end there.  The emotion demonstrated by Ramsey (Adam Sessa) was overwhelming.  I had to pause the film and I was apologizing to Ramsey.  I cried out, \"Why?  Why did they have to take Becky away from Ramsey?  I am so sorry Ramsey!  I wish I could be there with you!\"  And in a way I did feel like I was there with him.  I can't make you watch this film, but if you saw any number of great Oscar winning movies you must see this.  I thought I knew what good acting was until I saw Birdemic: Shock and Terror.\nLet's move on to the next category, the sound and editing.  I don't know what camera they used in Birdemic: Shock and Terror, but I wish I did.  I know that the quality wasn't too great, but if you watch Birdemic: Shock and Terror and then watch another movie that came out in 2010 you will know what I mean when I say, the way they filmed this revolutionized the whole film industry.  The film moves so smoothly.  Like a knife cutting through warm butter.  It almost appears as if the whole film was taken in one long shot.  Amazing.  The sound was also absolutely incredible.  Every word these amazing actors and actresses spoke was crystal clear.  This amazing audio adds to the effect of this film and its greatness.  And the music.  How could I ever explain to you the music in this film?  I can't.  You must listen to its soundtrack to know what I mean.  My favorite song from this movie was sung by the Nightclub Singer (Damien Carter).  This song is hands down my all-time favorite song ever.  And with Rod and Nathalie dancing to it made it even better.  They knew some great moves and demonstrated them perfectly in this film.\nOnto the next category, the plot.  Never have I been so intrigued with a plot.  It had so many twists and turns in this movie.  And much like the filming it went so smoothly.  Everything the characters did made total sense.  I really made a lot of connections with the real world because of this plot.  I think it is amazing how a film, like this one, can transport you to a whole new reality.  Many great films have plot holes, or they lag at some point.  This movie had neither.  And director James Nguyen brought attention to the global warming crisis.  If we don't start using hybrid cars or solar panels birds will soon start flying into the streets exploding on impact.  This film isn't only a work of art, it is also a warning.  Do you want your eyes to be eaten out by a CGI bird?  I think not, so we need to change, and this film taught me that.  The theme of this movie was much deeper.  It hit me right in the heart.  The theme of course being, if birds ever attack get a lot of gas before the gas prices go up to $100.00 a gallon.  In the end I learned that we need to clean up our Earth or prepare for a full blown Birdemic.  We would be filled with shock and terror.\nNow the final point in my review, the special effects.  While watching this film I was generally concerned for the safety of these actors (but luckily they had totally real guns and coat hangers).  I thought the birds were real this entire movie.  It wasn't until after the movie when I did some research that I found out the birds were (!SPOILER ALERT!) FAKE!  That's right all you moviegoers, the birds you saw in Birdemic: Shock and Terror were all fake.  They were just animated.  I had to watch Birdemic: Shock and Terror a second time because I couldn't believe they were animated birds.  Can you believe that they were fake?  I sure can't.  I think that is one thing they are lying about.  They just looked too realistic.  I mean the sounds alone made me think there were birds flying around my own home! It was crazy.  Speaking of sounds I want to warn you: you do NOT need to call the police when you hear them fire their guns in Birdemic: Shock and Terror.  I will repeat myself: you do NOT need to call the police when you hear them fire their guns in Birdemic: Shock and Terror.  When I heard the first gun shot I hid behind my coach thinking someone was firing at me.  I was about to call the police when I realized that it was only more special effects.  My mind was blown.  I couldn't believe it.  \nWhen the credits started rolling at the end of Birdemic: Shock and Terror I stood up and started clapping.  Tears were streaming down my face.  I couldn't believe it was over.  James Nguyen never ever received the credit he deserved for this revolutionary film.  I tell you if you haven't seen this movie you NEED TO.  Children in schools should be required to watch this film because it is part of our history and soon to be part of our future if we don't change our ways.  I would like to say one thing to all the people mocking this movie, how dare you?  How dare you mock this masterpiece?  Could you do better?  NO.  YOU COULD NOT.  Any movie made after Birdemic: Shock and Terror is just trying to achieve something they will never be able to achieve because Birdemic: Shock and Terror has already claimed it.  Please watch this movie, it has changed me, and it will change you.  I urge you to also bring a box of tissues with you wherever you go to see this movie.  You'll need them.  Thank You.",
            "review_date": "2020-05-09",
            "source": "rt"
        },
        {
            "content": "I only saw the trailer to this move and I can already tell this move is complete horse crap. Go watch some porn to see better acting than this used Honda civic type budget film. The critics are right about everything. It seems like two totally different movies slopped together and omg I could just go on for ages. Nobody likes this movie unless your in for some almost comedic irony.",
            "review_date": "2020-04-11",
            "source": "rt"
        },
        {
            "content": "I loved it, it was even better than the American anime \"The simp\" I have yet to actually watch it but I have magic powers so I see it in my mind. even better than Fortnite the great battle royal.",
            "review_date": "2020-04-06",
            "source": "rt"
        },
        {
            "content": "Roses are red\nViolets are Blue\nThe plane noises come from\nThe sky so Blue",
            "review_date": "2020-03-22",
            "source": "rt"
        },
        {
            "content": "Not sexy, not scary - idk what this movie was tryna accomplish bruv",
            "review_date": "2020-01-17",
            "source": "rt"
        },
        {
            "content": "Gave it 1* instead of a half only because of how much I laughed at how bad it was!",
            "review_date": "2019-12-05",
            "source": "rt"
        },
        {
            "content": "Let's start by saying that this movie has embarrassing special effects, the acting rehearsals are worse and the meaningless scenes are fineplice",
            "review_date": "2019-11-21",
            "source": "rt"
        },
        {
            "content": "I heard this was one of the most laughably bad movies ever made and, oh boy, did I underestimate it. Birdemic: Shock and Terror is a shockingly horrible movie that has godawful performances that are worse than some low-budget TV commercials, terrible dialogue, dozens of unnecessary scenes that drag out longer than they should and expose the movie of its horrendous dialogue, incredibly forced and cringe-worthy environmentally friendly themes, possibly the worst editing I've ever seen in a movie, and CGI that makes Mortal Kombat: Annihilation look like Interstellar (yeah, that's some shock and terror for ya).",
            "review_date": "2019-11-04",
            "source": "rt"
        },
        {
            "content": "Os passaros são com uma produção impecável e as mortes são muito boas também além do final muito bom(sarcasmo blz)",
            "review_date": "2019-10-16",
            "source": "rt"
        },
        {
            "content": "A director is a dangerous and terrifying animal",
            "review_date": "2019-10-06",
            "source": "rt"
        },
        {
            "content": "Should have played on the big screens",
            "review_date": "2019-09-28",
            "source": "rt"
        },
        {
            "content": "This movie is amazing. The birds are so realistic, I thought they were in the room with me! The characters are so lovable, especially the tree hugger. I would give this movie 6 stars if I could. Bravo, Birdemic, bravo.",
            "review_date": "2019-09-24",
            "source": "rt"
        },
        {
            "content": "Cinematic Masterpiece!!",
            "review_date": "2019-09-05",
            "source": "rt"
        },
        {
            "content": "As far as \"so bad, it's good\" movies go...let's just say The Room was more professionally made than this feature. Just being a stupid movie about people fighting poorly composited CGI bird sprites that are apparently made of explodium would've sufficed. But nope, they just had to have the most abysmal production values ever seen in a movie. From piss-poor cinematography to terrible audio syncing as well as acting that even Tommy Wiseau would cringe at coupled with tons of borderline hilarious \"angst? what angst?\" with one exception, Birdemic lives up to its subtitle, all right but not in the way the filmmakers were expecting.",
            "review_date": "2019-09-04",
            "source": "rt"
        },
        {
            "content": "La peor película de terror que he visto en mi vida ",
            "review_date": "2019-08-25",
            "source": "rt"
        },
        {
            "content": "OMG let me tell you the movie had such bad graphics it was unbelievable. DON'T WATCH THIS MOVIE ",
            "review_date": "2019-08-15",
            "source": "rt"
        },
        {
            "content": "My god, I've rarely seen a film as broken and poorly made as Birdemic.",
            "review_date": "2019-07-29",
            "source": "rt"
        },
        {
            "content": "With stunning visual effects, brilliant performances, amazing direction, Birdemic is a worthy tribute to Alfred Hitchcock's the Birds.",
            "review_date": "2019-04-21",
            "source": "rt"
        },
        {
            "content": "This film is one of the BEST films that I have ever had the PLEASURE of seeing. The way they spent their entire budget on a car was simply amazing. The storytelling and animations is outstanding and I recommend everyone to see this cinematic masterpiece",
            "review_date": "2018-12-12",
            "source": "rt"
        },
        {
            "content": "Good Lord this is awful in every regard. Script: BAD. Acting: BAD Directing: BAD It is however, unintentionally FUNNY!",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "CGI masterfully incorporated in the fight scenes. Would watch just for the epic battles",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "Birdemic: Shock and Terror is uncomfortable, awkward, features some of the worst acting ever put on screen, and features the worst special effects you could ever imagine.\n\n0/10",
            "review_date": "2018-10-29",
            "source": "rt"
        },
        {
            "content": "why it cant be fixed what so ever",
            "review_date": "2018-10-20",
            "source": "rt"
        },
        {
            "content": "I think I through up at the cgi",
            "review_date": "2018-07-01",
            "source": "rt"
        },
        {
            "content": "I would actually give this a negative star rating if I was able.\n\nThis movie is amazingly, stunningly, chronically awful. The audio is atrocious, the story is bloody awful and the special effects would have been better if done on Mario Paint!  And exploding birds? Was this done someone who was rejected from the Micheal Bay school of splodetography.\n\nSince watching this movie I've been on a quest to find a movie that's worse....and nothing has beaten it.",
            "review_date": "2018-06-13",
            "source": "rt"
        },
        {
            "content": "Gee, this is the same caliber as The Room. Brilliant",
            "review_date": "2018-06-12",
            "source": "rt"
        },
        {
            "content": "Greatest Movie Of All Time",
            "review_date": "2018-06-09",
            "source": "rt"
        },
        {
            "content": "I live dis mavie is reason I no kill meself. Birds look sexy with cumpumper gemerated iimagry. I showed my son this muvin and he be heppy. Birdemic is smexy the birds gave my buners.",
            "review_date": "2018-05-12",
            "source": "rt"
        },
        {
            "content": "One of the worst movies of all time the cji made my eyes bleed.",
            "review_date": "2018-04-24",
            "source": "rt"
        },
        {
            "content": "so bad its good       4.5/5",
            "review_date": "2018-02-08",
            "source": "rt"
        },
        {
            "content": "OK, first off I only saw the Rifftrax treatment of this but for me that's enough as you get a good idea of how horrible this is without the jokes. Second, this wouldn't even get a half star if it were up to me, but reviews won't be shown unless it gets at least a 1 star for some reason.. honestly, this wouldn't even get a quarter of a star. One last thing, the only thing shocking is that it isn't rated lower on Rotten Tomatoes, this should be 0's or close to them on both sides(critic and audience reactions). I've seen worse rated movies that were better than this. Not really much to say review wise because it does everything bad(acting, plot, pacing, \"special\" effects hahaha, sound..) The whole thing is a laughable, cringe-worthy travesty.",
            "review_date": "2017-10-27",
            "source": "rt"
        },
        {
            "content": "It really is as bad as everyone says. The Rifftrax was hilarious!",
            "review_date": "2017-10-24",
            "source": "rt"
        },
        {
            "content": "Worst movie of all time",
            "review_date": "2017-09-25",
            "source": "rt"
        },
        {
            "content": "Truly horrible: a pointless, idiotic first half of meaningless filler shots and useless \"character development\" (characters as sketchy as it gets, awful acting; Whitney Moore is the only one trying), followed by a second half of utterly nonsensical \"action\", the most ridiculous \"effects\" ever and an inexplicable resolution. Add to the mix the nonexistent technical qualities (how to hold a camera, what's a boom mic) and some not-so-subtle environmental preaching and you've got a film so horrible it would've been profoundly sad if it wasn't unintentionally hilarious.",
            "review_date": "2017-08-16",
            "source": "rt"
        },
        {
            "content": "Greatest Movie I have seen all year, James Nguyen is a genius and should be commended.",
            "review_date": "2017-07-21",
            "source": "rt"
        },
        {
            "content": "This movie ROCKED!!!!!!!!!",
            "review_date": "2017-07-18",
            "source": "rt"
        },
        {
            "content": "10/10 best anime ever",
            "review_date": "2017-06-14",
            "source": "rt"
        },
        {
            "content": "BEST MOVIE IN HISTORY \nBETTER THAN STARWARS \nJAMES NGUYEN IS THE BEST DIRECTOR IN THE WHOLE UNIVERSE PROPS TO EDITOR FOR MAKING BIRDS REAL SPOOKY AND LIFE LIKE \nWILL PAY ANYTHING TO SEE NUMBER 3 OF BIRDEMIC",
            "review_date": "2017-05-01",
            "source": "rt"
        },
        {
            "content": "Why are people ROBIN you of good reviews?\nThis movie is the opposite of FOWL!",
            "review_date": "2017-03-23",
            "source": "rt"
        },
        {
            "content": "There may have been an important message in this film, but  I didn't get it.. maybe because I was laughing too much.",
            "review_date": "2017-03-22",
            "source": "rt"
        },
        {
            "content": "Great poster! Terrible movie. Deserves credit for occasionally inserting lengthy, and unwieldy monologues about sustainability and natural diversity. Otherwise, this is basically a bad YouTube clip about killer \"birds\" following a young couple, and numerous scenes following their courtship and dating prior to the birdemic feel somewhat irrelevant.",
            "review_date": "2017-03-03",
            "source": "rt"
        },
        {
            "content": "From audio missteps to poor editing and even poorer dialogue, I cannot think of a single compliment for this movie. This might well be the worst movie I've ever seen, yet I recommend that everyone watch it. It's essentially a compendium of \"what not to do when you make a movie.\" \n(It also makes for a great Rifftrax)",
            "review_date": "2017-02-27",
            "source": "rt"
        },
        {
            "content": "Amazing movie that I would definitely call a masterpiece!!!!!!!!!!!",
            "review_date": "2017-02-19",
            "source": "rt"
        },
        {
            "content": "Best good actor yes yes amazing editing buy it on blueray",
            "review_date": "2017-02-02",
            "source": "rt"
        },
        {
            "content": "Absolutely hilarious but it does get annoying after a while.",
            "review_date": "2017-01-17",
            "source": "rt"
        },
        {
            "content": "Worst movie ever made!",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "So I see LOTS of good reviews of it they are completely mindless little psychopaths that don't know what the idea of the movie is. Birdemic takes Not 5 Not 10 Not EVEN 20 NOT EVEN 30!! 45 FUCKING Minutes until the birdemic starts! It is dull, It is SO Stupid!!!! me outraged talking about this I mean. How in the hell foodfight is worse than this peace of junk! the children are dull. Survival skills on these people are like 0/10! Editing is HORRIBLE. Sorry for yelling but what the hell? How did they make another birdemic of making fun of it? That wont fucking help",
            "review_date": "2017-01-02",
            "source": "rt"
        },
        {
            "content": "The story is completely aimless and goes on forever, the acting and the audio quality are abysmal, the CGI birds are laughably fake-looking, and the movie's environmental message is the worst you'll ever hear in your life. Watch only once.",
            "review_date": "2016-12-29",
            "source": "rt"
        },
        {
            "content": "roger appreciate.....and like.....",
            "review_date": "2016-10-30",
            "source": "rt"
        },
        {
            "content": "An utter disaster. Period.",
            "review_date": "2016-10-06",
            "source": "rt"
        },
        {
            "content": "BIRDEMIC!!!!!!!! More like bonerdenic! This movie changed my life!",
            "review_date": "2016-08-27",
            "source": "rt"
        },
        {
            "content": "Supposedly a tribute to Hitchcock's classic, nothing could have fallen shorter of its mark. Birds don't even appear until 20 minutes into the movie, and the main conflict doesn't even begin until halfway through its 90 minute runtime (it will feel longer). The misfired environmental message is only accentuated by accidentally hilarious editing, earsplitting sound design, wooden acting, worst of the worst special effects, and wandering plot. Birdemic takes so-bad-its-good movies into the 21st century.",
            "review_date": "2016-08-26",
            "source": "rt"
        },
        {
            "content": "So I heard some asshole by the name of Alfred Hitchcock ripped off James Nguyen's movie, can you believe that. Anyways my Film History teacher told us to watch this for learning experience. Was not disappointed.\n\n08/100",
            "review_date": "2016-08-23",
            "source": "rt"
        },
        {
            "content": "I'll give this movie some credit: I never thought an actual production team could manage to absolutely ruin every single aspect of a movie. The script, the plot, the acting, the props, the visual effects, the compositing, the video editing, the sound design, the cinematography, and the lighting are all so mind-bogglingly awful that it's hard to imagine a team of adults actually managing to craft such a morbid testament to filmmaking incompetence. It's so utterly terrible that it is, in fact, worth the watch. It's so horrifically bad that it's come full circle and earned a place in the hearts of cult fans worldwide. \n\nIt's a masterpiece, but not in the way that would earn it a 10/10 on Rotten Tomatoes.",
            "review_date": "2016-08-20",
            "source": "rt"
        },
        {
            "content": "This film had me looking away at times because it was sooooo scary!The birds look so realistic that I thought they were about to jump off the screen and attack me!WOW!The special effects and sound were simply amazing!Its a great horror film,but dooon't watch it if you get scared easily!",
            "review_date": "2016-07-30",
            "source": "rt"
        },
        {
            "content": "By far the greatest, yet worst movie I have ever experienced. It is on an entire other state of being.",
            "review_date": "2016-06-21",
            "source": "rt"
        },
        {
            "content": "As a video editor everything about this film hurt me. Not only was the story, acting, lightning and everything in production bad, but the editor obviously did not know anything about film or the program they were using. This was beyond \"so bad it is good', it was just god awful. You could totally tell that the editor made cuts based on action and added the dissolves after. And that is only one of too many problems. Acting was so bad, audio off, gun shots off, CG just terrible. Story was all over the place and just plain bad. Worst movie I have EVER seen! Including high school and college films. I get films being bad to be funny, but this is just plain bad.",
            "review_date": "2016-06-21",
            "source": "rt"
        },
        {
            "content": "Its going to be great movie, im going to see it *nodding my head*",
            "review_date": "2016-05-21",
            "source": "rt"
        },
        {
            "content": "This film is hilariously terrible",
            "review_date": "2016-04-03",
            "source": "rt"
        },
        {
            "content": "better than jurassic world",
            "review_date": "2016-04-01",
            "source": "rt"
        },
        {
            "content": "I can't even put in words how broken and effortless this movie is. Where the movie The Room had some form of competence and something to laugh with and at, Birdemic is wrong in every form and is unredeemable.",
            "review_date": "2016-03-17",
            "source": "rt"
        },
        {
            "content": "A movie that puts most bad movies to shame. The plot is incoherent, the first half having nothing to do with the second, and the second half going nowhere. The editing are awful, inexcusable. The bird computer effects are laughable. The whole movie is laughable. Everything is painfully laughable.",
            "review_date": "2016-03-07",
            "source": "rt"
        },
        {
            "content": "I laughed and cried about the animation",
            "review_date": "2016-03-06",
            "source": "rt"
        },
        {
            "content": "movies are not supposed to follow every single thing the character does.\nwe don't really want to see him getting gas.",
            "review_date": "2016-02-21",
            "source": "rt"
        },
        {
            "content": "A movie with a message.  We are destroying the earth and for that, birds will attack us.  Yet inexplicably, birds will SAVE us.  \nLots of driving.  Plenty of empty stares. Awkward silences to end every scene that actually contains dialogue. Animated birds that dive bomb and explode upon impact (or sometimes just die).  Sound editing so good, I can hear almost half of the dialogue.  Ground breaking Special Effects. FLAWLESS performances.  \nDo yourself and watch this MASTERPIECE.",
            "review_date": "2016-02-20",
            "source": "rt"
        },
        {
            "content": "I'd just like to say, this movie looks like it was made by a fourth-grader using windows movie maker messing around with assets and didn't know how to clip video segments.",
            "review_date": "2016-02-07",
            "source": "rt"
        },
        {
            "content": "best movie ever worths every second its only competence is cool cat",
            "review_date": "2016-02-06",
            "source": "rt"
        },
        {
            "content": "Birdemic: Shock and Terror is arguably the greatest film since Citizen Kane. With great graphics and emotional acting from budding stars, it's hard to feel like I was not being attacked by birds myself. The fact that this film was not nominated for any academy awards disgusts me to my core, and is probably one of the most outrageous Oscar snubs of the 21st Century.",
            "review_date": "2016-01-26",
            "source": "rt"
        },
        {
            "content": "One of the best comedies out there!",
            "review_date": "2016-01-17",
            "source": "rt"
        },
        {
            "content": "Really? VFX be like it was made with a cellphone and it's a copy from \"The Birds\" by Alfred Hitchcock",
            "review_date": "2016-01-17",
            "source": "rt"
        },
        {
            "content": "Shock and terror indeed.. never before have I been more shocked, or terrified of a film up until now. I'm not even going to mention how the directer is a complete and utter idiot (See the interviews with James Nguyen to see what I mean). The main antagonists of this fiasco; the birds, looked like they were slapped on there by an 8 year old who just discovered how to use Adobe Photoshop. The dangers of global warming are force fed to you, and the romance is so awkward that I can't help but cringe at it.",
            "review_date": "2016-01-16",
            "source": "rt"
        },
        {
            "content": "A misguided attempt at a B-movie that has no redeeming qualities in any way whatsoever.",
            "review_date": "2016-01-13",
            "source": "rt"
        },
        {
            "content": "They say there are seven wonders of the world. I count eight seeing how this film was put into a DVD case.",
            "review_date": "2016-01-09",
            "source": "rt"
        },
        {
            "content": "I thought shark boy and lava girl had excellent special affects with a story at it's finest, but this movie takes the cake. The birds are more realistic than the actors potential talent.",
            "review_date": "2016-01-08",
            "source": "rt"
        },
        {
            "content": "There is a reason that this movie gets even one star. It gives me the chuckles, cause it is soooo bad.",
            "review_date": "2015-12-26",
            "source": "rt"
        },
        {
            "content": "A movie that doesn't even deserve a realistic star review...the claims of it being, \"so bad it's good,\" is just something I can't understand. Truly appalling.",
            "review_date": "2015-12-05",
            "source": "rt"
        },
        {
            "content": "Wowð???\nSo bad it's good but not worth my stars",
            "review_date": "2015-11-30",
            "source": "rt"
        },
        {
            "content": "The actors are the worst, the camera angles are the worst, the special effects are the worst. This movie is SO bad that you can't help but just laugh at how horrendous this piece of garbage is.",
            "review_date": "2015-11-28",
            "source": "rt"
        },
        {
            "content": "i love this movie(one of the funniest movie ever) but it is still crap",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "Could be the worst movie ever made",
            "review_date": "2015-10-29",
            "source": "rt"
        },
        {
            "content": "It's just a really boring and poorly made film, the characters are idiots that are not interesting, the story doesn't make sense, the CGI for the birds are just dreadful and worst of all the acting is just too simplistic actually so is this movie to be honest.",
            "review_date": "2015-10-29",
            "source": "rt"
        },
        {
            "content": "It sucks. Like, WOW, does it suck. I, personally, don't even think it's so bad it's good. It's BORINGLY bad. If you want to see a so-bad-it's-good movie, check out The Room. At least in that, there were a couple decent shots. Birdemic is gloomy, ugly, and just not bad enough for me to like it in an ironic way.",
            "review_date": "2015-10-14",
            "source": "rt"
        },
        {
            "content": "A so-terrible-it's-actually-kinda-beautiful homemade treat whose heavy-handed environmentalism is only overshadowed by its ineptness. It honestly makes Troll 2 look like a vision of a master auteur. A life altering experiencemuch like learning about an immense social injustice, having a staggering religious experience, or eating the KFC Double-Down, you walk away from Birdemic a changed person, unable and unwilling to ignore its presence.",
            "review_date": "2015-09-11",
            "source": "rt"
        },
        {
            "content": "I loved this film, a true classic.\nThe CGI was perfect and the acting and attacks truly great\nwhen the birds attacked I got scared and I might have urinated a little bit :s",
            "review_date": "2015-09-10",
            "source": "rt"
        },
        {
            "content": "eye openingly entertaining",
            "review_date": "2015-09-02",
            "source": "rt"
        },
        {
            "content": "This movie is great and a must see. This movie is everything that should never happen in a movie ever again.",
            "review_date": "2015-08-13",
            "source": "rt"
        },
        {
            "content": "Such a mess, with no qualites, no artistic potential whatsoever and no redeeming factors beyond its ability to be a joke that writes itself.",
            "review_date": "2015-07-18",
            "source": "rt"
        },
        {
            "content": "BEST MOVIE OF ALL TIME.",
            "review_date": "2015-07-10",
            "source": "rt"
        },
        {
            "content": "for a film inspired by a Alfred Hitchcock film from the 50's this movie is some of the worst ever films. this film truly is something heck i get more enjoyment out of the room and when you make a film worse than the room then you know your doing something wrong and this film is the best worst movie created.",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "Enjoyable. However, the movie is terrible.",
            "review_date": "2015-06-26",
            "source": "rt"
        },
        {
            "content": "Amateur-looking on a disastrously large scale and impossible to take seriously, Birdemic will remain a legend among So-Bad-It's-Good cinema due to its juvenile unintelligent writing, hackneyed story, and laughable \"special\" effects.",
            "review_date": "2015-06-07",
            "source": "rt"
        },
        {
            "content": "There really is no real way of rating this.  For what it tries to do, it's terrible.  And that is the same reason why it's so great.",
            "review_date": "2015-06-02",
            "source": "rt"
        },
        {
            "content": "Not as funnybad as The Room, but funnybad enough to make it essential viewing.",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "F-\nHilarious because it's so bad, but definitely the worst movie ever made.",
            "review_date": "2015-05-19",
            "source": "rt"
        },
        {
            "content": "a good film to watch if you're a fan of rifftrax of MST3K",
            "review_date": "2015-05-13",
            "source": "rt"
        },
        {
            "content": "BEST. MOVIE. EVER. 10/10 -IGN",
            "review_date": "2015-05-09",
            "source": "rt"
        },
        {
            "content": "The people behind this piece of trash invested next to NOTHING to make it, so I guess one sentence is as much as I will invest when it comes to reviewing it.",
            "review_date": "2015-05-05",
            "source": "rt"
        },
        {
            "content": "The worst film ever made",
            "review_date": "2015-04-29",
            "source": "rt"
        },
        {
            "content": "BIRDEMIC: The Shock and Terror is one of the finest examples of modern art and film ever exhibited. Combining incredibly stale young actors with a riveting and thrilling plot, the film's commentary on climate change and an inevitable battle for human survival against wild birds is not only touching, but profound and important. Topping it all of with breathtaking CGI effects, Birdemic is easily one of the best movies to come out in the past 20 years.",
            "review_date": "2015-04-27",
            "source": "rt"
        },
        {
            "content": "Birdemic features a bad script filled with some of the worst dialog in film and and an awkward obsession with the characters personal lives and their views on global warming. The visual effects are basically three different animations green screened into shots. They look laughably fake. Bridemic is nearly the worst film ever made. I would input a zero star rating if that was possible. 3/100",
            "review_date": "2015-04-12",
            "source": "rt"
        },
        {
            "content": "I do not understand why this isn't the worst ever instead of Manos? This movie wasn't just terrible, it was terrible about being terrible. It wasn't even funny terrible, it was just terrible.",
            "review_date": "2015-04-07",
            "source": "rt"
        },
        {
            "content": "Pointless, plotless and painfully dull, James Nguyen's DIY thriller is a bird-brained disaster. Sure, the tacky visual effects make for the odd laugh, but this is by no means a good bad movie; it's an irredeemable attack on the senses.\nBirdemic is literally a catalogue of awkward conversations, screechy bird noises and random encounters with oddball environmentalists, each louder and uglier than the last. One minute the characters are preaching green, the next they're pointing toy guns at seemingly stationary, crudely animated birds which, let's face it, doesn't stay funny for long.\nBirdemic is aimless, conflict-less and utterly confused, and it brings a whole new meaning to amateur filmmaking. Be sure to keep a finger on your volume control.",
            "review_date": "2015-04-06",
            "source": "rt"
        },
        {
            "content": "When this movie finished, I could never look at The Godfather the same way again",
            "review_date": "2015-03-12",
            "source": "rt"
        },
        {
            "content": "This movie is horrible-but is amazingly funny. Perhaps the best worst movie ever made.",
            "review_date": "2015-03-07",
            "source": "rt"
        },
        {
            "content": "This movie is an abomination. The affects are terrible, the actors are awful, and it's a cheap ripoff of the 1960's Alfred Hitchcock classic \"The Birds\", which has way better affects than this awful movie.",
            "review_date": "2015-03-04",
            "source": "rt"
        },
        {
            "content": "Birdemic is awful, though I pretty much knew that going into it. I also knew that it has a sort of reputation as another one of those awful films that's fascinating to pick at and learn from as a film that gets everything wrong. While some may choose to see it that way, I don't really. I've seen films like Troll 2 and The Room where they're so awful that get so much wrong, but are entertaining to pick at and are so bizarre that they're beautiful messes. Birdemic isn't quite like that for me, it's a film that should be seen once because its technically appalling in camera work, sound design, and of course visual effects, and well... just everything including a completely unfocused story that goes nowhere. But Birdemic is a boring specimen, and not every collossal failure in filmmaking necessarily makes it into the Hall Of Masterfully Awful Films. \n\nBirdemic is one to watch if you need that fix on watching something that reminds you of how low filmmaking can dip, and like any film in its level, its usually fun to watch again as long as you're showing to a friend who has no idea what they're getting into! It's also amazing just to know that this shit really gets made by people who are serious about what they were making, but I personally find this one was just dull and where its awfullness only escalated to a certain point and kept recycling it till everything awful there was to be fascinated with just becomes... less entertaining. It's not like other terrible films with a following that have a lot to come back to. Birdemic is easily swallowed in once, and you got what you need. If I'm ever going to show friends a film that's notoriously bad and must be seen to believed, I can see myself resorting to other more interesting specimens than Birdemic. Otherwise, dive into some amusing bad but dull amateur filmmaking at your own risk, but its always better with a friend!",
            "review_date": "2015-02-01",
            "source": "rt"
        },
        {
            "content": "For what it is, it's entertaining for all the wrong reasons. I like movies like this that think they're being serious when they're clearly far from it. (See \"The Room\"). This kind of thing doesn't work with movies like \"Sharknado\", which blatantly try to be awful. Still, this is too long, and too choppy to watch more than once, unless with friends.",
            "review_date": "2015-01-13",
            "source": "rt"
        },
        {
            "content": "'If you wanted to describe it you could say \"it's about birds.\" But if you wanted to sound like a critic, I guess you could call it earnest.'\n-JonTron, 2012",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "Very funny and is worth seeing for a good laugh. Don't get me wrong the movie is terrible but it itself is funny.",
            "review_date": "2015-01-01",
            "source": "rt"
        },
        {
            "content": "Complete rubbish . But possibly one of the funniest \"bad\" movies to watch",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "If you get the urge to ever play this movie in front of fellow human beings; get some cultishly 'happy' people to sit around and laugh as you drive bamboo splinters in your own eyes, with a bird dropping it's liquid 'messages' on your head and having your foot gnawed off by a 'roided up beaver.  Trust me, it is less painful than this super fowl 'movie'. The FBI should consider this as an applied torture technique.",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "7/10 for being so amazingly bad it's good, and very entertaining (in all the wrongs ways). But only a 3/10 because this movie fucking sucked. What an incompetent filmmaker. You have to watch it, it's amazing...and hate love hate it.",
            "review_date": "2014-11-08",
            "source": "rt"
        },
        {
            "content": "10/10 100/100 1000/1000",
            "review_date": "2014-09-21",
            "source": "rt"
        },
        {
            "content": "The most entertaining, unintentionally hilarious comedy ever made.",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "I absolutely LOVED it. But my god was it terrible. Infuriating. Totally unspeakably awful. Brilliant.",
            "review_date": "2014-09-13",
            "source": "rt"
        },
        {
            "content": "God its so bad it makes me laugh at least it got that right",
            "review_date": "2014-09-10",
            "source": "rt"
        },
        {
            "content": "This movie is one of the worst I have ever seen. It has a storyline with many flaws,terrible actors, and the worst CGI (in my opinion) that has ever been used in a movie.",
            "review_date": "2014-09-05",
            "source": "rt"
        },
        {
            "content": "An absolute masterpiece. You have never seen anything like this before, I can guarantee it. Unbelievable in every sense of the word. I really don't know where to even start with it.\n\nFirst, the acting is just amazing. Honestly, it makes the cast of 'Troll 2' look like Robert Redford, Dustin Hoffman and Daniel Day Lewis. Alan Bagh turns in what is without a doubt the best/worst performance of all time, and I say that with no reservations. Fortunately for everyone's enjoyment, every other cast member is equally horrific. An excellent twist of casting events is detailed on the back of the DVD, exclaiming 'Featuring a special appearance by Tippi Heddrin!!' I'm seriously not shitting you, this 'special appearance' is footage of her on the TV in the background of a scene. \n\nAnother thing is, of course, the special effects. To call them 'special effects' is actually disrespectful to special effects, because in place of effects are GIFs. It is so unreal that it really makes you question the reality we live in. \n\nThe direction and editing (particularly the sound editing) are other major points. It is simply a masterpiece of technical execution. The fact that this took Nguyen 4 years to produce this is mind-numbing. It seriously should have taken perhaps 4 weeks.\n\nAll of the horrible acting, execution and visual effects aside, the dialogue and story are what sell it. So may incredible moments... The dance scene at the bar, the boardroom scene, the hippie in the woods scene, the coat-hanger scene, and a plethora of others combine for a most memorable viewing experience. The ridiculously heavy handed message regarding global warming has done more harm than good for the cause I'm sure.\n\nI feel like I've done a crappy job reviewing this film, but if I can impose one thing, just do yourself a favor and see it. There is no way I can properly put into perspective the incredible horrificness of this movie. It is simply incredible. Incredible. I can not wait for 'Birdemic 2' in motherfucking 3D.",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "WHAT A FANTASTIC FILM!!!!!!!! Great quality! I almost committed suicide, and then I saw this. Thanks to the slutty cow girl, giant jumbo jellyfish, and shitty CGI birds, and random ass zombies, my life was saved and completed by this enchanting tale, BIRDEMIC.",
            "review_date": "2014-08-29",
            "source": "rt"
        },
        {
            "content": "Why?\nJesus!\nI don't know, that James Nguyen why directed this the movie, horrible!!\nAlan Bagh not actor, Nguyen not director, and the Birdemic: Schock and terror not movie. Not. \n10/0\n5/0\nOne question: why?",
            "review_date": "2014-08-17",
            "source": "rt"
        },
        {
            "content": "You need to be inebriated to get past the mind-numbingly boring filler between the hilariously bad scenes.",
            "review_date": "2014-08-11",
            "source": "rt"
        },
        {
            "content": "Horrifying; not because it's scary, but because it's sickening to the eyes and ears.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "This movie makes The Room look like a masterpiece. The only thing keeping me from giving it just half a star is that there are *some* amusing parts.",
            "review_date": "2014-08-09",
            "source": "rt"
        },
        {
            "content": "10/10 grate story grate character development and grate effects and action!",
            "review_date": "2014-07-27",
            "source": "rt"
        },
        {
            "content": "Birdemic has catapulted further past the range of \"so bad it's good\" than I ever thought was possible. I am not lying when I say I could have filmed a better movie myself.",
            "review_date": "2014-07-26",
            "source": "rt"
        },
        {
            "content": "One of the best worst movies out there",
            "review_date": "2014-07-19",
            "source": "rt"
        },
        {
            "content": "I cannot name one aspect of this film that is well done. Any scene with a good camera angle seems to be a mistake, the script seems so fake, the actors don't deliver a single line well, and there are random audio cutouts. It is very clear that no one on this team is truly passionate about their work.",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "Not even remotely enjoyable",
            "review_date": "2014-06-29",
            "source": "rt"
        },
        {
            "content": "This was probably the worst film I've sat through in ages. There's some funny scenes here and there but there's long gaps of nothing and it gets boring and hard to sit through.",
            "review_date": "2014-06-27",
            "source": "rt"
        },
        {
            "content": "If I give out an award for the worst movie of all time, this movie would win the golden trophy",
            "review_date": "2014-06-26",
            "source": "rt"
        },
        {
            "content": "t's called Birdemic: Shock and Terror because this movie will shock and terrorize you for the rest of your life.",
            "review_date": "2014-06-20",
            "source": "rt"
        },
        {
            "content": "Literally the best film ever made.",
            "review_date": "2014-06-18",
            "source": "rt"
        },
        {
            "content": "The first half is unbearably slow. Unless you have the benefit of Rifftrax or some really entertaining company to watch it with, it may be a struggle to make it through. But down to literally almost the precise minute, the second half of the film transcends merely being terrible and boring, and ascends to being explosively, gloriously disastrous.",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "At first, it's so bad that it's funny. By the end, it's so bad that you want to kill yourself. What a shit show.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "This movie is about a sexy lingerie model and her computer engineer boyfriend as they take a pleasant trip to Northern California, only to discover that legions of malicious birds are descending on human kind. Soon, the couple's dream vacation becomes a battle for humanity's survival. This movie has horrible acting and one of the worst CG that I ever seen in my life and I know there didn't have enough money to get real birds and to me that's a bad sign that your movie is going to die quicker.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "Who shitty enough made this CGI?",
            "review_date": "2014-06-14",
            "source": "rt"
        },
        {
            "content": "5 out of 5. Best worst movie ever!",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "Made with absolutely no passion. This film is absurd and abysmal from the very first scene. The acting is ridiculous, the cinematography is terrible, the writing is some of the worst I've ever had the displeasure of seeing, and though the film is completely terrible, I still had  a good time watching it. Why you ask? Because it's hilarious. This film is comedy gold, not because it's a comedy but because its so absurdly appalling that pointing out each of its flaws is just so much fun. You can honestly create a game based around all of the flaws in the film and whoever gets the most wins or something. This is a good film if you're inviting a bunch of friends over and you just want to laugh your asses off for an hour and a half, just don't watch it alone. Though the film is bearable due to the fact that it has ridiculously laughable dialogue, acting, and visuals, it's still an disgusting and terrible film that shouldn't really be seen unless under the circumstances that I mentioned earlier.",
            "review_date": "2014-05-21",
            "source": "rt"
        },
        {
            "content": "Amazing! Recommend it to everyone. I'd put it up there with Wolf of Wall Street and The first Star Wars trilogy. A credit to cinematography!",
            "review_date": "2014-05-16",
            "source": "rt"
        },
        {
            "content": "Worst movie in the history of ever.",
            "review_date": "2014-05-10",
            "source": "rt"
        },
        {
            "content": "Fantastic movie. Recommend to all.",
            "review_date": "2014-05-06",
            "source": "rt"
        },
        {
            "content": "A true masterpiece in the visual art of cinema. With stunning visual effects on par with legends like Michael Bay, M. Night Shalamaladingdong, and Zack Snyder, Birdemic: Shock and Terror is sure to enlighten, inspire, and evoke a breath of new life into modern society. A cast of incredible and sympathetic characters given life by their equally as talented actors will be sure to extend and expand its emotional impact and original themes for years to come. James Nguyen is a stunning master of a filmmaker, and belongs at the top of the list of such directorial greatness, reaching a hierarchy above the names of Alfred Hitchcock, Stanley Kubrick, and Francis Coppola. \n\nBirdemic: Shock and Terror may reign as one of the greatest movies ever made and will live on in the hearts of millions.",
            "review_date": "2014-04-24",
            "source": "rt"
        },
        {
            "content": "Now rightfully a cult film, this film is just plain bad. All you need to do is look at its posters and trailers - that will sum up perfectly what this film is really like.",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "HAHAHAHAHAHAHHAHAHAHAHAHHAHAHAHAAHAHAHAHHAHAHAHAHHAHAHAHAHHAHAHAHAHAHAHAHHAHAHAHAHHAHAHAHAHAHAHHAHAHAHAHAHHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAAHAHHAH ASADASFAKJGKLSA;KGASLGSAHGAS",
            "review_date": "2014-04-13",
            "source": "rt"
        },
        {
            "content": "A bad but funny film - 2/10",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "Cheap, horrible filmmaking at its finest. Birdemic is plagued by appallingly bad visual effects, inconsistent sound editing, lifeless acting, and terrible pacing",
            "review_date": "2014-04-09",
            "source": "rt"
        },
        {
            "content": "88%\nNot even Apocalypse Now or The Shining can live up to this masterpiece.",
            "review_date": "2014-04-08",
            "source": "rt"
        },
        {
            "content": "The most dreaded movie on Earth!!!!!!",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "Low budget independent films can be charming if produced by someone with passion, if there's one thing Birdemic lacks it's a passion. James Nguyen has given us a cinematic atrocity that is not only embarrassing, but it's insulting to those who aspire to get into the film-making business. This film is hilariously terrible, but there is no guilty pleasure aspects to it.",
            "review_date": "2014-04-04",
            "source": "rt"
        },
        {
            "content": "What the honest hell did I just watch.\nBy far the most annoying, stupid, and worst film I have ever seen.",
            "review_date": "2014-04-01",
            "source": "rt"
        },
        {
            "content": "This movie makes those amateur videos I made in 4th grade look like Scorsese films. And I mean that, in the best possible way. This movie is a masterpiece of crap.",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "An embarrassing dreck that is so bad it defies comprehension, with what seems to be the most incompetent editing and worst (unmixed) sound ever. And what to say of those ridiculous CGI birds? Even Ed Wood would run away from something like this. (Zero stars)",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "This is so atrociously bad that I actually find it insulting that this movie managed to find a distributer whilst some films (which must be better than this!!) are still stuck in development purgatory.\nI don't acknowledge that this is MEANT to be a bad low budget film, plenty of them were made in the 60's and provide entertainment, this doesn't provide entertainment on any level because the production values and director, story and acting fail on every level. \nIn a nutshell it's a ripoff of Alfred Hitchcock's The Birds, but most of the film is wasted with establishing shots and 5 minute scenes of a character sitting in traffic, getting petrol, sitting in traffic, walking into work (no dialogue, just shots which had clearly been filmed in pick ups).  When the horror/thriller element of the film does get going, it's far too late to generate any interest because you just don't care about the lifelessly dull characters.\nWithout all the nonsensical filler, this may have passed the cut as a short film (20-30 mins) and while it still would have been pretty bad, it wouldn't have been an insulting waste of time, equipment and celluloid.\n\nHonestly, there is nothing good about this film. The direction, acting, photography, editing, sound and special effects are below what I would associate with even an amateur movie.  Quite possibly the worst film ever.",
            "review_date": "2014-03-19",
            "source": "rt"
        },
        {
            "content": "Classically bad, but very entertaining when watching with someone you can laugh along with.",
            "review_date": "2014-03-15",
            "source": "rt"
        },
        {
            "content": "A masterpiece of a movie!!! No, actually it's a piece of crap that has a script that feels like it was written by a 2nd grader for a school project. And not one of the smart 2nd graders, the short bus kids...",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "so horrifically bad in every aspect, woefully bad acting,editing,effects and sound, this movie is so bad that its brilliant",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "I had one lingering question the whole time I was watching this. Am I being played here? Is this one elaborate 90 minute joke? Then, with a second viewing, I got my answer. Hell, no. These people are as sincere about this as they get, and the only thing funnier than a sincere attempt at humor that succeeds is a sincere attempt at anything else that doesn't. The Room still has this beat, but that doesn't mean Birdemic: Shock and Terror isn't knocking on its door, saying, \"Hi, neighbor!\" James Nguyen may not have accomplished much, other than achieving cult-status that accompanies films like these, but if he has accomplished anything, it's making Ed Wood seem legit.\n\nFull review at http://silverscreenfanatic.com/2014/02/24/what-the-hell-were-they-thinking-8/",
            "review_date": "2014-02-24",
            "source": "rt"
        },
        {
            "content": "I will not say for sure that this is the worst film I've ever seen, but I will say with absolute certainty that this is among the top 10 worst films I've ever had the displeasure of suffering through. Gerry is by far one of the worst things I've ever wasted good money on, and it's a fucking masterpiece compared to this. My buddy, who suffered through this with me, suggested we turn it off after a few minutes of some of the worst sound, sound editing, script, editing in general and acting we'd ever seen. I thought we should at least persevere until we got to witness some of the horror we'd been promised by its very genre. Once we got into it, it started getting funny in that please kill me now kind of way. If you've been bad and feel that you deserve punishment, please grab this up and watch it...twice. I'll sum this up with the first words out of his mouth as the credits rolled. \"That was some damn fine cinema.\"",
            "review_date": "2014-02-21",
            "source": "rt"
        },
        {
            "content": "Supposedly inspired by Alfred Hitchcock's \"The Birds\", the story focuses on a computer engineer played by Alan Bagh who goes to the beach with his girlfriend who is a  lingerie model. Soon they are attacked by eagles that can spray acid (not kidding) for no reason and their vacation becomes a battle for humanity's survival. The acting in this makes Tommy Wiseau look Oscar-worthy. The movie itself makes The Room look like gold. The editing looks like something out of Sony Vegas, the special effects look like GIF images taken out of Google, the sound was horrendous, the poster looks like was made using Paint, the plot was repetitive, boring, annoying as fuck and overall, the finished product looks like an old YouTube video I made a long time ago on Windows Movie Maker. Birdemic: Shock And Terror gets a Some Old Bullshit/10!!!!!!!!!!!",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "This is the greatest film in the world. The special effects are absolutely amazing and realistic and the acting is incredibly Oscar worthy.",
            "review_date": "2014-01-27",
            "source": "rt"
        },
        {
            "content": "This is the worst movie I've ever seen.\n\n10/10",
            "review_date": "2014-01-26",
            "source": "rt"
        },
        {
            "content": "I hate this movie. There are no redeeming qualties to this terrible terrible movie. We have acting that goes beyond wooden into just non emotional talking. Top it off with a message that is so apprant yet so terribly presented that I want to punch the writer of this junk in the face. I don't even want to give this rating but I have to.",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "An awful film with terrible CGI, acting and most of all editing; but at the end of the day they achieved exactly what they wanted which was nothing more than a bad movie.",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "This movie is so aggressively awful.  Its script is lacking, the effects are something out of a decrepit and maimed photoshop, and the acting from the leads transcends Razzie-worthiness.  And this is what makes it one of the most hilarious things I've ever seen, I haven't laughed as hard watching good comedies.  It's not so bad it's good, because believe me, this movie cannot be salvaged.  Rather, it's so bad it's gut-bustingly hilarious.",
            "review_date": "2014-01-09",
            "source": "rt"
        },
        {
            "content": "It's horrible execution of almost every aspect of film is hypnotic, somehow drawing you to keep watching.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "amazing acting, effects and story a must see to be believed",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "forced badness does not equal fun",
            "review_date": "2013-12-20",
            "source": "rt"
        },
        {
            "content": "My sides are gonna explode.",
            "review_date": "2013-12-13",
            "source": "rt"
        },
        {
            "content": "the worst movie ever created by man kind. The whole movie was edited by a drug induced ten year old who was most likely also behind the hiring of the actors in this movie. The first 15 mins is spent watching a car in traffic with elevator music in the background. It's sooo painful I almost could not continue! The \"point\" of this movie is to tell people that we need to take more care of the earth...I Think.. This movie is random, confused and most likely had an out of pocket budget of about $10",
            "review_date": "2013-12-07",
            "source": "rt"
        },
        {
            "content": "Since 1997 The Howling VI has ranked as the worst movie I have ever seen. It has finally been dethroned by this flaming turd. It isn't even all that funny (although I did howl at the initial bird attack on the city, complete with Stuka sound effects).",
            "review_date": "2013-10-24",
            "source": "rt"
        },
        {
            "content": "Love it. Drunk movie!",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "There are a hundred times during the course of \"Birdemic\" that I wondered about the mental status of writer/director James Nguyen, but the aspect of the film that I questioned the most was what his intentions were by making it. Did he plan on making a legendarily horrible film that would live on for eternity on the midnight circuit or was he actually trying to make a good film?\n\nRegardless of what he thought he was doing, he has managed to make one of the best bad films of all time, a film that is so inept in every single conceivable way that writing a review seems almost pointless. Nguyen has no idea how people talk, even in conventional settings such as talking with your mother on the phone or ordering from a restaurant. Star Alan Bagh seems to have trouble walking naturally in certain scenes.\n\nThe film pushes a green agenda but never really offers a convincing explanation for the bird attacks, and they end as mysteriously as they began. The film spends a full forty-five minutes on these character's mundane lives before the animals even attack, and when they finally do, it's some of the worst special effects I've ever seen. The computer generated birds hover without flapping their wings and make gull sounds when they are clearly eagles. The dialogue is curiously stilted and awkward, the actors seem to have no idea when scenes begin and end and the sound drops out almost continuously throughout the picture. But you'll laugh, loud and often and because of that, the legacy of \"Birdemic\" will always be secure. And to think, some filmmakers have to actually try to achieve that success.",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "James Nguyen has constructed the worst piece of cinema in history, and the final product shows that he has never been to film school, never studied films or how to make them for that matter, and it became a cluster F$#K of a movie, filled with cheap gags, the worst visuals on the face of the earth, stomach turning sound design, horrendous editing, and direction that makes absolutely no sense. With takes being reused over and over again and effects that could have been created by a kid in grade school learning after effects, \"Birdemic\" is THE WORST film I have ever seen and will ever see. The funny thing is, I hoped the entire time, that this film was a joke, but it is surely not. Let's just say that you must be extremely bored if you take the time to watch this thing.",
            "review_date": "2013-09-08",
            "source": "rt"
        },
        {
            "content": "Three words: What the Fuck?",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "If you've ever wondered how to use household objects to defeat immobile yet blood-lusting birds, watch this movie.",
            "review_date": "2013-08-26",
            "source": "rt"
        },
        {
            "content": "Shock is when you realize the movie was made in 2008. Terror, when you start to comprehend it.",
            "review_date": "2013-08-24",
            "source": "rt"
        },
        {
            "content": "Best movie ever created",
            "review_date": "2013-08-24",
            "source": "rt"
        },
        {
            "content": "if you though the Room was awfully great, wait till you see this Masterpiece-of-Shit.\nits got all the problems that the Room has and more! Just look at he cover. Does it look like its going too attempt to be good?",
            "review_date": "2013-08-20",
            "source": "rt"
        },
        {
            "content": "The dutch angle at the beginning of the film will force your head to stick in a quizzical angle for the entire hour and a half.",
            "review_date": "2013-08-18",
            "source": "rt"
        },
        {
            "content": "So bad it is hilarious",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "The biggest pile of bird poo you'll ever watch.\nDon't waste your time on this.\n1/10",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "So bad, that it is one of the rare gems of cinema.",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "It's a cinematic mess for the history books and its unbridled ineptitude does have its charm, but said charm wears quickly. In the end, it's a painfully boring train wreck that has to be seen to truly be believed.",
            "review_date": "2013-07-18",
            "source": "rt"
        },
        {
            "content": "I think I've found a film worse than the 2007 atrocity Knock Knock....\nI literally think there were just cardboard cut outs talking instead of actors, and, not exaggerating, I've seen better special effects in amateur youtube videos.\nThis film is, well, bird sh*t.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "Probably one of the worst movies I HAVE EVER SEEN. IT GETS WORSE THE MORE I THINK ABOUT IT. UGH.",
            "review_date": "2013-07-05",
            "source": "rt"
        },
        {
            "content": "This has awfulness to the EXTREME!!!!! The acting is very very baaaaaddddd, wooden and stoned. The story is non-existent, it has many pointless scenes that the director mistooked for character development, the music is boring, and the effects are some of the worst seen in recent years, even the Nintendo 64 generates much better birds. This is awfulness at its best, and its horrible just to think this exist and was actually made by humans! But, i would lie if i say it wasn't fun to watch. Watching its level of badness is a great timewaster and has something loveable about it...whatever it could be it makes the movie more a fun ride than an awful experience, which it is.",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "Horrible audio, god awful effects, and a complete lack of L-cuts.",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "A movie that is so awful its funny, you can almost feel that this is really the story of how James Nguyen decided to spend $10,000 and has a charm that only rarely have I seen matched.",
            "review_date": "2013-06-25",
            "source": "rt"
        },
        {
            "content": "Hanging out with my family... Having ourselves a party!",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "This seems to be the heart and soul of a guy who needed to go back Intro to *insert anything to do with film*. Perhaps a new Ed Wood is among us but one that might be oddly appreciated. However, there is something about a film that brings people together to laugh and enjoy their time watching it that has to be given some noteworthy respect. Boos and kudos to you James Nguyen for the latest addition to the horrible-cult-classic genre no one means to get in but can still make bank.",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "An education in how not to make a film, everything is hilariously mediocre. \nFrom the stuttering pans, the titles, the overly long opening credits, the editing and the wooden acting, and that's only in the first seven minutes. Cue the SFX and... 0_0.\n5 stars for the gargantuan amount of laughs I had along with the lessons learned.",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "I... I can't stop laughing. This is the absolute worst piece of crap film ever made. And you need to watch it. Yes. Need. This is a film that will blow your mind. You will be a better person having seen it. It's on netflix. Take the time. Watch Birdemic.",
            "review_date": "2013-05-06",
            "source": "rt"
        },
        {
            "content": "Birdemic is just bad acting, bad cinematography, and bad everything else. The movie is flawed in every way possible, and sadly I can't give it a worse rating than half a star. Save an hour and a half of your life by burning this movie.",
            "review_date": "2013-05-05",
            "source": "rt"
        },
        {
            "content": "Holy crap, this is a piece of crap. Ever heard of a sound editor or camera operator? \n\nNope? Didn't think so.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "I don't think this was a legitimate attempt to make a good movie.  It screams out \"big fat fake\" every step of the way.  So, it's not in the same league as 'The Room', 'Troll 2' or 'Samurai Cop'.  It's basically unwatchable, however, there are some sweet moments, so that saves it from getting only a half star.",
            "review_date": "2013-04-25",
            "source": "rt"
        },
        {
            "content": "The quarter star is what the actual film deserves. But, the film is so terrible, it is brilliantly laughable. I could never watch this by myself, only with friends. And we just love how everything is terrible. It is filled with terrible acting, dialogue, scenes, characters, effects, but that makes it all so memorable.\nI am actually really looking forward to the sequel, because this is my favourite worst film of all time. My most hated film of all time though is Manos: Hands of Fate. My friends find it funny, but I can't stand it. Birdemic feels like The Godfather compared to Manos: Hands of Fate.",
            "review_date": "2013-04-16",
            "source": "rt"
        },
        {
            "content": "It was much better than \"Cats\".  I'm going to see it again and again.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "This film not only exceeds expectations as a cult classic remake of Arnold Hitchcock's famed movie film in theatres, Le Birds Extreme, but sets new grounds for acting, romance, thrills, terror shocks and especially special effects. The acting from well-known actors such as Zoya Bikkibokkoocoggidubbinuwwubnus and Billy 'You're-gonna-sell-me-some-gas\" Man (as well as a cameo as Daniel Day-Lewis at Nat's mom) excels in almost every respect. The romance rivals that of Passion of the Christ 3: Passion Levels Critical, the thrills that of When Harry Met Sally 2: More Harry, More Sally and the horror that of the hit 1990 horror classic Big Momma's House 3, Like Father Like Son. The issues dealing with global warming are certainly subtle, yet completely valid, relevant and make sense to our modern world generation of people. To miss this underrated gem of motion picture would not only be a sin against America and what it stands for, but also to yourself. If you don't see this movie, we won't be angry, just disappointed. And remember, a day without Birdemic is a day wasted.\n- Gerald Butler (CEO of NCT Software)",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "This was hilarious to watch, but a seriously terrible movie. The CGI, wait... this isn't even CGI. They just took gifs of birds and then put them on the film.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "A movie so bad, it's fun.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "It's so bad that it is comical. I couldn't help but laugh at the terrible editing in the restaurant where they tried to cover up the background voices but it kept cutting off the woman who was talking in the foreground. This scene isn't even the worst of them all, it's just the one that happened to crack me the hell up.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "For a movie to be low-budgeted, I do admit it does a decent effort (if it were $20 million I would've lambasted the budget), though the CGI of the birds was clearly poorly done and unnecessary. The acting isn't too good, either.",
            "review_date": "2013-04-01",
            "source": "rt"
        },
        {
            "content": "Horrible but fun to watch with friends",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "I am so glad that I was informed of this wonderful movie! It is probably the single best movie to ever grace the earth. This director was able to invoke so many emotions within me. From the lovely, artful opening I could already tell this film was going to be special. The special effects were stunning and a feast for the eyes. They were able to terrify to such extent I had to hide under my desk! The budget for this film must have been very high to afford such great effects! When I heard they are making a sequel I was overjoyed and delighted! Since the actors did such a fantastic job! Their scripts were so realistic! The dialog was fluent and was ever enhanced the fabulous camerawork! You sense a real spark between the actors in this movie! Also, at times it seems that the plot was getting too thick! There was such intricate detailing in the plot that it was a pleasure to watch! If you are looking for an educational film that is loaded with great humor and sexy, seductive scenes, this movie is for you!",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "Worst/greatest thing ever made",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "I wasn't sure there was such thing as a horrible movie...then I watched birdemic.",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "A film so boring, so inept, and so ludicrous, it defies everything I've come to know and love about cinema.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "The director, cast, and sound editor should all be fed to the birds.",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "Hahaha this movie is a joke",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "It has a tiniest sliver of redeeming value for a filmmaker/editor, as an exercise to spot everything that is done wrong.  Unfortunately it is just too boring to be \"so bad it's good\".  Stick to laughing at the trailer and short clips on YouTube, actually watching this debacle from start to finish is just a chore.",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "As a person who loves bad films, I can honestly say I hated this.  It was terrible, but not in a campy or fun way. There was nothing charming or entertaining about it. Watching this trash gave me a headache, and I wish I could have that stretch of life back. There is nothing redeeming about it. Please, save yourselves. Do not see this movie.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "So bad one of the best bad movies",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Well, I'm not counting this in my Super Scary Spring, but it sure is scary. Just not for the right reasons.\r\n\r\nHey, have you ever wanted to see a remake of The Birds? No? Well just imagine, take out the great direction and memorable characters and what do you get? You get Birdemic, a film that's so bad, you almost expect that it was made by birds.\r\n\r\nThe story surrounds a....do I even need to tell you? This is Manos bad. In fact, it may be even worse. But in all seriousness it's about a couple who visit Northern California on vacation. But guess what? There are birds attacking! Did they not see the title? That should have been their first warning.\r\n\r\nThe acting is just awful. How bad? Well, compared to Birdemic, Tommy Wiseau gets an Oscar. Oh yeah, I said that! The acting really is just awkward. People don't speak or walk like a normal person would.\r\n\r\nThe film in a nutshell is the modern B-Movie. But where other B-Movies could be liked due to the classic feel of 50s cheese, Birdemic comes off as dull. If they had set this in the 50s and thrown in some jokes, Birdemic could be called a comedy classic. Sadly, that's not the case.\r\n\r\nI know this review is very brief, but there's just nothing more to say. It's an awful film with awful acting. So yeah, don't watch it. And, just think, they're working on a Birdemic 2. I'll be back with that when it comes around.\r\n\r\nBut if it's so bad, why does it get a 20% you may ask. Well I've got 2, and they don't have to do with the film itself, or at least not much. One is the Rifftrax on it which is great. The other reason is the great review from Phelous.\r\n\r\nSo, unless you have Rifftrax, don't watch Birdemic under any circumstance.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "There are bad movies.  Then there are BAD movies.  I really don't know where to start.  First the story (if there is one) is about a software salesman and model who meet and later (much later) gets attacked by birds.  So much for originality.  Every aspect of this movie is bad.  Writing, acting, directing, editing, photography and special effects.  The movie never builds its premise and is filled with illogical and ridiculous scenes.  The Filmmakers failed to do research with anything remotely plausible.  It's an example of not having a clue on what they are doing.  \"Bird\" follows every pattern that hurts indie movies.  I respect their ambition but that's a poor substitute for talent.  At a budget of 10,000 I'm confused on where the money went.  If you love BAD movies, then be my guest.  My suggestion to the people who made this movie?  Go learn how to make a movie.",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "This is so bad is never ceases to amaze.\nthe key to success of making a cult classic is not trying to make one\nthis has to be seen to be believed. the best part is that the \"shock and terror\" part of the movie doesn't even come in until halfway!\nTHATS ALMOST AN HOUR OF AMAZINGLY BAD ACTING COMBINED WITH CELL PHONE CAMERA PARTS!\n(ps, it's best enjoyed at late night/early morning with friends)",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "This movie is bad, just straight up bad! As a film student this movie made me angry with its horribleness, I have seen B movies, even C movies that are bad but they at least know that they are on little to no budget  so they work around their cheapness.The worst part about it is that it was trying to take itself serious. On top of its bad sound, cardboard actors, and over all terrible \"plot\", it is preachy as FECK, and its not a subtle preachy, its right in your face and so, so, SO arrogant. Basically says, if you are human and don't drive a hybrid car, your evil! I would like to thank the \"director\" for making a good \"How not to make a movie\" guide. This is a good movie to rift away at although it dose a pretty good job at making fun of itself.",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "This might just be Nguyens magnum opus",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Birdemic gets one star because it made me laugh, but no more because its probably the worst movie ever made. I think it's safe to say that Birdemic is worst than trolls 2. If you want a movie to make fun of, then watch Birdemic. If you're looking for a quality movie then keep on walking...oh and the birds are animated gifs by the way...so yeah...",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "some of the worst editing I have ever seen in a movie. Birdemic makes The Room look like The Kings Speech.",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "The SECOND best bad movie of all time. The Room still reigns supreme.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "Do not put yourself through this.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "It's so bad that it's good, but it still gets a bad rating.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "James Nguyen, the self-proclaimed \"Master of Romantic Thrillers,\" delivers the most shocking(ly hilarious) creature feature of all-time! The residents of Half Moon Bay are inexplicably attacked by a pack of bloodthirsty birds, and it is up to a software salesman and his fashion model girlfriend to defeat the birds and save the day! BIRDEMIC is perfectly terrible in every way. Not since the days of Ed Wood has a filmmaker shown more inadequacy or more unachievable ambition. Had James Nguyen staged the entire production as an elaborate joke, he may have been considered a complete genius, but instead, he may now be regarded as one of the single worst directors of all-time. Nguyen puts together the most talentless cast since TROLL 2, and edits their atrocious dialog together using jarring cuts and awkward pauses. He holds on the most trivial shots for absurd amounts of time. What is worse, the audience is forced to suffer through forty-five minutes of painful character development before the birds finally arrive. But then... BIRDEMIC!\n\nThe onset of the attack is so sudden and unprovoked it simply boggles the mind. Most of the attacks consist of horrendous computerized birds flapping in place and squawking incessantly, while others simply dive bomb into cars and gas stations and explode for no reason at all. And then, when all seems lost, the birds just leave and its over. Now, this may sound ridiculous enough on paper, but seeing is believing. The action sequences are so unbelievably awful that they make for non-stop entertainment. The problem is that they are so repetitive and so incredibly unskilled that an hour and a half feels like an eternity.\n\nBIRDEMIC single-handedly sets the green movement back twenty years with its failed ecological message, but in doing so, it establishes itself as the newest cult-classic of bad film. James Nguyen's complete incompetence allows for pure, unintentional humor that could never have been written better. As far as B-movies go, BIRDEMIC is a masterpiece. \n\n-Carl Manes\nI Like Horror Movies",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "A masterpiece of awful filmmaking, Birdemic is an unforgettable experience. It fails in nearly every way, and never stops proving how utterly inept it is. See this one folks. Its an experience.",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "Hard to get through.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "What a joke. Sound editing is a nightmare, acting is about porn star level, and i've seen better effects on youtube. Also the idea was even ripped off of Alfred's \"The Birds\". I do not care if Nguyen is a \"legendary\" director or not, this film is garbage.",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "Amazing movie!! Get your friends together and watch this amazing flick!!! Cult classic!!!!",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "So incredibly bad that it's good. The pace and length are close to unbearable. Otherwise exemplary b-movie. Recommended to be played at 2x speed.",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "I don't think we made it past the thirty minute mark and skimmed through it to see the terrible effects. This is one of those movies that are so bad that it isn't even entertaining in the slightest and is actually pretty painful. Scenes go on too long, the soundtrack is crap, the acting deserves better for a character named Rod, and above all the sound design is horrendous. You can hear the difference in audio every time there is a different shot. I am perplexed at how this was released in any capacity but I would like to think that there are many similar and terrible direct to movies. Calling this the worst is like calling the only mentally handicapped kid that you ever encountered the stupidest person in the world. This is bad and unbearable but I really am more amazed that people are trying to delude themselves into thinking it is some kind of good bad movie as a lot of hipster wannabes tend to do.",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "This movie is so bad it's good",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "Worth a full viewing. And possibly a second viewing with commentary. But not for a few weeks, Aaron.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "This movie is so bad it's good",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Best movie ever its a must see the acting is superb",
            "review_date": "2013-01-21",
            "source": "rt"
        },
        {
            "content": "Terribly enjoyable..... but that doesn't stop it from getting a half star rating. It's still terrible.",
            "review_date": "2013-01-19",
            "source": "rt"
        },
        {
            "content": "This is the most mind blowing work of art I've ever had the chance to witness. Birdemic: Shock and Terror is masterfully crafted with its fantastically convincing acting, a highly original music score (courtesy of Smartsound Software), and incredibly innovative special effects. The birds were quite possibly the most terrifying things I've ever seen and I was on the edge of my seat the whole time. Director James Nguyen is truly the self proclaimed master of the romantic thriller, and I pity anyone who is unfortunate enough not to see this masterpiece of modern culture.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "Wow!  Just wow.  This film is an endurance test.  It is indescribably bad.  Fun can be had with how howlingly awful it is, but even still the laughs come few and far between.",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "The lack of any sort of skill in sound and film editing and acting in general makes this film truly appalling. Nice eagles however...",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "So Bad it deserves a rating of three and a half. The actors are so bland its like watching stiff robots trying to act in a Shakespearian play. The main character is the worst actor in the whole movie, Even a cardboard cut out is less stiff and bland. \n\nEver feel like you don't get to see enough of the main characters life in a movie? Well Birdemic may be your favourite movie. You see every single thing he does such as going to the gas station, going to watch \"an inconvenient truth\" in the cinema and even answering the door to a solar panel sales man and discussing where to put the solar panels on his house\n\nThis is a movie you get when you go to stay the night with a friend or bunch of friends. You will be either making jokes about it or just laughing at the horribly acted bird on man fight scenes. If i look at the movie seriously and try watch it without jokes it would be the worst movie i have ever seen, but i cant do that. Its just so funny. I title it \"The best worst movie ever made\" and yes, that even beats Troll 2\n\nThis deserves to go under the comedy genre.",
            "review_date": "2012-12-24",
            "source": "rt"
        },
        {
            "content": "this movie was so well made i orgasmed",
            "review_date": "2012-12-19",
            "source": "rt"
        },
        {
            "content": "I'm all for independent films. Don't get me wrong; however this film goes overboard. Seriously. I have never watched such a laughable film in my time on Earth. Now if you haven't read my 'Camp Blood' review, then go give it a read. In the review, I called the film \"the worst film of all time\". I have changed my mind. Painfully bad acting. The audio is out of sync, and I'm not even joking there. To call James Nguyen a 'visionary' is a crime to cinema. If you are an independent film maker, then that's fine; but if you make a film like this, I would suggest you stop there. Sorry for such a short review. The film is shit in general.",
            "review_date": "2012-12-16",
            "source": "rt"
        },
        {
            "content": "Truly the worst made film I have ever seen. It's made with the filmmaking expertise of a 5 year old on an iPhone camera - if that five year old was exceptionally bad at making movies. Then again, because of it's downright awfulness, it's actually a joy to watch if you're in the right mood and with the right company.",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "This movie was almost too painful to watch from start to finish.",
            "review_date": "2012-12-08",
            "source": "rt"
        },
        {
            "content": "Fantastic film. The artistic quality is unspeakably high, and it offers valuable life lessons to all watching. I saw this film first in my car on vacation. I found it relatable when I watched in my car. After all, it IS a plug-in hybrid.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "The best phrase to describe this movie is \"sheer, unadulterated, incompetance\". This sad little \"romantic thriller\" fails to be romantic or thrilling, instead its unintentionally hilarious in just how inept the people behind this movie are. With acting that makes even Tommy Wiseau look Oscar worthy, a hacked up editing job, and special effect so indescribably bad that they must be seen to be believed. I definitely recommend this to be watched on Netflix, in a group, you'll have the time of your lives!",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "But we all know this should be a 5.",
            "review_date": "2012-12-06",
            "source": "rt"
        },
        {
            "content": "There's no other rating I can give it that would be suited than a perfect 10. One of those films that just leaves your jaw dropping constantly, although this may be in a different way than others.",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "As a movie, this is horrible, as entertainment...ummmm....well, if you enjoy WTF moments, this movie maybe for you.  I had a good laugh and watched it all the way through, but if you're looking for a good movie, look elsewhere, like the complete opposite side of wherever you are now.  This is like watching a home movie, or some horrible movie someone made in high school.",
            "review_date": "2012-12-03",
            "source": "rt"
        },
        {
            "content": "Okej. Det här är utan tvekan en av de sämsta filmerna jag någonsin sett. Hela presentationen, utförandet och storyn andas primitivt skolfilmsprojekt, och då är jag ändå väldigt generös. För det här är inte bra. Inte någonstans. Bitvis är filmen så absurd att det blir komiskt, men majoriteten av tiden är den bara pinsamt usel. Dock kan man säga att det är en film i alla fall. Till skillnad från \"Pool Boy 2\" (som jag för övrigt inte ens har sänkt mig till att recensera) Alltid något ...",
            "review_date": "2012-11-26",
            "source": "rt"
        },
        {
            "content": "This movie was so bad that, my cat died when watching it (he loves birds). I know it was a little funny, but that doesn't make up for hoe bad it is! STAY AWAY!",
            "review_date": "2012-11-19",
            "source": "rt"
        },
        {
            "content": "It has to be seen to be beleived. Takes everything you know about how bad movies can be and obliterates it; transcending ineptitude to point of fascination.  Move over Troll 2.",
            "review_date": "2012-11-19",
            "source": "rt"
        },
        {
            "content": "Definitely not made by a human.",
            "review_date": "2012-11-13",
            "source": "rt"
        },
        {
            "content": "This movie is stupid and ridiculous but it is extremely funny because it is so bad that it is one of the best movies I have ever seen.  It's so terrible that it's epic.",
            "review_date": "2012-11-13",
            "source": "rt"
        },
        {
            "content": "This one star, is because this is a film that's so bad it's funny! From the consitantly amazing audio track which cuts in and out with every line to the oscar winning acting employing the technique of not being able to act to the ground breaking visual effects giving some roughly composited clip art birds some employment. This is the Best Worst Film EVER. If you want to laugh to know end, and see something ridiculous, this is the film for you! 1/5. Despite it's awfulness, I recommend you watch it, but it's so freaking hilarious",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "Hilariously Bad lol and the plug in hybrid thing was just terrible fun",
            "review_date": "2012-11-08",
            "source": "rt"
        },
        {
            "content": "Oh my. This movie is just so bad it's funny. I had moments where I laughed so hard, I almost died. If you get your comedy from horrible movies, then I recommend you check this out.",
            "review_date": "2012-11-06",
            "source": "rt"
        },
        {
            "content": "Most amazing movie ever. Those birds, the acting....oh my",
            "review_date": "2012-11-06",
            "source": "rt"
        },
        {
            "content": "The way this director is able to maintain such a solid character development during the first emotive half of the movie is incredible. The actors are able to perform far beyond any expectation as well.\n\nThen, during the action-packed second half, we can't help but to be shocked and fortified by such convincing visual effects and well-planned scenes when the birds come into play.\n\nAnd at the end, we've got the finest ending to a movie ever written; whose final objective is to make us all realize how important is to save our enviro--\n\nJust joking, this movie is shit. Nobody should watch it.",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "Horrible. \"Birdemic: Shock And Terror\" is truly a terrible film. Filled with bad acting, bad filmmaking, and bad sound engineering, one can only laugh at how poorly this film was made.",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "my favorite terrible movie of all time",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "Just when I think I've seen all of the worst films ever made, along comes something like Birdemic: Shock and Terror that continuously surprises and disgusts me. It's absolutely stuffed with the worst possible mistakes you could ever make when making a movie, especially these days. It was apparently made by a stock broker/software designer who decided to make a movie. Lots of incredibly bad special effects, horrible dialogue, horrible actors, horrible story, etc. Everything is, well, horrible. It's unintentionally funny quite a bit, which is why the recent Rifftrax presentation of it went over so well. They really did a number on it.",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "OOOOH it's bad! Rifftrax made it enjoyable but yikes, i don't need to explain myself over this rating.",
            "review_date": "2012-10-26",
            "source": "rt"
        },
        {
            "content": "It's almost pointless to criticize Birdemic because every single aspect of it is so cringe-worryingly terrible, I wondered how the director was able to watch the dailies without shooting himself. It may go down as the single worst movie I've ever seen.",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "Oh, dear God what did I just watch?!?! Worst horror movie ever made, or a hilariously unintentional comedy? This film is sublime. I don't think any other director could handle the film with such dutiful seriousness, while the audience is trying desperately to suppress their giggles. I've never seen faker CGI birds, nor shallower performances, nor shakier camera work. Only Whitney Moore gives what could be considered a 2-D performance. You really have to see to believe on this one. And I promise, you will not be disappointed.",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "The fact that this movie is not 0% is astounding. It is by far the biggest hunk of shit I have ever seen. if it wasn't for Rifftrax this movie would be completely worthless as it doesn't even have the likeability of Torgo in Manos the Hands of Fate.",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "The Room + The Birds = win",
            "review_date": "2012-10-23",
            "source": "rt"
        },
        {
            "content": "This movie, from the wooden acting to the poor visual effects and awful audio editing, is the definition of campy. It is simply amazing in it's badness!",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "On a scale of 1 to 10 this is by far the worst movie ever... Honestly why would anyone produce a movie like this? Do they not watch the completed product before releasing it to the public to see how it turned out? If they had then they probably would have seen what a complete waste of time and effort it was making this movie, I had to FORCE myself to sit through this movie, The only good thing about this movie is that its quite funny due to how damn horrible it is. TO BE HONEST WORDS CAN'T DESCRIBE HOW ABHORRENT THIS MOVIE IS.\n\nSave an hour and thirty minutes of your life and do something productive and read the story. The story is actually pretty good, I enjoyed it. \"The Birds\" by Daphne du Maurier.",
            "review_date": "2012-10-20",
            "source": "rt"
        },
        {
            "content": "This film is strictly for the birds.",
            "review_date": "2012-10-19",
            "source": "rt"
        },
        {
            "content": "This movie is not even deserving of half a star. It is one of the worst movies I have ever seen. There is not a single redeemable quality about this hunk of crap. I just wanted it to end but it kept going. Longest 93 minutes of my life.",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "Birdemic is an awful, boring, low-budget, badly directed, atrociously edited, terribly written, horrifically paced, romance/thriller with awful special effects, wooden acting, the worst sound editing I have ever witnessed, and very few unintentionally hilarious moments. I decided to watch this with four friends; thinking that it would be laughably bad. We ended up talking throughout most of the movie, since it wasn't very entertaining. The movie was full of awful cuts, moronic edits, poorly delivered lines and ridiculous special effects, but it was rarely extremely entertaining or laughably bad. It was just bad. The male lead was awful, while the female lead was passable. They had absolutely no chemistry, but it was never really entertaining to watch them together. Yes, their delivery was wooden, and they read some of the worst dialogue I have ever heard, but it just wasn't enjoyable to watch. It was just dumb. The birds were all horribly animated, and there was even a scene where the birds just stayed in one place while the actors tried to fend them off. The scene was absolutely ridiculous; it wasn't exciting or scary, but it wasn't entertaining either. It was just dumb.\nThe movie also attempts to support environmentalism, but the attempt is heavy-handed and too poorly executed to be taken seriously. The main characters talk about \"An Inconvenient Truth\" while walking to their cars. They later randomly run into a scientist that explains that people, not the birds, are to blame for the birdemic.\n\nThere were a few entertaining moments, but overall, Birdemic isn't worth anyone's time. It's not particularly fun to watch, and it's just an awful movie. I'll give it a 2/10 simply because it did occasionally make me laugh due to the inane nonsense I saw on screen. This is not so bad it's good. This is just bad.\n\nOh yeah, and some birds actually exploded.",
            "review_date": "2012-09-30",
            "source": "rt"
        },
        {
            "content": "this film is awesome",
            "review_date": "2012-09-10",
            "source": "rt"
        },
        {
            "content": "This movie had me laughing more than most comedies.  The plot, the acting, the camera work...oh my!!",
            "review_date": "2012-09-08",
            "source": "rt"
        },
        {
            "content": "So incredibly terrible that it's hilarious. The first half is unintentionally comedy gold. By the second half, though, it gets tiring and repetitive.",
            "review_date": "2012-09-05",
            "source": "rt"
        },
        {
            "content": "The half star is for making me laugh a couple of times because of the stiff acting and the atrocious special effects.  The rest is very difficult to get through.  One of the worst movies I've ever seen.  Worse than The Room.  Worse than Troll 2.  Worse than Plan 9.  Worse than Manos: The Hands of Fate... well, maybe on par with Manos.",
            "review_date": "2012-08-26",
            "source": "rt"
        },
        {
            "content": "Skips just being a bad movie, goes past so bad it's funny, and becomes so bad it's bad. If you don't understand maybe you have to watch the movie for yourself.",
            "review_date": "2012-08-24",
            "source": "rt"
        },
        {
            "content": "I can sum it up all in one paragraph. You all said Birdemic was a so bad its good movie but its a so bad its not good movie. Why? I MEAN COME ON! Awul Sound Editing And Sound Effects, Wooden Acting, Misleading Script, Hilarious Visual Effects, Horrible music, Terrible Characters, Not Scary, Not Funny, Inconsistant Stoyline, Coat Hangers, Flash Birds, Laughable Lines, Terrible Dialoge, Bad Actors, Tiresome Running Time and Crappy All Along Birdemic is Watchable, but not that good.\n\n47/100 C-",
            "review_date": "2012-08-23",
            "source": "rt"
        },
        {
            "content": "still worth watching for its own reasons",
            "review_date": "2012-08-22",
            "source": "rt"
        },
        {
            "content": "Some movies are so bad they're good, this movie is just bad.",
            "review_date": "2012-08-19",
            "source": "rt"
        },
        {
            "content": "Birdemic makes The Room look like Citizen Kane. It's actually almost impressive how bad this movie is in every way. It looks like a high school film project, but with worse acting, sound, and writing. Not as funny as I hoped, but the CGI birds that look like an early 90s GIF were good for a quick laugh.",
            "review_date": "2012-08-19",
            "source": "rt"
        },
        {
            "content": "The worst movie I've every seen! But everyone MUST see this movie. It is horribly HILARIOUS!!!",
            "review_date": "2012-08-18",
            "source": "rt"
        },
        {
            "content": "/F/ An absolute gem. Watch it on Netflix, you will not be disappointed.",
            "review_date": "2012-08-18",
            "source": "rt"
        },
        {
            "content": "I guess this movie is the worst on all world and I can't believe that this has a sequel... God!",
            "review_date": "2012-08-15",
            "source": "rt"
        },
        {
            "content": "One of the best movies of our time. Second only to The Room. The environmental message was sound and well thought out. Can't wait to see this on the big screen.",
            "review_date": "2012-08-15",
            "source": "rt"
        },
        {
            "content": "Excuse the language, WTF was this. terrible. the audio and camera work sucks. was this script written on the fly.  the entire script sounds robotic. and there are scenes that are just thrown in for the hell of it...god waste of my life. there is a reason people suggest to drink alcohol while watching this film",
            "review_date": "2012-08-14",
            "source": "rt"
        },
        {
            "content": "One of the worst movies off all time, but with rifftrax it's one of the funniest movies.\nIMAGINE PEACE",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "Probably the greatest movie ever made. If only it was quotable as the Room.",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "Quite simply, it is by far the worst movie I have ever seen. I had to watch it in increments, it was so bad. And I could forgive them if they were making it as a joke, but as anyone whose seen James Nguyen's interview, we know that it was actually intended to be taken seriously. Where to begin? The editing is absolutely horrendous; it's so bad that at times it looks like they were TRYING to make it seem and look uncomfortable and awkward. The acting is completely non-existant, and I found that my favorite actor in this movie was Nathalie's mother, who is in less than ten minutes of it, and I'm convinced she was told that she was simply being interviewed, and was unaware she was in an actual movie. The CGI (or should I say GIF) birds are by far the crown jewel of poor editing, they've only got one sound effect, they constantly loop that over, they look about as real as a three dollar bill, they explode on contact, and vomit acid. For absolutely no real reason. The story is not only unfocussed, it's confused. What is it? Is it a romantic comedy? Is it an end of the world thriller? Is it an environmental film? It's all over the place, has no rhyme or reason, no idea what it's doing, and unsurprisingly can do none of these things. The dialogue is forced, annoying, and completely un engaging. And perhaps most annoying of all is the director's decision to linger on scenes that have no meaning, no purpose, and no impact on either the story, or the audience. And most confusingly of all, the ending. WHAT HAPPENED THERE!? I have no idea what happened, and no idea why they took so long to role those blessed credits. I reserve special criticism for it's constant focus on global warming being the cause of the bird attack, when clearly this movie doesn't know what global warming is. The hippie who lives in the woods, and the doctor on the bridge are the worst offenders, not only shelling out contrived eco-friendly jargon, but having ABSOLUTELY no damn clue what any of it even means. This is a movie so completely terrible and entirely wrong, that it is the single greatest example of how NOT to do a movie.",
            "review_date": "2012-08-10",
            "source": "rt"
        },
        {
            "content": "That half star is for all of the laughs this movie caused",
            "review_date": "2012-08-09",
            "source": "rt"
        },
        {
            "content": "Every once in a while a film is made that is so horrible you can't even laugh at it. It's just flat out crap and you are bored to death watching it. Ladies and Gentlemen I present, Birdemic.",
            "review_date": "2012-08-08",
            "source": "rt"
        },
        {
            "content": "The best worst movie ever.",
            "review_date": "2012-08-06",
            "source": "rt"
        },
        {
            "content": "\"Birdemic: Shock and Terror\" is mind-blowing! Usually bad movies are just boring action flicks that don't have any appeal, but James Nguyen's now cult hit film takes a different approach by giving it lots of appeal, ultimately making it a very enjoyable movie!",
            "review_date": "2012-08-06",
            "source": "rt"
        },
        {
            "content": "one of the worst pieces of shit i have ever layed my eyes on. It's just..........ugh",
            "review_date": "2012-07-28",
            "source": "rt"
        },
        {
            "content": "The worst possible movie ever made on celluoid. Yes, its worse than The Room. And funnier too! See this masterpiece...",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "Use Sony Vegas, you can make a lot more realistic film than this movie full of poor mediocre CG, incompetent, awful, stupid-ass \"acting\" and with a lack of a true story line.",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "This may be the worst thing ever........... ever!",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "Could be on the throne for worst ever all around. I think so.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "Usually when I get the idea to make a terrible movie, a friend steps in and stops me.  But apparently not everyone has that friend.",
            "review_date": "2012-07-14",
            "source": "rt"
        },
        {
            "content": "the greatest masterpiece the movie industry has to offer. The editing by far beats avatar in every aspect of cinematography. The acting is the best I have ever seen, everyone who was in this deserves 10 oscars. The writers wrote the most intelligent and breathtaking script this era has ever seen.",
            "review_date": "2012-07-13",
            "source": "rt"
        },
        {
            "content": "Awful. The acting is unspeakably bad, the editing looks like it was done by a comatose snail, and the sound is so perplexingly shoddy that I wouldn't be surprised if it was recorded with a Nokia. And don't even get me started on the birds. Oh my god, those fucking birds. The only redeeming thing about this film is its rich share of hilarious moments, mostly due to Nguyen's heavy-handed environmental preachiness.",
            "review_date": "2012-07-12",
            "source": "rt"
        },
        {
            "content": "Yes it's bad in a sense that the film seems to be ''amateurish'', but it's charm and of course the birds won me over.",
            "review_date": "2012-07-11",
            "source": "rt"
        },
        {
            "content": "Laughing, the  cutting makes this film.  the sound and late cuts mixed with awkward silences turn most scenes into funniness. The movie gets a little preachy with the global warming but i am starting to believe it was in jest. 3 speeches about the evil of polluting unfortunately we were all laughing so we couldnt get the details.",
            "review_date": "2012-07-10",
            "source": "rt"
        },
        {
            "content": "1/2 star, yes.  But this is a must-see for any climate deniers.  You'll see the kind of horror that climate change has driven people to.",
            "review_date": "2012-07-04",
            "source": "rt"
        },
        {
            "content": "The sound editing...worse that Felix the cat\nthe acting...worse than Troll 2\nthe script... worse than The Room\nthe CGI flames and birds...worse than the meatballs from the Langoliers\nthe superflous characters...I don't know anything to compare it with (maybe the Room again? Anyway, its worse)\nYou have to see it to believe it. I just survived it and I still don't believe it.\n(btw, its a great comedy at some moments)",
            "review_date": "2012-07-04",
            "source": "rt"
        },
        {
            "content": "what matters is that u tried",
            "review_date": "2012-06-30",
            "source": "rt"
        },
        {
            "content": "A \"so-bad-it's good\" 'thriller' with poor dialogue, terrible acting and the worst CG I've ever seen in a film. Hilarious!",
            "review_date": "2012-06-29",
            "source": "rt"
        },
        {
            "content": "How does this movie have ANY fresh rating?????",
            "review_date": "2012-06-27",
            "source": "rt"
        },
        {
            "content": "Amazing. Must be seen to be believed.",
            "review_date": "2012-06-27",
            "source": "rt"
        },
        {
            "content": "Wow.\nThis movie will change the way you see movies. I could go on but you must see it for yourself.",
            "review_date": "2012-06-21",
            "source": "rt"
        },
        {
            "content": "Greatest terrible film since The Room.",
            "review_date": "2012-06-20",
            "source": "rt"
        },
        {
            "content": "This movie is TERRIBLEâ?¦ but it's terrible in that amazing way that Plan 9 and The Giant Claw are terrible. Srsly just get a bunch of friends together watch this, tear it a new one and see if you don't end up loving this terrible/retarded/glorious mess of a movie too.",
            "review_date": "2012-06-15",
            "source": "rt"
        },
        {
            "content": "Be sure to keep your coat hangers handy at all times or else birds or global warming will end you by the end of the movie.",
            "review_date": "2012-06-12",
            "source": "rt"
        },
        {
            "content": "I gave it 4 stars because....well because of Nguyen's pure childlike sincerity.  Don't watch this one alone folks.  It's not that kinda movie.  I'd have to rank it right after Troll 2 and if you're into that kind of movie then you know this one is best enjoyed with lots of friends and possibly lots of beer.  Coathangers rock : )",
            "review_date": "2012-06-12",
            "source": "rt"
        },
        {
            "content": "AAAAAAAAAAAAHHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2012-05-31",
            "source": "rt"
        },
        {
            "content": "There's no other rating I can give it that would be suited than a perfect 10. One of those films that just leaves your jaw dropping constantly, although this may be in a different way than others.",
            "review_date": "2012-05-27",
            "source": "rt"
        },
        {
            "content": "This film has you laughing, crying and on the edge of your seat. It's a masterpiece, forget the Godfather BITCHEZZ",
            "review_date": "2012-05-26",
            "source": "rt"
        },
        {
            "content": "Started out hilariously awful, when the CGI birds came in it surprisingly became extremely, extremely dull. I give credit to anyone who can watch this film in its entirety.",
            "review_date": "2012-05-22",
            "source": "rt"
        },
        {
            "content": "I don't think we made it past the thirty minute mark and skimmed through it to see the terrible effects. This is one of those movies that are so bad that it isn't even entertaining in the slightest and is actually pretty painful. Scenes go on too long, the soundtrack is crap, the acting deserves better for a character named Rod, and above all the sound design is horrendous. You can hear the difference in audio every time there is a different shot. I am perplexed at how this was released in any capacity but I would like to think that there are many similar and terrible direct to movies. Calling this the worst is like calling the only mentally handicapped kid that you ever encountered the stupidest person in the world. This is bad and unbearable but I really am more amazed that people are trying to delude themselves into thinking it is some kind of good bad movie as a lot of hipster wannabes tend to do.",
            "review_date": "2012-05-21",
            "source": "rt"
        },
        {
            "content": "Epic! Must be seen to be believed.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "A film so incompetently done that it's an incredible and innovative little piece of work.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "Best worst film I have ever seen. I thought The Room or The Happening would be  the best worst film but oh no, those films are masterpieces compared to Birdemic. It is an absolute miracle of a film. Birdemic is so incompetent and so ungodly atrocious that it is an entity upon itself.  Horrendous effects, poor direction, wooden and bored acting, horrible editing, awkwardly and sloppily paced and ridiculously inconsistent throughout. The first part of the film is a boring as hell romance story, which takes up 45 MINUTES OF THE FILM. Holy crap. As I was watching this, I kept wondering if I was watching a different film altogether. Where are the killer birds? Why am I watching an extremely poorly acted romance film all of the sudden? Then the birds finally show up and are rendered in glorious Photoshop effects done by kindergarteners. From all the bad things I have mentioned about Birdemic and of course, fully deserves it, this film is hilarious and probably one of the funniest films I have ever seen. Watch it and be amazed at how ridiculously bad it is.",
            "review_date": "2012-05-10",
            "source": "rt"
        },
        {
            "content": "I know nothing about movie makeing but even on the level of just editing my lack of skills would do a better job.\n\nThis movie is bad...",
            "review_date": "2012-05-06",
            "source": "rt"
        },
        {
            "content": "What a peice of shit... just watch it for the lols.",
            "review_date": "2012-05-05",
            "source": "rt"
        },
        {
            "content": "So bad its hilarious. A perfect example of how not to make a movie",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "It's so awful that it's hilarious",
            "review_date": "2012-04-27",
            "source": "rt"
        },
        {
            "content": "Worst movie that you have to see. It's so bad, it's hilarious. I'll admit that I got pretty bored with the badness after awhile, and when the real crap hits the fan when the birds arrive, I was already uninvested in the movie. Some of the scenes are so incredibly drawn out that the hilarity from its horribleness wears away. Regardless, it is incredibly funny to watch, and you'll quote the movie with your friends for months. The stiff acting, awkward editing, uninspiring cinematography, nonexistent soundtracking, and MS Paint special effects make this movie possibly the best worst movie. Can't wait to see how the 3D sequel is gonna happen.",
            "review_date": "2012-04-26",
            "source": "rt"
        },
        {
            "content": "how does something this stupid get a higher rating than transformers 2? or even twilight? wth?!? only giving it half a star because i cant rate a 0",
            "review_date": "2012-04-15",
            "source": "rt"
        },
        {
            "content": "...wow. I mean, WOW. I have never seen a movie so incompetently made in my entire life (I also can't remember the last time I laughed so hard at a bad movie). THIS MUST BE SEEN BY ALL!",
            "review_date": "2012-04-15",
            "source": "rt"
        },
        {
            "content": "This movie was so bad, it was funny. Alan Bagh's acting is so monotone that it seems he's doing it on purpose. I will be one of the first in line for the sequel, but only because I want to see how badly they can screw it up.",
            "review_date": "2012-04-14",
            "source": "rt"
        },
        {
            "content": "VIOLENCE & GORE: 4/10 Crap action, guns, a few frightening images and some violence. A few graphical/bloody scenes.   SEX & NUDITY: 3/10 No sex or nudity, but plenty of cleavage and a long kissing scene   LANGUAGE & PROFANITY: 3/10 Minor profanity.   AGE: 10+",
            "review_date": "2012-04-09",
            "source": "rt"
        },
        {
            "content": "I might have overlooked the acting and lack of story, but I will not ignore being bashed over the head with the tree-hugging, anti-gas company scenes.",
            "review_date": "2012-04-02",
            "source": "rt"
        },
        {
            "content": "Yeah I laughed quite a bit during this, but I really felt kind of guilty about it. Unlike say The Room which sort of resembled an actual film kind of , where there was at least a pseudo competency to at least the technical side to make it amusingly terrible and self indulgent. This really seems like a total amateur high school level type filmmaking and its totally incompetent sincerity makes you feel sorry for the filmmakers. Get trashed and watch it and you'll laugh like crazy, but probably feel bad about it afterwards.",
            "review_date": "2012-03-30",
            "source": "rt"
        },
        {
            "content": "And you thought The Happening was a gut busting ecological horror flick, enter Birdemic with its computer video game birds that are some of the funniest worst special effects I have ever seen. Marvel at the horrible audio throughout and the bad Manos acting. Hell' this must be the Manos the hands of fate for our time. And also witness the delusions of the director Nguyen who actually thinks this movie is a serious drama. Quick somebody check him into a mental hospital.",
            "review_date": "2012-03-27",
            "source": "rt"
        },
        {
            "content": "James Nguyen is currently in talks to direct a movie starring Tommy Wiseau tentatively titled \"The Room: Shock and Terror!\" (If only...)",
            "review_date": "2012-03-26",
            "source": "rt"
        },
        {
            "content": "1/2 a star in a good way.  The movie's so bad that it's a must watch horror film--think Alfred Hitchcock's \"The Birds\" if it was awful",
            "review_date": "2012-03-26",
            "source": "rt"
        },
        {
            "content": "I loved this, so much. Imagine every single way a person could make a film wrong. Not only does this film fail in all those ways, it fails in ways you didn't even imagine. Spectacularly bad, right up there with the worst films ever made. But, there's fun to be had (admittedly, by mocking the film with your friends).",
            "review_date": "2012-03-24",
            "source": "rt"
        },
        {
            "content": "Words cannot describe the Birdemic: Shock and Terror. Bad movie afficiando's will have a field day with this.",
            "review_date": "2012-03-15",
            "source": "rt"
        },
        {
            "content": "Anybody who compares this \"movie\" to The Room, just gave Tommy Wiseau the world's biggest slap in the face",
            "review_date": "2012-03-12",
            "source": "rt"
        },
        {
            "content": "Hilariously bad movie.  If you're a fan of The Room then you need to see this!",
            "review_date": "2012-03-10",
            "source": "rt"
        },
        {
            "content": "This movie is among the great hilariously bad movies of all time. It is one of the funniest movies of all time and is indeed worth seeing.",
            "review_date": "2012-03-09",
            "source": "rt"
        },
        {
            "content": "This film is a modern gem. Anyone makes movies, professional or amateur will relate with this film. I laughed so hard I cried.",
            "review_date": "2012-03-07",
            "source": "rt"
        },
        {
            "content": "I'd consider giving this 5 stars if the guy who shot this was not serious. But it seems like he is. So this makes it officially the worst film I've ever seen.",
            "review_date": "2012-03-05",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies you will ever see!",
            "review_date": "2012-03-01",
            "source": "rt"
        },
        {
            "content": "The Bad Actors and Wannabe's of Hollywood have reformed and have collaborate on their most intense project. Birdemic is laughable and unbelievable bad. Nguyen is the Hitchcock of the \"So Bad, It's funny\" Market.",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "A hilariously bad movie that is only worth watching to get a laugh.",
            "review_date": "2012-02-15",
            "source": "rt"
        },
        {
            "content": "I did it.  Watched the whole movie from beginning to end.  Never stopped laughing or simply being in complete amazement at how unbelievably bad a movie can be made.  I can't even begin to put this thing into words!  Also, Whitney Moore :*",
            "review_date": "2012-02-06",
            "source": "rt"
        },
        {
            "content": "This might be the worst movie I have seen since the room. Unlike The Room, the production is amateur night. The sound cuts out a lot. The editing is beyond choppy. I can't tell if the movie is out of focus or if it's burry for being in low definition. The first 12 minutes of the movie is the protagonist driving, then walking to some random restaurant. Someone forgot to tell the actors that they should act. \n\nNearly 30 minutes in I am still waiting for the Birdemic to hit. All I've seen is driving, awkard conversations, and blabing about solar panels. There are some birds in some of  these shots, but its incidental.  I recommend this movie for anyone who doesn't feel appreciative about how well made rom-coms are.",
            "review_date": "2012-01-27",
            "source": "rt"
        },
        {
            "content": "Only a movie this bad could have scenes like the one where the main character says \"there's dead people on the side of the road!\" then when he walks over to the bodies yells \"they're dead!\" There are so many shots that last a full 30 seconds after everyone stopped talking, so the actors are just standing there doing nothing. The sound editing is hilariously bad, the volume of everyone's voices changes often and there are awkward silences whenever the camera cuts to a new shot. The birds don't move much, they just have a looped animation of their wings moving up and down. The disease the birds have is, in a creative twist, called \"bird flu virus.\" So bad it's funny, and so funny it hurts.",
            "review_date": "2012-01-25",
            "source": "rt"
        },
        {
            "content": "It takes a rare breed, say, a Tommy Wiseau, to bring us such a terrible and yet genuine film.  James Nguyen fills that role admirably...I mean, obviously the man has no business in directing films, and yet, at the same time, thank God he is!  \n\nLook, there is a difference between terrible GOOD and terrible BAD.  Terrible bad is when you create a movie that is so vile that it lacks any universal appeal; nothing can be called \"funny\" about it, and you cannot pull enjoyment from any aspect of its production.  A good example?  Take anything starring Tom Green or directed by Eli Roth; both would be terrible films, but its not because of a lack of budget, or direction (per say) but they commit some Original Sin of being either vile, offensive, or unwatchable for whatever reason.\n\nTerrible Good films are those that make an honest effort and just, well...fail; they are not intended to offend or play upon \"shock\" for the sake of itself...they are just laughable bad and, in some odd part of the mind for many, enjoyable in their badness.  Part of humor, after all, stems from the absurd, and films like Birdemic manage to fit that bill to a T!",
            "review_date": "2012-01-20",
            "source": "rt"
        },
        {
            "content": "Worst movie I've ever seen.  However,  I laughed so hard at how bad it was that I had tears streaming down. Great movie if you want to laugh at it's ridiculousness.",
            "review_date": "2012-01-14",
            "source": "rt"
        },
        {
            "content": "Birdemic is the work of a genuine artist.  Writer/director James Nguyen has made a film that embraces his love of HItchcock and environmental issues.  The only problem is that this artist has absolutely no talent.",
            "review_date": "2012-01-07",
            "source": "rt"
        },
        {
            "content": "This is the best movie i've ever seen",
            "review_date": "2012-01-06",
            "source": "rt"
        },
        {
            "content": "While it's not as \"good\" as \"The Room\", \"Birdemic\" is too entertainingly bad to truly hate. Which isn't to say it's good, of course.",
            "review_date": "2011-12-23",
            "source": "rt"
        },
        {
            "content": "The mere title ГѓВўBirdemic: Shock and TerrorГѓВўГ‚Вќ indicates that this will be one of the worst movies that you have ever seen; however, nothing can prepare you for something so awful in so many categories!  Amidst awful acting, laughable CGI effects, and an absurd storyline, I can confidently say that this is the most poorly edited film that I have ever seen.  Although it is marketed as a ГѓВўromantic thriller,ГѓВўГ‚Вќ Birdemic is actually a ГѓВўhilarious atrocity.ГѓВўГ‚Вќ  I feel very sorry for the actors who devoted 4 years of their lives to this weekend project.  I also feel sorry for the actors because they are simply awful, from the over-exuberant mother to the guy that delivers his lines like a robot.  I donГѓВў(TM)t know where this script came from and, although the ГѓВўactorsГѓВўГ‚Вќ have a horrific delivery of their lines, what are they supposed to do with classic lines such as ГѓВўHey look, a fishing rod!  I can catch some fish!  Oh look, a stove!  We can cook it.ГѓВўГ‚Вќ  And who could forget ГѓВўI'm not worried about the birds, they're not the dangerous animals. It's the human species that's the dangerous, terrifying animal.ГѓВўГ‚Вќ  Annnnnd letГѓВў(TM)s blame it all on global warming and give a 4-minute Public Service Announcement about global warming and its affect on the environment.  How about a side of anti-war sentiments to go along with that global warming entrГѓ (C)e?  While it attempts to educate its audience on global warming, the guy who lives in the woods eventually makes global warming look like a complete joke.  Mix all of this in with random remote control cars, extended scenes around a conference table with people clapping, and a bunch of statistics/prices that all conveniently begin with a one (i.e. a sale of $1 million, a buy-out of $1 billion, $100 for gas) and you have an unforgettable film.  LetГѓВў(TM)s not forget that nothing says ГѓВўpartyГѓВўГ‚Вќ like a random guy (sort of) rapping while the only two patrons of the restaurant do an awkward dance.  Worse than the script is the editing.  When the sound keeps cutting in and out, donГѓВў(TM)t bother checking your DVD player.  The movie is just THAT poorly edited.  They must have used a single camera to shoot the same scene several times at different angles because the ambient noise in the background is constantly changing.  Or sometimes simply becomes silence for extended static shots.  They also must have been too lazy to dub over dialogue when the background noise was too loud, as evidenced by the consistently lost lines anytime the actors are around traffic or in a restaurant.  On top of this, the editor includes lengthy, boring establishing shots (like extensive scenes driving around in a car and a long pan across the wall of a Vietnamese restaurant).  By the time that the same 4 bars of music repeats for the eighteenth time during the opening credits, youГѓВў(TM)ll know that you are in for a dismal experience.  I love how you find yourself halfway through the movie and the only reference to birds has been a very poorly made news cast.  And without transition, there are suddenly thousands of horribly animated CGI birds.  I donГѓВў(TM)t know which I enjoyed more ГѓВў\" the terrible CGI birds floating in the air or the awful CGI forest fire whose graphics (reminiscent of Sega Genesis) disappear before the camera cuts away from the scene.  I can talk about this movie forever but no words can properly prepare you for this train wreck.  Therefore, I shall conclude this review with a clip from ГѓВўBirdemicГѓВўГ‚Вќ that says it all:\nhttp://www.youtube.com/watch?v=LrxZblVUkMU\nIt may be helatiously bad, but it is an absolute joy to mock and I can't remember the last time that I laughed this hard.",
            "review_date": "2011-12-11",
            "source": "rt"
        },
        {
            "content": "This site is terrible, it doesn't give negative stars, which is the only thing appropriate for Birdemic.",
            "review_date": "2011-12-02",
            "source": "rt"
        },
        {
            "content": "the worst drama of all time, but among the greatest comedies",
            "review_date": "2011-11-17",
            "source": "rt"
        },
        {
            "content": "This film is probably one of the best worst movies I've seen.  The fluctuating audio levels, the artistic decision to have no audio at all at times.  The first 45 minutes that in no way drive the story forward.  I like the nod to 70's movies with the 5 minute scene of the protagonist just driving to work and the traffic on his way.  The scene in a club with a singer on stage just singing remonded me of 70's movies too.  But most of all this is a movie with a simple message: solar power, hybrid cars, global warming is bad, use of fossil fuels, the war in Iraq is bad, and imaginepeace.com.  It's that single, seven messages you should take away with you after watching this.",
            "review_date": "2011-11-09",
            "source": "rt"
        },
        {
            "content": "Let's say you took Tommy Wiseau and bashed him in the head with a hammer a few times. Then you give him a handheld camera and a script that a retarded squirrel wrote with his penis. It is absolutely INCONCEIVABLE that he wouldn't be able to make a better movie than \"Birdemic\".",
            "review_date": "2011-10-16",
            "source": "rt"
        },
        {
            "content": "I love so bad its good, but this movie is on a completely different playing field than movies like Troll 2 or the Room. This movie is so bad its still bad.",
            "review_date": "2011-10-12",
            "source": "rt"
        },
        {
            "content": "Literally the worst film I have ever seen in every category.  The writer/director has absolutely NO grasp on anything that happens in reality and it is absolutely hilarious!  All the characters are written as though they have mental deficiencies and the acting is perhaps the worst I have ever seen, with a remarkably unremarkable performance by the atrocious and rigid lead, Alan Bagh.  The writing and special effects are horrendous but I am thankful they make me laugh.  Absolutely nothing in the script/film works and maybe that's what makes this so beautiful.",
            "review_date": "2011-10-12",
            "source": "rt"
        },
        {
            "content": "An absolute masterpiece. You have never seen anything like this before, I can guarantee it. Unbelievable in every sense of the word. I really don't know where to even start with it.\n\nFirst, the acting is just amazing. Honestly, it makes the cast of 'Troll 2' look like Robert Redford, Dustin Hoffman and Daniel Day Lewis. Alan Bagh turns in what is without a doubt the best/worst performance of all time, and I say that with no reservations. Fortunately for everyone's enjoyment, every other cast member is equally horrific. An excellent twist of casting events is detailed on the back of the DVD, exclaiming 'Featuring a special appearance by Tippi Heddrin!!' I'm seriously not shitting you, this 'special appearance' is footage of her on the TV in the background of a scene. \n\nAnother thing is, of course, the special effects. To call them 'special effects' is actually disrespectful to special effects, because in place of effects are GIFs. It is so unreal that it really makes you question the reality we live in. \n\nThe direction and editing (particularly the sound editing) are other major points. It is simply a masterpiece of technical execution. The fact that this took Nguyen 4 years to produce this is mind-numbing. It seriously should have taken perhaps 4 weeks.\n\nAll of the horrible acting, execution and visual effects aside, the dialogue and story are what sell it. So may incredible moments... The dance scene at the bar, the boardroom scene, the hippie in the woods scene, the coat-hanger scene, and a plethora of others combine for a most memorable viewing experience. The ridiculously heavy handed message regarding global warming has done more harm than good for the cause I'm sure.\n\nI feel like I've done a crappy job reviewing this film, but if I can impose one thing, just do yourself a favor and see it. There is no way I can properly put into perspective the incredible horrificness of this movie. It is simply incredible. Incredible. I can not wait for 'Birdemic 2' in motherfucking 3D.",
            "review_date": "2011-10-10",
            "source": "rt"
        },
        {
            "content": "Words cannot describe how awful Birdemic: Shock and Terror really is. It's something you need to witness for yourself. At least Troll 2 had some sort of production value - this movie features laughable acting, terrible special effects, shockingly horrible audio and only remnants of an actual story. It's only redeeming quality is how jaw-droppingly bad it is. Why didn't I watch this with Rifftrax? Why?",
            "review_date": "2011-10-06",
            "source": "rt"
        },
        {
            "content": "The single worst movie ever made.",
            "review_date": "2011-10-01",
            "source": "rt"
        },
        {
            "content": "Worse than \"The Room\" and yet somehow more enjoyable.",
            "review_date": "2011-09-28",
            "source": "rt"
        },
        {
            "content": "It's so bad. No matter how much they swat at those birds, they can't seem to hit them. Hm. It's almost as if they weren't there at all. But this movie is a blast to make fun of. I'll give it that.",
            "review_date": "2011-09-27",
            "source": "rt"
        },
        {
            "content": "Well, I had a good run. This is the second, and most likely last Spoiler Alert: Dreadful movie ever. There will never be anything as terrible, or as great, as this movie. However, it is really sad, because apparently the director, James Nguyen, made this movie with the intention of it being a good movie. That's like the director of Scary Movie wanting people to take it very seriously. No, really, it's that bad. Allow me to elaborate...\r\n\r\nTo read the rest of my review, please visit:\r\n\r\nhttp://joawmeens.hubpages.com/_SADMovie/hub/Spoiler-Alert-Dreadful-The-SAD-Movie-Review-Birdemic",
            "review_date": "2011-09-21",
            "source": "rt"
        },
        {
            "content": "Poultry plot at best.",
            "review_date": "2011-09-17",
            "source": "rt"
        },
        {
            "content": "An incredible masterpiece which everyone must see in order to be somewhat prepared for the soon to be epic SEQUEL! In 3D!",
            "review_date": "2011-09-16",
            "source": "rt"
        },
        {
            "content": "A candidate for the worst film ever made. Every aspect of it is utterly terrible. You will laugh your socks off.",
            "review_date": "2011-09-14",
            "source": "rt"
        },
        {
            "content": "so.effing.bad.\n\nmight have been better if it weren't such an obvious attempt at being a hilariously bad movie. Actually.. Probably not. Don't even pirate this. Lol.",
            "review_date": "2011-09-11",
            "source": "rt"
        },
        {
            "content": "I honestly can't say whether or not there's anything enjoyable about this movie, because the quality of it was so poor that I couldn't sit through more than five minutes of it. It looks as though it was filmed on someone's decrepit handheld camcorder, and the sound is about at the same level. The acting is completely nonexistent, and I'm pretty sure the director just hired a bunch of morons on the street without knowing if they could actually act to begin with. Do not waste your time.",
            "review_date": "2011-09-02",
            "source": "rt"
        },
        {
            "content": "I have seen a lot of movies, and I really think this is the worst I have ever seen.  Yes, I've seen \"Manos:  The Hands of Fate,\" I've seen \"The Room,\" but those movies are so bad they are fun to laugh at.  This movie is just painful!  The script makes no sense, the special effects would have been better if made by 1st graders with crayons, and the acting!  Ugh!  Can you even call it acting?  Alan Bagh, where did they find him?  He can't even walk naturally!  Nothing is convincing with him, and he mumbles!  Also, he (and other actors) flub lines at times!  Why weren't they reshot?  This movie is just a complete mess!",
            "review_date": "2011-08-30",
            "source": "rt"
        },
        {
            "content": "Do you expect quality from a movie called Birdemic?  The acting is more wooden then wood, the effects are bafflingly bad, the sound editing is the worst in any thing ever, pointless shots are dragged on, and the plots ridiculous.  This movie is so bad it's good.  This is honestly one of the most unintentionally funny movies ever made.  No human being can which this with a straight face.  I could not possibly imagine what anyone apart of this movie was thinking.  The easiest way to describe this movie is Ferngully meets Alfred Hitchcock's The Birds.  This is something Ed Wood would make.  Actually watching the behind the scenes stuff is just as hilarious as the movie considering how insane the director is.  This movie is great for a good laugh.  The best way to know this movie is to watch it. It has to be seen to be believed.",
            "review_date": "2011-08-26",
            "source": "rt"
        },
        {
            "content": "Ow........ I mean, OWWWWWWW! I've sat through some terrible things in my lifetime (Most of the time intentionally for some \"so bad it's good\" action), and this....... this is worse than After Last Season, and considering I could do nothing but talk like a chocobo for a day after seeing that, that's....... a feat.\n\nThe thing to Birdemic is all of its amateurishness is extremely tedious. The cheap opening credits drag on and on in that Manos kind of way, the first 45 minutes are excruciatingly with endless driving to places, terrible sound, and courtship scenes so bland, it's like they took the two most boring profiles off a dating website and made a movie about them. Then the shock and terror appears and you can only laugh so much at the same awful green screen trick implemented over and over and over, and the money shots of hilarious badness are few and far between (There's a reason the clothes hanger scene and the \".....THEY GOT BECKY!\" moment get constant replay. There's not a lot else). It just doesn't have the insanity to get to the Ed Wood realm. It's just plain terrible.",
            "review_date": "2011-08-23",
            "source": "rt"
        },
        {
            "content": "Dumb. Shit. and all its synonyms. Normally, I life these movies but this was just unbearable. Biggest pet peeve: riddling your film with political causes. Even if I agree, I don't want to hear about it, I ant to watch a movie!",
            "review_date": "2011-08-18",
            "source": "rt"
        },
        {
            "content": "Beyond horrible, but the Rifftrax makes it fucking hilarious. I'd give Mike, Kevin, and Bill's commentary a 5/5 if I could. Haven't laughed that hard at a movie in ages.",
            "review_date": "2011-08-14",
            "source": "rt"
        },
        {
            "content": "This is really 2 movies.  One side is a clunky romantic comedy and the other is The Birds.  It is hilarious in all honest.  The romantic comedy part is long, drawn-out and boring, but it is far worth it for the terrible effects and acting of the second part.  I recommend this movie to fans of bad movies.  It is seriously so bad it is funny.",
            "review_date": "2011-08-11",
            "source": "rt"
        },
        {
            "content": "I'm not going to talk about the birds or the editing or the acting here. I don't really care about that stuff in a movie. It's the writing that matters to me. And with Birdemis I felt like it was the writing that confused me the most.\nFirst of all, I don't know if this movie was being serious. There is no way anyone could have thought that this movie would serve as a warning to anyone about global warming. I get the distinct impression that this entire production is a joke meant to satirize environmentalists. If this thing is serious, then I can imagine anyone who agrees with its \"message\" just being embarrassed at the movies ham-handedness. Either way, this movie is childishly incoherent. It fails in every way possible. \nThis thing is second only to \"Actium Maximus\" on my list of worst movies of all time.",
            "review_date": "2011-08-07",
            "source": "rt"
        },
        {
            "content": "So bad!  It's not even the good bad.",
            "review_date": "2011-08-05",
            "source": "rt"
        },
        {
            "content": "Laughing at this movie is like laughing at the mentally handicapped... because every single person involved with this HAS to be at least a little incapacitated.\n\nSeriously, how could no one at any point from pre through post-production stop and say, \"gee, this movie is gonna be fucking awful and should probably never see the light of day lest the world entire think us incompetent.\"\n\nUn.Be.Lievable.",
            "review_date": "2011-08-03",
            "source": "rt"
        },
        {
            "content": "everyone watch this now",
            "review_date": "2011-08-02",
            "source": "rt"
        },
        {
            "content": "Imagine if you will a commercial for a small local business pops on the tv; it's painfully cheap in the sense the actors are not actors, just friends or family of said small business owners, who simply just state their lines almost as if they are unable to emote at all; the director and editor have never directed or edited in their lives and just cut and paste film together without taking things such as audio quality and lighting into consideration. Now imagine, if you still have any desire to, that an entire film was made this way, for under $10,000 and most of THAT money went to marketing the film. That should give you a pretty good idea of how Birdemic: Shock and Terror looks and feels.\n\nThat being said, it's incredibly painful to watch, yet somehow you find yourself being a glutton for punishment; begging to see if it can possibly get worse and boy does it.\n\nThe first 5 minutes of the film is the main character driving his car through the country side. Did I mention 5 minutes? Yes, it takes that long for anything else to happen. In this scene he doesn't talk to anyone, doesn't rock out to a song on the radio. He simply stares forward and drives and we get a few different angles of the car as it slowly cruises along.\n\nThus goes for nearly every scene in the film; it goes on way too long and is thus made unbearably awkward. In one such awkward scene, where I quite literally rolled around on the floor laughing, our hero and his super model girlfriend dance at a seemingly empty Irish bar. Empty aside from a lone black man on stage singing some sort of disco song about \"getting down, getting down with my family, having ourselves a party!\" They do stereotypical \"white people\" dance moves for the WHOLE length of the song, all the while said black man's lips rarely sync up with the lyrics.\n\nPerhaps what got me the most is there is no hint at all about killer birds until 50 minutes into the film and, when they are introduced into the film... well, let's just say you've seen better CGI in 1993.\n\nI honestly thoroughly enjoyed how insanely bad this movie was. My only real complaint is how drawn out the movie gets after the killer birds come into play; it's almost the same scene over and over again and some of the stupid charm gets lost along the way. That and the ending is mind bogglingly lame.\n\nReally stoked to see what James Nguyen brings to the table later this year with Birdemic 2: Resurrection 3D. Yes, that is the actual title.",
            "review_date": "2011-07-31",
            "source": "rt"
        },
        {
            "content": "absolutely 100% of everything in this movie made it the worst widely released feature film of all time. which is why in my eyes, its one of the best and it only made it better that it wasnt supposed to be just completely god fucking awful, and was supposed to be taken seriously. cant wait for the sequel this year.",
            "review_date": "2011-07-24",
            "source": "rt"
        },
        {
            "content": "Didn't really generate the kind of laugh-out-loud response I got when seeing The Room, Birdemic manages to be much, much worse. It doesn't really result in a better movie though. \n\nThe final portion sort of drags but when's it on, it's pretty fucking amazing. The sound editing is priceless and the build to the CGI birds (who look like animated .gifs of those zombie crows on the PS1 Resident Evil games) is genuinely terrific. Maybe this'll click even more when I'm drunk or something",
            "review_date": "2011-07-23",
            "source": "rt"
        },
        {
            "content": "This is the worst movie I've ever seen in my life.  Everything from acting to writing to sound and lighting...I've never seen a movie so thoroughly awful.  It doesn't even make sense, and I'm talking major plot points and the basic reasoning of the characters, etc.  It gets one star from me for the unbelievable entertainment value as a fun bad movie.  Great to watch with friends and laugh over.  And I really love the birds!  And why are these people just driving, and driving, and driving around?  Where are they going??",
            "review_date": "2011-07-23",
            "source": "rt"
        },
        {
            "content": "Wow.. This is absolutely the WORST movie I've ever seen.  Nothing redeeming about this movie. Just when you think it can't get any worse, it does!  Terrible acting, HORRIBLE special effects!  With that said, I HIGHLY RECOMMEND you watch this flick just for the sake of saying you sat through the worst movie ever made.. Oh yea, and a sequel is coming out for this piece of shit later this year.",
            "review_date": "2011-07-23",
            "source": "rt"
        },
        {
            "content": "The one noise they use for the birds still haunts me.",
            "review_date": "2011-07-22",
            "source": "rt"
        },
        {
            "content": "This is the best movie I have ever watched. The beautiful, mind blowing graphics and the fluid bird animation, combined with great actors, well thought out plot and a great script makes a huge mark on the filming industry and is well known to be a genius creation. Go watch it now!",
            "review_date": "2011-07-19",
            "source": "rt"
        },
        {
            "content": "Say what you will about a movie like Birdemic but here is one thing that is undeniable: THIS IS ENTERTAINING. Everything is so laughably bad that you have to watch it over and over like a car wreck. I can't fathom watching a Michael Bay movie multiple times and yet I can watch Birdemic a dozen times and come away giggling.",
            "review_date": "2011-07-17",
            "source": "rt"
        },
        {
            "content": "This movie is so generic. I absolutely hated it. It's boring, the birds aren't even real looking. It's soooooooooo stupid. The actors can't act.. Wasn't worth a penny, let alone a dollar..",
            "review_date": "2011-07-13",
            "source": "rt"
        },
        {
            "content": "Has to been seen by RIffTrax. Everything is bad in this movie. All they do in this movie is drive and park. The Twilight movies are better than this.",
            "review_date": "2011-07-13",
            "source": "rt"
        },
        {
            "content": "So bad it's good. At first glance one might wonder if it was made to be a serious environmental message, however, between the awful editing, acting and effects there's no question about it. Birdemic is a parody of Al Gore's worst nightmare. So if it's such a blazingly craptastic example of cinematic ineptitude, why in the hell am I giving it 3 stars? It's on the basis that Birdemic is probably the best comedy to come along in decades. Oh yes, it's right up there with Tommy Wiseau's cinematic opus, \"The Room\". But this one displays even more \nhilarious examples of failing when it tries to take itself seriously at all. In a world(meaning ours) where comedies these days are about as funny as dying children in Africa, Birdemic is a movie that will truly make you forget your worries and make you laugh through it's odd attempts at a serious sci-fi movie.",
            "review_date": "2011-07-12",
            "source": "rt"
        },
        {
            "content": "Terrible.....and amazing!!!!!",
            "review_date": "2011-06-20",
            "source": "rt"
        },
        {
            "content": "Birdemic is a beautiful, moving masterpiece of cinema. I've never seen so much romance, shock, and terror on the screen at once. James Nguyen is a innovator of cinema and can be compared to great directors such as Hitchcock, and Kubrick. The movie might go on to be one of the best of all time. If you haven't seen Birdemic you need to change that very soon.",
            "review_date": "2011-06-19",
            "source": "rt"
        },
        {
            "content": "Do not be deceived by my rating. This is a terrible, terrible movie. It definitely dips into the \"so bad its hilarious\" category. But for what it lacks in actual proficient skill it totally makes up for in ROFLs. So five-star entertainment with zero-star production value/creativity/or anything. It does everything wrong from the choppy audio to the stilted acting to the hilarious pro-Gore agenda. I couldn't decide if the director was in on the joke or not. So yeah, not a good movie... but if you're looking for a good time with a terrible movie, this is a pretty good option.",
            "review_date": "2011-06-11",
            "source": "rt"
        },
        {
            "content": "This film is incredible! It is so horrible that you have to love it. Never in my life have i seen something so breathtakingly horrible yet so entertaining at the same time. I am still stunned by this movie's lack of heart, soul, or wit. And I loved every second of it. This is as bad a movie as you can find, so bad, that you will enjoy it to the end of your days.",
            "review_date": "2011-05-28",
            "source": "rt"
        },
        {
            "content": "FUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUCK! Watching it Rifftraxed is a must.",
            "review_date": "2011-05-22",
            "source": "rt"
        },
        {
            "content": "One of those movies that fails on every level so hard, it is as spectacular to watch as a head collision between to oncoming trains. Move over Tommy Wiseau, James Nguyen has dragged cinema to new, hilarious low.",
            "review_date": "2011-05-20",
            "source": "rt"
        },
        {
            "content": "Some of the worst CG birds ever put to video. Terrible acting, plot, dialogue, and just about everything else. However, it's the kind of bad movie where someone must have been in on the joke and it is entertaining in its badness at times.",
            "review_date": "2011-05-15",
            "source": "rt"
        },
        {
            "content": "Largely, this film functions as a guide for how to respectfully court someone and initiate a relationship. There are also some crazed, exploding eagles.",
            "review_date": "2011-05-12",
            "source": "rt"
        },
        {
            "content": "The best worst movie ever made.",
            "review_date": "2011-05-11",
            "source": "rt"
        },
        {
            "content": "Intentionally really really bad. The script felt like it was written by a jr. high student and the acting out of this screenplay felt like it was done in the first shooting and no re-takes. Also, the CGI here of the birds felt like it was copied and pasted from a .gif file offline. A lot of this makes the film quite hilarious and makes it stand out as one of the best-worst films of all time. I can't see how someone couldn't laugh at how bad it is, and apparently there is a planned sequel in 3D, which I am looking forward to. The only real 'compliaint' I have with this film is that they could have made it a lot more laughable and lot less boring in a lot of acts here. Some scenes do really drag, but other than that, I couldn't help but laugh at this intentional mess of a film. People who trash this film must have no clue that this is supposed to be the way it is. This is a good film to bring to a party to have some good laughs.",
            "review_date": "2011-05-11",
            "source": "rt"
        },
        {
            "content": "watch this movie with rifftrax!",
            "review_date": "2011-05-10",
            "source": "rt"
        },
        {
            "content": "I didnt think anything could be worse than The Room. But Birdemic makes The Room look like a work of art. This is a student film gone wrong, minus the cool parts and about an hour to long. It is a painful two hour choppy, awkward tribute to Al Gore which doesnt help its cause. If you must watch this movie, do it in good company with a few drinks handy because you will definately need both to get through this one.",
            "review_date": "2011-05-09",
            "source": "rt"
        },
        {
            "content": "Worth a full viewing. And possibly a second viewing with commentary. But not for a few weeks, Aaron.",
            "review_date": "2011-05-08",
            "source": "rt"
        },
        {
            "content": "Wow. What a turd. Not even fun bad, just terrible with no redeeming qualities.",
            "review_date": "2011-05-04",
            "source": "rt"
        },
        {
            "content": "6.4/10\r\n\r\n               Yes, take a great big look at the rating I have assigned to \"Birdemic: Shock and Terror\". It's been called one of the worst films ever made by others, and they're not kidding. However, \"Birdemic\" is also the biggest laugh you're likely to have since you saw \"The Room\", that is, if you saw \"The Room\".\r\n\r\n         Being a horror fan, I can't help but be insulted by this flick. It's stupid, lame, and is helmed by a man who attempts many things and possesses only one thing: the ability to get everything- and I mean everything- wrong. Seldom do we see films as bad as this one, but then again, seldom do we see films as funny as this one either. It could either be the funniest night at the movies or the most tedious. Me, I think it's kind of a mixture. This film blows big time, but it's funny-as-hell, and I will buy it, watch it many times over with friends, and someday even participate in the little cult it has garnered. In all its crap-tacular glory, \"Birdemic\" kind of deserves every bit of criticism, hate, and toilet-paper that it coming its way. But it also deserves some recognition for being so-bad-it's-good. It's the new king of that section of cinema, without a doubt.\r\n            \r\n             Here's a story that attempts many things. The first thing you will notice is that the movie itself is about birds attacking and killing people. Hitchcock did that when he made \"The Birds\". That film was smart, and now we get this film, which is \"The Birds\" for dummies. No, make that complete dumbasses. And yes, I'm kind of a dumbass for enjoying it so much, but we all have our guilty pleasures. This is one of mine.\r\n         \r\n          Aside from the bird invasion, there are sub-plots involving the hero's work life, his love life, his social life, and whatnot. All attempted; all fail. But at least the failure is fun to watch.\r\n           \r\n        Were they serious when they conceived this? Did they really think that birds which explode when they're shot, shit acid, and hover over people's heads would scare people? Something tells me that they were serious, because they have made a really, REALLY crappy movie here. If you like those kinds of movies, then this is one to see. I'd recommend it to just about any cinephile, for despite its overbearing crapiness, it deserves to be seen. It's unoriginal, pathetic, and stupid to the point where I couldn't stop laughing. It's probably the most enjoyable film not intent on being enjoyable.\r\n\r\n          So where do these laughs come from, you ask. They come from many sources. First off, the concept is funny, and it always will be. Birds attacking people can either be scary and intelligent or silly and quite funny. Here, it's funny-as-hell. I laughed my ass off; I really did. The birds are some of the worst looking I've seen in years. The CGI is so simple, the movements are off, and all the stupid buzzards do is hover over people (and their cars). Surprisingly, this can kill them. Way to leave it all to the imagination, guys. Way to go. Also, the acting is painfully bad, and so is the plotting. Another thing that makes \"Birdemic\" so god-awful is the sound editing. Let me just tell you something: this is some of the worst sound editing I've ever heard. You kind of chuckle whenever you hear it; but how could you not?\r\n \r\n       Look, people. I hate this movie as much as anyone else does. It's one of the worst films ever made, and its completely unaware of it. But in a world where few actual COMEDIES can serve up laughs, \"Birdemic\" delivers them by doing its job wrong, on all ends. I appreciate the film for its horrible ideas, horrible direction, and non-stop hilarity; and detest it, at the same time, for its flaws. But I'm glad I saw it; everyone should be. Just go in knowing that this thing is stupid. However, also go in knowing that you are going to laugh. And that explains why I gave \"Birdemic\" the rating that I have given it.",
            "review_date": "2011-05-04",
            "source": "rt"
        },
        {
            "content": "Why \"Shock and Terror\"? Why not \"Birdemic: Shock and Caw\"? Man, this movie's so bad, why not go with the corny title? What the movie fails to realize is that even not trying requires some effort if you're gonna make an intentionally bad movie, if that is, in fact, their intention. Otherwise, you get a poor quality waste like \"Birdemic: Sock and Terror\", which I would say leans more towards the amateur film category than independent film category were it not for the fact that I would be insulting amateur filmmakers. The movie suffers from overdevelopment, dragging, poor sound quality, choppy storyline editing, impossibly awful footage editing, a bad soundtrack with poor placement, cliches, awe-inspiringly atrocious visual effects, terrible writing, unbelievable character behavior, a forced resolution, a cop-out ending and acting that left me waiting for the big art house, not-so-happy ending where our heroes are finally slaine by a surprise swarm of woodpeckers. Really, all I can say about \"Birdemic: Shock and Terror\" is that it is of such poor quality that it's offensive to the art of filmmaking and those who put effort into it.",
            "review_date": "2011-04-30",
            "source": "rt"
        },
        {
            "content": "It's... unforgettable. And technically, even I could do better than that.",
            "review_date": "2011-04-28",
            "source": "rt"
        },
        {
            "content": "This might well be the worst edited, most clumsilly written and terribly shot movie I've ever seen. Oh yeah, and it also has what is probably the worst special effects in cinema history. If it had been intentional, a goofy comedy, it might have been interesting, but as of now it is just amazingly bad. To add to it, Birdemic is one of those movies that are not satisfied having their environmentalist message in your face but go for cramming it up your nose. While I'm not dismissing the debate on global warming, I have yet to see proof that it gives eagles acid urine and makes them explode on impact.",
            "review_date": "2011-04-27",
            "source": "rt"
        },
        {
            "content": "full review @ http://www.moviesonline.ca/2011/03/birdemic-shock-terror-movie-review/",
            "review_date": "2011-04-25",
            "source": "rt"
        },
        {
            "content": "So, a guy who NEVER took moviemaking class just picked up a camera, paid some people to act blandly, cheaped out by having a film budget LESS than $10,000, and asked for NO help whatsoever from much bigger studios?\r\n\r\nFAIL!",
            "review_date": "2011-04-22",
            "source": "rt"
        },
        {
            "content": "This migh be one of the most awful and incompetently made films I've seen in a long time. Nowhere near as \"funny\" as some horror sites have made it out to be. Amatuerish in every sense of the word.",
            "review_date": "2011-04-19",
            "source": "rt"
        },
        {
            "content": "I'll give this movie  (if you can call it that) half a star rather than 0 just for the birds shitting acid on those peoples faces.",
            "review_date": "2011-04-18",
            "source": "rt"
        },
        {
            "content": "Gargantuanly catastrophic example of cinematic folly that is impossible to enjoy even on an ironic level. The \"extended clapping\" scene has to be seen to be believed! And remember: global warming is to blame...",
            "review_date": "2011-04-17",
            "source": "rt"
        },
        {
            "content": "So poorly made, it must the product of an idiot savant.  Must be seen to be believed.",
            "review_date": "2011-04-14",
            "source": "rt"
        },
        {
            "content": "What do you say about Birdemic that hasn't already been said? This movie is currently in the running for worst movie ever made, and the internet has pit it against heavy weights like The Room and Troll 2. \n\nBut honestly I think Birdemic seizes it for me. I don't know if it's just the animated GIF birds that movie when the camera does. The \"acting\" that is just about the worse thing you've ever experienced, it might be the editing which seems to have been done by a child and gives us a multitude of shots that linger for too long giving us a glimpse of the performers as they sit and comtemplate the rubbish they've just spouted. Or how EVERY time someone has to walk to their cars we have to see the entire journey from door to door.\n\nAll of these factors definitely contribute but I think what really does it for me is the films heavy handed environmental message. Delivered by a bunch of random encounters with strange hippes talking about their tree boners directly into the camera in lengthy monologues that make great bathroom breaks. Honestly, you owe it to yourself to experience this.",
            "review_date": "2011-04-10",
            "source": "rt"
        },
        {
            "content": "I've never laughed more",
            "review_date": "2011-04-04",
            "source": "rt"
        },
        {
            "content": "About the best you can hope for in a terrible movie. It slows down a bit in the final third, but there's enough here to keep you laughing until you cry. Watch it with you friends, and you'll be quoting it for years to come.",
            "review_date": "2011-04-01",
            "source": "rt"
        },
        {
            "content": "attack of the killer screen-saver bird GIFs! perfect film for when you're hangin' with the family.",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "This is a masterful work of art. Its a must see for all ages with a wonderful message for the new age kiddies out there. Go set it! The special affects r amazin!!!!!!111 lololololol",
            "review_date": "2011-03-26",
            "source": "rt"
        },
        {
            "content": "D: D:D: D:D D: This movie makes The Room look like Citizen Kane.",
            "review_date": "2011-03-22",
            "source": "rt"
        },
        {
            "content": "This movie is quickly gaining a reputation as a so-bad-it's-good cult classic a la The Room, and it does not disappoint. It's part pro-green propaganda, part epic romance, part \"when 8-bit birds attack\" survival story, and ALL TERRIBLE. And I don't mean Syfy Channel Original Movie wink-wink-nudge-nudge terrible, I mean incompetently slapped together on every level terrible. In other words, SEE IT NOW, but don't you dare see it alone or sober. Oh, and bring a coat hanger.",
            "review_date": "2011-03-21",
            "source": "rt"
        },
        {
            "content": "Birdemic is the work of a genuine artist.  Writer/director James Nguyen has made a film that embraces his love of HItchcock and environmental issues.  The only problem is that this artist has absolutely no talent.",
            "review_date": "2011-03-21",
            "source": "rt"
        },
        {
            "content": "So laughably bad that I don't think it's even worth reviewing. It would be very ambitious, provided it were made my high school students. That being said, it makes for great unintentional comedy!",
            "review_date": "2011-03-20",
            "source": "rt"
        },
        {
            "content": "I can't believe this movie is true... it's one of the worst movies I've ever seen...",
            "review_date": "2011-03-20",
            "source": "rt"
        },
        {
            "content": "I finally got around to seeing this and it did indeed surpass my expectations on badness.    While I was expecting crappy CGI, I wasn't expecting such bad editing, stilted acting, and a hammer-over-your-head earth message.   Still... it's a fun watch and would be even moreso with a group.   The lead gives Nick Castle a run for his money for the best \"Michael Myers walk.\"",
            "review_date": "2011-03-19",
            "source": "rt"
        },
        {
            "content": "When you go into Birdemic, the overall pleasure of the experience depends on the perspective you have. If you go into this movie expecting nothing more than cheesy effects, poor acting, and just a laughable plot, then this movie is really funny. However, if you're expecting a legitamate horror/thriller film similar to Alfred Hitchcock's \"The Birds\", then look elsewhere. Birdemic: Shock And Terror is either the funniest comedy of 2009, or the worst thriller of 2009.\r\n\r\nBirdemic stars Rod, a software salesman and his model girlfriend Natalie. For the first half of the film, the mostly just do stuff. Nothing of lasting importance, we just see what bland people do on a daily basis, mainly consisting of awkward conversations with family members and getting too excited or under excited about daily events. After the awkward couple gets close (I guess), the birds finally attack the town. And yes, these birds explode. Because, you know, that makes them SO much cooler! Somehow, the two main characters survive the bird attacks as well as two kids they save and as the film ends they watch the birds fly away, never to return again.\r\n\r\nThis film fails on all levels. The plot and story could basically be summed up in one statement: STOP POLLUTING THE ENVIROMENT OR RABID BIRDS THAT CAN EXPLODE AND SPIT ACID PUKE WILL ATTACK YOU! The characters are as wooden as wooden can be. And, did I mention, THE BIRDS FRIGGIN EXPLODE! And unfortunately, the explosions don't follow the rules of science and nature. Tell me if it's possible and I'll retract the statement, but isn't it impossible for an \"exploding\" bird to explode in a gas station and not set the whole place in flames? The special effects are mind bogglingly bad with clip art birds and overused sound clips that'll melt your brain. The editing is some of the worst I've seen in years, with unnecessary cutaways and poor sound editing.\r\n\r\nWhat makes me laugh is that the director actually can take this as a serious romantic/thriller film. What a smug dude. Anyways, if you want some Ed Wood style laughs, go check out Birdemic: Shock And Terror. For the rest of us, just avoid this movie and rewatch \"The Birds\". (Real rating: 9%)",
            "review_date": "2011-03-17",
            "source": "rt"
        },
        {
            "content": "Watch only if you want a good unintentional laugh",
            "review_date": "2011-03-15",
            "source": "rt"
        },
        {
            "content": "Cinema has finally attained perfection.",
            "review_date": "2011-03-15",
            "source": "rt"
        },
        {
            "content": "When you're a successful software salesman and own a fancy Californian home why would you take the \"love of your life\" to a cheap motel to knock boots? ...why not? Be ready for an edge-of-your seat,  forty-five minute opening sequence filled with sharp, rapid fire dialogue. You'll need more than a coat hanger to fend off the waves of terror soaring straight at ya! It was mighty considerate of the birds to only attack the neck of the main characters as to not mess their pretty faces.",
            "review_date": "2011-03-14",
            "source": "rt"
        },
        {
            "content": "I'm not sure how to rate this, so I'm going to split it and go 2.5 stars.\n\nThis is...without at doubt...the greatest bad movie ever made. I could not stop laughing. I think this could be my favorite movie ever, but it's...well, it's not a good movie. I'm having trouble reconciling it.\n\nSimply...a must-see whether you want to hate it or love it.",
            "review_date": "2011-03-14",
            "source": "rt"
        },
        {
            "content": "Is it possible to give a movie one star AND five stars at the same time? At least they got the title right. Shock and terror, indeed.",
            "review_date": "2011-03-11",
            "source": "rt"
        },
        {
            "content": "Dear God,\n \nWhy?\n\n-Ken",
            "review_date": "2011-03-09",
            "source": "rt"
        },
        {
            "content": "I've come to the conclusion that 'Birdemic' should be a requirement for every film class in the world as an example of how NOT to make a movie. Everything from the acting, the directing, the editiing (especially the editing), the god awful sound mix and the atrocious visual effects should be examined and analyzed by anybody planning to make a movie. This is truly something to behold. However, on the plus side, the movie is amazingly hilarious because of how impossibly bad it is.",
            "review_date": "2011-03-09",
            "source": "rt"
        },
        {
            "content": "Will find its cult audience the same way that Plan 9 from Outer Space found theirs. This bad movie through and through, where nothing works. You name any technological or story telling feat and it failed massively on that level.",
            "review_date": "2011-03-08",
            "source": "rt"
        },
        {
            "content": "Worst movie ever made. Period. Watch the Rifftrax version with friends, though, and it's freaking hilarious. Only way to watch it!",
            "review_date": "2011-03-08",
            "source": "rt"
        }
    ]
}