{
    "rating": 2.5,
    "release_date": "2008-01-25",
    "num_reviews": 150,
    "genres": [
        "Comedy"
    ],
    "summary": "When Xerxes (Ken Davitian), the evil god king of Persia, sends his massive army to Sparta, King Leonidas (Sean Maguire) and 13 strapping warriors rise up to defend their homeland. Leonidas, Captain (Kevin Sorbo) and the rest face down dancing Persians, bad punch-lines and celebrity look-alikes.",
    "reviews": [
        {
            "content": "ABSOULUTE BEST MOVIE EVER>>>>>>>>>>",
            "review_date": "2023-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOL, the funniest 01 hour: and 24 minutes ever!!!!!!!!!!!!!!",
            "review_date": "2022-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sucks, but all in all that's what he wanted to achieve so he does a great job. But the film doesn't even entertain and it doesn't make you laugh so it's worse than the worst.",
            "review_date": "2021-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whoa mama!😮😮 Hummina hummina hummina bazooooooooing😙! eyes pop out 😮😮😮😉AROOOOOOOOGA! jaw drops tongue rolls out 😱😱😱WOOF WOOF WOOF WOOF WOOF WOOF WOOF WOOF WOOF WOOF WOOF WOOF WOOF WOOF WOOF🐶🐶 tongue bursts out of the outh uncontrollably leaking face and everything in reach😛😛😛😛😛 WURBLWUBRLBWURblrwurblwurlbrwubrlwburlwbruwrlblwublr ,🤪😜😜🤪tiny cupid shoots an arrow through heart 💘 Ahhhhhhhhhhh me lady... heart in the shape of a heart starts beating so hard you can see it through shirt😍😍😍 ba-bum ba-bum ba-bum ba-bum ba-bum 🥁🥁🥁  ⚠️⚠️⚠️⚠️⚠️ inhales from the gas tank ⛽⛽⛽honka honka honka honka 🚕🚕",
            "review_date": "2021-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first 10 minutes aren't bad, but after that it's TORTURE, and they rarely hit a joke. (1.5/10)",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super film! Its very funny! I love this film.",
            "review_date": "2021-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfectly stupid, and that's kind of the goal.",
            "review_date": "2021-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my favorites comedy movies. I just can't get enough and watch it a lot of times!",
            "review_date": "2021-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie I have ever seen; dull and ridiculous.",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The people giving this movie one star are boring and stale humans that are completely boring at any party. This movie is obviously meant to be a complete comedic mess. Meet the Spartans was one of the last great satire spin offs. In today's society a movie like Meet the Spartans could never be made. Thank you to the cast and crew for making my childhood great with this film! Me and friends loved it back in the day and still do in uni!",
            "review_date": "2021-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a dumb movie but it was funny when I was a kid so eh",
            "review_date": "2020-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can I say about this movie that's good?\nCarmen Electra was pretty hot in it, but as with most parody movies, they take a well known film, in this case 300 and proceed to make it with terrible jokes and sight gags.  I'm not sure if it's law that these are supposed to be as unfunny as possible, but it wouldn't hurt to at least be clever. \nTerrible",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The standard Seltzer/Friedberg formula.\n\n1. A stand in for a famous actor or celebrity pops in.\n\n2. Someone in the movie condescendingly announces the name of said character or celebrity in case the audience is too dumb to get the obvious reference.\n\n3. Actor impersonating character or celebrity recites a line that the character or celebrity made famous. Context doesn't matter.\n\n4.  The character or celebrity being \"lampooned\" starts to breakdance.\n\n5. Character or celebrity falls down.\n\n6. Steps 1-5 are repeated until the movie ends.",
            "review_date": "2020-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "movie that even has cool scenes but the script doesn't help and the characters are silly, crude, cheesy and beasts that end up not having much fun and that makes the film more depressing than funny.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just another scary movie rip/spin-off. not that funny, but if you smoke it'll probably be hilarious",
            "review_date": "2020-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very bad parody film that has no funny moments, godawful acting, parodies too much things at once, and is a perfect example of crime against cinema.",
            "review_date": "2020-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really don't get the low reviews.  Maybe its just not for everyone. Not all the jokes land (like any parody) but there are some seriously funny bits that makes this film well worth watching.",
            "review_date": "2020-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a parody of 300 and many other blockbusters, it's tired, unoriginal, dated, unfunny, boring, offensive and uninspired.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If these Spartans try to introduce themselves RUN!!! The film has as many laughs as the real 300.",
            "review_date": "2020-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical Friedberg spoof of the 300 Zack Snyder movie. Riddled with many unnecessary pop culture references, some even dated at the time, also unfunny homophobic and racist jokes. One of the worst movies I've ever seen.",
            "review_date": "2020-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who knew a spoof could be this unfunny and boring.",
            "review_date": "2020-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why bother writing a detailed review on Meet the Spartans? You know how the story goes: the acting is awful, the production values are abysmal and Friedberg & Seltzer mistake pop culture references to whatever was trending at the time for actual humour. They're not even researched well since they only look at trailers and production notes. I cringed when they called the Cosmic Cube the \"Transformers Cube\". Seriously, the reviews for these awful parody films, with the possible exception of Date Movie, are interchangeable. I'd express relief that this 300 \"parody\" is short but they pad out the runtime with an end-credits sequence with a decent amount of deleted scenes. Yeah, Meet the Spartans is that bad, people. But it is at least 5% better than the aptly named Disaster Movie.",
            "review_date": "2020-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid 300 parody! It's worse than Disaster Movie!",
            "review_date": "2020-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On the better side of the worst movies ever made",
            "review_date": "2019-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow oh wow. It's some of the worst writing I've ever seen. Is it possible to give it zero stars? ",
            "review_date": "2019-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly its a funny movie",
            "review_date": "2019-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool. Like a mirror of 300. But, clear by a true hilarious prism vision . 300 was distorted.",
            "review_date": "2019-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It sucks because it's a ripoff of 300! Even though I'm neutral over 300.",
            "review_date": "2019-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Appreciate the parody, but it overwhelms every aspect from being a biographical film",
            "review_date": "2019-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, heartfelt and occasionally involving, Meet The Spartans is a perfectly crafted comedy that remains sharp and incisive more than 10 years after its release.",
            "review_date": "2019-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you've watched 300, you need to watch Meet the Spartans. It is a silly and irreverent film that fantastically parodies the amazing 300. \n\nDefinitely the best of the parody movies with maybe the exception of Scary Movie.",
            "review_date": "2019-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is pretty much the comprehensive demonstration of complete trash. Easy, cheap, incoherent humor with a seemingly built in randomizer. The only part that interested me at all was that Carmen Electra apparently consented to a crabs joke, and that she was a whore. Alongside old tired jokes such as making fun of Brittany Spears' shaving her head, and Simon Cowells' legendary bitter judgment of talent, you have to wonder why she would consent to basically being the reason feminism exists and risking it have a grain of truth like the others.",
            "review_date": "2019-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most funny parody movie's ever. It was so much fun that i cried tears the hole movie xD",
            "review_date": "2019-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The whole dam movie was crap...\nUntil the end music number!\nI love this awful flick!",
            "review_date": "2019-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie isa disaster to say the least",
            "review_date": "2018-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What possessed me to watch this movie? \nIt's a shame, the main actor actually has range. Actually, the acting is not bad overall (bit over the lines perhaps), it's just that there are no actual jokes in the movie, so it's unfunny and boring.",
            "review_date": "2018-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One man's trash is another man's treasure. /shrug",
            "review_date": "2018-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what were they thinking when they were making this movie? I mean this movie is a total disgrace. I didn't even laugh even once while watching this movie.",
            "review_date": "2018-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i'm only giving this an extra half star because i liked it... when i was 12. but now, it's crude, disgusting and unfunny. if you haven't seen it... don't.",
            "review_date": "2018-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the first of the spoof movies that I saw. I haven't seen another spoof movie after this and any Scary Movie also. Stay away.",
            "review_date": "2017-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not that they keep making this awful films, its that people actually keep watching them at the theater.",
            "review_date": "2017-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was by far one of the funniest movies I have seen. A+ comedy and just there for a good laugh. Its horrible filming but a wonderful film if you have crap sense of humor and want to have a good laugh.",
            "review_date": "2017-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not funny. far too long",
            "review_date": "2017-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you pretend like you're drunk or high this has some idiot , stupid and dirty humor . If you wan't a normal comedy then skip this movie ! SOMDVD",
            "review_date": "2016-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A painful film that is about -5Â° away from being watchable.Funnily bad.",
            "review_date": "2016-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The casting was brilliant, but the material is overworked, washed out and a bloody stain of better comedies.",
            "review_date": "2016-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst experiences of my life.",
            "review_date": "2016-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's just as bad as you think, Very poor silly jokes, Poor acting but I did laugh a few times and the mocking of the slow motion scene from the film was great and really funny but apart from that it's another spoof film that nobody asked for.",
            "review_date": "2016-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film with stupid, unfunny, horrible jokes, laughable acting, pitiful writing and aimless direction. A cinematic shame and terrible entry in the comedy genre..",
            "review_date": "2016-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected this to be really bad...and it was. However, I've seen some of the other crappy movies made by the same writers of this one and at I can say this one was somewhat watchable. There are some parts that are kind of funny, but nothing that made me laugh out loud. \n\nThe thing I hate most is that these guys have a bad habit of shoehorning anything from pop culture into these films. They also tend to blatantly point out what they are referencing - I guess in case the audience is too stupid to recognize it. These guys are capable of creating some funny moments, but they really need to have some quality writers/directors to reel in the painfully unfunny stuff.",
            "review_date": "2016-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay it had its comedy. It had its: American idol, Brittney Spears, gay comedy montage. Yes the nipple ripping scene made me feel that. The movie was not very good being a little older to look back at. I loved it at the time, but come on 300 was awesome, great idea to parady it, but some things you should not parady.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is by far the best movie I have ever seen. The artistic and conventional symbolism is stunning!",
            "review_date": "2015-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie of the year.....enough said.",
            "review_date": "2015-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Britney Spears gets kicked into a hole.",
            "review_date": "2015-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It looks like the \"30 Million Dollar\" Budget went right onto \"Frezidberg &Seltzer's\" Bank Account",
            "review_date": "2015-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A horrible unfunny piece of trash. This is the 3rd worst parody movie I ever saw!",
            "review_date": "2015-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meet the Spartans is a terrible movie, even compared to the likes of the Scary Movie series or the various teen comedy spoofs. There were very few gags in this movie that worked; the Casino Royale sequence and the movie's brief Grand Theft Auto scene worked well, but otherwise, there is nothing worth seeing here. They just don't make them like they used to; the days of UHF seem long gone, and we're left with Meet the Spartans instead. What a shame.",
            "review_date": "2015-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meet The Spartans is directed by the same people who brought us Date Movie and Epic Movie, two absolutely terrible and unbearabley unwatchable movies. I honestly went into this movie expecting it to be horrible and that's really what I got. It's honestly old at this point. If you hated Date Movie and Epic Movie, you're most likely going to hate this one too. Another horrified parody.",
            "review_date": "2015-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No!!!!! These writers need to stop!!!!",
            "review_date": "2015-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seriously, Hollywood's went from the hilarious spoof-classic \"Airplane\", to this?  Rarely do I come across a \"comedy\" that leaves me face-palming, and staring at the screen blankly throughout it's running time.  The humor consists of juvenile, disgusting, bizarre, pointless and annoyingly arbitrary gags just for the sake of happening.  Even some of the Scary Movies had funny, guilty pleasure moments; this was just boring, random and stupid.  Meet the Spartans serves as a stamp of approval that the spoof genre has long since run out of gas.",
            "review_date": "2015-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So undeniably horrible it's good  \n\nIt's funny in  a stupid way\nMade me laugh",
            "review_date": "2014-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watch the trailer for the UK, it has all the jokes that are actually funny in this film.",
            "review_date": "2014-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had a few chuckles, but its the same old crap; dated pop culture references and all.",
            "review_date": "2014-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1/10\nexcept the barbie sketch, this movie is shit",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ongue-in-cheek parody of the sword-and-sandal epics 300, Thought i would like this film but not as much",
            "review_date": "2014-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trying to make fun about serious films but this pic is such a mess...",
            "review_date": "2014-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely unfunny and stupid.",
            "review_date": "2014-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK there are a couple of scenes that are funny, but I still cry for the money I paid to watch it...",
            "review_date": "2014-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another off the wall parody movie that is hated just because there's to many parody movies",
            "review_date": "2014-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet again. This one shares the same rating at the last two films of the same directors. Why? Because something about this that tickles my fancy. Or, it could be the fact that the last time I watched this I was in high school and I remember laughing my ass off for no reason. \nTo me, this movie is Epic Movie 2. It's almost as though they put this together from deleted scenes or unused jokes and had enough to fill yet another hour and 20 or so minutes. \nAs with the previous Aaron and Jason films... This is not one to rush to watch.",
            "review_date": "2014-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the most funny Movie i ever seen.. loads of laugh in it.",
            "review_date": "2014-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "literally one of the worst spoof/parody films ever",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is nothing but product placement, disgusting gags, celebrity jokes, and not to mention references!!",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is nothing but product placement, disgusting gags, and celeberty jokes. Last but not least..references!",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one or two chuckles, that's it",
            "review_date": "2014-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 minutes was more than enough.",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing to see here! Just skip this movie!",
            "review_date": "2014-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily, the best spoof movie.  But, still bad.",
            "review_date": "2014-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "has 2 hidden scenes after the movie ends.  one a bit after the first credits and the other at the very end.  I don't know why I waited so long to watch this movie. it's stupid funny as a must watch.",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good and funny movie",
            "review_date": "2014-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A 300 spoof. Even then, that movie is so easy to spoof and has been done to death even when it was released, that this film coming a few years later already seems dated. It has jokes about Britney's meltdown and American Idol which have been done so many times. Just everything feels like I've seen it before and this film doesn't do much new or funny to make it enjoyable. The effects are bad, the acting is bad, the jokes aren't funny. Just an all around terrible movie.",
            "review_date": "2014-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WTF is this crap? I mean seriously! This is just a disgusting and phenomenal mess of a movie. no rhythm, no pace, a completely stupid plot and unfunny and ridiculous jokes, I'd rather watch an Adam Sandler movie than THIS piece of sh*t. Why did it make so much money? Our society is getting worse and worse.\n\nI can't even believe that my family watched this movie. ALL THE WAY THROUGH! This ridiculous movie shouldn't exist. Do me a favour directors, DO YOUR JOB RIGHT!\n\n0.5/5\nJust a poor and sad comedy",
            "review_date": "2014-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was funny at times but its a very stupid movie",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slightly funny at some points, but in general a cinematic disaster, don't watch it unless you enjoy poor jokes and poor acting.",
            "review_date": "2013-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No storyline, cheap comedy, shitty movie",
            "review_date": "2013-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite entertaining in a few parts but overall another crappy broad comedy.",
            "review_date": "2013-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sure beats the hell out of Disaster movie.This movie is kind of funny.",
            "review_date": "2013-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bad yes but funny also",
            "review_date": "2013-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The randomness is used throughout most of this flick. Meet the Spartans makes 300 look like a mockery.",
            "review_date": "2013-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "People don't understand what a parody is!! This shit is funny!",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is it terrible? Yes it is. But that is what makes it so dang funny. Ill watch this movie over and over.",
            "review_date": "2013-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know this is a bad movie but I have to admit I did laugh quite a lot and well I have seen this movie more than once which is more than can be said for certain movies I have seen",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I listened to the commentary on the DVD and I laughed more at that then the actual movie. Trust me if you haven't already listened to it yet, do it. If your film opens up with a puke joke, maybe you shouldn't be in the film industry.",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hysterical! The highlights are the pit of death scene, all the pop culture parts, how xerxes kills everybody at the end and the ending scene. I recommend it to anybody who likes spoof movies or hated 300",
            "review_date": "2013-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly one of the worst movies ever made, but it's terrible enough to be able to mock.",
            "review_date": "2013-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stop making these movies. Nobody likes them, they're not funny, and they are terrible. Awful just awful.",
            "review_date": "2013-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie I've ever seen in my life. No substance, just stupid jokes.",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A repulsively unfunny piece of shit that actually manages to make \"Jaws: The Revenge\" look like \"Gone With The Wind\", Meet The Spartans fails to be a spoof; it has bad acting, unfunny pop-cultural gags, and the plot is non-existent. Friedberg & Seltzer have scraped the bottom of the cinematic spoofs barrel yet again. If you want good satire, watch \"Meet The Feebles\" instead. (1/10)",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eh the first time and second it's okay then it gets really stupid",
            "review_date": "2013-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont know about you guys but i luaghed my ass off the whole time",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad, kind of short.",
            "review_date": "2013-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS A HORRIBLE HORRIBLE MOVIE IN THE DECADE OF COMEDIES",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow......  it  had a few funny parts, but other than that it wasn't very good, but I had to see Britney being kicked into the death pit.  and making fun of Paris Hilton :-p",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bad movie don't waste your money",
            "review_date": "2013-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "with places to laugh..",
            "review_date": "2013-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the 5 worst movies I have ever seen. I was barely able to finish this piece of crap.",
            "review_date": "2013-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Suppose to be Entitled meet the Non-sense",
            "review_date": "2013-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AN AWFUL PIECE OF CRAP THAT SHOULD HAVE NEVER EVEN BEEN MADE!!!!!!!!!!!!!!!!",
            "review_date": "2013-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so freaking hilarious! but you have to stay for the credits or you miss a part of the movie",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My friend said its really good..jajajaj really",
            "review_date": "2013-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorites movies, very funny",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sometimes cheap humor but still many reasons to laugh",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh don't get me wrong, this movie is awful. But I liked it's take on 300 a lot.",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some great movies coming out. this is one i ave got to see",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie ever!",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, this is probably the worst movie I've ever seen. The movie ain't worth the film it was printed on",
            "review_date": "2013-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FUCK THIS FUCKING MOVIE:\n\nAwards:\n\nWORST ACTOR\nWORST SCREENPLAY\nWORST CAST\nWORST COMEDYJDLFJEOIHTPOEOHOTH@*^*!^*(@^$\n\nTHIS IS BULLSHIT!!! THIS IS NOT EVEN A FUCKING MOVIE!!!!",
            "review_date": "2013-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was ok, but kinda a let down :(",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is a frikin disgrace this is the worst movie ever made!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, I've seen it. That makes me a retard, by my own admission.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was Make Laugh to watch as was fun and must see as make you fun.. hehe Lol...",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dumbly dumb, dumbier than dumb!",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a movie that caters to ten year-old humor, with the ambitions to meet the standards of twelve year-old humor.",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! That had to be one of the worst movies I have seen! The actors looked like they had fun making it though.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So horrendus, so god awful, that it psychically hurts you, as you're watching it, while it makes you hurt yourself long after it's over, simply because you saw it.",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i honestly did not want to waste my money on it but i was curious and i thought it was hularious and wouldnt mind at all seeing it again... its alot better that epic movie and deffinately date movie",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ABSOLUTELY AWFUL!!!!  I'm hoping the writers went on strike before they wrote this piece of shit!!!",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can put zero stars which is what it deserves!!",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had to watch it since I love 300. It had its moments but mostly - it sucked badly.  A little bit better than the Epic Movie.",
            "review_date": "2012-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe the only movie I couldn't physically finish, and I didn't even mind the two other \"movie\" films in the series. Just a random collection of crap thrown at the screen without giving a shit.",
            "review_date": "2012-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Please stop making these movies",
            "review_date": "2012-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hilarious, I loved it.",
            "review_date": "2012-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was alright. Although, it was a cheap version of 300 it was still pretty stupid. They did make it stupid, that was the point anyways.",
            "review_date": "2012-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Looks Hilariouis!",
            "review_date": "2012-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know a movie is bad when you are watching it for free online, at work and you STILL turn it off after 20 minutes. If I could give it negative stars I would.",
            "review_date": "2012-12-09",
            "source": "rt",
            "lang": "en"
        }
    ]
}