{
    "rating": 2.9,
    "release_date": "2008-01-04",
    "num_reviews": 430,
    "genres": [
        "Horror",
        "Mystery&thriller"
    ],
    "summary": "When Beth Raymond (Shannyn Sossamon) witnesses the deaths of two friends, she knows there is more at work than just a tragic coincidence; days before they die, both victims hear their terrifying final moments on cell phones. Though the police think Beth is crazy, detective Jack Andrews (Ed Burns), believes her. Together the pair try to unravel the mystery behind the horrifying messages before their own phone numbers come up.",
    "reviews": [
        {
            "content": "Ass. Just plain ass.",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What the f**k is your idea?!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is truly is the worst, it a joke to the horror community.",
            "review_date": "2023-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very cool movie. Special effects were out of this world. The ending just blew my mind, surely worth the wait",
            "review_date": "2023-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if it scared the legendary charles christopher white jr then it gud!!!!!!!!!!!",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For an older film, it is those corny style with not lots of plot but effective in eerie feel. And don't get me started with that voicemail sound which I made my own ringtone in middle school when this movie came out lol. Compared to bloody valentine (and others) where it's just all gore but no substance, at least this film gives us loads of haunts and those feelings of hopeful that they can be saved. Also the porcelain creatures haunting everyone through the phone and the way that there's no escaping this end game is just the icing of the cake. It's almost like the boogie man/candy man where we can't even fall asleep without knowing we can die any time. I personally loved it!!!",
            "review_date": "2022-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought I was gonna be watching a horror, but got a horrible instead.",
            "review_date": "2021-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first movie that made me contemplate murder…of everyone who made this waste of data, brain cells, and money.",
            "review_date": "2021-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I've heard the original Japanese film is far superior, I still haven't seen it.   This American version has a decent cast with Edward Burns and Shannon Sossamon, the story is kind of weak and tough to swallow but they seem to try their best with what they have.  Seems like the story might have been lost in translation.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of the worst remakes in history, \"One Missed Call\" is a failure under every aspect, and Sossamon's performance is so pathetically bad that ends up being almost fascinating.",
            "review_date": "2021-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thankfully, I stopped this movie 1/",
            "review_date": "2021-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a little surprised this movie was criticied to the extent that it was. That being said, I'm not going to say it was a good movie or anything, but I have TOTALLY seen worse. The acting wasn't that bad- it obviously wasn't even close to oscar-winning standards of course, but for the movie I think it was convincing enough. In terms of scare factor, it wasn't that scary. There aren't really any horrifying images either. Perhaps only in one scene that comes to mind. The part that was most disappointing are things in the storyline that just don't work for me:\n1. The origin of this \"phone curse\". So we see that this originated when Ellie was locked in her room after getting caught physically harming her younger sister, Laurel. Ellie begins to suffer an asthma attack, who then desperately bangs on the door for help, then tries to dial her mother's number in her phone as she dies, thus beginning the phone curse, with Ellie's mother as the first victim. Not to look at it too logically, but when Ellie was first caught by her mother, hurting Laurel, I'm sure what (at least partly) brought on her asthma attack was the stress of getting caught and what this might mean for her. Obviously she has psychological issues, but perhaps she was scared her mother wouldn't love her anymore? Or she'd get sent away? Then her asthma attack begins, and she's panicking as she knows she needs medical help. She's banging on the door for her Mum to help, and tries to call her- again, for medical help, as she is in a medical emergency. So why on Earth would she even be thinking about starting some kind of \"killer phone curse\" when she's wheezing for breath and trying to get help? When you're on your last dying breath, you're panicking, and gasping for air, not planning out a whole (not to mention, supernatural) revenge. How a child would even think of that is beyond me- Ellie was pretty young. She had her issues, but she was just a kid after all, what gave her the ability to create such a curse?\n2. After the cop is killed near the end of the film, we see an unfriendly spirit of Ellie approaching Beth (likely to kill her). We then see the saviour-looking spirit of Ellie's mother grab spirit-Ellie and pull her away from Beth, where we also see light (presented as the \"phone curse\") get sucked out of the dead cop's phone (which at this point would normally have already dialled the next victim) presumably putting an end to Ellie's cellular rampage. Yet once the spirit commotion is over, the late cop's phone dials the next victim's phone number. Why on Earth would you show a triumphant spirit, triumphantly end the curse, to only seconds later, just show the curse still active. Director just booked in a cheap ending.\n\nNevertheless, this movie still earns 3 stars as the premise was intriguing, and still fairly entertaining to watch despite the story problems. As far as horror movies go, there really is much worse than this.",
            "review_date": "2021-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish this movie was better but the mixture of the confusion plot along with the sb par acting makes it so it cannot rate it any higher,",
            "review_date": "2021-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is pathetic, simply pathetic. You don't have to be a professional reviewer to know this movie is the worst horror movie ever",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really loved one missed call I don't understand why it is rated so low",
            "review_date": "2021-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"This horror film felt like \"The Ring\" it felt like a \"bootleg\" version of \"The Ring\"",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heinous pile of shite from the early 2000's. After The Ring made the \"contagious curse\" genre popular, a ton of movies tried to rip off its success. One Missed Call wasn't even smart enough to have a complex set of rules. And it wasn't brave enough to show us anything scary. They blew the entire budget pasting snapchat filters on harmless strangers walking by to spook our characters. The jumpscares were ridiculous and uneccesary. At one point a guy hands something to a character and they actually use a door slamming effect with loud music to try and squeeze another jumpscare in there. Because the movie has nothing else. They made a point to show us a scene where the main girl's professor was explaining childhood trauma because obvious foreshadowing. Then later she used her invaluable knowledge as a psych student to explain what Munchausen Syndrome By Proxy is to the detective because why would he know? Obviously they think the audience is ignorant and need this info explained. Boring, stupid, and cliche.",
            "review_date": "2020-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the worst mystery movies I've ever seen. it is very boring and tedious is serious do not watch",
            "review_date": "2020-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stars 0give could I Wish",
            "review_date": "2020-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 stars because it has some horrifying chills ",
            "review_date": "2020-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually really liked this movie! I've seen it many times and even dropped cash to buy it. Granted, it wouldn't call it a classic and it is fairly low budget, but it has some good creepy moments and I can't get that tune out of my head.",
            "review_date": "2020-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't a big fan of the original film, but this is way worse.",
            "review_date": "2020-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unclean and repetitive. One missed call you shouldn't answer to.",
            "review_date": "2019-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I could give this a zero I would, this movie is a major ooooooof",
            "review_date": "2019-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the biggest fan of it.\nBut at least it was watchable.\n",
            "review_date": "2019-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another prime example of pure horror crash that should be avoided at all costs. We have terrible actors giving bland, emotionless performances along with its tedious script. Lifeless horror ineptitude without any scares or jolts in the slightest. The plot is pure garbage; as it has no logic, understanding circumstance, focus, or believable realism. Don't ever pick up the phone and answer the call to see this abomination. Overall Rating: 0.",
            "review_date": "2019-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It kills the cat. Screw this movie.",
            "review_date": "2018-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the Japanese version, but don't count out One Missed Call just yet. It has a couple very decent performances from the two leads. And there's some chills in there for sure.",
            "review_date": "2018-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst horror movie ever made.",
            "review_date": "2018-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not anywhere as good as the Japanese original. ",
            "review_date": "2018-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An insult to the Japanese version",
            "review_date": "2018-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "super creepy!! good movie!!",
            "review_date": "2017-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "horrible(enough said)",
            "review_date": "2017-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its just a disgrace to the original.",
            "review_date": "2017-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a good movie to watch",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is the first horror movie in quite awhile that scared the hell out of me way way better than the Japanese film upon which this is based",
            "review_date": "2016-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thanks to subtle performances, moderately creepy chills and a refreshingly modern approach to mortality, One Missed Call stands out from the crowded field of Asian horror remakes -- and slightly raises the bar for January's dumping ground of usually subpar genre outings.",
            "review_date": "2016-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I may just be one of the few people that liked this movie.  The concept of the movie is cool and creepy...was it an awesome movie?  NO, but I still enjoyed it.  There something very creepy about someone calling you telling you when you'll die (to the exact minute)  and the scene toward the end (at the hospital) is pretty cool.  Call me weird but I liked it!",
            "review_date": "2016-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One Missed Call a unnecessary remake. One of the weakest remake. Horrible execution on the plot, cheap scare scenes, horrible performance. This remake is very boring.",
            "review_date": "2016-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible movie. The story is way too much a combination of films (even if it is a remake), the attempts at scares are dull and pathetic, the visual effects are pretty weak, and the performances are lame, especially Burns.",
            "review_date": "2016-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little silly.. Always great to see Shannyn Sossamon in anything. The figures that appear to be following the characters are creepy as hell but the story is just eehhhh!!",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How does this have a rating of 0%???\nI saw this a couple of years back and thought it was great!",
            "review_date": "2015-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked the remake.It was very haunting and scary.I don't know what all the flack is about,I enjoyed it.",
            "review_date": "2015-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Little known but quite creepy.",
            "review_date": "2015-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watch the original",
            "review_date": "2015-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unnecessary and lame remake. One missed call \"misses\" getting scary or even building an atmosphere.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One Missed Call is 53 minutes of 'meh', 34 minutes of very scary, adding up to something not great. 42/100",
            "review_date": "2014-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What I got to say about \"One Missed Call\" is that it's not a good movie at all. The performances by the cast are so lifeless. The directing by Eric Valette is horrendous. The screenplay by Andrew Klavan is dreadful. \"The storyline doesn't make no sense.\" The cinematography and the score in this movie is okay. \"What I got to report is that \"One Missed Call\" is an terrible movie that is NOT a must see movie!\"",
            "review_date": "2014-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It requires a special kind of stupid to make a movie this bad. This is without a doubt the worst horror movie I've ever seen, and one of the worst movies I've ever seen. There are countless plot holes and inconsistencies, and it borrows heavily from The Ring; the protagonist has a certain amount of time to solve the mystery behind an urban legend before she is killed. The explanations for what was going on in the movie were so lame. Some stuff wasn't explained at all. There is also an extremely high amount of jump scares, all of which make you roll your eyes. One was so bad that the loud noise didn't match up with the \"scary image\". You'd think there'd at least be a little bit of tension to compensate for the lame jump scares, but there's a shortage on that too. You don't care about any of the characters because they're introduced, then killed of in about 5 minutes. You definitely want to miss this call.",
            "review_date": "2014-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "had its scary parts but just stupid after the scares",
            "review_date": "2014-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film you can put in the reject list without any worries.",
            "review_date": "2014-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one you'll be glad you missed.",
            "review_date": "2014-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not scary whatsoever.",
            "review_date": "2014-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can tell that they tried, but the outcome, acting, and atmosphere is poor. The idea is semi-original but the dialogue just sucks. Nothing but a few jump scares here and a few gorey scenes there.",
            "review_date": "2014-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Takashi Miike's original wasn't great--this remake proves even more tiresome and derivative despite some decently creepy imagery....",
            "review_date": "2014-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It isn't the worst horror film I have ever seen but jeez it went close to convince me that it was the worst",
            "review_date": "2014-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Girlfriend And I Loved It Would Suggest To All Supernatural Horror Fans!",
            "review_date": "2014-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One missed call is a decent movie although it could have been better Especially with a special effects.",
            "review_date": "2014-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most people know this movie because of it's zero percent rating on this site, and it's not popular with audiences at all and never has been, so as soon as I found out this movie got absolutely butchered I set out to buy it, and to my surprise One Missed Call is a frequently spine tingling and dark mystery chiller, I personally don't define it as a horror. There's always a sense of dread and a few jumpy shocks along the way, and these shocks are emphasised by some truly creepy imagery. I loved the scene when the first phone call comes through, the look on Shannyn Sossamon's and Azura Skye's faces are very convincing full of terror, this is a well constructed scene. One by one the characters are picked off in gruesome ways in a final destination sort of manner but this movie's gore isn't that effective. Although the characters aren't ones you care for, the cast's performance are quite good, but there are some short moments where the acting is a bit off key, a little life needs to be injected but I like the cast and the storyline creeps me out. I think Shannyn Sossamon is a great lead, I'd like to see more of her movies. You'd think because it's based on technology One Missed Call wouldn't be scary but it actually succeeds in giving the mobile phone a creepy vibe, or should I say tone.",
            "review_date": "2014-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was cool seeing Edward Burns but that was all I can say about it. Poorly paced and directed. Definitely a movie to scroll past if looking at a horror list. The story is confusing but not in a good way. You'll be thinking \"What just happened?\" but you won't care enough to really think about it or look it up. Poor film.",
            "review_date": "2014-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "laughed so hard at this horrific excuse for a movie.",
            "review_date": "2014-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More like One Missed opportunity. While the original may not be a perfect horror film, but it's way way better than this movie when it comes to exaction and a pay off.",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Life Threateningly Dull, Bad Direction, Awful Story, Terrible Acting and not scary !",
            "review_date": "2014-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Does the theatrical poster even sound like it's gonna show us a good movie?! Even the trailer sucks.",
            "review_date": "2013-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remake of a Japanese horror movie that turns into more of a suspense story than a horror story here. I enjoy Sossamon and Burns in just about everything, so I'm actually being generous in my rating. The story has no logic, The supernatural being isn't scary and the explanation leaves much to be desired. And then there is the ending... ugh.",
            "review_date": "2013-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not that bad. The cast just needs some acting lessons (over again).",
            "review_date": "2013-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Regarded as one of the worst horrors of the 21st century, although One Missed Call might be terrible enough to ignite laughter from the audience, it's certainly not in a \"campy\" sense and it's not in the same vain as Ed Wood's Planet 9 or even the Scary Movie franchise.",
            "review_date": "2013-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Predictable, oversaturated and over the top, One Missed Call is a poor imitation of a few horror classics.",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is this a humor movie? Is this a joke?",
            "review_date": "2013-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Really Not As Bad As People Make It Seem , I Enjoyed It .",
            "review_date": "2013-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the dialogue and special effects can be bad at sometimes, One Missed Call is enjoyable.",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want it but I wouldn't see it was the best scary I have seen cuz like I am a young teen and I have seen the shining so ya stupid",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the fact that this turkey made 45 million just goes to show how little people care about reviews lol",
            "review_date": "2013-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not horrible from what I remember. Has dust all over the cover since I haven't watched it since my fourteenth birthday party....",
            "review_date": "2013-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well, complete waste of time",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its my favorite movie i love it 5 stars",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good horror/suspense movie. Kinda creepy when you know how you're gonna die. Even over the phone.",
            "review_date": "2013-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this movie. Not in my top15 horror movies, but it's definitely enjoyable.",
            "review_date": "2013-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally failed remake! I even didn't watch this movie again and give the dvd to my friend",
            "review_date": "2013-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting is terrible and the scares were hit or miss for the most part, but what saves One Missed Call from being a complete disaster is some creepy imagery, and a mildly intriguing story. It could have been way worse than it actually turned out to be.",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The perfect example of why America needs to stop remaking foreign films. Their is literally nothing scary about his film and lacks any and all drive to actually be a good movie. It falls flat in every direction and is obviously made to be PG-13 for marketing reasons. It's dumbed down from the original, and it's awful.",
            "review_date": "2013-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'One Missed Call' is another boring PG-13 rated lackluster horror rendition. It's choppy TV-movie editing and endless plotholes make this entirely what it is; a disgrace unworthy of my profound words. I digress.",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not really scary but a pretty good flick.",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horror films unfortunately can't get any worse than this.",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once again the theme was good and engaging for any horror flicks, but then the execution was bad enough as it failed to provide several unanswered questions in the plot. And final twist was one the worst.",
            "review_date": "2013-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind of creepy, but doesn't finish well",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this movie.  It was actually pretty scary.  I mean especially since the whole world is like attached to their cell phones.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Original is marvelous. This shames it on every conceivable level.",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The texting baby is the only reason I watch this movie anymore.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Promised so much that it just didn't provide - it is a pure example of a good idea completely ruined by awfully bland filmmaking.",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad as bad can get with laughable \"deaths\" and zero scares. I like the idea and I found the ringtone creepy, so I'll stick with the trailer.",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not too bad, it's The Ring with moble phones.",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it wasn't that bad....",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pish...no plot and I was left wondering what was going on, people just kept dying and I couldnt get what the link was...KEEK...only scary bit was the masks as per the above front cover",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was good and plot was a surprise",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only thing scary about this movie is that damn poster.",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not too bad, some parts were rather freaky, but it wasn't horrible.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was bad even for a horror movie.  It was funny at times but the problem is it wasn't supposed to be funny.",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't get why this movie is getting such bad reviews it's a really creepy movie its like a mixture of the ring and the uninvited it was cool fun to watch with friends too GRADE: B+",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I got the Blu Ray version a week early and watched it tonight.... I enjoyed it considering every horror movie these days are all the same with a slight twist.... well the slight twist in this movie made the difference. The whole cell phone killer thing was neat, but what really grabbed my attention was the days before people were killed they would see all kinds of things even among normal society. Anyways it was fun and worth the money!",
            "review_date": "2012-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Need to rewatch this but I don't remember it being great.",
            "review_date": "2012-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stupid fuckin movie\nthis looks like another the ring movie\nonly with phone calls\nthis is so bullshit.",
            "review_date": "2012-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm being nice with 2 1/2 stars. The story was ok..the acting wasn't half way bad. But it wasn't scary.",
            "review_date": "2012-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a formula that has been employed by numerous films, many originating in Japan or some other Asian country. One Missed Call follows this formula to the letter, right down to the originating in Japan part. The only problem is that it seems to know we've seen it all before. The actors sleepwalk through their dialogue, and many times the hero of the story - a college student named Beth Raymond (Shannyn Sossamon), forgets to even react to the deaths of her friends. You see, all of Beth's friends are being killed off by a cursed cell phone voice mail message. It appears on your phone, and when you play it back, you hear the exact moment of your death. The friends are haunted by spooky visions of ghouls and decaying people walking around in broad daylight, until the character suddenly meets an untimely end in some sort of \"accident\" that makes me think the evil ghost in this movie took lessons from the ghastly spirit in the Final Destination films, as its method of killing people is somewhat similar. The Final Destination villain is much more flashier and complex in its killings, but you have to remember, the ghost in this movie is working under a much more restricted PG-13 rating, so you can't really blame it if its kills are not as bloody or grand.\nNow, let me ask you something here. If you knew that people were dying because of a mysterious voice message that appears on your cell phone, wouldn't you just try not listening to the voice message in the first place? This never dawns on Beth or her friends. They try smashing their cell phones to pieces, but this doesn't seem to halt the killer spirit's advances. I don't know if not listening to the message would save your life or not, but I figure if all of my friends were being killed after listening to it, I'd be willing to give it a shot. The movie continues down the expected path, and introduces our second hero, a police detective named Jack Andrews (Edward Burns). He's the only person who believes Beth's story about the cursed voice mail message, because his sister was a victim of it, too. They join forces to discover the truth behind the curse, and the clues fall right into place, leading them to a hospital that burned down a while ago. Everything that we saw happen in films like The Ring, The Grudge, Dark Water, and the like happens, and not even the characters don't seem to be all that surprised. They go through the expected motions, and so does the movie itself.When I say One Missed Call follows a rigid path, I am dead serious. There's not one single moment we haven't seen in similar-themed movies. I have not seen the Japanese movie that inspired this remake, so I don't know if the original was as uninspired as this. I will give the original the benefit of the doubt that it had a lot more life and energy than this. The characters all seem to be walking a pre-determined path, and what's worse, they seem to know it. There's nothing worse than when the characters seem to be smarter than the movie they're in, but they're forced to act like idiots, because it's expected of them to do so. The movie doesn't even do a good job of explaining itself from time to time. I'm trying hard not to go into spoilers here, but should you see this movie (not that I'm recommending you do), ask yourself why the corpse they discover in the tunnels underneath the burnt hospital was there in the first place? Also ask yourself how many reality TV shows are filmed live? And wouldn't having someone die on your show live on national television kind of cause more attention than it seems to in this movie? My personal favorite moment of the movie actually comes early on, when the film's first victim meets an untimely end. The ghost then decides to not only kill her, but comes back for the victim's pet cat moments later. Did the cat get an eerie voice mail too? One Missed Call is the very definition of an early January release, a time of the year when the studios usually unload their stinkers that they don't know what to do with. The fact that it's the only new movie opening this weekend in wide release means that it will most likely find an audience with kids and teens looking for a cheap thrill. If you're bored this weekend, and actually consider this movie, please don't. This movie does not alleviate boredom, it only causes it.",
            "review_date": "2012-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad. Just bad. Don't do it to yourself.",
            "review_date": "2012-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a pity that it didn't work out, because the original movie really had some good possibilities to be explored.",
            "review_date": "2012-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's tolerable.  Almost the Japanese ãç?ä¿¡ã?,ã,ã?scene for scene, aside from the liberties they took creating more strange creatures.  I don't know how it seems other reviewers say it's the worst US remake when it is practically the same movie.  \n\nWhen I started watching this movie I totally lost all hope for it.  It starts with a Japanese style house in the US, aside from Dave Spector making a cameo in the movie, I don't recall seeing any other Japanese related content, but the house seemed like the movie was trying to remind us, \"this story was originally from Japan\".  But I did quite enjoy the end of the scene, something a little more unexpected happens which you might expect to see at the end of a movie to be cliche.",
            "review_date": "2012-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the worst movies ever made.",
            "review_date": "2012-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Original Japanese version (I am japanese) was SO much better and scarier.\nAnother great movie ruined.",
            "review_date": "2012-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "omg loved the baby doll in the crib",
            "review_date": "2012-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll give it a 20% because there's one truly horrifying image in the film, but other than that, it's quite pathetic.",
            "review_date": "2012-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This remake of a Japanese film of the same name is about a ghost that is passed from person to person via their cell phones. After the person is killed the ghost grabs a person randomly from their cell phone contacts and calls their phone. The call is this weird ringtone and is dated for a future day & time. When they check the message they hear their own voice and what they will be saying at the time of their death. Edward Burns plays a cop who's sister was the first victim so he is working with a group of college friends to try and find out who or what is doing this and how is it happening. I like Burns so I enjoyed him in this. The ending left me cold so that is the only major issue I have with it. All in all it's a good watch and got some good spooky moments.",
            "review_date": "2012-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A ridiculous, incomprehensible tangle. I think it's actually a good premise, but the story doesn't support it and it makes less sense with every passing minute. Not even the solid Edward Burns can make a dent in this one. All that being said, it is still, strangely, watchable. OMC is a remake of a 2004 Japanese film and even that version was critically panned. And I think that is the root of my dislike (not the critics, but this particular storytelling subgenre). A lot of Japanese horror (and, IMO, a disturbing trend in U.S. horror) ends with the evil continuing. I want the 'good guys' to have more than a fighting chance to win, I want a survivor to ride of into the sunset having vanquished evil. Scares are why we come but nihilism doesn't add realism or intensity, just pointlessness and depression.",
            "review_date": "2012-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a great scary movie, kinda dumb simple plot. I like the movie :)But it sucks. Doesn't suck enough to be funny either.Really bad remake.\nStill a childhood fav :)",
            "review_date": "2012-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"One Missed Call\" is a complete mess of a horror film. It starts with a ridiculous premise: what if your mobile phone killed you? (an idea that has already become the subject of several parodies) and proceeds to run it into the ground. Basically, people receive a strange phone call where the sender leaves a message for them on their voice mail and it is dated from the future (for instance, if it was Thursday, they might get a call listed as Friday, 4:00 pm). Once you listen to the phone call, you realize that it's the sound of your upcoming death, which, despite your best efforts happens at the exact time of your voice mail. Your only hope to evade this fate is to go back to the beginning, using the hallucinations you receive as clues to figure out where the chain of deadly phone calls began.\n\nThe characters in the story react so casually to the events that are happening that you can't get invested in them or sucked into the story. You get some small glimpses of creepy distorted faces and there are a good amount of dead bodies in the end but if the victim's friends don't care, why should you? Like most movies based on Asian horror films, the story here is a mystery where the main character has to find the source of the curse in order to end the chain of events that threatens her. The idea with this type of tale is that as our main character Beth (Shannyn Sossamon) gets closer to the solution, the number of possible victims keeps getting smaller and smaller until she is trying to save herself or a few key characters by finally exposing some hidden truth or unleashing some kind of trapped spirit or something. Basically it gives us an explanation for why everything has been going on and she saves herself in the process. In this story the explanations for why phones are killing people are very loose and don't really make any sense. It actually gets downright silly when you see a dead body dialing a cell phone and the movie never makes its main characters act logically. There is one scene where we see a potential victim smash her phone and throw it away, which would be a logical thing to do, but everyone else feels like they're too attached to their phone contacts to actually try and intervene in the deadly chain of events. How stupid are these people?! We have established that the chain of deaths happens because the names of future victims are inside the phone of the previous ones... at least TRY and stop the murders by deleting numbers from your address book!\n\nThe film feels like a desperate attempt to make a concept that no matter how hard you tried, could never really be scary. There is a death at the very beginning of the film where someone dies, and they pet gets killed right after by the ghost and it makes absolutely no sense. Not only that the animal itself dies, but the way that it dies doesn't not match the explanation we get at the end of the movie at all. Well, unless it was one of those cats who likes to text people on their cellphones, I see those all the time in real life. The movie is PG-13 so even horror fans that can accept the thinnest of plots as long as they get their blood and nudity will be disappointed. With these limitations, you would think that this rating would direct the film into more suspense and unsettling imagery but there is only a tiny bit of those horror elements in the film. There are some great makeup effects towards the end of the story and this is where pretty much all of the excitement is concentrated. The more you think about the movie, the more it starts to fall apart and it becomes a ridiculous attempt at making a ghost horror movie. There's no reason to see \"One Missed Call\" instead of the many other superior Japanese horror ghost films that have emerged unless you really will get scared by anything and want an extremely tame horror film. (On Dvd, October 12, 2012)",
            "review_date": "2012-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IT WAS A PRETTY GOOD MOVIE....LIKE THE RING TONE...",
            "review_date": "2012-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "actually i didn't think this was so bad really. maybe cause i had such bad expectations i thought it was alright after all. it wasn't fantastic or anything but it didn't make me cringe in agony.",
            "review_date": "2012-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i havent seen the original one but that was watchable\n\nok..stupid and reminds me on final destination indeed... \n\nending was.... lame....",
            "review_date": "2012-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decent premise starts out with real promise -- only to end up with total dullness. Would be interesting to compare it to the original, which I haven't seen yet.",
            "review_date": "2012-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know that I'm a bit jaded by horror, but not even remotely scary. Maybe two creepy scenes in the whole thing.",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "for the whole day. i did not make a call",
            "review_date": "2012-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Laughably stupid.  One of the worst movies of 2008.",
            "review_date": "2012-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wasn't too baffled when i saw this movie on tv i know this Shannyn the nude wannabee to be like Angelina Jolie has the stupid acting roles on most filsm i watched unlike the 3 fresh films she has at least peformed unlike she did last year. As i can say for one missed call on american basis on the remake, just watch it for like 10-15 minutes and move along cause one missed call on the remake had nothing to do with Takashi Miike's one missed call (Japanese) in any manner or any plot to show all of us how the film should plot as.\nI rather give this film a F- for amateur college work.",
            "review_date": "2012-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nonsensical nonsense. For once it's just as bad as everyone says it is.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was like I know what you did last summer's Japanese relative which is still awful",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is it possible to give a 0 star rating? Seriously...this movie sucked.",
            "review_date": "2012-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never saw it, I was making out the whole time.",
            "review_date": "2012-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ok.. ending blew donkey balls, it sucked",
            "review_date": "2012-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "meh not bad glad iv seen it but wouldn't of cared if missed it",
            "review_date": "2012-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Proberly the worst horror movie i have ever seen, poor script, terrible adaption of a already terrible japanese film.",
            "review_date": "2012-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was some creepy parts but the whole movie was confused and we couldn't easily understand the story especially the ending",
            "review_date": "2012-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even my crush Shannyn cannot save the movie... thank God she's there to entertain me, through her beauty......",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It started  really well and got intense but the ending kinda sucked. It deserved a better ending!",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilariously bad acting and attempted scares. The movie plays out more like a comedy that I often watch with my family. Horrible, but manages to entertain because of that, so its cool with me. The scene with the (supposedly) scary baby holding a cell phone is priceless.",
            "review_date": "2012-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh My God This Movie Was Funny As Hell!",
            "review_date": "2012-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the absolute worst films that I have ever had the displeasure of watching",
            "review_date": "2012-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I haven't seen the original but this is bad.",
            "review_date": "2012-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i thought it was pretty good a little corny but what scary movie isnt",
            "review_date": "2012-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Move on nothing to see here...A weak remake of the Japanese film. Bland and boring with flat and lifeless performances from the whole cast...No scares or shocks either. Spend your time more wisely and avoid this film",
            "review_date": "2012-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst japanese remake. Why bother doing it. All of the movies are the exact same. Which is not scary and very predictable.",
            "review_date": "2012-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Atmospheric, but nothing about it makes any sense at all. Gets points for the utterly ridiculous, random cat death at the beginning.",
            "review_date": "2012-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One missed call is just one of the worst horror movies ever. An awful plot, the actors were terrible and I think the people who casted them were smoking Crack to make them choose these disturbing actors. WHY WOULD YOU MAKE THIS MOVIE!?!?!?!?!?!?! This was completely stupid and it had nothing at all.",
            "review_date": "2012-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a killer phone call film, had to happen one day i guess. this is quite bad and full of cliches that don't work. Ed burns is going through the motions here and offers a typically bland performance. the ending is just a waste of time, how a film can be this bad is beyond me",
            "review_date": "2012-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible remake! It wasn't scary at all, and the acting was so bad.",
            "review_date": "2012-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grade: F\n\n        A Japanese remake that wasn't meant to be touched. One missed call is about a voice mail you get from a missed call. The voicemail is your final moments and soon you will have them. Pretty good idea but poorly written with predictable and boring acting and direction. One missed call is not worth a look at. I couldn't even finish it....",
            "review_date": "2012-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ben I heard you were living near Christians",
            "review_date": "2012-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The script is okay. Meh. The visuals are bad, the acting is horrible, and the moments are predictable. One Missed Call is one flawed horror.",
            "review_date": "2012-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not terribly shitty.",
            "review_date": "2012-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Right next to the haunting of Molly Hartley this is the worst horror film I've ever seen. There's not one good thing I can say about this utter disaster that never goes anywhere. The story's strange,consulted and never makes any sense until the end where they somewhat try to explain it but still does not help it at all. There's absolultley no character development so if someone dies you really can't give a crap. The acting is horrible and there's sadly no one decent enough performance in the entire film. And the movie never feels scary. Throughout it always try's to put this creepy vibe with the characters having strange visions but the cycle gets continuously done over and over throughout. If it wasn't scary the first time it won't get better. And it's also filled with lame,cheap jump scares throughout. One missed call is bland and just downright a horrible movie with no one good aspect to it.",
            "review_date": "2012-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh man. This could have been so bad it's good. Reasons:\n\n1. A cat dies with one of the victims of the evil voice mail. Did it have a phone too?\n\n2. No explanation behind the voice mail\n\n3. Dead people spitting candy\n\n4. A cell phone is exorcized. Actually. A CELL PHONE IS EXORCIZED.\n\n5. the ending makes no sense.\n\nSo how was it so fucking DULL?!",
            "review_date": "2012-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting twist but very common plot.",
            "review_date": "2012-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "omg!!! CRAP!!! don't waste ur time with this one...expected so much more..what happened to all the good scary movies...???",
            "review_date": "2012-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stupid film thats not even scary.",
            "review_date": "2012-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Silly, but not stupid enough to be entertaining. A bore.",
            "review_date": "2012-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It had its moments...",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "yeah, really not worth my time. it was more funny than it was scary",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A creepy....scary.....gift to all horror fans!!",
            "review_date": "2012-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting. Kinda like Final Destination but with mobile phones. Creepy little girl, but otherwise this had a seen it all before feel.",
            "review_date": "2012-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The general idea behind this film seems to be a very close rip off of The Ring, made by a bunch of people who just couldn't be bothered.  Shoddy idea for a horror film is made even worse by bad acting and a script that will send you to sleep before the half way mark.  Pointless :o(",
            "review_date": "2012-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow when i looked this upp (on the flixter app, it shows you all the suggestions for what you searched. it also shows you either rotten tomatoe ratings or flixter (depending on how you have it set, but once you press the movie it shows you both)) it didnt have a rt rating in the suggestion (how i have it set) once i clicked it though, it showed a lot of critic ratings. not a single one rated this movie positively. personally i found this movie mildly entertaining. it wasnt that good but it also wasnt god awful either.",
            "review_date": "2012-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How not to remake a Japanese horror movie.",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dont answer the phone",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somewhat a good concept but confusing like whatâ¦?",
            "review_date": "2012-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absurd plot and terrible acting. The effects, direction and sets are the only things that stop this from belonging on the \"worst-of-all-time\" list.In an unprecedented display of generosity, i'll award it half-a-star. Just for existing.",
            "review_date": "2012-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good but it reminded me of Final Destination !!",
            "review_date": "2012-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was crazy until the end",
            "review_date": "2012-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the worst Japanese horror remake, but not the best either. It was pretty good, pretty freaky, and Shannyn is pretty herself. Kind of enjoyed it, but wouldn't rush to watch it again.",
            "review_date": "2012-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a sick movie!!!! It relied too much on jump scares and the story is just pathetic!!!! What gives that little  girl(freak!) the right to kill people? One Missed Call is the worst horror movie I have ever watched!",
            "review_date": "2012-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "freaky...love it....i dont know if i want that stuff to happen to me.",
            "review_date": "2012-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kinda good movie liked it recommend it :D",
            "review_date": "2012-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Talk about corny, because this one really fits the bill. Yet, it's camp value couldn't keep it notorious (\"Twilight\" came out 11 months after this).",
            "review_date": "2012-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was AMAZING. I loved it!",
            "review_date": "2012-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was good... it was kinda creepy at parts.",
            "review_date": "2012-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie.  Would be amazing to watch with full surround sound for all the freaky ass sound effects and quick noises when something jumps out at you.",
            "review_date": "2012-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "J-horror remakes are dead.",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie had a great start 2 it but the end pissed me off i was just like what the fuck! it angered me really",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mildly entertaining as a comedy at best",
            "review_date": "2012-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as American J-horror remakes go, this might be the worst (and I've seen The Uninvited).",
            "review_date": "2012-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film should never have been made. Choose another. Dont waste an hour and a half of your life on this piece of garbage.",
            "review_date": "2012-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "C+\n\nWasnt scary at all but it has its moments were i kinda jumped. Other than that i would pass on this movie.",
            "review_date": "2012-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a relatively interesting enough premise, but just not well put together. It reminded me a lot of 'The Ring' (Verbinski's version), but lacked its gravity, mood and sense of omnipresent fear. I lost interest...",
            "review_date": "2012-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After seeing the japanese versions of all three movies this was laughable, it had tension but very little horror",
            "review_date": "2012-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Look at the tomatometer, both \"All\" and \"Top\". That's all you need to know.",
            "review_date": "2012-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "decent scary movie, similiar to a final destination mixed with japanese horror..but it had its frightful images, but the overall feel was a little weak",
            "review_date": "2012-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gosh! I wanted this movie to be good so bad, but once again there is something wrong with horror films these days, they just cant get it right.",
            "review_date": "2012-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I WAS SOOOOOOOOO SCARED!!!! It was really weird!!! But i was scared!!! lolz",
            "review_date": "2012-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A group of people begin to receive voice mails and messages from their future selves with some that include the dates, times and even some details on their deaths.  Sound bad to you?  One Missed Call is a terrible horror mystery flick.  It's an American remake of a 2003 Japanese film.  It's less horror and more horrible, lacking anything really scary, unless you count the script.  There are no real shocks or anything to make you jump either.  If you've seen some of my other reviews you'll know I'm not a big fan of PG-13 horror movies, there's only a handful I can stand.  The story is pretty lame and seems to rip off other horror films mostly the Final Destination series.  The cast is all ok for what they have to deal with including Shannyn Sossamon as our heroine Beth Raymond, Edward Burns as a detective, and Meagan Goode, Margaret Cho and Ariel Winter are some familiar names in the cast. I also found it amusing that this film has a 0 percent on Rotten Tomatoes.  If you come across One Missed Call somewhere, this is definitely one call you can miss!\r\n\r\nGets A-List Rating of: Suck It!\r\n\r\nSubscribe to me on Youtube at www.youtube.com/wesida15 Follow me on Facebook at www.facebook.com/westroopalist and on Twitter at www.twitter.com/wesalist",
            "review_date": "2012-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad movie at all. Had some good deaths. some good thriller parts. Not scary but shocking at some points.",
            "review_date": "2012-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I must say that I think I liked this movie more then I like most horrors since they've really gone down the tube. Because instead of just something scary popping in and out at random it actually feel under a story line! Which was actually quite suprising and it had a twist at the end that you probably wouldnt have expected. The acting was pretty good and the overall completion of the movie was good and it could be creepy.",
            "review_date": "2012-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible. Just terrible.",
            "review_date": "2012-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love these kinds of movies. So bad, yet so good. I can't ever get enough.",
            "review_date": "2012-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its idea is bad, the scary moments arent too scary, and its boring.",
            "review_date": "2012-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the worst Japanese horror remake, but not the best either. It was pretty good, pretty freaky, and Shannyn is pretty herself. Kind of enjoyed it, but wouldn't rush to watch it again.",
            "review_date": "2012-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie just tries to hard at immitating the Ring but does not even come close to the chills that movie gave. This time instead of a video, it is a cell phone call you receive which comes from a dead person with your voice on it and date and time of death. In order to try to survive the call Beth (Shannyn Sossamon) who has already witnessed how three of her friends have died after receiving the phone call has to team up with the only police officer who beleives her story (Edward Burns, as to why he got involved with this film I still cant understand as he is a good actor). He believes her because her sister has recently died in a similar way but it seems no other cop is willing to help which is only natural in these movies. Together they will have to find a connection with these mysterious deaths and dont be suprised with the ending which also es very similar to the Ring. I didnt like this film which delivered very few scares if any. The visions which were supposed to be scary just seemed like normal people wearing bad halloween costumes. The only thing I will remember from this movie is the ringtone which I would like to have on my cell. I recomend you to skip this movie as it seems we have already seen these movies a million times before.",
            "review_date": "2011-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shitty rip off of the Final Destination series..",
            "review_date": "2011-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a bad horror flick and it was way too predictable.",
            "review_date": "2011-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not good. Nothing explained. Just bad.",
            "review_date": "2011-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its not that bad but the original Japanese movie Chakushin ari ( one missed call ) is much better than this one",
            "review_date": "2011-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Avoid this movie. Watch the original even if you have to read subtitles.",
            "review_date": "2011-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "all of these remakes are now becoming predictable.  the hero/heroine finds some dead person and \"saves\" them and by doing so the evil stops....it was an ok movie and shannyn is HOT, but don't watch it.",
            "review_date": "2011-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a good one i enjoyed it",
            "review_date": "2011-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't get why this movie is getting such bad reviews it's a really creepy movie its like a mixture of the ring and the uninvited it was cool fun to watch with friends too GRADE: B+",
            "review_date": "2011-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the Worst horror films ever.  I have never seen a plot that is as stupid as this.  It had horrible acting.  The actors were hand picked by retards.  It was also a rip off of The Final Destination.  It was retarded as shit and I will never watch again.",
            "review_date": "2011-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was pretty crappy but I enjoy this kinda crap.....lol",
            "review_date": "2011-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "waste of time with an ending that makes zero sense.",
            "review_date": "2011-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This might be the worst movie I've ever seen.",
            "review_date": "2011-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You missed the call, but dont even check the voicemail. Its not worth the time.",
            "review_date": "2011-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst and most unnecessary remakes ever made.",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "reminds me of final destination how  people just  mysteriously  end up dead  by some unknown  force but  i loved  the  many  twists  and turns  in the film   overall  i really  enjoyed  the film  and  the cast  performances",
            "review_date": "2011-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the worst remakes ever.",
            "review_date": "2011-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this for the ringtone ...",
            "review_date": "2011-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Does not compare at all to the original Japanese version!",
            "review_date": "2011-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one you can live without seeing but if the chance to see it comes up then there is no reason not to. The reason I only gave this movie 2 stars is because this movie is not very scary at all and most of the scares fall short. This movie is about what your death will sound like, you get a phone call from some creepy people. This movie is enjoyable and is one that I'm glad I saw but I won't be going around telling people how awesome it is. I would recommend this movie to someone who is just plain bored and has nothing to watch but this movie is not something to fight for to see.",
            "review_date": "2011-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acceptable English language remake, but leaves too many questions unanswered.",
            "review_date": "2011-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crap. I didn't even watch this to the end and I bored to death in the middle of the movie. So bad it stinks a mile before you're at near this piece of monkey shit. Cheap and lame, horrible and disgusting in a bad way.",
            "review_date": "2011-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "no scares or thrills & sexy meagan good dies in the beginning,no way.",
            "review_date": "2011-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is the CGI bad? Without a doubt. Is it entertaining? Ehh why not? It has a good story and some laughable momments.",
            "review_date": "2011-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seriously?? a haunted mobile phone? who writes this bullshit? I'll get back to writing a film about a talking pie, on the strength of this I'm sure a Hollywood exec would go nuts for it.",
            "review_date": "2011-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I have ever seen!",
            "review_date": "2011-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The victims in this comedy...er...horror flick receive a phone call that tells when they will be killed, what color shoes they'll be wearing, the brand of their hair gel, who they last kissed, when their last bowel movement was, their grandmother's maiden name, their grandmother's social security number, the name of their favorite indie band, who killed Kennedy, and other startling facts. Once they've been marked, they see strange things like babies on fire, bugs crawling through people's skin, dolls wielding knives, men with pennies jammed up their noses, feet covered in bird feathers, dogs walking backwards, and other unsettling and fairly cliche horror shticks. When the victims finally die in gruesome but accidental ways, a hard candy is found in their mouth, a tattoo telling you where you left your bank card behind their ear..... okay, I'm getting a little bored with this. But honestly, it was just cram-packed with the dumbest, most unrelated visuals I've seen in any movie. The plot resolution isn't much more coherent either. I should have figured this is what I get for an early January release that sneak previews at 10PM on the evening before it opens, and your big name is Margaret Cho.\r\n\r\nI'm disappointed in this movie for a variety of reasons. Here's the rundown:\r\n\r\nAtlanta shot movie. I'd love to see good movies come out of Atlanta, but when this is what you associate with the film scene here, it's not much help. I will say the hospital set was absolutely beautiful. I didn't recognize it, but it has to be an abandonment in Atlanta.\r\n\r\nThe trailer was actually pretty good. I usually don't care for horror trailers, but this one was appealing in some way. That's rare for me.\r\n\r\nIt starred one of my new favorite actors, Shannyn Sossamon. She also starred in what was my favorite film of 2007 Wristcutters: A Love Story. She did as much as she could with it, so props Shannyn.\r\n\r\nOh, and for once I'd like to see college students living in a dumpy apartment with 9 other people, and not in lavish mansions by themselves. Who are these people? I'd kill them too.\r\n\r\nOne Missed Call is one painful ride. Save your time (thankfully my experience was free), and go see anything else.",
            "review_date": "2011-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thrilling, this is a movie where death calls you from your phone saying: \"Time's up dude!\"",
            "review_date": "2011-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before seeing this, I had heard many, many bad things about this film. Every review was negative. So, initially I passed up on it. But then, I just decided to watch, and to my surprise, it wasn't too bad. I thought the film was borderline decent considering all the flack the film received. I thought the film was eerie and had a lot of atmosphere, which I liked, but it lacked in character development. The parts where it was supposed to very creepy were good, and did work, but they could've been done slightly better. I enjoyed Edward Burns in this film, and I thought for a remake, it had a few decent scares. But of course this remake doesn't even come close to the original. For what it is, One Missed Call is actually fairly decent, and manages to be quite fun, if you forget that this is indeed a remake. But like every other remake, it fails to capture the essence of the original, and like with every other remake this remake tries to outdo the original with fancy special effects. The film is decent, managing only a few good scares. But this isn't as bad as everyone has said it was. Though nothing will beat the original, this Americanized version is fairly entertaining and manages to be quite fun if you allow it to be. But don't go in expecting something great, go in with decent expectations, and you might like this.",
            "review_date": "2011-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I only liked the ringtone.",
            "review_date": "2011-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies ever made. It isn't scary, funny, romantic, or exciting in any way. I won't miss this crap.",
            "review_date": "2011-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie.\r\nGreat story.\r\nGreat cast.\r\nThe best movie with Shannyn Sossamon.",
            "review_date": "2011-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found myself laughing more times than I was feeling scared. Actually I don't think I was ever scared during the movie. Just a really crappy film.",
            "review_date": "2011-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow when i looked this upp (on the flixter app, it shows you all the suggestions for what you searched. it also shows you either rotten tomatoe ratings or flixter (depending on how you have it set, but once you press the movie it shows you both)) it didnt have a rt rating in the suggestion (how i have it set) once i clicked it though, it showed a lot of critic ratings. not a single one rated this movie positively. personally i found this movie mildly entertaining. it wasnt that good but it also wasnt god awful either.",
            "review_date": "2011-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm actually mad at myself for going to see this in the theater.",
            "review_date": "2011-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another typical horror with nothing special to talk about!",
            "review_date": "2011-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked this Japanese Horror Film.It had a very interesting story, and it is also very scary. Has one of the scariest scenes\\moments i've ever seen in a horror movie.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is such a freakin' stupid movie. Not scary, awful acting, and just awful scripting and directing. D-",
            "review_date": "2011-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1.0/10\r\n\r\n                      Nobody should be asked to watch a movie like the U.S. remake of \"One Missed Call\", just as nobody should be asked to make it. It's a movie that probably couldn't have worked as a remake, whether we liked it or not, but gosh, it could have at least been slick and mildly engaging. Why is it that so many of the worst movies I've ever seen end up coming out of the genre I favor the most? Maybe it's because all people care about these days is money; how much they make, how much people watch the thing, and how much stupid little teenagers want to squeal at it. And with \"One Missed Call\", if the teen crowd goes to be scared, then they will be.\r\n\r\n            The film is one missed opportunity. Within it are actors who have talent that they should not be wasting with this trifle, and better yet, there are also props and special effects that could have been used on a much better movie. Yeah, I get it; most horror movies are bad. But they have no right to be this bad. Here's a movie that goes against all genre rules, and doesn't give a damn about why I go to see horror films in the first place. It aims in the wrong areas, plays things \"PG-13 safe\", and misses oh so miserably.\r\n\r\n       The film is a remake of \"One Missed Call\"; that Takashi Miike horror movie from, I think, 2004, that I didn't even like. That movie alone was kind of a snooze-fest, but believe me, this film is even worse. A lot of the plot elements from the first film are dragged over to the remake, one thing which is, of course, the premise.\r\n\r\n     And this is a premise that you probably know of, since for some odd-freaking-reason, this movie was actually popular. The premise involves a ghostly ring-tone from beyond the grave that, when you pick up the phone, plays an audio clip/message (?) of your last few seconds before death.  The premise, as before, attempts to tackle the paranormal and the technological; and it tries to make a statement. The original film came pretty close, but didn't quite make the cut. And neither does the remake.\r\n\r\n       So just some of the victims, among others, are Beth (Shannyn Sossamon), Taylor (Ana Claudia Talancon), and Detective Jack (Edward Burns, who sounds like he has serious strep throat). These characters suffer hallucinations, one dying early on in the film due to the ring-tone of death reaching her cell. They see ghosts until they become their prey (since these ghosts do more than just stand there and stare at you).\r\n\r\n     The problem is not the premise. As I said with the first movie, the concept is OK. And I like what these \"One Missed Call\" flicks are trying to do, but message-making just doesn't come their way too well. Instead of something intelligent and creepy, we get a movie that is silly, dumb, and lame to the point where it's pretty much unwatchable. I can't imagine a single horror fan finding it scary let alone entertaining, and if you know anyone who admires it or thinks it is scary/creepy, then I suggest you either tell them to snap out of the trance, or to get new friends.\r\n\r\n     The film does not scare, and I do not scare easily. The whole thing is jump scene after jump scene, to the point where the film might as well be pleading for me to jump out of my seat and scream at its attempted \"Boo!\" moments. The ghosts that we see are products of special effects rather than the imagination, and this is the problem. That doesn't scare me, and it doesn't scare anybody who's actually seen a good horror movie in their lives. \r\n\r\n          As of now, the only good thing there is to mention about this excruciatingly bad attempt at a horror movie is a cat-death-scene, in which a defenseless feline is dragged underwater by a creepy hand. I feel bad for the cat for two reasons, (1.) because he just died, and (2.) because he had to suffer being in this mess of a movie. Poor kitten; poor movie.",
            "review_date": "2011-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So so....never really explained the psychotic little s**t that played the main character.",
            "review_date": "2011-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "American movie makers have done it again. They took a perfectly good Asian movie and flipped it to a D rated movie. Not only is this movie far from scary, the mystery portion of this movie isn't even every mysterious. The acting is terrible and the story is hard to follow. I am going to be downloading the ringtone because that's the only thing this movie had that was worth my time: a creepy ringtone.",
            "review_date": "2011-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Again another film that is truly unbelievably unoriginal... Seems like a rip off of Final Destination to me, with somewhat mediocre acting mixed with quite frankly a bad story idea... Hell maybe the Japanese made a better version, but I think this film has put a stop to me watching it.",
            "review_date": "2011-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What?? so many people hate this movie? This is a great movie for teenagers, its the same theme as the grudge or the ring. yes, it really was kind of stupid...especially the ending...but all in all it did a good job of keeping you watching. They could have done more with it...but the creepy ring tone was perfect! i wouldn't suggest it to a horror movie buff...but maybe to a group of 14-15 year olds that want to be scared but not see anything too gory. i wouldn't give it 100% thumbs down though.....have you seen 2001 maniacs? haha.",
            "review_date": "2011-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\" That's not my ringtone. \"",
            "review_date": "2011-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It painfully lacked the luster of the original Japanese version...",
            "review_date": "2011-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than most, however I think the original would probably be much better. Effects were good, story interesting but nothing I haven't already seen in many other movies previously.",
            "review_date": "2011-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst J-horror remakes to date -- the only life in One Missed Call is its unintentional comedy.",
            "review_date": "2011-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is just a piece of shit",
            "review_date": "2011-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cell phone rings and death is on the line\r\n\r\nA series of friends begin receiving voicemails and mysteriously die shortly after listening to the message.  A cop believes one of the friends's stories and begins helping her uncover a strange story of a mother and some orphans.  How is the mother's story related to the dying friends?  \r\n\r\n\"When I call you I expect you to come.\"\r\n\r\nEric Valette, director of Hybrid and State Affairs, delivers One Missed Call.  The storyline for this picture is nothing special and seemed like a mix of Final Destination with House on Haunted Hill.  The overall premise is a bit ridiculous and discombobulated.  The acting is mediocre and the cast includes Edward Burns, Shannyn Sossamon, Ray Wise, Ana Claudia Talancon, and Azura Skye. \r\n\r\n\"Now this will only hurt a little.\"\r\n\r\nOne Missed Call is a film that came free with another DVD I purchased.  It took me a while to get around to seeing this based on its poor reviews.  I can say there were a few interesting kill sequences in this film; but as a whole, this movie is an unoriginal pile.  I only recommend seeing this film if you are a die hard horror genre fan.\r\n\r\n\"But she always gave me candy.\"\r\n\r\nGrade: D",
            "review_date": "2011-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "thort this would turn out like any other teen scream but really enjoyed it I wonder if Heath would have played Ray hmmm",
            "review_date": "2011-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is on right now!!!",
            "review_date": "2011-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A waste of talent, enjoyable only by those who've no better thing to do with their time.",
            "review_date": "2011-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "no chance in hell imma watch this piece of crap",
            "review_date": "2011-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is ridiculous, the characters are drab and every bit of dialogue is laughably insipid. It's one of the worst horror movies to come out post 2000.",
            "review_date": "2011-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was gar-bahj, neither scary nor interesting with a lot of crappy acting. snooze.",
            "review_date": "2011-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the Worst horror films ever.  I have never seen a plot that is as stupid as this.  It had horrible acting.  The actors were hand picked by retards.  It was also a rip off of The Final Destination.  It was retarded as shit and I will never watch again.",
            "review_date": "2011-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Laughable, lousy, and atrocious; One Missed Call is the lowest any Japanese adaption - or horror film overall - could ever reach. However, the unintentional comedy may leave a smile on your face.",
            "review_date": "2011-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is exiting and fun. a must see.",
            "review_date": "2011-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "J-horror remakes are dead.",
            "review_date": "2011-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad movie, very typical though.  Probably won't watch this one again.",
            "review_date": "2011-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A failure compared to the original, but makes for an ok watch on its own. The movie feels choppy though, as if they had edited 15 minutes worth of plot. The creepy bus stop mom rules however.",
            "review_date": "2011-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one you can live without seeing but if the chance to see it comes up then there is no reason not to.  The reason I only gave this movie 2 stars is because this movie is not very scary at all and most of the scares fall short.  This movie is about what your death will sound like, you get a phone call from some creepy people.  This movie is enjoyable and is one that I'm glad I saw but I won't be going around telling people how awesome it is.  I would recommend this movie to someone who is just plain bored and has nothing to watch but this movie is not something to fight for to see.",
            "review_date": "2011-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eh this movie is the typical remake, it sucks. The acting was alright the death scenes lame compared to the origional. Nothing creative spectacliur, none of that. Honestly as i said before its your typical remake nothing good. Stick to the original japaneese one and if you dont like watching them cause subtitles then its your loss. Most disappointing scene (spoiler) is the death at the excorcism TV show just the little handprint puff out on the neck, it was so stupid so lame. The japaneese one now that was grusome and so fricken painful. Stay away",
            "review_date": "2011-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It had a few frighting parts; creepy baby, dead women crawling, being pulled into a pool, and the creepy music that goes along with it oh and the evil little girl!",
            "review_date": "2011-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A far cry from the original.",
            "review_date": "2011-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly timewasting. This is exactly what you'd find in a bargain bin. Everything about this was bad and useless. Nothing made sense. You don't even see clear shots of the kills!",
            "review_date": "2011-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A++++ would watch a dozen more times",
            "review_date": "2011-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was awful. I thought it would not suck as much since Shannyn Sossamon and Edward Burns starred in it. I was wrong. I am just glad that I did not waste any money to watch this movie.",
            "review_date": "2010-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very entertaining horror.",
            "review_date": "2010-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WOW!\nCOULD THIS GET ANY WORSE!",
            "review_date": "2010-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad movie, just not a great movie. Although it is another remake from Asia.  it had its moments, two jumpy parts.  A plus is that Edward Burns is in it, he is good in anything.  Shannyn - the lead, well could have been recast, and the movie might have done better.. ------ ahhhhh never miss a call....",
            "review_date": "2010-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not scary, it's so lame and dumb, you can see this kind of story on several episodes of Supernatural.",
            "review_date": "2010-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad for an americanized remake. But not a good either. All i'm saying is it could've been worse...and the original wasn't all that either so...yeah.",
            "review_date": "2010-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just more mysterious/supernatural killings....like ut oh im next....I need to find out what happened to make things right or im dead in 4 days....someone lives...horror is over...or isnt it??? PLAYED OUT!!! The Ring, Fear.com, The Eye, etc.....",
            "review_date": "2010-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not so scary :S lool and the cat part made me laugh haha but yes more suspense than horror from wht i thnk it was weird thts relly it",
            "review_date": "2010-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found myself really enjoying this movie and I could not wait to see what was going to happen next.",
            "review_date": "2010-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not nearly as bad as the rap it got, but nothing to write home about either, \"One Missed Call\" operates with a subtlety that acts as the film's strength and weakness simultaneously. While not resorting to cheap scare tactics is somewhat refreshing, the film doesn't quite know how to scare without them in several places. Overall, it's a decent attempt.",
            "review_date": "2010-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOL -- what a piece of crap. Kill me before I watch this shit again.",
            "review_date": "2010-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crappy remake of a cool Asian horror. This has a few decent ideas but overall is nowhere near the creepiness of the original. I've seen some of the Asian horror remakes and this is probably the worst i've seen so far.",
            "review_date": "2010-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "something like The Ring... but here death is calling to you not see it on the TV!",
            "review_date": "2010-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poorly written. Badly Acted. Highly Predictable. \nEdward Burns is hitting rock bottom!!!",
            "review_date": "2010-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty scary, a nice way of showing an occult practice of something that isn't clear in the beginning, but connects victims by leaving a message on their cell phones. Thru a disturbing view you, and the main character start getting it. With the help of the detective, the only one who believes her, she finds the reason for the death of her friends, a mysterious and strong element in this film. It's pretty creepy and rather succesfull. Acting is a bit dissapointing but otherwise a nice progression of evil. Good!",
            "review_date": "2010-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't bad but I always think that movies with a supernatural killer or ending are a less scary because they aren't true, but any movie with things jumping out are pretty scary sometimes. It was a decent movie with a good, creative idea. I think Sannyn Sossamon did a good job in this movie. I liked it for the most part. \r\n\r\n\"That's not my ringtone.\"",
            "review_date": "2010-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not sure why the americans on imdb hate this movie, its actually really good and plan to buy it in the future",
            "review_date": "2010-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film would have had a higher rating if the plot had made a little more sense. By the end of the film I was still wondering as to why the main character was the main character. The connection didn't make sense.",
            "review_date": "2010-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was about exactly what the title says. It was a fairly decent horror movie. With an actual storyline.",
            "review_date": "2010-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Reminds me of the Final Destination series and makes me puke my guts out...",
            "review_date": "2010-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An American remake of another J-horror movie...not as bad as most have been in the past but not nearly as good as the original either.",
            "review_date": "2010-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's been done to death but then very little in horror hasn't.",
            "review_date": "2010-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "engagin and a little scary",
            "review_date": "2010-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i was hoping for a better scare. it was ok. good idea. but they started scarying ppl with the dumb moves which started to get lame. the ringtone is creepy and it does get into your head. the movie was running in an aweful speed. the acting ain't that good.",
            "review_date": "2010-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as terrible as I thought it would be. I was amused. Didn't like the ending though.",
            "review_date": "2010-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uninspired, disjointed, recycled plot,\"One Missed Call\" is a definite miss in my book. Too many questions left unanswered with one too many storylines dropped by the end of the movie. Steer clear from this one.",
            "review_date": "2010-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What will it sound like when you die? In \"One Missed Call,\" a chain of people receive terrifying cell phone messages of their own final fatal moments. Although the messages can be deleted, their number is up. Beth Raymond is traumatized when she witn...\nStarring: Shannyn Sossamon, Edward Burns, Ana Claudia Talancón, Ray Wise, Azura Skye\nDirected by: Eric Valette\nLNR",
            "review_date": "2010-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scared the shit out of me",
            "review_date": "2010-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was one crazy horror movie. The plot was good and there were plenty of scares.",
            "review_date": "2010-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aahhhh this movie was scaryy!!",
            "review_date": "2010-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man, I love that ringtone! For a j-horror it was conventional, the missed-calls start off well but it bites off more than it can chew with the explanation and with no real scares either.",
            "review_date": "2010-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "was ok!!!!! not scary or jumpy though",
            "review_date": "2010-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very scary movie that had me at the egde of my seat",
            "review_date": "2010-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not even kidding with this rating. Movie was utterly horrible.",
            "review_date": "2010-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had potential to be good, but ended up being the worst film of 2008 (at least.)",
            "review_date": "2010-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "trash. first of all, i'm still to this day not understanding the basis of her hatred for everyone in life. i'm sorry you had asthma and died from neglect pretty much. that sucks but don't need to be coming around killing folks that had no part in it! and what's with the cheap marble candy? get out of here with that. second of all, gave up at the end. just gave up and slammed it all to a close in a lame way. hated it. i was so let down.",
            "review_date": "2010-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I see a zombie baby on a cell phone I'm not gonna run away, I'm going to kick his little ass or die trying.",
            "review_date": "2010-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was an okay film but not that great",
            "review_date": "2010-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whoever thought of this was an idiot.",
            "review_date": "2010-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "u'll get scared if 1 gives u a missed cal after watchin' dis movie",
            "review_date": "2010-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't approve of bootlegs, but I do approve of bootlegs when it comes to a really bad film, and One Missed Call deserves it. It is without hope or horror, but it's pretty tedious. The only thing that's funny is I remember watching Forgetting Sarah Marshall and one of the guys pokes fun of a film that's like One Missed Call.",
            "review_date": "2010-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Time to do this movie some justice. I really dont understand the harsh reviews toward this film, sure its a Japanese horror flick but what can you honestly hope to gain from watching this. I like to watch movies with an open mind, I suggest some people should really give this film another look. It starts off really without a decent explanation but you learn as the movie moves on which is good. The opening scene is just bold. Thats all I can say. Maybe its the scene in which the cat is pulled under the water that irritated a lot of people. And rarely do you see animals die in a movie unless its one of those \"Tale of a boy and his dog\". *Old Yeller* But thats besides the point. This movie just goes balls out and kills this cat. Beautiful.\r\nNow after that the girl is killed, nothing special. But then the whole concept comes out, your phone rings but you get this weird ring tone and it freaks you out. Of course you dont answer it, but it doesnt matter because your still going to die. The deaths were very interesting, and you wouldnt even begin to see it unless you seen this movie before. Its one of those movies that you just have to appreciate. If you want a movie that has an original idea that deals with something that pretty much everyone has in this world, i'd definitely watch this. It freaks you out a little if something could actually posses your cellular phone. Check it out because its a decent film with decent acting and which earns this film a 90%",
            "review_date": "2010-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very tense and scary film! All the way through you are putting your bets on who the ghost is but then at the end there is a twist and you find that it is someone VERY un expected! This film had a lot of potential all the way through but it ruined it when the end came. They portrayed the ghost as a girl and because you knew what it was, it wasn't as scary but apart from that, one missed call is a great film! (I love the ringtone)",
            "review_date": "2010-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one miss call my ass it was boring and dull even the ending sucked it feels like I miss and call and was killed by bordom",
            "review_date": "2010-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"That's not my ringtone\" Leann Cole -- Azura Skye\r\n\r\nWe've had the Ring, and we've had the Grudge; remakes to Japanese Horror films because hey; it's not like we've had all the American Horror films remade. Seriously, what do you expect me to say about One Missed Call? There's no joking that it's a god awful remake. Admittedly, I've never seen the original film that this is based on, but that's due to not being able to find it anywhere, not out of not wanting to watch it. The remake is one of the worst in the horror genre: I'm talking almost as bad as the remake of House of Wax. Really, it's that bad. Say what you want about the modern horror remakes of the 2000's, but don't ever say they're as bad as One Missed Call (except possibly the Texas Chainsaw Massacre and House of Wax).\r\n\r\nFollowing the death of her friend Shelley, Leann Cole receives a Voice Mail from the Future, telling her the date and time she will die. She dies the exact date and time she is told. Leann's friend Beth meets her boyfriend Brian, who also received a call. Beth witnesses Brian's death on the same date and time. Then, Beth's roommate Taylor receives a call, but this time she teams up with a detective in order to investigate the connections between the victims, and try to save Taylor's life before the date she is supposed to die on. Having not seen the original film this is based on, I see One Missed Call as a new experience for me. The plot for this film sucks. Wait, sucks isn't the right word. Profanity is the only way I can express just how stupid it is. I'm supposed to be scared that I could receive a Voice Mail which would ultimately mean my death, just because I'm on someone's contact list. Bulls**t. Double Bulls**t. It's not a scary concept whatsoever; it almost seems like it's satirising another Horror idea. The reveal of the film is absolute crap too. It's revealed that it is a child who suffered an Asthma attack who started the curse. We're supposed to feel sorry for the child, but the plot gives us no real reason to because there's absolute no depth to the character whatsoever. If you want a death to mean something to the audience emotionally, give the character depth. When Nancy died in a Nightmare on Elm Street 3, it was a genuinely sad moment because it was a character that we had been shown and cared for before. In this, there's no reason to care. The film does that constantly, attempting to force us into having an emotional reaction. It's ridiculous to think that people are trying to force emotions onto us, and are expecting to get away with it. The only thing I can give the film credit for is that it doesn't give Gore or Nudity like most teenage horror films.\r\n\r\nThe acting in this film is awful, from every single cast member. Each member of the cast has poor delivery when it comes to the lines they are given, and when it comes to delivering the emotions, they either over-do it, or come off as monotone. It's painful to watch. There's no in particular cast member that does a worse job than the others.\r\n\r\nThe ending of the film is just the child trying to kill the main character, and it's hear where it really starts to pour on the CGI effects. How do you top off an uninteresting horror film? By making the CGI Special Effects terrible. Like most films that focus too strongly on CGI for the special effects, it's unconvincing and doesn't work well. It reminds me of the later part of 1408; the difference being that 1408, while eventually degenerating into a Special Effects Extravaganza, the effects were decent in that film.\r\n\r\nI've stated that the only compliment that I can give this film is that it doesn't have unnecessary Nudity and Gore. How ironic that the only good thing about it is something that it lacks. Do I need to spell it out any more? It's garbage. The End.\r\n\r\n\r\nAndrew's rating:\t0.5 out of 10",
            "review_date": "2010-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "scary music \nmore suspense than horror",
            "review_date": "2010-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do yourself a favor and NEVER EVER watch this film. This is definitely one of the silliest, worst played films I have ever seen. What the fuck is Ed Burns doing in this film?!? Seriously, he's not the greatest but he's better than this!! Anyway, this film is so poorly convincing and I am wondering what the hell the director was thinking when he made that film... honestly, a mobile phone that kills?! This is just too weird.",
            "review_date": "2010-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "0 out of 5 - Where the Japanese original was one of the better Ringu cash ins, as directed by cult favouriite Takeshi Miike, the American remake is  a complete misdial of a movie, which doesn't even seem to approximate the unique tone of J-horror at any moment. To capture J-horror a) you must never give a complete explanation for a curse, things \"just happen\" and tragically there usually is no hope or formula for stopping it  b) the source of horror is only ever seen sparingly to increase efect when it does appear and c) curses signify actual social issues  or phobias (Ju-on > the rise of women against domestic violence, Pulse > phobia of technology, Ringu > intolerance, etc)    Stubbornly, the Americanized version goes totally against the principles above. Furthermore, it's just plain bad movie making. A call best left missed.",
            "review_date": "2010-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well....it was quite boring..the end was also sad and quite unbelievable...watch it at your own peril.",
            "review_date": "2010-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought we were on to something here, given that the introduction was setting the scene of something very similar to the likes of 'Final Destination', wherby people could see (or in these case hear) their deaths before they happened. However, after a jam packed 15 minutes or so, we were soon whittled down to the sole survivor, before we even really got going. From this point onwards, the film took a whole new direction from something with potential, to something which loses my interest completely - a Japanese Psychological horror. This genre always baffles me within it's unrealistic plot, and i ended up having to use Wikipedia to unravel the mystery. Had this film ended with similarities to the 'Final Destination' series as opposed to 'The Grudge', then i'd probably be singing its praises having come away on a positive note but, alas, i left somewhat disappointed.",
            "review_date": "2010-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not that bad... but has more to get over than it was good",
            "review_date": "2010-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "common it wasnt that bad!!  i still cant get that tone out of my head ding ding ding ding !!duh duh duh ,ding ding ding ding !!..... its only a ring rip off!!!",
            "review_date": "2010-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This could have been such a better movie if someone had put more thought into it. For what it was it was entertaining",
            "review_date": "2010-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "shoot...frikin horor mca",
            "review_date": "2010-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Come on people, a 0% tomatometer? that is so unfair! its really not that bad. i have seen so much worse movies that got at least a 1%! even battlefield earth got a 1%. the acting was actually ok, and some parts were genuinely scary. \r\nthis isn't a great movie, its not even a great horror movie, but its a decent one and it got trashed unfairly.",
            "review_date": "2010-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm sat 31 minutes into the film and already I want to eat my hand , Zzzzzzzzz boring can't afford death scenes so took edits from Final Destination 23's cutting room floor.",
            "review_date": "2010-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One missed call, one stupid movie. It takes brains to make a good horror movie, and this one has no brains at all. The direction is poor, The acting for the most part is irritating. I laughed so hard I cried. If your looking for a good laugh or a bad headache, this film might be the one for you. I'm dying for a good horror movie PLEASE.",
            "review_date": "2010-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another horrible japonese ramake.",
            "review_date": "2010-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dont answer the phone",
            "review_date": "2010-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "V. good horror. I hate that ringtone, once when in the LIT computer room someone had it and their phone went off at the same time as mine which was on silent, nearly had a shit attack.",
            "review_date": "2010-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is why they shouldn't remake Japanese horror movies. There was not one good thing about this movie everything sucked! Do not waste your time with this movie I wish rotten tomatoes would let me give this movie below a 10% but sadly they don't. This movie does not even deserve a 10% 0/4 stars.",
            "review_date": "2010-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Out of the limited amount of horror movies I've seen, this is one of the only ones that made me scream, which, essentially, is what a horror movie is supposed to accomplish. While the plot is a bit extravagant, the characters and fear will go straight to your heart.",
            "review_date": "2010-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you get into double digits as far as producers, beware of hucksterism. Vapid source material & executed with two-handed stay-in-the-lines colouring-book skill, this is ghost brand product.",
            "review_date": "2010-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haha honestly, this was pretty cool.",
            "review_date": "2010-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*sigh* I don't think this film could scare anyone totally inept and probably the weakest and worst of the Japanese-Horror remakes even then it is a remake of something that wasn't good to begin with. *sigh*",
            "review_date": "2010-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i thort it was awesome :)",
            "review_date": "2010-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lets make it plain and simple... Fail!",
            "review_date": "2010-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another brilliant film to undergo American surgery and as usual come out completely ruined!!!\r\nA re-make of the hugely popular \"Chakushin Ari\" \r\nReally really poor, relying heavily on CGI throughout and absolutely no suspense or fear what so ever!\r\nThe usual crap is rolled out with banging doors, cast members being right behind someone stood in silence when the person turns around.... yawn!!!\r\nBoring, crap, poor rip off... Hollywood.... please learn... :(",
            "review_date": "2010-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another poor remake of a good Asian horror film.",
            "review_date": "2010-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kinda dull, but had a few interesting moments. One of the rare times the American remake was better than the Japanese original, especially the ending.",
            "review_date": "2010-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of the worst movie's i've ever seen. I mean seriously. I wouldnt reccomend this movie to anybody i know.",
            "review_date": "2010-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stupid, stupid, stupid!\r\na three year old could make a better Japanese horror flick!",
            "review_date": "2010-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst horror films I've ever seen.",
            "review_date": "2010-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "think i'm immune to ... I need sth to scare me!!",
            "review_date": "2010-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the most pathetic films ever committed to celluloid.",
            "review_date": "2010-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gave it ago. Nothing special. The Japanese version is slighlty better. At least I saw Edward Burns.",
            "review_date": "2010-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another lame J-horror remake. The plot is a mess, and there's no logic at all",
            "review_date": "2010-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really horrible remake of a Japanese classic horror film. What was America thinking? A really shitty movie. Not even worth a gander. Drags on with no scares or jumps.",
            "review_date": "2010-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "waste of time with an ending that makes zero sense.",
            "review_date": "2010-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This horror movie is in need of an exorcism.  It  scared me maybe once, but again, it is one of those movies that just had an idiotic storyline. Nothing left to be said about this, but, \"if you are going to see any movie, cross this one off your list.",
            "review_date": "2010-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good horror/suspense movie. Kinda creepy when you know how you're gonna die. Even over the phone.",
            "review_date": "2010-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty boring remake of a pretty bad original. I didn't care about any of the characters and the whole thing just dragged on and on ... and on!",
            "review_date": "2010-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Japanese version was dark as hell,",
            "review_date": "2010-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I only give this a 20% because I've seen way worse movies, This isn't the worst one time watch movie I have ever seen, but it's up there. Despite having the American version of the \"death ringtone\" as my ringtone, then having it go off right after the movie, it was just not enjoyable. Acting wasn't too bad, but didn't help this movies case.",
            "review_date": "2010-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most people know this movie because of it's zero percent rating on this site, and it's not popular with audiences at all and never has been, so as soon as I found out this movie got absolutely butchered I set out to buy it, and to my surprise One Missed Call is a frequently spine tingling and dark mystery chiller, I personally don't define it as a horror. There's always a sense of dread and a few jumpy shocks along the way, and these shocks are emphasised by some truly creepy imagery. I loved the scene when the first phone call comes through, the look on Shannyn Sossamon's and Azura Skye's faces are very convincing full of terror, this is a well constructed scene. One by one the characters are picked off in gruesome ways in a final destination sort of manner but this movie's gore isn't that effective. Although the characters aren't ones you care for, the cast's performance are quite good, but there are some short moments where the acting is a bit off key, a little life needs to be injected but I like the cast and the storyline creeps me out. I think Shannyn Sossamon is a great lead, I'd like to see more of her movies. You'd think because it's based on technology One Missed Call wouldn't be scary but it actually succeeds in giving the mobile phone a creepy vibe, or should I say tone.",
            "review_date": "2010-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Basically the girl from the ring has access to a phone.",
            "review_date": "2010-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One Bullocks call.................",
            "review_date": "2010-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i saw it with ma mates at her flat and she had a sound-like them tune on her phone so we foned her through the film and she screamed like hell (funny to watch though:P)",
            "review_date": "2010-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i think this is possibly the worst film ive ever seen.its boring and not the slightest bit scary.i think the original idea and plot is actually good-it just got twisted in completly the wrong direction,so much more could have been done.i disagree with the way people are saying its 'unbeleivable and unconvincing' its not real,its a film so it isnt meant to be! anyway i turned it off halfway through it was so bad.dont watch it.",
            "review_date": "2010-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1/4--A really stupid.",
            "review_date": "2010-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Im wondering if the japaneese version was even any good, im feeling very generous at 20%",
            "review_date": "2010-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One Star cause there were absoluly NO chineese people!",
            "review_date": "2010-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rather horrible. It would have been nice if this was one missed movie.",
            "review_date": "2010-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good for the suspense, just wondering how each one would meet their death was entertainment. Very much like Final Destination Series movies.",
            "review_date": "2010-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie not really scary but coooooool",
            "review_date": "2010-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it trully wasnt the most horrible movie ive seen and deffinetly doesnt deserve to be the second worst of the decade bu t iwill admit it wasnt very scary or good in any way",
            "review_date": "2010-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another horror film I've seen recently but can't seem to recall much. Oooh yeah, this was about the two kids, wasn't it! Okay, well it goes in the same slot with the other crap horror movies I've seen recently, but this is more of a try to follow the success of The Grudge and The Ring, which did succeed, while this did not. Guess one could watch this if they want a few scares, seeing that there aren't exactly many new quality horror films around at the moment.",
            "review_date": "2010-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can only describe it like this- waste of 2 hours. There was only a few scares and the rest was just mere annoying story lines. A DON'T SEE of 2008.",
            "review_date": "2010-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the worst horror movie of all time. the trailer made it look somewhat scary with its visual effects, but after watching the film is was just plain dumb. i can't believe there is a 2nd and 3rd movie, i didn't even bother to watch them...and even at the end of the movie it doesn't show or say who is killing everyone..?",
            "review_date": "2010-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am constantly amazed at how Hollywood will throw money at these crap films.  Junk not worth the time it takes to watch.",
            "review_date": "2010-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know what was more ridiculous, the fact that the movie was horrible or that they got away with making it.",
            "review_date": "2010-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes it makes me wonder why does hollywood make terrible horror movies is it because they think that some stupid teenagers would be scared by this, well it doesnt alright so pretty much this a pointless horror remake that Hollywood usually tries to make but fails. Not recommended",
            "review_date": "2010-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trailers led you to believe that the film was much better than it actually is :-(",
            "review_date": "2010-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another japanese thriller adapted into Hollywood standards - One missed call is basically Final Destination meets the Ring. Various seemingly unrelated people are receiving voice mails with their voice on the other line...it soon transpires that the words they are hearing are the last words they utter before they die in various gruesome ways.\nThe premise was intersting to start of with, but as the story starts to unfold you start to think that maybe the director didn't really plan the ending and kind of winged it in the end. The characters themselves are very forgettable and aren't really on the screen long enough before they get taken out - as such the film becomes predictable which, for a horror, can be VERY boring. \nOverall, it's good enough to have on and keep thge average viewer mildy entertained but any horror fan will find it predictable and disapointing.",
            "review_date": "2010-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They shouldn't have made a remake cause this sucked\n\nNo Thrill, No Scare\n\nand no entertainment for me!!\n\nPlain Boring\n\nThe Japanese shows/knows how to do it...\n\nI wouldn't recommend this...",
            "review_date": "2010-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You missed the call, but dont even check the voicemail. Its not worth the time.",
            "review_date": "2010-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit of a second rate horror flick , bit predictable.",
            "review_date": "2010-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "creepy and very strange movie",
            "review_date": "2010-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So who was doing all the killing, can somebody tell me???",
            "review_date": "2010-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a good for nothing sh*tty movie that can't even startle or make me laugh. you get to hear someone's last dying words? well, i hear some for the careers of the makers of this nonsense. annoyance all throughout. i liked the ring tone, though. 10 points for the ring tone!",
            "review_date": "2010-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "omg my friends called our cell phones but we didnt answer it becuz we were watching one missed call, so after the movie we both check our phone and it said \"One missed call\" we freaked at first then laught....",
            "review_date": "2009-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a disappointment. stick to the asia one. the plots the same but poorly done. if the actors can't act scared or even that they care then why would the audience",
            "review_date": "2009-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was excited about this movie, but it just didn't seem to deliver.",
            "review_date": "2009-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not really scary, not really entertaining",
            "review_date": "2009-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film had many flaws such as mediocre acting, completely ridiculous scenes, and a stupid plot, but the absolute worst thing about the movie was its complete lack of charisma. Its as if the film did not care about itself at all. Furthermore, it was not scary.",
            "review_date": "2009-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another moody Japanese ghost story to be adapted for American screens. Director Eric Valette does manage a few hair-raising moments but on he whokle it's a rather damp squib of a film.",
            "review_date": "2009-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one hell of a un scary film. it sucked horribly it was boring. the acting was shit the film is one of the crappiest horror movie i ever seen and i seen a lot of shitty movies.",
            "review_date": "2009-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So cheesy, too predictable of a plot.",
            "review_date": "2009-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched One Missed Call over the weekend. Man, what a load of crap that was.\nThe special effects were shit (Did you see the blatant CGI millipede going into the chick's hand during class?)\n\nFrom the very first death scene at the pond I knew this was going to be crap, I mean, weren't they supposed to die from coincidences, \"Final Destination\" style? Then what the hell was that hand out of the water supposed to be? I hated the movie.",
            "review_date": "2009-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not that scary but good acting, the remake of a Japanese film. the ending was a to be continued so maybe there will be a sequel to this movie!!",
            "review_date": "2009-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm going to admit that I did enjoy the first tweleve or so min. of the movie, but then it got just plain old stupid. And then the only real shock I got was the fact that Edward Burns was in this movie. Dumb.",
            "review_date": "2009-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who does that girl's make-up?",
            "review_date": "2009-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this.  I have that same ringtone.  And I get goosebumps every time my phone rings. This will appeal to people who get scared quickly.",
            "review_date": "2009-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One Missed Call does not suffer from really poor acting or bad special effects. In fact, this movie has some really creepy visuals and a pretty cool premise. However, it suffers because the writing is awful. They treat the audience like a bunch of 5-year-olds and spell simple plot points out so we can understand what is going on. Then it moves along in a series of disjointed scenes while giving us no real emotional connection to the characters - so we really don't care when they're killed off.",
            "review_date": "2009-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is really bad. it's not like 'oh its so bad that its good'. not really. it's more like 'its so bad that its just simply bad'. not scary at all. acting is just silly and completely unbelievable.... and well, there's nothing to it. watch the original instead.",
            "review_date": "2009-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More forgettable than the Chineese version! But at least that one was half decent!!",
            "review_date": "2009-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was one of the worst if not the worst movie I have ever seen. Never see this never!",
            "review_date": "2009-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some scenes were enjoyable to watch,ONLY SOME,NOT THE WHOLE FILM.How the story is solved is just dumb.It did have some creepy scenes here and there but nothing special.Although,it lacks plenty of suspense and some dialogue.The performances weren't that good either.So i only had 3 problems with the film:the lack of suspense(it is PG-13),the bland performances,and the DUMB resolution.Maybe if they would've fixed this it would've been good.",
            "review_date": "2009-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst horror movie ever. It's even worse than Prom Night",
            "review_date": "2009-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the movie although it reminded me a lot of the ring. It kinda dragged on.",
            "review_date": "2009-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Notihng happens in this movie and it is a bore. Waste of my time. Honestly, I think I fell asleep near the middle of this movie.",
            "review_date": "2009-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was shocked to find out this wasn't placed in the Comedy genre.",
            "review_date": "2009-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheesy but sort of freaky in certain parts...dolls/teddybears/etc...scary.",
            "review_date": "2009-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thier no suspence, there no horror,but I have to admit  there a part with a baby was funny",
            "review_date": "2009-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "freaky...love it....i dont know if i want that stuff to happen to me.",
            "review_date": "2009-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't all that scary",
            "review_date": "2009-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is ok. Scary sometimes but not bloody. Not the best this year but good enough for me. I have to admit, it is not very original. Many tricks we have seen before. Some scary shots are a bit to slow, so they lack the shock effect that was intended.",
            "review_date": "2009-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ONE MISSED CALL biggest disappointment is at the CLIMAX. The film built up is quite good but just when the viewer is at a high at the END to watch what is gonna happen, everything just falls down there and all comes down to nothing.\r\n\r\nThe horror sequences which are the most important in any horror movie were too quite disappointing and nothing innovative.\r\n\r\nIn short, ONE MISSED CALL is disappointing and has many flaws in it.",
            "review_date": "2009-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't believe most of the ratings you see! This was an excellent thriller movie. It was part horror, mostly suspense. If you haven't seen the original, it's unpredictable for the most part. The fx were good but not great. All in all, original is better but remake is still worth your time.",
            "review_date": "2009-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what a mess of a film - I spent more time laughing at it than watching it. the look and feel of it is ok but the story is a farce, and unlike the original asian ones the style is so lacking it cant make up for the lack of story - the originals are surreal and dreamlike - the remakes/western versions are just messy. this films just a joke really :-)",
            "review_date": "2009-10-31",
            "source": "rt",
            "lang": "en"
        }
    ]
}