{
    "rating": 8.4,
    "release_date": "2008-11-07",
    "num_reviews": 449,
    "genres": [
        "Drama"
    ],
    "summary": "During World War II, 8-year-old Bruno (Asa Butterfield) and his family leave Berlin to take up residence near the concentration camp where his father (David Thewlis) has just become commandant. Unhappy and lonely, he wanders out behind his house one day and finds Shmuel (Jack Scanlon), a Jewish boy of his age. Though the barbed-wire fence of the camp separates them, the boys begin a forbidden friendship, oblivious to the real nature of their surroundings.",
    "reviews": [
        {
            "content": "The Boy in the stripped pajamas is an entertaining movie, a young German boy gets to know the concentration camp, led by his father who is a nazi popularity.\nHowever, I wouldn't recommend the movie as a source of historical information! It is a product of fiction and not historically accurate, it is totally unrealistic considering actual facts. This is what bothers me, I don't think that the holocaust is a topic to make fiction about. It is dangerous to change the actual history to a more entertaining one, it can be easily misunderstood. For people that don't have the historical correct knowledge, the movie will create a wrong perspective. I know that the movie doesn't claim to be factual but it still wants to show a typical family of nazi society and takes the holocaust as topic. In my opinion it is morally negligent to use this part of history and create another fictional version of it for entertainment reasons.",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was good overall, although I do have some complaints about it. \nIts about a boy, the son of a Nazi-commander, that moves with his family from Berlin to Poland. What the father does not know; his son, Bruno, can see the concentration camp Auschwitz. Bruno doesn't know what it is, so he just thinks that it must be a farm, and the people working there are farmers. Because Bruno had to leave behind his friends in Berlin, he was sad and started looking around for other kids to play with. His mother knows that somewhere around the house, there is a pathway leading to the camp, but she think it must be further away. \nEven though his mother does not allow him to \"explore\", what he loves to do, of course he sooner or later finds the pathway that starts in the backyard of the house. He starts to get curious as he sees one of the inmates working in his house as kitchen staff while peeling potatoes. He does not understand why he is wearing pyjamas, and thats where he starts asking questions. His parents don't really know how to explain to him what is happening. \nOverall, good movie, okay-ish represetation, and the seriousness of the movie is pretty average for a WW2 movie.",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think the movie \"the Boy in the stripped Pyjamas\" is very interesting. \nThe movie is about a young boy (Bruno), whose dad is a leader of a concentration camp, but Bruno still becomes friends with a jew the same age as him.\nWhat I found particularly interesting about this movie is that you see this time through the eyes of a young boy who is not aware of the German hatred against the jews. Another aspect of the movie that was pretty good is that you see the moral conflict with this topic, for example the mother realizes what is going on in the concentration camp and says she doesn't want to be part of this.\nAlso the end is a great scene because the dad and the whole family realize on their own son what is happening in the concentration camps.\nI would totally recommend this movie to anyone over the age of 12!",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Boy in the Striped Pyjamas\" is a heartbreaking movie that shows the tragic reality of the Holocaust through the eyes of two young boys, one a Jewish prisoner and the other a German boy. The movie is a powerful reminder of the devastating consequences of hate, judgment, and discrimination, and the importance of empathy friendship, and compassion. It was a very sad movie but Overall, it is a must-see movie that will leave a lasting impact on its viewers.",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Movie was such an entertaining experience!\n\nIt aspects the holocaust and the concentration camps very good and shows the dealing between Nazis and Jews.\nIt downhearted me to see how the Jews were treated but it made me realize how genuine the Actors performed the roles, especially the driver of the father of Bruno, he played his role so accurate that i was very shook the whole time. Bruno and Schmoel were acting very good too and thats why the ending was so sad and depressing.\nThe fact that Bruno didnt really know or believed that the farm was actually a concentration camp, were Jews were brutally murdered and used was crazy and made me tremble.\nI haven't seen many films that better portrayed the holocaust and WWII with nazi propaganda.\nThe whole story was very good written and id give this movie a 10/10 straight away even though the ending was heartbreaking!",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was very entertaining and intense. It teaches a very important subject that, in my opinion, everyone should know about. Everyone should know what happened back then.\n\nIt's not the heroic movie with 50 gunfights and a person who shoots down 100 people with one round. It's more the quite but still absorbing type of movie.\n\nI definitely would recommend this movie!!",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the performence and depiction aswell as the performance of the cast. I loved to see a performance by a young Asa Butterfield who we now know as Otis in Sex Education. I liked the performance of Rupert Friend as Lietenant Kotler acting very similar like officials back in WW ll. While I didn't like the film as much as others not because it was bad, but because it was very sad, so I did like the film, but I just found it very sad and a bit depressing. But the performances and depictions were top and I'd give the film a 10/10. I found the ending very horrible and the father should be arrested by the allied forces like in the book.",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was good, but it was way too short. To me it felt like the plot as a whole could have happend in either a week or a year. As I said I would have appreciated if the Movie made it more clear on how time was passing. That said it did have some great Characters and acting. I thought the SS officer did a really good job at being a very stinky Bad guy. Bruno was confusing for me because with were he comes from he is not supposed to be all open and fair to the Jews because I assume that is not how he was raised seeing as his Father willingly fought for the Nazis. Schmuel did not have much depth to his character but seeing as it was not necessary I didnt have a problem with it. Overall I did not regret seeing the Movie but it was not in any way life changing.",
            "review_date": "2023-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a decent movie. Not too long but it had a really grim story and a really sad ending but it portrayed reality. I would recommend it but with a warning because it is very sad.",
            "review_date": "2023-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy In The Striped Pajamas\nBy John Boyne\n\nI have watched the movie and I have read the book,\n\nThe Boy In The Striped Pajamas is about a young boy named Bruno that lives in Berlin. His dad is a German soldier that leads a concentration camp, Bruno meets a boy named Schmuel that is a prisoner in the concentration camp and the same age as Bruno, 8. Bruno visits Schmuel as often as he can until one day he snuck under the gate and he was mistaken for a jew and that was the day all the jews were put in the gas chamber.\n\nI recommend the book over the movie because the book has a lot more detail and events than the movie. I usually like the movie better but in this case i actually like the book better. It has a lot more meaning to me than the movie did. The movie did not include some detail that I thought was important, like how Bruno got his head shaved in the book but not in the movie.\n\nBruno looked a lot like what he was described in the book that he had short brown slicked back hair and he did in the movie. He was described as brave, curious. Bruno kept those traits in the movie. When he climbed under the fence to see Schmuel that was a brave act. \n\nA part of the movie that wasn't in the book was the ending. The ending in the book is where Bruno is lost and cannot be found and that's the day he went to go see Schmuel and climbed under the fence and it doesn't play out further than that. In the movie Schmuel brings Bruno clothes and Bruno brings Schmuel a sandwich but loses it on the way over to the camp. Bruno crawls under the fence and puts on the camp clothes, and after all the jews, including bruno died in the gas chamber his dad proceeds to look for him and demands all the guards to search for bruno, eventually Bruno's mom found his clothes that he swapped for the camp clothes next to the fence. Bruno's dad got the word that all the jews were put in the gas chamber and Bruno was one of them\n\nOne of the parts that were not in the book was when his dad shaved Bruno's head the day before he went to go see Schmuel and climb under the fence. In the movie Schmuel gave Bruno a hat to wear so the guards cannot tell that Bruno didn't have a shaved head.\n\nWith that detail missing from the movie it spiked my interest in the book because I think that was a good detail that they didn't add to the movie.\nI think that that detail didn't really affect the story line, it just made one of the lines more disappointing than I thought.\n\nFor this reason I recommend the book, only because I think the book had greater detail than the movie because the movie did not substantially change or substitute any scenes they took out of the movie. So because of that I recommend the book.\n\nIn conclusion I recommend you should read the book before the movie but still watch the movie.",
            "review_date": "2023-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy in the Striped Pajamas by John Boyne \n\nI read the book and watched the movie, The Boy in the Striped Pajamas. The Boy in the Striped Pajamas is about a boy named Bruno growing up in World War 2. Bruno's family must move considering his dad got a new job. His family left Berlin and moved to the \"Out-With,\" what the Nazi's called Auschwitz, for his father's new job. I recommend the book over the movie. The book has a lot of detail, and it helps give you an understanding of what happened In Auschwitz.  \n\nWhen reading the book, I imagined the main character (Bruno) looking like a small white kid, with black hair and my imagination was remarkably like how Bruno was cast in the movie. In the book, Bruno follows the rules because he knows his dad would be mad if he does not, but he has a friendly, compassionate side to him that can sometimes lead him to trouble. \"Well, you're probably not allowed to come here and talk to me every day either,\" said Shmuel. \"But you still do it, don't you?\" \"But if I was caught, I'd be in trouble,\" said Bruno, who was sure if Mother and Father would not approve. The book is better than the movie.  \n\nIn the book, Bruno will not leave his mother alone when Bruno finds out they must move to the \"Out-With.\" In the book, Bruno is constantly asking his mother questions about the move. Bruno's mother is getting upset at him. The movie, the night before the family moved, Bruno's father threw a party for his new promotion, in the book, it does not say that. It did not increase my understanding, but more enjoyment of the movie. It affected the story line by adding a whole different part in the movie than the book. For this reason, I recommend the book.  \n\nThe part that was left out in the book that was in the movie was when Bruno scraped his knee, Pavel, and Bruno had an extended conversation until his mother arrived and he was peeling carrots after helping Bruno with his injury. The movie did not show any of that. This did not give me a better understanding at all. It affected the story lines by showing something else that did not happen. For this reason, I prefer the book considering the book has a lot of descriptions in it, rather than a movie. As you read this book, you can imagine it in your head. \n\nTo end off my writing about The Boy in the Striped Pajamas, the book has more to it than the movie, and it helps you think about what had happened in the past. The book makes you feel different emotions. I recommend the book than the movie.",
            "review_date": "2023-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have read the book and watched the movie made after the book called the boy in the striped pajamas directed by Mark Herman. The story starts off with a boy named Bruno that must move with his family close to a concentration camp, but he doesn't quite understand what's going on with the people in striped pajamas. I recommend the book over the movie. \n\nBruno is portrayed as small for his age and doesn't like when people belittle him but overall, he is innocent and kind of ignorant because he didn't want to stop hanging out with Shmuel which ultimately gets him killed. Bruno kind of looks how I thought he would with his brown hair n everything, but I would have thought he would be a little smaller. In the book, the parents never really find out where Bruno went except by him walking around the fence one day and finding a spot in the fence where the wire could be lifted but, in the movie, the dad finds out where Bruno went rather quickly and realizes it's too late. This explains why I like the book better because it kind of leaves you rather abrupt and a kind of mystery to the parents rather than them knowing what happened to him at the end of the movie. \n\nA part of the movie that was not in the book was at the beginning of the movie when Bruno's parents throw an exciting party at their home in Berlin to celebrate Bruno's father's promotion. Which in the book Bruno comes home to see that his maid is packing his things and he kind of gets mad and his mom tells him that they must pack and move immediately, and he wonders if he has done something bad. When they changed it to the party it's kind of didn't give me that much understanding of what was going on. This change didn't really affect the storyline but did affect it when the family met the fury and had dinner with him. For this reason, I would recommend the book over the movie. \n\nA part of the book that wasn't in the movie was when Bruno could lift the wire from the ground because it was not secured properly in that part of the fence. In the movie, Bruno couldn't touch the fence because it was electrified, and he had to dig a hole under it to get out. It made me understand it more because it made more sense to have an electric fence because if it wasn't it probably would have been easier to get in and out. I feel like it affected the storyline because it made Bruno leave a trail of how he got in because of the shower he brought. I would still recommend the book because it leaves kind of a mystery for the family to find out what happened to him. \n\nOverall, I believe that the reader should read the book first and then watch the movie because the book is more explanatory about Bruno's thoughts than it is in the movie.",
            "review_date": "2023-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have watched the movie and read the book The Boy in The Striped Pajamas by John Boyne. The film is adapted from the book and directed by Mark Herman. The story takes place in 1942 in Berlin, Germany; the protagonist, Bruno, moves to a place he calls Out-With other, known as (Auschwitz) A concentration camp that his father oversees. Therefore, I recommend the book over the movie as it has more development toward the storyline and the history of World War II. \n\nAs I read the book, I thought Bruno would look shaggy with shorter hair and greenish eyes. In the movie, Bruno's is sophisticated with hair that is flicked to the side, but in the book, he has a shaved head as he has head lice. This proves that the book pays more attention to detail and characteristics.   \n\nBoth the movie and the book have differences. In the film, Bruno takes a shovel and digs a hole to get under the fence, but in the book, he takes a ladder and climbs over the wall. It never changed my perspective of the story; I still enjoyed it. For this reason, I recommend the book over the movie as it gives more storyline, unlike the film, which leaves many things out.   \n\nAs in the book, Bruno's father shaves his head as he gets lice, but in the movie, they never add that dialog or the change in design. It affected the storyline in how when he got his head shaved, he just got the pajamas from Shmuel, but in the movie, he had to put on a hat to cover his hair; then, the director made the movie longer. It never changed my perspective of the story; I still enjoyed it. For this reason, I recommend the book over the film as it gives more storyline, unlike the movie, which leaves many things out.",
            "review_date": "2023-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was perfect, there are no words to explain my feelings after watching it. 🥹🥲",
            "review_date": "2023-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very interesting and sad to see that the left is now trying to \"cancel\" this movie because it doesn't align with their incredibly crude and lazy view that every German (including German children) was a mustache-twirling villain who was fully aware and complicit in what was going on. They say that Bruno is unrealistic because every German child would have had hatred for Jews taught to them. Sure, many German children were indoctrinated with hatred for Jews - this movie *shows* that. The whole point is that Bruno is *skeptical* of that (while his sister, by contrast, swallows the indoctrination, at least initially). The whole point of the movie is that our common humanity transcends nonsensical sectarian hatred, and this is often recognized best by children who have not accepted the status quo of their surroundings. The point of the ending is ironic justice - Bruno's father, in a sense, kills his own son through his willing participation in the holocaust. If you think the message of this movie is \"Oh no we need to have pity for the poor innocent Germans during the holocaust\", you're an idiot with zero sense of irony and this movie is over your head. Also, people complain that Shmuel is unrealistic because the Nazis killed most children and there was no guard by the fence where the boys talked. Well, it's a fictional story, it's not a documentary that tells you how things normally occurred. Like a lot of movies, it's interesting precisely because it tells the story (real or fictional) of an *exceptional* or unique case which, by its unique nature, can teach us something. This is elementary stuff for how storytelling works. This is a very well done movie which shows the complexities of human interactions, and it communicates some very important lessons assuming you have an IQ above room temperature.",
            "review_date": "2023-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrible film that mocks tragedy",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a touching movie.",
            "review_date": "2022-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a film that, beyond referring to the holocaust, allows us to see how all the actions we carry out have consequences. It allows us to see the lack of awareness about cruelties and lack of empathy and the desire for superiority of a part of society.",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good Movie! Nice Cast. Nice adaptation.",
            "review_date": "2022-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Packed with horror and emotional feelings. The Boy in Striped Pajamas tells a painful story and a family doing its best to live next a Holocaust nightmare.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch this film, no exuses buy it rent it i don't care it is a must see.\nThe ending is so touching that personally I layed down for hours doing nothing after this movie",
            "review_date": "2022-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another 2008 Holocaust drama (after 'The Reader') that shows us that historic tragedy through a fresh perspective--the piercing blue eyes of an 8-year old German boy, the son of a Nazi officer. Based on the novel by John Boyne, Mark Herman's compact and heart-breaking film brings us old pains in new ways. It's authentically human, if a tiny bit emotionally manipulative. Herman has made a simple Holocaust film, one that doesn't restate the obvious details about the horrors in those camps we know so well. Herman doesn't bother with German accents for his actors, or even the real thing. The Nazi family speaks with posh British accents, highlighting their class and how it affects their role in Nazi Germany. As the young boy Bruno, Asa Butterfield has the right blend of wonder, cleverness, and innocence. Vera Farmiga is stunning as the mother, letting us see the gears turn in her eyes. It's not a true story, but this emotional drama will take you on a wrenching journey into history's worst genocide from a new angle. Terrific",
            "review_date": "2022-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I get what this is going for in terms of an emotional gut punch at the end and the issues of naivety amongst children when talking about the Holocaust, but it's executed poorly with weak character developments and I can't understand why I should feel sad about a Nazi's son dying when in comparison millions of Jews died? The strongest aspect was the dialogue between Bruno and Schmuel, but other than that every other character is annoying, horrific and underdeveloped. Honestly in the end, this film hits best with the feeling of Karma left at the end, as the emotional gut punch is felt much harder and better in other films which execute the whole premise in an overall greater way.",
            "review_date": "2022-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tragic story beautiful encapsulating the pointless divide between the imprisoned Jews and the upper-class Germans.",
            "review_date": "2022-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ha takes me back to my middle school days",
            "review_date": "2022-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I knew what was coming far in advance, I knew they were going to switch clothes and that the rich kid who's father was the Captain of a killing for jews in WW2.  Thus the reason I rate this 3 and 1/2 stars!!!",
            "review_date": "2022-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well I have to say I'm disappointed in rotten tomatoes and probably the reason why I don't rely on this website for movie recommendations because of the score. I loved the interesting perspective of a German child and the innocence he has. Imagine not knowing your born in a family that is on the opposite side of the fence (literally) and have the better life. I'm just impressed with the casting and the acting overall and the emotional impact I had. 5 out of 5 and I hope they make another one updated of a different perspective.",
            "review_date": "2022-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a wonderful, emotional film",
            "review_date": "2021-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, it doesn't have to be an amazing movie, but definitely the proposal to deliver a \"great bond\" with the audience in a story based on true facts is \"strictly\" too terrifying to be told. Because, by the way, \"The Boy in the Striped Pajamas\" only manages to shock us and give us due attention only at the end of the film, probably. And it will even be exciting!",
            "review_date": "2021-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well made film when it comes to directing and acting. Unfortunately, the story is completely out of place. The story is exactly what comes out when a daydreaming, ignorant filmmaker tries to invent a cliché Holocaust drama in his own Hollywood bubble. The naivety of the mother and the son is beyond any reality and many elements seem implausibly fabricated. e.g. a concentration camp without a fence patrol, .... Unfortunately, this film is not a helpful contribution when it comes to dealing with the sensitive topic named Holocaust. One star for the director, 10 negative stars for the poor handling of the subject .",
            "review_date": "2021-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think that this movie is incredibly underrated. They did a great job to show the life of a German officer. Also, show the very sad side of what is going on in the background of the nazi empire. It was a great idea to show the Nazi party through a child's eyes and through a teenager's eyes.",
            "review_date": "2021-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*SPOILER ALERT* WOW! Let me start by saying that this is one of those films where you only watch once. If you're looking for a film that'll leave you siding with the enemy yet disagreeing with them at the same time then watch this! Now I say siding yet disagreeing by hating the German family for what they allowed but siding with innocent Bruno, the son of the family who sees equality in all Jewish citizens. The film narrates the life of a German family that which the father, is a Nazi. The entire family seems a bit detached. The bonds between this family seems to lack love. Every character seems to be help captive of something; The mother is a housewife, the children are caged in, and the father is restricted since he's a Nazi. Clothing wise, every character is seen to wear specific outfits that match their personality. Since Bruno is a child he's always seen with suspenders and shorts, the mother and daughter in dresses and the father in his normal Nazi uniform. Sound played a huge par in this film as well. Throughout the film, lively music is played to express Bruno's innocence. Fast forward to the ending, the sound of the thunder and the dark clouds emphasizes reality in Germany. During the last scene, Bruno's eager personality puts him in danger. He wants nothing but to help his Jewish friend Shmuel not knowing that they are about to die. Them not knowing that they'll die shows their innocence. As kids, you don't think of the worst. Bruno was only trying to help his friend but was killed by his father and the rest of the Nazis. The last scene leaves you not only heartbroken but angry. The father put his family at risk for an awful racist group. Personally, I hated the last scene. With the dark clouds, loud fearful Jews, and innocent children, it was unfair to watch. The ending was no better. It left me wondering why they couldn't show the father mourning for his own actions. The film cut of immediately after Bruno died, which gives the audience suspense. All together, this was an amazing yet traumatic film to watch, hence why I said you only watch it once.",
            "review_date": "2021-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story. Good characters. This movie is a great history movie. Ok",
            "review_date": "2021-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this film without knowing anything about it, and I walked out in a complete daze. Not for the faint hearted, or indeed if you've been put in a happy mood by Matilda and go straight into this. The story of two young boys who meet through the fence of a concentration camp, it's a fascinating tale of childhood innocence set amongst the backdrop of one of histories largest horror shows. Harrowing, brilliant, and superbly adapted from the book of the same name.",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it had a good story but the ending BS i read the story in the 7th grade and it affected me and after seeing the ending, man most depressing ending I've ever seen.",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was a movie about pyjamas. I found out it was a friendship movie with a boy going through the right education. Although, the shower scene was a little strange.",
            "review_date": "2021-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Child With the Striped Pyjamas is a bittersweet story. Sweet as their central characters: two children with very different life experiences; one is a Jew in Holocaust times, while the other is a son of a Nazi officer. Both are united by that unique feeling of innocence, tenderness, and spontaneous wisdom possessed by every infant.The film is affected by the very difficult historical context in which these two little ones are involved, who in the midst of several encounters try to discover between games and riddles the reality that surrounds them.The interesting thing about the Child with the Striped Pyjamas is the approach of this story focused in the first instance on the smallest victims and take into account, secondly, another victim, but on the Nazi side, who are usually seen as the only culprits. In this way it is evident that premise that says that every war is absurd where victims fall from all sides.",
            "review_date": "2021-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not the least bit historical, The Boy in the Striped Pajamas presents us with what it might have been like as a German boy near a concentration camp.",
            "review_date": "2021-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The book is loads better, but THE BOY IN THE STRIPED PAJAMAS tells a powerful fictional story about an awful true one, one that will stay with you for a long time after.",
            "review_date": "2021-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartbreaking. That's it.",
            "review_date": "2021-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy in the Striped Pajamas is based on a fiction book about the son of a Nazi officer who befriends a Jewish boy who is a victim of the Holocaust. This movie is simply beautiful with its child like score evoking the innocence of the child characters and never using dark music during the intense moments. Asa Butterfield  as the main character is likeable and does a very good job of showing us the world from the eyes of a child. David Thewlis and Vera Farmiga do a fair job here as a couple and as parents. But what makes this movie works is the point of view of the children who are ignorant of the true horrors around them. The ending is controversial but I belief that this movie does a great job at showing the horrors of the holocaust within a fiction story. It should not be taken as a true story. Is not.",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing movie with a very sad and depressing ending to a great film.",
            "review_date": "2020-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy in The Striped Pajamas is an excellent film, which touches and explores the cruelty that the Holocaust was.",
            "review_date": "2020-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i got some Spoiler Before watch this :( that make me Predict Ending But After all i still think it's good Film",
            "review_date": "2020-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely love this movie! I found it years ago and watched it on a whim. Best decision ever. The movie was raw and eye opening. I wasnt alive during the Nazi Era but this movie makes you see from both the officers family and the jews in the concentration camps way of living. They live opposite lives and yet you get to see the hardships. Great movie and highly recommended!",
            "review_date": "2020-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, but extremely sad and tragic. Definite tear-jerker.",
            "review_date": "2020-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Through the innocent eyes of Bruno, the eight-year-old son of the commandant at a German concentration camp, a forbidden friendship with a Jewish boy on the other side of the camp fence has startling and unexpected consequences. (Source: IMDb)\n\nThe Boy in the striped pyjamas is \"A story of innocence in a world of ignorance\" and one of the most emotional movies I have ever seen, although I think it was a bit boring and not quite the best but I do recommend everyone to see it, great story and emotional ending.\n\nThe movie could have been a really great movie especially that it's based on a book by John Boyne that's so famous and so emotional, so they had a great story but I felt like the script was so weak and the way that the movie was telling the story wasn't what I expected, I also felt like it could have won \"Best adapted screenplay\" if the script was so good which is going to take me to the directing too that was good but not great, felt like the movie could have had so many great and memorable frames which it did but they were very few.\n\nThe cast was good although I felt like some actors and actresses would have fit the role better, Asa Butterfield as Bruno was a great choice, he always puts on a great performance although he was young. Jack Scanlon was so amazing in playing the role of Shmuel, you can feel the chemistry between the two young actors which I think what made the movie so great, David Thewlis as Commander Ralf and Rupert Friend as Lieutenant Kotler were so amazing they both gave us these dirty and evil characters that you will hate after watching the movie, and Finally, Vera Farmiga as Elsa who I felt like in some scenes she was trying so hard to just fit into that character but could not, the only scene I liked was when she was fighting with her husband Commander Ralf, but other than that her facial expressions and acting were not that great.\n\nThe music score was not a problem at all, it added a great touch to a few scenes and it even made some scenes more emotional.\n\nThe movie showed us what life was during \"The Holocaust\" in such a genuine, dramatic, and emotional way because \"The Holocaust\" is a difficult subject for sure that many people suffered during it.\nHighly recommend this emotional / sad movie that will touch your heart and will leave you in tears after watching it.\n\nMy rating is 7/10\n\n(*For more movie / tv show reviews check out my Instagram page @Serious.Cinema)",
            "review_date": "2020-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First of all,  I'd like to say,  good casting in this war drama, Bruno the explorer (LOL)  looks like a Mini-Cumberbatch. So cute and adorable perfect for the climatic ending. Bravo. \n\nThe story itself is moving and unique, the holocaust in child's perspective. Their innocence from the horrors of Jews and the extermination camps contributes to the viewer's heartaches. And its structure of having the climax as its ending leaves everyone a bitter taste until they sleep. Most find it as punch that makes it remarkable,  however for me, it's quite pleasant for a short story but not good enough for a film. Perhaps the book might have been better,  giving more context in the aftermath. I'll know once I read the book. LOL\n\nMany critics say this story educates people to have symphathy for the Nazis but I beg to differ,  it's a subtle revenge to the Nazis when you come to think of it.",
            "review_date": "2020-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good for the most part, but it gave me a bad feeling in my stomach. It's not quite as detailed as the book but some scenes are better because they are dramatized and it hits harder.",
            "review_date": "2020-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sad movie about the holocaust and how a boy named Bruno makes friends with a boy at Holocaust camp. Bruno’s family moves out of the city so his dad can work as a Holocaust dude and isn't allowed out of the house. Somehow Bruno gets out and makes friends with someone at a concentration camp and promises to help find his father. Bruno dies in the concentration camp.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember seeing this movie for the first time with my mom when I was a child, like in 2010. Because of the name of the movie I had imagined that something quite different would happen in the plot, until the movie started with historical scenes, I didn't know what to expect from it because it´s about the Holocaust.\nIf you are a sensitive person, at some point in the plot you may get a tear and have a lump in your throat. I think the film is very well done as it shows the context about life of the Jews at that time with some strong scenes but that are not exaggerated and this is the top advantage and that´s the  point I recommend all of you this movie.  I prefer history movies than superhero movies, maybe that's why I think I liked it.",
            "review_date": "2020-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The \"oblivious-onlooker-in-a-tragedy\" can function as a hard-hitting element when used sparingly, but here it's more sprayed out of a broken fire hydrant. Regardless of its faults, The Boy in the Striped Pajamas touches on many of the personality types that allowed the Holocaust to metastasize, from the fanatic to the apathetic, even if it goes about it lacking subtlety on occasion. The final scene is what remains with the viewer, based on shock value, and it does convey the level of disgust that its historical subject warrants; few films of recent years have the clout to swing a punch like that. (3/5)",
            "review_date": "2020-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotional human film",
            "review_date": "2020-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was heart-wrenching to watch that sequence where the Jewish kid is led to the showers and the scene cuts to the household of the German kid who sees the dark smoke billowing in the distance, his face so innocent. He didn't know that his friend was gone forever.",
            "review_date": "2020-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing good comes out of this movie. Good till the end. The end is just depressing and ruins the whole movie.",
            "review_date": "2020-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well acted. Predictable. ",
            "review_date": "2020-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the story of young Bruno and Shmuel is refreshing considering the setting of the movie is during the second world war, the film is not incredibly historically accurate, and the acting of the side characters wasn't super noteworthy.",
            "review_date": "2020-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie, the actors are amazing in this especially Vera Farmiga. She really delivered quite a performance. Ending is pretty guy-wrenching. If ur expected to watch a light-hearted movie, do not watch this!! The only complaints have is that all the characters are German and yet they’re speaking British English with a cockney accent. I understand it’s hard to find german-speaking actors but they don’t even attempt a German accent or maybe throw in a couple of German words and phrases into the scenes. It really takes you out of the scene sometimes. ",
            "review_date": "2020-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very powerful and emotional. The children actors were wonderful. And Vera Farmiga turned an award worthy performance. The ending of this film was gut wrenching.",
            "review_date": "2020-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Survival of the fittest or the Diary of a Nazi whimpy kid ",
            "review_date": "2019-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poorly researched. When creating Holocaust fiction, it seems especially important to get the background facts correct. In addition, as a teacher, I have had many students who have seen this movie as part of class. The universal take away seems to be pity for \"that little German boy who wasn't supposed to be there.\" The thought that everyone else who was murdered shouldn't have been there, either, doesn't even cross their minds.",
            "review_date": "2019-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just the ending they cant just do that but they did so sad the movie is unique because the story is told from the perspective of the son of a Nazi officer who doesn't know what is happening ",
            "review_date": "2019-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good, don't get me wrong. The twist, the story, the writing, the acting. It's good but it didn't really pack a punch. ",
            "review_date": "2019-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was an outstanding movie and it slowly builds up to a great ending, it depicts how the holocaust was really well. ",
            "review_date": "2019-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are movies that show the horrible situation in detail and then there is this movie. The \"simplicity\" of it all and what is happening in the scenes not shown on camera can give you a chilling feeling. And of course the whole point was to show what was happening through the innocent eyes of a child. The simple questions he is making trying to understand show how unbelievable and surreal it was. ",
            "review_date": "2019-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit slow at the beginning, but it still managed to keep my attention & peek my interest. The end has some shock value, and I would definitely keep the little ones out of the room while watching. But, I enjoyed this movie. I would recommend it and I would certainly watch it again.",
            "review_date": "2019-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the movie is very emotional and well executed, but lacks enough complexity and conflict to derive a 90 minutes feature.",
            "review_date": "2019-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not too thrilling but yet a very interesting story",
            "review_date": "2019-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slightly too naive to be believable",
            "review_date": "2019-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "See the world through the innocent eyes of a young child. The ending is extremely powerful. A must watch. ",
            "review_date": "2019-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Boy in the Striped Pajamas\" is a heavy film to take in but one that I definitely recommend experiencing. Like other movies about the Holocaust, this movie is very heartbreaking at times but the approach it takes is unique. This horrific time in history is shown from the viewpoint of an innocent child and that makes it even harder to watch at times. The movie can feel a bit slow paced at times but the story kept my interest throughout. The final moments of the movie were very emotional and I think the statement the movie tries to make is heard loud and clear. Overall, this is a very powerful movie about compassion and friendship that is tough to watch, but tougher to forget.",
            "review_date": "2019-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "book was better but it's still great",
            "review_date": "2019-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. This movie had been on a radar for years, and I finally saw it. This movie was incredibly well-done with an intense ending that brings the story full circle but for a movie that has a young protagonist and is rated PG-13, the story is VERY heavy and devastating. Not the kind of movie I could watch a second time but it was incredibly moving.",
            "review_date": "2019-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like the premise, a nazi soldier's son who happened to make friend with a jewish boy who live in a concentration camp, but somehow i can't accept the ending. I also think that the whole story is just another way to simplified the holocaust event, okay i know it's a family movie, but i think the scope can be more greater than this, since the ending i such a horrific one.",
            "review_date": "2019-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not a big fan of history films , but after all this movie did not look bad to me. I respects the director for takeing difficult topic.",
            "review_date": "2018-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "thats a perfect example how to make another holocaust movie without repeating or copying whats already on the market. why? cause it comes up with a new perspective trough the eyes of a young child which gives us a new sight on it. original concept and story with a shocking ending. have seen many films of this topic and thought there is nothing more to say about it. but this story told me otherwise. highly recommended!",
            "review_date": "2018-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this moved me so much! it shows a true happiness and sadness of a child especially during war. beautifully presented!!",
            "review_date": "2018-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well... that ending was messed up.",
            "review_date": "2018-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy in the Striped Pyjamas is the best of a few films that describe events of the Second World War telling us a little, but beautiful story based on the book called with the same name. Released in 2007, it stars Asa Butterfield as a young german boy and the english Jack Scanlon as a Jew child trapped in concentration camps. This drama/fiction movie filmed on the lovely landscapes of Budapest will surprise you apart from showing you the hard reality of the Jews at that time and will fill you with joy and passion for the feelings of friendship of children.\n\nAbout the actors and actresses, that play a fundamental role in this drama, are: Asa Butterfield as Bruno, he started his career at the young age of seven years, he participated also in interesting series like \"Merlin\" and memorables movies like \"Miss Peregrine's Home for Peculiar Children\" and \"The Ender Game\"; we can't forgot the incredible and satisfied paper of David Thewlis as Ralph, who act many times in the amazing Harry Potter's movies; in the other hand is Jack Scanlon as Shmuel, who start in action at the age of 9 in his first movie Peter Serafinowicz and finally is Vera Farmiga as Elsa, who played very important roles in movies like Dust and Down to the Bone that allow her to get the prize for best actress in 2007 on the Sundance Film Festival, also she participated in horror films like The Conjuring and its sequel. All of them, give a good performance, but the one that did his best was David Thewlis, he play correctly his paper, using the specific and the same characteristics of a commander in this time, serious, reserved, concentrated and responsible man.\n\nThis film was about Bruno, a young german guy; and his family that have to move to another house outside Berlin because Bruno's father job, so they have to say goodbye to all the things they started on this city. When, they arrived to their new house, Bruno didn't have anything to do, so he decides to explore a concentration camp in which all the jews are locked. There he made a friend called Shmuel and he plays with him any time he can. After some days Shmuel tell him that he doesn't find his father, so Bruno decides to help Shmuel and he enters to the concentration camp. This story ends with a very unexpected final, in which you will appreciate the true value of a good friendship. In my opinion it is a very interesting film, with a memorable story that invite you to reflect about how bad the Germans did at that time. Also it's represented very similar to the time in which it is set, so you feel that you are in this part of the world's history.\n\nSome aspects of the movie that are important to mention are the following ones: the scenography, in which I could see many beautiful landscapes and many things of the time like cars, telephones, clothes, houses and posters that make me feel inside the drama of this film; other good point was the soundtrack that perfectly accompanies each scene of this great movie and finally the special effects that were good for the time when the movie premiered, but they could improve. The best scenes of this film for me were two, in the first one Bruno was putting some food in his bag, when suddenly his mom appeared and asked what he's doing, at this moment it seems that she had already discovered, but Bruno, very clever, manages to save himself using a good excuse. And in the second one Bruno and Shmuel were playing with the ball, passing it from one side of the wall to the other, show us the friendly relationship that they have no matter which are their religions. The solidarity, brotherhood, empathy and being fair (human rights belong to everyone) are some of the emotional effects that produce this film on you because it shows how jews were treated at that time, all the things they mention about them, until the point of not considering them people, they followed the wrong way and this movie reminds it to us, to not make the same mistakes. \n\nI think many people will see this film because of its huge emotional value and its interesting history. About the fans of this film they feel very satisfied, even nowadays is not one of the best films, it makes you reflect and watch how were many things in that time. This I give this film a 4 out of 5 stars. \nBy: Jose Karlo A.",
            "review_date": "2018-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart-wrenching and tragic tale is successful in envisaging the mad hypocrisy of the Nazi ideology, but only skims the horrors of the Holocaust.",
            "review_date": "2018-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, I've seen this at my middle school.",
            "review_date": "2018-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful film great acting and visuals the only downfall would be the realism of the story its self.",
            "review_date": "2018-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy In the Striped Pajamas Movie Review\n\nThe Boy In the Striped Pajamas is a movie about a young boy who is oblivious to the horrible things that are going on right outside his home. The young boy makes friends with another boy that is inside of a concentration camp. The boy doesn't know that this boy is a Jew and he doesn't know what was happening to the Jewish people right outside his house. Some may think that The Boy In the Striped Pajamas does not accurately represent the Holocaust; however, this paper will assert that the movie is an accurate representation of the events and emotions that occured in the Holocaust. The movie shows how we are not born with hate in our heart. Through an analysis of concentration camps, the Germans, and the Jewish people, this paper will show how although the events in this movie are fictional, they show the true emotions and represent the actions of the Holocaust.\nIn the movie the concentration camps are portrayed using pathos. All the same emotions that were in the movie were the truest emotions of those that were in the concentration camps. In the movie it says,\"Sitting around miserable all day won't make you any happier.\" This quote shows that although they were in a horrible situation, they made the most of what they had. The people in the camps did nothing to deserve the treatment they got. A little boy in the camp becomes friends with the son of one of the men doing this to the Nazis. They young boys feel love towards each other because to them they were the same. This supports the pathos because the emotion they feel of love towards each other shows that they were not born with hate. This connects to the thesis statement because the young people in the holocaust did not understand because they weren't able to comprehend that someone could hate them so much to do this to them. \nThe movie portrays the negative and hateful emotions that the Nazi Germans showed to the Jews. The Nazi Germans were taught to absolutely hate the Jews and they were taught that they were not human and therefore didn't deserve to live. In the movie, Shmuel says, \" The soldiers. They took all our clothes away.\" Shmuel is the little boy who is in the concentration camp because he is Jewish and in this quote he is talking to his friend that lives near the camp, his name is Bruno and they talk through the fence. This quote shows that the Nazis took everything from the Jews and this is what happened in real life. It supports the thesis because this is an accurate event that happened. The Nazis didn't care about the Jews so they took everything from them, including their clothes.\nAnother thing that is accurately represented in the movie is the things that the Jewish people had to go through and their feeling. In the movie Bruno is the son of a man that runs the camps. Bruno is questioning who the people in the camps are and his father said, \"Those people... well, they're not people at all, Bruno.\" This is exactly how the Jews were treated, like they were not human at all. The Jews in the movie are portrayed exactly how it was in real events. The movie is so sad and uses patos because the emotion and sadness that you feel helps you gain sympathy for those who had to experience this. The Jewish people did nothing to deserve this and yet they had to go through it. This supports the thesis because the events are portrayed with the same emotions as the real life events.\nAlthough many argue that you have to be in the moment to understand the feelings that are felt, the movie uses the perspective of the people that were that and use their feelings. In the movie it says,\"Don't make it worse by thinking it's more painful than it actually is.\" The jews in the concentration camps were in a lot of pain and the movie shows that. Although it is a fictional movie, The Boy In The Striped Pajamas helps you understand the emotions of those that had to go through the Holocaust. You can understand partially understand the emotions by watching the movie.\nThe movie The Boy In the Striped Pajamas portrays accurate emotions and events of the Holocaust by correctly portraying the concentration camps, the Germans, and the Jewish people. The analysis of these topics support the thesis because in the movie they are the true emotional and eventful representation of the Holocaust. The movie teaches us that we are born to love but throughout growing up we are taught hate. Some think that that emotions can be understood unless you are truly at the event, but the emotions in this movie are those of the ones who were there. The Boy In The Striped Pajamas fulfills its purpose of informing us of the horrible and tender moments of the holocaust through pathos. \n\f\nAnnotated Bibliography: The Boy in the Striped Pajamas\nBrooks, Xan. \"Film review: The Boy in the Striped Pyjamas.\" The Guardian, Guardian News        \nand Media, 12 Sept. 2008, www.theguardian.com/film/2008/sep/12/drama.family.\nThe authors general stance towards the movie is positive because he talks about how it treads a fine line that the fate hangs in the balance until the end. His opinion is that it shows accurately how the events of the holocaust took place. He likes how it keeps you guessing until the end and goes the least expected way. The new insight to the movie is that it is a kind if dark reimagining of the secret garden, and the events of the holocaust. And what was truly happening in Germany during World War II. His review is using ethos to portray the movie, he talks about the ethics. It is a secondary source because it is a review from someone that saw the movie. The strengths of the source are in his opinion of how it treads the fine line of fate. The weakness of his review is the length of it, because it is a short review.\nEbert, Roger. \"The Boy in the Striped Pajamas Movie Review (2008) | Roger Ebert.\" \nRogerEbert.com, 5 Nov. 2008, \nwww.rogerebert.com/reviews/the-boy-in-the-striped-pajamas-2008.\nThe authors general stance towards the movie is positive, because they talk about the powerful impact that the movie has because of the story being told through an eight year old's eyes and not an adult. This gives a new light to the events of the Holocaust because its not through the perspective of an adult, but a child. This review uses logos because it gives a lot of logical reasons why telling through a child's eyes can change what people think about certain events. The strength of this review is the powerful word choice and impact that it has. The weakness is that the article doesn't give much detail into other parts of the movie.\nHerman, Mark. \"The Boy in the Striped Pajamas (The Boy in the Striped Pyjamas).\" The Boy in \nthe Striped Pajamas (The Boy in the Striped Pyjamas) (2008) - Rotten Tomatoes, 8 Jan. \n2018, www.rottentomatoes.com/m/boy_in_the_striped_pajamas.\nThe authors general stance towards the movie is neutral, because they believe that it takes a unusual stance on the holocaust, and is very dark. They like the way it ends with a brutal final punch of a twist. The new insight is about the dark and unusual stance towards the holocaust, and the brutal punch of a twist at the end. His review uses pathos because he shows emotion in his word choice. This makes the reader interested by the way he explains the sad ending. The strengths of the review are the numbers it shows and the reasons that the movie was the percent it was. The weaknesses of the review are that it is very short and lacks a lot of detailed information. This is a secondary source because it is from someone who reviewed the movie and not the actual movie itself. \nO, Review A. \"Something Is Happening.\" The New York Times, The New York Times, 11 Nov. \n2006, www.nytimes.com/2006/11/12/books/Scott.t.html.\nThe authors general stance towards the movie is positive, because they talk about the exciting release of the book and movie. And give insight into the making of the movie and the story behind it. It goes into detail on the story of it and not so much the actual movie, but the backstory on it. The strength is the detail and length of the review. This review uses ethos because a credible source that is well known and liked is the author of this review. The weaknesses of the review are that it doesn't depict the events in the movie but the backstory. This review is a secondary source because it is someone who read the book and then wrote their own paper about what they thought about it, rather then being the actual book which is a primary source.\n\"The Boy in the Striped Pajamas.\" Metacritic, Miramax Films, 7 Nov. 2008, \nwww.metacritic.com/movie/the-boy-in-the-striped-pajamas.\nThe authors general stance towards the movie is positive, because they talk about how powerful the movie is at providing a look in the prejudice, hatred and violence affect innocent people. They like how the story is told through an 8 year old, and not an adult. The new insight into the movie is about how bruno and shmuel can have a great friendship even though bruno's dad is the leader of the concentration camp and shmuel is in the concentration camp. This is a secondary source because it is a review of the movie or book which are the primary source. The strength of this review is the powerful word choice in it. The weakness is that the review does not explain very well what it is talking about.",
            "review_date": "2018-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"It was a limp dick end to the night\" - Gavin Free",
            "review_date": "2018-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptionally dark and sad movie.  The two boys in this movie are very impressive actors and break your heart by the end of it.",
            "review_date": "2018-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well-done look at the loss of childhood innocence due to war and hatred that doesn't shy away from the realities Germans faced among themselves, and handles the topic of the Holocaust in a way that's both a good introduction and leads to a shocking ending.",
            "review_date": "2017-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It bugged me how most of the Germans had a British accent. I know that they are played by British actors and actresses, but they didn't even try at the German accent.",
            "review_date": "2017-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't finish the book when I bought it all those years ago as I was too afraid of the outcome.  I finally watched the movie. It's been a while since a movie has had an effect on me but the ending certainly did.  It was the last thing I thought of before I went to sleep and the first thing I thought of when I woke up and at various times during the day.  Never let something like this happen again.",
            "review_date": "2017-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Strength of Innocence Reigns Over All\n\n\tThe Boy in the Striped Pajamas is a film depicting the story of the Holocaust through the perspective of an eight-year-old boy, Bruno (Asa Butterfield). It was produced for the soul purpose of opening your eyes to the reality of not only the devastating times but also the reality through the perspective of an innocent child.\nThis mind-boggling film starts out with Bruno playing with his friends in Berlin, then coming to the realization that his family is moving to the countryside due to his fathers' (David Thewlis) promotion in the military. As his family arrives to the new house, Bruno discovers what he comprehends to be a farm. One with knowledge about the Holocaust will come to the realization that this \"farm\" is a concentration camp that Ralf, Bruno's father, is in command over. As they get settled into their new surroundings, Bruno begins to ponder about the \"farm\" in the distance. \nHe just moved away from his beloved friends, friends he grew up with. Now he is surrounded strictly by family and the people that work for them. All of these people seem to have their plates full, and never have time to spare a moment to play with Bruno. This leaves him to fend for himself when it comes to entertainment. Bruno loves adventure; he is always seeking new things to explore, which leads him to the concentration camp seen from his new house. \nWhen Bruno comes across this camp, there is a boy in \"pajamas\", Shmuel, (Jack Scanlon) sitting alone beside a pile of concrete blocks. Over the next several weeks, Bruno builds a friendship with \"the boy in the striped pajamas\" despite the enormous barbed-wire fence standing between them. During this time, there is an incident with Shmuel and a soldier at Bruno's home. Shmuel is not seen for several days after this. As an innocent boy, Bruno does not understand why his friend is no longer coming to the intimidating fence at the camp. One day he reappears and is more mournful than usual. Bruno learns of the cause for his newly made friends' emotions and decides he is going to help.\nDuring this time, Bruno's mother, Elsa (Vera Farmiga) comes to find out that the camp is killing Jews due to the lack of respect from a soldier when he proclaims, \"they smell even worse when they burn.\" Because of this gruesome statement, Elsa decides it is in the family's best interest to move away from the camp in order to raise Bruno and his sister, Gretel, (Amber Beattie) appropriately. The day that the three of them are scheduled to leave, Bruno escapes to the camp in attempt to help Shmuel. It is in this moment of the film that you really understand how devastating the Holocaust was. The next few scenes leading up to the end of the film unfold the reality of two innocent children trying to make sense of the evil in this world.\nAs I watched this film I continuosly compared it to The Book Thief, in which the young girl moves to Germany due to the loss of her mother and must find a way to survive. The girl in that film does not understand that the Holocaust is taking place; she is just trying to survive and does so because of her innocence.\nThis film not only expresses the heart-wrenching pain caused by the Holocaust, but also the innocence that the children had during this time. The Boy in the Striped Pajamas was not created in a way that tells the story of the Holocaust like the typical straight forward film does, instead it provides you with a new perspective, that of an innocent eight-year-old boy. A boy with the only intentions of exploring new places and creating new friends.\nIt takes a certain dedication to portray a story in a way that not only tells the history of the Nazis and Jews but also provides a perspective that the majority of people seem to forget exists. This film shows the strength innocence has in times of desperation, which is exactly why you should spare 94 minutes of your life to embrace the heart-wrenching reality of one of those innocent children during a life-changing moment in history.",
            "review_date": "2017-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to see this movie i have the book",
            "review_date": "2017-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I understand that this film is trying to tell the story from an innocent boy's point of view, but he's so unlikable, that it's difficult  to feel for him. And the relationship between the boys isn't exactly friendship. Bruno has one opportunity in the movie to prove he is a friend, and does just the opposite. He uses Shmaule (sp) for entertainment/company and Schmaule uses him for some food. I think the last 10 min of the movie is what leaves people feeling like it was a worthy movie....not me.",
            "review_date": "2017-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you consider how many ways this could have gone wrong, it's a real tribute to writer-director Mark Herman's judgment and skill that he has produced such a marvellous film. What could so easily have been mawkish and glib becomes genuinely affecting and resonant, with echoes of Whistle Down the Wind, The Go-Between and Spirit of the Beehive. A brace of excellent performances led by David Thewlis and Vera Farmiga, and another fine score by the late James Horner.",
            "review_date": "2017-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly moving story",
            "review_date": "2017-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About slow but understandable for this sort of film. Still enjoyable",
            "review_date": "2017-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too childish, not accurate (the boy prisoner spends all his days doing nothing), not a single guard around the fence. And all that posh British accent is such a put-off.",
            "review_date": "2017-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very sad at the ending",
            "review_date": "2017-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "interesting war film. enjoyed it.",
            "review_date": "2017-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A strong movie with a memorable end. It captures the innocence of childhood and paints a picture of the darkness of its time really well. A strong message told in a beautiful way.",
            "review_date": "2017-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tear-jerker if ever there was one!",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful, moving, and ultimately tragic story, a must see to understand why....no other words will do....",
            "review_date": "2017-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome story too bad it wasn't true would've made the Nazi think for the rest of his short life",
            "review_date": "2017-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Reflective, insightful and utterly heartbreaking. The Boy in the Stripped Pajamas is an interesting telling of one of the worst episodes in the history of human kind told from the perspective of a couple of innocent children. It is touching and devastating, but with several layers to be analysed. The two kids are great in their roles and Vera Farmiga is amazing as the mother. I love this film and, no matter how many time I see it, it breaks my heart every time.",
            "review_date": "2017-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "7/31/17 Netflix\nA moving story with a twist on the standard holocaust story. The ending was a total surprise and I wont ruin it with a spoiler observation. See this one, you won't be disappointed.",
            "review_date": "2017-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seeming like a fairly routine holocaust movie about a German boy who befriends  a Jewish boy through the fence of a prison camp, the proverbial trick up the sleeve is only revealed in the last 10-15 minutes. While the twist is unlikely, it is also not implausible and does wrangle empathy through the plight of the child protagonist.",
            "review_date": "2017-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie had a simple narrative but poorly executed. The ending also felt somewhat of a rush and could have been done differently.  Could have been fine if it was a short but full length film is pushing it.",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a rule, I procrastinate a movie until I read the book it is adapted from. The horrendous Holocaust quests are cloaked (exceptions) until the end in the book and the movie (more), aber this triviality was intended to focus on the 8 year old (9 year old in the book) & his same aged \nJew friend and to denounce the average Germans whose family heads were carrying out these delinquent \"enabling\" acts. Vera Farmiga and the kiddos are luminous with Bruno sporting Hitler~like hair. The final scene makes you crumble like wall of bricks but the film entireity was commercially exploited. My rating is 3.5",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its a bit touching but its a good movie",
            "review_date": "2017-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well made thought provoking film which in my opinion doesn't trivialise the holocaust in any way. Good acting and sets. Well filmed. Unlikely that security would have been this lax in a work camp and the end is a bit unlikely.\nNever the less a good film.",
            "review_date": "2017-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My opinion---\n\n\"The boy in the striped pajamas\" is a drama of war realized with the hands of a master by: Mark Herman, he knew how to put his sensibility on a subject that can not be more delicate than this black period of human history, with His deportations, his massacres, his pure horror. A very realistic and very hard movie on the concentration camps, and the story is really poignant, and the characters are well written and superbly interpreted by very convincing actors. Asa Butterfield in the role: Bruno and Jack Scanlon in the role of Shmuel (the Jewish boy) and Vera Farmiga in the role of Asa's mother and David Thewlis in the role of Asa's father. A movie that fills the spectator with emotion, a great film of its kind, because all these wars are also all the misfortunes of the world that fall on the heads of the innocent, a movie to be discovered absolutely for its sensitivity to the skin",
            "review_date": "2017-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply presented and extremely powerful in message.",
            "review_date": "2017-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is an interesting perspective on how the Holocaust was viewed from a particular family, proposing a moral conflict that highlights childhood innocence during the time and jumps feelings of guilt, questioning and rejection to what happened. However, the film is too simplified and limits a lot of issues that were necessary and did not expand or conclude at all. 73/100",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10/10. Ths film will have you in tears no matter how many times you see it. A brilliant masterpiece about a beautiful friendship that rises above the rivalry and politics during the holocaust & WW2",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never get bored watching this !!!",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an extremely important film, to say the least.",
            "review_date": "2017-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a devastating time and movie, well written and incredibly moving, very well acted.",
            "review_date": "2017-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacular! \nA must watch for drama fans! Very strong story.",
            "review_date": "2016-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tad simplistic in its approach of a very serious subject but I can't really fault the intention. The film is structurally well-made, the performances vary from adequate to exceptional, and the journey is solid in its pace. \n\nIf you can overlook the fact that the narrative seems intent on dictating our emotions by threads of forced melodrama, you'll do well to put this little depressive nugget of cinema on your \"to watch\" list.",
            "review_date": "2016-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A different take on WWII stories with a kids perspective throughout. There is a complicated friendship at the center, but the dark, twisted, and haunted ending puts the finishing touches on a crushing movie.",
            "review_date": "2016-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Writer and Director, Mark Herman directs a very great and emotional movie, that's very sad and executed very very well, and a perfect depiction of a fictional event, that takes place during a real event (The Holocaust).",
            "review_date": "2016-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well done. Emotional and thoughtful.",
            "review_date": "2016-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cried so hard watching this movie",
            "review_date": "2016-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film for children. An introduction to the holocauste that is on the charming side, with the proper ending. I think it want us to feel naive like the world was before knowing about the ultimate solution. And then present us the efficient technique the germans developped to make jew soap. Use some pre-soap jews to calm and egg the future soap into the \"showers\". Must have been quite the anticlimax in real life as well.",
            "review_date": "2016-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film for children. An introduction to the holocauste that is on the charming side, with the proper ending. I think it want us to feel naive like the world was before knowing about the ultimate solution. And then present us the efficient technique the germans developped to make jew soap. Use some pre-soap jews to calm and egg the future soap into the \"showers\". Must have been quite the anticlimax in real life as well.",
            "review_date": "2016-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely different take on a holocaust movie, surely unique in its own sense. The film moves along slowly but builds a nice relationship between a fortuned German boy and a Jewish boy in a concentration camp. What concurs might be one of the most horrifying things I've ever seen in a film, creeping up on you like a snake and finishes with an utter slap in the face. An extremely difficult film to watch, but a must see for those questioning the horrendous events of the holocaust",
            "review_date": "2016-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10/10 Best comedy ever. Would highly recommend if you want a good laugh.",
            "review_date": "2016-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shows the child's point of view on the side of who we assume to be the bad guys, and many of them are bad guys still. It was mostly obvious on what was going on, and had to remember that the movie is through the child's point of view.",
            "review_date": "2016-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was so sad but so good too at same time",
            "review_date": "2016-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a really powerful movie, from the eyes of 2 children in an age of sadness and depression.",
            "review_date": "2016-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy in the Striped Pajamas is heartwarming and has inspiring knowledge. This movie is breathtaking and an amazing movie about the Holocaust. I would very much suggest this movie.",
            "review_date": "2016-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty heavy handed, but I bawled by way through this.  Not for the weak of heart.",
            "review_date": "2016-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it started out as a sad cute story with lessons to be learnt , ended up with a shocking wake-up call that will linger in your head for days to come.",
            "review_date": "2016-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film never fails to make me cry. Plus Professor Lupin is a Nazi, so that's interesting.",
            "review_date": "2016-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "95%     The Boy in the Striped Pajamas is deep, touching, and emotional throughout. Sure to keep anyone engaged, as it touches your heart and destroys it at the very end.",
            "review_date": "2016-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is shellshocking to watch and some of the naivetÃ (C) shown by the young boy Bruno is very well portrayed and gives the movie an extra edge that most WW2 films don't have. Watching him explore as he finds his dad to be a 'bad man' is sad to watch. Some will argue that the ending is harsh or too fortune but I don't really mind. I do think, however, that with a better director this movie could have been something really special.",
            "review_date": "2016-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie!! Saw it many years ago and can't wait to re watch it Vera farmiga is an amazing actor",
            "review_date": "2016-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was ready to give this movie an easy 4 1/2-star review until I reached the last 15 minutes, where it sadly descended into one of the most ridiculous ploys to ever hit the screen. Talk about needless exploitative manipulation of the audience. Thank God I didn't buy into it. I wail at the drop of a hat - I'm talking Muppet movies and Campbell's soup commercials - but I was too busy rolling my eyes and feeling a bit pandered to to feel any raw emotion from what was happening in the story. It was a ludicrous plot point with an excruciatingly predictable outcome rubbed out by a director who thinks he's suddenly started shooting the next Schindler's List. I can't blame the actors, as they were all masterful, especially Vera Farmiga, and the young actors portraying Bruno and Shmuel. If the novel, which I have not read, has the same climax/resolution as this film, then I absolutely blame the author for this mess, and would have thrown the book in the fireplace after reading it. Perhaps it went into greater detail in why the \"decision\" (without spoiling anything) was even made in the first place, other than to give the characters a reason to reach the story's conclusion, and to make people reach for their Kleenex. If that's the case, then it's a shame, because thanks to this movie, I have virtually no desire to ever read it to find out for myself.",
            "review_date": "2016-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this website doesn't even let you watch movies it's rubbish",
            "review_date": "2016-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film!!! More often than not, children are the best judges of character, proving once again that hate is an acquired behavior, not inherited. Those kids flat out destroyed me. The story is told from an 8-yr old German boy's point of view...and it was superb!!!",
            "review_date": "2016-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tale of Friendship, Sadness and Love during the worlds Darkest Hour.",
            "review_date": "2016-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful movie. The irony of an innocent German boy being killed at the hands of the Nazis killing innocent Jews.",
            "review_date": "2016-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant and moving story line.",
            "review_date": "2016-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "War is said to either bring people together or tear them apart. The movie The Boy in the Striped Pajamas demonstrates both outcomes in a heart wrenching tale about a Nazi soldier's son and his unlikely new companion. The heartbreaking story begins in Berlin, where the son Bruno's life is that of an ordinary eight years old boys. All this will change once his Father asks the family to go with him on his assignment as a soldier during World War II, where the progression of tragedy begins. This tragic story is brought to life through many aspects such as acting, costume, and plot, all of which give the movie great emotional appeal.\nThis movie would not have this great emotional appeal if it were not for the actors. Asa Butterfield brilliantly portraits the son, Bruno. For such a young actor Butterfield shocks his audience with such great expression of emotion. Asa makes his act believable through his facial expressions and delivery of lines. Often when he speaks his voice echoes innocence and when appropriate, confusion. The main physical feature he uses to portray his innocence are his eyes. He often widens them in awe and uses them to connect with the audience by looking either directly in the camera or intently at the other characters. One of those other characters is his father, who is also a Nazi soldier, played by David Thewlis. As the story progresses David smiles less and less showing how the war is beginning to impact his character. He shows little reaction to the cruelty played out in the movie, hardly flinching. This stillness that David brings further portraits his character as a harsh, unforgiving Nazi soldier and starkly contrasts Bruno.\nThere is an even greater contrast seen between the Jewish and German characters in the film. This contrast is emphasized through the characters of Bruno and Schmuel with the use of costume and set. Bruno is a well dressed little boy, surrounded by a well dressed family, in a big beautiful house. While Schmuel, who lives but a mile away, wears rags in a fenced in suffering \"community\". While what they wear sets them apart, what really shows the social divide between the Germans and Jews is the wall around Bruno's home. When first driving up to the house it is evident that what is inside the boundaries of their home is vastly different from what is on the outside of it. This movie does a wonderful job in costume and set, setting up the movie for success in showing the social divide between the Jews and Germans during World War II.\nMark Herman, the director has a lot to do with the success of the movie as well. Thanks to him the plot progresses in a way that flows and wastes no scenes. The movie lets you see glimpses into how the war impacted each person's life differently. From the grandparents to Bruno's sister we get a taste of the many different perspectives on the war. While the movie could have expanded on the other character's experiences a bit more, having only a brief look allows for each scene to serve a purpose and avoids filler. Due to that success in plot the movies emotional appeal continues to be its best quality throughout the film.\nThis original idea to show a Nazi soldier's son and an eight years old Jewish prisoner leads the audience to feel great sadness. This sadness is not only drawn from the film but from a real history of hatred towards a people who were not understood. The Boy in the Striped Pajamas is not a movie to be watched purely for entertainment, but also to reflect on the past and on the actions of the Nazi's towards the Jews. That is what brings true greatness to the film not just the acting, progression of plot, and costume, but the historical accurateness.",
            "review_date": "2016-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the greatest asset \"The Boy in the Striped Pajamas\" has is the many perspectives it views the Holocaust from.  It brings a novel perspective to the Holocaust from the point of view of a German child, Bruno, while also showing us more typical perspectives, such as the perspective of a Jewish child in a concentration camp, the transformation of Bruno's sister due to brainwashing and propaganda, and the separation of Bruno's parents as duty to their country conflicts with morality.  This film's other assets are the wonderful performances of young leads Asa Butterfield and Jack Scanlon, and Vera Farmiga's incredible performance as Bruno's mother, which brings a lot of emotional depth to the film.\n\nIn short, \"The Boy in the Striped Pajamas\" is a touching, albeit predictable film with the beautiful message that if we could all be like children and look past cultural differences and see different people as human beings, the world would be a better place.",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think that the true devastation of what occurs in this movie can be too easily overlooked by the film's stilted intentions.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To sad for me, but still a pretty good movie.",
            "review_date": "2016-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sad movie but really enjoyed it.",
            "review_date": "2016-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can understand the intent of this film and the message it was looking to relay. Poorly executed, I felt neither connected emotionally to Bruno or Shmuel. While an attempt was made to show the awful things that happened in the holocaust , this film fell short. I feel as there was not enough representation of the atrocities and horrors committed in the concentration camps.",
            "review_date": "2016-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy in the Striped Pajamas is an incredible film. It is about the story seen through the innocent eyes of Bruno, the son of a Nazi commander at a concentration camp. Asa Butterfield and David Thewlis give excellent performances. The screenplay is well written. Mark Herman did a great job directing this movie. I was impressed with the friendship of the two boys. The Boy in the Striped Pajamas is a must see.",
            "review_date": "2015-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good holocaust movie with of course a tragic ending.",
            "review_date": "2015-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie of true friendship, that not even the worse kind of hate could destroy.",
            "review_date": "2015-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well-acted Holocaust film told from a unique angle, with emotional punches throughout, and an extremely shocking and devastating conclusion.",
            "review_date": "2015-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this with my 13 year old son tonight (who had seen it before and suggested I watched it). It's an extraordinary film which I hope everyone will see. Bravo to the folks involved in making it. If every family watched this with their beloved children perhaps some of the madness in the world would be seen more clearly for the madness it is.",
            "review_date": "2015-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good story with a powerful meaning, but unfortunately it tells too shallow, there's no strong connection between two boys, so the ending's power is nothing but a peaceful tragedy.",
            "review_date": "2015-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was almost devastating but hovered on the edge of the true horror. Some great performances and a thought provoking film nonetheless.",
            "review_date": "2015-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A poignant film everyone should see. If you think it doesnt matter what you believe provided you are sincere, watch.",
            "review_date": "2015-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderfully thoughtful film driven by the talent of Asa Butterfield as the young male lead.",
            "review_date": "2015-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think I was mentally prepared for this one having been given a few insights into the gut wrenching drama that would unfold, and it certainly was a sight that for some would have ended in sore eyes. Based on the well known history of the Nazis treatment of Jews within concentration camps, this sees the story of two eight year old boys that begin to build a friendship from opposite sides of the electric fence. Little do they know what the future holds for both of them, nor how their respective families are sworn enemies, and with the audience fearing the worst all the way through the movie, the inevitable is soon sprung upon us (with a little added twist for good measure). As racist as this may make me look, I didn't feel as affected as one should, but I believe that to be because it felt somewhat of a rushed conclusion. Don't get me wrong, the whole idea of this part of history is one of the most tragic known to man, but it didn't make the most of what should have been a long drawn out and emotional moment. You couldn't have asked anything more from two young actors, who played their part to the max, but the speed at which the events unfolded, with little time to reflect on what happened, really didn't do the rest of the build up justice. I truly thought this was a very captivating watch, which for an avid hater of history, is really saying something. The whole plot around the German boys family was well delivered, giving an engrossing sub story to what was really the main focus between the two kids. I didn't take my eyes off this for a second, and although you could argue that my opinion was possibly influenced by spoilers given prior to viewing this, I really couldn't help but feel it was lacking that little something to truly pull on the heart strings. Not really one to watch over again, as unfortunately the ending will never change, but definitely an educational spectacle, and a worthwhile recommendation.",
            "review_date": "2015-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a very sad story. I can never see the second time. Why can't we just like children?",
            "review_date": "2015-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As movies like To Kill A Mockingbird and The Fox & The Hound have shown, the best way to examine a contentious issue is by looking at it through the eyes of a child; an individual who is naïve, curious, and isn't afraid to ask the questions that adults would rather not answer. Such is the case with The Boy In The Striped Pajamas, a movie concerning that darkest of modern events, the Holocaust. My 2 biggest issues with the movie was the pacing and performances of the child actors, particularly the lead. He had a number of genuine moments, and by the end I felt quite strongly for him, but much of his delivery is too wooden to be believable, and it often looks as though he's reading his lines off screen. But the parents, especially the mother, played wonderfully by Vera Farmiga, who very often steals the show completely, are both excellent. The pacing is very leisurely, and it often feels like the film has no idea where it wants to go, simply bobbing along for most of its run time. But as I got to the end, I realised that might have been the intention all along. The movie would be worth watching for the conclusion alone, which ends the events on an incredibly bleak, heart-breaking note through the use of camerawork, music and acting. By the time the credits rolled I was still and silent, utterly unable to comment on what I'd just witnessed. It might be a one-time-only film, but it's one you won't be forgetting in a hurry.",
            "review_date": "2015-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some people may give it a good review just because it is about the Holocaust and therefore feel as though they should say it is good. Well, it isn't good. The performances are shabby, apart from the Mother and the Father on some occasions. The dialogue is awful, proved by the scene where they're placing drafts, and also when Bruno decides to go over to the concentration camp.",
            "review_date": "2015-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully tragic film!",
            "review_date": "2015-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome acting and a very nice representation of a kid's life.",
            "review_date": "2015-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thank U Bruno and Smuel for this great performence ! Great story ...stays hanging in my head ...that's the hole point of a good movie .\nSOMDVD",
            "review_date": "2015-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a heart wrenching movie about the friendship of two boys on opposite sides of the track",
            "review_date": "2015-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Described as a children's Holocaust movie, The Boy in the Striped Pajamas may be a tough sit-through for kids (especially the end, which is VERY sad). I think it's a powerful addition to the Holocaust movie genre. The ending, though depressing, is entirely necessary for the story. This is a moving, gut-wrenching tale of friendship, naiveté and innocence. You will cry.",
            "review_date": "2015-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film about an epic friendship that leads in a horrific tragedy. .  .",
            "review_date": "2015-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie seeing Nazi Germany through the eyes of an 8 year old. Good acting by the children in particular.",
            "review_date": "2015-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably my favorite Holocaust movie I've seen. Great characters, and a great story that will destroy your feels.",
            "review_date": "2015-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie I hear it is good",
            "review_date": "2015-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, certain things are simplified or \"glossed over\", but this movie is through the eyes of an eight year old boy who also has been sheltered.   Amazing film giving a different view of the holocaust: through the eyes of an innocent.  An innocent who has yet to be programmed by a horrible regime and seeks out to redeem himself to a friend.  Absolutely amazing.",
            "review_date": "2015-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching tearjerker that captures the book perfectly.",
            "review_date": "2015-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a well made movie that gave a very interesting perspective on the holocaust. The boy was a great actor and he was believably innocent to the situation. It is an emotionally moving movie without any graphic depictions of horrible conditions or poor treatment of the prisoners.",
            "review_date": "2015-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really want to see it and I am pretty sure that it is a good movie",
            "review_date": "2015-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised to see how deeply split the professional critics were on this remarkable film. But what disturbed me are just how much the detractors missed some of the key points and devices that to me were clearly on the minds of the movie's makers.  Even worse, some of these critics wandered into the very soulless lack of human empathy that allowed the Holocaust to take place.   You can go elsewhere to read the basic plot, which would be a good idea if you haven't seen the movie yet, as otherwise you will likely not be able to grasp the points I want to make in this review.  So let me take on some of the major objections in order to rebut them in earnest:  The Germans speak in perfect British accents. But how can the critics miss the obviousness of this device? It's not mainly to make the film palatable to audiences.  We've been conditioned to automatically associate heavy German accents with WWII evil. What good would it serve us to 'know' from the start, and even through the eyes of an innocent, trusting 8 year old son of a high ranking soldier, that his father and all he stands for is evil?  No!  We NEED to be massaged by the comforting regalness of that British accent into seeing everything and everyone around us as being good and noble.  The device works splendidly.  Another major criticism is that the story lacks credulity.  Oh, please! Have these dolts never heard of a morality tale that takes enough elements of reality to create a story that is compelling enough to make that reality MORE than documentary? That's the whole point of this film!!!  The Holocaust as seen through the eyes of two children here is miles beyond that horrid travesty \"Life is Beautiful\", the worst film about this historical event to have ever been made. And lest anyone think that we get coloring book people that are all good or all bad, every single character explored in depth here has both sides of their human nature seen. The death camp commandant is a loving father, tender in his interactions with his children.  His mother hates what he has become but blames herself for dressing him up in uniforms as a child. Before his wife becomes the 'good German' conscience, she relishes in the power and privilege that her husband's career brings. And most important, his young son betrays his Jewish secret friend at the very point that telling the truth would have protected the unfortunate boy.  Finally, the ending.  For that, you must see the film.  But to call it contrived, forced, unconvincing are all nothing but the conceits of a smug kind of critic who is lurking in the shadows looking for something to pounce on. Do we attack fables for not imitating historical life? That would be absurd!  So, ignore the critics who did precisely that here, and see this film.  The book may have been intended for older children and young teens, but the movie is every bit as much fitting fare for adults.  Life isn't always beautiful.",
            "review_date": "2015-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why did I watch this?!  Waaaaahhh!!!  Why???  Did I think I was turning on The Avengers?!  \n\nIn all seriousness, this movie was really great.  Not perfect in execution and it felt a little quaint at times.  That being said, there's nothing like a child's innocence to frame the most horrific moment in our history.  Oof.  Hard watch.  Glad I did.",
            "review_date": "2015-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is so good but so sad yall should watch it it will bring u balling in a pillow at,the end of the movie",
            "review_date": "2015-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm actually a bit surprised that before this, there hasn't been any World War II movies that is about the German people. There's a German film that is about Hitler and the nazis, and a film about a German, but never about the lives of the German citizens, just the Jews. The Boy in the Striped Pajamas is a great film that gives an idea about how German's lives were at during the war. Asa Butterfield and Jack Scanlon are terrific and they have great chemistry together. Vera Farmiga and David Thewlis are great also. The plot is not that special, but it's the kid leads that matter. It has a shocking end that probably would end up as a tearful moment. The characters are decent, and the writing is really good and Mark Harmon knows how to write children characters. The Boy in the Striped Pajamas proves that there's also stories about the German's lives during WWII.",
            "review_date": "2015-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I read the book and really liked it",
            "review_date": "2015-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only problem is that they use British actors with obvious British voices playing Germans...other than that it was great.",
            "review_date": "2015-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to watch it ð~¡ð~¡ð~¡",
            "review_date": "2015-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Told through a child's eye, this is in danger of becoming a little too 'safe', Bruno is a very naive 8 year old boy and when he is forced to move with his family to a house near the barbaric concentration camp, he befriends a boy called Shmeul who is a prisoner. Their friendship is never really fully developed as there are not that many scenes with them together, which was a shame as it would've made the final scene a lot more emotional. As with the atrocities that went on behind those fences all are kept off screen, it would of been a lot beneficial to see more of what they had to go through then be kept in the dark for most of it. I did like that not every person in the film agreed with what was happening, we know the Nazi's were an evil race but not everyone shared their views. This is a good film but from what I have gathered parts were missing from the book which would of made for a stronger emotional climax and a much better film.",
            "review_date": "2015-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I recently watched this movie with my brother and it was a fantastic, although very sad, movie. I was very pleased with the acting and the storyline. It was an emotional film, and as the audience, getting to know the friendship of Bruno and Schmuel was devastating knowing the inevitable. This movie was definitely a tear-jerker, but a great film.",
            "review_date": "2015-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "87%\nWatched this on 14/1/15\nThe Boy in the striped Pajamas is a haunting film about Jew Holocaust with a good ending. Although it has it's twists, it's extremely small running time fails to do enough justice to the theme it tries to convey, it should have been at least a 1/2 an hour more long. Also a bit more of the screen time could have been used for showing the interactions between the two boys as the central character only appears 1/2 an hour into the movie.",
            "review_date": "2015-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartbreakingly well done.",
            "review_date": "2015-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two boys in the different side of the fence of a concentration camp, with their innocent view of the war...",
            "review_date": "2015-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a great movie!! I wanted to see it after I read the book! I got it for Christmas!! ð???ð???ð???ð???ð???ð???ð???ð???ð???ð???ð???ð???ð???ð???ð???ð???ð???ð???ð???ð???â?¤â?¤â?¤ð???ð???ð???ð???",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best regards on all of the history movies",
            "review_date": "2014-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An eerie vibe comes from this movie of course, seeing as to how a child cannot make friends due to location and then is scolded for leaving the grounds whatsoever, and being shoved down his throat things children shouldn't have been learning so soon, but then again it was a result as to what happened in the end. This movie was a bit sad, but it was no tearjerker. It was an okay movie, and there wasn't really much more or less I could see happening otherwise. For all of what I have heard about it from the past my expectations were higher before watching it than to afterwards. It was satisfying if you want a sad Holocaust story to watch, a large scar on history. I don't think I'd be as hyped over it as others were, but that's just me. It was simple and delicate, the filming and lighting was good, and so were the actors and actresses.",
            "review_date": "2014-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two boys, innocent eyes, and the tragedy. This film is very very STUNNING!",
            "review_date": "2014-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pleasantly played tragic tale. Not sure about the British accents in what is supposed to be World War Two Germany! A Sunday afternoon sort of film.",
            "review_date": "2014-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a tough film for a family to watch. It turned the holocaust into a sob story, even though the holocaust is haunting and a tragedy, it could have dealt with the holocaust in a different manner. The ending is actually powerful though.",
            "review_date": "2014-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A surprisingly good WWII story told from the POV of a Nazi child growing up unaware of the genocide his father was a part of. It's a well made film with strong production design and stirring performances from the boys. There were many moments when I was blown away by the everyday details that made it feel so real and poignant. Definitely another great entry in the war drama genre.",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A haunting story about arguably the worst tragedy of humanity - seen through the eyes of a naive, but curious, eight year-old. \n\n11/30/14",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie about a terrible time in history. This movie shows the horror that was the holocaust while providing a twist at the end that will add an element of surprise and further highlight the worst parts of this tragic time.",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is very good and tugs at the heart strings",
            "review_date": "2014-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must watch film! Words can describe how amazing this movie is!",
            "review_date": "2014-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think my heart just stopped. Such a profound movie! There's no cruel animal on the earth than a human-being!",
            "review_date": "2014-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible story but very sad",
            "review_date": "2014-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once again, a brilliant movie. So sad though",
            "review_date": "2014-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very moving ending and sticks very close to the book. I just can't stop thinking about the ending and the acting is brilliant.",
            "review_date": "2014-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "World War 2 through the eyes of a German child. It was good but elements like the Germans speaking in British accents always bother me and take me out of the experience.",
            "review_date": "2014-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would much have preferred the film in German. More as a film rather than trying to pass it off merely as a movie. The story in itself is quite good.",
            "review_date": "2014-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a sad movie. Great storyline on a Jew and German coming together and showing friendship for it all to be taken away due to harsh Nazi rule",
            "review_date": "2014-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although these are fictional characters, it is set amidst a very real-life event, the Holocaust. Several films have been made about children from opposite walks of life becoming friend, but this film, about a German boy living near a concentration camp becoming friends with a  Jewish boy who is a prisoner inside one, is one of the best. The ending is also one of the saddest, most heartbreaking I've ever seen. 9/10.",
            "review_date": "2014-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very melodramatic but with a good cast reconstitutes one of the more events ever, making this movie interesting.",
            "review_date": "2014-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At the beginning of the movie was happy then 10 minutes into the movie it got sad because their was a natzi logo. Bruno is a cute little kid then when he meets the boy in the striped pjs the movie gets more sad. I hate Bruno's dad because he works for the natzi army. Really sad movie but great.",
            "review_date": "2014-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving film about WW II concentration camps seen with the eyes of an 8-year old boy from a Nazi family who befriends a boy in a camp.",
            "review_date": "2014-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong and powerful movie set during WW2, the holocaust through the eyes of an 8 year old German boy.",
            "review_date": "2014-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly dark, but respectfully honest.",
            "review_date": "2014-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very melodramatic but with a good cast reconstitutes one of the more events ever, making this movie interesting.",
            "review_date": "2014-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a good and sad movie",
            "review_date": "2014-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances by Asa Butterfield, Vera Fermiga, and David Thewlis. Very sad. Makes you think.",
            "review_date": "2014-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best World War II movies. It's incredibly sad, funny, and interesting.",
            "review_date": "2014-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't normally write reviews on films, but as my wife didn't know what to make of this film, I thought I would tell the world exactly why I think it's brilliant.  Let's start with the story: the story behind this film is clearly that of irony because (spoiler alert?) the boy is not a fallen hero who redeems the world with his sacrifice.  It's rare that we get to witness a screenplay based on a story of irony, and so I really appreciate this.  Next up is the ending.  My wife and probably many other movie goers would like closure on the story.  Perhaps a memo pre-closing-credits that would explain what was done about the situation.  Little do they realize, such a clumsy summation would destroy the powerful emotion attached to this ending.  I prefer to keep my mind blown for a minute thanks.  Last, the acting in this film is the only area I can say would need improvement because I found at some parts I was unconvinced by the acting and it gave rise to a deep inner conflict.  On the other hand, with the written material the actors were working with, I find it hard to believe that the cast could have sold the story better.  It really is a difficult sale.  Costumes, props, set, lighting and directing were all excellent and while I don't recommend this film for everyone, the people I wouldn't recommend it to I don't consider worth very much of my time.  Thank you Mark Herman.  This was a good film.",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must see - appropriate for all but the most sensitive/sheltered children.",
            "review_date": "2014-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An enthralling story.  Grabs and holds on to the heart strings.",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It could be so fictional but I love the movie.  The story itself is contagious and the  boys who played a big part of the movie is just something that will swoon your heart away.  Great actors. Vera, and David Thewlis, incredible actor, the story is just mesmerizing.",
            "review_date": "2014-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an incredible story.  No holds bar Hollywood this time round.",
            "review_date": "2014-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film made me both angry and sad at the same time -- and those are the two emotions that 'The Boy In the Striped Pajamas' carries with it. Even if the accents don't seem to match both the location and characters. These actors are all giving the performances, which are there. Making this movie a very emotional viewing experience.",
            "review_date": "2014-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this film. Such a sweetly naive child, in a dark and horrific time. Sad ending.",
            "review_date": "2014-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch innocence burn.",
            "review_date": "2014-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy In The Stripped Pajamas is a malevolent allegory that revolves around two vulnerable innocent kids. The ending result is tantalizingly beautiful, even with the darkest ending.",
            "review_date": "2014-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie killed me. It was so hard to watch but I couldn't look away. So powerful and deep. Just be ready to cry yourself to sleep.",
            "review_date": "2014-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent movie...  however the most depressing movie I have seen in a long time",
            "review_date": "2014-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story and visually very vivid...",
            "review_date": "2014-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i'm surprised it only have 63% here, watched it few years ago in middle school. i couldn't stop crying and smiling, i thought this movie was a masterpiece",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the ending is really touching",
            "review_date": "2014-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotionally attaching film, loved it but make sure to have a packet of tissues near by.",
            "review_date": "2014-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Boy in the Striped Pajamas\" presents a heartfelt historical drama that provides a commentary on the Holocaust. It's story has a slow start at first and waits a while before dealing into the depths of its subject. However, the film tells its Holocaust story from different points of view by its child actors which thus unlocks new perspectives and becomes engagingly suspenseful in the final act which leaves a thought-provoking response on its historical content.",
            "review_date": "2014-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ignorance is bliss. This is a movie that, yeah it's dark, but it's a bit predictable.",
            "review_date": "2014-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Left out a lot of information, but a very good book. I loved the book SO much. The casting was great.",
            "review_date": "2014-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An upper class German boy befriends a boy in a concentration camp.\nTold from the perspective of a child, the foolishness of the adults in this story comes in stark relief, which is one of the film's strengths, especially considering all the films made on this subject. Good performances by Vera Farmiga and David Thewlis hammer home the film's point.\nI did think that the conclusion was contrived and needed too much help from the protagonists' naivete in order for it to work.\nOverall, this is a strong, unique film about the Holocaust.",
            "review_date": "2014-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I think this is the movie I have been search for a long time, a heart melted story\"",
            "review_date": "2014-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy in the Striped Pajamas is an emotional, sad, and powerful film of the Holocaust filmed in the perspective of a little boy and his striking friendship with a jewish boy",
            "review_date": "2014-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very touching, haunting, sad yet moving and heartfelt movie with quite the unexpected twist at the end that surely packs a punch!",
            "review_date": "2014-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The young Asa Butterfield's acting is the only reason to watch this movie.",
            "review_date": "2014-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful film about innocence and ignorance.",
            "review_date": "2014-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow great movie but you will be upset that you watched it at the ending.",
            "review_date": "2014-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as deep of a film as you'd think. Slow and boring.",
            "review_date": "2014-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartbreaking film that, although it is based on a fictional story of a real life tragedy, manages to deliver a profound and poignant message of the agonizing consequences of the horrifying act of genocide and the devastation it caused.",
            "review_date": "2014-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing and incredibly sad!",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy in the Striped Pajamas is about a young German boy and how he befriends a Jewish boy in a concentration camp. It is a very good movie, containing fine acting and having actual emotion. This is one of the few films that made me care deeply about the characters, especially with the ending, but it's one major flaw it's premise. It shows the Holocaust through a child's perspective, and because of that, it doesn't show how bad the Holocaust actually was. However, The Boy in the Striped Pajamas is still a very good movie.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A surprisingly convincing acting job from the two child leads. Despite adding sub-plots that aren't truly finished (and not open-ended) throughout the first half, it's well-paced, it gets to the point, and it has an ending you'll need several boxes of tissues for.",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a moving story but with tragic themes and devastation. Worth the watch for sure.",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not without it's flaws. A story zeroed in on one boy and an overall tale of loss of innocence with a harrowing ending.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Karma at it's finest, AMAZING movie, this is a drama done well. Perfect dare I say.",
            "review_date": "2014-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruno is the 8 year old son of a nazi commandant. When his family is moved to the Polish countryside he befriends Schmuel, a young prisoner of the nearby concentration camp. Both boys are ignorant of their situations and learn more through each others experiences. \nIt's a touching story of friendship that leads to a gripping brutal finale. A view of war through the eyes of a child is never an easy take, but it is as poignant as any WWII tale.",
            "review_date": "2014-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very beautiful story - hope, humanity and innocence.",
            "review_date": "2014-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sad & touching. Didn't read the book, but this was enough of a journey. Hell of an ending that I kinda guessed, but it still was sad.",
            "review_date": "2014-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is one of the darkest films I've seen, but I don't regret watching it. what stood out to me were the amazing performances by the cast.",
            "review_date": "2014-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hideously brilliant. Another reason to not hide the truth from your children.",
            "review_date": "2014-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its relly good movie and sad",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a sad movie:'[ but its a 5 â~...",
            "review_date": "2014-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK I only gave one star because it was good until the last five minutes....WORST ENDING EVER!!",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A riveting yet heart breaking film from the eyes of a child who knows nothing of the world he's been placed in. The perspective of such an unknowing adolescent really connects you in a way you wouldn't think possible. This reminds us of the horrid experience the Jews had go through for reasons that will never make sense.",
            "review_date": "2014-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Looking at desolation and benevolence through the eyes of two innocent children, who, at the same, are looking for genuine love and care. The film successfully justified naivete and gave a shocking  denouement.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very interesting to see the various viewpoints of the family of a German SS Officer. I love films featuring children, so this film was enjoyable in a difficult kind of way. Very good movie and well worth seeing.",
            "review_date": "2014-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An atrocious chapter in world history viewed from the innocent eyes of the two kids. They are divided by both extremes of society but connected by their naiveness. Harrowingly unforgettable.",
            "review_date": "2014-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On par with 12 Years a Slave. Tough to watch, but well worth it.",
            "review_date": "2014-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocked silence for that ending...never saw it coming...",
            "review_date": "2014-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitlarious. Especially the end.",
            "review_date": "2014-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very interesting yet sad story. Very good scenography of WWII times.",
            "review_date": "2014-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Profound, and heartbreaking!",
            "review_date": "2014-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A star is born and his name is Asa Butterfield. This film is absolutely incredible. It feels very different from all other WWII movies. The end left me in stunned silence. The entire cast does a phenomenal job and is backed up with another amazing score by James Horner.\n\nWWII from an 8 year-old's perspective. This is brilliant.\n\nWatch this!!",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ugh  i had to watch some of this at my school today\n\nit kinda sucks but it isn't the worst film iv'e seen",
            "review_date": "2014-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an interesting film that I enjoyed watching. 4 stars from me.",
            "review_date": "2014-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheesy, sugar-coated, and poorly acted to the max. Why are British actors playing German characters? Book is better, movie is just plain overrated.",
            "review_date": "2014-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its really sad ,but its an amazing story.But it really touches my heartâ(TM)¥",
            "review_date": "2014-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some critics descibed it as an oversimplification of what was to be one of the most horrific acts ever committed by humanity. If my friends hadnt been with me I think I would have sobbed like a baby. Brilliantly devistating and really worth a watch.",
            "review_date": "2014-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good film but not as good as the book",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "British acccent nazis and really disappointing ending.",
            "review_date": "2014-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly unrealistic and the ending is rather contrived, nevertheless well worth a watch",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie manages to capture the Holocaust in a very quiet but still amazingly disturbing way, showing different prisons and different ideas of freedom.",
            "review_date": "2014-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cried at the ending!!! I loved the film and thought it was interesting!!! :-)",
            "review_date": "2014-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful and emotional drama based one a truly astonishing novel. Weaker on screen than on the page, but still hits hard and leaves a mark.",
            "review_date": "2014-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "interesting story about a concentration camp as seen through the eyes of a little boy",
            "review_date": "2014-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was so sad at the end",
            "review_date": "2014-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the cutest and saddest movie if ever seen. The story is breath taking, and the plot gives us a look on what took place in our very own history. A must see!",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "war through the eyes of child. wow!",
            "review_date": "2014-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully acted Holocaust tale that while has some great scenery still manages to play out as an average kids Schindler's List with a killer punch in the final act.",
            "review_date": "2013-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The simplicity and the innocence is heartbreaking.",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Childhood is measured out by sounds and smells and sights, before the dark hour of reason grows.\" That's the first line in this movie. And think if you were a boy, and grew up in the holocaust. When I was in sixth grade, my teacher had us read the boy in the striped pajamas. Yes, while the other kids read the Lightning Thief (a book I'd later read, and helped me becoming a writer) my class read the book about the kid in the holocaust. Then we all watched the movie, and it's pretty damn good. And as far as movie adaptations go, this is one of the best goes. It's not the novel, but it's the film version of the novel. Everything good about the book was used, and parts not as good were replaced, and it covered everything. That's how film adaptations should be. And from what I heard this movie is pretty well received, but I find that surprising since I expected most wouldn't like it because I kind of feel you'd have to read the book to really appreciate it. Anyway the movie is about a boy named Bruno, and his dad is a high class Nazi in a big situation where he must move his family over to a house next to nearby concentration camp to basically be the overseer. I'm pretty sure that's what he does anyway. But that's the thing, like the book, you almost see the movie through Bruno's perspective. You feel the pressure as people tell Bruno this backwards way of life, where Jews are evil, and not people at all. But before that happens, Bruno meets his friend Shmuel, a Jew in the concentration camp. Yes, Bruno nonchalantly walks up to the fence up a concentration camp, and he now has a friend. And that is the real picture painted. Two friends, on two different sides of a fence. That fence means everything, and nothing at the same time. Through the movie there is a lot of little arcs, and little information. And in movie form I'm surprised it works. And seeing Bruno in these situations where he doesn't really think much of something, when something really big actually happened, it really gets to you. I'll give an example. At one part Bruno falls off of this swing. The only other person around is one of the Jew house workers. Now, if he touches Bruno, he's fucked. But if he just let's Bruno sit there, he's fucked. But the guy's a former doctor, and he helps Bruno up, and heals his wound, and has a really good conversation with him. And little Bruno had no wonder at what he just started. But luckily the guy got off  free... for now. Carrying on! Also I'd like to talk about the acting. The kid who plays Bruno, he did fantastic. I think this was his first movie, and he didn't look at all like he was. I was so invested into his character he wasn't even a child actor in my brain anymore, he was way gone and he was just Bruno, the kid who played him didn't exist when he walked off set. Most child actors you hate, and also Shmuel does a pretty good job as well. In fact, everyone does good, and nobody really messes up. And this is one of those movies that are getting points just for making you think, and plucking at those emotional scenes. It's dramatic tragedy, and is frankly one of the most grabbing endings that stick with you. I do believe the book did grab that ending a little tiny bit better, but considering it's in firs-person, and the movie isn't so much about Bruno, the newer ending with additional footage that was kind of grabbing extra stuff is still very welcome as it is sad. So ladies and guys who are nicknaming them \"man tears,\" get ready to get some tissues. But another thing the movie captures is a lot similar to the quote in the beginning of this review. A childhood is based off of sounds and noises and pictures. Things we can't really understand. And this whole movie almost feels like one big memory that old Bruno is remembering, and is now making sense of. There are so many references to dark things, things he just doesn't get. But rarely does it get super dark and Nazi evil, for the most part it feels what I consider realistic. We remember the holocaust as this dark evil place, but in reality lots of normal things happened, there was just a big evil thing going on in the back of their brains, or under their nose. But occasionally there will be that guy, that one really racist dick or another (the teacher and others) who just say something that's really offensive. So it is emotional, and it is a good movie. And this movie I will remember as the movie I watched in my childhood that had linked with the book. I can't not remember it without thinking of the book and my old class, it's impossible. But movies are suppose to do that, they bring parts of our lives into them. And the boy in the striped pajamas is one of those movies that have a special place fore me.",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The heart of the film is the cruelty of the Nazi \n, but I think it's need more time to emphasize the content. \nThey should put \"a little\"more detail about the camp and the holocaust. \nAnyway, If we put negligible gaps or glitches aside, it's quite a good film\nfor present the inhumanity of the Nazi. The film is not deep, still it can be counted\nas the impressive one",
            "review_date": "2013-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Multiple layers of sadness which provoke a degree of introspection, imagining living in the setting which these characters lived, experiencing this film is for sure a cathartic adventure.",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A-\n\nA powerful story with great acting and a heart breaking ending. A must see!",
            "review_date": "2013-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel that a 4/5 is perfect for this movie, the two boy's where amazing and I really hope they get more roles in the future. I would buy it on Blu ray.",
            "review_date": "2013-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The boy in the striped pajamas is a beautiful film that directly confronts the inhuman acts of world war II from an innocent child's point of view. A striking film that will leave you frozen and speechless even after the film ends.",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit episodic and not that well constructed, but powerful and haunting",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very speechless and shocking movie! this movie has tagline \"The Film must been seen\" and i very agree. the issue of Nazi always interesting to make one idea of movie because the issue is sensitive and not forgotten, this movie success develop the issue very well and add new interesting issue which very match. this is very recommend movie you should watch. deep meaning of story and natural acting from two boys in this movie make this movie is very perfect. Deep moral showing on climax and this movie give us best way the ending should be. you won`t forget movie like this even you have been watched hundreds of movie thereafter.",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The last 5 minutes of this film = no words.......",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an outstanding film that deals with extremely serious subject matter in an interesting way.  Asa Butterfield gives an exceptional performance and Jack Scanlon is also very good in this movie. I highly recommend this drama.",
            "review_date": "2013-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the movie was so depressing at the end , it made me cry. its a great movie and those that have seen it made them cry as well.",
            "review_date": "2013-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Important period piece in my opinion. The naivety of the Children and the innocence lost at the end is horrifying. Great movie. A must see.",
            "review_date": "2013-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie about Nazis and Jews is always not a fun time. A movie about kids, especially one that is confused and doesn't understand what's going on who be friends a Jew locked away in a camp, now that's something worth checking out...be warned tho. \nThe Boy with the Striped Pajamas. The film is about a boy who's father is in the German military, high ranked and is forced to move away from his home in Berlin to be relocated closer to his home. We find out he actually works at a Concentration Camp holdings Jews. \nThe boy is curious and decides to wonder around where he finds the camp and becomes friends with one of the prisoners. A little Jewish kid. And that's the movie.\nThe film itself is fine, alittle slow but it's nothing special or something to hate on. Only thing is if you had a great day and feeling happy, do NOT watch this film. It will leave you depressed and sad and make you wonder why. \nOther than that, a fine film. A lesser harsher version of Shindler's List in my opinion.",
            "review_date": "2013-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful. Petty, trite trash made around the setting of the holocaust. COmpletely embarrassing.",
            "review_date": "2013-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A disney film abut the holocaust that tries a shocking ending. Useless and embarrassing.",
            "review_date": "2013-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending was quite disappointing.",
            "review_date": "2013-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although there are a few holes in the plot (how realistic is it that Bruno did not regularly give food to Schmuel?), I found this an interesting lens through which to look at the holocaust.  The relationship between the two boys lies at the heart of the movie, yet they seemed unusually distant.  After all, the movie seeks to examine the extermination of Jews through the eyes of children.  Vera Farmiga played her role well, as Bruno's mother, but I found the brilliant David Thewlis to be somewhat constrained by the role of Bruno's father.  An enjoyable film, though we must now be coming to the end of innovative ways of dealing with the holocaust on film.",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film made me cry.",
            "review_date": "2013-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have been meaning to watch this film for some time. I had heard such good things about it that I had high hopes. \n\nUltimately, by the end of the film I felt it was over hyped and didn't deliver enough of an emotional connection between the boys and the viewer. \n\nI thought there was so little in the way of positive reasons to like Bruno that by the end of the film I didn't feel any pathos for the way the film ended. \n\nIt was no comparison to Schindler's List or Saving Private Ryan.",
            "review_date": "2013-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All high schoolers should see this movie, incredible.",
            "review_date": "2013-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful story of innocence weaved in tragedy.\nVery well paced and build-up was amazing. \nThe abrupt ending effectively hammered the horrors of Holocaust into the minds of the audience.",
            "review_date": "2013-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story meant to be deep but is made so awfully shallow.",
            "review_date": "2013-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tragic, but it left me feeling that nothing had truly been resolved. Sure, everyone was upset, but had they learned anything? The only person who seems to have learned anything is the one that is dead.",
            "review_date": "2013-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a difficult movie to watch.  An extremely powerful movie though.  I want to read the book now and wish I would have prior to movie actually.",
            "review_date": "2013-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it a lot. The acting was phenomenal and the chemistry between the actors was amazing. But the Only thing that bugged me about this film was that it was based in Germany and everyone had British accents. Seems a little weird to me, but other than that it was fantastic!",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Low-key adaptation of the novel has an extremely disturbing ending.",
            "review_date": "2013-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. What a sad movie.",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the most painful movies I've ever watched, though it is nothing to do with the quality of it. The subject matter, and specifically the view of Jews as people by the son of a Germany commandant, is haunting and brutal in its simplicity. The make-up department worked wonders to make Shmuel look as broken and beaten as photographs from the war have shown. Though not perfect, this is a must-see movie.",
            "review_date": "2013-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely emotional movie. very well done",
            "review_date": "2013-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haunting and touching. A keen perspective on one of the world's greatest nightmares.",
            "review_date": "2013-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was absolutely amazing. I loved the emotion, especially at the end. The closing scene was perfect, it really set the final mood of the movie. The way it zoomed out of the gas chamber door, revealing the Jewish people's clothing. 5/5",
            "review_date": "2013-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some people are not meant to be parents.",
            "review_date": "2013-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lets make sure history doesn't repeat itself! :-|",
            "review_date": "2013-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I sas this and it spoiledy day in a good way.   it made me more careful and I was just so moved by tjis movie\nmust see",
            "review_date": "2013-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm glad I saw this, now I don't have to waste time on the book. Lately books and movies about the Holocaust are just emotionally manipulative and are just using this as a way to make money. Really sad.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whilst well-acted and carefully mounted, The Boy in the Striped Pyjamas loses some of the hard hitting undercurrents of the novel, but it's harrowing final act is suitably chilling.",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film relies on the performances and the chemistry shared between the two boys, their innocence and ignorance to what is going around them makes it even more emotional.",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you've already read the book, you know what happens in the end and you know how terribly heartbreaking and sudden it is. If you haven't, you're in for one of the most depressing films of all time. It truly shows the horrors of the Holocaust with a lot of emotional depth and one of the most shockingly disturbing endings in a PG-13 film I have ever seen.",
            "review_date": "2013-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shock, disgust, and anger was how I felt as the credits started rolling.  To have selected such an ending to this film, just utter disgust?but perhaps that's exactly the effect that was intended.  Although not foreign to the happenings during the Holocaust, but then taking the perspective of a innocent boy really does emphasize the absurdness of it all.  Humans are truly monsters, and this film is enough to make us shoot ourselves, but more practically reminds ourselves that we have no reason not to exercise equality.  It's been 70 odd years since World War 2 and we still discriminate, label, stereotype? what wasdone to the Jews, unforgiveable, the war is far from over.  I'm overwhelmed at the moment, perhaps I'm biased toward this subject, but the film did a heck of job making me feel so much at the end of it.",
            "review_date": "2013-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great movie! A tear jerker, make sure it's a box. To unlikely people end up as friends to the end.",
            "review_date": "2013-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ouch, Just...ouch\n\nThere are very few likeable qualities to this movie (albeit they are very likeable), but I don't think the movie does any justice. This event is over; it no longer relates to us; we don't see any admirable characteristics from any of these characters that save other historical fiction movies. And, this may have just been me, but here's my main problem: I predicted the \"tragic ending\" long before it occurred. This movie isn't sad - it is sick.",
            "review_date": "2013-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are not many movies that hold my attention captive from beginning to end, and of which as well grips and effects me so profoundly, and \"The Boy in the Striped Pajamas\" is just one such rarity...right up there with \"Schindler's List\".  The performance of the cast, especially the two little boys, was superb!  I highly recommend this movie, including young people.",
            "review_date": "2013-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "could have been better...hard to get to know the characters and care about them....",
            "review_date": "2013-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only thing that bugged me was the English accents of the actors (not that it can't be helped), and a few book inaccuracies.",
            "review_date": "2013-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cried at the end it was so sad but very food",
            "review_date": "2013-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only reason I have given this even half a star is so no one could think I had mistakenly un-highlighted all the stars. This is an example of utterly incompetent film making. The plot is, of course, the same beautiful one from the book, but it is debased and jammed in among excruciatingly poorly directed acting, and the script adaptation is merely passable. This is a watered down jarring version of a powerful story.",
            "review_date": "2013-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a good film. Excellent acting. Interesting plot about that period of time during the Holocaust. Loved the little boys especially Bruno. I would recommend this movie so much. Heartfelt.",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that is hard to watch, yet so incredibly important to.",
            "review_date": "2013-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best holocaust film I have ever seen. The relationship between the two boys is absolutely beautiful. It has an ending that is designed to shock.",
            "review_date": "2013-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie but horable ending",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the sadest movie ever",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RT gave this a 63%?!?",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one really hits you where you feel it. Quite the tear jerker, it shows you how cruel the time was, and the consequences of people's actions during the time of the Holocaust. It's quite the moving film.",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very sad and emotional film with good acting and great storytelling",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very slow pick up but not gonna lie ending almost had me in tears",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The purpose of movies is to entertain. This movie did not entertain me, it made me sick. It was just extremely depressing, which is what it was going for, and in that regard, the movie is a success. But I really don't think a movie's purpose should be to depress you, so I hate this movie.",
            "review_date": "2013-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Astounding, simply astounding.",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good, despite the extremely manipulative ending.",
            "review_date": "2013-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i love this movie. it says a statment that divides us. this world is cruel, what happens at the end is heart wrenching. i cried..obviously. those \"soldiers\" should deserve a little \"chat\". killing people over there race is absolutely stupid. i just wish i could be there for those little kids. i am so glad that these rules and laws had changed, but in every part of us...there is that desire to judge.",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh. My. God. One of the saddest movies I've ever seen. It was brilliant. That's all I can say. Great acting great story. It was just great.",
            "review_date": "2013-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very sad movie but I liked the book a lot better. But still a great movie.",
            "review_date": "2013-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit heavy-handed and the music goes overboard, but there's no denying the power of that shattering ending, which adds another whole star.",
            "review_date": "2013-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the movie.  The outfit, scenery, acting, makeup, and plot.  This is a very emotional movie with bruno not realizing how in his time that the world isn't what you call great and hard the hardships people face. Shmuel a young boy who is much wiser then bruno knows about and experiences these hard ships. The ending of this movie mad me ball into tears just a beautiful story, but a horrid reality",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it... It made my cry and I don't cry at much",
            "review_date": "2013-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ridiculously heart wrenching.",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's very sad at the end .It's really deeply moving film. One of the best dramatically war movie I've ever seen. I recommend the parents to watch this film - to understand kids and see friendship between two boys over the fence.\n-idea\nNever block kids 's thinking or idea , accept their opinion and has open discussion.",
            "review_date": "2013-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I have seen in 10 years .. Painfully endearing movie, heartfelt and deep. Everyone should see this movie",
            "review_date": "2013-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fairly good drama film about Jews in a war camp.",
            "review_date": "2013-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At first it starts out different than you think. But the ending will change you.",
            "review_date": "2013-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was POWERFUL had me in tears the whole time and the ending was just sad...",
            "review_date": "2013-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Speaking in an english accent...annoying",
            "review_date": "2013-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very tragic film shown through the innocence of children from opposite sides of the nazi germany war.",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that takes a different approach in its dealing with the Holocaust by making the event seem minimal yet powerful, while showing its effect on a family that the audience cannot help but like. At times, the growing friendship between the two young boys felt rushed and fake, but the movie's overall slow moving story line, however, is well worth the wait, as the final moments of the film are undeniably heartbreaking and left me speechless.",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, so unless you knew about a world war 2 gas chamber, you wouldn't understand the ending at ALL. And that's my problem. The ending. If Bruno took off the hat, wouldn't one of the Nazi's have noticed Bruno's BLACK HAIR IN THE CROWD OF A BUNCH OF NAKED BALD JEWS!?!?!?!?! Besides that, the movie's good.",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite good without being top end Holocaust fayre. Surprisingly lacks emotional punch at the end for some reason. Most interesting character is probably the mother/wife of the Death camp commander. The problem may be that the Holocaust doesn't need to be seen through the paradigm of a naive child for the injustice to resonate, so the storyline feels unnecesarily condescending. It's watchable though.",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such an amazing emotional movie. I agonist cried.",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing would make me happier but to see this movie, ive read the book and its great. Im ready to watch this movie though ive been told its very sad.",
            "review_date": "2013-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i think i can safely say that i enjoyed the movie more than i enjoyed the book. which doesn't happen often. when reading the book, i think i was too occupied with how the story was being written versus what the story was actually about; whereas the story caught me more while watching the movie. i still would have changed one or two things about it, but that's mainly because it's base off of the book. the movie was pretty good.",
            "review_date": "2013-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing but very distressing.  Asa Butterfield is a very talented actor, esp for being so young.",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deeply moving, almost as much as the book.",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a movie based on the holocaust",
            "review_date": "2013-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never saw that ending coming. As the credits are rolling, my heart absolutely aches. Not only is that part of history horrifying and heart-breaking, but seeing the war from this point of view was refreshing and deeply disturbing (in less obvious ways than other films). The innocence of both boys, their friendship, and the ultimate, devastating ending make this a film that will stay with me forever. Let us never forget the holocaust and those who have suffered because of it.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "must makes the film and very powerful screenplay, recommended for older viewers",
            "review_date": "2013-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a great movie with a surprise ending.",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely wasn't a waste of time. I never cry when watching movies. shed a tear on this one.",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen this many, many, many times. I simply adore this movie. It's such a beautiful tale of innocence, friendships, love, and tragedy. Yes, tragedy. It DOES deal with the Holocaust, after all. I really should read the book someday. Mhmmmm\n\nThe acting and script writing was wonderful. They picked a great cast. They picked a really good family...they look like a real family. Bruno looks like a spitting image of the \"mom\", while Gretel looks a lot like the \"father\". Which I think they did on purpose. \"Father\" is a Nazi and believes in the cause and the daughter takes after those thoughts and beliefs for a time. \"Mom\" at first is rather naive and innocent about what her husband does (meaning he runs the concentration camp a few blocks away), but then finds out and despises it and him, and then Bruno is similar. Granted he doesn't ever really understand what his father is doing. I loved Shmuel. Probably the cutest kid. Great kid to play the role, he did a wonderful job. I really wonder why none of the actors won an Oscar. Oh well.\n\nI have nothing to complain about. I just wish they would have played around more with Gretel's development as well. Oh well...also I hated the ending. Mind you, it was a FANTASTIC ending. However, I cry EVERY TIME! I've watched this well over five times now and I still cry like a child. I did watch this with Boyfriend on our second movie date a while back, so I had to restrain myself immensely. I also watched it in my Humanities class and the buff, football playing tough guy next to me even teared up a wee bit.\n\nOverall, this is one of my favorite movies. Top Twenty (I should make a list of my top twenty movies, so far).  It does have a rather sad ending, but it's just a great, great movie. If you like Drama or have any interest in History or just movie watching, you need to watch this. You will love it too. Out of five stars I grant this one 5 stars.\n\nFavorite Character(s): Bruno's Mom, Bruno's Dad (just because I adore the actor) Bruno, Shmeul (cute kid), and Grandma\nNot-so Favorite Character(s): Gretel. >.>",
            "review_date": "2013-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that at first starts out very slow and calm, but then picks up a bit once our leads confront conflict. This movie is scary, fantastic, depressing, and yet has this child like nature that pays off well throughout the film. The movie stars Asa Butterfield who really shines in this movie and also stars in another great film (Hugo, 2011). The movie is all on his shoulders and if not done right, the film would fall apart. But Asa Butterfield proves his acting chops (at a very surprisingly young age), and leads the film very well. The score by James Horner fits the movie perfectly setting the stage for the director and cinematographer to do a very good job.The supporting cast is also at first okay. Then out of nowhere, (right at the halfway point) the supporting actors and actresses bring on their A game which really pays off in the end. An ending that is terrifying, unexpected, and chillingly real of events that did in fact happen during WWII that still haunts victims to this day.",
            "review_date": "2013-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One\nOf the beat depressing movies I've ever watched. Just puts things into perspective of how brainwashed the Nazis were to the whole concept of the holocaust.",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sad and heartwarming at the same time, yet inaccurate at times.",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad considering the low budget.",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie but cannot watch it again. It was so sad & heartbreaking. Very moving and will surely bring you to tears in the end.",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real bitter sweet treat.",
            "review_date": "2013-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth a one time watch, but it is sad.",
            "review_date": "2013-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it as much as the book... Makes me cry every time :(",
            "review_date": "2013-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely educational story  about the friendship between the son of a Nazi commandant and a Jewish prisoner prepared to be exterminated. A clear explanation of the Holocaust in World War II before striking it's killer punch in the final moments.",
            "review_date": "2013-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Boy in the Striped Pajamas\" occasionally feels like a great short film padded out to full length with some superfluous subplots, but the naturalistic acting from the two child actors is remarkable. The central moral lesson has no subtly whatsoever, the script (particularly the ending sequence) is blatantly contrived, but the whole thing still worked for me. Not life-changing by any means, but a powerful story, well-told.",
            "review_date": "2013-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy in Striped Pajamas  captures the naivete and awkwardness of a child's view on the Holocaust with a callously powerful ending.",
            "review_date": "2013-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you want the definition of ironic, it would be the plot to The Boy In the Striped Pajamas. Everybody knows the story of Hitler and 1940's Germany. A military man moves his family out into the country so he can work at a concentration camp. His eight year old boy wanders off and finds the camp and befriends a Jewish kid from the other side of the fence. A combination of the child's naivety, strong story, and somber music makes this movie very powerful and brings a new insight to WW2.\nThe main force behind this movie and what really keeps it going is Bruno. He is the eight year old boy and the main character. He is forced to move away from his friends in Berlin and is looking for a new friend. He meets a Jewish boy in the concentration camp and he has no idea what is going on. He is young and knows little of the war and the terrible things his father and countryman are doing. There are moments in the movie where he asks stupid questions and it makes the audience just go, \"oh, no. I know the answer, how can you be so blind?\" Then I remembered he was eight years old and has no business knowing what is going on. His older sister is twelve and she gets it. She talks about joining the Hitler youth and she becomes war driven. She is being brainwashed and corrupted by the adults around her. Her whole existence is the show the vile works of the Germans in that time. It's odd how each character in the family is completely different, obviously it is on purpose.\nWe have Bruno, the main character who is completely blind and innocent. It is his blindness and innocents which makes the movie. Then we have the father, Ralph, who is also Professor Lupin in Harry Potter, just a side note. He is the definition of evil. He works at the camps. My favorite scene is when they are all at dinner and he basically interrogates one of his officers and finds out his father was Jewish. On the spot he has the man taken into the other room, beaten, and killed. It is a powerful scene and shows the reality of the situation. One could argue that it's not his fault because he is just following orders and Germany was corrupt by one insane tyrant, but that's not the point. This movie isn't about the war or Hitler or even the Jews. It is about the relationship between the two young children battling the odds Then there is my favorite character in the entire movie, and that is the mother. She is special so she gets her own paragraph.\nElsa is the mother of this family and she is protective of her children. She knows the danger bit is also blinded by her surroundings. She knows what her country is doing with the Jewish people but she has no idea that they are dying. She finds out that they are being gassed and burned and she flips out. This says a lot about her character and how she did not approve of her countries actions. This is a bold move by the director because he disproves the stereotype that everybody in Germany hated the Jews and approved of Hitler. She is a strong character an gives the movie a different edge.\nThe movie is a little slow at first and it takes a while for the backbone of the plot to kick in. This movie is 94 minutes and it takes a while before the two boys even meet and build their friendship. Another problem is the little screen time the little Jewish boy is in the movie. The title of the movie is about him and he isn't really seen as much. When he is on screen he tries to tell the truth to young Bruno. He is eight years old and he knows and understands everything that has happened to him. There is one point in the movie where Bruno messes up and it almost costs him his life. I like Bruno as a character but he was a coward and he made foolish mistakes. As the movie progressed I began to realize there were only two outcomes to this story and both are very sad.\nPacing problems, limited time with a main character and my major problem is the lack of character development. Every character with the exception of the mother is the exact same from the opening credits to the end credits. The father is a jerk. The boy is foolish and his sister is corrupted. This made the movie a little boring and even though it was a short film it felt really long. I wanted to see more but I can't think what else could have been seen. The strengths definitely outweigh the weaknesses but the weaknesses are still substantial.\nOverall, I did enjoy The Boy In the Striped Pajamas. The music added an emotional touch throughout and one thing you need to understand is that the main character is a kid and you need to think like a kid to understand what he does. By no means is this a happy movie, but more tragic with a few glimpses that would make any parent proud. Watch this movie but be warned, it is not for the faint of heart. The acting isn't anything remarkable, the characters are strong but have little development, but overall enjoyable. This movie gets the WillyT Honorable Mention.",
            "review_date": "2013-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, but the ending was not good for me.  I like a happy ending, however, there is nothing good that came out of the holocaust so I understand.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It plods along uneventfully building towards something profound that never comes. Ultimately, this film's goal is to make you cry and the sly underhanded twist it throws up in it's last 15 minutes will succeed for many. However, once the tears are wiped and the kleenex tossed aside, TBitSP leaves you with nothing of tangible substance but the crease in your arm chair reminding you of the 95 minutes you'll never get back. Thematically, a complete dud and structurally sloth-like; TBitSP is to be avoided.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very moving story about war told from the point of view of a child.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a shocking unexpected ending...",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cried so hard during this movie.  I don't even have words to describe how beautiful and sad it was at the same time.",
            "review_date": "2013-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You don't need something grandiose or extravagant to touch people's heart. This film is indeed small compared to other holocaust films. But maybe its small scale is probably why it feels intimate and it touches right to my  heart. This story is interesting because it's being told through the eyes of a child, who didn't really understand what was happening around him. Just imagine one of the cruelest things that mankind had ever done being told from a very innocent viewpoint. Despite all the weird accents (the actors are soo british), this film is one of the best retelling of holocaust that I've ever seen.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well acted film that's real victory is not in trying to present sentiment in a clever ending, but rather one that shows the multiple levels of humanity. Each character has their own degree of good and evil and we are allowed to see the motivations of each.",
            "review_date": "2013-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching story, with a powerful ending. A great film once you get over people in Nazi uniforms speaking in English.",
            "review_date": "2013-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The negative criticism of this film seems to be because a) for a children's film the denouement is far too horrific and b) the film trivialises the holocaust. This film is, obviously, not a documentary, or a thorough look at the holocaust, or an exhaustive epic. Instead, it is a powerful, beautifully acted film largely seen from the point of view of an eight year old trying to make sense of something that doesn't, given conflicted information, or shielded, or subjected to dangerous propaganda, or denied voice (the mother is a particularly fascinating character, acted with quiet anger by Vera Farmiga). The ending is undeniably powerful but to say that it is \"too much\" is a condescending viewpoint of children and what they understand (which paradoxically ties into the film's very theme). Taken as what it is - which in no way is a criticism - this film is practically a masterpiece.",
            "review_date": "2013-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely moving and well-made!",
            "review_date": "2013-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boy in the Striped Pajamas is not only about Germany during the war, although the story it tells is heartbreaking in more than one way. It is about a value system that survives like a virus. I see this system with the eyes of an adults, but with the eyes of a children I see hope.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found the movie unrealistic because they had British people playing Nazis and in what world are Nazis British?",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To see the Holocaust in the point of view of a child showed how corrupt the Nazis truly were. Overall this movie showed the life of a Nazi and how they lived. This movie angered me.",
            "review_date": "2013-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending was the best..Shouldn't trade places.",
            "review_date": "2013-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie made me cry. Really good film.",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As dark as expected. Very good though. Attaches you to the characters then drags you in at the last.",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh boy, another weepy. Certainly food for thought, again.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The tale of the holocaust through the innocence of childhood. Not only is this film heart breaking but incredibly affecting. The performances were also impressive, Asa Butterfield in one of his first roles proves very effective and Vera Farmiga was exceptional as usual. An excellent adaptation of the haunting book, this film is horrible yet outstanding.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly moving, and well performed. I was wrong, apparently a PG-13 movie could be made about the Holocaust, and still have enough of a resounding effect.",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having recently read the book I decided to watch the film. I think the film captured the book well, portraying Bruno's blundering innocence, which verges on annoying, when he doesn't grasp perhaps not exactly what is going on in the \"farm\" next door, but at least that it is not a bed of roses over there like he seems to think. The film portrayed the ending well, although deviated slightly from the book for a more dramatic impact.",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was great. Everything from the characters to the story were all amazing. I liked the concept of the German boy and the Jewish boy becoming friends and the awful consequences that came with it. This movie was very moving and it's hard to forget. Grade: A",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie about WW2. very thoucing, very high recomended kind of movie. :)\ni was cry at the end of the movie. very good job. awesome :)",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you finish the movie ,some of the scenes will keep bouncing in your mind",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No argument that it was filmed beautifully and performances were strong - the kids especially - but it was so in your face 'this is a great movie' that as a result it didn't feel like a great movie. Lesson: ignorance is bliss... then death I guess.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its not too bad...but i did find myself being disappointed....too simple a storyline to be a hour and half long. It also had overuse of piano music slapped on it...waaaay too much piano music...would prefer no music on a lot of these scenes.",
            "review_date": "2013-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this with friends and no one said a word for minutes after this movie.Emotionally draining powerhouse of a movie.",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching film, with a real heart breaking ending. The story is a bit dull, but uses a lot of elements from the Holocaust while showing it from a different point of few.  The characters are pretty good, and the film style fits really nicely. There are some gaps throughout the plot, but by the end, it's a emotional yet enjoyable film.",
            "review_date": "2013-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Popularity of a Labrador, bravado of a Bulldog, confused as a Cockerpoo and Totally Shih-Tzu.  \n\nThis WWII drama follows Bruno and his German family from their family home in Berlin to their new house following his Father's promotion.  His Father is presumably an SS Officer and he is to become the new Governor of a concentration camp (loosely based on Auschwitz).  The new home is next to the camp and the audience watch as Bruno slowly finds out more and more about the situation as the wool can no longer be pulled over his eyes.  It is very much a movie about viewing the holocaust through the eyes of a child.  When he views the camp for the first time through his bedroom window (having been shielded from the truth by his parents) he thinks he can see farmers tendering the land in their nightwear. \n\nI am very interested in anything related to the Second World War.  I really wanted to like this film, but I can't; 'cos it's crap. \n\nMany people who have seen the film find it shocking.  I must admit that I did too.  We see the Swastika's flying on the red Nazi flags, the German troops and are aware we are in the German capital in the 1940's.  The first man opens his mouth to speak and out flows the English language.  I found this shocking, but was intrigued to see how this would work.  \n\nAs the film continued my irritation was building to a crescendo.  It's not like Schindler's List where, everyone speaks with various accents, but speak English as it's an American Movie.  The Nazis  speak with the thickest of English accents, as do the Jews, the children and the rest of the world presumably.  It really is the clearest \"Queens English\", I can just image one of the SS officers turning to the other and saying;  \"Pardon me old boy, would you mind awfully if we stopped for a spot of afternoon tea before we stroll over the road and bump 'orf a couple of dozen gentlemen of the Jewish persuasion?\"\n\nImage a new movie is coming out called \"Churchill\", which is made by Germans but set in England.  Imagine that we're in the height of WW2 and the family gather around the wireless to hear our Prime Minister speak.  We hear him deliver his most famous of speeches - \"We shall go on to the end.  We shall fight in France, we shall fight on the seas and oceans, we shall fight with growing confidence and growing strength in the air, we shall defend our island, whatever the cost may be. We shall fight on the beaches, we shall fight on the landing grounds, we shall fight in the fields and in the streets, we shall fight in the hills;  we shall never surrender\". Now image that its delivered in the thickest German you've ever heard!  \n\nPersonally I find this aspect of the film insulting.  As a Brit and for the Germans.  It's not a subtle thing, its very \"in your face\" and clearly done on purpose.  It doesn't stop at the language either.  Everything about this movie wreaks of English culture. I did consider whether it was portrayed like this so the audience would relate more or perhaps to bridge a cultural separation.  But for whatever reason, it doesn't work and was a poor choice.  Especially in the scene where they view the film that has been made to eradicate peoples doubts in the camp - that its more of a holiday camp than a death camp. \n\nMoving on; everything from the acting, to the music, to the wardrobe is inaccurate, weak and feels like a cheap amateur production.  The story is supposed to be a tragedy, but I couldn't get into the film enough to feel anything.  It's just too unbelievable.  I can't believe that some of the actors were selected for their roles.  I just can't understand why.  Maybe they were the only ones to turn up on the day?  Jack Scanlon (Shmuel) is particularly bad.  As far as acting goes, I feel Henry Kingsmill (who played Karl) was the best by a long way.  More convincing than anyone else on screen throughout. \n\nFor me, the movie is all mixed up, back to front and round the wrong way.  Jewish characters played by clearly non-Jewish actors, the movie is all in English but the literature is in German, the German child is brunette and the Jewish child is blonde and most notably 6,000,000 Jews were murdered in the holocaust yet this is a tragic story of 1 Nazi child who was killed alongside.  \nIf you swap the Nazi's, the Jew's and the concentration camp for Al Qaeda, American citizens and the Twin Towers America would boycott the movie and label it as seriously poor taste.\n\nOn a positive note, I felt that certain scenes seemed metaphorical.  Which I found quite insightful.  Such as when Bruno (Asa Butterfield - one of the better actors in the movie) lies about being friends with Shmuel out of fear.  As maybe many Germans did at the time. \nI found the scene where his Father is deciding to \"come clean\" and tells his son; \"Those people ... are not really people at all\" quite a good reflection on how Germany saw Jews, as parasites.  I would have liked to see that scene go on a little longer.  Perhaps to answer some of the questions Bruno may have asked.\n\nI found it a clever idea that Bruno asked questions and in the lack of response the viewer seems to answer them in their own mind.  This way it becomes very personal.  It would have been very powerful, if it wasn't so transparent. \n\nIn short The Boy in Striped Pajamas strives to be a sentimental, heartfelt, shocking tale of discovery.  But is ultimately an unbelievable, naive, clearly fictional story that is only shocking to those previously unaware of the situation.  It loses marks for being unconvincing, making poor choices in direction, being weak throughout and personally found it insulting to me and the darkest hour of World War II.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the saddest movies I've ever seen.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A look at the Holocaust through the lenses of a young boy's mind as well as a look into the twisted and hypocritical mind of a family man Nazi soldier.",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting different point of view. Probably too sentimentalist and too slow.  Still, you may like it, although the execution is entirely clumsy.\nShocking ending.",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "everyone needs to see this moviebloge it sll time favorite movie",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie but the ending is very sad.",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The evil we do has a way of coming back to haunt us in the worst possible ways sometimes. This movie plays that out in a heart-wrenching fashion.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the Holocaust from the point of view of a child, which shockingly simplify the events in a good way. The brutality of the camps are enhanced by the innocence of the children involved in telling it to the audience. It also explains a lot how the general population didn't know well about it until the camps were liberated in the end of the war.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A difficult story but one that must be seen and pondered, and discussed. This affected the family for days, but spawned many deep discussions.",
            "review_date": "2013-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterful work of casting and art directing. Disturbing in its calmness and tolerant depiction of the most horrid slaughter known in modern history. Young Butterfield's eyes is another actor themselves. Farminga and Thewlis precisely shows the tender border between love and its collapse.",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply sad. Devastatingly beautiful. A very compelling drama.",
            "review_date": "2012-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is very difficult to watch at moments. You could say that there's nothing that can be said about II World War that hasn't been said already. But on the canvas of a friendship we wittness a family's road to hell. And hell is just a fence away...",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        }
    ]
}