{
    "title": "It Happened One Night",
    "rating": 8.4,
    "release_date": "1934-02-22",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "summary": "A spoiled heiress running away from her family is helped by a man who is actually a reporter in need of a story.",
    "critic_reviews": [
        "The combination of Capra’s playful sensibility, inimitable 1930s line delivery, and a screwball wit really come together here to capture lightning in a bottle.",
        "It’s every goddamn romantic comedy you’ve ever seen. They can all be traced back here, virtually without exception, for eight straight decades now. Technically, the film has never been remade, but that’s largely because, in spirit, it has never stopped being remade. Something so perfectly structured can support nearly endless variations. It’s timeless.",
        "As buoyant and elegant as bubbles in a glass of champagne, Frank Capra's sublime 1934 comedy, written by long-time collaborator Robert Riskin, survives triumphantly because of its wit, charm, romantic idealism and its shrewd sketch of married life.",
        "A must see.",
        "For a low-budget production of the early sound era — 1934, seven years after \"The Jazz Singer\" — It Happened One Night has a wide-open quality that’s miraculous under the circumstances. This comes through in Capra’s technique, like a long tracking shot that follows Ellie’s humiliating trek to a public shower, but it really shows in the film’s ambition to be about more than this one love story.",
        "[An] utterly beguiling film.",
        "One of those stories that without a particularly strong plot manages to come through in a big way, due to the acting, dialog, situations and direction. In other words, the story has that intangible quality of charm which arises from a smooth blending of the various ingredients. Difficult to analyze, impossible to designedly reproduce. Just a happy accident.",
        "Even now, It Happened One Night carries the unmistakable tenor of a breakout hit, fueled by confidently zippy repartee and manic comic invention that almost none of the innumerable pretenders to the throne of romantic comedy can match.",
        "Nothing can take away from the strength of Gable and Colbert's performances, the illusion of romance in their interaction, and Capra's deftness in crafting this kind of feel-good narrative. The screwball comedy elements work as effectively as the love story, which is a rarity for romantic comedies.",
        "The quick flow of comic incident through It Happened One Night reaches its fantastic conclusion...",
        "It Happened One Night is a good piece of fiction, which, with all its feverish stunts, is blessed with bright dialogue and a good quota of relatively restrained scenes.",
        "It Happened One Night is pure delight.",
        "Every line of dialogue is calculated bliss, the chemistry between the leads is magnificent, and the backdrop of Depression-era America allows for a prescient and amusing subplot about how well-heeled urbanites are compelled to misbehave when they have no money in their designer pockets.",
        "This is Capra at his best, very funny and very light, with a minimum of populist posturing.",
        "The direction is excellent. Frank Capra never lets his picture lag for a moment. It is never very exciting, but it moves along snappily and it is full of amusing situations."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "From the director of the timeless classic that is It's a Wonderful Life, comes It Happened One Night, a wonderful film that is as charming as it is funny. While some parts are quite idealistic, it is essentially a screwball romantic comedyFrom the director of the timeless classic that is It's a Wonderful Life, comes It Happened One Night, a wonderful film that is as charming as it is funny. While some parts are quite idealistic, it is essentially a screwball romantic comedy and a great one at that. The direction from Frank Capra is classy and dignified and cleverly gives us an insight into gender and class status, and the screenplay is sophisticated and funny. The humour still works, I found myself laughing when Clark Gable said \"now don't tell you're in love with the bus driver\" for example. The cinematography is beautiful and dynamic and the music is richly and sensitively scored. The acting is very, very good. Clark Gable looks handsome here, and he gives a close to hysterical performance as Peter, with his impeccable comic timing and witty humour. Claudette Colbert is lovely as Ellie, the spoiled yet somewhat independent heiress who Peter falls for. The two actors show great, charming chemistry together on screen, and they are terrifically supported by especially Walter Connolly as Andrews. The story is relatively simple, but I liked its simplicity, it was effective. Overall, a wonderful, funny and charming film. 10/10 Bethany Cox",
            "review_date": "2022-03-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Even for the time it was released, I find it surprising and refreshing that it provokes a genuine interest in the lead characters, making their idyll perhaps a bit idealistic, but hey, it was the 30s, and above all the notable lack ofEven for the time it was released, I find it surprising and refreshing that it provokes a genuine interest in the lead characters, making their idyll perhaps a bit idealistic, but hey, it was the 30s, and above all the notable lack of cynicism.It was charming for its time, and still works.",
            "review_date": "2021-05-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "a soothing and independent night..It Happened One Night\n\nThe conversations are practical and sensibly written and addition to that the hilarity that it ensues doesn't seem forcibly installed and makes it look like ridiculous but insteada soothing and independent night..It Happened One NightThe conversations are practical and sensibly written and addition to that the hilarity that it ensues doesn't seem forcibly installed and makes it look like ridiculous but instead keeps it grounded; which audience resemble with, that is supported by the pragmatic characters and the world that they reside in. The writing is strong and witty especially which is clearly visible when it offers a similar gravitas to the supporting cast to factor in on drama and comedy too. It isn't shot nicely and the camera work could have been a lot better but it surely is edited perfectly. The execution by Frank Capra is apt for the script and bodes well with the tone throughout the course of it as he keeps it light and breezy. Clark Gable is as always convincing on his portrayal and so has been Claudette Colbert on her parallel role with him as a bratty celebrity. The only missing puzzle is the stakes that are projected in here are taken lightly by the characters and the makers which clearly isn't feasible at all. It Happened One Night is a soothing and independent night if not appropriately taken hold of.",
            "review_date": "2018-06-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Like a lot of films of the era, it's more or less entirely dialogue, and the dialogue is hammy and overacted.But, for reasons I can't quite explain, I did quite enjoy it. It's exactly the sort of film you could do the ironing to because itLike a lot of films of the era, it's more or less entirely dialogue, and the dialogue is hammy and overacted.But, for reasons I can't quite explain, I did quite enjoy it. It's exactly the sort of film you could do the ironing to because it doesn't take much concentration to watch.",
            "review_date": "2020-03-17",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 19
}